     H        1
      *****************************************************************
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas SE DPTMVD field set up')
     F*****************************************************************
     F*                                                               *
     F*  Midas - Security Trading Module                          *
     F*                                                               *
     F*  SE8030 - BLI SE4 DPTMVD Field Set-up for S01515              *
     F*                                                               *
     F*  Function: This program initialises the depot movement        *
     F*            value date with movement date in for an incoming   *
     F*            movement type and movement date out for an         *
     F*            outgoing movement type.                            *
     F*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     F*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 09Dec05               *
      *  Prev Amend No. 222727             Date 05Nov03               *
      * Midas Release 4.01.01 ----------------------------------------*
      *                 207006             Date 18Jun02               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CSE015             Date 06Dec99               *
      *                 CSE017             Date 20Oct99               *
      *                 CSE012             Date 16Aug99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
     F*                 S01515 *CREATE     DATE 10AUG94               *
     F*                                                               *
     F*---------------------------------------------------------------*
     F*                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  222727 - Release 5.0 errors  (Recompile)                     *
      *  207006 - Add Counterparty & Market Centre to SSI (Recompile) *
      *  CSE015 - Forward Valued Depot Movements (Recompile)          *
      *  CSE017 - Cum/Ex Indicator on Depot Movements (Recompile)     *
      *  CSE012 - SE Depot Movement Narratives (Recompiled).          *
     F*  S01515 - Trade/Customer Trades by Security Enquiries         *
     F*                                                               *
     F*****************************************************************
     FDPTMVD  UF  E                    DISK         KINFSR *PSSR
     F*
     E/EJECT
     E                    CPY@    1   1 80
     E**  Array for Object Copyright Statement
     E*
     C/EJECT
     C*
     C**  Copyright Statement
     C*
     C                     MOVEACPY@      BIS@   80
     C*
     C**  Entry parameters
     C*
     C           *ENTRY    PLIST
     C                     PARM           W0MODE  1
     C*
     C*================================================================
     C*   M A I N   P R O C E S S I N G
     C*================================================================
     C*
     C*
     C**  Process DPTMVD records
     C*
     C                     READ DPTMVD                   20
     C*
     C           *IN20     DOWEQ'0'
     C*
     C**  Initialise the value date
     C*
     C           DPVD      IFEQ 0
     C*
     C           DPMV      IFEQ 'DT'
     C           DPMV      OREQ 'WI'
     C           DPMV      OREQ 'BB'
     C           DPMV      OREQ 'RR'
     C                     Z-ADDDPMD      DPVD
     C                     END
     C*
     C           DPMV      IFEQ 'WO'
     C           DPMV      OREQ 'BL'
     C           DPMV      OREQ 'RP'
     C                     Z-ADDDPDO      DPVD
     C                     END
     C*
     C                     UPDATDPTMVDF
     C*
     C                     END
     C*
     C                     READ DPTMVD                   20
     C*
     C                     END
     C*
     C** End the program processing
     C*
     C                     MOVE '1'       *INLR
     C*
     C*****************************************************************
     C*                                                               *
     C*  *PSSR  -  Error processing subroutine                        *
     C*                                                               *
     C*****************************************************************
     C*
     C           *PSSR     BEGSR
     C*
     C                     DUMP
     C                     SETON                     U7U8LR
     C                     RETRN
     C*
     C                     ENDSR
** CPY@ - OBJECT COPYRIGHT
(c) Misys International Banking Systems Ltd. 2001
