      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas MQ RTEVENTS LF for event code option 2')
      *****************************************************************
     A*                                                               *
     A*    Midas - Midas/Q Module                                     *
     A*                                                               *
     A*    MQ543XLF  -  Subset RTEVENTS.  Dummy File for use          *
     A*                 in Event Selection Option 2                   *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  Last Amend No. CMQ001             Date 04NOV97               *
     A*  Prev Amend No. nnnnnn             Date ddmmmyy               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  CMQ001 - MidasQ rationalisation.                             *
     A*                                                               *
     A*****************************************************************
     A*
     A          R OPT2                      PFILE(MQ543XPF)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K MQID2
     A          K ECOD2
