      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_RB                                                        *
/*EXI *  TEXT('Midas MQ FF customer transactions')
      *****************************************************************
      *                                                               *
      *  Midas - Futures & Options Module                             *
      *                                                               *
      *   LF/MQFFCUST -  FF CUSTOMER TRANSACTIONS FOR MIDAS/Q USE     *
      *                     (RTALM SUBSET)                            *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      *  Prev Amend No. CAP086             Date 08Jun05               *
      * Midas Release 4.01 -------------------------------------------*
      *                 CAS002             Date 14Jan02               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 CFF007             Date 06Feb01               *
      * Midas DBA 3.02 -----------------------------------------------*
      * Midas DBA 3.01 Patch E ---------------------------------------*
      *                 170520             Date 12Nov99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CPL002             Date 08Mar99               *
      *                 CAP003            Date 31Jul98               *
      *                  CFF003            Date 11Apr97               *
      *                  CAC003            Date 25Feb97               *
      *                  CFF004           Date 11Sep96                *
      *                  077485           DATE 17NOV95                *
      *                  S71062           DATE 14NOV95                *
      *                  073714           DATE 01MAR95                *
      *                  S01411           DATE 08APR93                *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CAP086 - Introduce Auto Authorisation to the API's           *
      *           without it. (Recompile)                             *
      *  CAS002 - Hedge Strategy/Linkage (Recompile)                  *
      *  CFF007 - Futures and Options Enhancement for Private Banking *
      *           (Recompile.)                                        *
      *  170520 - Re-compiled over changed physical file.             *
      *  CPL002 - Midas-Plato Interface (Recomplied)                  *
      *  CAP003 - Recompiled for conversion of Midas inputs to APIs   *
      *  CFF003 - Enhanced OTC Processing - Phase II(RECOMPILE ONLY)  *
      *           Upgrade from BLI LBL001                             *
      *  CAC003 - Profit Centre Accounting Development Phase 3:       *
      *           Recompiled due to changes in TRANSD.                *
      *  CFF004 - Increase in size of Price Fields - RECOMPILE ONLY.  *
      *  077485 - FF/PM INTERFACE : MATURE FLAT POSITIONS NOT         *
      *           EXTRACTED FOR FF TRADES - JUST RECOMPILED           *
      *  S71062 - FF/PM INTERFACE.                                    *
      *           RECOMPILED DUE TO NEW FIELDS ON PF/TRANSD           *
      *  073714 - OTC ENHANCEMENTS (FILE RECOMPILED)                  *
      *  S01411 - RECOMPILED BECAUSE 'ORIGINAL ENTRY DATE' HAS BEEN   *
      *           ADDED TO TRANSD.                                    *
      *                                                               *
      *****************************************************************
     A          R TRANSDF                   PFILE(TRANSD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*
     A          K BRCA
     A          K CUSC
     A          K ISTT
     A          K YRNO
     A          K MTHN
     A          K PCAL
     A          K STRP
     A*
     A          O RECI                      COMP(NE 'D')
     A          O NOCO                      COMP(EQ 0)
     A*
     A** Omit if both Customer number & Broker number exist
     A*
      * Begin /CSD027/
     A**********S CUSC                      COMP(EQ 0)                                        CSD027
     A**********S BOCO                      COMP(EQ 0)                                        CSD027
     A          S CUSC                      COMP(EQ '      ')
     A          S BOCO                      COMP(EQ '      ')
      * End /CSD027/
