      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MG MT324 generation driver file')
     A*****************************************************************
     A*                                                               *
     A*  Midas - MESSAGE GENERATION
     A*                                                               *
     A*  PF/MGF324PD - MT324 GENERATION DRIVER FILE                   *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      *  Prev Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 137909             Date 16Jul98               *
      *                 088043             Date 14Jun95               *
     A*                 056739             DATE 16NOV93               *
     A*                 E29588             DATE 22OCT91               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits                  *
     A*  137909 - New currency field for EMU changes.                 *
     A*  088043 - Add Account Line for Beneficiary                    *
     A*  056739 - Add account lines to :56: and :57: on confos.       *
     A*  E29588 - POST-COLLECTION SWIFT RATIONALISATION AMENDMENTS    *
     A*                                                               *
     A*****************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R MGF324D0
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            MGBRCA    R               REFFLD(BRCA)
      * Begin /CSD027/
     A**********  MGCNUM    R               REFFLD(CNUM)                                      CSD027
     A            MGCNUM         6A
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A                                      TEXT('Destination customer')
     A            MGMODI    R               REFFLD(MODI)
     A            MGTNUM    R
     A            MGTDAT    R               REFFLD(DDAT)
     A                                      TEXT('Transaction Date')
     A            MGBRKC    R               REFFLD(BRKC)
     A            MGMDAT    R               REFFLD(MDAT)
     A            MGVDAT    R               REFFLD(VDAT)
     A            MGPCPL    R               REFFLD(PCPL)
     A            MGINTA    R               REFFLD(INTA)
     A            MGAMTT    R               REFFLD(PCPL)
     A                                      TEXT('Total Amount')
     A            MGRIBN    R               REFFLD(RIBN)
     A*********              START OF CHANGE               /056739/
     A            MGRIBA    R               REFFLD(RIBA)
     A*                      END OF CHANGE                 /056739/
     A**Start of change CGL029
     A**********  MGRONS    R               REFFLD(RONS)                                      CGL029
     A            QQRONS        12A
     A**End of change CGL029
     A            MGICBS    R               REFFLD(ICBS)
     A            MGINTR    R               REFFLD(INTR)
     A            MGIPFR    R               REFFLD(IPFR)
     A            MGNIDT    R               REFFLD(NIDT)
     A**Start of change CGL029
     A**********  MGPONS    R               REFFLD(PONS)                                      CGL029
     A            QQPONS        12A
     A**End of change CGL029
     A            MGPIBN    R               REFFLD(PIBN)
     A*********              START OF CHANGE               /056739/
     A            MGPIBA    R               REFFLD(PIBA)
     A*                      END OF CHANGE                 /056739/
     A            MGAWBN    R               REFFLD(AWBN)
     A            MGAWBA    R               REFFLD(AWBA)
     A            MGRVNO    R               REFFLD(RVNO)
     A            MGBENN    R               REFFLD(BENN)
     A*                                              Begin /088043/
     A            MGBENA    R               REFFLD(BENA)
     A*                                              End   /088043/
     A            MGTTYP    R               REFFLD(DTYP)
     A                                      TEXT('Transaction Type')
     A            MGTSTP    R               REFFLD(DLST)
     A                                      TEXT('Trans. Sub-Type')
     A            MGPOBR    R               REFFLD(POBR)
     A            MGCHTP    R               REFFLD(CHTP)
     A            MGROBR    R               REFFLD(ROBR)
     A            MGPSTM    R               REFFLD(PSTM)
     A            MGRSTM    R               REFFLD(RSTM)
     A            MGLORD    R
     A            MGCCY     R               REFFLD(CCY)
      *
      ** Start of E29588
     A            MGAVDT         5  0       TEXT('Amendment value date')
     A            MGASEQ         3  0       TEXT('Amendment sequence')
     A            MGEVTP         2          TEXT('Event type')
      ** End of E29588
      *
     A*                                              Begin /137909/
     A            MGSTCY    R               REFFLD(CCY)
     A                                      TEXT('Settlement Currency')
     A                                      COLHDG('Settlement' +
     A                                             'Currency')
     A*                                              End   /137909/
     A**Start of change CGL029
     A            MGRONS        18A
     A            MGPONS        18A
     A**End of change CGL029
