      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MG MTn95 Generation Extract File')
      *****************************************************************
      *                                                               *
      *  Midas - Message Generation Module                            *
      *                                                               *
      *  PF/MGFN95PP - Midas MG MTn95 Generation Extract File         *
      *                                                               *
      *  (c) Finastra International Limited 2002                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      *                 CGL013             Date 14May02               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL013 - MT94x Message Generation                            *
      *                                                               *
      *****************************************************************
     A          R MGFN95P0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2002')
      *
     A            MGUREF        16          TEXT('Extract Unique Reference')
     A                                      COLHDG('Extract' 'Unique' +
     A                                             'Reference')
     A            MGMTPY         3          TEXT('Message Type')
     A                                      COLHDG('Message' 'Type')
     A            MGDSTN        11          TEXT('Destination')
     A                                      COLHDG('Destination')
     A            MGNWRK         6          TEXT('Network')
     A                                      COLHDG('Network')
     A            MGBRCA         3          TEXT('Branch')
     A                                      COLHDG('Branch')
     A            MGRREF        16          TEXT('Related Reference')
     A                                      COLHDG('Related' 'Reference')
     A            MGQRY1        35          TEXT('Query Line 1')
     A                                      COLHDG('Query' 'Line 1')
     A            MGQRY2        35          TEXT('Query Line 2')
     A                                      COLHDG('Query' 'Line 2')
     A            MGQRY3        35          TEXT('Query Line 3')
     A                                      COLHDG('Query' 'Line 3')
     A            MGQRY4        35          TEXT('Query Line 4')
     A                                      COLHDG('Query' 'Line 4')
     A            MGQRY5        35          TEXT('Query Line 5')
     A                                      COLHDG('Query' 'Line 5')
     A            MGQRY6        35          TEXT('Query Line 6')
     A                                      COLHDG('Query' 'Line 6')
     A            MGTYPE         3          TEXT('Message Type being Queried')
     A                                      COLHDG('Message' 'Type' 'Queried')
     A            MGDTOM         8          TEXT('Date of Original Message')
     A                                      COLHDG('Date of' 'Original' +
     A                                                       'Message')
     A            MGNR01        35          TEXT('Narrative 01')
     A                                      COLHDG('Narrative' '01')
     A            MGNR02        35          TEXT('Narrative 02')
     A                                      COLHDG('Narrative' '02')
     A            MGNR03        35          TEXT('Narrative 03')
     A                                      COLHDG('Narrative' '03')
     A            MGNR04        35          TEXT('Narrative 04')
     A                                      COLHDG('Narrative' '04')
     A            MGNR05        35          TEXT('Narrative 05')
     A                                      COLHDG('Narrative' '05')
     A            MGNR06        35          TEXT('Narrative 06')
     A                                      COLHDG('Narrative' '06')
     A            MGNR07        35          TEXT('Narrative 07')
     A                                      COLHDG('Narrative' '07')
     A            MGNR08        35          TEXT('Narrative 08')
     A                                      COLHDG('Narrative' '08')
     A            MGNR09        35          TEXT('Narrative 09')
     A                                      COLHDG('Narrative' '09')
     A            MGNR10        35          TEXT('Narrative 10')
     A                                      COLHDG('Narrative' '10')
     A            MGNR11        35          TEXT('Narrative 11')
     A                                      COLHDG('Narrative' '11')
     A            MGNR12        35          TEXT('Narrative 12')
     A                                      COLHDG('Narrative' '12')
     A            MGNR13        35          TEXT('Narrative 13')
     A                                      COLHDG('Narrative' '13')
     A            MGNR14        35          TEXT('Narrative 14')
     A                                      COLHDG('Narrative' '14')
     A            MGNR15        35          TEXT('Narrative 15')
     A                                      COLHDG('Narrative' '15')
     A            MGNR16        35          TEXT('Narrative 16')
     A                                      COLHDG('Narrative' '16')
     A            MGNR17        35          TEXT('Narrative 17')
     A                                      COLHDG('Narrative' '17')
     A            MGNR18        35          TEXT('Narrative 18')
     A                                      COLHDG('Narrative' '18')
     A            MGNR19        35          TEXT('Narrative 19')
     A                                      COLHDG('Narrative' '19')
     A            MGNR20        35          TEXT('Narrative 20')
     A                                      COLHDG('Narrative' '20')
      * Begin /CSD027/
     A**********  MGDECN         6S 0       TEXT('Customer N. of Destination')                CSD027
     A            MGDECN         6A         TEXT('Customer N. of Destination')
      * End /CSD027/
     A                                      COLHDG('Customer No.' 'Destination')
