      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MG MT362 generation driver file')
      *****************************************************************
      *                                                               *
      *  Midas - Message Generation Module                            *
      *                                                               *
      *  PF/MGU36NPD - MT360/MT361 Generation Supplementary 3         *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      *  Last Amend No. 178970             Date 17May00               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CSW097 *Create     Date 20May99               *
      *  Prev Amend No. 000000             Date DDMMMYY               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  178970 - 'OTHR' to be used in ISDA Financial centre          *
      *  CSW097 - SWIFT 1997 Changes for FRAIRS MT34* and MT36*.      *
      *                                                               *
      *****************************************************************
     A*
     A                                      UNIQUE
     A          R MGU36ND0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            MGSEQN         5S 0       TEXT('Sequence Number in Extract')
     A                                      COLHDG('Sequence Number' +
     A                                             'in Extract')
     A            MGMSSQ         1          TEXT('Sequence in Message')
     A                                      COLHDG('Sequence in ' +
     A                                             'Message')
     A            MGISFC         4          TEXT('ISDA Financial Centre')
     A                                      COLHDG('ISDA Financial' +
     A                                             'Financial Centre')
      *
      *                                              Begin /178970/
     A            MGLOCN        30          TEXT('Location Name')
     A                                      COLHDG('Location Name')
      *                                              End   /178970/
      *
     A          K MGSEQN
     A          K MGMSSQ
     A          K MGISFC
     A*
