0001 H        1                                                           S01117
      *****************************************************************
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas RE Generated entries customer exchanges')        *
0001 H***********                                                         S01117
0002 F*****************************************************************
0003 F*                                                               *
     F*  Midas - Retail Module                                        *
0005 F*                                                               *
0006 F*  RE0350 - GENERATED ENTRIES CUSTOMER EXCHANGES                *
0007 F*                                                               *
      *  (c) Finastra International Limited 2001                      *
0009 F*      1990,1993                                                *
0009 F*                                                               *
      *  Last Amend No. 257012             Date 12Mar20               *
      *  Prev Amend No. MD050628           Date 26Jul18               *
      *                 MD043946           Date 08Feb17               *
      *                 MD046248           Date 27Oct17               *
      *                 MD030959A          Date 17Jun15               *
      *                 MD031950           Date 17Jun15               *
      *                 CGL120             Date 06Aug12               *
      *                 AR894859           Date 13Nov12               *
      *                 CRE041             Date 28Sep12               *
      *                 AR317301           Date 27Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      *                 257800             Date 19Nov08               *
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *                 248217             Date 08Jun07               *
      * Midas Plus 1.4 Base ------------------------------------------*
      *                 237304             Date 23Nov06               *
      * Midas Plus 1.3 ----------- Base ------------------------------*
0009 F*                 194873             Date 07Jul06               *
      *                 CDL049             Date 11May06               *
      *                 CSD031             Date 10Apr06               *
      *                 CSD027             Date 09Dec05               *
      *                 180832             Date 16Aug05               *
      *                 CER001             Date 16Aug05               *
      *                 CSW037A            Date 02May05               *
      *                 CSD025             Date 11Jan05               *
      *                 CSW037             Date 15Dec04               *
      *                 CSW036             Date 15Dec04               *
      *                 BUG4540            Date 18Oct04               *
      *                 BUG3907            Date 04Aug04               *
      *                 CLE025             Date 20Oct03               *
      *                 BUG2304            Date 30Apr04               *
      *                 CGL029             Date 01Sep03               *
      *                 CGL020             Date 08Nov02               *
      * Midas Release 4.01 -------------------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      *                 151104             Date 15Jun01               *
      *                 CDE002             Date 14Dec99               *
      * Midas DBA 3.02 -----------------------------------------------*
      *                 145389             Date 22Oct99               *
      *                 166138             Date 06Oct99               *
      * Midas DBA 3.01 -----------------------------------------------*
      *                 CGL007             Date 26Mar99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CSD005             Date 02Mar99               *
      *                 CTI002             Date 09Sep98               *
     F*                 120837             DATE 23FEV98               *
     F*                 129800             DATE 12FEB98               *
     F*                 CAC001             DATE 01FEB96               *
     F*                 S01408             DATE 17JAN96               *
     F*                 S01408             DATE 18OCT95               *
     F*                 S01408             DATE 05OCT95               *
     F*                 S01408             DATE 06SEP95               *
     F*                 S01408             DATE 20JUL95               *
     F*                 086125             DATE 16MAR95               *
     F*                 S01522             DATE 25JAN95               *
     F*                 S01408             DATE 08MAR95               *
     F*                 S01408             DATE 19AUG94               *
     F*                 S01413             DATE 13APR93               *
     F*                 S10736                  28OCT92               *
     F*                 S01255                  16FEB90               *
     F*                 S01182                  01DEC88               *
     F*                 E18408                  03JUL90               *
     F*                 S01117                  27NOV89               *
     F*                 E13327                  16JAN89               *
     F*                 S05452                  20AUG87               *
     F*                 E81077                  23FEB87               *
0010 F*                 E10051                  10DEC86               *
0010 F*                 S01111                  18JUN86               *
     F*                                                               *
     F*****************************************************************
     F*                                                               *
      *  257012 - Handle correctly 'C' and 'D' charges sign.          *
      *           Applied for MD-23223.                               *     
      *  MD050628 - FX Margin generated even if DCIN is BLANK         *
      *  MD043946 - Post to suspense account when the dr/cr account   *
      *             is flagged as Blocked debit/credit.               *
      *  MD046248 - Finastra Rebranding                               *
      *  MD030959A - Project values when requested during I/C.        *
      *  MD031950 - Recompiled due to changed PF/CUSEXZ1.             *
      *  CGL120 - GL COB Componenets Task Splits                      *
      *  AR894859 - Blanks in CLEARPD fields for GECEPD.              *
      *             Initialize fields LTAI XRFN and ACODQQ.           *
      *             Applied fix 249489. (Child: AR894860)             *
      *  CRE041 - Enhancements to Customer Exchanges (Recompile)      *
      *  AR317301 - Calculated amount in the RE0350AU report is wrong *
      *           - Re-init ZZAMT to 0. Applied fix 207233.           *
      *  257800 - Correction in length of OTRF.  Changed length from  *
      *           15 chars to 21 chars.                               *
      *  248217 - Reduce one space after to prevent printing of       *
      *           skipped pages in RE0350P1.                          *
      *  237304 - DR/CR Spot trade account postings should use DR/CR  *
      *           as the Value Date and not rundate.                  *
      *  194873 - Associated customer not output for Customer         *
      *  CDL049 - Addition of a Reference Rate field (recompile)      *
      *  CSD031 - Enhanced Centralised Static Data (Recompile)        *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  180832 - Output must be conditioned by *IN58                 *
      *  CER001 - European Reporting - BCL/CSSF Statutory Reporting   *
      *  CSW037A- Additional Field extended to 40 chars (recompile)   *
      *  CSD025 - Customer De-Activation                              *
      *  CSW037 - Additional Field Data on MT300/MT320                *
      *  CSW036 - Dual SWIFT BIC held on Client Details               *
      *  BUG4540- BCEQ entries generated with incorrect a/c code      *
      *  BUG3907 - Accounting entries are being posted against        *
      *            the branch 'From To' account instead of the        *
      *            trading equivalent.                                *
      *  CLE025 - Credit Lines                                        *
      *  BUG2304 - Various file layout changes. Recompile.            *
      *  CGL029 - Increase Account Code to 10 digits                  *
     F*  CGL020 - Midas Compliance Watch - Additional A/C Postings    *
      *           Information                                         *
      *  151104 - Increase size of branch code & related array so that*
      *           it can hold up to 900 elements.                     *
      *  CDE002 - Revenue Analysis                                    *
     F*  145389 - Customer Exchange Narrative should only default     *
     F*           (UDC or REPNAR) if no narrative was entered         *
     F*           for the appropriate side of the transaction.        *
     F*  166138 - Default customer exchange document number into      *
     F*           narrative when debit or credit posting narrative    *
     F*           is blank.                                           *
      *  CGL007 - Account Postings Enquiry                            *
      *  CSD005 - Standing Data Account Narrative.  Add new field     *
      *           to SDACODPD.  Recompilation of programs.            *
      *  CTI002 - Recompiled : File SDACODPD changed                  *
     F*  120837 - Incorrect narrative setting                         *
     F*  129800 - Pgm outputs 'Database Error' but no details, and    *
     F*           continues, if error in CBPNARPD. Amend pgm to set   *
     F*           on U7U8LR and terminate if database error occurs.   *
     F*  CAC001 - Profit Centre Accounting Development:               *
     F*           Print FX Margin Points field on the report and      *
     F*           generate FX Margin Posting.                         *
     F*           Setup Profit Centre of Generated Entries as follows:*
     F*           Retail or Nostro a/c - Profit Centre of account     *
     F*           Interbranch postings - Primary Funding Profit Centre*
     F*           Other accounts - Transaction Profit Centre          *
     F*  S01408 - Addition of core hook RE0350CP10                    *
     F*  S01408 - Addition of core hook RE0350CCP9                    *
     F*           Addition of core hook RE0350OOP4                    *
     F*  S01408 - Addition of core hook RE0350CCP8                    *
     F*           Addition of core hook RE0350IIP2                    *
     F*           Addition of core hook RE0350IIP3                    *
     F*           Addition of core hook RE0350IIP4                    *
     F*           Addition of core hook RE0350IIP5                    *
     F*  S01408 - Addition of core hook RE0350CCP6                    *
     F*           Addition of core hook RE0350CCP7                    *
     F*           Addition of core hook RE0350IIP1                    *
     F*  S01408 - Addition of core hook RE0350FFP1                    *
     F*           Addition of core hook RE0350FFP2                    *
     F*           Addition of core hook RE0350CCP5                    *
     F*           Addition of core hook RE0350OOP3                    *
     F*  086125 - Add new parameter to AOPNARR0                       *
     F*  S01522  -  Call to AOPNARR0 if switchable feature installed  *
     F*             and UDC present                                   *
     F*  S01408 - Addition of core hook RE0350IIPG                    *
     F*           Addition of core hook RE0350CCP4                    *
     F*           Addition of core hook RE0350OOP1                    *
     F*           Addition of core hook RE0350OOP2                    *
     F*  S01408  -  Hook RE0350OOPG added.                            *
     F*             Hook RE0350FFPG added.                            *
     F*             Hook RE0350CCPG added.                            *
     F*             Hook RE0350CCP1 added.                            *
     F*             Hook RE0350CCP2 added.                            *
     F*             Hook RE0350CCP3 added.                            *
     F*  S01413  -  Retail 3 Incorporation                            *
     F*  S10736  -  MANAGEMENT ACCOUNTS                               *
     F*  S01255  -  MIS 1 BD ENHANCEMENTS                             *
     F*  S01182  -  WRITES NEW ACCOUNT POSTING FIELDS TO THE          *
     F*             GENERATED ENTRIES FILE LF/GECE FOR MIS.           *
     F*  E18408  -  CUSTOMER EXCHANGE ENTRY(MULTI-BRANCH) CAUSES      *
     F*             AN IMBALANCE ON THE DAILY JOURNAL.                *
     F*           - ONLY PARTIALLY INCORPORATED DUE TO RELEASE        *
     F*             TEN CHANGES.                                      *
     F*  S01117  -  MULTIBRANCHING                                    *
     F*  E13327  -  FILE 'CEIP' IN PROGRAM 'F' SPECS IS DEFINED AS    *
     F*             256 LONG , BUT PF'S BUILT UNDER IT ARE 260        *
0009 F*             LONG.                                             *
     F*  S05452  -  INCLUSION OF AUTO RECONCILIATIONS.                *
     F*  E81077  -  PROGRAM DOES NOT PROVIDE FOR MULTI-BRANCHING      *
0009 F*  E10051  -  EXTRA CHAIN OF CLINT TO PRINT CR CUST NAME        *
0009 F*  S01111  -  ADDITION OF VALUE DATES AND CHARGES               *
0011 F*                                                               *
0012 F*****************************************************************
0011 F*                                                               *
     F*  C R E A T I O N     P A R A M E T E R S                      *
     F*                                                               *
     F*                                                               *
     F*****************************************************************
0013 F*EIP****IP  F     256  9AI     2 DISK                               S01117
0013 F***CEIP****IP  F     260  9AI     2 DISK                     S01117 CAC001
     F***CEIP*** IP  F     275  9AI     2 DISK                                         CAC001 CGL029
     FCEIP    IP  F     305  9AI     2 DISK                                                   CGL029
     F*                                                                   S01408
     F** Core hook for externalisation.                                   S01408
     F/COPY WNCPYSRC,RE0350FFPG                                           S01408
     F*                                                                   S01408
0014 FCLINT   IF  F     256  7AI     2 DISK
0015 F***TABLE** IF  F      96 12AI     2 DISK                                                CGL029
     FTABLE   IF  F     144 12AI     2 DISK                                                   CGL029
     F*CCNT***IF  F     400 15AI     2 DISK                         E81077S01117
     FSDBRCHPDIF  E                    DISK                               S01117
     FACCBR   IF  E           K        DISK                               CAC001
     F**  GL Accounts by Branch                                           CAC001
     F*                                                                   CAC001
0016 FGECEHH  O   F     160            DISK
0016 F**CEPD  O   F     160            DISK                               S05452
0016 F***GECEPD  O   F     200            DISK                      S05452S01182
0016 F***GECEPD  O   F     268            DISK                      S01182S01413
     F*                                                                   S01408
     F/COPY WNCPYSRC,RE0350FFP1                                           S01408
     F*                                                                   S01408
     F***GECEPD**O   F     279            DISK                     S01413 CGL007
     F***GECEPD  O   F     331            DISK                                         CGL007 CGL020
     F***GECEPD* O   F     589            DISK                                         CGL020 CGL029
     FGECEPD  O   F     620            DISK                                                   0GL029
     F*                                                                   S01408
     F/COPY WNCPYSRC,RE0350FFP2                                           S01408
     F*                                                                   S01408
0016 FGECEZZ  O   F     160            DISK
0017 F*E0350P1O   F     132     OF     PRINTER                      S01124S01117
     FRE0350AUO   F     132     OB     PRINTER      KINFDS SPOOLU         S01117
     FRE0350P1O   F     132     OF     PRINTER      KINFDS SPOOL      UC  S01117
0021 F* 01            CEIP HEADER RECORD
0022 F* 02            CEIP DETAIL RECORD
0023 F* 03            CEIP CLOSED RECORD
0024 F* 04            CUSTOMER MASTER FILE DETAIL RECORD
0025 F* 05            CUSTOMER MASTER FILE  CATCHALL
     F**06*******     ACCOUNT MASTER FILE DETAIL RECORD             E81077S01117
0026 F**06************TABLES FILE ICR 1                                   E81077
0027 F**07************TABLES FILE ICR 2                                   E81077
0028 F**08************TABLES FILE ICR 3                                   E81077
0029 F**09************TABLES FILE CURRENCIES RECORD 1                     E81077
0030 F**10************TABLES FILE BRANCH CODES                            E81077
0030 F* 10            BRANCH CODE ARRAY LOOKUP SUCCESSFUL                 S01117
0031 F* 11            TABLES FILE CATCHALL
0032 F* 12            CEIP TRAILER
     F**13*******     ACTIVE CEIP RECORDS FOUND                     E81077S01117
0033 F* 15            CEIP CATCH ALL
0034 F*    20         BLANK DEBIT NARRATIVE
0035 F*    21         ZERO OR BLANK DEBIT AMOUNT
0036 F*    22         ZERO OR BLANK CREDIT AMOUNT
0037 F*    23         BLANK DEBIT ACCOUNT NUMBER
0038 F*    24         BLANK CREDIT ACCOUNT NUMBER
     F*    25         BLANK CHEQUE NUMBER                                 E81077
     F*****26         EXCHANGE IS ACROSS TWO BRANCHES               E81077S01117
     F*****28         DEBIT BRANCH CODE = INPUT BRANCH CODE         E81077S01117
     F*****29         CREDIT BRANCH CODE = INPUT BRANCH CODE        E81077S01117
0038 F*****30*********CHARGES*SIGN*NON-BLANK*(CHARGES*APPLIED)*****S01111 CAC001
     F*    30         Charges Sign non-blank (Charges Applied)            CAC001
0038 F*    31         CHARGES SIGN '+'                                    S01111
0038 F*    32         CHARGES RETAIL ACCOUNT NUMBER IS ZERO               S01111
     F*    34         Margin is in debit currency                         CAC001
     F*    35         Margin is in credit currency                        CAC001
     F*  36           Analytical Accounting module is on                  CAC001
     F*  37           Chain fail on LF/ACCBR                              CAC001
     F*  38           Output Profit Centre of the account                 CAC001
     F*  39           Output FX Position Profit Centre                    CAC001
0039 F*      N40      FIRST CYCLE PROCESSING
0040 F*       41 42 43FAILURE OF CHAIN
0041 F*       45      DEBIT CCY EQUALS BASE CCY
0042 F*       46      CREDIT CCY EQUALS BASE CCY
     F*       47      PROFIT CENTRE USED = 'Y'                            S01117
     F*       48      CEIP TRAILER HAS BEEN READ                          S01117
0043 F*       50      BASE CCY HAS 0 D.P.
0044 F*       51      BASE CCY HAS 1 D.P.
0045 F*       52      BASE CCY HAS 2 D.P.
0046 F*       53      BASE CCY HAS 3 D.P.
     F*       55      INTERBRANCH ENTRIES TO BE GENERATED VIA MAIN BRANCH S01117
     F*               AND NEITHER DR OR CR BRANCHES = MAIN BRANCH         S01117
0047 F*       56      SYSTEM SUPPORTS BASE CURRENCY TRADE AND CONTROL ACCO
0047 F*       57      MULTIBRANCH INDICATOR = 'Y'                         S01117
0047 F*       58      MULTIBRANCHING OUTPUT INDICATOR                     S01117
     F*       59      P1 SPOOL FILE HAS BEEN OPENED                       S01117
0048 F*       60      CREDIT CCY HAS 0 D.P.
0049 F*       61      CREDIT CCY HAS 1 D.P.
0050 F*       62      CREDIT CCY HAS 2 D.P.
0051 F*       63      CREDIT CCY HAS 3 D.P.
0052 F*       70      DEBIT CCY HAS 0 D.P.
0053 F*       71      DEBIT CCY HAS 1 D.P.
0054 F*       72      DEBIT CCY HAS 2 D.P.
0055 F*       73      DEBIT CCY HAS 3 D.P.
0056 F*       74      DB ACCOUNT IS RETAIL
0057 F*       75      CR ACCOUNT IS RETAIL
0038 F*       76      CHARGES ACCOUNT IS RETAIL                           S01111
     F********77      LIVE CEIP RECORDS                             E81077S01117
     F*       77      PRINT BRANCH TOTALS                                 S01117
     F*       80      DR A/C BRANCH SAME AS CR A/C BRANCH                 S01117
     F*       83      TRANSACTION BRANCH = DR BRANCH                      S01117
     F*      N83                         = CR BRANCH                      S01117
     F*       86      BRANCH ARRAY FULL                                   S01117
     F*       90-99   USED IN STANDARD SUBROUTINES                        E81077
0058 F*             L1 CHANGE OF BRANCH
0059 F*             U1 END OF DAY - PRODUCE GECE
0060 F*             OF OVERFLOW
0061 F*             U8 FILE CONTROLS OUT OF BALANCE
0019 E                    INT         2 15 0
0020 E                    DEC         2  3 0
0068 E***********         BCC       150  3               BRANCH CODS01117 151104
     E                    BCC       900  3               BRANCH CODE ARRAY151104
0068 E********************BCT       150 46               BRANCH DETLS01117S10736
0068 E***********         BCT       150 50               BRANCH DETS10736 151104
     E**********          BCT       900 50               BRANCH DETL ARRAY             151104 CGL029
     E                    BCT       900 62                                                    CGL029
     E**
     E                    ZYDY    4   4  4 0             ZDATE1/2 SR.ARRAYS01111
     E                    ZMDY   13  13  3 0             ZDATE1/2 SR.ARRAYS01111
     E                    ZMNM   12  12  3               ZDATE2 SR.ARRAY  S01111
     E                    CPY@    1   1 80
     E/EJECT
0062 I*
0063 I* CUSTOMER EXCHANGES INPUT FILE
0064 I*
0065 ICEIP    NS  01   1 CH
0066 I        NS  02   1 CD
0067 I       OR   03   1 CC
0068 I                                        2   7 IPDN
0069 I***********                             8  100BRCD  L1              S01117
0069 I                                        8  10 DRBR                  S01117
0070 I                                    P  11  130VALD
0071 I**********                             14  190DCUS                                      CSD027
0071 I                                       14  19 DCUS                                      CSD027
0072 I                                       36  38 DRCY
0073 I**********                             20  230DCOD                                      CGL029
     I                                       20  230DCODQQ                                    CGL029
0074 I                                       24  250DACS
     I/COPY WNCPYSRC,RE0350IIP2                                           S01408
0075 I                                       26  350DRAN            23
     I/COPY WNCPYSRC,RE0350IIP3                                           S01408
0076 I                                    P  39  450DRAM            21
0077 I                                       46  75 DRNA            20
0078 I                                       76  830CHQN            25
0079 I**********                             84  890CCUS                                      CSD027
0079 I                                       84  89 CCUS                                      CSD027
0080 I                                      106 108 CRCY
0081 I**********                             90  930CCOD                                      CGL029
0081 I                                       90  930CCODQQ                                    CGL029
0082 I                                       94  950CACS
     I/COPY WNCPYSRC,RE0350IIP4                                           S01408
0083 I                                       96 1050CRAN            24
     I/COPY WNCPYSRC,RE0350IIP5                                           S01408
0084 I                                    P 109 1150CRAM            22
0085 I                                      116 145 CRNA
0086 I                                    P 154 1600BCEQ
0087 I                                      153 153 ORIN
0088 I                                    P 146 1528EXRT
     I                                      161 161 MBEI                  E81077
     I**********                            162 1670CHCN                               S01111 CSD027
     I                                      162 167 CHCN                                      CSD027
     I**********                            168 1710CHCD                               S01111 CGL029
     I                                      168 1710CHCDQQ                                    CGL029
     I                                      172 1730CHSQ                  S01111
     I                                    P 174 1800CHAM                  S01111
     I                                      181 181 CHSN                  S01111
     I                                      182 1910CHRN            32    S01111
     I                                    P 192 1940DRVD                  S01111
     I                                    P 195 1970CRVD                  S01111
     I                                      198 213 SWCR                  S05452
     I/COPY WNCPYSRC,RE0350I003
     I                                      240 242 CBRC                  S01117
     I                                      243 246 PRFC                  S01117
     I                                      247 249 TRBR  L1              S01117
0089 I********                            P 254 2560TNLU                  E13327
     I                                    P 257 2602FXMP                  CAC001
     I                                    P 261 2670MAMT                  CAC001
     I                                    P 268 2748ORAT                  CAC001
     I                                      275 275 DCIN                  CAC001
     I                                      276 2850DCOD                                      CGL029
     I                                      286 2950CCOD                                      CGL029
     I                                      296 3050CHCD                                      CGL029
0090 I        NS  12   1 CT
0091 I                                    P   8  100NOCE
0092 I                                    P  11  180HCEW
0093 I                                    P  19  200HCED
0094 I*
0095 I* CATCHALL
0096 I*
0097 I        NS  15
0098 I*
0099 I* CUSTOMER MASTER FILE
0100 I*
0101 ICLINT   NS  04   1 CD   8 CA
0102 I**********                              2   70CNUM                                      CSD027
0102 I                                        2   7 CNUM                                      CSD027
0103 I                                        9  28 CRNM
     I/COPY WNCPYSRC,RE0350I001
0104 I*
0105 I* CATCHALL
0106 I*
0107 I        NS  05
0108 I*
0109 I* STANDING DATA TABLES FILE
0110 I*
0111 I*ABLE***NS**06   2 C0   3 C1  12 C1                                 E81077
     ITABLE   NS       2 C0   3 C1  12 C1                                 E81077
0112 I       AND      13 C0
0113 I                                        1   1 RECI
0114 I                                       14  66 TITL
0115 I                                       67  67 DATF
     I                                       68  700DFBR                  E81077
0116 I                                    P  77  790RUND
0117 I                                       80  86 RUNA
0118 I********NS  07   1 CD   2 C0   3 C1                                 E81077
     I        NS       1 CD   2 C0   3 C1                                 E81077
0119 I       AND      12 C1  13 C1
0120 I                                       14  16 BCCY
     I***********                            53  53 MBIN            E81077S01117
0121 I********NS  08   1 CD   2 C0   3 C1                                 E81077
     I        NS       1 CD   2 C0   3 C1                                 E81077
0122 I       AND      12 C2  13 C0
0123 I**********                             38  410SPAC                                      CGL029
     I                                       56  650SPAC                                      CGL029
0124 I********NS  09   1 CD   2 C2   3 C0
     I        NS       1 CD   2 C2   3 C0
0125 I       AND      13 C1
0126 I                                       38  380CDP
0127 I**********                             49  520TACC                                      CGL029
     I                                       49  580TACC                                      CGL029
0128 I********NS  10   1 CD   2 C1   3 C0                                 E81077
     I********NS       1 CD   2 C1   3 C0                           E81077S01117
0129 I***********                            44  490BICN                  S01117
     I***********                            82  850IBAB            E81077S01117
     I***********                            86  890IBAH            E81077S01117
0130 I**   TABLE FILE ACCOUNT CODES LAYOUT INCLUDED
0131 I*
0132 I*
0133 I*    TABLE FILE - ACCOUNT CODES RECORD 1.
0134 I*
0135 I*TABLE***NS      1 CD   2 C3   3 C0                                                     CGL029
0136 I*******AND      13 C1                                                                   CGL029
0137 I**********                              1   1 RECI                                      CGL029
0138 I**********                              2   30RECT                                      CGL029
0139 I**********                              9  120ACOD                                      CGL029
0140 I**********                             13  130SREC                                      CGL029
0141 I**********                             14  38 ACKN                                      CGL029
0142 I**********                             39  39 ATYP                                      CGL029
0143 I**********                          P  40  420SHLC                                      CGL029
0144 I**********                          P  43  450SHFC                                      CGL029
0145 I**********                             48  48 TITO                                      CGL029
0146 I**********                             49  520BSDR                                      CGL029
0147 I**********                             53  560BSCR                                      CGL029
0148 I**********                             57  600PLDR                                      CGL029
0149 I**********                             61  640PLCR                                      CGL029
0150 I**********                             65  740RPCD                                      CGL029
0151 I**********                             75  76 ACCS                                      CGL029
0152 I**********                             77  77 STYP                                      CGL029
0153 I*
0154 I* CATCHALL
0155 I*
0156 I        NS  11
     ISDBRCHD0                                                            S01117
     I              A8BRCD                          BRCA                  S01117
     I              A8DFAC                          ADFR                  S01117
     I              A8DTAC                          ADTO                  S01117
     I              A8BICN                          BICN                  S01117
     I              A8BRNM                          BRNM                  S01117
     I**                                                                  S01117
     IACCNTABF                                                            CAC001
     I              ATYP                            ATYPA                 CAC001
     I              PRFC                            PRFCA                 CAC001
     I              PFCU                            PFCUA                                     CLE025
     I/COPY WNCPYSRC,RE0350I002
     I*                                                                   CAC001
     ISDACOD    E DSSDACODPD                                              S01117
     I**   EXTERNAL DS FOR ACCOUNT CODES                                  S01117
     I              A5ACTY                          ATYP                  S01117
     I              A5ACSC                          ACSC                  S10736
     I*                                                                   S01117
     ISDMMOD    E DSSDMMODPD                                              S01522
     I* Module details accessed via access program                        S01522
     I*                                                                   S01522
     ISCSARD    E DSSCSARDPD                                              S01522
     I* SAR file details accessed via access program AOSARDR0             S01522
     I*                                                                   S01522
     ISDPCAC    E DSSDPCACPD                                              CAC001
     I**  Profit Centre Accounting ICD                                    CAC001
     I              QQFNAA                          QQFNA1                                    CGL029
     I              QQFNIC                          QQFNI1                                    CGL029
     I*                                                                   CAC001
     ISDPRFC    E DSSDPRFCPD                                              CAC001
     I**  Profit Centre Details                                           CAC001
     I*                                                                   CAC001
     ICGPNAR    E DSCGPNARPD                                              S01522
     I* UDC multi language narrative data structure                       S01522
     I*                                                                   S01522
     I##PRM1      DS                                                      086125
      **  Data Structure for Customer and Branch                          086125
      *                                                                   086125
     I                                        1   6 A#CUST                086125
     I                                        7   9 A#BRCA                086125
      *                                                                   086125
     ISDCUST    E DSSDCUSTPD                                              S01522
     I* Customer details                                                  S01522
     I              QQDFAC                          #DFAC1                                    CGL029
     I*                                                                   S01522
     ISDGELR    E DSSDGELRPD                                              S01117
     I**  EXTERNAL DS FOR GENERAL LEDGER DETAILS                          S01117
     I              BKPRCU                          PFCU                  S01117
     I              QQACCD                          QQACD2                                    CGL029
     I*                                                                   S01117
     IDSFDY     E DSDSFDY                                                 S01117
     I* FIRST DS FOR ACCESS PROGRAMS, SHORT DATA STRUCTURE                S01117
     I*                                                                   S01117
     IDSSDY     E DSDSSDY                                                 S11522
     I* SECOND DS FOR ACCESS PROGRAMS, LONG DATA STRUCTURE                S01522
     I*                                                                   S01522
     I***********                                                   E81077S01117
     I***ACCOUNT*MASTER FILE                                        E81077S01117
     I***********                                                   E81077S01117
     I*CCNT***NS* 06   1 CD                                         E81077S01117
     I***********                            23  250ABRCD           E81077S01117
     I***********                                                   E81077S01117
     I***CATCHALL                                                   E81077S01117
     I***********                                                   E81077S01117
     I********NS*                                                   E81077S01117
     I***********                                                   E81077S01117
     I***ACCOUNTS*MASTER FILE                                       E81077S01117
     I**                                                            E81077S01117
0159 I*********** DS                                                      S01117
0160 I***********                             1  15 ACKEY                 S01117
0161 I***                                     1   60DCUS                  E81077
0162 I***                                     7   9 DRCY                  E81077
0163 I***                                    10  130DCOD                  E81077
0164 I***                                    14  150DACS                  E81077
     I***********                             1   60XCUS            E81077S01117
     I***********                             7   9 XCCY            E81077S01117
     I***********                            10  130XCOD            E81077S01117
     I***********                            14  150XSEQ            E81077S01117
0257 I*                                                                   S01117
0462 I*    DR A/C BRANCH DETAILS DATA STRUCTURE                           S01117
0257 I*                                                                   S01117
0463 I            DS                                                      S01117
0464 I**********                              1  46 DBCI            S01117S10736
0464 I**********                              1  50 DBCI                               S10736 CGL029
     I                                        1  62 DBCI                                      CGL029
0465 I                                        1   6 DBICN                 S01117
0465 I**********                              7  10 DADTO                              S01117 CGL029
0465 I**********                             11  14 DADFR                              S01117 CGL029
0465 I**********                             15  15 DTYPTO                             S01117 CGL029
0465 I**********                             16  16 DTYPFR                             S01117 CGL029
     I**********                             17  46 DBRNM                              S01117 CGL029
0465 I**********                             47  48 DSECTO                             S10736 CGL029
0465 I**********                             49  50 DSECFR                             S10736 CGL029
     I                                        7  16 DADTO                                     CGL029
     I                                       17  26 DADFR                                     CGL029
     I                                       27  27 DTYPTO                                    CGL029
     I                                       28  28 DTYPFR                                    CGL029
     I                                       29  58 DBRNM                                     CGL029
     I                                       59  60 DSECTO                                    CGL029
     I                                       61  62 DSECFR                                    CGL029
0257 I*                                                                   S01117
0462 I*    CR A/C BRANCH DETAILS DATA STRUCTURE                           S01117
0257 I*                                                                   S01117
0463 I            DS                                                      S01117
0464 I**********                              1  46 CBCI            S01117S10736
0464 I**********                              1  50 CBCI                               S10736 CGL029
     I                                        1  62 CBCI                                      CGL029
0465 I                                        1   6 CBICN                 S01117
0465 I**********                              7  10 CADTO                              S01117 CGL029
0465 I**********                             11  14 CADFR                              S01117 CGL029
0465 I**********                             15  15 CTYPTO                             S01117 CGL029
0465 I**********                             16  16 CTYPFR                             S01117 CGL029
     I**********                             17  46 CBRNM                              S01117 CGL029
0465 I**********                             47  48 CSECTO                             S10736 CGL029
0465 I**********                             49  50 CSECFR                             S10736 CGL029
     I                                        7  16 CADTO                                     CGL029
     I                                       17  26 CADFR                                     CGL029
     I                                       27  27 CTYPTO                                    CGL029
     I                                       28  28 CTYPFR                                    CGL029
     I                                       29  58 CBRNM                                     CGL029
     I                                       59  60 CSECTO                                    CGL029
     I                                       61  62 CSECFR                                    CGL029
     I*                                                                   S01117
     I*    TRANSACTION BRANCH DETAILS DATA STRUCTURE                      S01117
     I*                                                                   S01117
     I            DS                                                      S01117
     I**********                              1  46 TBCI            S01117S10736
     I**********                              1  50 TBCI                               S10736 CGL029
     I                                        1  62 TBCI                                      CGL029
     I                                        1   6 TBICN                 S01117
     I**********                              7  10 TADTO                              S01117 CGL029
     I**********                             11  14 TADFR                              S01117 CGL029
     I**********                             15  15 TTYPTO                             S01117 CGL029
     I**********                             16  16 TTYPFR                             S01117 CGL029
     I**********                             17  46 TBRNM                              S01117 CGL029
0465 I**********                             47  48 TSECTO                             S10736 CGL029
0465 I**********                             49  50 TSECFR                             S10736 CGL029
     I                                        7  16 TADTO                                     CGL029
     I                                       17  26 TADFR                                     CGL029
     I                                       27  27 TTYPTO                                    CGL029
     I                                       28  28 TTYPFR                                    CGL029
     I                                       29  58 TBRNM                                     CGL029
     I                                       59  60 TSECTO                                    CGL029
     I                                       61  62 TSECFR                                    CGL029
     I*                                                                   S01117
     I*    MAIN BRANCH DETAILS DATA STRUCTURE                             S01117
     I*                                                                   S01117
     I            DS                                                      S01117
     I**********                              1  46 MBCI            S01117S10736
     I**********                              1  50 MBCI                               S10736 CGL029
     I                                        1  62 MBCI                                      CGL029
     I                                        1   6 MBICN                 S01117
     I**********                              7  10 MADTO                              S01117 CGL029
     I**********                             11  14 MADFR                              S01117 CGL029
     I**********                             15  15 MTYPTO                             S01117 CGL029
     I**********                             16  16 MTYPFR                             S01117 CGL029
     I**********                             17  46 MBRNM                              S01117 CGL029
0465 I**********                             47  48 MSECTO                             S10736 CGL029
0465 I**********                             49  50 MSECFR                             S10736 CGL029
     I                                        7  16 MADTO                                     CGL029
     I                                       17  26 MADFR                                     CGL029
     I                                       27  27 MTYPTO                                    CGL029
     I                                       28  28 MTYPFR                                    CGL029
     I                                       29  58 MBRNM                                     CGL029
     I                                       59  60 MSECTO                                    CGL029
     I                                       61  62 MSECFR                                    CGL029
     I**                                                                  S01117
     I**   FILE INFORMATION DATA STRUCTURE                                S01117
     I**                                                                  S01117
     ISPOOL       DS                                                      S01117
     I                                       83  92 SFILE                 S01117
     I                                    B 123 1240SFNUM                 S01117
     I**                                                                  S01117
     I**   FILE INFORMATION DATA STRUCTURE                                S01117
     I**                                                                  S01117
     ISPOOLU      DS                                                      S01117
     I                                       83  92 SFILEU                S01117
     I                                    B 123 1240SFNUMU                S01117
     I**                                                                  S01117
     IRUNDT       DS                                                      S01117
     I**  DATA AREA RUNDAT                                                S01117
     I                                        1   7 RUNA                  S01117
     I                                    P   8  100RUND                  S01117
     I                                       11  11 SSF                   S01117
     I                                       12  12 DATF                  S01117
     I                                       13  13 MBIN                  S01117
      *                                                                                    MD030959A
     IMPHAS       DS                                                                       MD030959A
     I                                        1   1 W@PHAS                                 MD030959A
     I**                                                                  S01117
     ILDA        UDS                            256                       S01117
     I                                      134 141 DBFILE                S01117
     I                                      142 170 DBKEY                 S01117
     I                                      171 180 DBPGM                 S01117
     I                                      181 1830DBASE                 S01117
     I*                                                                   S01408
     I                                        1  62 SBCI                                    MD043946
     I                                        1   6 SBICN                                   MD043946
     I/COPY WNCPYSRC,RE0350IIPG                                           S01408
     I*                                                                   S01408
     I********************************************************************S01522
     I* Named constant for posting narratives:                            S01522
     I*                                                                   S01522
     I              'CUST EXCH INPUT DOC -C         ##CEID                S01522
     I              'NO - '                                               S01522
     I********************************************************************S01522
     I/EJECT
     I*                                                                   S01408
     I/COPY WNCPYSRC,RE0350IIP1                                           S01408
     I*                                                                   S01408
     IILLINE      DS                            396                                           CER001
      * Extended informations from IBLC 2002                                                  CER001
     I                                        1 132 ILLIN1                                    CER001
     I                                      133 264 ILLIN2                                    CER001
     I                                      265 396 ILLIN3                                    CER001
0165 C**
     C                     MOVEACPY@      BIS@   80
     C**                                                                  S01117
     C           *ENTRY    PLIST                                          S01117
     C                     PARM           SEQ     5        SEQUENCE NUM.  S01117
     C                     PARM           BRNCH   3        BRANCH OR ALL  S01117
     C**                                                                  S01117
0166 C* FIRST CYCLE PROCESSING
0167 C**
0168 C   40                GOTO START
0169 C                     SETON                     40
0170 C                     BITOF'01234567'OFF     1
0171 C*
0172 C*    SET UP FIELDS FOR OUTPUT
0173 C*
0174 C                     Z-ADD0         ZERO3   30
0175 C                     Z-ADD0         ZERO5   50
0176 C**********           Z-ADD0         ZERO6   60                                          CSD027
0176 C                     MOVE *BLANKS   ZERO6   6                                           CSD027
0177 C                     Z-ADD0         ZERO8   80
0178 C                     Z-ADD0         ZERO10 100
     C                     Z-ADD0         ZERO13 130                      S01413
0179 C                     Z-ADD1         ONE     10
0180 C                     MOVE ' '       BLANK1  1
0181 C                     MOVE '       ' BLANK7  7
     C*                                                                   S01117
     C           *NAMVAR   DEFN           LDA                             S01117
     C                     IN   LDA                                       S01117
     C**                                                                  S01117
     C**   INITIALIZE LDA FIELDS                                          S01117
     C                     MOVE *BLANKS   DBFILE                          S01117
     C                     MOVE *BLANKS   DBKEY                           S01117
     C                     MOVE *BLANKS   DBPGM                           S01117
     C                     MOVEL'RE0350'  DBPGM                           S01117
     C                     OUT  LDA                                       S01117
     C           *NAMVAR   DEFN           MPHAS                                            MD030959A
     C                     IN   MPHAS                                                      MD030959A
     C                     Z-ADD2         ICNOCE                                           MD030959A
     C                     MOVE '0'       *IN08   1                                        MD030959A
     C                     MOVE '0'       *IN09   1                                        MD030959A
     C           W@PHAS    IFEQ 'A'                                                        MD030959A
     C           W@PHAS    OREQ 'G'                                                        MD030959A
     C                     MOVE '1'       *IN08                                            MD030959A
     C           BRNCH     IFNE 'ALL'                                                      MD030959A
     C                     MOVE '1'       *IN09                                            MD030959A
     C                     ENDIF                                                           MD030959A
     C                     ENDIF                                                           MD030959A
      *                                                                   CAC001
      **  Set up key list for LF/ACCBR                                    CAC001
      *                                                                   CAC001
     C           ACKEY     KLIST                                          CAC001
     C                     KFLD           WBRC    3                       CAC001
     C**********           KFLD           WCUS    60                                   CAC001 CSD027
     C                     KFLD           WCUS    6                                           CSD027
     C                     KFLD           WCCY    3                       CAC001
     C**********           KFLD           WACD    40                                   CAC001 CGL029
     C                     KFLD           WACD   100                                          CGL029
     C                     KFLD           WACS    20                      CAC001
     C*                                                                   S01408
     C** Core hook for externalisation.                                   S01408
     C/COPY WNCPYSRC,RE0350CCPG                                           S01408
     C*                                                                   S01408
     C**                                                                  S01117
0182 C* ACCESS ICR 1
0183 C                     EXSR ZSYSTM
     C**                                                                  S01117
     C**   IN THE DATAAREA RUNDAT                                         S01117
     C**                                                                  S01117
     C           *NAMVAR   DEFN RUNDAT    RUNDT                           S01117
     C                     IN   RUNDT                                     S01117
     C*                                                                   S01408
     C/COPY WNCPYSRC,RE0350CCP8                                           S01408
     C**                                                                  S01117
     C**    TEST FOR MULTIBRANCHING                                       S01117
     C**                                                                  S01117
     C           MBIN      IFEQ 'Y'                                       S01117
     C                     SETON                     57                   S01117
     C                     END                                            S01117
     C*                                                                   S01117
0184 C* ACCESS ICR 2 FOR BASE CURRENCY
0185 C                     MOVEL'01      'KEYT   12
0186 C                     MOVE '   11'   KEYT
0187 C           KEYT      CHAINTABLE                41
0188 C* ACCESS ICR 3 FOR SPOT TRADE A/C IF END OF DAY RUN
0189 C  NU1                MOVE '20'      KEYT
0190 C  NU1      KEYT      CHAINTABLE                41
0191 C   U1                TIME           MTIME   60
0192 C* SET UP A FIELD WITH  BIT 0 ON
0193 C                     BITON'0'       CORON   1
     C                     BITOF'1234567' CORON                           S01117
0194 C*
0195 C*    ACCESS CUR. REC. 1 FOR NO. OF DEC. PLACES OF BASE CURRENCY
0196 C*
0197 C                     MOVELBCCY      KEY     4
0198 C                     MOVE '1'       KEY
0199 C                     MOVE KEY       KEYT
0200 C                     MOVEL'20'      KEYT
0201 C           KEYT      CHAINTABLE                41
0202 C           TACC      COMP 0                    5656
     C/COPY WNCPYSRC,RE0350C005
0203 C*    SET INDICATORS ACCORDING TO NO. OF DEC. PLACES OF BASE CURR.
0204 C                     SETOF                     5051
0205 C                     SETOF                     5253
0206 C           CDP       COMP 1                      5051
0207 C           CDP       COMP 2                    53  52
     C**
     C****GET*SPOT*TRADE*A/C*CODE*TYPE*FROM*TABLE*FILE*****************                       CGL029
     C**********           MOVEL'30'      KEYT                                                CGL029
     C**********           MOVELSPAC      KEYCOD                                              CGL029
     C**********           MOVE '1'       KEYCOD                                              CGL029
     C**********           MOVE KEYCOD    KEYT                                                CGL029
     C********** KEYT      CHAINTABLE                41                                       CGL029
     C                     MOVE SPAC      WACOD                                               CGL029
     C                     CALL 'AOACODR0'                                                    CGL029
     C                     PARM *BLANKS   @RTCD                                               CGL029
     C                     PARM '*KEY    '@OPTN                                               CGL029
     C                     PARM           WACOD                                               CGL029
     C           SDACOD    PARM SDACOD    DSSDY                                               CGL029
      *                                                                                       CGL029
      ** Move fields from SDACODPD                                                            CGL029
      *                                                                                       CGL029
     C           @RTCD     IFEQ *BLANKS                                                       CGL029
     C                     MOVE ATYP      SPACT   1
     C**********           MOVE ACCS      SPASC   2                                    S10736 CGL029
     C                     MOVE ACSC      SPASC   2                                           CGL029
     C                     ENDIF                                                              CGL029
     C*                                                                   S01182
     C**  INITIALISE ACCOUNT POSTING FIELDS FOR PF/CLEARPD.               S01182
     C                     Z-ADD*ZEROS    SDLB   150                      S01182
     C                     Z-ADD*ZEROS    SDCB   150                      S01182
     C                     MOVE *BLANKS   PRFC    4                       S01182
     C**********           MOVE *BLANKS   OTRF   15                                    S01182 257800
     C                     MOVE *BLANKS   OTRF   21                                           257800
     C***                  MOVE *BLANKS   OTTP   10                 S01182S01255
     C                     MOVEL'91020'   OTTP   10                       S01255
     C                     MOVE *BLANKS   OTST   10                       S01182
     C                     MOVE *BLANKS   BOKC    2                       S01182
     C                     Z-ADD0         ORAMT  130                                          CGL120
     C                     Z-ADD0         LTAI    10                                        AR894859
     C                     Z-ADD0         XRFN   100                                        AR894859
     C                     Z-ADD0         ACODQQ  40                                        AR894859
     C*                                                                   S01117
     C*     SET UP ARRAY OF BRANCH TABLE DETAILS                          S01117
     C*                                                                   S01117
     C                     EXSR BCTARR                                    S01117
     C*                                                                   S01117
     C           *INU7     IFEQ '1'                                       S01117
     C                     GOTO TOTAL                                     S01117
     C                     END                                            S01117
     C*                                                                   S01117
     C*     ACCESS GENERAL LEDGER DETAILS                                 S01117
     C*                                                                   S01117
     C**********           CALL 'AOGELRR0'                                S01117              CGL029
     C                     CALL 'AOGELRR1'                                                    CGL029
     C                     PARM '*MSG   ' @RTCD   7                       S01117
     C                     PARM '*FIRST ' @OPTN   7                       S01117
     C********** SDGELR    PARM SDGELR    DSFDY                           S01117              CGL029
     C           SDGELR    PARM SDGELR    DSSDY                                               CGL029
     C*                                                                   S01117
     C           @RTCD     IFNE *BLANK                     *B1            S01117
     C                     SETON                     U7U8LR               S01117
     C           *LOCK     IN   LDA                                       S01117
     C                     MOVEL'SDGELRPD'DBFILE                          S01117
     C                     MOVEL@OPTN     DBKEY            ***************S01117
     C                     Z-ADD2         DBASE            * DBERROR 002 *S01117
     C                     OUT  LDA                        ***************S01117
     C                     GOTO TOTAL                                     S01117
     C                     END                              *E1           S01117
      *                                                                                       CGL020
      ** Check if Compliance Watch Additional A/C Postings Information                        CGL020
      ** is installed                                                                         CGL020
      *                                                                                       CGL020
     C                     CALL 'AOSARDR0'                                                    CGL020
     C                     PARM *BLANKS   PRTCD                                               CGL020
     C                     PARM '*VERIFY' POPTN                                               CGL020
     C                     PARM 'CGL020'  PSARD                                               CGL020
     C           SCSARD    PARM SCSARD    DSFDY                                               CGL020
      *                                                                                       CGL020
     C           PRTCD     IFNE *BLANKS                                                       CGL020
     C           PRTCD     ANDNE'*NRF   '                                                     CGL020
     C                     MOVE '1'       *INU7                                               CGL020
     C                     MOVE '1'       *INU8                                               CGL020
     C                     MOVE '1'       *INLR                                               CGL020
     C           *LOCK     IN   LDA                                                           CGL020
     C                     MOVE 'SCSARDPD'DBFILE                                              CGL020
     C                     MOVE 'CGL020'  DBKEY                                               CGL020
     C                     Z-ADD11        DBASE                                               CGL020
     C                     OUT  LDA                                                           CGL020
     C                     GOTO TOTAL                                                         CGL020
     C                     ENDIF                                                              CGL020
      *                                                                                       CGL020
     C           PRTCD     IFEQ *BLANKS                                                       CGL020
     C                     MOVE 'Y'       CGL020  1                                           CGL020
     C                     ELSE                                                               CGL020
     C                     MOVE 'N'       CGL020                                              CGL020
     C                     ENDIF                                                              CGL020
     C*                                                                   S01522
     C* Call module prog. for module details.                             S01522
     C                     CALL 'AOMMODR0'                                S01522
     C                     PARM '*MSG   ' @RTCD                           S01522
     C                     PARM '*FIRST ' @OPTN                           S01522
     C           SDMMOD    PARM SDMMOD    DSFDY                           S01522
     C*                                                                   S01522
     C           @RTCD     IFNE *BLANK                     B1             S01522
     C                     SETON                     U7U8LR 1             S01522
     C           *LOCK     IN   LDA                         1             S01522
     C                     MOVEL'SDMMODPD'DBFILE           * * * * * * *  S01522
     C                     Z-ADD86        DBASE            * DBERR 086 *  S01522
     C                     MOVEL@OPTN     DBKEY            * * * * * * *  S01522
     C                     OUT  LDA                         1             S01522
     C                     GOTO TOTAL                       1             S01522
     C                     ELSE                            X1             S01522
      *                                                                   CDE002
      ** Access SAR details file to determine if CDE002 is switched on    CDE002
      *                                                                   CDE002
     C                     CALL 'AOSARDR0'                                CDE002
     C                     PARM *BLANKS   PRTCD   7                       CDE002
     C                     PARM '*VERIFY' POPTN   7                       CDE002
     C                     PARM 'CDE002'  PSARD   6                       CDE002
     C           SCSARD    PARM SCSARD    DSFDY                           CDE002
      *                                                                   CDE002
     C                     MOVE 'N'       CDE002  1                       CDE002
     C           PRTCD     IFEQ *BLANKS                                   CDE002
     C                     MOVE 'Y'       CDE002                          CDE002
     C                     ENDIF                                          CDE002
      *                                                                   CAC001
      **  If Analytical Accounting is installed, get Primary              CAC001
      **  Funding Profit Centre in PCA ICD file                           CAC001
      *                                                                   CAC001
     C                     MOVE '0'       *IN38                           CAC001
     C           BGN0ST    IFEQ 'Y'                                       CAC001
     C                     MOVE '1'       *IN36                           CAC001
      *                                                                   CAC001
     C                     CALL 'AOPCACR0'                                CAC001
     C                     PARM '*MSG   ' @RTCD                           CAC001
     C                     PARM '*FIRST ' @OPTN                           CAC001
     C           SDPCAC    PARM SDPCAC    DSFDY                           CAC001
      *                                                                   CAC001
     C           @RTCD     IFNE *BLANK                                    CAC001
     C                     SETON                     U7U8LR               CAC001
     C           *LOCK     IN   LDA                                       CAC001
     C                     MOVEL'SDPCACPD'DBFILE           ************   CAC001
     C                     Z-ADD26        DBASE            * DBERR 26 *   CAC001
     C                     MOVEL@OPTN     DBKEY            ************   CAC001
     C                     OUT  LDA                                       CAC001
     C                     GOTO TOTAL                                     CAC001
     C                     ENDIF                                          CAC001
      *                                                                   CAC001
     C                     ELSE                                           CAC001
     C           CDE002    IFEQ 'Y'                                       CDE002
     C                     MOVE '1'       *IN36                           CDE002
     C                     ELSE                                           CDE002
     C                     MOVE '0'       *IN36                           CAC001
     C                     ENDIF                                          CDE002
     C                     ENDIF                                          CAC001
     C/COPY WNCPYSRC,REH00393
     C*                                                                   S01522
     C* Call SAR prog. for switchable feature                             S01522
     C                     MOVE 'N'       REPNAR  1                       S01522
     C           BGN1ST    IFEQ 'Y'                        B2             S01522
     C/COPY WNCPYSRC,REH00394
     C*                                                                   S01522
     C                     CALL 'AOSARDR0'                  2             S01522
     C                     PARM '       ' @RTCD             2             S01522
     C                     PARM '*VERIFY' @OPTN             2             S01522
     C                     PARM 'REPNAR'  @SARD   6         2             S01522
     C           SCSARD    PARM SCSARD    DSFDY             2             S01522
     C*                                                                   S01522
     C           @RTCD     IFNE *BLANK                     B3             S01522
     C           @RTCD     ANDNE'*NRF   '                   3             S01522
     C                     SETON                     U7U8LR 3             S01522
     C           *LOCK     IN   LDA                         3             S01522
     C                     MOVEL'SCSARDPD'DBFILE            ************* S01522
     C                     Z-ADD87        DBASE             *DBERROR 087* S01522
     C                     MOVEL@SARD     DBKEY             ************* S01522
     C                     OUT  LDA                         3             S01522
     C                     GOTO TOTAL                       3             S01522
     C                     ENDIF                           E3             S01522
     C*                                                                   S01522
     C           @RTCD     IFEQ *BLANK                     B3             S01522
     C                     MOVE 'Y'       REPNAR            3             S01522
     C                     ENDIF                           E3             S01522
     C                     ENDIF                           E2             S01522
     C                     ENDIF                           E1             S01522
     C*                                                                   S01117
     C*   IF INTERBRANCH ENTRIES TO BE GENERATED VIA MAIN BRANCH,         S01117
     C*   SET UP MAIN BRANCH DETAILS                                      S01117
     C*                                                                   S01117
     C           BKIEMB    IFEQ 'Y'                         *B1           S01117
     C                     SETOF                         10               S01117
     C                     Z-ADDSTIX      IX                              S01117
     C           BKMABR    LOKUPBCC,IX                   10               S01117
     C   10                MOVE BCT,IX    MBCI                            S01117
     C                     END                              *E1           S01117
     C*                                                                   S01117
     C*   CHECK WHETHER PROFIT CENTRE USED                                S01117
     C*                                                                   S01117
     C           PFCU      IFEQ 'Y'                         *B1           S01117
     C                     SETON                         47               S01117
     C                     END                              *E1           S01117
      *                                                                   S01408
     C/COPY WNCPYSRC,RE0350CCP9                                           S01408
      *                                                                   S01408
     C**
0208 C           START     TAG                              *** START ***
     C*                                                                   S01408
     C/COPY WNCPYSRC,RE0350CP10                                           S01408
     C*                                                                   S01408
     C***********          SETOF                     262829         E81077S01117
     C*                                                                   S01408
     C/COPY WNCPYSRC,RE0350CCP6                                           S01408
     C*                                                                   S01408
     C                     CALL 'AOSARDR0'                                                    CER001
     C                     PARM *BLANKS   @RTCD   7                                           CER001
     C                     PARM '*VERIFY' @OPTN   7                                           CER001
     C                     PARM 'ULX043'  @SARD   6                                           CER001
     C           SCSARD    PARM SCSARD    DSFDY                                               CER001
     C           PRTCD     IFNE *BLANKS                                                       CER001
     C           PRTCD     ANDNE'*NRF   '                                                     CER001
     C                     MOVE '1'       *INU7                                               CER001
     C                     MOVE '1'       *INU8                                               CER001
     C                     MOVE '1'       *INLR                                               CER001
     C           *LOCK     IN   LDA                                                           CER001
     C                     MOVE 'SCSARDPD'DBFILE                                              CER001
     C                     MOVE 'ULX043'  DBKEY                                               CER001
     C                     Z-ADD88        DBASE                                               CER001
     C                     OUT  LDA                                                           CER001
     C                     EXSR *PSSR                                                         CER001
     C                     ENDIF                                                              CER001
     C           @RTCD     IFEQ *BLANKS                                                       CER001
     C                     MOVE 'Y'       ULX043  1                                           CER001
     C                     ELSE                                                               CER001
     C                     MOVE 'N'       ULX043                                              CER001
     C                     ENDIF                                                              CER001
0209 C  N02N03             GOTO TOTAL
     C*                                                                   S01408
     C/COPY WNCPYSRC,RE0350CCP7                                           S01408
     C*                                                                   S01408
     C           ULX043    IFEQ 'Y'                                                           CER001
     C                     SETOF                     78                                       CER001
     C                     SETOF                     79                                       CER001
     C                     SETON                     85                                       CER001
      *                                                                                       CER001
      * If IBLC Returns module is on, call PGM IL0461 to access Extension                     CER001
      * file RECEX1L0 and seton indicator 79                                                  CER001
      *                                                                                       CER001
     C           BGNWST    IFEQ 'Y '                                                          CER001
     C                     CALL 'IL0461'                                                      CER001
     C                     PARM IPDN      PIPDN   6                                           CER001
     C                     PARM           ILLINE                                              CER001
     C                     PARM *BLANK    PFAIL   1                                           CER001
      *                                                                                       CER001
     C           PFAIL     IFEQ '1'                                                           CER001
     C                     MOVE *OFF      *IN79                                               CER001
     C                     ELSE                                                               CER001
     C                     MOVE *ON       *IN79                                               CER001
     C                     ENDIF                                                              CER001
     C                     ENDIF                                                              CER001
      *                                                                                       CER001
     C                     ENDIF                                                              CER001
0210 C                     SETON                     77
     C*                                                                   S01182
     C** SETUP ACCOUNT POSTING FIELD WITH REFERENCE NO.FROM LF/CEIP.      S01182
     C**********           MOVELIPDN      OTRF   15                                    S01182 257800
     C                     MOVELIPDN      OTRF                                                257800
     C/COPY WNCPYSRC,RE0350C033
0211 C**
0238 C***AT*CHANGE OF BRANCH, AND INITIALLY, ACCESS BRANCH CODE TABLE     S01117
0239 C***L1******          MOVE '     '   KEYT                            S01117
0240 C***L1******          MOVEL'10'      KEYT                            S01117
0241 C***L1******          MOVEL' '       KEY                             S01117
0242 C***L1******          MOVE BRCD      KEY                             S01117
0243 C***L1******          MOVE KEY       KEYT                            S01117
0244 C***L1******KEYT      CHAINTABLE                43                   S01117
     C*                                                                   S01117
     C*  NO CHANGE OF TRANSACTION BRANCH                                  S01117
     C*                                                                   S01117
     C           *INL1     IFNE '1'                         *B1           S01117
     C*                                                                   S01117
     C**  IF MULTIBRANCH IND. = 'Y'                                       S01117
     C**  AND REQUESTED BRANCH > TRANSACTION BRANCH FROM RECORD,          S01117
     C**  SKIP DETAIL CALCULATIONS.                                       S01117
     C           MBIN      IFEQ 'Y'                         *B2           S01117
     C           BRNCH     IFGT TRBR                        *B3           S01117
     C           BRNCH     ANDNE'ALL'                                     S01117
     C                     SETOF                     58                   S01117
     C                     GOTO TOTAL                                     S01117
     C                     END                              *E3           S01117
     C                     END                              *E2           S01117
     C*                                                                   S01117
     C*  CHANGE OF TRANSACTION BRANCH                                     S01117
     C*                                                                   S01117
     C                     ELSE                             *X1           S01117
     C*                                                                   S01117
     C                     Z-ADD0         BRCENO                          S01117
     C                     CLOSERE0350P1                                  S01117
     C**                                                                  S01117
     C** IF 'ALL' BRANCHES REQUIRED                                       S01117
     C**    OR BRANCH REQUESTED = TRANSACTION BRANCH ON RECORD            S01117
     C**    OR MULTIBRANCH IND. = 'N'                                     S01117
     C**                                                                  S01117
     C           BRNCH     IFEQ 'ALL'                       *B2           S01117
     C           BRNCH     OREQ TRBR                                      S01117
     C           MBIN      OREQ 'N'                                       S01117
     C                     SETON                     5859                 S01117
     C                     OPEN RE0350P1                                  S01117
     C                     Z-ADD0         PAGE                            S01117
     C**                                                                  S01117
     C** ENSURE REPORT SPOOL FILE RECORDED BY RCF                         S01117
     C                     Z-ADDSFNUM     ZSNUM   60                      S01117
     C*                                                                   S01117
     C                     CALL 'ZSFILE'                                  S01117
     C                     PARM           SEQ                             S01117
     C                     PARM TRBR      SENTY   3                       S01117
     C                     PARM           SFILE                           S01117
     C                     PARM           ZSNUM                           S01117
     C                     PARM           ZSERR   1                       S01117
     C*                                                                   S01117
     C           ZSERR     IFEQ 'Y'                         *B3           S01117
     C**  ERROR DURING ZSFILE PROCESSING, RETURN TO CALLING PROGRAM       S01117
     C                     SETON                     U7U8LR               S01117
     C                     RETRN                                          S01117
     C                     END                              *E3           S01117
     C*                                                                   S01117
     C*  ACCESS BRANCH CODE ARRAY FOR TRANSACTION BRANCH DETAILS          S01117
     C*                                                                   S01117
     C                     SETOF                         10               S01117
     C                     Z-ADDSTIX      IX                              S01117
     C           TRBR      LOKUPBCC,IX                   10               S01117
     C   10                MOVE BCT,IX    TBCI                            S01117
     C*                                                                   S01117
     C**                                                                  S01117
     C** OTHERWISE, MULTIBRANCH IND. = 'Y'                                S01117
     C**   AND BRANCH REQUESTED ¬= TRANSACTION BRANCH ON RECORD           S01117
     C**                                                                  S01117
     C                     ELSE                             *X2           S01117
     C**                                                                  S01117
     C**   END PROGRAM IF TRANSACTION BRANCH > BRANCH REQUESTED           S01117
     C           TRBR      IFGT BRNCH                       *B3           S01117
     C                     SETON                     LR                   S01117
     C                     END                              *E3           S01117
     C**                                                                  S01117
     C**   SKIP DETAIL CALCULATIONS                                       S01117
     C                     SETOF                     58                   S01117
     C                     GOTO TOTAL                                     S01117
     C                     END                              *E2           S01117
     C**                                                                  S01117
     C                     END                              *E1           S01117
     C***********                                                   E81077S01117
     C****CHECK*IF EXCHANGE IS ACROSS TWO BRANCHES AND IF IT IS     E81077S01117
     C******FIND*DR AND CR BRANCH CODES AND BR. INT. CUST. NOS.     E81077S01117
     C***********                                                   E81077S01117
     C***********MBEI      IFEQ 'Y'                                 E81077S01117
     C***********          SETON                     26             E81077S01117
     C***********          MOVE DCUS      XCUS                      E81077S01117
     C***********          MOVE DRCY      XCCY                      E81077S01117
     C***********          MOVE DCOD      XCOD                      E81077S01117
     C***********          MOVE DACS      XSEQ                      E81077S01117
     C***********ACKEY     CHAINACCNT                47             E81077S01117
     C***********                                                   E81077S01117
     C****ACCOUNT FOUND                                             E81077S01117
     C***********                                                   E81077S01117
     C************IN06     IFEQ '1'                                 E81077S01117
     C***********          MOVE ABRCD     DRBRCD  30                E81077S01117
     C***********          MOVE '     '   KEYT                      E81077S01117
     C***********          MOVEL'10'      KEYT                      E81077S01117
     C***********          MOVEL' '       KEY                       E81077S01117
     C***********          MOVE DRBRCD    KEY                       E81077S01117
     C***********          MOVE KEY       KEYT                      E81077S01117
     C***********                                                   E81077S01117
     C***********KEYT      CHAINTABLE                47             E81077S01117
     C***********          MOVE BICN      DRBICN  60                E81077S01117
     C***********          MOVE IBAB      DRIBAB  40                E81077S01117
     C***********          MOVE IBAH      DRIBAH  40                E81077S01117
     C***********          SETOF                     06             E81077S01117
     C***********          END                                      E81077S01117
     C***********                                                   E81077S01117
     C***********          MOVE CCUS      XCUS                      E81077S01117
     C***********          MOVE CRCY      XCCY                      E81077S01117
     C***********          MOVE CCOD      XCOD                      E81077S01117
     C***********          MOVE CACS      XSEQ                      E81077S01117
     C***********ACKEY     CHAINACCNT                47             E81077S01117
     C***********                                                   E81077S01117
     C*****ACCOUNT FOUND                                            E81077S01117
     C***********                                                   E81077S01117
     C************IN06     IFEQ '1'                                 E81077S01117
     C***********          MOVE ABRCD     CRBRCD  30                E81077S01117
     C***********          MOVE CRBRCD    KEY                       E81077S01117
     C***********          MOVE KEY       KEYT                      E81077S01117
     C***********                                                   E81077S01117
     C***********KEYT      CHAINTABLE                47             E81077S01117
     C***********          MOVE BICN      CRBICN  60                E81077S01117
     C***********          MOVE IBAB      CRIBAB  40                E81077S01117
     C***********          MOVE IBAH      CRIBAH  40                E81077S01117
     C***********          END                                      E81077S01117
     C***********                                                   E81077S01117
     C*****FIND*OUT WHICH BRANCH CODE (DR OR CR) = BRCD             E81077S01117
     C***********                                                   E81077S01117
     C***********          SETOF                     2829           E81077S01117
     C***********DRBRCD    COMP BRCD                     28         E81077S01117
     C**N28******          SETON                     29             E81077S01117
     C***********          END                                      E81077S01117
     C***********                                                   E81077S01117
0245 C*
     C*                                                                   S01408
     C** Core hook for externalisation.                                   S01408
     C/COPY WNCPYSRC,RE0350CCP1                                           S01408
     C*                                                                   S01408
0246 C* ACCESS CURR. REC. 1 FOR NO. OF DECIMAL PLACES OF BOTH DEBIT
0247 C*    AND CREDIT CURRENCIES
0248 C*
0249 C                     MOVE '      '  KEYT
0250 C                     MOVEL'20'      KEYT
0251 C                     MOVELCRCY      KEY
0252 C                     MOVE '1'       KEY
0253 C                     MOVE KEY       KEYT
0254 C           KEYT      CHAINTABLE                41
0255 C* PUT CREDIT CURRENCY DECIMAL PLACES IN CRCDP
0256 C*
0257 C                     MOVE CDP       CRCDP   10
0258 C*********************MOVE TACC      TACCC   40                                         BUG4540
0258 C                     MOVE TACC      TACCC  100                                         BUG4540
0259 C****
0260 C                     MOVELDRCY      KEY
0261 C                     MOVE KEY       KEYT
0262 C           KEYT      CHAINTABLE                41
0263 C* PUT DEBIT CURRENCY DECIMAL PLACES IN DRCDP
0264 C*
0265 C                     MOVE CDP       DRCDP   10
     C**
     C****GET*TRADE*A/C*CODE*A/C*TYPES*********************************                       CGL029
     C**********           MOVEL'30'      KEYT                                                CGL029
     C**********           MOVELTACC      KEYCOD                                              CGL029
     C**********           MOVE '1'       KEYCOD                                              CGL029
     C**********           MOVE KEYCOD    KEYT                                                CGL029
     C********** KEYT      CHAINTABLE                41                                       CGL029
     C                     MOVE TACC      WACOD                                               CGL029
     C                     CALL 'AOACODR0'                                                    CGL029
     C                     PARM *BLANKS   @RTCD                                               CGL029
     C                     PARM '*KEY    '@OPTN                                               CGL029
     C                     PARM           WACOD                                               CGL029
     C           SDACOD    PARM SDACOD    DSSDY                                               CGL029
      *                                                                                       CGL029
      ** Move fields from SDACODPD                                                            CGL029
      *                                                                                       CGL029
     C           @RTCD     IFEQ *BLANKS                                                       CGL029
     C                     MOVE ATYP      TACCTD  1
     C**********           MOVE ACCS      TACSCD  2                                    S10736 CGL029
     C                     MOVE ACSC      TACSCD  2                                           CGL029
     C                     ENDIF                                                              CGL029
     C**********           MOVELTACCC     KEYCOD                                              CGL029
     C**********           MOVE KEYCOD    KEYT                                                CGL029
     C********** KEYT      CHAINTABLE                41                                       CGL029
     C                     MOVE TACCC     WACOD                                               CGL029
     C                     CALL 'AOACODR0'                                                    CGL029
     C                     PARM *BLANKS   @RTCD                                               CGL029
     C                     PARM '*KEY    '@OPTN                                               CGL029
     C                     PARM           WACOD                                               CGL029
     C           SDACOD    PARM SDACOD    DSSDY                                               CGL029
      *                                                                                       CGL029
      ** Move fields from SDACODPD                                                            CGL029
      *                                                                                       CGL029
     C           @RTCD     IFEQ *BLANKS                                                       CGL029
     C                     MOVE ATYP      TACCTC  1
     C**********           MOVE ACCS      TACSCC  2                                    S10736 CGL029
     C                     MOVE ACSC      TACSCC  2                                           CGL029
     C                     ENDIF                                                              CGL029
0266 C*
0267 C* ACC. NO. OF CUSTOMER EXCHANGE RECS. READ IN NUMCE, AND STORE
0268 C* HASH TOTAL OF AMOUNTS IN  INT,1 , DEC,1
0269 C*
0270 C**N13******          SETON                     13                   S01117
0271 C           NUMCE     ADD  1         NUMCE   50
     C                     ADD  1         ICNOCE  50                                       MD030959A
0272 C           BRCENO    ADD  1         BRCENO  30
0273 C                     Z-ADD1         X       10
     C                     Z-ADD0         ZZAMT                                             AR317301
0274 C     N21             MOVE DRAM      ZZAMT
0275 C     N21             EXSR HASH
     C                     Z-ADD0         ZZAMT                                             AR317301
0276 C     N22             MOVE CRAM      ZZAMT
0277 C     N22             EXSR HASH
0278 C                     SETOF                     606162
0279 C                     SETOF                     707172
0280 C                     SETOF                     6373
     C*                                                                   S01111
     C** FORMAT CHARGE DETAILS, 1 EXTRA POSTING IF CHARGES REQUIRED       S01111
     C                     SETOF                     303176               S01111
     C           CHSN      IFNE ' '                        ** S-001       S01111
     C                     SETON                     30                   S01111
     C           *IN02     IFEQ '1'                        ** S-002 **    S01111
     C                     ADD  1         NORE                            S01111
0273 C                     Z-ADD2         X       10
     C                     Z-ADD0         ZZAMT                                             AR317301
0274 C                     MOVE CHAM      ZZAMT
0275 C                     EXSR HASH
     C                     END                             ** E-002 **    S01111
     C                     END                             ** E-001 **    S01111
     C*                                                                   S01111
0281 C           CRCDP     COMP 1                      6061
0282 C           CRCDP     COMP 2                    63  62
0283 C           DRCDP     COMP 1                      7071
0284 C           DRCDP     COMP 2                    73  72
0285 C*
0286 C   60                MOVE CRAM      CRAM0  130
0287 C   61                MOVE CRAM      CRAM1  131
0288 C   62                MOVE CRAM      CRAM2  132
0289 C   63                MOVE CRAM      CRAM3  133
0290 C*
0291 C   70                MOVE DRAM      DRAM0  130
0292 C   71                MOVE DRAM      DRAM1  131
0293 C   72                MOVE DRAM      DRAM2  132
0294 C   73                MOVE DRAM      DRAM3  133
0295 C*
     C           CHSN      IFEQ '+'                        ** S-001 **    S01111
     C           CHSN      OREQ 'D'                                                           257012
     C           CHSN      OREQ 'd'                                                           257012
     C                     SETON                     31                   S01111
     C**********           MOVE DCUS      ASOC    60                                   S01111 CSD027
     C                     MOVE DCUS      ASOC    6                                           CSD027
     C                     ELSE                            ** X-001 **    S01111
     C                     MOVE CCUS      ASOC                            S01111
     C                     END                             ** E-001 **    S01111
     C*                                                                   S01111
     C** IF VALID CHARGES SIGN ENTERED THEN ADJUST DEBIT OR CREDIT POSTINGS01111
     C** AMOUNT AS NECESSARY                                              S01111
     C           CHSN      IFEQ '+'                        ** S-001 **    S01111
     C           CHSN      OREQ 'D'                                                           257012
     C           CHSN      OREQ 'd'                                                           257012
     C           DRAM      ADD  CHAM      DCHAM  130                      S01111
     C                     END                             ** E-001 **    S01111
     C           CHSN      IFEQ '-'                        ** S-001 **    S01111
     C           CHSN      OREQ 'C'                                                           257012
     C           CHSN      OREQ 'c'                                                           257012
     C           CRAM      SUB  CHAM      CCHAM  130                      S01111
     C                     END                             ** E-001 **    S01111
     C/COPY WNCPYSRC,REH00466
      *                                                                                       CGL020
      ** Initialise work variables for additional A/C postings                                CGL020
      ** information (CGL020)                                                                 CGL020
      *                                                                                       CGL020
     C                     MOVE *BLANKS   WACKEY  20                                          CGL020
     C                     MOVE ' '       WDFFLG  1                                           CGL020
     C                     Z-ADD0         WDFVAL 130                                          CGL020
     C                     Z-ADD0         WDFPCT  52                                          CGL020
     C                     MOVE ' '       WCFFLG  1                                           CGL020
     C                     Z-ADD0         WCFVAL 130                                          CGL020
     C                     Z-ADD0         WCFPCT  52                                          CGL020
     C                     MOVE ' '       WF      1                                           CGL020
     C                     Z-ADD0         WCHAM  130                                          CGL020
     C                     Z-ADD0         W100    52                                          CGL020
     C                     Z-ADD0         WKFPCT  94                                          CGL020
     C                     MOVE *BLANKS   RORACT 20                                           CGL020
     C                     MOVE *BLANKS   RORCTY  2                                           CGL020
     C                     MOVE *BLANKS   RORBNK 20                                           CGL020
     C                     MOVE *BLANKS   RORCDE 11                                           CGL020
     C                     MOVE *BLANKS   PORACT 20                                           CGL020
     C                     MOVE *BLANKS   PORCTY  2                                           CGL020
     C                     MOVE *BLANKS   PORBNK 20                                           CGL020
     C                     MOVE *BLANKS   PORCDE 11                                           CGL020
     C                     MOVE *BLANKS   DSTACT 35                                           CGL020
     C                     MOVE *BLANKS   DSTCTY  2                                           CGL020
     C                     MOVE *BLANKS   DSTBNK 20                                           CGL020
     C                     Z-ADD*ZEROS    SETDAT  50                                          CGL020
     C                     MOVE *BLANKS   TICKER 10                                           CGL020
     C                     MOVE *BLANKS   EXCHNG 20                                           CGL020
     C                     Z-ADD*ZEROS    NOMINL 132                                          CGL020
     C                     MOVE *BLANKS   FDTRID 16                                           CGL020
      *                                                                                       CGL020
      ** If CGL020 is installed, process additional A/C postings                              CGL020
      ** information                                                                          CGL020
      *                                                                                       CGL020
     C           CGL020    IFEQ 'Y'                                                           CGL020
      *                                                                                       CGL020
     C                     MOVE 'F'       WF                                                  CGL020
     C                     Z-ADDCHAM      WCHAM                                               CGL020
     C                     Z-ADD100       W100                                                CGL020
      *                                                                                       CGL020
     C           CHSN      IFEQ '+'                                                           CGL020
     C           CHSN      OREQ 'D'                                                           257012
     C           CHSN      OREQ 'd'                                                           257012
     C                     MOVE 'N'       WDFFLG                                              CGL020
     C                     Z-ADDCHAM      WDFVAL                                              CGL020
     C           CHAM      DIV  DRAM      WKFPCT                                              CGL020
     C           WKFPCT    MULT 100       WDFPCT                                              CGL020
     C                     ENDIF                                                              CGL020
      *                                                                                       CGL020
     C           CHSN      IFEQ '-'                                                           CGL020
     C           CHSN      OREQ 'C'                                                           257012
     C           CHSN      OREQ 'c'                                                           257012
     C                     MOVE 'N'       WCFFLG                                              CGL020
     C                     Z-ADDCHAM      WCFVAL                                              CGL020
     C           CHAM      DIV  CRAM      WKFPCT                                              CGL020
     C           WKFPCT    MULT 100       WCFPCT                                              CGL020
     C                     ENDIF                                                              CGL020
      *                                                                                       CGL020
     C                     ENDIF                                                              CGL020
      *                                                                                       CGL020
     C* FORMAT VALUE DATES IF DIFFERENT FORM RUND                         S01111
     C*                                                                   S01111
     C           DRVD      IFNE RUND                                      S01111
     C                     Z-ADDDRVD      ZDAYNO                          S01111
     C                     EXSR ZDATE2                                    S01111
     C                     MOVE ZADATE    DRVALD  7                       S01111
     C                     ELSE                                           S01111
     C                     MOVE '       ' DRVALD                          S01111
     C                     END                                            S01111
     C*                                                                   S01111
     C           CRVD      IFNE RUND                                      S01111
     C                     Z-ADDCRVD      ZDAYNO                          S01111
     C                     EXSR ZDATE2                                    S01111
     C                     MOVE ZADATE    CRVALD  7                       S01111
     C                     ELSE                                           S01111
     C                     MOVE '       ' CRVALD                          S01111
     C                     END                                            S01111
0296 C   03                GOTO TOTAL
0297 C*
0298 C***IF*DEBIT CCY EQUALS BASE CCY, DO NOT GENERATE POSTINGS 2 AND 5   S01117
0298 C***IF*DEBIT*CCY*EQUALS BASE CCY, DO NOT GENERATE POSTINGS 4 ANS01117E18408
0298 C*  IF DEBIT CCY EQUALS BASE CCY, DO NOT GENERATE POSTINGS 2 AND 5   E18408
0299 C*
0300 C***IF*CREDITCCY EQUALS BASE CCY, DO NOT GENERATE POSTINGS 3 AND 6   S01117
0300 C***IF*CREDITCCY*EQUALS BASE CCY, DO NOT GENERATE POSTINGS 2 ANS01117E18408
0300 C*  IF CREDITCCY EQUALS BASE CCY, DO NOT GENERATE POSTINGS 3 AND 6   E18408
0301 C*
0302 C                     SETOF                     4546
0303 C           DRCY      COMP BCCY                     45
0304 C           CRCY      COMP BCCY                     46
     C/COPY WNCPYSRC,RE0350C006
     C*                                                                   CAC001
     C                     SETOF                     3435                 CAC001
     C*                                                                   CAC001
      *                                                                                     MD043946
      ** check for blocked dr indicator                                                     MD043946
      *                                                                                     MD043946
     C                     MOVELDRBR      WBRC                                              MD043946
     C                     MOVE DCUS      WCUS                                              MD043946
     C                     MOVELDRCY      WCCY                                              MD043946
     C                     Z-ADDDCOD      WACD                                              MD043946
     C                     Z-ADDDACS      WACS                                              MD043946
     C           ACKEY     CHAINACCBR                37                                     MD043946
     C           *IN37     IFEQ '0'                                                         MD043946
     C                     TESTB'2'       RETB           44                                 MD043946
      *                                                                                     MD043946
     C           *IN44     IFEQ '1'                                                         MD043946
     C                     Z-ADDSTIX      IX                                                MD043946
     C           DRBR      LOKUPBCC,IX                   10                                 MD043946
     C   10                MOVE BCT,IX    SBCI                                              MD043946
     C                     MOVE SBICN     DCUS                                              MD043946
     C                     MOVE BKACCD    DCOD                                              MD043946
     C                     MOVE '01'      DACS                                              MD043946
     C                     MOVE DCUS      WCUS                                              MD043946
     C                     Z-ADDDCOD      WACD                                              MD043946
     C                     Z-ADDDACS      WACS                                              MD043946
     C           ACKEY     CHAINACCBR                37                                     MD043946
     C           *IN37     IFEQ '0'                                                         MD043946
     C                     Z-ADDACNO      DRAN                                              MD043946
     C                     ENDIF                                                            MD043946
     C                     ENDIF                                                            MD043946
      *                                                                                     MD043946
     C                     ENDIF                                                            MD043946
      *                                                                                     MD043946
      ** check for blocked cr indicator                                                     MD043946
      *                                                                                     MD043946
     C                     MOVELCBRC      WBRC                                              MD043946
     C                     MOVE CCUS      WCUS                                              MD043946
     C                     MOVELCRCY      WCCY                                              MD043946
     C                     Z-ADDCCOD      WACD                                              MD043946
     C                     Z-ADDCACS      WACS                                              MD043946
     C           ACKEY     CHAINACCBR                37                                     MD043946
     C           *IN37     IFEQ '0'                                                         MD043946
     C                     TESTB'3'       RETB           44                                 MD043946
      *                                                                                     MD043946
     C           *IN44     IFEQ '1'                                                         MD043946
     C                     Z-ADDSTIX      IX                                                MD043946
     C           CBRC      LOKUPBCC,IX                   10                                 MD043946
     C   10                MOVE BCT,IX    SBCI                                              MD043946
     C                     MOVE SBICN     CCUS                                              MD043946
     C                     MOVE BKACCD    CCOD                                              MD043946
     C                     MOVE '01'      CACS                                              MD043946
     C                     MOVE CCUS      WCUS                                              MD043946
     C                     Z-ADDCCOD      WACD                                              MD043946
     C                     Z-ADDCACS      WACS                                              MD043946
     C           ACKEY     CHAINACCBR                37                                     MD043946
     C           *IN37     IFEQ '0'                                                         MD043946
     C                     Z-ADDACNO      CRAN                                              MD043946
     C                     ENDIF                                                            MD043946
     C                     ENDIF                                                            MD043946
      *                                                                                     MD043946
     C                     ENDIF                                                            MD043946
      *
     C           BGN0ST    IFEQ 'Y'                                       CAC001
     C           DCIN      ANDEQ'D'                                       CAC001
     C                     SETON                     34                   CAC001
     C           DRAM      SUB  MAMT      MDRAM  130                      CAC001
     C           DRCY      IFEQ BCCY                                      CAC001
     C           BCEQ      SUB  MAMT      MBCEQ  130                      CAC001
     C                     ENDIF                                          CAC001
     C                     ENDIF                                          CAC001
     C*                                                                   CAC001
     C           BGN0ST    IFEQ 'Y'                                       CAC001
     C           DCIN      ANDEQ'C'                                       CAC001
     C                     SETON                     35                   CAC001
     C           CRAM      ADD  MAMT      MCRAM  130                      CAC001
     C           CRCY      IFEQ BCCY                                      CAC001
     C           BCEQ      ADD  MAMT      MBCEQ                           CAC001
     C                     ENDIF                                          CAC001
     C                     ENDIF                                          CAC001
     C*                                                                   CAC001
0305 C***********                                                         S01117
0306 C***ACCUMULATE NO. OF RECORDS WRITTEN TO GECE IN NORE                S01117
0307 C***********                                                         S01117
0308 C***********NORE      ADD  2         NORE    50                      S01117
0309 C***56******                                                         S01117
0310 C*RN45******NORE      ADD  2         NORE                            S01117
0311 C***56******                                                         S01117
0312 C*RN46******NORE      ADD  2         NORE                            S01117
     C***********                                                   E81077S01117
     C***26******NORE      ADD  2         NORE                      E81077S01117
0313 C***********                                                         S01117
0314 C**ACC.*VALUE OF RECORDS WRITTEN TO GECE IN  INT,2  DEC,2            S01117
0315 C***********          Z-ADD0         BCAM   150                      S01117
0316 C***********          MOVE BCEQ      BCAM                            S01117
0317 C***46******          MOVE CRAM      BCAM                            S01117
0318 C***45******          MOVE DRAM      BCAM                            S01117
0319 C***********          Z-ADD2         X                               S01117
     C************IN30     IFEQ '0'                                 S01111S01117
     C***********CHSN      OREQ '-'                                 S01111S01117
0320 C***********          MOVE DRAM      ZZAMT                           S01117
     C***********          ELSE                                     S01111S01117
     C***********          MOVE DCHAM     ZZAMT                     S01111S01117
     C***********          END                                      S01111S01117
0321 C***********          EXSR HASH                                      S01117
     C************IN30     IFEQ '0'                                 S01111S01117
     C***********CHSN      OREQ '+'                                 S01111S01117
0322 C***********          MOVE CRAM      ZZAMT                           S01117
     C***********          ELSE                                     S01111S01117
     C***********          MOVE CCHAM     ZZAMT                     S01111S01117
     C***********          END                                      S01111S01117
0323 C***********          EXSR HASH                                      S01117
0324 C***56******                                                         S01117
0325 C*RN45******          MOVE DRAM      ZZAMT                           S01117
0326 C***56******                                                         S01117
0327 C*RN45******          EXSR HASH                                      S01117
0328 C***56******                                                         S01117
0329 C*RN45******          MOVE BCAM      ZZAMT                           S01117
0330 C***56******                                                         S01117
0331 C*RN45******          EXSR HASH                                      S01117
0332 C***56******                                                         S01117
0333 C*RN46******          MOVE CRAM      ZZAMT                           S01117
0334 C***56******                                                         S01117
0335 C*RN46******          EXSR HASH                                      S01117
0336 C***56******                                                         S01117
0337 C*RN46******          MOVE BCAM      ZZAMT                           S01117
0338 C***56******                                                         S01117
0339 C*RN46******          EXSR HASH                                      S01117
     C***********                                                   E81077S01117
     C*****IF*POSTING IS ACROSS BRANCHES HASH RELEVANT AMOUNT TWICE E81077S01117
     C***********                                                   E81077S01117
     C***26******          DO                                       E81077S01117
     C***28******          MOVE CRAM      ZZAMT                     E81077S01117
     C***29******          MOVE DRAM      ZZAMT                     E81077S01117
     C***********                                                   E81077S01117
     C***********          EXSR HASH                                E81077S01117
     C***********          EXSR HASH                                E81077S01117
     C***********          END                                      E81077S01117
0340 C**
0341 C**   ACCESS ACCOUNT CODES FOR ACCOUNT TYPE
0342 C**   DR
0343 C**********           MOVEL'30'      KEYT                                                CGL029
0344 C**********           MOVELDCOD      KEYCOD  5                                           CGL029
0345 C**********           MOVE '1'       KEYCOD                                              CGL029
0346 C**********           MOVE KEYCOD    KEYT                                                CGL029
0347 C********** KEYT      CHAINTABLE                41                                       CGL029
     C                     MOVE DCOD      WACOD                                               CGL029
     C                     CALL 'AOACODR0'                                                    CGL029
     C                     PARM *BLANKS   @RTCD                                               CGL029
     C                     PARM '*KEY    '@OPTN                                               CGL029
     C                     PARM           WACOD                                               CGL029
     C           SDACOD    PARM SDACOD    DSSDY                                               CGL029
      *                                                                                       CGL029
      ** Move fields from SDACODPD                                                            CGL029
      *                                                                                       CGL029
     C           @RTCD     IFEQ *BLANKS                                                       CGL029
0348 C                     MOVE ATYP      DBTYP   1
0348 C**********           MOVE ACCS      DBSEC   2                                    S10736 CGL029
     C                     MOVE ACSC      DBSEC   2                                           CGL029
     C                     ENDIF                                                              CGL029
0349 C           DBTYP     COMP 'R'                      74
0350 C**   CR
0351 C**********           MOVELCCOD      KEYCOD                                              CGL029
0352 C**********           MOVE KEYCOD    KEYT                                                CGL029
0353 C********** KEYT      CHAINTABLE                41                                       CGL029
     C                     MOVE CCOD      WACOD                                               CGL029
     C                     CALL 'AOACODR0'                                                    CGL029
     C                     PARM *BLANKS   @RTCD                                               CGL029
     C                     PARM '*KEY    '@OPTN                                               CGL029
     C                     PARM           WACOD                                               CGL029
     C           SDACOD    PARM SDACOD    DSSDY                                               CGL029
      *                                                                                       CGL029
      ** Move fields from SDACODPD                                                            CGL029
      *                                                                                       CGL029
     C           @RTCD     IFEQ *BLANKS                                                       CGL029
0354 C                     MOVE ATYP      CRTYP   1
0348 C**********           MOVE ACCS      CRSEC   2                                    S10736 CGL029
     C                     MOVE ACSC      CRSEC   2                                           CGL029
     C                     ENDIF                                                              CGL029
0355 C           CRTYP     COMP 'R'                      75
0350 C**   CHARGE                                                         S01111
     C           CHSN      IFNE ' '                                       S01111
0351 C**********           MOVELCHCD      KEYCOD                                       S01111 CGL029
0352 C**********           MOVE KEYCOD    KEYT                                         S01111 CGL029
0353 C********** KEYT      CHAINTABLE                41                                S01111 CGL029
     C                     MOVE CHCD      WACOD                                               CGL029
     C                     CALL 'AOACODR0'                                                    CGL029
     C                     PARM *BLANKS   @RTCD                                               CGL029
     C                     PARM '*KEY    '@OPTN                                               CGL029
     C                     PARM           WACOD                                               CGL029
     C           SDACOD    PARM SDACOD    DSSDY                                               CGL029
      *                                                                                       CGL029
      ** Move fields from SDACODPD                                                            CGL029
      *                                                                                       CGL029
     C           @RTCD     IFEQ *BLANKS                                                       CGL029
0354 C                     MOVE ATYP      CHTYP   1                       S01111
0348 C**********           MOVE ACCS      CHSEC   2                                    S10736 CGL029
     C                     MOVE ACSC      CHSEC   2                                           CGL029
     C                     ENDIF                                                              CGL029
0355 C           CHTYP     COMP 'R'                      76               S01111
     C                     END                                            S01111
0356 C*****CHAIN*TO*CLINT*FILE*FOR*CUSTOMER*REPORT*NAME*************      E10051
0356 C*    CHAIN TO CLINT FILE FOR DEBIT CUSTOMER REPORT NAME             E10051
0357 C                     MOVELDCUS      KEYC    7
0358 C                     MOVE 'A'       KEYC
0359 C           KEYC      CHAINCLINT                42
0358 C                     MOVE CRNM      DENM   20                       E10051
     C/COPY WNCPYSRC,RE0350C003
0360 C**
0356 C*    CHAIN TO CLINT FILE FOR CREDIT CUSTOMER REPORT NAME            E10051
0357 C                     MOVELCCUS      KEYC    7                       E10051
0359 C           KEYC      CHAINCLINT                42                   E10051
0358 C                     MOVE CRNM      CENM   20                       E10051
     C/COPY WNCPYSRC,RE0350C004
0360 C**                                                                  E10051
0314 C*  SET UP FIELDS FOR HASH TOTALS                                    S01117
0313 C*                                                                   S01117
0315 C                     Z-ADD0         ZZAMT                           S01117
0315 C                     Z-ADD0         BCAM   150                      S01117
0316 C                     MOVE BCEQ      BCAM                            S01117
0317 C   46                MOVE CRAM      BCAM                            S01117
0318 C   45                MOVE DRAM      BCAM                            S01117
0319 C                     Z-ADD2         X                               S01117
0211 C*                                                                   S01117
0300 C*  SET UP TRANSACTION BRANCH DETAILS                                S01117
     C*                                                                   S01117
     C                     SETOF                         10               S01117
     C                     Z-ADDSTIX      IX                              S01117
     C           TRBR      LOKUPBCC,IX                   10               S01117
     C   10                MOVE BCT,IX    TBCI                            S01117
     C*                                                                   S01117
0306 C*  GENERATE POSTINGS                                                S01117
0306 C*  ACCUMULATE NO. OF RECORDS WRITTEN TO GECE IN NORE                S01117
0314 C*  ACC. VALUE OF RECORDS WRITTEN TO GECE IN  INT,2  DEC,2           S01117
     C*                                                                   S01117
     C  NU2                GOTO TOTAL                                     S01117
     C*                                                                   S01117
     C*  SET UP DEBIT AND CREDIT BRANCH DETAILS                           S01117
     C*    SINGLE BRANCH EXCHANGE                                         S01117
     C           MBEI      IFEQ 'N'                        *B1            S01117
     C                     MOVE TBCI      DBCI                            S01117
     C                     MOVE TBCI      CBCI                            S01117
     C*                                                                   S01117
     C*    OTHERWISE, TRANSACTION BRANCH MUST EQUAL                       S01117
     C*    EITHER OF DR OR CR BRANCH                                      S01117
     C                     ELSE                            *X1            S01117
     C*                                                                   S01117
     C           TRBR      IFEQ DRBR                       *B2            S01117
     C                     SETON                     83                   S01117
     C                     MOVE TBCI      DBCI                            S01117
     C*                                                                   S01117
     C                     SETOF                         10               S01117
     C                     Z-ADDSTIX      IX                              S01117
     C           CBRC      LOKUPBCC,IX                   10               S01117
     C   10                MOVE BCT,IX    CBCI                            S01117
     C*                                                                   S01117
     C                     ELSE                            *X2            S01117
     C                     SETOF                     83                   S01117
     C                     MOVE TBCI      CBCI                            S01117
     C*                                                                   S01117
     C                     SETOF                         10               S01117
     C                     Z-ADDSTIX      IX                              S01117
     C           DRBR      LOKUPBCC,IX                   10               S01117
     C   10                MOVE BCT,IX    DBCI                            S01117
     C*                                                                   S01117
     C                     END                             *E2            S01117
     C                     END                             *E1            S01117
      *                                                                   S01522
      **  Set up all possible Posting Narratives                          S01522
     C                     EXSR SRNARR                                    S01522
0299 C*                                                                   S01117
0300 C*  IF DR BRANCH NOT EQUAL TO CR BRANCH GENERATE INTERBRANCH A/C'S   S01117
0301 C*                                                                   S01117
0303 C           DRBR      COMP CBRC                     80               S01117
     C  N80                GOTO BRDIFF                                    S01117
     C*                                                                   S01117
     C* DR BRANCH = CR BRANCH                                             S01117
     C*                                                                   S01117
     C*                                                                   S01408
     C/COPY WNCPYSRC,RE0350CCP4                                           S01408
     C/COPY WNCPYSRC,RE0350C007                                           S01408
     C*                                                                   S01408
     C           BGN0ST    IFEQ 'Y'                                       CAC001
     C                     MOVE '0'       *IN38                           CAC001
      *                                                                   CAC001
      **  If DR a/c is retail or nostro, use profit centre of the a/c     CAC001
      *                                                                   CAC001
     C           DBTYP     IFEQ 'R'                                       CAC001
     C           DBTYP     OREQ 'N'                                       CAC001
     C                     MOVELDRBR      WBRC                            CAC001
     C**********           Z-ADDDCUS      WCUS                                         CAC001 CSD027
     C                     MOVE DCUS      WCUS                                                CSD027
     C                     MOVELDRCY      WCCY                            CAC001
     C                     Z-ADDDCOD      WACD                            CAC001
     C                     Z-ADDDACS      WACS                            CAC001
     C           ACKEY     CHAINACCBR                37                   CAC001
     C           *IN37     IFEQ '0'                                       CAC001
     C                     MOVE '1'       *IN38                           CAC001
     C                     ENDIF                                          CAC001
     C                     ENDIF                                          CAC001
     C                     ENDIF                                          CAC001
     C/COPY WNCPYSRC,RE0350C027
      *                                                                   CAC001
     C                     EXCPTPOST1                                     S01117
     C/COPY WNCPYSRC,RE0350C001
     C           CHSN      IFEQ ' '                                       S01117
     C           CHSN      OREQ '-'                                       S01117
     C           CHSN      OREQ 'C'                                                           257012
     C           CHSN      OREQ 'c'                                                           257012
     C           DRAM      DIV  1000      W153   153                      S01117
     C                     ELSE                                           S01117
     C           DCHAM     DIV  1000      W153                            S01117
     C                     END                                            S01117
     C                     ADD  W153      ZZAMT                           S01117
     C*                                                                   S01117
     C**********           EXCPTPOST5                               S01117E18408
     C*                                                                   S01408
     C/COPY WNCPYSRC,RE0350CCP4                                           S01408
     C/COPY WNCPYSRC,RE0350C008                                           S01408
     C*                                                                   S01408
     C           BGN0ST    IFEQ 'Y'                                       CAC001
     C                     MOVE '0'       *IN38                           CAC001
      *                                                                   CAC001
      **  If CR a/c is retail or nostro, use profit centre of the a/c     CAC001
      *                                                                   CAC001
     C           CRTYP     IFEQ 'R'                                       CAC001
     C           CRTYP     OREQ 'N'                                       CAC001
     C                     MOVELCBRC      WBRC                            CAC001
     C**********           Z-ADDCCUS      WCUS                                         CAC001 CSD027
     C                     MOVE CCUS      WCUS                                                CSD027
     C                     MOVELCRCY      WCCY                            CAC001
     C                     Z-ADDCCOD      WACD                            CAC001
     C                     Z-ADDCACS      WACS                            CAC001
     C           ACKEY     CHAINACCBR                37                   CAC001
     C           *IN37     IFEQ '0'                                       CAC001
     C                     MOVE '1'       *IN38                           CAC001
     C                     ENDIF                                          CAC001
     C                     ENDIF                                          CAC001
     C                     ENDIF                                          CAC001
     C/COPY WNCPYSRC,RE0350C028
      *                                                                   CAC001
     C                     EXCPTPOST4                                     E18408
     C/COPY WNCPYSRC,RE0350C002
     C           CHSN      IFEQ ' '                                       S01117
     C           CHSN      OREQ '+'                                       S01117
     C           CHSN      OREQ 'D'                                                           257012
     C           CHSN      OREQ 'd'                                                           257012
     C           CRAM      DIV  1000      W153                            S01117
     C                     ELSE                                           S01117
     C           CCHAM     DIV  1000      W153                            S01117
     C                     END                                            S01117
     C                     ADD  W153      ZZAMT                           S01117
     C                     ADD  2         NORE    50                      S01117
     C*                                                                   S01117
     C*  SYSTEM SUPPORTS BASE CCY TRADE & TRADE EQUIV. A/C                S01117
     C*    OR   DR CCY NOT EQUAL TO BASE CCY                              S01117
     C   56                                                               S01117
     CORN45                DO                                             S01117
     C*                                                                   S01117
     C**********           EXCPTPOST3                               S01117E18408
     C*                                                                   S01408
     C/COPY WNCPYSRC,RE0350CCP4                                           S01408
     C/COPY WNCPYSRC,RE0350C009                                           S01408
     C*                                                                   S01408
      *                                                                   CAC001
      **  Determine if Profit Centre can hold FX Position                 CAC001
      *                                                                   CAC001
     C           BGN0ST    IFEQ 'Y'                                       CAC001
     C                     EXSR SRPRFC                                    CAC001
     C                     ENDIF                                          CAC001
      *                                                                   CAC001
     C                     EXCPTPOST5                                     E18408
     C*                                                                   CAC001
     C           BGN0ST    IFEQ 'Y'                                       CAC001
     C           *IN34     ANDEQ'1'                                       CAC001
     C           *IN45     ANDEQ'1'                                       CAC001
     C           BGN0ST    OREQ 'Y'                                       CAC001
     C           *IN35     ANDEQ'1'                                       CAC001
     C           *IN46     ANDEQ'1'                                       CAC001
     C           MBCEQ     DIV  1000      W153                            CAC001
     C                     ELSE                                           CAC001
     C           BCAM      DIV  1000      W153                            S01117
     C                     ENDIF                                          CAC001
     C                     ADD  W153      ZZAMT                           S01117
     C*                                                                   S01117
     C**********           EXCPTPOST4                               S01117E18408
     C*                                                                   S01408
     C/COPY WNCPYSRC,RE0350CCP4                                           S01408
     C/COPY WNCPYSRC,RE0350C010                                           S01408
     C*                                                                   S01408
     C                     EXCPTPOST2                                     E18408
     C*                                                                   CAC001
     C           BGN0ST    IFEQ 'Y'                                       CAC001
     C           *IN34     ANDEQ'1'                                       CAC001
     C           MDRAM     DIV  1000      W153                            CAC001
     C                     ELSE                                           CAC001
     C           DRAM      DIV  1000      W153                            S01117
     C                     ENDIF                                          CAC001
     C                     ADD  W153      ZZAMT                           S01117
     C                     ADD  2         NORE                            S01117
     C                     END                                            S01117
     C*                                                                   S01117
     C*  SYSTEM SUPPORTS BASE CCY TRADE & TRADE EQUIV. A/C                S01117
     C*    OR   CR CCY NOT EQUAL TO BASE CCY                              S01117
     C   56                                                               S01117
     CORN46                DO                                             S01117
     C*                                                                   S01117
     C**********           EXCPTPOST2                               S01117E18408
     C*                                                                   S01408
     C/COPY WNCPYSRC,RE0350CCP4                                           S01408
     C/COPY WNCPYSRC,RE0350C011                                           S01408
     C*                                                                   S01408
      *                                                                   CAC001
      **  Determine if Profit Centre can hold FX Position                 CAC001
      *                                                                   CAC001
     C           BGN0ST    IFEQ 'Y'                                       CAC001
     C                     EXSR SRPRFC                                    CAC001
     C                     ENDIF                                          CAC001
      *                                                                   CAC001
     C                     EXCPTPOST3                                     E18408
     C*                                                                   CAC001
     C           BGN0ST    IFEQ 'Y'                                       CAC001
     C           *IN35     ANDEQ'1'                                       CAC001
     C           MCRAM     DIV  1000      W153                            CAC001
     C                     ELSE                                           CAC001
     C           CRAM      DIV  1000      W153                            S01117
     C                     ENDIF                                          CAC001
     C                     ADD  W153      ZZAMT                           S01117
     C*                                                                   S01408
     C/COPY WNCPYSRC,RE0350CCP4                                           S01408
     C/COPY WNCPYSRC,RE0350C012                                           S01408
     C*                                                                   S01408
     C                     EXCPTPOST6                                     S01117
     C*                                                                   CAC001
     C           BGN0ST    IFEQ 'Y'                                       CAC001
     C           *IN34     ANDEQ'1'                                       CAC001
     C           *IN45     ANDEQ'1'                                       CAC001
     C           BGN0ST    OREQ 'Y'                                       CAC001
     C           *IN35     ANDEQ'1'                                       CAC001
     C           *IN46     ANDEQ'1'                                       CAC001
     C           MBCEQ     DIV  1000      W153                            CAC001
     C                     ELSE                                           CAC001
     C           BCAM      DIV  1000      W153                            S01117
     C                     ENDIF                                          CAC001
     C                     ADD  W153      ZZAMT                           S01117
     C                     ADD  2         NORE                            S01117
     C                     END                                            S01117
      *                                                                   CAC001
      **  If Analytical Accounting is installed, setup output fields      CAC001
      **  for FX Margin Posting                                           CAC001
      *                                                                   CAC001
     C           BGN0ST    IFEQ 'Y'                                       CAC001
     C           MAMT      ANDNE0                                         CAC001
     C           DCIN      ANDNE' '                                                        MD050628
      *                                                                   CAC001
      **  Customer                                                        CAC001
      *                                                                   CAC001
     C                     MOVELTBICN     WFXCS   6                       CAC001
      *                                                                   CAC001
      **  Currency                                                        CAC001
      *                                                                   CAC001
     C           DCIN      IFEQ 'D'                                       CAC001
     C                     MOVELDRCY      WFXCY   3                       CAC001
     C                     ELSE                                           CAC001
     C                     MOVELCRCY      WFXCY                           CAC001
     C                     ENDIF                                          CAC001
      *                                                                   CAC001
      **  Associated Customer                                             CAC001
      *                                                                   CAC001
     C           DCIN      IFEQ 'D'                                       CAC001
     C                     MOVELDCUS      WFXAS   6                       CAC001
     C                     ELSE                                           CAC001
     C                     MOVELCCUS      WFXAS                           CAC001
     C                     ENDIF                                          CAC001
      *                                                                                       237304
      **  Value Date                                                                          237304
      *                                                                                       237304
     C                     Z-ADDRUND      TRUND                                               237304
     C           DCIN      IFEQ 'D'                                                           237304
     C                     Z-ADDDRVD      RUND                                                237304
     C                     ELSE                                                               237304
     C                     Z-ADDCRVD      RUND                                                237304
     C                     ENDIF                                                              237304
      *                                                                   CAC001
      **  Account type, account section, and retail indicator             CAC001
      *                                                                   CAC001
     C                     CALL 'AOACODR0'                                CAC001
     C                     PARM '*MSG   ' WRTCD   7                       CAC001
     C                     PARM '*KEY   ' WOPTN   7                       CAC001
     C**********           PARM FTFMAC    WACOD   4                                    CAC001 CGL029
     C********** SDACOD    PARM SDACOD    DSFDY                                        CAC001 CGL029
     C                     PARM FTFMAC    WACOD  10                                           CGL029
     C           SDACOD    PARM SDACOD    DSSDY                                               CGL029
      *                                                                   CAC001
     C           WRTCD     IFNE *BLANKS                                   CAC001
     C           *LOCK     IN   LDA                                       CAC001
     C                     MOVELFTFMAC    DBKEY            ************   CAC001
     C                     MOVEL'SDACODPD'DBFILE           * DBERR 27 *   CAC001
     C                     Z-ADD27        DBASE            ************   CAC001
     C                     OUT  LDA                                       CAC001
     C                     SETON                     U7U8LR               CAC001
     C                     GOTO TOTAL                                     CAC001
     C                     ENDIF                                          CAC001
     C                     MOVE ATYP      WFXTY   1                       CAC001
     C                     MOVE ACSC      WFXSC   2                       CAC001
     C           WFXTY     IFEQ 'R'                                       CAC001
     C                     MOVE '1'       WFXRI   1                       CAC001
     C                     ELSE                                           CAC001
     C                     MOVE '0'       WFXRI                           CAC001
     C                     ENDIF                                          CAC001
      *                                                                   CAC001
      **  Add posting margin amount to the hash totals                    CAC001
      *                                                                   CAC001
     C           MAMT      DIV  1000      W153                            CAC001
     C                     ADD  W153      ZZAMT                           CAC001
     C                     ADD  1         NORE                            CAC001
      *                                                                   CAC001
     C                     MOVE '0'       *IN38                           CAC001
      *                                                                   CAC001
      **  If a/c is retail or nostro, use profit centre of the a/c        CAC001
      *                                                                   CAC001
     C           WFXTY     IFEQ 'R'                                       CAC001
     C           WFXTY     OREQ 'N'                                       CAC001
     C                     MOVELTRBR      WBRC                            CAC001
     C                     MOVELWFXCS     WCUS                            CAC001
     C                     MOVELWFXCY     WCCY                            CAC001
     C                     MOVELFTFMAC    WACD                            CAC001
     C                     Z-ADD1         WACS                            CAC001
     C           ACKEY     CHAINACCBR                37                   CAC001
     C           *IN37     IFEQ '0'                                       CAC001
     C                     MOVE '1'       *IN38                           CAC001
     C                     ENDIF                                          CAC001
     C                     ENDIF                                          CAC001
      *                                                                   CAC001
      **  Output FX Margin Posting                                        CAC001
      *                                                                   CAC001
     C                     EXCPTPOSTFX                                    CAC001
     C                     Z-ADDTRUND     RUND                                                237304
     C                     ENDIF                                          CAC001
     C*                                                                   S01117
     C                     EXSR HASH                                      S01117
     C                     GOTO TOTAL                                     S01117
     C*                                                                   S01117
     C*   DR BRANCH NOT = CR BRANCH                                       S01117
     C*                                                                   S01117
     C           BRDIFF    TAG                             *** BRDIFF *** S01117
     C*                                                                   S01117
     C*   SET ON IND.55 IF ENTRIES TO BE GENERATED VIA MAIN BRANCH AND    S01117
     C*   NEITHER DR OR CR BRANCH = MAIN BRANCH                           S01117
     C*                                                                   S01117
     C           BKIEMB    IFEQ 'Y'                                       S01117
     C           BKMABR    ANDNEDRBR                                      S01117
     C           BKMABR    ANDNECBRC                                      S01117
     C                     SETON                     55                   S01117
     C                     ELSE                                           S01117
     C                     SETOF                     55                   S01117
     C                     END                                            S01117
     C/COPY WNCPYSRC,RE0350C023
     C*                                                                   S01117
     C*   DR BRANCH POSTINGS                                              S01117
     C*                                                                   S01117
     C*                                                                   S01117
     C                     SETON                     81                   S01117
     C                     SETOF                     82                   S01117
     C*                                                                   S01117
     C*                                                                   S01408
     C/COPY WNCPYSRC,RE0350CCP4                                           S01408
     C/COPY WNCPYSRC,RE0350C013                                           S01408
     C*                                                                   S01408
     C           BGN0ST    IFEQ 'Y'                                       CAC001
     C                     MOVE '0'       *IN38                           CAC001
      *                                                                   CAC001
      **  If DR a/c is retail or nostro, use profit centre of the a/c     CAC001
      *                                                                   CAC001
     C           DBTYP     IFEQ 'R'                                       CAC001
     C           DBTYP     OREQ 'N'                                       CAC001
     C                     MOVELDRBR      WBRC                            CAC001
     C**********           Z-ADDDCUS      WCUS                                         CAC001 CSD027
     C                     MOVE DCUS      WCUS                                                CSD027
     C                     MOVELDRCY      WCCY                            CAC001
     C                     Z-ADDDCOD      WACD                            CAC001
     C                     Z-ADDDACS      WACS                            CAC001
     C           ACKEY     CHAINACCBR                37                   CAC001
     C           *IN37     IFEQ '0'                                       CAC001
     C                     MOVE '1'       *IN38                           CAC001
     C                     ENDIF                                          CAC001
     C                     ENDIF                                          CAC001
     C                     ENDIF                                          CAC001
     C/COPY WNCPYSRC,RE0350C029
      *                                                                   CAC001
     C                     EXCPTPOST1                                     S01117
     C/COPY WNCPYSRC,RE0350C030
     C           CHSN      IFEQ ' '                                       S01117
     C           CHSN      OREQ '-'                                       S01117
     C           CHSN      OREQ 'C'                                                           257012
     C           CHSN      OREQ 'c'                                                           257012
     C           DRAM      DIV  1000      W153                            S01117
     C                     ELSE                                           S01117
     C           DCHAM     DIV  1000      W153                            S01117
     C                     END                                            S01117
     C                     ADD  W153      ZZAMT                           S01117
     C*                                                                   S01117
     C*                                                                   S01408
     C/COPY WNCPYSRC,RE0350CCP4                                           S01408
     C/COPY WNCPYSRC,RE0350C014                                           S01408
     C*                                                                   S01408
     C                     EXCPTPOST7                                     S01117
     C   83      CRAM      DIV  1000      W153                            S01117
     C  N83      DRAM      DIV  1000      W153                            S01117
     C                     ADD  W153      ZZAMT                           S01117
     C                     ADD  2         NORE                            S01117
     C/COPY WNCPYSRC,RE0350C024
     C*                                                                   S01117
     C*   CR BRANCH POSTINGS                                              S01117
     C*                                                                   S01117
     C                     SETON                     82                   S01117
     C                     SETOF                     81                   S01117
     C*                                                                   S01117
     C**********           EXCPTPOST5                               S01117E18408
     C*                                                                   S01408
     C/COPY WNCPYSRC,RE0350CCP4                                           S01408
     C/COPY WNCPYSRC,RE0350C015                                           S01408
     C*                                                                   S01408
     C           BGN0ST    IFEQ 'Y'                                       CAC001
     C                     MOVE '0'       *IN38                           CAC001
      *                                                                   CAC001
      **  If CR a/c is retail or nostro, use profit centre of the a/c     CAC001
      *                                                                   CAC001
     C           CRTYP     IFEQ 'R'                                       CAC001
     C           CRTYP     OREQ 'N'                                       CAC001
     C                     MOVELCBRC      WBRC                            CAC001
     C**********           Z-ADDCCUS      WCUS                                         CAC001 CSD027
     C                     MOVE CCUS      WCUS                                                CSD027
     C                     MOVELCRCY      WCCY                            CAC001
     C                     Z-ADDCCOD      WACD                            CAC001
     C                     Z-ADDCACS      WACS                            CAC001
     C           ACKEY     CHAINACCBR                37                   CAC001
     C           *IN37     IFEQ '0'                                       CAC001
     C                     MOVE '1'       *IN38                           CAC001
     C                     ENDIF                                          CAC001
     C                     ENDIF                                          CAC001
     C                     ENDIF                                          CAC001
     C/COPY WNCPYSRC,RE0350C031
      *                                                                   CAC001
     C                     EXCPTPOST4                                     E18408
     C/COPY WNCPYSRC,RE0350C032
     C           CHSN      IFEQ ' '                                       S01117
     C           CHSN      OREQ '+'                                       S01117
     C           CHSN      OREQ 'D'                                                           257012
     C           CHSN      OREQ 'd'                                                           257012
     C           CRAM      DIV  1000      W153                            S01117
     C                     ELSE                                           S01117
     C           CCHAM     DIV  1000      W153                            S01117
     C                     END                                            S01117
     C                     ADD  W153      ZZAMT                           S01117
     C*                                                                   S01117
     C*                                                                   S01408
     C/COPY WNCPYSRC,RE0350CCP4                                           S01408
     C/COPY WNCPYSRC,RE0350C016                                           S01408
     C*                                                                   S01408
     C                     EXCPTPOST8                                     S01117
     C   83      CRAM      DIV  1000      W153                            S01117
     C  N83      DRAM      DIV  1000      W153                            S01117
     C                     ADD  W153      ZZAMT                           S01117
     C                     ADD  2         NORE                            S01117
     C/COPY WNCPYSRC,RE0350C025
     C*                                                                   S01117
     C*   TRANSACTION BRANCH POSTINGS                                     S01117
     C*     SYSTEM SUPPORTS BASE CCY TRADE & TRADE EQUIV. A/C             S01117
     C*     OR   DR CCY NOT EQUAL TO BASE CCY                             S01117
     C*                                                                   S01117
     C   56                                                               S01117
     CORN45                DO                                             S01117
     C*                                                                   S01117
     C**********           EXCPTPOST3                               S01117E18408
     C*                                                                   S01408
     C/COPY WNCPYSRC,RE0350CCP4                                           S01408
     C/COPY WNCPYSRC,RE0350C017                                           S01408
     C*                                                                   S01408
      *                                                                   CAC001
      **  Determine if Profit Centre can hold FX Position                 CAC001
      *                                                                   CAC001
     C           BGN0ST    IFEQ 'Y'                                       CAC001
     C                     EXSR SRPRFC                                    CAC001
     C                     ENDIF                                          CAC001
      *                                                                   CAC001
     C                     EXCPTPOST5                                     E18408
     C*                                                                   CAC001
     C           BGN0ST    IFEQ 'Y'                                       CAC001
     C           *IN34     ANDEQ'1'                                       CAC001
     C           *IN45     ANDEQ'1'                                       CAC001
     C           BGN0ST    OREQ 'Y'                                       CAC001
     C           *IN35     ANDEQ'1'                                       CAC001
     C           *IN46     ANDEQ'1'                                       CAC001
     C           MBCEQ     DIV  1000      W153                            CAC001
     C                     ELSE                                           CAC001
     C           BCAM      DIV  1000      W153                            S01117
     C                     ENDIF                                          CAC001
     C                     ADD  W153      ZZAMT                           S01117
     C*                                                                   S01117
     C**********           EXCPTPOST4                               S01117E18408
     C*                                                                   S01408
     C/COPY WNCPYSRC,RE0350CCP4                                           S01408
     C/COPY WNCPYSRC,RE0350C018                                           S01408
     C*                                                                   S01408
     C                     EXCPTPOST2                                     E18408
     C*                                                                   CAC001
     C           BGN0ST    IFEQ 'Y'                                       CAC001
     C           *IN34     ANDEQ'1'                                       CAC001
     C           MDRAM     DIV  1000      W153                            CAC001
     C                     ELSE                                           CAC001
     C           DRAM      DIV  1000      W153                            S01117
     C                     ENDIF                                          CAC001
     C                     ADD  W153      ZZAMT                           S01117
     C                     ADD  2         NORE                            S01117
     C                     END                                            S01117
     C*                                                                   S01117
     C*     SYSTEM SUPPORTS BASE CCY TRADE & TRADE EQUIV. A/C             S01117
     C*     OR   CR CCY NOT EQUAL TO BASE CCY                             S01117
     C   56                                                               S01117
     CORN46                DO                                             S01117
     C*                                                                   S01117
     C**********           EXCPTPOST2                               S01117E18408
     C*                                                                   S01408
     C/COPY WNCPYSRC,RE0350CCP4                                           S01408
     C/COPY WNCPYSRC,RE0350C019                                           S01408
     C*                                                                   S01408
      *                                                                   CAC001
      **  Determine if Profit Centre can hold FX Position                 CAC001
      *                                                                   CAC001
     C           BGN0ST    IFEQ 'Y'                                       CAC001
     C                     EXSR SRPRFC                                    CAC001
     C                     ENDIF                                          CAC001
      *                                                                   CAC001
     C                     EXCPTPOST3                                     E18408
     C*                                                                   CAC001
     C           BGN0ST    IFEQ 'Y'                                       CAC001
     C           *IN35     ANDEQ'1'                                       CAC001
     C           MCRAM     DIV  1000      W153                            CAC001
     C                     ELSE                                           CAC001
     C           CRAM      DIV  1000      W153                            S01117
     C                     ENDIF                                          CAC001
     C                     ADD  W153      ZZAMT                           S01117
     C*                                                                   S01408
     C/COPY WNCPYSRC,RE0350CCP4                                           S01408
     C/COPY WNCPYSRC,RE0350C020                                           S01408
     C*                                                                   S01408
     C*                                                                   S01117
     C                     EXCPTPOST6                                     S01117
     C*                                                                   CAC001
     C           BGN0ST    IFEQ 'Y'                                       CAC001
     C           *IN34     ANDEQ'1'                                       CAC001
     C           *IN45     ANDEQ'1'                                       CAC001
     C           BGN0ST    OREQ 'Y'                                       CAC001
     C           *IN35     ANDEQ'1'                                       CAC001
     C           *IN46     ANDEQ'1'                                       CAC001
     C           MBCEQ     DIV  1000      W153                            CAC001
     C                     ELSE                                           CAC001
     C           BCAM      DIV  1000      W153                            S01117
     C                     ENDIF                                          CAC001
     C                     ADD  W153      ZZAMT                           S01117
     C                     ADD  2         NORE                            S01117
     C                     END                                            S01117
     C*                                                                   S01117
     C*   IF INTERBRANCH ENTRIES TO BE GENERATED VIA MAIN BRANCH, AND     S01117
     C*   NEITHER DR OR CR BRANCH = MAIN BRANCH, GENERATE MAIN BR.ENTRIES S01117
     C*                                                                   S01117
     C           *IN55     IFEQ '1'                                       S01117
     C*                                                                   S01117
     C*                                                                   S01408
     C/COPY WNCPYSRC,RE0350CCP4                                           S01408
     C/COPY WNCPYSRC,RE0350C021                                           S01408
     C*                                                                   S01408
     C                     EXCPTPOST10                                    S01117
     C   83      CRAM      DIV  1000      W153                            S01117
     C  N83      DRAM      DIV  1000      W153                            S01117
     C                     ADD  W153      ZZAMT                           S01117
     C*                                                                   S01117
     C**********           EXCPTPOST11                              S01117E18408
     C*                                                                   S01408
     C/COPY WNCPYSRC,RE0350CCP4                                           S01408
     C/COPY WNCPYSRC,RE0350C022                                           S01408
     C*                                                                   S01408
     C                     EXCPTPOST9                                     E18408
     C   83      CRAM      DIV  1000      W153                            S01117
     C  N83      DRAM      DIV  1000      W153                            S01117
     C                     ADD  W153      ZZAMT                           S01117
     C                     ADD  2         NORE                            S01117
     C                     END                                            S01117
      *                                                                   CAC001
      **  If Analytical Accounting is installed, setup output fields      CAC001
      **  for FX Margin Posting                                           CAC001
      *                                                                   CAC001
     C           BGN0ST    IFEQ 'Y'                                       CAC001
     C           MAMT      ANDNE0                                         CAC001
     C           DCIN      ANDNE' '                                                        MD050628
      *                                                                   CAC001
      **  Customer                                                        CAC001
      *                                                                   CAC001
     C                     MOVELTBICN     WFXCS   6                       CAC001
      *                                                                   CAC001
      **  Currency                                                        CAC001
      *                                                                   CAC001
     C           DCIN      IFEQ 'D'                                       CAC001
     C                     MOVELDRCY      WFXCY   3                       CAC001
     C                     ELSE                                           CAC001
     C                     MOVELCRCY      WFXCY                           CAC001
     C                     ENDIF                                          CAC001
      *                                                                   CAC001
      **  Associated Customer                                             CAC001
      *                                                                   CAC001
     C           DCIN      IFEQ 'D'                                       CAC001
     C                     MOVELDCUS      WFXAS   6                       CAC001
     C                     ELSE                                           CAC001
     C                     MOVELCCUS      WFXAS                           CAC001
     C                     ENDIF                                          CAC001
      *                                                                   CAC001
      **  Account type, account section, and retail indicator             CAC001
      *                                                                   CAC001
     C                     CALL 'AOACODR0'                                CAC001
     C                     PARM '*MSG   ' WRTCD   7                       CAC001
     C                     PARM '*KEY   ' WOPTN   7                       CAC001
     C**********           PARM FTFMAC    WACOD   4                                    CAC001 CGL029
     C********** SDACOD    PARM SDACOD    DSFDY                                        CAC001 CGL029
     C                     PARM FTFMAC    WACOD                                               CGL029
     C           SDACOD    PARM SDACOD    DSSDY                                               CGL029
      *                                                                   CAC001
     C           WRTCD     IFNE *BLANKS                                   CAC001
     C           *LOCK     IN   LDA                                       CAC001
     C                     MOVELFTFMAC    DBKEY            ************   CAC001
     C                     MOVEL'SDACODPD'DBFILE           * DBERR 27 *   CAC001
     C                     Z-ADD27        DBASE            ************   CAC001
     C                     OUT  LDA                                       CAC001
     C                     SETON                     U7U8LR               CAC001
     C                     GOTO TOTAL                                     CAC001
     C                     ENDIF                                          CAC001
     C                     MOVE ATYP      WFXTY   1                       CAC001
     C                     MOVE ACSC      WFXSC   2                       CAC001
     C           WFXTY     IFEQ 'R'                                       CAC001
     C                     MOVE '1'       WFXRI   1                       CAC001
     C                     ELSE                                           CAC001
     C                     MOVE '0'       WFXRI                           CAC001
     C                     ENDIF                                          CAC001
      *                                                                   CAC001
      **  Add posting margin amount to the hash totals                    CAC001
      *                                                                   CAC001
     C           MAMT      DIV  1000      W153                            CAC001
     C                     ADD  W153      ZZAMT                           CAC001
     C                     ADD  1         NORE                            CAC001
      *                                                                   CAC001
     C                     MOVE '0'       *IN38                           CAC001
      *                                                                   CAC001
      **  If a/c is retail or nostro, use profit centre of the a/c        CAC001
      *                                                                   CAC001
     C           WFXTY     IFEQ 'R'                                       CAC001
     C           WFXTY     OREQ 'N'                                       CAC001
     C                     MOVELTRBR      WBRC                            CAC001
     C                     MOVELWFXCS     WCUS                            CAC001
     C                     MOVELWFXCY     WCCY                            CAC001
     C                     MOVELFTFMAC    WACD                            CAC001
     C                     Z-ADD1         WACS                            CAC001
     C           ACKEY     CHAINACCBR                37                   CAC001
     C           *IN37     IFEQ '0'                                       CAC001
     C                     MOVE '1'       *IN38                           CAC001
     C                     ENDIF                                          CAC001
     C                     ENDIF                                          CAC001
      *                                                                   CAC001
      **  Output FX Margin Posting                                        CAC001
      *                                                                   CAC001
     C                     EXCPTPOSTFX                                    CAC001
     C                     ENDIF                                          CAC001
     C*                                                                   S01117
     C                     EXSR HASH                                      S01117
     C*                                                                   S01408
     C/COPY WNCPYSRC,RE0350CCP5                                           S01408
     C*                                                                   S01408
0313 C*                                                                   S01117
0361 C           TOTAL     TAG                             *** TOTAL ***
      *                                                                   CAC001
     C           BGN0ST    IFEQ 'Y'                                       CAC001
     C           CHAM      ANDNE0                                         CAC001
     C           *INU7     ANDEQ'0'                                       CAC001
     C                     MOVE '0'       *IN38                           CAC001
      *                                                                   CAC001
      **  If Charges account is retail or nostro, use a/c's profit cent   CAC001
      *                                                                   CAC001
     C           CHTYP     IFEQ 'R'                                       CAC001
     C           CHTYP     OREQ 'N'                                       CAC001
      *                                                                   CAC001
     C**********           Z-ADDCHCN      WCUS                                         CAC001 CSD027
     C                     MOVE CHCN      WCUS                                                CSD027
     C                     Z-ADDCHCD      WACD                            CAC001
     C                     Z-ADDCHSQ      WACS                            CAC001
     C           *IN31     IFEQ '1'                                       CAC001
     C                     MOVELDRBR      WBRC                            CAC001
     C                     MOVELDRCY      WCCY                            CAC001
     C                     ELSE                                           CAC001
     C                     MOVELCBRC      WBRC                            CAC001
     C                     MOVELCRCY      WCCY                            CAC001
     C                     ENDIF                                          CAC001
      *                                                                   CAC001
     C           ACKEY     CHAINACCBR                37                   CAC001
     C           *IN37     IFEQ '0'                                       CAC001
     C                     MOVE '1'       *IN38                           CAC001
     C                     ENDIF                                          CAC001
      *                                                                   CAC001
     C                     ENDIF                                          CAC001
      *                                                                   CAC001
     C                     ENDIF                                          CAC001
      *                                                                   CAC001
0362 C   01
0363 COR 12      NUMCE     ADD  1         NUMCE
     C   12                SETON                     48                   S01117
     C*                                                                   S01408
     C** Core hook for externalisation.                                   S01408
     C/COPY WNCPYSRC,RE0350CCP2                                           S01408
     C*                                                                   S01408
     C*                                                                   S01117
     C** IF P1 SPOOL FILE IS NOT YET OPEN, THEN OPEN IT                   S01117
     C*                                                                   S01117
     CLRN59                EXSR #ZZ                                       S01117
     C**                                                                  S01117
     C*       ENSURE TOTAL SPOOL FILE RECORDED BY RCF                     S01117
     C**                                                                  S01117
     CLR                   Z-ADDSFNUMU    ZSNUMU  60                      S01117
     C**                                                                  S01117
     CLR                   CALL 'ZSFILE'                                  S01117
     CLR                   PARM           SEQ     5                       S01117
     CLR                   PARM *BLANK    SENTY   3                       S01117
     CLR                   PARM           SFILEU                          S01117
     CLR                   PARM           ZSNUMU                          S01117
     CLR                   PARM           ZSERR   1                       S01117
     C*                                                                   S01117
     CLR         ZSERR     IFEQ 'Y'                                       S01117
     C**  ERROR DURING ZSFILE PROCESSING, RETURN TO CALLING PROGRAM       S01117
     CLR                   SETON                     U7U8                 S01117
     CLR                   RETRN                                          S01117
     CLR                   END                                            S01117
     C*                                                                   S01117
     C*    CHECK FILE CONTROLS ONLY IF MBIN = N OR REQUESTED              S01117
     C*    BRANCH = 'ALL'                                                 S01117
     CLR         *INU8     IFEQ '0'                        *B1            S01117
     CLR         MBIN      IFEQ 'N'                        *B2            S01117
     CLR         BRNCH     OREQ 'ALL'                                     S01117
0364 C*
0365 C* COMP ACC. VALUES WITH FILE CONTROLS ON HEADER
0366 C*
0367 C*RN13******          SETON                     OF                   S01117
      *                                                                                    MD030959A
      ** MPHAS 'A' OR 'G'                                                                  MD030959A
      *                                                                                    MD030959A
     CLR         W@PHAS    IFEQ 'A'                                                        MD030959A
     CLR         W@PHAS    OREQ 'G'                                                        MD030959A
     CLR                   Z-ADDINT,1     ICHCEW 150                                       MD030959A
     CLR                   Z-ADDDEC,1     ICHCED  30                                       MD030959A
     CLR         NUMCE     COMP ICNOCE               U8U8                                  MD030959A
     CLRNU8      INT,1     COMP ICHCEW               U8U8  -OUT OF BALANCE                 MD030959A
     CLR         DEC,1     COMP ICHCED               U8U8                                  MD030959A
     CLR                   ELSE                                                            MD030959A
0368 CLR         NUMCE     COMP NOCE                 U8U8
0369 CLRNU8      INT,1     COMP HCEW                 U8U8
0370 CLRNU8      DEC,1     COMP HCED                 U8U8
     CLR                   ENDIF                                                           MD030959A
     C*                                                                   S01117
     CLR                   END                             *E2            S01117
     CLR                   END                             *E1            S01117
     C*                                                                   S01117
0371 CLR         NORE      ADD  2         NORE
     C*                                                                   S01117
     C**   EXCUTE ERROR ROUTINE IF DATABASE ERROR EXISTS                  S01117
     C**                                                                  S01117
     CLR U7                EXSR *PSSR                                     S01117
     C**                                                                  S01111
     C********************************************************************S01111
     C/EJECT                                                              CAC001
     C********************************************************************CAC001
     C**                                                                  CAC001
     C**  SRPRFC SR. TO DETERMINE IF PROFIT CENTRE CAN HOLD FX POSITION   CAC001
     C**                                                                  CAC001
     C           SRPRFC    BEGSR                                          CAC001
      *                                                                   CAC001
      **  Access Profit Centre details via access object                  CAC001
      *                                                                   CAC001
     C                     MOVE '0'       *IN39                           CAC001
     C                     CALL 'AOPRFCR0'                                CAC001
     C                     PARM *BLANKS   WRTCD   7                       CAC001
     C                     PARM '*KEY   ' WOPTN   7                       CAC001
     C                     PARM PRFC      WPRFC   4                       CAC001
     C           SDPRFC    PARM SDPRFC    DSFDY                           CAC001
      *                                                                   CAC001
      **  Database error if not found                                     CAC001
      *                                                                   CAC001
     C           WRTCD     IFNE *BLANKS                                   CAC001
     C                     SETON                     U7U8LR               CAC001
     C           *LOCK     IN   LDA                                       CAC001
     C                     Z-ADD28        DBASE            ************   CAC001
     C                     MOVELPRFC      DBKEY            * DBERR 28 *   CAC001
     C                     MOVEL'SDPRFCPD'DBFILE           ************   CAC001
     C                     OUT  LDA                                       CAC001
     C                     GOTO TOTAL                                     CAC001
     C                     ELSE                                           CAC001
      *                                                                   CAC001
      **  Seton indicator 39 if FX Position Profit Centre is to be used   CAC001
      *                                                                   CAC001
     C           DSFPPC    IFNE *BLANK                                    CAC001
     C                     MOVE '1'       *IN39                           CAC001
     C                     ENDIF                                          CAC001
     C                     ENDIF                                          CAC001
      *                                                                   CAC001
     C                     ENDSR                                          CAC001
     C********************************************************************CAC001
     C/EJECT                                                              CAC001
     C********************************************************************CAC001
     C**                                                                  S01111
     C**   ZDATE2 SR. TO CONVERT A DAY NUMBER TO DATE FORMATS.            S01111
     C**                                                                  S01111
     C           ZDATE2    BEGSR                           *** ZDATE2 *** S01111
     C**                                                                  S01111
     C**   CLEAR DATE FIELDS.                                             S01111
     C                     Z-ADD0         ZDATE   60                      S01111
     C                     MOVEL'       ' ZADATE  7                       S01111
     C**                                                                  S01111
     C**   CALCULATION TO DEFINE INPUT DAY NUMBER.                        S01111
     C                     Z-ADDZDAYNO    ZDAYNO  50                      S01111
     C**                                                                  S01111
     C**   DETERMINE YEAR NUMBER.                                         S01111
     C**                                                                  S01111
     C**   ADJUST DAY NUMBER IN CASE LAST DAY OF YEAR.                    S01111
     C           ZDAYNO    SUB  1         ZDAYN1  50   99                 S01111
     C   99                GOTO ZDEND2                                    S01111
     C**                                                                  S01111
     C**   CALCULATE NUMBER OF 4 YEAR SPANS SINCE 31/12/1971.             S01111
     C           ZDAYN1    DIV  1461      ZLYR    20                      S01111
     C                     MVR            ZDAYN1           SAVE REMAINING S01111
     C**                                                   DAYS           S01111
     C**   CALCULATE NUMBER OF REMAINING YEARS.                           S01111
     C                     Z-ADD1         ZWRK2   20                      S01111
     C           ZDTAG1    TAG                             ** ZDTAG1 TAG *S01111
     C           ZDAYN1    COMP ZYDY,ZWRK2             90                 S01111
     C  N90      ZWRK2     ADD  1         ZWRK2                           S01111
     C  N90                GOTO ZDTAG1                                    S01111
     C           ZWRK2     SUB  1         ZWRK2          91LEAP YR, 91 ON S01111
     C**                                                                  S01111
     C**   DECREMENT DAY NO. BY DAYS IN REMAINING YEARS.                  S01111
     C  N91      ZDAYN1    SUB  ZYDY,ZWRK2ZDAYN1                          S01111
     C**                                                                  S01111
     C**   CALCULATE ACTUAL YEAR NUMBER.                                  S01111
     C           ZLYR      MULT 4         ZWRK3   30                      S01111
     C           ZWRK3     ADD  72        ZWRK3            BASE IS 1972   S01111
     C                     Z-ADDZWRK3     ZYEAR   20                      S01111
     C           ZYEAR     ADD  ZWRK2     ZYEAR            YEAR           S01111
     C**                                                                  S01111
     C**   DETERMINE MONTH NUMBER.                                        S01111
     C**                                                                  S01111
     C**   ADJUST DAY NO. IN CASE LAST DAY OF LEAP YEAR FEBRUARY.         S01111
     C                     SETOF                     9293                 S01111
     C   91      ZDAYN1    COMP 59                     9293               S01111
     C   91N92   ZDAYN1    SUB  1         ZDAYN1                          S01111
     C**                                                                  S01111
     C**   CALCULATE MONTH NUMBER.                                        S01111
     C                     Z-ADD2         ZWRK2                           S01111
     C           ZDTAG2    TAG                             ** ZDTAG2 TAG *S01111
     C           ZDAYN1    COMP ZMDY,ZWRK2             94                 S01111
     C  N94      ZWRK2     ADD  1         ZWRK2                           S01111
     C  N94                GOTO ZDTAG2                                    S01111
     C           ZWRK2     SUB  1         ZWRK2                           S01111
     C**                                                                  S01111
     C                     Z-ADDZWRK2     ZMTH    20       MONTH          S01111
     C**                                                                  S01111
     C**   DETERMINE DAY OF MONTH.                                        S01111
     C**                                                                  S01111
     C**   ADD BACK LAST DAY OF YEAR ADJUSTMENT.                          S01111
     C           ZDAYN1    ADD  1         ZDAYN1                          S01111
     C**                                                                  S01111
     C**   CALCULATE DAY OF MONTH.                                        S01111
     C           ZDAYN1    SUB  ZMDY,ZWRK2ZDAY    20       DAY            S01111
     C**                                                                  S01111
     C**   ADD BACK LEAP YEAR 29TH FEBUARY ADJUSTMENT, IF REQUIRED.       S01111
     C   93      ZDAY      ADD  1         ZDAY                            S01111
     C**                                                                  S01111
     C**   FORMAT DATE, DDMMYY OR MMDDYY.                                 S01111
     C  N98                MOVELZDAY      ZWRK4   40                      S01111
     C   98                MOVE ZDAY      ZWRK4                           S01111
     C  N98                MOVE ZMTH      ZWRK4                           S01111
     C   98                MOVELZMTH      ZWRK4                           S01111
     C                     MOVELZWRK4     ZDATE                           S01111
     C                     MOVE ZYEAR     ZDATE                           S01111
     C**                                                                  S01111
     C**   FORMAT ALPHA DATE, DDMMMYY.                                    S01111
     C           ZDAY      COMP 10                     95                 S01111
     C                     MOVELZDAY      ZWRK5   5                       S01111
     C   95                MOVEL' '       ZWRK5                           S01111
     C                     MOVE ZMNM,ZMTH ZWRK5                           S01111
     C                     MOVELZWRK5     ZADATE                          S01111
     C                     MOVE ZYEAR     ZADATE                          S01111
     C**                                                                  S01111
     C           ZDEND2    TAG                                            S01111
     C                     SETOF                     90                   S01111
     C                     ENDSR                                          S01111
     C**                                                                  S01111
     C**                                                                  S01111
     C********************************************************************S01111
0372 C******************************************    **********************
0373 C           HASH      BEGSR
0374 C                     Z-ADDINT,X     ZZTOTI
0375 C                     Z-ADDDEC,X     ZZTOTD
0376 C                     EXSR GLZADD
0377 C                     Z-ADDZZTOTI    INT,X
0378 C                     Z-ADDZZTOTD    DEC,X
0379 C                     ENDSR
0380 C********************************************************************
0381 C**
0382 C**   ZSYSTM SR. TO CHAIN TO THE INSTALLATION CONTROL DATA RECORD.
0383 C**
0384 C           ZSYSTM    BEGSR                           *** ZSYSTM ***
0385 C**
0386 C**   SET UP KEY FOR INSTALLATION CONTROL RECORD.
0387 C                     MOVEL'01      'ZTABKY 12
0388 C                     MOVE '  10'    ZTABKY
0389 C**
0390 C           ZTABKY    CHAINTABLE                99    ON NOT THERE
0391 C  N99      RECI      COMP 'D'                  9999  ON, IS DELETED
0392 C**
0393 C**   CHECK SYSTEM DATE FORMAT, DDMMYY OR MMDDYY.
0394 C           DATF      COMP 'M'                      98MMDDYY, 98 ON
0395 C**
0396 C                     ENDSR
0397 C**
0398 C**
0399 C********************************************************************
0400 C********************************************************************
0401 C* SUBROUTINE TO ADD AN AMOUNT (ZZAMT) TO THE TOTAL (ZZTOTI,ZZTOTD)
0402 C*   IND '99' IS SET BY AN OVERFLOW ERROR
0403 C*
0404 CSR         GLZADD    BEGSR                           *** GLZADD ****
0405 C*
0406 CSR                   Z-ADDZZAMT     ZZAMT  153     91-DEFINE ZZAMT
0407 CSR 91                GOTO ZZAEND                     AMT = 0.BYPASS
0408 C*
0409 C* SPLIT ZZAMT INTO INTEGER AND DECIMAL FIELDS
0410 CSR                   Z-ADDZZAMT     ZZAMTI 150       INTEGER FIELD
0411 CSR                   MOVE ZZAMT     ZZAMTD  30       DECIMAL FIELD
0412 C* BOTH ZZAMTI AND ZZAMTD CONTAIN A 'SIGN' ZONE NOW
0413 C*
0414 CSR                   EXSR GLZSUM
0415 CSR         ZZAEND    ENDSR                           ** ZZAEND TAG *
0416 C*
0417 C* SUBROUTINE TO CARRY OUT THE ADDITION FOR SUBROUTINES -
0418 C*                        GLZADD, GLZSUB, GLZCMP.
0419 C*          PARAMETERS PASSED -
0420 C*                     I/P ZZAMTI ZZAMTD
0421 C*                     O/P ZZTOTI ZZTOTD ZZNEGD IND 96 IND 99.
0422 C*
0423 CSR         GLZSUM    BEGSR                           *** GLZSUM ****
0424 C*
0425 CSR                   Z-ADDZZTOTI    ZZTOTI 150       DEFINE ZZTOTI
0426 CSR                   Z-ADDZZTOTD    ZZTOTD  30       DEFINE ZZTOTD
0427 CSR                   SETOF                     919293
0428 CSR                   SETOF                     949599
0429 C*
0430 C*    DETERMINE SIGN OF ZZAMTI & D,   92 IF NEG
0431 CSR         ZZAMTI    COMP 0                      9293
0432 CSR 93      ZZAMTD    COMP 0                      9293
0433 CSR 93                GOTO ZZSEND                     ZERO BYPASS
0434 C*
0435 C*    DETERMINE SIGN OF ZZTOTI & D, 91 IF NEG.
0436 CSR         ZZTOTI    COMP 0                      9193
0437 CSR 93      ZZTOTD    COMP 0                      9193
0438 C*
0439 C*    IF ZZTOTAL IS ZERO, RETURN ZZAMOUNT.
0440 CSR 93                Z-ADDZZAMTI    ZZTOTI
0441 CSR 93                Z-ADDZZAMTD    ZZTOTD
0442 CSR 93                GOTO ZZSEND                     ZERO BYPASS
0443 C*    IF SIGNS DIFFER BYPASS OVERFLOW CHECKS.
0444 CSR 91N92
0445 CORN91 92             GOTO ZZOFPS
0446 C*
0447 CSR         ZZAMTD    ADD  ZZTOTD    ZZWK2   40
0448 CSR         ZZWK2     COMP 999                  93    '93' = CARRY
0449 CSRN93      ZZWK2     COMP -999                   93    INTO INTEGER.
0450 C*
0451 CSR 93N92   ZZAMTI    ADD  1         ZZWK3  150       ADD 'CARRY' +VE
0452 CSR    93 92ZZAMTI    SUB  1         ZZWK3            SUB 'CARRY' -VE
0453 CSR 93      ZZTOTI    ADD  ZZWK3     ZZWK3
0454 CSRN93      ZZTOTI    ADD  ZZAMTI    ZZWK3
0455 C*
0456 C* IF THE MODULUS OF ZZWK3 IS LT MOD. ZZTOTI THEN O/F HAS OCCURED
0457 CSRN92      ZZWK3     COMP ZZTOTI                 99  -92 MEANS NOS.
0458 CSR 92      ZZWK3     COMP ZZTOTI               99     NEGATIVE
0459 CSRN99                Z-ADDZZWK2     ZZTOTD
0460 CSRN99                Z-ADDZZWK3     ZZTOTI
0461 C*
0462 C* IF O/F ZEROIZE ZZAMT , IND '99' SET AND ZZTOT FIELDS LEFT INTACT.
0463 CSR 99                Z-ADD0         ZZAMT  153
0464 CSR                   GOTO ZZSEND
0465 C*
0466 C* THE 'SIGNS' ARE DIFFERENT
0467 CSR         ZZOFPS    TAG                             ** ZZOFPS TAG**
0468 C* IF ZZAMT WAS NEGATIVE, MAKE IT POS. TO COMP WITH ZZTOT
0469 C*
0470 CSR 92                Z-SUBZZAMTI    ZZAMTI 150
0471 CSR 92                Z-SUBZZAMTD    ZZAMTD  30
0472 C*
0473 C* IF ZZTOT WAS NEGATIVE, MAKE IT POS. TO COMP WITH ZZAMT.
0474 C*
0475 CSR 91                Z-SUBZZTOTI    ZZTOTI
0476 CSR 91                Z-SUBZZTOTD    ZZTOTD
0477 C* BOTH ZZAMT AND ZZTOT ARE NOW POSITIVE.
0478 C*
0479 CSR         ZZTOTI    COMP ZZAMTI               93  95
0480 CSR 95      ZZTOTD    COMP ZZAMTD               93  95
0481 C*
0482 C* IF ZZTOT EQ. ZZAMT RETURN ZERO.
0483 CSR 95                Z-ADD0         ZZTOTI
0484 CSR 95                Z-ADD0         ZZTOTD
0485 CSR 95                GOTO ZZSEND
0486 C*
0487 C* IF ZZTOT GT. ZZAMT.
0488 CSR 93      ZZAMTD    COMP ZZTOTD               94
0489 CSR 93 94   ZZTOTI    SUB  1         ZZTOTI
0490 CSR 93 94   ZZTOTD    ADD  1000      ZZWK2
0491 CSR 93      ZZTOTI    SUB  ZZAMTI    ZZTOTI
0492 CSR 93 94   ZZWK2     SUB  ZZAMTD    ZZTOTD
0493 CSR 93N94   ZZTOTD    SUB  ZZAMTD    ZZTOTD
0494 C*
0495 C*
0496 C* IF ZZAMT GT. ZZTOT.
0497 CSRN93      ZZTOTD    COMP ZZAMTD               94
0498 CSRN93 94   ZZAMTI    SUB  1         ZZWK3  150
0499 CSRN93 94   ZZAMTD    ADD  1000      ZZWK2
0500 CSRN93 94   ZZWK3     SUB  ZZTOTI    ZZTOTI
0501 CSRN93N94   ZZAMTI    SUB  ZZTOTI    ZZTOTI
0502 CSRN93 94   ZZWK2     SUB  ZZTOTD    ZZTOTD
0503 CSRN93N94   ZZAMTD    SUB  ZZTOTD    ZZTOTD
0504 C*
0505 C* REVERSE SIGN OF ZZTOT IF LARGER I/P FIELDS WERE NEGATIVE
0506 CSR                   SETOF                     94
0507 CSR 93 91
0508 CORN93 92             SETON                     94
0509 CSR 94                Z-SUBZZTOTI    ZZTOTI
0510 CSR 94                Z-SUBZZTOTD    ZZTOTD
0511 C**
0512 C**   RESTORE SIGN OF ZZAMTI & ZZAMTD IF IT WAS REVERSED.
0513 CSR 92                Z-SUBZZAMTI    ZZAMTI
0514 CSR 92                Z-SUBZZAMTD    ZZAMTD
0515 CSR         ZZSEND    TAG                             ** ZZSEND TAG *
0516 C**
0517 C**   IF ZZTOTD IS ZERO, AND ZZTOTI IS NEG. SET UP ZZNEGD.
0518 CSR                   SETOF                     96
0519 CSR         ZZTOTD    COMP 0                        91
0520 CSR 91      ZZTOTI    COMP 0                      96
0521 CSR 96                MOVE '.000-'   ZZNEGD  5
0522 CSR                   ENDSR                             ** ENDSR **
0523 C********************************************************************
     C/SPACE 3                                                            S01117
     C********************************************************************S01117
0655 C**                                                                  S01117
0656 C**   SR. TO SET UP AN ARRAY OF BRANCH DETAILS FROM THE BRANCH       S01117
0657 C**   CODE TABLE  - LOADED TOP DOWN                                  S01117
0658 C**                                                                  S01117
0659 C           BCTARR    BEGSR                           *** BCTARR  ***S01117
0660 C**                                                                  S01117
0661 C*****SET*ARRAY*INDEX*TO*150.*********************************S01117 151104
0662 C***********          Z-ADD151       IX      30               S01117 151104
     C**   SET ARRAY INDEX TO 900.                                        151104
     C                     Z-ADD901       IX      30                      151104
0663 C**                                                                  S01117
0671 C**   LOOP TO READ BRANCH DETAIL RECORDS.                            S01117
     C           IXLOOP    TAG                                            S01117
     C                     READ SDBRCHPD                 88               S01117
     C*                                                                   S01117
     C**                                                                  S01117
     C           *IN88     IFNE '1'                                       S01117
0684 C**                                                                  S01117
0685 C**   INCREMENT ARRAY INDEX.                                         S01117
0686 C           IX        SUB  1         IX                              S01117
0687 C**                                                                  S01117
0688 C**   MOVE DATA INTO ARRAYS.                                         S01117
0689 C                     MOVE BRCA      BCC,IX                          S01117
0689 C                     MOVE BICN      DBICN                           S01117
0689 C                     MOVE ADTO      DADTO                           S01117
0689 C                     MOVE ADFR      DADFR                           S01117
0689 C                     MOVE BRNM      DBRNM                           S01117
 822 C*                                                                   S01117
0551 C*    OBTAIN DUE-TO AND DUE-FROM ACCOUNT TYPES IF MBIN = 'Y'         S01117
0551 C*                                                                   S01117
     C           MBIN      IFEQ 'Y'                                       S01117
     C                     CALL 'AOACODR0'                                S01117
     C                     PARM '*MSG   ' @RTCD   7                       S01117
     C                     PARM '*KEY   ' @OPTN   7                       S01117
     C**********           PARM DADTO     @AFNB   4                                    S01117 CGL029
     C********** SDACOD    PARM SDACOD    DSFDY                                        S01117 CGL029
     C                     PARM DADTO     @AFNB  10                                           CGL029
     C           SDACOD    PARM SDACOD    DSSDY                                               CGL029
     C           @RTCD     IFNE *BLANKS                                   S01117
     C           *LOCK     IN   LDA                                       S01117
     C                     MOVEL@AFNB     DBKEY                           S01117
     C                     MOVEL'SDACODPD'DBFILE           ***************S01117
     C                     Z-ADD6         DBASE            * DBERROR 006 *S01117
     C                     OUT  LDA                        ***************S01117
     C                     SETON                     U7U8LR               S01117
     C                     GOTO IXEND                                     S01117
     C                     END                                            S01117
     C                     MOVE ATYP      DTYPTO                          S01117
     C                     MOVE ACSC      DSECTO                          S10736
     C*                                                                   S01117
     C                     CALL 'AOACODR0'                                S01117
     C                     PARM '*MSG   ' @RTCD   7                       S01117
     C                     PARM '*KEY   ' @OPTN   7                       S01117
     C**********           PARM DADFR     @AFNB   4                                    S01117 CGL029
     C********** SDACOD    PARM SDACOD    DSFDY                                        S01117 CGL029
     C                     PARM DADFR     @AFNB                                               CGL029
     C           SDACOD    PARM SDACOD    DSSDY                                               CGL029
     C           @RTCD     IFNE *BLANKS                                   S01117
     C           *LOCK     IN   LDA                                       S01117
     C                     MOVEL@AFNB     DBKEY                           S01117
     C                     MOVEL'SDACODPD'DBFILE           ***************S01117
     C                     Z-ADD8         DBASE            * DBERROR 008 *S01117
     C                     OUT  LDA                        ***************S01117
     C                     SETON                     U7U8LR               S01117
     C                     GOTO IXEND                                     S01117
     C                     END                                            S01117
     C                     MOVE ATYP      DTYPFR                          S01117
     C                     MOVE ACSC      DSECFR                          S10736
     C*                                                                   S01117
     C                     ELSE                                           S01117
     C                     MOVE ' '       DTYPTO                          S01117
     C                     MOVE ' '       DTYPFR                          S01117
     C                     END                                            S01117
     C*                                                                   S01117
0689 C                     MOVE DBCI      BCT,IX                          S01117
0691 C**                                                                  S01117
0692 C**   CHECK FOR FULL ARRAY. 86 ON IF FULL.                           S01117
0693 C           IX        COMP 1                        86               S01117
0694 C**                                                                  S01117
0695 C**   GO TO READ NEXT RECORD.                                        S01117
0696 C  N86                GOTO IXLOOP                                    S01117
0697 C**                                                                  S01117
     C                     END                                            S01117
     C*                                                                   S01117
0698 C           IXEND     TAG                             **IXEND TAG  **S01117
0694 C**                                                                  S01117
0695 C**   STORE NO. OF TABLE RECS                                        S01117
0698 C                     Z-ADDIX        STIX    30                      S01117
0699 C                     ENDSR                                          S01117
0700 C**                                                                  S01117
0722 C********************************************************************S01117
     C/SPACE 3                                                            S01117
     C********************************************************************S01117
     C*                                                                   S01117
     C* SUBROUTINE : #ZZ                                                  S01117
     C*                                                                   S01117
     C* CALLED BY MAIN PROCESSING DURING TOTAL TIME CALCULATIONS IF       S01117
     C* THE P1 FILE HAS NOT ALREADY BEEN OPENED (IE. NO DETAILS TO        S01117
     C* REPORT)                                                           S01117
     C*                                                                   S01117
     C********************************************************************S01117
     C*                                                                   S01117
     C           #ZZ       BEGSR                                          S01117
     C*                                                                   S01117
     C** OPEN P1 SPOOL FILE                                               S01117
     C                     OPEN RE0350P1                                  S01117
     C*                                                                   S01117
     C                     Z-ADD0         PAGE                            S01117
     C                     MOVE BRNCH     TRBR                            S01117
     C*                                                                   S01117
     C** IF REPORT FOR ALL ENTITIES CALL ZSFILE WITH BLANK SENTY          S01117
     C           BRNCH     IFEQ 'ALL'                      B1             S01117
     C           MBIN      ORNE 'Y'                                       S01117
     C**                                                                  S01117
     C** ENSURE REPORT SPOOL FILE RECORDED BY RCF                         S01117
     C                     Z-ADDSFNUM     ZSNUM   60                      S01117
     C*                                                                   S01117
     C                     CALL 'ZSFILE'                                  S01117
     C                     PARM           SEQ                             S01117
     C                     PARM *BLANK    SENTY   3                       S01117
     C                     PARM           SFILE                           S01117
     C                     PARM           ZSNUM                           S01117
     C                     PARM           ZSERR   1                       S01117
     C*                                                                   S01117
     C           ZSERR     IFEQ 'Y'                        *B2            S01117
     C**  ERROR DURING ZSFILE PROCESSING, RETURN TO CALLING PROGRAM       S01117
     C                     SETON                     U7U8LR               S01117
     C                     RETRN                           *E2            S01117
     C                     END                                            S01117
     C*                                                                   S01117
     C** ELSE REPORT BY ENTITY SO CALL ZSFILE WITH ENTITY REQUESTED       S01117
     C**      (MBIN = 'Y' AND BRANCH REQUESTED NOT EQUAL TO 'ALL')        S01117
     C                     ELSE                            *X1            S01117
     C*                                                                   S01117
     C** ENSURE REPORT SPOOL FILE RECORDED BY RCF                         S01117
     C**                                                                  S01117
     C                     Z-ADDSFNUM     ZSNUM   60                      S01117
     C**                                                                  S01117
     C                     CALL 'ZSFILE'                                  S01117
     C                     PARM           SEQ                             S01117
     C                     PARM BRNCH     SENTY   3                       S01117
     C                     PARM           SFILE                           S01117
     C                     PARM           ZSNUM                           S01117
     C                     PARM           ZSERR   1                       S01117
     C*                                                                   S01117
     C           ZSERR     IFEQ 'Y'                        *B2            S01117
     C**  ERROR DURING ZSFILE PROCESSING, RETURN TO CALLING PROGRAM       S01117
     C                     SETON                     U7U8LR               S01117
     C                     RETRN                                          S01117
     C                     END                             *E2            S01117
     C*                                                                   S01117
     C*  ACCESS BRANCH CODE ARRAY FOR REQUESTED BRANCH DETAILS            S01117
     C*                                                                   S01117
     C                     SETOF                         10               S01117
     C                     Z-ADDSTIX      IX                              S01117
     C           BRNCH     LOKUPBCC,IX                   10               S01117
     C   10                MOVE BCT,IX    TBCI                            S01117
     C*                                                                   S01117
     C                     END                             *E1            S01117
     C*                                                                   S01117
     C*   PRINT P1 REPORT WITH NO DETAILS TO REPORT                       S01117
     C                     EXCPTNODTL                                     S01117
     C                     ENDSR                                          S01117
     C*                                                                   S01117
     C********************************************************************S01117
      /EJECT
     C********************************************************************S01522
     C**  Subroutine SRNARR determines the required narratives          **S01522
     C**   for the all postings                                         **S01522
     C********************************************************************S01522
     C           SRNARR    BEGSR                           * S R N A R R *S01522
      *                                                                   S01522
      **  Get the posting narrative values:                               S01522
      **  - DR Account                                                    S01522
     C                     MOVE DRBR      ##BRCA                          S01522
     C                     MOVE DCUS      ##CUST                          S01522
     C                     MOVE DRCY      ##CCY                           S01522
     C                     MOVE DCOD      ##ACCD                          S01522
     C                     MOVE DACS      ##ACSQ                          S01522
     C                     MOVE DRAN      ##ACNO                          S01522
     C           DRNA      IFNE *BLANKS                                   166138
     C                     MOVELDRNA      O#PNAR    P                     S01522
     C                     ELSE                                           166138
     C                     MOVELIPDN      O#PNAR    P                     166138
     C                     END                                            166138
     C                     MOVELIPDN      ##TRNO    P                     S01522
     C                     MOVE 'GB00660' ##MGID                          S01522
     C           DRNA      IFEQ *BLANKS                                   145389
      *                                                                   S01522
     C                     EXSR SRPNAR                                    S01522
     C                     ENDIF                                          145389
     C                     MOVE O#PNAR    O#PNA1 30                       S01522
      *                                                                   S01522
      **  - DR - Different Account                                        S01522
     C                     MOVEL##CEID    O#PNAR    P                     S01522
     C                     MOVE IPDN      O#PNAR                          S01522
     C                     MOVE 'GB00661' ##MGID                          S01522
     C*                                                                   S01522
     C                     EXSR SRPNAR                                    S01522
     C                     MOVE O#PNAR    O#PNA2 30                       S01522
      *                                                                   S01522
      * - CR Account                                                      S01522
     C                     MOVE CBRC      ##BRCA                          S01522
     C                     MOVE CCUS      ##CUST                          S01522
     C                     MOVE CRCY      ##CCY                           S01522
     C                     MOVE CCOD      ##ACCD                          S01522
     C                     MOVE CACS      ##ACSQ                          S01522
     C                     MOVE CRAN      ##ACNO                          S01522
     C           CRNA      IFNE *BLANKS                                   166138
     C                     MOVELCRNA      O#PNAR    P                     S01522
     C                     ELSE                                           166138
     C                     MOVELIPDN      O#PNAR    P                     166138
     C                     END                                            166138
     C                     MOVELIPDN      ##TRNO    P                     S01522
     C                     MOVE 'GB00680' ##MGID                          S01522
     C           CRNA      IFEQ *BLANKS                                   145389
      *                                                                   S01522
     C                     EXSR SRPNAR                                    S01522
     C                     ENDIF                                          145389
     C                     MOVE O#PNAR    O#PNA3 30                       S01522
      *                                                                   S01522
      **  - CR - Different Account                                        S01522
     C                     MOVELCRNA      O#PNAR    P                     S01522
     C                     MOVE IPDN      O#PNAR                          S01522
     C                     MOVE 'GB00681' ##MGID                          S01522
      *                                                                   S01522
     C                     EXSR SRPNAR                                    S01522
     C                     MOVE O#PNAR    O#PNA4 30                       S01522
     C           EXNARR    TAG                             < EXNARR       S01522
     C*                                                                   S01522
     C                     ENDSR                                          S01522
     C********************************************************************S01522
      /EJECT
     C********************************************************************S01522
     C**  Subroutine SRPNAR determines the required narratives          **S01522
     C**   for the postings.                                            **S01522
     C********************************************************************S01522
     C           SRPNAR    BEGSR                           * S R P N A R *S01522
     C*                                                                   S01522
     C* Define the data structure parameter:                              S01522
     C*                                                                   S01522
     C           *LIKE     DEFN CGPNAR    ##PNAR                          S01522
     C*                                                                   S01522
     C* Define the work variables:                                        S01522
     C*                                                                   S01522
     C           *LIKE     DEFN MNCUST    ##CUST                          S01522
     C           *LIKE     DEFN MNCYCD    ##CCY                           S01522
     C           *LIKE     DEFN MNACCD    ##ACCD                          S01522
     C           *LIKE     DEFN MNACSQ    ##ACSQ                          S01522
     C           *LIKE     DEFN MNBRCA    ##BRCA                          S01522
     C           *LIKE     DEFN MNRACN    ##ACNO                          S01522
     C           *LIKE     DEFN MNTRNO    ##TRNO                          S01522
     C           *LIKE     DEFN RUND      TRUND                                               237304
     C*                                                                   S01522
     C* If the facility is switched off or unavailable,                   S01522
     C*  or UDC is not installed, exit this subroutine:                   S01522
     C*                                                                   S01522
     C           REPNAR    IFNE 'Y'                                       S01522
     C                     GOTO EXPNAR                                    S01522
     C                     ENDIF                                          S01522
     C*                                                                   S01522
     C* Determine the customer's report name:                             S01522
     C*                                                                   S01522
     C                     MOVEL##CUST    ##KEY     P                     S01522
     C*                                                                   S01522
     C                     CALL 'AOCUSTR0'                                S01522
     C                     PARM           ##RTN   7                       S01522
     C                     PARM '*KEY   ' ##OPT   7                       S01522
     C                     PARM           ##KEY  10                       S01522
     C                     PARM           ##STS   7                       S01522
     C           SDCUST    PARM SDCUST    DSSDY                           S01522
     C*                                                                   S01522
     C           ##RTN     IFNE *BLANKS                                   S01522
     C                     MOVEL'SDCUSTPD'DBFILE             *************S01522
     C                     MOVEL'101'     DBASE              * DBERR 101 *S01522
     C                     MOVEL##KEY     DBKEY              *************S01522
     C                     EXSR *PSSR                                     S01522
     C                     ENDIF                                          S01522
     C*...................................................................S01522
     C/EJECT                                                              S01522
     C*...................................................................S01522
     C* Determine the value for the narrative using AOPNARR0:             S01522
     C*                                                                   S01522
     C                     CLEARCGPNAR                                    S01522
     C                     CLEAR##PRM1                                    086125
     C                     MOVE 'RE'      MNMODI                          S01522
     C                     MOVE ##CUST    MNCUST                          S01522
     C                     MOVE ##CCY     MNCYCD                          S01522
     C                     MOVE ##ACCD    MNACCD                          S01522
     C                     MOVE ##ACSQ    MNACSQ                          S01522
     C                     MOVE ##BRCA    MNBRCA                          S01522
     C                     MOVE ##ACNO    MNRACN                          S01522
     C                     MOVE ##TRNO    MNTRNO                          S01522
     C                     MOVE BOKC      MNBOKC                          S01522
     C                     MOVE BBCRNM    MNCRNM                          S01522
     C                     MOVELO#PNAR    MNNARR    P                     S01522
     C/COPY WNCPYSRC,REH00395
     C*                                                                   S01522
     C                     CALL 'AOPNARR0'                                S01522
     C                     PARM           ##RTN                           S01522
     C                     PARM           ##MGID  7                       S01522
     C                     PARM           ##PRM1                          086125
     C           CGPNAR    PARM CGPNAR    ##PNAR                          S01522
     C                     PARM           ##NARR 50                       S01522
     C/COPY WNCPYSRC,REH00396
     C*                                                                   S01522
     C           ##RTN     IFNE *BLANKS                                   S01522
     C                     MOVEL'CGPNARPD'DBFILE             *************S01522
     C                     MOVEL'102'     DBASE              * DBERR 102 *S01522
     C                     MOVELMNCUST    DBKEY              *************S01522
     C                     EXSR *PSSR                                     S01522
     C                     ENDIF                                          S01522
     C           ##NARR    IFNE *BLANKS                                   145389
     C*                                                                   S01522
     C                     MOVEL##NARR    O#PNAR 30 P                     S01522
     C                     ENDIF                                          145389
     C*                                                                   S01522
     C           EXPNAR    TAG                             < EXPNAR       S01522
     C*                                                                   S01522
     C                     ENDSR                                          S01522
     C********************************************************************S01522
     C/SPACE 3                                                            S01117
     C********************************************************************S01117
     C*                                                                   S01117
     C* *PSSR  --- SUBROUTINE TO HANDLE ABNORMAL ERROR CONDITIONS         S01117
     C*                                                                   S01117
     C* CALLED FROM: AFTER ABNORNAL OPERATION OCCURS                      S01117
     C*                                                                   S01117
     C* CALLS: NOTHING                                                    S01117
     C*                                                                   S01117
     C********************************************************************S01117
     C*                                                                   S01117
     C           *PSSR     BEGSR                           ** *PSSR **    S01117
     C*                                                                   S01117
     C           @RUN      IFEQ *BLANKS                                   S01117
     C                     MOVE 'Y'       @RUN    1                       S01117
     C                     DUMP                                           S01117
     C                     END                                            S01117
     C*                                                                   S01117
     C                     SETON                     U7U8LR               129800
     C*                                                                   129800
     C                     ENDSR                           ** *PSSR **    S01117
     C********************************************************************S01117
     C*                                                                   S01408
     C** Core hook for externalisation.                                   S01408
     C/COPY WNCPYSRC,RE0350CCP3                                           S01408
     C*                                                                   S01408
     C/EJECT
0524 O*E0350P1D**203   OFNL1                                        S01124S01117
0524 ORE0350P1D  203   OFNL1 58                                           S01117
0525 O*******OR**      L1                                                 S01117
0525 O       OR        L1 58                                              S01117
0526 O***********                        20 'REFERENCE RE0350'            S01117
0526 O                                   22 'REFERENCE RE0350P1'          S01117
0527 O                         TITL      89
0528 O                                  104 'DATE'
0529 O                         RUNA     113
0530 O                                  122 'PAGE'
0531 O                         PAGE  Z  127
0532 O********D**1     OFNL1                                              S01117
0532 O        D  1     OFNL1 58                                           S01117
0533 O*******OR**      L1                                                 S01117
0533 O       OR        L1 58                                              S01117
0534 O                       U1          47 'INTERIM'
0535 O                                   67 'CUSTOMER EXCHANGES'
0536 O                                   79 'INPUT TODAY'
0537 O                       U1MTIME     89 '  .  .  '
0538 O***********                       106 'BRANCH'                      S01117
0539 O***********              BRCD     110                               S01117
0538 O                 57                97 'BRANCH'                      S01117
0539 O                 57      TRBR     101                               S01117
     O                 57               102 '-'                           S01117
     O                 57      TBRNM    132                               S01117
0540 O********D**3     OFNL1                                              S01117
0541 O*******OR**      L1                                                 S01117
0540 O        D  3     OFNL1 58                                           S01117
0541 O       OR        L1 58                                              S01117
0542 O                       U1          47 '*******'
0543 O                                   68 '-------------------'
0544 O                                   79 '-----------'
0545 O                       U1          89 '********'
0546 O*
0547 O*  COLUMN HEADINGS
0548 O*
0549 O* LINE 9
0550 O********D**1     OFNL1                                              S01117
0550 O        D  1     OFNL1 58                                           S01117
0551 O*******OR**      L1                                                 S01117
0551 O       OR        L1 58                                              S01117
0552 O                                   24 'DOC NO     CUSTOMER NAME'
0553 O                                   60 ' ACCOUNT NO         CHEQ'
0554 O                                   78 'NARRATIVE'
0555 O                                  117 'CCY           AMOUNT'
     O                                  130 'VALUE'                       S01111
0556 O*
0557 O* LINE 10
0558 O********D**2     OFNL1                                              S01117
     O/COPY WNCPYSRC,RE0350O026
0558 O        D  2     OFNL1 58                                           S01117
     O/COPY WNCPYSRC,RE0350O027
0559 O*******OR**      L1                                                 S01117
0559 O       OR        L1 58                                              S01117
0560 O                                   59 'NO'
     O                                  130 'DATE'                        S01111
0561 O*  OF WILL COME ON AFTER 7 COMPLETE RECORDS, EACH OF 7 LINES,
0562 O*  HAVE BEEN PRINTED
0563 O*
0564 O* LINES 13, 20, 27, 34, 41, 48 AND 55
0565 O*
0566 O********D*11     02                                                 S01117
0566 O        D 11     02 58                                              S01117
0567 O*******OR*       03                                                 S01117
0567 O       OR        03 58                                              S01117
0568 O                         IPDN       6
0569 O***********      02 04   CRNM      28                               E10051
0569 O                 02 04   DENM      28                               E10051
0570 O                 03                19 '**DELETED**'
0571 O***********                        33 '-DR-'                        S01117
0571 O                                   30 '-DR-'                        S01117
0572 O                 57 23   DRBR      33                               S01117
0573 O                 57 23             34 '-'                           S01117
0572 O                    23   DCUS      40
0573 O                    23             41 '-'
0574 O                    23   DRCY      44
0575 O                    23             45 '-'
0576 O**********          23   DCOD      49                                                   CGL029
0577 O**********          23             50 '-'                                               CGL029
0578 O**********          23   DACS      52                                                   CGL029
     O                    23   DCOD      55                                                   CGL029
     O                    23             56 '-'                                               CGL029
     O                    23   DACS      58                                                   CGL029
0579 O                   N23   DRAN      47
0580 O                   N25   CHQN      63
0581 O                         DRNA      95
0582 O                         DRCY     100
0583 O                    70   DRAM0 1  119
0584 O                    71   DRAM1 1  121
0585 O                    72   DRAM2 1  122
0586 O                    73   DRAM3 1  123
     O                         DRVALD   131                               S01111
0587 O********D**1     02                                                 S01117
0587 O        D  1     02 58                                              S01117
0588 O*******OR**      03                                                 S01117
0588 O       OR        03 58                                              S01117
     O/COPY WNCPYSRC,RE0350O025
     O                 02 04   CENM      28                               E10051
     O                 03                19 '**DELETED**'                 E10051
0589 O***********                        33 '-CR-'                        S01117
0589 O                                   30 '-CR-'                        S01117
0590 O                 57 24   CBRC      33                               S01117
0591 O                 57 24             34 '-'                           S01117
0590 O                    24   CCUS      40
0591 O                    24             41 '-'
0592 O                    24   CRCY      44
0593 O                    24             45 '-'
0594 O**********          24   CCOD      49                                                   CGL029
0595 O**********          24             50 '-'                                               CGL029
0596 O**********          24   CACS      52                                                   CGL029
     O                    24   CCOD      55                                                   CGL029
     O                    24             56 '-'                                               CGL029
     O                    24   CACS      58                                                   CGL029
0597 O                   N24   CRAN      47
0598 O                         CRNA      95
0599 O                         CRCY     100
0600 O                    60   CRAM0 1  119
0601 O                    61   CRAM1 1  121
0602 O                    62   CRAM2 1  122
0603 O                    63   CRAM3 1  123
     O                         CRVALD   131                               S01111
     O*                                                                   S01111
     O* CHARGES DETAILS                                                   S01111
     O********D**1     02N30                                        S01111S01117
     O        D  1     02N30 58                                           S01117
     O*******OR**      03N30                                        S01111S01117
     O       OR        03N30 58                                           S01117
     O***********                        33 'CHG-'                  S01111S01117
     O                                   30 'CHG-'                        S01117
     O                                   82 'NO CHARGE APPLIED'           S01111
     O********D**1     02 30                                        S01111S01117
     O        D  1     02 30 58                                           S01117
     O*******OR**      03 30                                        S01111S01117
     O       OR        03 30 58                                           S01117
     O***********                        33 'CHG-'                  S01111S01117
     O                                   30 'CHG-'                        S01117
     O                 31 57   DRBR      33                               S01117
     O                N31 57   CBRC      33                               S01117
     O                    57             34 '-'                           S01117
     O                         CHCN      40                               S01111
     O                                   41 '-'                           S01111
     O                 31      DRCY      44                               S01111
     O                N31      CRCY      44                               S01111
     O                                   45 '-'                           S01111
     O**********               CHCD      49                                            S01111 CGL029
     O**********                         50 '-'                                        S01111 CGL029
     O**********               CHSQ      52                                            S01111 CGL029
     O**********               CHSN      56                                            S01413 CGL029
     O                         CHCD      55                                                   CGL029
     O                                   56 '-'                                               CGL029
     O                         CHSQ      58                                                   CGL029
     O                         CHSN      62                                                   CGL029
     O                 31      DRCY     100                               S01111
     O                N31      CRCY     100                               S01111
     O                 31 70   CHAM     119 ' ,   ,   ,   , 0 '           S01111
     O                 31 71   CHAM     121 '   ,   ,   , 0 . '           S01111
     O                 31 72   CHAM     122 '  ,   ,   , 0 .  '           S01111
     O                 31 73   CHAM     123 ' ,   ,   , 0 .   '           S01111
     O                N31 60   CHAM     119 ' ,   ,   ,   , 0 '           S01111
     O                N31 61   CHAM     121 '   ,   ,   , 0 . '           S01111
     O                N31 62   CHAM     122 '  ,   ,   , 0 .  '           S01111
     O                N31 63   CHAM     123 ' ,   ,   , 0 .   '           S01111
0604 O********D**1     02                                                 S01117
0604 O        D  1     02 58                                              S01117
0605 O*******OR**      03                                                 S01117
0605 O       OR        03 58                                              S01117
0606 O                                   20 'B/C EQUIVALENT'
0607 O                    50   BCEQ      43 ' ,   ,   ,   , 0 '
0608 O                    51   BCEQ      45 '   ,   ,   , 0 . '
0609 O                    52   BCEQ      46 '  ,   ,   , 0 .  '
0610 O                    53   BCEQ      47 ' ,   ,   , 0 .   '
0611 O                                   61 'O/RIDE IND'
0612 O                         ORIN      64
     O*                                                                   S01408
     O** Core hook for externalisation.                                   S01408
     O/COPY WNCPYSRC,RE0350OOPG                                           S01408
     O*                                                                   S01408
0613 O********D**3     02                                                 S01117
0613 O********D**3     02 58                                       S01117 CAC001
0614 O*******OR**      03                                                 S01117
     O*                                                                   S01408
     O/COPY WNCPYSRC,RE0350OOP3                                           S01408
     O*                                                                   S01408
0614 O*******OR**      03 58                                       S01117 CAC001
     O        D  3     02 58N36                                           CAC001
     O       OR        03 58N36                                           CAC001
     O       OR  1     02 58 36                                           CAC001
     O       OR        03 58 36                                           CAC001
     O/COPY WNCPYSRC,RE0350O028
0615 O                                   19 'EXCHANGE RATE'
0616 O                         EXRT      46 '   0 .        '
     O                                   77 'SWIFT COMMON REFERENCE'      SO5452
     O                         SWCR      95                               SO5452
     O                 47               110 'PROFIT CENTRE'               S01117
     O                 47      PRFC     119                               S01117
     O/COPY WNCPYSRC,RE0350O029
     O*                                                                   CAC001
     O**  FX Margin Points.                                               CAC001
     O*                                                                   CAC001
     O        D  2     02 58 36                                           CAC001
     O       OR        03 58 36                                           CAC001
     O                                   22 'FX MARGIN POINTS'            CAC001
     O                         FXMP      46 '   0 .  '                    CAC001
     O                         DCIN      48                               CAC001
     O*                                                                   S01408
     O/COPY WNCPYSRC,RE0350OOP1                                           S01408
     O*                                                                   S01408
     O********D*13     02 58                                                           180832 248217
     O        D 12     02 58                                                                  248217
     O       OR        03 58                                                                  180832
     O                 79      ILLIN1 B 132                                                   CER001
0617 O********T*32     L1 77                                              S01117
0617 O        T 32     L1 77 58                                           S01117
     O       AND       57                                                 S01117
0618 O                                   61 'BRANCH TOTALS-'
0619 O********T**      L1 77                                              S01117
0619 O        T        L1 77 58                                           S01117
     O       AND       57                                                 S01117
0620 O                                   71 'NO OF CUSTOMER EXCHANGES'
0621 O***********              BRCENO3B  76                               S01117
0621 O                         BRCENO3   76                               S01117
     O        T 3      L1 58                                              S01117
     O                 57                66 '*** END OF REPORT FOR'       S01117
     O                 57                74 ' BRANCH '                    S01117
     O                 57      TRBR      77                               S01117
     O                 57                81 ' ***'                        S01117
     O                N57                76 '*** END OF REPORT ***'       S01117
0524 ORE0350P1E  203           NODTL                                      S01117
0526 O                                   22 'REFERENCE RE0350P1'          S01117
0527 O                         TITL      89                               S01117
0528 O                                  104 'DATE'                        S01117
0529 O                         RUNA     113                               S01117
0530 O                                  122 'PAGE'                        S01117
0531 O                         PAGE  Z  127                               S01117
0532 O        E  1             NODTL                                      S01117
0534 O                       U1          47 'INTERIM'                     S01117
0535 O                                   67 'CUSTOMER EXCHANGES'          S01117
0536 O                                   79 'INPUT TODAY'                 S01117
0537 O                       U1MTIME     89 '  .  .  '                    S01117
0538 O                 57                97 'BRANCH'                      S01117
0539 O                 57      TRBR     101                               S01117
     O                 57               102 '-'                           S01117
     O                 57      TBRNM    132                               S01117
0540 O        E  1             NODTL                                      S01117
0542 O                       U1          47 '*******'                     S01117
0543 O                                   68 '-------------------'         S01117
0544 O                                   79 '-----------'                 S01117
0545 O                       U1          89 '********'                    S01117
     O        E 3        NU7   NODTL                                      S01117
     O                                   73 '***   NO DETAILS TO REPO'    S01117
     O                                   81 'RT   ***'                    S01117
     O        E 3         U7   NODTL                                      S01117
     O                                   76 '*** DATABASE ERROR ***'      S01117
     O        E 3              NODTL                                      S01197
     O                 57                66 '*** END OF REPORT FOR'       S01117
     O                 57                74 ' BRANCH '                    S01117
     O                 57      BRNCH     77                               S01117
     O                 57                81 ' ***'                        S01117
0518 O                N57                76 '*** END OF REPORT ***'       S01117
0622 O********T** 03   LR                                                 S01117
0622 ORE0350AUT   03   LR                                                 S01117
0623 O***********                        20 'REFERENCE RE0350'            S01117
0623 O                                   22 'REFERENCE RE0350AU'          S01117
0624 O                         TITL      89
0625 O                                  104 'DATE'
0626 O                         RUNA     113
0627 O                                  122 'PAGE'
0628 O***********              PAGE  Z  127                               S01117
0628 O                         PAGE1 Z  127                               S01117
0629 O        T   05   LR
0630 O                       U1          47 'INTERIM'
0631 O                                   67 'CUSTOMER EXCHANGES'
0632 O                                   79 'INPUT TODAY'
0633 O***********            U1MTIME     89 '  .  .  '                    S01117
     O                                   92 'RUN CONTROLS'                S01117
0633 O                       U1MTIME    102 '  .  .  '                    S01117
0634 O        T   06   LR
0635 O                       U1          47 '*******'
0636 O                                   68 '-------------------'
0637 O                                   79 '-----------'
0638 O***********            U1          89 '********'                    S01117
0638 O                       U1         102 '********'                    S01117
0639 O        T   20   LR
0640 O                                   60 'FILE CONTROLS'
0641 O        T 2      LR
0642 O                                   70 'CUSTOMER EXCHANGES FILE'
0643 O********T*22     LR                                                 S01117
      ** Start of change MD030959A
0643 O********T*2      LR 48                                                        S01117 MD030959A
     O        T 2      LR 48N09
      ** End of change MD030959A
0644 O                                   71 'NO OF RECORDS READ      '
      ** Start of change MD030959A
0645 O**********               NOCE  3   76                                                MD030959A
     O                   N08   NOCE  3   76
     O                    08   ICNOCE3   76
      ** End of change MD030959A
0646 O                                   88 'HASH TOTAL'
      ** Start of change MD030959A
0648 O**********               HCED     111 '0   '                                         MD030959A
0647 O**********               HCEW  Z  108                                                MD030959A
     O                N08      HCED     111 '0   '
     O                N08      HCEW  Z  108
     O                 08      ICHCED   111 '0   '
     O                 08      ICHCEWZ  108
      ** End of change MD030959A
0649 O********T**1     LR U8                                              S01117
0649 O        T 21     LR                                                 S01117
0650 O                                   45 'CALCULATED'
     O                                   60 '- NO OF RECORDS'             S01117
0653 O                         NUMCE 3   76
     O                                   88 'HASH TOTAL'                  S01117
0655 O                         DEC,1    111 '0   '
0654 O                         INT,1 Z  108
0656 O********T**2     LR U8                                              S01117
0656 O        T 12     LR U8NU7                                           S01117
0657 O***********                        70 '***  DIFFERENCE  ***'        S01117
0657 O                                   88 '***  DIFFERENCE  ***'        S01117
0658 O        T 2      LR U2NU8
0659 O                                   69 'GENERATED ENTRIES FILE'
0660 O        T 22     LR U2NU8
0661 O                                   68 'NO OF RECORDS WRITTEN'
0662 O                         NORE  3   76
0663 O                                   88 'HASH TOTAL'
0665 O                         DEC,2    111 '0   '
0664 O                         INT,2 Z  108
0666 O********T** 40   LR                                                 S01117
0667 O***********                        72 '*** END OF REPORT ***'       S01117
     O*                                                                   S01117
     O        T 32     LRNU7N59                                           S01117
     O                                   69 '***   NO DETAILS TO REPO'    S01117
     O                                   77 'RT   ***'                    S01117
0684 O        T 21     LR U7 U8                                           S01117
     O                                   66 'DATABASE ERROR '             S01117
     O                         DBASE     69                               S01117
     O                                   83 'IN PROGRAM '                 S01117
0803 O                         DBPGM     93                               S01117
0689 O        T 1      LR U7 U8                                           S01117
     O                                   56 'FILE '                       S01117
     O                         DBFILE    64                               S01117
     O                                   70 ', KEY '                      S01117
     O                         DBKEY     99                               S01117
0668 O**
0669 O*   GENERATED ENTRIES FILE
0670 O*
0671 OGECEHH  H        1P U2
0672 O                                    1 'H'
0673 O*ECEPD**D**      02 U2                                              S01117
0673 O*                                                                   S01117
      *                                           ***  Posting 1  ***     E18408
0673 OGECEPD  E                POST1                                      S01117
0673 O*                                                                   S01117
0674 O                                    1 'P'
0675 O                         DCUS       7
0676 O                         DRCY      10
0677 O**********               DCOD      14                                                   CGL029
0678 O                         DACS      16
0679 O                N23      DRAN      32
     O                 23      ZERO10    32                               S01117
0680 O                         RUND      35P
0681 O******                   RUND      38P                              S01111
0681 O                         DRVD      38P                              S01111
     O/COPY WNCPYSRC,RE0350O001
0682 O                                   43 '91020'
     O/COPY WNCPYSRC,RE0350O002
0683 O***********        N20   DRNA      73                               S01522
     O***********        N20   O#PNA1    73                        S01522 120837
     O                         O#PNA1    73                               120837
0684 O********                 DRAM      80P                              S01111
0684 O                      N31DRAM      80P                              S01111
0684 O                       31DCHAM     80P                              S01111
0685 O                                   81 '0'
0686 O**********               ZERO6     87                                                   194873
     O                         CCUS      87                                                   194873
0687 O                         CHQN      95
0688 O                                  102 'GE-CE'
0689 O*************************BRCD     105                               E81077
     O***********           N26BRCD     105                         E81077S01117
     O***********            26DRBRCD   105                         E81077S01117
0689 O                         DRBR     105                               S01117
0690 O                                  106 '0'
0691 O                       74         106 '1'
0692 O                         ZERO3    108P
0693 O                                  111 '   '
0694 O                         ZERO5    114P
0696 O                         DBTYP    124
0697 O                         CORON    128
0698 O                                  129 'E'
0699 O                         ONE      130
     O                 47      PRFC     134                               S01117
     O                 47 36 38PRFCA    134                               CAC001
     O                                  140 '235959'                      S10736
     O                                  141 '0'                           S10736
     O                         DBSEC    146                               S10736
0700 O                         IPDN     160
0700 O                         SWCR     176                               S05452
0700 O                         ZERO6    200                               S05452
     O**********               OTRF     230                                            S01182 CGL029
     O                         OTST     240                               S01182
     O                         OTTP     250                               S01182
     O                         SDCB     258P                              S01182
     O                         SDLB     266P                              S01182
     O                         BOKC     268                               S01182
     O                         ZERO5    271P                              S01413
     O/COPY WNCPYSRC,RE0350O023
     O                         ZERO13   279P                              S01413
     O                         WACKEY   351                                                   CGL020
     O                N31               352 ' '                                               CGL020
     O                N31      ZERO13   359P                                                  CGL020
     O                N31      ZERO5    364                                                   CGL020
     O                 31      WDFFLG   352                                                   CGL020
     O                 31      WDFVAL   359P                                                  CGL020
     O                 31      WDFPCT   364                                                   CGL020
     O                         RORACT   384                                                   CGL020
     O                         RORCTY   386                                                   CGL020
     O                         RORBNK   406                                                   CGL020
     O                         RORCDE   417                                                   CGL020
     O                         PORACT   437                                                   CGL020
     O                         PORCTY   439                                                   CGL020
     O                         PORBNK   459                                                   CGL020
     O                         PORCDE   470                                                   CGL020
     O                         DSTACT   505                                                   CGL020
     O                         DSTCTY   507                                                   CGL020
     O                         DSTBNK   527                                                   CGL020
     O                         SETDAT   530P                                                  CGL020
     O                         TICKER   540                                                   CGL020
     O                         EXCHNG   560                                                   CGL020
     O                         NOMINL   573                                                   CGL020
     O                         FDTRID   589                                                   CGL020
     O                         DCOD     599                                                   CGL029
     O                         OTRF     620                                                   CGL029
     O                         ACODQQ    14                                                 AR894859
     O                         LTAI     147                                                 AR894859
     O                         ORAMT    316P                                                  CGL120
     O                         XRFN     329                                                 AR894859
     O*                                                                   S01408
     O/COPY WNCPYSRC,RE0350OOP2                                           S01408
     O*                                                                   S01408
     O*                                                                   S01111
     O** OUTPUT CHARGES POSTING                                           S01111
     O*                                                                   S01111
      *                                           ***  Posting 11  ***    E18408
     O        D        02 U2 30                                           S01111
     O                                    1 'P'                           S01111
     O                         CHCN       7                               S01111
     O                       31DRCY      10                               S01111
     O                      N31CRCY      10                               S01111
     O**********               CHCD      14                                            S01111 CGL029
     O                         CHSQ      16                               S01111
     O                         IPDN      22                               S01111
     O                N32      CHRN      32                               S01111
     O                 32      ZERO10    32                               S01117
     O                         RUND      35P                              S01111
     O                         RUND      38P                              S01111
     O/COPY WNCPYSRC,RE0350O003
     O                                   43 '91020'                       S01111
     O/COPY WNCPYSRC,RE0350O004
     O***********                        63 'CUST EXCH INPUT DOC '  S01111S01522
     O***********                        68 'NO - '                 S01111S01522
     O***********              IPDN      73                         S01111S01522
     O                       31O#PNA2    73                               S01522
     O                      N31O#PNA4    73                               S01522
     O                         CHAM      80P                              S01111
     O                                   81 '1'                           S01111
     O                         ASOC      87                               S01111
     O                         ZERO8     95                               S01111
     O                                  102 'GE-CE'                       S01111
     O***********              BRCD     105                         S01111S01117
     O                 31      DRBR     105                               S01117
     O                N31      CBRC     105                               S01117
     O                                  106 '0'                           S01111
0691 O                       76         106 '1'                           S01111
     O                         ZERO3    108P                              S01111
     O                                  111 '   '                         S01111
     O                         ZERO5    114P                              S01111
     O                         CHTYP    124                               S01111
     O                         OFF      128                               S01111
     O                                  129 'E'                           S01111
     O                                  130 '1'                           S01111
     O                 47      PRFC     134                               S01117
     O                 47 36 38PRFCA    134                               CAC001
     O                                  140 '235959'                      S10736
     O                                  141 '0'                           S10736
     O                         CHSEC    146                               S10736
     O                         IPDN     160                               S01111
0700 O                         SWCR     176                               S05452
0700 O                         ZERO6    200                               S05452
     O**********               OTRF     230                                            S01182 CGL029
     O                         OTST     240                               S01182
     O                         OTTP     250                               S01182
     O                         SDCB     258P                              S01182
     O                         SDLB     266P                              S01182
     O                         BOKC     268                               S01182
     O                         ZERO5    271P                              S01413
     O                         ZERO13   279P                              S01413
     O                         WACKEY   351                                                   CGL020
     O                         WF       352                                                   CGL020
     O                         WCHAM    359P                                                  CGL020
     O                         W100     364                                                   CGL020
     O                         RORACT   384                                                   CGL020
     O                         RORCTY   386                                                   CGL020
     O                         RORBNK   406                                                   CGL020
     O                         RORCDE   417                                                   CGL020
     O                         PORACT   437                                                   CGL020
     O                         PORCTY   439                                                   CGL020
     O                         PORBNK   459                                                   CGL020
     O                         PORCDE   470                                                   CGL020
     O                         DSTACT   505                                                   CGL020
     O                         DSTCTY   507                                                   CGL020
     O                         DSTBNK   527                                                   CGL020
     O                         SETDAT   530P                                                  CGL020
     O                         TICKER   540                                                   CGL020
     O                         EXCHNG   560                                                   CGL020
     O                         NOMINL   573                                                   CGL020
     O                         FDTRID   589                                                   CGL020
     O                         CHCD     599                                                   CGL029
     O                         OTRF     620                                                   CGL029
     O                         ACODQQ    14                                                 AR894859
     O                         LTAI     147                                                 AR894859
     O                         ORAMT    316P                                                  CGL120
     O                         XRFN     329                                                 AR894859
     O*                                                                   S01408
     O/COPY WNCPYSRC,RE0350OOP2                                           S01408
     O*                                                                   S01408
     O**  Output FX Margin Posting                                        CAC001
     O*                                                                   CAC001
     O        E                POSTFX                                     CAC001
     O                                    1 'P'                           CAC001
     O                         WFXCS      7                               CAC001
     O                         WFXCY     10                               CAC001
     O**********               FTFMAC    14                                            CAC001 CGL029
     O                                   16 '01'                          CAC001
     O                         ZERO10    32                               CAC001
     O                         RUND      35P                              CAC001
     O                         RUND      38P                              CAC001
     O                                   43 '91020'                       CAC001
     O                         O#PNA2    73                               CAC001
     O                         MAMT      80P                              CAC001
     O                                   81 '1'                           CAC001
     O                         WFXAS     87                               CAC001
     O                         ZERO8     95                               CAC001
     O                                  102 'GE-CE'                       CAC001
     O                         TRBR     105                               CAC001
     O                         WFXRI    106                               CAC001
     O                         ZERO3    108P                              CAC001
     O                                  111 '   '                         CAC001
     O                         ZERO5    114P                              CAC001
     O                         WFXTY    124                               CAC001
     O                         OFF      128                               CAC001
     O                                  129 'E'                           CAC001
     O                         ONE      130                               CAC001
     O                 47      PRFC     134                               CAC001
     O                 47 38   PRFCA    134                               CAC001
     O                                  140 '235959'                      CAC001
     O                                  141 '0'                           CAC001
     O                         WFXSC    146                               CAC001
     O                         IPDN     160                               CAC001
     O                         SWCR     176                               CAC001
     O                         ZERO6    200                               CAC001
     O**********               OTRF     230                                            CAC001 CGL029
     O                         OTST     240                               CAC001
     O                         OTTP     250                               CAC001
     O                         SDCB     258P                              CAC001
     O                         SDLB     266P                              CAC001
     O                         BOKC     268                               CAC001
     O                         ZERO5    271P                              CAC001
     O                         ZERO13   279P                              CAC001
     O/COPY WNCPYSRC,REH00467
     O                         WACKEY   351                                                   CGL020
     O                                  352 ' '                                               CGL020
     O                         ZERO13   359P                                                  CGL020
     O                         ZERO5    364                                                   CGL020
     O                         RORACT   384                                                   CGL020
     O                         RORCTY   386                                                   CGL020
     O                         RORBNK   406                                                   CGL020
     O                         RORCDE   417                                                   CGL020
     O                         PORACT   437                                                   CGL020
     O                         PORCTY   439                                                   CGL020
     O                         PORBNK   459                                                   CGL020
     O                         PORCDE   470                                                   CGL020
     O                         DSTACT   505                                                   CGL020
     O                         DSTCTY   507                                                   CGL020
     O                         DSTBNK   527                                                   CGL020
     O                         SETDAT   530P                                                  CGL020
     O                         TICKER   540                                                   CGL020
     O                         EXCHNG   560                                                   CGL020
     O                         NOMINL   573                                                   CGL020
     O                         FDTRID   589                                                   CGL020
     O                         FTFMAC   599                                                   CGL029
     O                         OTRF     620                                                   CGL029
     O                         ACODQQ    14                                                 AR894859
     O                         LTAI     147                                                 AR894859
     O                         ORAMT    316P                                                  CGL120
     O                         XRFN     329                                                 AR894859
0701 O*
0702 O* DO NOT GENERATE THIS POSTING IF DEBIT CCY EQUALS BASE CCY
0703 O*
0704 O********D**      02N45 U2                                           S01117
0705 O*******OR**      02 56 U2                                           S01117
0673 O*                                                                   S01117
     O********E**              POST4                                S01117E18408
      *                                           ***  Posting 2  ***     E18408
     O        E                POST2                                      E18408
0706 O                                    1 'P'
0707 O*************************BICN       7                               E81077
     O***********            28DRBICN     7                         E81077S01117
     O***********            29CRBICN     7                         E81077S01117
     O***********           N26BICN       7                         E81077S01117
0707 O                         TBICN      7                               S01117
0708 O                         DRCY      10
0709 O**********               SPAC      14                                                   CGL029
0710 O                                   16 '01'
0711 O                         ZERO10    32
0712 O                         RUND      35P
0713 O**********               RUND      38P                                                  237304
     O                         DRVD      38P                                                  237304
     O/COPY WNCPYSRC,RE0350O005
0714 O                                   43 '91020'
     O/COPY WNCPYSRC,RE0350O006
0715 O***********                        63 'CUST EXCH INPUT DOC '        S01522
0716 O***********                        68 'NO - '                       S01522
0717 O***********              IPDN      73                               S01522
     O                         O#PNA2    73                               S01522
0718 O                         DRAM      80P
     O                 34      MDRAM     80P                              CAC001
0719 O                                   81 '1'
0720 O                         ZERO6     87
0721 O                         ZERO8     95
0722 O                                  102 'GE-CE'
0723 O***********              BRCD     105                               S01117
0723 O                         TRBR     105                               S01117
0724 O                                  106 '0'
0725 O                         ZERO3    108P
0726 O                                  111 '   '
0727 O                         ZERO5    114P
     O                         SPACT    124
0729 O                         OFF      128
0730 O                                  129 'E'
0731 O                         ONE      130
     O                 47      PRFC     134                               S01117
     O                 47 36 39DSFPPC   134                               CAC001
     O                                  140 '235959'                      S10736
     O                                  141 '0'                           S10736
     O                         SPASC    146                               S10736
0732 O                         IPDN     160
0700 O                         SWCR     176                               S05452
0700 O                         ZERO6    200                               S05452
     O**********               OTRF     230                                            S01182 CGL029
     O                         OTST     240                               S01182
     O                         OTTP     250                               S01182
     O                         SDCB     258P                              S01182
     O                         SDLB     266P                              S01182
     O                         BOKC     268                               S01182
     O                         ZERO5    271P                              S01413
     O                         ZERO13   279P                              S01413
     O                         WACKEY   351                                                   CGL020
     O                                  352 ' '                                               CGL020
     O                         ZERO13   359P                                                  CGL020
     O                         ZERO5    364                                                   CGL020
     O                         RORACT   384                                                   CGL020
     O                         RORCTY   386                                                   CGL020
     O                         RORBNK   406                                                   CGL020
     O                         RORCDE   417                                                   CGL020
     O                         PORACT   437                                                   CGL020
     O                         PORCTY   439                                                   CGL020
     O                         PORBNK   459                                                   CGL020
     O                         PORCDE   470                                                   CGL020
     O                         DSTACT   505                                                   CGL020
     O                         DSTCTY   507                                                   CGL020
     O                         DSTBNK   527                                                   CGL020
     O                         SETDAT   530P                                                  CGL020
     O                         TICKER   540                                                   CGL020
     O                         EXCHNG   560                                                   CGL020
     O                         NOMINL   573                                                   CGL020
     O                         FDTRID   589                                                   CGL020
     O                         SPAC     599                                                   CGL029
     O                         OTRF     620                                                   CGL029
     O                         ACODQQ    14                                                 AR894859
     O                         LTAI     147                                                 AR894859
     O                         ORAMT    316P                                                  CGL120
     O                         XRFN     329                                                 AR894859
     O*                                                                   S01408
     O/COPY WNCPYSRC,RE0350OOP2                                           S01408
     O*                                                                   S01408
0733 O*
0734 O* DO NOT GENERATE THIS POSTING IF CREDIT CCY EQUALS BASE CCY
0735 O*
0736 O********D**      02N46 U2                                           S01117
0737 O*******OR**      02 56 U2                                           S01117
0673 O*                                                                   S01117
     O********E*               POST2                                S01117E18408
      *                                           ***  Posting 3  ***     E18408
     O        E                POST3                                      E18408
0673 O*                                                                   S01117
0738 O                                    1 'P'
0739 O*************************BICN       7                               E81077
     O***********            28DRBICN     7                         E81077S01117
     O***********            29CRBICN     7                         E81077S01117
     O***********           N26BICN       7                         E81077S01117
0739 O                         TBICN      7                               S01117
0740 O                         CRCY      10
0741 O**********               SPAC      14                                                   CGL029
0742 O                                   16 '01'
0743 O                         ZERO10    32
0744 O                         RUND      35P
0745 O**********               RUND      38P                                                  237304
     O                         CRVD      38P                                                  237304
     O/COPY WNCPYSRC,RE0350O007
0746 O                                   43 '91020'
     O/COPY WNCPYSRC,RE0350O008
0747 O***********                        63 'CUST EXCH INPUT DOC '        S01522
0748 O***********                        68 'NO - '                       S01522
0749 O***********              IPDN      73                               S01522
     O                         O#PNA4    73                               S01522
0750 O                         CRAM      80P
     O                 35      MCRAM     80P                              CAC001
0751 O                                   81 '0'
0752 O                         ZERO6     87
0753 O                         ZERO8     95
0754 O                                  102 'GE-CE'
0755 O***********              BRCD     105                               S01117
0755 O                         TRBR     105                               S01117
0756 O                                  106 '0'
0757 O                         ZERO3    108P
0758 O                                  111 '   '
0759 O                         ZERO5    114P
     O                         SPACT    124
0761 O                         OFF      128
0762 O                                  129 'E'
0763 O                         ONE      130
     O                 47      PRFC     134                               S01117
     O                 47 36 39DSFPPC   134                               CAC001
     O                                  140 '235959'                      S10736
     O                                  141 '0'                           S10736
     O                         SPASC    146                               S10736
0764 O                         IPDN     160
0700 O                         SWCR     176                               S05452
0700 O                         ZERO6    200                               S05452
     O**********               OTRF     230                                            S01182 CGL029
     O                         OTST     240                               S01182
     O                         OTTP     250                               S01182
     O                         SDCB     258P                              S01182
     O                         SDLB     266P                              S01182
     O                         BOKC     268                               S01182
     O                         ZERO5    271P                              S01413
     O                         ZERO13   279P                              S01413
     O                         WACKEY   351                                                   CGL020
     O                                  352 ' '                                               CGL020
     O                         ZERO13   359P                                                  CGL020
     O                         ZERO5    364                                                   CGL020
     O                         RORACT   384                                                   CGL020
     O                         RORCTY   386                                                   CGL020
     O                         RORBNK   406                                                   CGL020
     O                         RORCDE   417                                                   CGL020
     O                         PORACT   437                                                   CGL020
     O                         PORCTY   439                                                   CGL020
     O                         PORBNK   459                                                   CGL020
     O                         PORCDE   470                                                   CGL020
     O                         DSTACT   505                                                   CGL020
     O                         DSTCTY   507                                                   CGL020
     O                         DSTBNK   527                                                   CGL020
     O                         SETDAT   530P                                                  CGL020
     O                         TICKER   540                                                   CGL020
     O                         EXCHNG   560                                                   CGL020
     O                         NOMINL   573                                                   CGL020
     O                         FDTRID   589                                                   CGL020
     O                         SPAC     599                                                   CGL029
     O                         OTRF     620                                                   CGL029
     O                         ACODQQ    14                                                 AR894859
     O                         LTAI     147                                                 AR894859
     O                         ORAMT    316P                                                  CGL120
     O                         XRFN     329                                                 AR894859
     O*                                                                   S01408
     O/COPY WNCPYSRC,RE0350OOP2                                           S01408
     O*                                                                   S01408
0765 O********D**      02 U2                                              S01117
0673 O*                                                                   S01117
     O********E**              POST5                                S01117E18408
      *                                           ***  Posting 4  ***     E18408
     O        E                POST4                                      E18408
0673 O*                                                                   S01117
0766 O                                    1 'P'
0767 O                         CCUS       7
0768 O                         CRCY      10
0769 O**********               CCOD      14                                                   CGL029
0770 O                         CACS      16
0771 O                   N24   CRAN      32
     O                    24   ZERO10    32                               S01117
0772 O                         RUND      35P
0773 O******                   RUND      38P                              S01111
0773 O                         CRVD      38P                              S01111
     O/COPY WNCPYSRC,RE0350O009
0774 O                                   43 '91020'
     O/COPY WNCPYSRC,RE0350O010
0775 O***********              CRNA      73                               S01522
     O                         O#PNA3    73                               S01522
0776 O********                 CRAM      80P                              S01111
0776 O***********        N30   CRAM      80P                       S01111 CAC001
0776 O***********         31   CRAM      80P                       S01111 CAC001
0776 O***********         30N31CCHAM     80P                       S01111 CAC001
     O                   N30   CRAM      80P                              CAC001
     O                    31   CRAM      80P                              CAC001
     O                    30N31CCHAM     80P                              CAC001
0777 O                                   81 '1'
     O**********               ZERO6     87                                                   194873
     O                         DCUS      87                                                   194873
0779 O                         ZERO8     95
0780 O                                  102 'GE-CE'
0781 O*************************BRCD     105                               E81077
     O***********            26CRBRCD   105                         E81077S01117
     O***********           N26BRCD     105                         E81077S01117
0781 O                         CBRC     105                               S01117
0782 O                                  106 '0'
0783 O                       75         106 '1'
0784 O                         ZERO3    108P
0785 O                                  111 '   '
0786 O                         ZERO5    114P
0788 O                         CRTYP    124
0789 O                         CORON    128
0790 O                                  129 'E'
0791 O                         ONE      130
     O                 47      PRFC     134                               S01117
     O                 47 36 38PRFCA    134                               CAC001
     O                                  140 '235959'                      S10736
     O                                  141 '0'                           S10736
     O                         CRSEC    146                               S10736
0792 O                         IPDN     160
0700 O                         SWCR     176                               S05452
0700 O                         ZERO6    200                               S05452
     O**********               OTRF     230                                            S01182 CGL029
     O                         OTST     240                               S01182
     O                         OTTP     250                               S01182
     O                         SDCB     258P                              S01182
     O                         SDLB     266P                              S01182
     O                         BOKC     268                               S01182
     O                         ZERO5    271P                              S01413
     O/COPY WNCPYSRC,RE0350O024
     O                         ZERO13   279P                              S01413
     O                         WACKEY   351                                                   CGL020
     O                 31               352 ' '                                               CGL020
     O                 31      ZERO13   359P                                                  CGL020
     O                 31      ZERO5    364                                                   CGL020
     O                N30               352 ' '                                               CGL020
     O                N30      ZERO13   359P                                                  CGL020
     O                N30      ZERO5    364                                                   CGL020
     O                         RORACT   384                                                   CGL020
     O                         RORCTY   386                                                   CGL020
     O                         RORBNK   406                                                   CGL020
     O                         RORCDE   417                                                   CGL020
     O                         PORACT   437                                                   CGL020
     O                         PORCTY   439                                                   CGL020
     O                         PORBNK   459                                                   CGL020
     O                         PORCDE   470                                                   CGL020
     O                         DSTACT   505                                                   CGL020
     O                         DSTCTY   507                                                   CGL020
     O                         DSTBNK   527                                                   CGL020
     O                         SETDAT   530P                                                  CGL020
     O                 30N31   WCFFLG   352                                                   CGL020
     O                 30N31   WCFVAL   359P                                                  CGL020
     O                 30N31   WCFPCT   364                                                   CGL020
     O                         TICKER   540                                                   CGL020
     O                         EXCHNG   560                                                   CGL020
     O                         NOMINL   573                                                   CGL020
     O                         FDTRID   589                                                   CGL020
     O                         CCOD     599                                                   CGL029
     O                         OTRF     620                                                   CGL029
     O                         ACODQQ    14                                                 AR894859
     O                         LTAI     147                                                 AR894859
     O                         ORAMT    316P                                                  CGL120
     O                         XRFN     329                                                 AR894859
     O*                                                                   S01408
     O/COPY WNCPYSRC,RE0350OOP2                                           S01408
     O*                                                                   S01408
0793 O*
0794 O* DO NOT GENERATE THIS POSTING IF DEBIT CCY EQUALS BASE CCY
0795 O*
0796 O********D**      02N45 U2                                           S01117
0797 O*******OR**      02 56 U2                                           S01117
0673 O*                                                                   S01117
     O********E**              POST3                                S01117E18408
      *                                           ***  Posting 5  ***     E18408
     O        E                POST5                                      E18408
0673 O*                                                                   S01117
0798 O                                    1 'P'
0799 O*************************BICN       7                               E81077
     O***********            28DRBICN     7                         E81077S01117
     O***********            29CRBICN     7                         E81077S01117
     O***********           N26BICN       7                         E81077S01117
0799 O                         TBICN      7                               S01117
0800 O                         BCCY      10
0801 O**********               TACC      14                                                   CGL029
0802 O                                   16 '01'
0803 O                         ZERO10    32
0804 O                         RUND      35P
0805 O                         RUND      38P
     O/COPY WNCPYSRC,RE0350O011
0806 O                                   43 '91020'
     O/COPY WNCPYSRC,RE0350O012
0807 O***********                        63 'CUST EXCH INPUT DOC '        S01522
0808 O***********                        68 'NO - '                       S01522
0809 O***********              IPDN      73                               S01522
     O                         O#PNA2    73                               S01522
0810 O                       46CRAM      80P
0811 O                       45DRAM      80P
0812 O                   N46N45BCEQ      80P
     O                 36 34 45MBCEQ     80P                              CAC001
     O                 36 35 46MBCEQ     80P                              CAC001
0813 O                                   81 '0'
0814 O                         ZERO6     87
0815 O                         ZERO8     95
0816 O                                  102 'GE-CE'
0817 O***********              BRCD     105                               S01117
0817 O                         TRBR     105                               S01117
0818 O                                  106 '0'
0819 O                         ZERO3    108P
0820 O                                  111 '   '
0821 O                         ZERO5    114P
     O                         TACCTD   124
0823 O                         OFF      128
0824 O                                  129 'E'
0825 O                         ONE      130
     O                 47      PRFC     134                               S01117
     O                 47 36 39DSFPPC   134                               CAC001
     O                                  140 '235959'                      S10736
     O                                  141 '0'                           S10736
     O                         TACSCD   146                               S10736
0826 O                         IPDN     160
0700 O                         SWCR     176                               S05452
0700 O                         ZERO6    200                               S05452
     O**********               OTRF     230                                            S01182 CGL029
     O                         OTST     240                               S01182
     O                         OTTP     250                               S01182
     O                         SDCB     258P                              S01182
     O                         SDLB     266P                              S01182
     O                         BOKC     268                               S01182
     O                         ZERO5    271P                              S01413
     O                         ZERO13   279P                              S01413
     O                         WACKEY   351                                                   CGL020
     O                                  352 ' '                                               CGL020
     O                         ZERO13   359P                                                  CGL020
     O                         ZERO5    364                                                   CGL020
     O                         RORACT   384                                                   CGL020
     O                         RORCTY   386                                                   CGL020
     O                         RORBNK   406                                                   CGL020
     O                         RORCDE   417                                                   CGL020
     O                         PORACT   437                                                   CGL020
     O                         PORCTY   439                                                   CGL020
     O                         PORBNK   459                                                   CGL020
     O                         PORCDE   470                                                   CGL020
     O                         DSTACT   505                                                   CGL020
     O                         DSTCTY   507                                                   CGL020
     O                         DSTBNK   527                                                   CGL020
     O                         SETDAT   530P                                                  CGL020
     O                         TICKER   540                                                   CGL020
     O                         EXCHNG   560                                                   CGL020
     O                         NOMINL   573                                                   CGL020
     O                         FDTRID   589                                                   CGL020
     O                         TACC     599                                                   CGL029
     O                         OTRF     620                                                   CGL029
     O                         ACODQQ    14                                                 AR894859
     O                         LTAI     147                                                 AR894859
     O                         ORAMT    316P                                                  CGL120
     O                         XRFN     329                                                 AR894859
     O*                                                                   S01408
     O/COPY WNCPYSRC,RE0350OOP2                                           S01408
     O*                                                                   S01408
0827 O*
0828 O* DO NOT GENERATE THIS POSTING IF CREDIT CCY EQUALS BASE CCY
0829 O*
0830 O********D**      02N46 U2                                           S01117
0831 O*******OR**      02 56 U2                                           S01117
0673 O*                                                                   S01117
     O        E                POST6                                      S01117
      *                                           ***  Posting 6  ***     E18408
0673 O*                                                                   S01117
0832 O                                    1 'P'
0833 O*************************BICN       7                               E81077
     O***********            28DRBICN     7                         E81077S01117
     O***********            29CRBICN     7                         E81077S01117
     O***********           N26BICN       7                         E81077S01117
0833 O                         TBICN      7                               S01117
0834 O                         BCCY      10
0835 O**********               TACCC     14                                                   CGL029
0836 O                                   16 '01'
0837 O                         ZERO10    32
0838 O                         RUND      35P
0839 O                         RUND      38P
     O/COPY WNCPYSRC,RE0350O013
0840 O                                   43 '91020'
     O/COPY WNCPYSRC,RE0350O014
0841 O***********                        63 'CUST EXCH INPUT DOC '        S01522
0842 O***********                        68 'NO - '                       S01522
0843 O***********              IPDN      73                               S01522
     O                         O#PNA2    73                               S01522
0844 O                       45DRAM      80P
0845 O                       46CRAM      80P
0846 O                   N45N46BCEQ      80P
     O                 36 34 45MBCEQ     80P                              CAC001
     O                 36 35 46MBCEQ     80P                              CAC001
0847 O                                   81 '1'
0848 O                         ZERO6     87
0849 O                         ZERO8     95
0850 O                                  102 'GE-CE'
0851 O***********              BRCD     105                               S01117
0851 O                         TRBR     105                               S01117
0852 O                                  106 '0'
0853 O                         ZERO3    108P
0854 O                                  111 '   '
0855 O                         ZERO5    114P
     O                         TACCTC   124
0857 O                         OFF      128
0858 O                                  129 'E'
0859 O                         ONE      130
     O                 47      PRFC     134                               S01117
     O                 47 36 39DSFPPC   134                               CAC001
     O                                  140 '235959'                      S10736
     O                                  141 '0'                           S10736
     O                         TACSCC   146                               S10736
0860 O                         IPDN     160
0700 O                         SWCR     176                               S05452
0700 O                         ZERO6    200                               S05452
     O**********               OTRF     230                                            S01182 CGL029
     O                         OTST     240                               S01182
     O                         OTTP     250                               S01182
     O                         SDCB     258P                              S01182
     O                         SDLB     266P                              S01182
     O                         BOKC     268                               S01182
     O                         ZERO5    271P                              S01413
     O                         ZERO13   279P                              S01413
     O                         WACKEY   351                                                   CGL020
     O                                  352 ' '                                               CGL020
     O                         ZERO13   359P                                                  CGL020
     O                         ZERO5    364                                                   CGL020
     O                         RORACT   384                                                   CGL020
     O                         RORCTY   386                                                   CGL020
     O                         RORBNK   406                                                   CGL020
     O                         RORCDE   417                                                   CGL020
     O                         PORACT   437                                                   CGL020
     O                         PORCTY   439                                                   CGL020
     O                         PORBNK   459                                                   CGL020
     O                         PORCDE   470                                                   CGL020
     O                         DSTACT   505                                                   CGL020
     O                         DSTCTY   507                                                   CGL020
     O                         DSTBNK   527                                                   CGL020
     O                         SETDAT   530P                                                  CGL020
     O                         TICKER   540                                                   CGL020
     O                         EXCHNG   560                                                   CGL020
     O                         NOMINL   573                                                   CGL020
     O                         FDTRID   589                                                   CGL020
     O**********               CADFR    599                                           CGL029 BUG3907
     O                         TACCC    599                                                  BUG3907
     O                         OTRF     620                                                   CGL029
     O                         ACODQQ    14                                                 AR894859
     O                         LTAI     147                                                 AR894859
     O                         ORAMT    316P                                                  CGL120
     O                         XRFN     329                                                 AR894859
     O*                                                                   S01408
     O/COPY WNCPYSRC,RE0350OOP2                                           S01408
     O*                                                                   S01408
     O***********                                                   E81077S01117
     O***********                                                   E81077S01117
     O***DO*NOT*GENERATE THIS POSTING UNLESS EXCHANGE IS ACROSS TWO E81077S01117
     O***********                                       BRANCHES.   E81077S01117
     O***********                                                   E81077S01117
     O********D**      02 26 U2                                     E81077S01117
     O***********                         1 'P'                     E81077S01117
     O***********              DRBICN     7                         E81077S01117
     O***********      29      DRCY      10                         E81077S01117
     O***********      28      CRCY      10                         E81077S01117
     O***********      28      DRIBAB    14                         E81077S01117
     O***********      29      DRIBAH    14                         E81077S01117
     O***********                        16 '01'                    E81077S01117
     O***********              ZERO10    32                         E81077S01117
     O***********              RUND      35P                        E81077S01117
     O***********              RUND      38P                        E81077S01117
     O***********                        43 '91020'                 E81077S01117
     O***********                        63 'CUST EXCH INPUT DOC '  E81077S01117
     O***********                        68 'NO - '                 E81077S01117
     O***********              IPDN      73                         E81077S01117
     O***********      29      DRAM      80P                        E81077S01117
     O***********      28      CRAM      80P                        E81077S01117
     O***********                        81 '1'                     E81077S01117
     O***********              ZERO6     87                         E81077S01117
     O***********              ZERO8     95                         E81077S01117
     O***********                       102 'GE-CE'                 E81077S01117
     O***********              DRBRCD   105                         E81077S01117
     O***********                       106 '0'                     E81077S01117
     O***********              ZERO3    108P                        E81077S01117
     O***********                       111 '   '                   E81077S01117
     O***********              ZERO5    114P                        E81077S01117
     O***********                       124 'G'                     E81077S01117
     O***********              OFF      128                         E81077S01117
     O***********                       129 'E'                     E81077S01117
     O***********              ONE      130                         E81077S01117
     O***********              IPDN     160                         E81077S01117
     O***********                                                   E81077S01117
     O***DO*NOT*GENERATE THIS POSTING UNLESS EXCHANGE IS ACROSS TWO E81077S01117
     O***********                                       BRANCHES.   E81077S01117
     O***********                                                   E81077S01117
     O********D**      02 26 U2                                     E81077S01117
     O***********                         1 'P'                     E81077S01117
     O***********              CRBICN     7                         E81077S01117
     O***********      29      DRCY      10                         E81077S01117
     O***********      28      CRCY      10                         E81077S01117
     O***********      29      CRIBAB    14                         E81077S01117
     O***********      28      CRIBAH    14                         E81077S01117
     O***********                        16 '01'                    E81077S01117
     O***********              ZERO10    32                         E81077S01117
     O***********              RUND      35P                        E81077S01117
     O***********              RUND      38P                        E81077S01117
     O***********                        43 '91020'                 E81077S01117
     O***********                        63 'CUST EXCH INPUT DOC '  E81077S01117
     O***********                        68 'NO - '                 E81077S01117
     O***********              IPDN      73                         E81077S01117
     O***********      29      DRAM      80P                        E81077S01117
     O***********      28      CRAM      80P                        E81077S01117
     O***********                        81 '0'                     E81077S01117
     O***********              ZERO6     87                         E81077S01117
     O***********              ZERO8     95                         E81077S01117
     O***********                       102 'GE-CE'                 E81077S01117
     O***********              CRBRCD   105                         E81077S01117
     O***********                       106 '0'                     E81077S01117
     O***********              ZERO3    108P                        E81077S01117
     O***********                       111 '   '                   E81077S01117
     O***********              ZERO5    114P                        E81077S01117
     O***********                       124 'G'                     E81077S01117
     O***********              OFF      128                         E81077S01117
     O***********                       129 'E'                     E81077S01117
     O***********              ONE      130                         E81077S01117
     O***********              IPDN     160                         E81077S01117
0673 O*                                                                   S01117
0827 O*                                                                   S01117
0828 O* DO NOT GENERATE THIS POSTING IF DEBIT BRANCH EQUALS CREDIT BRANCH S01117
0829 O*                                                                   S01117
     O        E                POST7                                      S01117
      *                                           ***  Posting 7  ***     E18408
0673 O*                                                                   S01117
0832 O                                    1 'P'                           S01117
0833 O                 55      MBICN      7                               S01117
0833 O                N55      CBICN      7                               S01117
0834 O                 83      CRCY      10                               S01117
0834 O                N83      DRCY      10                               S01117
0835 O**********               DADTO     14                                            S01117 CGL029
0836 O                                   16 '01'                          S01117
0837 O                         ZERO10    32                               S01117
0838 O                         RUND      35P                              S01117
0839 O                         RUND      38P                              S01117
     O/COPY WNCPYSRC,RE0350O015
0840 O                                   43 '91020'                       S01117
     O/COPY WNCPYSRC,RE0350O016
0841 O***********                        63 'CUST EXCH INPUT DOC '  S01117S01522
0842 O***********                        68 'NO - '                 S01117S01522
0843 O***********              IPDN      73                         S01117S01522
     O                         O#PNA2    73                               S01522
0844 O                 83      CRAM      80P                              S01117
0844 O                N83      DRAM      80P                              S01117
0847 O                                   81 '1'                           S01117
0848 O                         ZERO6     87                               S01117
0849 O                         ZERO8     95                               S01117
0850 O                                  102 'GE-CE'                       S01117
0851 O                         DRBR     105                               S01117
0852 O                                  106 '0'                           S01117
0853 O                         ZERO3    108P                              S01117
0854 O                                  111 '   '                         S01117
0855 O                         ZERO5    114P                              S01117
     O                         DTYPTO   124                               S01117
0857 O                         OFF      128                               S01117
0858 O                                  129 'E'                           S01117
0859 O                         ONE      130                               S01117
     O                 47      PRFC     134                               S01117
     O                 47 36   FTPRFP   134                               CAC001
     O                                  140 '235959'                      S10736
     O                                  141 '0'                           S10736
     O                         DSECTO   146                               S10736
0860 O                         IPDN     160                               S01117
0700 O                         SWCR     176                               S01117
0700 O                         ZERO6    200                               S01117
     O**********               OTRF     230                                            S01182 CGL029
     O                         OTST     240                               S01182
     O                         OTTP     250                               S01182
     O                         SDCB     258P                              S01182
     O                         SDLB     266P                              S01182
     O                         BOKC     268                               S01182
     O                         ZERO5    271P                              S01413
     O                         ZERO13   279P                              S01413
     O                         WACKEY   351                                                   CGL020
     O                                  352 ' '                                               CGL020
     O                         ZERO13   359P                                                  CGL020
     O                         ZERO5    364                                                   CGL020
     O                         RORACT   384                                                   CGL020
     O                         RORCTY   386                                                   CGL020
     O                         RORBNK   406                                                   CGL020
     O                         RORCDE   417                                                   CGL020
     O                         PORACT   437                                                   CGL020
     O                         PORCTY   439                                                   CGL020
     O                         PORBNK   459                                                   CGL020
     O                         PORCDE   470                                                   CGL020
     O                         DSTACT   505                                                   CGL020
     O                         DSTCTY   507                                                   CGL020
     O                         DSTBNK   527                                                   CGL020
     O                         SETDAT   530P                                                  CGL020
     O                         TICKER   540                                                   CGL020
     O                         EXCHNG   560                                                   CGL020
     O                         NOMINL   573                                                   CGL020
     O                         FDTRID   589                                                   CGL020
     O                         DADTO    599                                                   CGL029
     O                         OTRF     620                                                   CGL029
     O                         ACODQQ    14                                                 AR894859
     O                         LTAI     147                                                 AR894859
     O                         ORAMT    316P                                                  CGL120
     O                         XRFN     329                                                 AR894859
     O*                                                                   S01408
     O/COPY WNCPYSRC,RE0350OOP2                                           S01408
     O*                                                                   S01408
0673 O*                                                                   S01117
0827 O*                                                                   S01117
0828 O* DO NOT GENERATE THIS POSTING IF DEBIT BRANCH EQUALS CREDIT BRANCH S01117
0829 O*                                                                   S01117
     O        E                POST8                                      S01117
      *                                           ***  Posting 8  ***     E18408
0673 O*                                                                   S01117
0832 O                                    1 'P'                           S01117
0833 O                 55      MBICN      7                               S01117
0833 O                N55      DBICN      7                               S01117
0834 O                 83      CRCY      10                               S01117
0834 O                N83      DRCY      10                               S01117
0835 O**********               CADFR     14                                            S01117 CGL029
0836 O                                   16 '01'                          S01117
0837 O                         ZERO10    32                               S01117
0838 O                         RUND      35P                              S01117
0839 O                         RUND      38P                              S01117
     O/COPY WNCPYSRC,RE0350O017
0840 O                                   43 '91020'                       S01117
     O/COPY WNCPYSRC,RE0350O018
0841 O***********                        63 'CUST EXCH INPUT DOC '  S01117S01522
0842 O***********                        68 'NO - '                 S01117S01522
0843 O***********              IPDN      73                         S01117S01522
     O                         O#PNA4    73                               S01522
0844 O                 83      CRAM      80P                              S01117
0844 O                N83      DRAM      80P                              S01117
0847 O                                   81 '0'                           S01117
0848 O                         ZERO6     87                               S01117
0849 O                         ZERO8     95                               S01117
0850 O                                  102 'GE-CE'                       S01117
0851 O                         CBRC     105                               S01117
0852 O                                  106 '0'                           S01117
0853 O                         ZERO3    108P                              S01117
0854 O                                  111 '   '                         S01117
0855 O                         ZERO5    114P                              S01117
     O                         CTYPFR   124                               S01117
0857 O                         OFF      128                               S01117
0858 O                                  129 'E'                           S01117
0859 O                         ONE      130                               S01117
     O                 47      PRFC     134                               S01117
     O                 47 36   FTPRFP   134                               CAC001
     O                                  140 '235959'                      S10736
     O                                  141 '0'                           S10736
     O                         CSECFR   146                               S10736
0860 O                         IPDN     160                               S01117
0700 O                         SWCR     176                               S01117
0700 O                         ZERO6    200                               S01117
     O**********               OTRF     230                                            S01182 CGL029
     O                         OTST     240                               S01182
     O                         OTTP     250                               S01182
     O                         SDCB     258P                              S01182
     O                         SDLB     266P                              S01182
     O                         BOKC     268                               S01182
     O                         ZERO5    271P                              S01413
     O                         ZERO13   279P                              S01413
     O                         WACKEY   351                                                   CGL020
     O                                  352 ' '                                               CGL020
     O                         ZERO13   359P                                                  CGL020
     O                         ZERO5    364                                                   CGL020
     O                         RORACT   384                                                   CGL020
     O                         RORCTY   386                                                   CGL020
     O                         RORBNK   406                                                   CGL020
     O                         RORCDE   417                                                   CGL020
     O                         PORACT   437                                                   CGL020
     O                         PORCTY   439                                                   CGL020
     O                         PORBNK   459                                                   CGL020
     O                         PORCDE   470                                                   CGL020
     O                         DSTACT   505                                                   CGL020
     O                         DSTCTY   507                                                   CGL020
     O                         DSTBNK   527                                                   CGL020
     O                         SETDAT   530P                                                  CGL020
     O                         TICKER   540                                                   CGL020
     O                         EXCHNG   560                                                   CGL020
     O                         NOMINL   573                                                   CGL020
     O                         FDTRID   589                                                   CGL020
     O                         CADFR    599                                                   CGL029
     O                         OTRF     620                                                   CGL029
     O                         ACODQQ    14                                                 AR894859
     O                         LTAI     147                                                 AR894859
     O                         ORAMT    316P                                                  CGL120
     O                         XRFN     329                                                 AR894859
     O*                                                                   S01408
     O/COPY WNCPYSRC,RE0350OOP2                                           S01408
     O*                                                                   S01408
0827 O*                                                                   S01117
0828 O* GENERATE MAIN BRANCH ENTRIES IF INTERBRANCH ENTRIES VIA MAIN      S01117
0828 O* BRANCH, AND NEITHER DR NOR CR BRANCH = MAIN BRANCH                S01117
0829 O*                                                                   S01117
     O        E                POST10                                     S01117
      *                                           ***  Posting 10 ***     E18408
0673 O*                                                                   S01117
0832 O                                    1 'P'                           S01117
0833 O                         CBICN      7                               S01117
0834 O                 83      CRCY      10                               S01117
0834 O                N83      DRCY      10                               S01117
0835 O**********               MADTO     14                                            S01117 CGL029
0836 O                                   16 '01'                          S01117
0837 O                         ZERO10    32                               S01117
0838 O                         RUND      35P                              S01117
0839 O                         RUND      38P                              S01117
     O/COPY WNCPYSRC,RE0350O019
0840 O                                   43 '91020'                       S01117
     O/COPY WNCPYSRC,RE0350O020
0841 O***********                        63 'CUST EXCH INPUT DOC '  S01117S01522
0842 O***********                        68 'NO - '                 S01117S01522
0843 O***********              IPDN      73                         S01117S01522
     O                         O#PNA4    73                               S01522
0844 O                 83      CRAM      80P                              S01117
0844 O                N83      DRAM      80P                              S01117
0847 O                                   81 '1'                           S01117
0848 O                         ZERO6     87                               S01117
0849 O                         ZERO8     95                               S01117
0850 O                                  102 'GE-CE'                       S01117
0851 O                         BKMABR   105                               S01117
0852 O                                  106 '0'                           S01117
0853 O                         ZERO3    108P                              S01117
0854 O                                  111 '   '                         S01117
0855 O                         ZERO5    114P                              S01117
     O                         MTYPTO   124                               S01117
0857 O                         OFF      128                               S01117
0858 O                                  129 'E'                           S01117
0859 O                         ONE      130                               S01117
     O                 47      PRFC     134                               S01117
     O                 47 36   FTPRFP   134                               CAC001
     O                                  140 '235959'                      S10736
     O                                  141 '0'                           S10736
     O                         MSECTO   146                               S10736
0860 O                         IPDN     160                               S01117
0700 O                         SWCR     176                               S01117
0700 O                         ZERO6    200                               S01117
     O**********               OTRF     230                                            S01182 CGL029
     O                         OTST     240                               S01182
     O                         OTTP     250                               S01182
     O                         SDCB     258P                              S01182
     O                         SDLB     266P                              S01182
     O                         BOKC     268                               S01182
     O                         ZERO5    271P                              S01413
     O                         ZERO13   279P                              S01413
     O                         WACKEY   351                                                   CGL020
     O                                  352 ' '                                               CGL020
     O                         ZERO13   359P                                                  CGL020
     O                         ZERO5    364                                                   CGL020
     O                         RORACT   384                                                   CGL020
     O                         RORCTY   386                                                   CGL020
     O                         RORBNK   406                                                   CGL020
     O                         RORCDE   417                                                   CGL020
     O                         PORACT   437                                                   CGL020
     O                         PORCTY   439                                                   CGL020
     O                         PORBNK   459                                                   CGL020
     O                         PORCDE   470                                                   CGL020
     O                         DSTACT   505                                                   CGL020
     O                         DSTCTY   507                                                   CGL020
     O                         DSTBNK   527                                                   CGL020
     O                         SETDAT   530P                                                  CGL020
     O                         TICKER   540                                                   CGL020
     O                         EXCHNG   560                                                   CGL020
     O                         NOMINL   573                                                   CGL020
     O                         FDTRID   589                                                   CGL020
     O                         MADTO    599                                                   CGL029
     O                         OTRF     620                                                   CGL029
     O                         ACODQQ    14                                                 AR894859
     O                         LTAI     147                                                 AR894859
     O                         ORAMT    316P                                                  CGL120
     O                         XRFN     329                                                 AR894859
     O*                                                                   S01408
     O/COPY WNCPYSRC,RE0350OOP2                                           S01408
     O*                                                                   S01408
     O*                                                                   S01117
     O********E**              POST11                               S01117E18048
      *                                           ***  Posting 9  ***     E18408
     O        E                POST9                                      E18408
     O*                                                                   S01117
0832 O                                    1 'P'                           S01117
0833 O                         DBICN      7                               S01117
0834 O                 83      CRCY      10                               S01117
0834 O                N83      DRCY      10                               S01117
0835 O**********               MADFR     14                                            S01117 CGL029
0836 O                                   16 '01'                          S01117
0837 O                         ZERO10    32                               S01117
0838 O                         RUND      35P                              S01117
0839 O                         RUND      38P                              S01117
     O/COPY WNCPYSRC,RE0350O021
0840 O                                   43 '91020'                       S01117
     O/COPY WNCPYSRC,RE0350O022
0841 O***********                        63 'CUST EXCH INPUT DOC '  S01117S01522
0842 O***********                        68 'NO - '                 S01117S01522
0843 O***********              IPDN      73                         S01117S01522
     O                         O#PNA2    73                               S01522
0844 O                 83      CRAM      80P                              S01117
0844 O                N83      DRAM      80P                              S01117
0847 O                                   81 '0'                           S01117
0848 O                         ZERO6     87                               S01117
0849 O                         ZERO8     95                               S01117
0850 O                                  102 'GE-CE'                       S01117
0851 O                         BKMABR   105                               S01117
0852 O                                  106 '0'                           S01117
0853 O                         ZERO3    108P                              S01117
0854 O                                  111 '   '                         S01117
0855 O                         ZERO5    114P                              S01117
     O                         MTYPFR   124                               S01117
0857 O                         OFF      128                               S01117
0858 O                                  129 'E'                           S01117
0859 O                         ONE      130                               S01117
     O                 47      PRFC     134                               S01117
     O                 47 36   FTPRFP   134                               CAC001
     O                                  140 '235959'                      S10736
     O                                  141 '0'                           S10736
     O                         MSECFR   146                               S10736
0860 O                         IPDN     160                               S01117
0700 O                         SWCR     176                               S01117
0700 O                         ZERO6    200                               S01117
     O**********               OTRF     230                                            S01182 CGL029
     O                         OTST     240                               S01182
     O                         OTTP     250                               S01182
     O                         SDCB     258P                              S01182
     O                         SDLB     266P                              S01182
     O                         BOKC     268                               S01182
     O                         ZERO5    271P                              S01413
     O                         ZERO13   279P                              S01413
     O                         WACKEY   351                                                   CGL020
     O                                  352 ' '                                               CGL020
     O                         ZERO13   359P                                                  CGL020
     O                         ZERO5    364                                                   CGL020
     O                         RORACT   384                                                   CGL020
     O                         RORCTY   386                                                   CGL020
     O                         RORBNK   406                                                   CGL020
     O                         RORCDE   417                                                   CGL020
     O                         PORACT   437                                                   CGL020
     O                         PORCTY   439                                                   CGL020
     O                         PORBNK   459                                                   CGL020
     O                         PORCDE   470                                                   CGL020
     O                         DSTACT   505                                                   CGL020
     O                         DSTCTY   507                                                   CGL020
     O                         DSTBNK   527                                                   CGL020
     O                         SETDAT   530P                                                  CGL020
     O                         TICKER   540                                                   CGL020
     O                         EXCHNG   560                                                   CGL020
     O                         NOMINL   573                                                   CGL020
     O                         FDTRID   589                                                   CGL020
     O                         MADFR    599                                                   CGL029
     O                         OTRF     620                                                   CGL029
     O                         ACODQQ    14                                                 AR894859
     O                         LTAI     147                                                 AR894859
     O                         ORAMT    316P                                                  CGL120
     O                         XRFN     329                                                 AR894859
     O*                                                                   S01408
     O/COPY WNCPYSRC,RE0350OOP2                                           S01408
     O/COPY WNCPYSRC,RE0350C026                                           S01408
     O*                                                                   S01408
0861 O*
0862 O*  OUTPUT TRAILER RECORD FOR GECE
0863 O*
0864 OGECEZZ  T        LR U2
0865 O                                    1 'T'
0866 O                         NORE       6
0867 O                         INT,2     14P
0868 O                         DEC,2     16P
      *                                                                   S01408
     O/COPY WNCPYSRC,RE0350OOP4                                           S01408
      *                                                                   S01408
**   ZYDY - YEARS IN DAYS CUMULATIVE IN FOUR YEAR SPAN                    S01111
0366073110961461                                                          S01111
**   ZMDY - MONTHS IN DAYS CUMULATIVE THROUGH YEAR                        S01111
000031059090120151181212243273304334365                                   S01111
**   ZMNM - MONTHS SHORT NAMES                                            S01111
JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC                                      S01111
** CPY@   **      OBJECT COPYRIGHT
(c) Finastra International Limited 2001
