0001 H        1
      *****************************************************************
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas Default Retail Accounts Extract')
0001 H***********
0002 F*****************************************************************
0003 F*                                                               *
     F*  Midas - Retail Module
0005 F*                                                               *
0006 F*  RE0560 - DEFAULT RETAIL ACCOUNTS EXTRACT.                    *
0007 F*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     F*      1990, 1993                                               *
0009 F*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      *  Last Amend No. CAP205             Date 05Jan10               *
      *  Prev Amend No. CRE030             Date 10Jul06               *
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027             Date 09Dec05               *
      *                 CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 122751             Date 13Jan98               *
      *                 093765             Date 18Aug97               *
     F*                 S01413             DATE 13APR93               *
     F*                 S01117                  21DEC89               *
0010 F*                 E12166                  20APR88               *
0011 F*                                                               *
0012 F*****************************************************************
0011 F*                                                               *
      *  CAP205 - Teller Related APIs Account Balance Check           *
      *  CRE030 - Default RE Accounts by Currency (Recompile)         *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits                  *
     F*  122751 - Should check DCNUM for Zeros not Blanks             *
     F*  093765 - Instead of issuing DB error, report missing         *
     F*           default retail accounts in RE0562.                  *
     F*  S01413 - Header Box Standardised                             *
     F*  S01117 - Multibranching                                      *
0011 F*  E12166 - An 'OUT OF BALANCE' error was being reported        *
0011 F*           by RE0562 if the number of live records on          *
0011 F*           REDES did not match those on REDEF. This is         *
0011 F*           incorrect as a closed record can still be used      *
0011 F*           for default details. The 'OUT OF BALANCE'           *
0011 F*           condition should only be reported if the            *
0011 F*           extract files, for example REDEXAB, are not         *
0011 F*           being cleared - so it appears that the number       *
0011 F*           of records being written to REDES exceeds the       *
0011 F*           number of default account codes on REDEF.           *
0011 F*           A database error should be reported by RE0560       *
0011 F*           if the suggested default key does not exists on     *
0011 F*           ACCNT / or ACNUM, and program RE0562 will not       *
0011 F*           be called.                                          *
0011 F*                                                               *
0012 F*****************************************************************
0011 F*                                                               *
     F*  C R E A T I O N     P A R A M E T E R S                      *
     F*                                                               *
     F*                                                               *
     F*****************************************************************
0013 F***REDEF** IP  F     128  5AI     2 DISK                                         RE0560 CGL029
     F***REDEF** IP  F     138  5AI     2 DISK                                         CGL029 CAP205
     FREDEF   IP  F     139  5AI     2 DISK                                                   CAP205
0014 F*CCNT   IF  F     400 15AI     2 DISK                               S01117
0014 F***ACCNT** IF  F     400 18AI     2 DISK                                         S01117 CGL029
     FACCNT   IF  F     573 24AI     2 DISK                                                   CGL029
0015 F***ACNUM** IF  F      40 10AI     2 DISK                                         RE0560 CGL029
     FACNUM   IF  F      46 10AI     2 DISK                                                   CGL029
0016 FTABLE   IF  F      96 12AI     2 DISK                               RE0560
0017 FREDEXAA O   F     400            DISK                               RE0560
0018 F***REDEXAB O   F     400            DISK                                         RE0560 CGL029
     F***REDEXAB O   F     410            DISK                                         CGL029 CAP205
     FREDEXAB O   F     411            DISK                                                   CAP205
0017 FREDEXAC O   F     400            DISK                               RE0560
0017 F*E0560P1O   F     132            PRINTER                      S01124S01117
0017 FRE0560AUO   F     132            PRINTER                            S01117
0019 F*                                                                   RE0560
0020 F*       13      REDEF - DETAIL RECORD.                              RE0560
0021 F*       14      ACNUM FILE - DETAIL RECORD.                         RE0560
     F*       15      ACNUM FILE - DETAIL RECORD CLOSED ACCOUNT           E12166
     F********20******DATABASE*ERROR*ON*TABLE*FILE*ICDR*1.******** E12166 093765
     F********21******DATABASE*ERROR*ON*ACNUM*FILE.*************** E12166 093765
     F********22******DATABASE*ERROR*ON*ACCNT*FILE.*************** E12166 093765
     F*       21      NO LIVE/CLOSED RECORD OF ACCOUNT IN ACNUM/ACCNT.    093765
     F*                                                                   E12166
0022 F*       71      ACCNT - DETAIL RECORD/OPEN ACCOUNT.                 RE0560
0023 F*       72      OUTPUT HEADER RECORD TO EXTRACT FILE.               RE0560
0024 F*       74      ACCNT - DETAIL RECORD/CLOSED ACCOUNT.               RE0560
0025 F*       75      DEFAULT RECORD IS A RETAIL ACCOUNT NUMBER.          RE0560
0026 F*       76      FIRST CYCLE INDICATOR.                              RE0560
0027 F*       77      OUTPUT DETAIL RECORD TO EXTRACT FILE.               RE0560
0028 F*       98      ZSYSTM INDICATOR                                    RE0560
0029 F*       99      ZSYSTM INDICATOR - CHAIN FAIL IN GENERAL USE.       RE0560
0030 F********U7      DATABASE ERROR - TABLE ICDR 1. NOT FOUND.           E12166
0030 F********U7******DATABASE*ERROR****************************** E12166 093765
     F*       U7      DATABASE ERROR - TABLE ICDR 1 NOT FOUND.            093765
0031 F*       U8      REDEF FILE - OUT OF BALANCE WITH CONTROLS ON TRAILERRE0560
0032 F*       LR      LAST RECORD READ FROM REDEF,OR DATABASE ERROR FOUND.RE0560
0033 F*                                                                   RE0560
0034 E*                                                                   RE0560
0035 E                    NR          5  5 0             *FILE CONTROLS   RE0560
     E                    CPY@    1   1 80
0036 E*                                                                   RE0560
0037 I*                                                                   RE0560
0038 I**   RETAIL DEFAULT ACCOUNTS FILE - DETAIL RECORD.                  RE0560
0039 I*                                                                   RE0560
0040 IREDEF   NS  13   1 CD                                               RE0560
0041 I                                        1   1 DRECI                 RE0560
0042 I**********                              2   5 DACOD                              RE0560 CGL029
     I                                        2   5 DACOD#                                    CGL029
0043 I                                        6   6 DTYP                  RE0560
0044 I                                    P  31  330DTNLU                 RE0560
0045 I                                    P  34  360DORED                 RE0560
0046 I                                    P  37  390DLCD                  RE0560
0047 I                                       40  40 DCHTP                 RE0560
0048 I                                    P  41  470DHASH                 RE0560
0049 I                                       48  53 DCNUM                 RE0560
0050 I                                       54  56 DCCY                  RE0560
0051 I                                       57  58 DSEQ                  RE0560
0052 I                                       59  68 DRETN                 RE0560
0052 I                                       69  71 DBRCD                 S01117
     I                                      129 138 DACOD                                     CGL029
     I                                      139 139 DABCR                                     CAP205
0053 I*                                                                   RE0560
0054 I**   RETAIL DEFAULT ACCOUNTS FILE - TRAILER RECORD.                 RE0560
0055 I*                                                                   RE0560
0056 I        NS       1 CZ                                               RE0560
0057 I                                    P  35  49 NR                    RE0560
0058 I*                                                                   RE0560
0059 I*    CATCHALL                                                       RE0560
0060 I        NS                                                          RE0560
0061 I*                                                                   RE0560
0062 I**   ACCOUNT MASTER FILE - OPEN AND CLOSED DETAIL RECORDS.          RE0560
0063 I*                                                                   RE0560
0064 IACCNT   NS  74   1 CC                                               RE0560
0065 I       OR   71   1 CD                                               RE0560
0066 I                                        1   1 MRECI                 RE0560
0067 I**********                              2   70MCNUM                              RE0560 CSD027
0067 I                                        2   7 MCNUM                                     CSD027
0068 I                                        8  10 MCCY                  RE0560
0069 I**********                             11  140MACOD                              RE0560 CGL029
     I                                       11  140MACOD#                                    CGL029
0070 I                                       15  160MACSQ                 RE0560
0071 I*****                                  23  250MBRCD                 S01117
0071 I                                       23  25 MBRCA                 S01117
0072 I                                       26  26 MATYP                 RE0560
0073 I                                       27  27 MSTYP                 RE0560
0074 I                                       29  29 MACST                 RE0560
     I                                      190 1990MRETN                 093765
     I                                      554 5630MACOD                                     CGL029
0075 I                                        1 200 MOLD1                 RE0560
0076 I                                      201 400 MOLD2                 RE0560
0077 I*                                                                   RE0560
0078 I*    CATCHALL                                                       RE0560
0079 I        NS                                                          RE0560
0080 I*                                                                   RE0560
0081 I**   RETAIL ACCOUNT NUMBERS FILE.                                   RE0560
0082 I*                                                                   RE0560
0083 IACNUM   NS  15   1 CC                                               E12166
0065 I       OR   14   1 CD                                               E12166
0084 I                                        2  11 AACNO                 RE0560
0085 I                                       12  17 DCNUM                 RE0560
0086 I                                       18  20 DCCY                  RE0560
0087 I**********                             21  24 DACOD                              RE0560 CGL029
0088 I**********                             25  26 DSEQ                               RE0560 CGL029
0089 I**********                             27  27 AACST                              RE0560 CGL029
0089 I**********                             29  31 DBRCD                              S01117 CGL029
     I                                       21  30 DACOD                                     CGL029
     I                                       31  32 DSEQ                                      CGL029
     I                                       33  33 AACST                                     CGL029
     I                                       35  37 DBRCD                                     CGL029
0090 I*    CATCHALL.                                                      RE0560
0091 I        NS                                                          RE0560
0092 I*                                                                   RE0560
0093 I*    TABLE FILE - INSTALLATION CONTROL DATA RECORD 1.               RE0560
0094 I*                                                                   RE0560
0095 ITABLE   NS       2 C0   3 C1  12 C1                                 RE0560
0096 I       AND      13 C0                                               RE0560
0097 I                                        1   1 RECI                  RE0560
0098 I                                        2   30RECT                  RE0560
0099 I                                       12  130RCDE                  RE0560
0100 I                                       14  66 TITL                  RE0560
0101 I                                       67  67 DATF                  RE0560
0102 I*****                                  68  700DFBR                  S01117
0102 I                                       68  70 DFBM                  S01117
0103 I                                       73  73 SWIM                  RE0560
0104 I                                       74  74 MODI1                 RE0560
0105 I                                       75  75 MODI2                 RE0560
0106 I                                       76  76 MODI3                 RE0560
0107 I                                    P  77  790RUND                  RE0560
0108 I                                       80  86 RUNA                  RE0560
0109 I                                       87  870SFLG                  RE0560
0110 I                                    P  90  920LCD                   RE0560
0111 I                                       93  93 CHTP                  RE0560
0112 I                                    P  94  960TNLU                  RE0560
0113 I*    CATCHALL.                                                      RE0560
0114 I        NS                                                          RE0560
0115 I*                                                                   RE0560
0116 I**                                                                  RE0560
0117 I*    STANDARD LOCAL DATA AREA FIELDS                                RE0560
0118 I*                                                                   RE0560
0119 ILDA        UDS                            256                       RE0560
0120 I                                        1   8 LPROC                 RE0560
0186 I***********                           134 138 LFILE                 S01117
0187 I***********                           139 167 LKEY                  S01117
0188 I***********                           168 175 LPROG                 S01117
0189 I***********                           176 1770LDBNO                 S01117
0183 I                                      134 141 LFILE                 S01117
0183 I                                      142 170 LKEY                  S01117
0183 I                                      171 180 LPROG                 S01117
0183 I                                      181 1830LDBNO                 S01117
0183 I                                      134 141 DBFILE                S01117
0183 I                                      142 170 DBKEY                 S01117
0183 I                                      171 180 DBPGM                 S01117
0183 I                                      181 1830DBASE                 S01117
0190 I***********                           181 1850LRUND                 S01117
0191 I***********                           186 192 LRUNA                 S01117
0192 I***********                           193 193 LDATF                 S01117
0193 I***********                           194 1940LSFLG                 S01117
0190 I                                      187 1910LRUND                 S01117
0191 I                                      192 198 LRUNA                 S01117
0192 I                                      199 199 LDATF                 S01117
0193 I**********                            200 2000LSFLG           S01117S01194
0193 I                                      200 200 LSFLG                 S01194
     I*                                                                   093765
     I*    WORK DATA STRUCTURE                                            093765
     I*                                                                   093765
     I            DS                                                      093765
     I                                        1   1 @MRECI                093765
     I                                        2   7 @MCNUM                093765
     I                                        8  10 @MCCY                 093765
     I**********                             11  14 @MACOD                             093765 CGL029
     I                                       11  14 @MACO#                                    CGL029
     I                                       15  16 @MACSQ                093765
     I                                      190 199 @MRETN                093765
     I*                                                                   093765
     I                                        1 200 @MOLD1                093765
     I                                      201 400 @MOLD2                093765
     I                                      400 410 @MACOD                                    CGL029
     I*                                                                   093765
0128 I**                                                                  RE0560
     C                     MOVEACPY@      BIS@   80
0129 C   76                SETOF                     72                   RE0560
0130 C   76                GOTO NOTFC                                     RE0560
0131 C                     SETON                     7672                 RE0560
0132 C                     EXSR ZSYSTM                                    RE0560
     C                     MOVE *BLANK    DBFILE                          S01117
     C                     MOVE *BLANK    DBKEY                           S01117
     C                     MOVE *BLANK    DBASE                           S01117
     C                     MOVE *BLANK    DBPGM                           S01117
0133 C                     MOVEL'REP0560 'LPROC                           RE0560
0134 C                     MOVEL'RE0560'  LPROG                           RE0560
0135 C                     Z-ADDRUND      LRUND                           RE0560
0136 C                     MOVELRUNA      LRUNA                           RE0560
0137 C                     MOVELSFLG      LSFLG                           RE0560
0138 C                     MOVELDATF      LDATF                           RE0560
0139 C***********          MOVEL'TABLE'   LFILE                           S01117
0140 C***********          MOVELZTABKY    LKEY                            S01117
0141 C*                                                                   RE0560
0142 C**   DATABASE ERROR - I.C.D.R.1 NOT FOUND  --  END PROGRAM.         RE0560
0144 C***99****************SETON                     U7LR                 E12166
0144 C***99******          SETON                     U7LR20        E12166 093765
     C   99                SETON                     U7LR                 093765
0139 C   99                MOVEL'TABLE'   DBFILE                          S01117
0140 C   99                MOVELZTABKY    DBKEY                           S01117
0145 C   99                GOTO END1                                      RE0560
0146 C                     MOVE ' '       BLK06   6                       RE0560
0147 C           NOTFC     TAG                             ** NOTFC TAG **RE0560
0148 C  N13                GOTO END2                                      RE0560
0149 C*                                                                   RE0560
0150 C**   KEEP COUNT OF DETAIL RECORDS READ.                             RE0560
0151 C*                                                                   RE0560
0152 C           DREC      ADD  1         DREC    50                      RE0560
0153 C*                                                                   RE0560
0154 C**   CHECK WHETHER DEFAULT IS A RETAIL NO.                          RE0560
0155 C*                                                                   RE0560
0156 C***********DCNUM     COMP BLK06                    75               122751
     C********** DCNUM     COMP *ZEROS                   75                            122751 CSD027
     C           DCNUM     COMP *BLANKS                  75                                   CSD027
0157 C  N75                GOTO ACCHN                                     RE0560
0158 C***********DRETN     CHAINACNUM                99                   093765
     C           DRETN     CHAINACNUM                21                   093765
0139 C***99******          MOVEL'ACNUM'   DBFILE                   S01117 093765
0140 C***99******          MOVELDRETN     DBKEY                    S01117 093765
     C***99******          SETON                     21            E12166 093765
     C*                                                                   E12166
0159 C**N14******          GOTO END2                                      E12166
0159 C**N14N15***          GOTO END2                               E12166 093765
0160 C*                                                                   RE0560
     C           *IN21     IFEQ '0'                                       093765
     C           *IN14     ANDEQ'0'                                       093765
     C           *IN15     ANDEQ'0'                                       093765
     C                     MOVE '1'       *IN21                           093765
     C                     END                                            093765
     C*                                                                   093765
     C** Bypass chain to ACCNT if record is not found in ACNUM.           093765
     C           *IN21     IFEQ '1'                                       093765
0161 C**   SET UP KEY TO PICK UP DEFAULT RECORD FROM A/C MASTER FILE.     RE0560
0162 C*                                                                   RE0560
0163 C           ACCHN     TAG                             ** ACCHN TAG **RE0560
0164 C                     MOVELDCNUM     PART1   9                       RE0560
0165 C                     MOVE DCCY      PART1                           RE0560
0166 C**********           MOVELDACOD     PART2   6                                    RE0560 CGL029
     C                     MOVELDACOD     PART2  12                                           CGL029
0167 C                     MOVE DSEQ      PART2                           RE0560
0168 C*****                MOVELPART1     ACKEY  15                       S01117
0169 C*****                MOVE PART2     ACKEY                           S01117
0168 C**********           MOVELPART1     PART3  15                                    S01117 CGL029
     C                     MOVELPART1     PART3  21                                           CGL029
0169 C                     MOVE PART2     PART3                           S01117
0168 C**********           MOVELPART3     ACKEY  18                                    S01117 CGL029
     C                     MOVELPART3     ACKEY  24                                           CGL029
0169 C                     MOVE DBRCD     ACKEY                           S01117
0170 C***********ACKEY     CHAINACCNT                99            RE0560 093765
     C           ACKEY     CHAINACCNT                21                   093765
0139 C***99******          MOVEL'ACCNT'   DBFILE                   S01117 093765
0140 C***99******          MOVELACKEY     DBKEY                    S01117 093765
     C***99******          SETON                     22            E12166 093765
     C*                                                                   E12166
     C**N71N74***          GOTO END2                               RE0560 093765
     C*                                                                   093765
     C           *IN21     IFEQ '0'                                       093765
     C           *IN71     ANDEQ'0'                                       093765
     C           *IN74     ANDEQ'0'                                       093765
     C                     MOVE '1'       *IN21                           093765
     C                     END                                            093765
     C*                                                                   093765
     C                     END                                            093765
     C*                                                                   093765
     C** Set up update fields for missing accounts.                       093765
     C           *IN21     IFEQ '1'                                       093765
     C                     MOVE *BLANKS   @MOLD1                          093765
     C                     MOVE *BLANKS   @MOLD2                          093765
     C                     MOVE *BLANKS   @MACOD                                              CGL029
     C                     MOVE '*'       @MRECI                          093765
     C                     MOVE DCNUM     @MCNUM                          093765
     C                     MOVE DCCY      @MCCY                           093765
     C                     MOVE DACOD     @MACOD                          093765
     C                     MOVE DSEQ      @MACSQ                          093765
     C                     MOVE DRETN     @MRETN                          093765
     C                     END                                            093765
0172 C*                                                                   RE0560
0173 C**   DETAIL RECORD FOUND - OUTPUT TO EXTRACT FILE.                  RE0560
0174 C*                                                                   RE0560
0175 C           DOUT      ADD  1         DOUT    50                      RE0560
0176 C                     SETON                     77                   RE0560
0177 C                     GOTO END1                                      RE0560
0178 C*                                                                   RE0560
0179 C**   CHAIN FAIL/RECORD NOT FOUND - DO NOT OUTPUT RECORD TO EXTRACT. RE0560
0180 C*                                                                   RE0560
0179 C**   CHAIN FAIL/RECORD NOT FOUND - DATABASE ERROR  - ADVISE AS   T. E12166
0180 C*                                                    SUCH           E12166
0181 C           END2      TAG                             ** END2  TAG **RE0560
0182 C                     SETOF                     77                   RE0560
0142 C**   DATABASE ERROR -  END PROGRAM.                                 E12166
0143 C*                                                                   E12166
0144 C   99                SETON                     U7LR                 E12166
0183 C*                                                                   RE0560
0184 C           END1      TAG                             ** END1  TAG **RE0560
0185 C*                                                                   RE0560
0186 C**   TEST OUT OF BALANCE CONDITION.                                 RE0560
0187 C*                                                                   RE0560
0188 CLRNU7      NR,1      COMP DREC                 U8U8                 RE0560
0189 C*                                                                   RE0560
     CLR    U7             EXSR *PSSR                                     S01117
0190 C********************************************************************RE0560
0191 C**                                                                  RE0560
0192 C**   ZSYSTM SR. TO CHAIN TO THE INSTALLATION CONTROL DATA RECORD.   RE0560
0193 C**                                                                  RE0560
0194 C           ZSYSTM    BEGSR                           *** ZSYSTM *** RE0560
0195 C**                                                                  RE0560
0196 C**   SET UP KEY FOR INSTALLATION CONTROL RECORD.                    RE0560
0197 C                     MOVEL'01      'ZTABKY 12                       RE0560
0198 C                     MOVE '  10'    ZTABKY                          RE0560
0199 C**                                                                  RE0560
0200 C           ZTABKY    CHAINTABLE                99    ON NOT THERE   RE0560
0201 C  N99      RECI      COMP 'D'                  9999  ON, IS DELETED RE0560
0202 C**                                                                  RE0560
0203 C**   CHECK SYSTEM DATE FORMAT, DDMMYY OR MMDDYY.                    RE0560
0204 C           DATF      COMP 'M'                      98MMDDYY, 98 ON  RE0560
0205 C**                                                                  RE0560
0206 C                     ENDSR                                          RE0560
0207 C**                                                                  RE0560
0208 C**                                                                  RE0560
0209 C********************************************************************RE0560
     C*                                                                   S01117
     C* *PSSR  --- SUBROUTINE TO HANDLE ABNORMAL ERROR CONDITIONS         S01117
     C*                                                                   S01117
     C* CALLED FROM: AFTER ABNORNAL OPERATION OCCURS                      S01117
     C*                                                                   S01117
     C* CALLS: NOTHING                                                    S01117
     C*                                                                   S01117
     C********************************************************************S01117
     C**                                                                  S01117
     C*                                                                   S01117
     C           *PSSR     BEGSR                           ** *PSSR **    S01117
     C*                                                                   S01117
     C           @RUN      IFEQ *BLANKS                                   S01117
     C                     MOVE 'Y'       @RUN    1                       S01117
     C                     DUMP                                           S01117
     C                     END                                            S01117
     C*                                                                   S01117
     C                     ENDSR                           ** *PSSR **    S01117
     C********************************************************************S01117
0210 O*                                                                   RE0560
0211 O**   DEFAULT RETAIL ACCOUNTS EXTRACT FILE - HEADER,DETAIL,TRAILER.  RE0560
0212 O*                                                                   RE0560
0213 OREDEXAA D        72                                                 RE0560
0214 O                                    1 'A'                           RE0560
0215 OREDEXAB D        77                                                 RE0560
0216 O***********              MOLD1    200                        RE0560 093765
     O                      N21MOLD1    200                               093765
     O                       21@MOLD1   200                               093765
0217 O***********              MOLD2    400                        RE0560 093765
     O                      N21MOLD2    400                               093765
     O                       21@MOLD2   400                               093765
     O                      N21MACOD    410                                                   CGL029
     O                       21@MACOD   410                                                   CGL029
     O                         DABCR    411                                                   CAP205
0218 O                         DLCD      19P                              RE0560
0219 O                         DCHTP     20                               RE0560
0220 O***********                        21 'D'                    E12166 093765
     O                      N21          21 'D'                           093765
     O                       21          21 'M'                           093765
0221 OREDEXAC T        LR                                                 RE0560
0222 O                                    1 'Z'                           RE0560
0223 O                                    8 '9999999'                     RE0560
0224 O                         DOUT      39                               RE0560
0225 O*                                                                   RE0560
0226 O**   OUTPUT FILE EXTRACT CONTROL REPORT.                            RE0560
0227 O*                                                                   RE0560
0228 O*E0560P1T  203   LR                                           S01124S01117
0228 ORE0560AUT  203   LR                                                 S01117
0229 O*****                              22 'REFERENCE RE0560'            S01117
0229 O                                   24 'REFERENCE RE0560AU'          S01117
0230 O                         TITL      89                               RE0560
0231 O                                  104 'DATE'                        RE0560
0232 O                         RUNA     112                               RE0560
0233 O                                  122 'PAGE'                        RE0560
0234 O                         PAGE     126                               RE0560
0235 O        T        LR                                                 RE0560
0236 O                                   59 'DEFAULT RETAIL ACCOUNTS'     RE0560
0237 O                                   82 'EXTRACT - FILE CONTROL'      RE0560
0238 O                                   89 'REPORT'                      RE0560
0239 O        T        LR                                                 RE0560
0240 O                                   59 '-----------------------'     RE0560
0241 O                                   82 '-----------------------'     RE0560
0242 O                                   89 '-------'                     RE0560
0243 O        T  215   LR                                                 RE0560
0244 O                                   60 'INPUT'                       RE0560
0245 O                                   90 'CALCULATED'                  RE0560
0246 O        T  2     LR                                                 RE0560
0247 O                                   42 'DEFAULT RETAIL ACCOUNTS'     RE0560
0248 O                                   47 'FILE'                        RE0560
0249 O        T  3     LR                                                 RE0560
0250 O                                   39 'NUMBER OF ACTIVE S/REDEF'    RE0560
0251 O                                   47 'RECORDS'                     RE0560
0252 O                         NR,1  3   60                               RE0560
0253 O                         DREC  3   90                               RE0560
0254 O                       U8         116 '*** OUT OF BALANCE ***'      RE0560
0255 O        T        LR                                                 RE0560
0256 O                                   47 'WRITTEN TO EXTRACT FILE'     RE0560
0257 O                         DOUT  3   90                               RE0560
0258 O        T   29   LR U7                                              E12166
0259 O                                   45 '***  DATABASE ERROR -'       RE0560
0260 O***********            20          67 'FILE-S/TABLE - KEY-01'E12166 093765
0261 O***********            20          82 '10  ***'              E12166 093765
0260 O***********            21          65 'FILE-S/ACNUM - KEY-'  E12166 093765
0261 O***********            21DRETN     80                        E12166 093765
0261 O***********            21          85 '***'                  E12166 093765
0261 O***********            22          65 'FILE-S/ACCNT - KEY-'  E12166 093765
0261 O***********            22ACKEY     84                        E12166 093765
0261 O***********            22          89 '***'                  E12166 093765
     O                                   67 'FILE-S/TABLE - KEY-01'       093765
     O                                   82 '10  ***'                     093765
0262 O********T** 31   LR                                                 S01117
0263 O***********                        66 '*** END OF REPORT ***'       S01117
** CPY@   **      OBJECT COPYRIGHT
(c) Misys International Banking Systems Ltd. 2001
