     A*****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IMNM                                                      *
/*EXI *  MBR(INT) DTAMBRS((DENEVNTPD (INT)))                          *
/*EXI *  TEXT('Midas DE New Historic Positions')
/*ADD * ADDLFM FILE(DENEVNTL1) MBR(ACCT) DTAMBRS((DENEVNTPD (ACCT)))  *
/*ADD * ADDLFM FILE(DENEVNTL1) MBR(CFCO) DTAMBRS((DENEVNTPD (CFCO)))  *
/*ADD * ADDLFM FILE(DENEVNTL1) MBR(FRAS) DTAMBRS((DENEVNTPD (FRAS)))  *
/*ADD * ADDLFM FILE(DENEVNTL1) MBR(FXDL) DTAMBRS((DENEVNTPD (FXDL)))  *
/*ADD * ADDLFM FILE(DENEVNTL1) MBR(LDNI) DTAMBRS((DENEVNTPD (LDNI)))  *
/*ADD * ADDLFM FILE(DENEVNTL1) MBR(LOAN) DTAMBRS((DENEVNTPD (LOAN)))  *
/*ADD * ADDLFM FILE(DENEVNTL1) MBR(NASP) DTAMBRS((DENEVNTPD (NASP)))  *
/*ADD * ADDLFM FILE(DENEVNTL1) MBR(OTCC) DTAMBRS((DENEVNTPD (OTCC)))  *
/*ADD * ADDLFM FILE(DENEVNTL1) MBR(SBPS) DTAMBRS((DENEVNTPD (SBPS)))  *
/*ADD * ADDLFM FILE(DENEVNTL1) MBR(STRD) DTAMBRS((DENEVNTPD (STRD)))  *
/*ADD * ADDLFM FILE(DENEVNTL1) MBR(SWAP) DTAMBRS((DENEVNTPD (SWAP)))  *
/*ADD * ADDLFM FILE(DENEVNTL1) MBR(CUSX) DTAMBRS((DENEVNTPD (CUSX)))  *
/*ADD * ADDLFM FILE(DENEVNTL1) MBR(EXTR) DTAMBRS((DENEVNTPD (EXTR)))  *
/*ADD * ADDLFM FILE(DENEVNTL1) MBR(FEES) DTAMBRS((DENEVNTPD (FEES)))  *
/*ADD * ADDLFM FILE(DENEVNTL1) MBR(FUND) DTAMBRS((DENEVNTPD (FUND)))  *
/*ADD * ADDLFM FILE(DENEVNTL1) MBR(FCLT) DTAMBRS((DENEVNTPD (FCLT)))  *
      *****************************************************************
      *                                                               *
      *  Midas - Data Export Module                                   *
      *                                                               *
      *  LF/DENEVNTL1 - New Historic Events                           *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. CSD103             Date 10Aug20               *
      *  Prev Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CGL029             Date 01Sep03               *
      *                 CLE034             Date 16Sep03               *
      *                 208221 *CREATE     Date 11Dec02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD103 - LIBOR Deregulation - Common Layer/Standing Data     *
      *             (Recompile)                                       *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CLE034 - Lending Enhancements for Phase 1 Priority 1A        *
      *           (recompiled).                                       *
      *  208221 - Changes identified during alpha site                *
      *                                                               *
      *****************************************************************
      *
     A          R DEEVNTP0                  PFILE(DENEVNTPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
 
     A          K E#MOD
     A          K E#TREF
     A          K E#EVTP
     A          K E#PRDT
