     A*****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IMNM                                                      *
/*EXI *  MBR(INT) DTAMBRS((DEPEVNTPD (INT)))                          *
/*EXI *  TEXT('Midas DE Projected events')
/*A*D **ADDLFM*FILE(DEPEVNTL1)*MBR(ACCT)*DTAMBRS((DEPEVNTPD*(ACCT)))***                     MD057243
/*A*D **ADDLFM*FILE(DEPEVNTL1)*MBR(CFCO)*DTAMBRS((DEPEVNTPD*(CFCO)))***                     MD057243
/*A*D **ADDLFM*FILE(DEPEVNTL1)*MBR(CUSX)*DTAMBRS((DEPEVNTPD*(CUSX)))***                     MD057243
/*A*D **ADDLFM*FILE(DEPEVNTL1)*MBR(EXTR)*DTAMBRS((DEPEVNTPD*(EXTR)))***                     MD057243
/*A*D **ADDLFM*FILE(DEPEVNTL1)*MBR(FCLT)*DTAMBRS((DEPEVNTPD*(FCLT)))***                     MD057243
/*A*D **ADDLFM*FILE(DEPEVNTL1)*MBR(FEES)*DTAMBRS((DEPEVNTPD*(FEES)))***                     MD057243
/*A*D **ADDLFM*FILE(DEPEVNTL1)*MBR(FRAS)*DTAMBRS((DEPEVNTPD*(FRAS)))***                     MD057243
/*A*D **ADDLFM*FILE(DEPEVNTL1)*MBR(FUND)*DTAMBRS((DEPEVNTPD*(FUND)))***                     MD057243
/*A*D **ADDLFM*FILE(DEPEVNTL1)*MBR(FXDL)*DTAMBRS((DEPEVNTPD*(FXDL)))***                     MD057243
/*A*D **ADDLFM*FILE(DEPEVNTL1)*MBR(LDNI)*DTAMBRS((DEPEVNTPD*(LDNI)))***                     MD057243
/*A*D **ADDLFM*FILE(DEPEVNTL1)*MBR(LOAN)*DTAMBRS((DEPEVNTPD*(LOAN)))***                     MD057243
/*A*D **ADDLFM*FILE(DEPEVNTL1)*MBR(NASP)*DTAMBRS((DEPEVNTPD*(NASP)))***                     MD057243
/*A*D **ADDLFM*FILE(DEPEVNTL1)*MBR(OTCC)*DTAMBRS((DEPEVNTPD*(OTCC)))***                     MD057243
/*A*D **ADDLFM*FILE(DEPEVNTL1)*MBR(SBPS)*DTAMBRS((DEPEVNTPD*(SBPS)))***                     MD057243
/*A*D **ADDLFM*FILE(DEPEVNTL1)*MBR(STRD)*DTAMBRS((DEPEVNTPD*(STRD)))***                     MD057243
/*A*D **ADDLFM*FILE(DEPEVNTL1)*MBR(SWAP)*DTAMBRS((DEPEVNTPD*(SWAP)))***                     MD057243
/*ADD *  ADDLFM DEPEVNTL1 MBR(ACCT) DTAMBRS((DEPEVNTPD (ACCT)))       *                     MD057243
/*ADD *  ADDLFM DEPEVNTL1 MBR(CFCO) DTAMBRS((DEPEVNTPD (CFCO)))       *                     MD057243
/*ADD *  ADDLFM DEPEVNTL1 MBR(CUSX) DTAMBRS((DEPEVNTPD (CUSX)))       *                     MD057243
/*ADD *  ADDLFM DEPEVNTL1 MBR(EXTR) DTAMBRS((DEPEVNTPD (EXTR)))       *                     MD057243
/*ADD *  ADDLFM DEPEVNTL1 MBR(FCLT) DTAMBRS((DEPEVNTPD (FCLT)))       *                     MD057243
/*ADD *  ADDLFM DEPEVNTL1 MBR(FEES) DTAMBRS((DEPEVNTPD (FEES)))       *                     MD057243
/*ADD *  ADDLFM DEPEVNTL1 MBR(FRAS) DTAMBRS((DEPEVNTPD (FRAS)))       *                     MD057243
/*ADD *  ADDLFM DEPEVNTL1 MBR(FUND) DTAMBRS((DEPEVNTPD (FUND)))       *                     MD057243
/*ADD *  ADDLFM DEPEVNTL1 MBR(FXDL) DTAMBRS((DEPEVNTPD (FXDL)))       *                     MD057243
/*ADD *  ADDLFM DEPEVNTL1 MBR(LDNI) DTAMBRS((DEPEVNTPD (LDNI)))       *                     MD057243
/*ADD *  ADDLFM DEPEVNTL1 MBR(LOAN) DTAMBRS((DEPEVNTPD (LOAN)))       *                     MD057243
/*ADD *  ADDLFM DEPEVNTL1 MBR(NASP) DTAMBRS((DEPEVNTPD (NASP)))       *                     MD057243
/*ADD *  ADDLFM DEPEVNTL1 MBR(OTCC) DTAMBRS((DEPEVNTPD (OTCC)))       *                     MD057243
/*ADD *  ADDLFM DEPEVNTL1 MBR(SBPS) DTAMBRS((DEPEVNTPD (SBPS)))       *                     MD057243
/*ADD *  ADDLFM DEPEVNTL1 MBR(STRD) DTAMBRS((DEPEVNTPD (STRD)))       *                     MD057243
/*ADD *  ADDLFM DEPEVNTL1 MBR(SWAP) DTAMBRS((DEPEVNTPD (SWAP)))       *                     MD057243
      *****************************************************************
      *                                                               *
      *  Midas - Data Export Module                                   *
      *                                                               *
      *  LF/DEPEVNTL1 - Projected Events                              *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD057243           Date 10Aug20               *
      *  Prev Amend No. CSD103             Date 10Aug20               *
      *                 MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CGL029             Date 01Sep03               *
      *                 CLE034             Date 16Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 CDE002             Date 17Dec99               *
      * Midas DBA 3.03 -----------------------------------------------*
      *                 CDE001  *CREATE    Date 17Nov99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD057243 - Some LFs are not successfully compiled due to     *
      *             alignment of ADDLFM command. Adjusted the ADDLFM  *
      *             command in creation parameter.                    *
      *  CSD103 - LIBOR Deregulation - Common Layer/Standing Data     *
      *             (Recompile)                                       *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CLE034 - Lending Enhancements for Phase 1 Priority 1A        *
      *           (recompiled).                                       *
      *  CDE002 - Data Export - CCRM Revenue Analysis                 *
      *  CDE001 - Data Export - CCRM Limits                           *
      *                                                               *
      *****************************************************************
      *
     A          R DEEVNTP0                  PFILE(DEPEVNTPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')

     A          K E#MOD
     A          K E#TREF
     A          K E#ASLI
     A          K E#PRDT
     A          K E#PRSQ
     A          K E#EVTP
     A          K E#EVRF
