      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('FX Deals Extra Data Layout Definition')                *
      *****************************************************************
      *                                                               *
      *  Midas - Foreign Exchange (Dealing)                           *
      *                                                               *
      *  FXDLEXPD - FX Deals Extra Data Layout Definition             *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2017            *
      *                                                               *
      *  Last Amend No. CDL099 *CREATE     Date 06Oct17               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  CDL099 - Split Value Date                                    *
      *                                                               *
      *****************************************************************
     A          R FXDLEXD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2017')
      *
     A            DDSDAT         6A         TEXT('Split Value Date')
     A                                      COLHDG('Split Value Date')
      *
     A            DDEXDT       494A         TEXT('Extra Data Layout')
     A                                      COLHDG('Extra Data Layout')
      *
