      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas DL Net action file')
      *****************************************************************
      *                                                               *
      *  Midas - Dealing (FX) Module                                  *
      *                                                               *
      *  PF/FXNACTPD                                                  *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 25Nov05               *
      *  Prev Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CDL002  *CREATE    Date 19Dec96               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CDL002 - FX Netting.                                         *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R FXNACTD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            RARECI    R               REFFLD(RECI)
     A            RANETR    R               REFFLD(NTRF)
      * Begin /CSD027/
     A**********  RACNUM    R               REFFLD(CNUM)                                      CSD027
     A            RACNUM         6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            RABRCA    R               REFFLD(BRCA)
     A            RAACSQ    R               REFFLD(ACSQ)
     A            RAEDAT    R               REFFLD(EDAT)
     A            RAEAMT    R               REFFLD(EAMT)
     A            RABSIN    R               REFFLD(BSIN)
     A            RAECCY    R               REFFLD(ECCY)
     A            RASETP    R               REFFLD(SETP)
     A**Start of change CGL029
     A**********  RAOSAC    R               REFFLD(OSAC)                                      CGL029
     A            QQOSAC        12A
     A**End of change CGL029
     A            RAREVI    R               REFFLD(REVI)
     A            RAOTHA    R               REFFLD(OTHA)
     A            RAOTHC    R               REFFLD(OTHC)
     A            RAEXRT    R               REFFLD(EXRT)
     A            RAVDAT    R               REFFLD(VDAT)
     A            RASLID    R               REFFLD(SLID)
     A            RAMDAT    R               REFFLD(MDAT)
     A            RABRTT    R               REFFLD(BRTT)
     A            RABRTE    R               REFFLD(BRTE)
     A            RARTSP    R               REFFLD(RTSP)
     A            RAINTR    R               REFFLD(INTR)
     A            RAFFVD    R               REFFLD(FFVD)
     A            RAYRAT    R               REFFLD(YRAT)
     A            RAFFIN    R               REFFLD(FFIN)
      * Begin /CSD027/
     A**********  RACHNA    R               REFFLD(CHNA)                                      CSD027
     A            RACHNA         6A
     A                                      TEXT('Cnt holder of negotiable ass')
     A                                      COLHDG('Cnt hold            ' +
     A                                      'Of neg              ' +
     A                                      'Assets')
      * End /CSD027/
     A            RAFACO    R               REFFLD(FACO)
     A            RAPRFC    R               REFFLD(PRFC)
     A            RAOSBR    R               REFFLD(OSBR)
     A            RABOKC    R               REFFLD(BOKC)
     A**Start of change CGL029
     A            RAOSAC        18A
     A**End of change CGL029
