      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas FT Account Balance Override by PREF')            *
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  LF/FTABOVL0 - Midas FT Account Balance Override by PREF      *
      *                                                               *
      *  (c) Finastra International Limited 2022                      *
      *                                                               *
      *  Last Amend No. CFT166   *CREATE   Date 02Nov22               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CFT166 - Amendment to FT A/C Balance Check on Authorisation  *
      *                                                               *
      *****************************************************************
     A          R FTABOVD0                  PFILE(FTABOVPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2022')
      *
     A          K FTPREF
