      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IMIP                                                      *
/*EXI *  TEXT('Midas FT Currency Cut-Off Times')
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  FTCCUTV0 - Midas FT Currency Cut-Off Times                   *
      *                                                               *
      *  (C) Copyright Misys IBS Ltd. 2004                            *
      *                                                               *
      *  Last Amend No. MD031937           Date 13Jan15               *
      *  Prev Amend No. AR856737           Date 13Sep11               *
      *                 ESL038   *CREATE   Date 04Oct2004             *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD031937 - Upgrade STP enhancements to BF Midas 2.1          *
      *  AR856737 - Upgrade STP enhancements to Midas Plus level      *
      *  ESL038 - ING STP Development                                 *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
      *
     A          R @CCUTV0                   TEXT('(C) Misys IBS  +
     A                                      . 2004')
     A                                      PFILE(FTCCUTP0)
      *---------------------------------------------------------------------
     A            CCCYCD                    TEXT('Currency Code       (key)')
     A*****       CCBSEG                    TEXT('Customer Segment')                          STP499
     A            CCGPCD                    TEXT('Customer Group Code')                       STP499
     A            CCNWRK                    TEXT('Network')
     A            CCMTPY                    TEXT('Message type')
     A            CCIDOC                    TEXT('Incoming Date Offset code')
     A            CCICUT                    TEXT('Incoming Cut Off Time')
      *
     A            CCRECI                    TEXT('Record Identifier')
      *
      *---------------------------------------------------------------------
     A            CCDES1                    TEXT('Description 1')
     A            CCDES2                    TEXT('Description 2')
     A            CCDES3                    TEXT('Description 3')
      *
      *
      *---------------------------------------------------------------------
      * Audit information
     A            CCAJOB                    TEXT('Job name')
     A            CCAUSR                    TEXT('User name')
     A            CCATIM                    TEXT('Action Time')
     A            CCARDT                    TEXT('Action Date')
     A            CCAACT                    TEXT('Action Type')
     A            CCRDNB                    TEXT('Run day number')
      *....................
      * Key fields
     A          K CCCYCD
     A*****     K CCBSEG                                                                      STP499
     A          K CCGPCD                                                                      STP499
     A          K CCNWRK
     A          K CCMTPY
     A*=====================================================================
