      *****************************************************************
/*STD *: LFBASE                                                     : *
/*EXS *  LF_IMSN                                                      *
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTLCDTL0 - Outgoing Payments Local Clearing Details       *
      *                                                               *
      *  (C) Copyright Midas-Kapiti International Ltd. 2004           *
      *                                                               *
      *  Last Amend No. MD31937            Date 13Jan15               *
      *  Last Amend No. AR856737           Date 13Sep11               *
      *  Last Amend No. ESL038             Date 19Oct2004             *
      *  Prev Amend No. EBB013  *Create    Date 07Oct04               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD31937  - Upgrade STP enhancements to BF Midas 2.1          *
      *  AR856737 - Upgrade STP enhancements to Midas Plus level      *
      *  ESL038 - PLN Abroad - Inclusion of EBB013                    *
      *  EBB013 - Local Clearing Interface                            *
      *                                                               *
      *****************************************************************
      *
     A          R FTLCDTD0                  PFILE(FTLCDTPD)
     A                                      TEXT('(C) Misys International +
     A                                      Banking Systems Ltd. 2004')
     A          K CLPREF
      *
