      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IMIP                                                      *
/*EXI *  TEXT('Midas FT Payment Sub/type defaults')
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  FTPYSTV1 - Midas FT Payment Sub/type defaults                *
      *                                                               *
      *  (C) Copyright Misys IBS Ltd. 2003                            *
      *                                                               *
      *  Last Amend No. MD031937           Date 13Jan15               *
      *  Prev Amend No. AR856737           Date 13Sep11               *
      *                 EEE058   *Create   Date 12Feb2003             *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD031937 - Upgrade STP enhancements to BF Midas 2.1          *
      *  AR856737 - Upgrade STP enhancements to Midas Plus level      *
      *  EEE058 - Incoming STP                                        *
      *                                                               *
      *****************************************************************
     A                                      DYNSLT
      *
     A          R @PYSTV1                   TEXT('(C) Misys IBS  +
     A                                      . 2003')
     A                                      PFILE(FTPYSTP0)
      *---------------------------------------------------------------------
     A            PYPYTP                    TEXT('Payment type')
     A            PYBTYP                    TEXT('Beneficiary Type')
     A            PYFXIN                    TEXT('FX Transaction')
     A            PYF71A                    TEXT('Charges option')
     A            PYF71G                    TEXT('Our Charges')
     A            PYPCHR                    TEXT('Payment Character')
     A            PYDRAC                    TEXT('Debit Account Type')
     A            PYSTMT                    TEXT('Settlement Type')
     A            PYPYST                    TEXT('Payment subtype')
     A            PYRECI                    TEXT('Record Identifier')
      *
      *---------------------------------------------------------------------
     A            PYDES1                    TEXT('Description 1')
     A            PYDES2                    TEXT('Description 2')
     A            PYDES3                    TEXT('Description 3')
      *
      *---------------------------------------------------------------------
      * Audit information
     A            PYAJOB                    TEXT('Job name')
     A            PYAUSR                    TEXT('User name')
     A            PYATIM                    TEXT('Action Time')
     A            PYARDT                    TEXT('Action Date')
     A            PYAACT                    TEXT('Action Type')
     A            PYRDNB                    TEXT('Run day number')
      *....................
      * Key fields
     A          K PYPYTP
     A          K PYBTYP
     A          K PYFXIN
     A          K PYF71A
     A          K PYF71G
     A          K PYPCHR
     A          K PYDRAC
     A          K PYSTMT
     A*.....................................................................
     A* SELECT: Live
     A* Field    : Record Identifier
     A* Condition: Live
     A          S PYRECI                    COMP(EQ 'D')
      *
     A*=====================================================================
