      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IMIP                                                      *
/*EXI *  TEXT('Midas FT Restricted Countries')
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  FTRCTYV0 - Midas FT Restricted Countries                     *
      *                                                               *
      *  (C) Copyright Misys IBS Ltd. 2003                            *
      *                                                               *
      *  Last Amend No. MD031937           Date 13Jan15               *
      *  Prev Amend No. AR856737           Date 13Sep11               *
      *                 EEE058   *Create   Date 05Mar2003             *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD031937 - Upgrade STP enhancements to BF Midas 2.1          *
      *  AR856737 - Upgrade STP enhancements to Midas Plus level      *
      *  EEE058 - Incoming STP                                        *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
      *
     A          R @RCTYV0                   TEXT('(C) Misys IBS  +
     A                                      . 2003')
     A                                      PFILE(FTRCTYP0)
      *---------------------------------------------------------------------
     A            RCCNCD                    TEXT('Country Code')
     A            RCCNNM                    TEXT('Country Name')
      * Start EEE058
     A            RCMINP                    TEXT('Manual Input')
     A            RCRPTI                    TEXT('Report Indicator')
      * End EEE058
     A            RCRECI                    TEXT('Record Identifier')
      *
      *---------------------------------------------------------------------
     A            RCDES1                    TEXT('Description 1')
     A            RCDES2                    TEXT('Description 2')
     A            RCDES3                    TEXT('Description 3')
      *
      *---------------------------------------------------------------------
      * Audit information
     A            RCAJOB                    TEXT('Job name')
     A            RCAUSR                    TEXT('User name')
     A            RCATIM                    TEXT('Action Time')
     A            RCARDT                    TEXT('Action Date')
     A            RCAACT                    TEXT('Action Type')
     A            RCRDNB                    TEXT('Run day number')
      *....................
      * Key fields
     A          K RCCNCD
     A*=====================================================================
