      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas FT Nostro Transfers')
     A*****************************************************************
     A*                                                               *
     A*  Midas - FUNDS TRANSFER MODULE                            *
     A*                                                               *
     A*  LF/NTRAN - NOSTRO TRANSFERS                                  *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      *  Last Amend No. CAP212             Date 15Sep14               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01494             DATE 25MAY94               *
      *                 S01414             DATE 29MAR93               *
     A*                 E32481             DATE 16OCT91               *
     A*                 S01117             DATE 22MAY90               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  CAP212 - FT Nostro Transfer API (Recompile)                  *
     A*  S01494 - BLI Funds Transfer Enhancement.                     *
     A*           Recompiled.                                         *
     A*  S01414 - Book Code and Profit Centre Incorporation.          *
     A*           Recompiled.                                         *
     A*  E32481 - RECOMPILED FOR REMOVAL OF REDUNDANT MESSAGE         *
     A*           TYPE FLAGS.                                         *
     A*  S01117 - RECOMPILED FOR MULTIBRANCHING                       *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      UNIQUE
     A          R NTRANDDF                  PFILE(NTRANDD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K TFRF
     A*
