      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas FT OPAY Non-Auth by BRCA/STMT/PVDT/PREF')        *
      *****************************************************************
      *                                                               *
      *  Midas - FUNDS TRANSFER MODULE                                *
      *                                                               *
      *  LF/OTPDNOB2 - OUTGOING PAYMENTS NON AUTHORISED               *
      *                BY BOOKING BRANCH, SETTLEMENT TYPE(O8/02),     *
      *                PAY VALUE DATE AND PAYMENT REFERENCE           *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2016            *
      *                                                               *
      *  Last Amend No. MD039425  *Create  Date 12Aug16               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD039425 - Sort order in the outgoing payment second         *
      *             authorization level screen                        *
      *                                                               *
     A*****************************************************************
     A          R OTPAYDDF                  PFILE(OTPAYDD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2016')
     A          K BRCA
     A          K STMT                      DESCEND
     A          K PVDT
     A          K PREF
     A          S RECI                      COMP( EQ 'D' )
     A            AUIN                      COMP( EQ ' ' )
     A            BNCT                      COMP( NE ' ' )
     A            PYST                      COMP( NE '  ' )
     A            LVL1                      COMP( EQ 'Y' )
     A            LVL2                      COMP( EQ 'Y' )
     A            PYTP                      COMP( EQ 'OP' )
