      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas GL Netting Groups set-up utility')
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  DSPF/GL001243D1 - Netting Group Set-up Utility Screen        *
      *                                                               *
      *  (c) Finastra International Limited 2002                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. BUG2407            Date 11May04               *
      *                 CGL029             Date 01Sep03               *
      *                 CGL018 *CREATE     Date 28Sep02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  BUG2407 - Webfacing changes.                                 *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CGL018 - Risk Weighted Assets                                *
      *                                                               *
      *****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/MFRFL)
     A                                      CA03
     A  21                                  CA10
     A  21                                  CA12
     A  22                                  CA14
     A                                      INDARA
     A                                      PRINT(*LIBL/MPRINT)
     A                                      MSGLOC(24)
      *
     A          R GL001243F1                TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
      **Start of change BUG2407
     A                                      OVERLAY
      **End of change BUG2407
     A                                      PUTOVR
      *
     A            SUSER     R        O  1  2REFFLD(USER)
     A                                  1 13'GL001243D1'
     A                                  2 25'Netting Groups Set-up'
     A                                      DSPATR(UL HI)
     A                                  1 67'DATE '
     A            BJMRDT         7A  O  1 73
      *
     A            SWSID     R        O  2  2REFFLD(JOJOB)
     A                                  2 67'TIME '
     A                                  2 73TIME
      *
     A                                  3 10'Account'
     A                                  4 11'Code'
      **Start of Change CGL029
     A**********  #1AC01         4A  B  5 10                                                  CGL029
     A            #1AC01        10A  B  5 10
      **End of Change CGL029
     A N23                                  DSPATR(HI)
     A  23                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A N20                                  DSPATR(UL)
     A                                      OVRDTA
      **Start of Change CGL029
     A**********  #1AC02         4A  B  6 10                                                  CGL029
     A            #1AC02        10A  B  6 10
      **End of Change CGL029
     A N23                                  DSPATR(HI)
     A  23                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A N20                                  DSPATR(UL)
     A                                      OVRDTA
      **Start of Change CGL029
     A**********  #1AC03         4A  B  7 10                                                  CGL029
     A            #1AC03        10A  B  7 10
      **End of Change CGL029
     A N23                                  DSPATR(HI)
     A  23                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A N20                                  DSPATR(UL)
     A                                      OVRDTA
      **Start of Change CGL029
     A**********  #1AC04         4A  B  8 10                                                  CGL029
     A            #1AC04        10A  B  8 10
      **End of Change CGL029
     A N23                                  DSPATR(HI)
     A  23                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A N20                                  DSPATR(UL)
     A                                      OVRDTA
      **Start of Change CGL029
     A**********  #1AC05         4A  B  9 10                                                  CGL029
     A            #1AC05        10A  B  9 10
      **End of Change CGL029
     A N23                                  DSPATR(HI)
     A  23                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A N20                                  DSPATR(UL)
     A                                      OVRDTA
      **Start of Change CGL029
     A**********  #1AC06         4A  B 10 10                                                  CGL029
     A            #1AC06        10A  B 10 10
      **End of Change CGL029
     A N23                                  DSPATR(HI)
     A  23                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A N20                                  DSPATR(UL)
     A                                      OVRDTA
      **Start of Change CGL029
     A**********  #1AC07         4A  B 11 10                                                  CGL029
     A            #1AC07        10A  B 11 10
      **End of Change CGL029
     A N23                                  DSPATR(HI)
     A  23                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A N20                                  DSPATR(UL)
     A                                      OVRDTA
      **Start of Change CGL029
     A**********  #1AC08         4A  B 12 10                                                  CGL029
     A            #1AC08        10A  B 12 10
      **End of Change CGL029
     A N23                                  DSPATR(HI)
     A  23                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A N20                                  DSPATR(UL)
     A                                      OVRDTA
      **Start of Change CGL029
     A**********  #1AC09         4A  B 13 10                                                  CGL029
     A            #1AC09        10A  B 13 10
      **End of Change CGL029
     A N23                                  DSPATR(HI)
     A  23                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A N20                                  DSPATR(UL)
     A                                      OVRDTA
      **Start of Change CGL029
     A**********  #1AC10         4A  B 14 10                                                  CGL029
     A            #1AC10        10A  B 14 10
      **End of Change CGL029
     A N23                                  DSPATR(HI)
     A  23                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A N20                                  DSPATR(UL)
     A                                      OVRDTA
      **Start of Change CGL029
     A**********  #1AC11         4A  B 15 10                                                  CGL029
     A            #1AC11        10A  B 15 10
      **End of Change CGL029
     A N23                                  DSPATR(HI)
     A  23                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A N20                                  DSPATR(UL)
     A                                      OVRDTA
      **Start of Change CGL029
     A**********  #1AC12         4A  B 16 10                                                  CGL029
     A            #1AC12        10A  B 16 10
      **End of Change CGL029
     A N23                                  DSPATR(HI)
     A  23                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A N20                                  DSPATR(UL)
     A                                      OVRDTA
      **Start of Change CGL029
     A**********  #1AC13         4A  B 17 10                                                  CGL029
     A            #1AC13        10A  B 17 10
      **End of Change CGL029
     A N23                                  DSPATR(HI)
     A  23                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A N20                                  DSPATR(UL)
     A                                      OVRDTA
      **Start of Change CGL029
     A**********  #1AC14         4A  B 18 10                                                  CGL029
     A            #1AC14        10A  B 18 10
      **End of Change CGL029
     A N23                                  DSPATR(HI)
     A  23                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A N20                                  DSPATR(UL)
     A                                      OVRDTA
      **Start of Change CGL029
     A**********  #1AC15         4A  B 19 10                                                  CGL029
     A            #1AC15        10A  B 19 10
      **End of Change CGL029
     A N23                                  DSPATR(HI)
     A  23                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A N20                                  DSPATR(UL)
     A                                      OVRDTA
      **Start of Change CGL029
     A**********  #1AC16         4A  B 20 10                                                  CGL029
     A            #1AC16        10A  B 20 10
      **End of Change CGL029
     A N23                                  DSPATR(HI)
     A  23                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A N20                                  DSPATR(UL)
     A                                      OVRDTA
      **Start of Change CGL029
     A**********  #1AC17         4A  B 21 10                                                  CGL029
     A            #1AC17        10A  B 21 10
      **End of Change CGL029
     A N23                                  DSPATR(HI)
     A  23                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A N20                                  DSPATR(UL)
     A                                      CHECK(FE)
     A                                      OVRDTA
      *
     A                                 23  3'F3=Main Menu ENTER=Validate'
     A*=========================================================================
     A          R #MSGRCD                   TEXT('Program messages')
     A                                      SFL SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            ##PGM                     SFLPGMQ
     A*=========================================================================
     A          R #MSGCTL                   TEXT('Program messages')
     A                                      SFLCTL(#MSGRCD)
     A                                      SFLPAG(01) SFLSIZ(03)
     A                                      OVERLAY PUTOVR
     A                                      SFLINZ SFLDSP SFLDSPCTL
     A  40
     AON40                                  SFLEND
     A            ##PGM                     SFLPGMQ
