000100220120      ****************************************************************
000101220120/*STD *  DSPFBASE                                                    *
000102220120/*EXI *  TEXT('Midas Events by Currency Reporting Prompt')           *
000103220120      ****************************************************************
000104220120      *                                                              *
000105220120      *  Midas General Ledger Module                                 *
000106220120      *                                                              *
000107220120      *  GLC0804DF - Events by Currency Reporting Prompt             *
000108220120      *                                                              *
000109220120      *   (c) Finastra International Limited 2021                    *
000110220120      *                                                              *
000111220120      *  Last Amend No. CGL091 *CREATE     Date 02Nov21              *
000112220120      *                                                              *
000113220120      ****************************************************************
000114220120      *                                                              *
000115220120      *  CGL091 - Events by Currency with Running Totals Report      *
000116220120      *                                                              *
000117220120      ****************************************************************
000118220120     A                                      DSPSIZ(24 80 *DS3)
000119220120     A                                      CHGINPDFT
000120220120     A                                      PRINT(*LIBL/MPRINT)
000121220120     A                                      CF03(01)
000122220120     A                                      CF12(02)
000123220120     A  03                                  CF10(04)
000124220120     A          R GLC804
000125220120     A                                      TEXT('(c) Finastra International +
000126220120     A                                      Limited 2021')
000127220120     A            SUSER         10A  O  1  2TEXT('User ID')
000128220120     A                                  1 13'GLC0804DF'
000129220120     A                                  1 23'Events by Currency Reporting +
000130220120     A                                       Prompt'
000131220120     A                                      DSPATR(HI)
000132220120     A                                      DSPATR(UL)
000133220120     A            SRUNA          7A  O  1 72
000134220120     A            SWSID         10A  O  2  2
000135220120     A                                  2 71TIME
000136220120     A                                  6  8'No. of days forward for Events +
000137220120     A                                      by Currency'
000138220120     A            DAYS           3D  B    +3DSPATR(UL)
000139220120     A  03
000140220120     AO 05                                  DSPATR(PR)
000141220120     A                                      CHECK(ME MF)
000142220120     A                                 23  2'F3=Exit  F12=Previous screen'
000143220120     A  03                             23 32'F10=Delete'
