      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas GP Repair Queue Housekeeping Report')
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  PRTF/GP000109P1 - Midas GP Repair Queue Housekeeping Report  *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2010            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      *  Last Amend No. CAP204  *CREATE    Date 15Mar10               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CAP204 - Teller Related APIs - Account Transfer              *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
      *--------------------------------*
      ***  Report Header Record Format *
      *--------------------------------*
      *
     A          R HEADP1
     A                                      TEXT('(c) Misys International Banki-
     A                                      ng Systems Ltd. 2010')
      *
     A                                      SKIPB(003)
     A                                     6
     A                                      'REFERENCE GP000109P1'
     A            BJURPT    R             37
     A                                      REFFLD(URPT)
     A                                   101
     A                                      'DATE'
     A            BJMRDT    R            106
     A                                      REFFLD(MRDT)
     A                                   119
     A                                      'PAGE'
     A                                   124
     A                                      PAGNBR
     A                                      EDTCDE(Z)
      *
     A                                   101
     A                                      'TIME'
     A                                      SPACEB(001)
     A                                   106
     A                                      TIME
     A                                      EDTWRD('  :  :  ')
      *
     A                                    50
     A                                      'REPAIR QUEUE PURGED REPORT'
     A                                      SPACEB(001)
     A                                    50
     A                                      '--------------------------'
     A                                      SPACEB(001)
     A                                     2
     A                                      'Repair Queue ID'
     A                                      SPACEB(002)
     A                                    21
     A                                      'Repair Queue Action'
     A                                    42
     A                                      'API Name'
     A                                    55
     A                                      'Repair Queue Status'
     A                                    76
     A                                      'Authorisation Level'
     A                                   100
     A                                      'Input User'
     A          R DETAIL
     A                                      SPACEB(001)
     A            RSWID         15A        2
     A            RSWACT        15A  O    21
     A            RSWAPI        10A       42
     A            RSWSTAT       10A  O    55
     A            RSWAUTHLVL    10A       76
     A            RSWINPUSER    10A  O   100
      *
      *-------------------*
      ***  Report Trailer *
      *-------------------*
      *
     A          R TRAILP1
     A                                    51
     A                                      '***  END OF REPORT ***'
     A                                      SPACEB(003)
