     A****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas ER Country Codes - Download     Physical')
      *****************************************************************
     A*                                                              *
     A*                                                              *
     A*   MIDAS/ABS - EUROPEAN REPORTING                             *
     A*                                                              *
     A*   ERCTRYPD  -  ER Country Codes                              *
     A*                                                              *
      *  (c) Finastra International Limited 2005                      *
     A*                                                              *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CER001  *CREATE    Date 25Apr05               *
      *                                    Date 00Xxx00               *
     A*                                                              *
     A*--------------------------------------------------------------*
     A*                                                              *
      *  MD046248 - Finastra Rebranding                               *
      *  CER001 - LUX Upgrade to MidasPlus                            *
     A*                                                              *
     A*****************************************************************
     A          R ERCTRYD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2005')
     A*
     A            VQCNCD         2          TEXT('Country Code')
     A                                      COLHDG('Country' 'Code')
     A            VQCNNM        30          TEXT('Country Name')
     A                                      COLHDG('Country Name')
     A            VQISOC         2          TEXT('ISO Country Code')
     A                                      COLHDG('ISO Country' 'Code')
     A            VQLCD          5  0       TEXT('Last Change Date')
     A                                      COLHDG('Last' 'Change' 'Date')
     A            VQTYLC         1          TEXT('Type of Last Change')
     A                                      COLHDG('Type of' 'Last Change')
