      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas ER LE LOAN EVENTS EXTRACT TRAILER')
     A******************************************************************
     A*                                                                *
     A*            MIDAS/ABS CUSTOMER LENDING MODULE                   *
     A*                                                                *
     A*   PF/ERLVENZZ   LOAN EVENTS EXTRACT-TRAILER RECORD             *
     A*                                                                *
      *  (c) Finastra International Limited 2005                      *
     A*                                                                *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CER001             Date 25Apr05               *
      *                 ERL416 PT          Date 25Jul94               *
     A*                                                                *
     A******************************************************************
     A*                                                                *
      *  MD046248 - Finastra Rebranding                               *
      *  CER001 - LUX Upgrade to MidasPlus                            *
     A*   ERL416 - REPAYMENTS MANAGEMENT FOR ER                        *
     A*                                                                *
     A******************************************************************
     A          R LVENTZZF                  FORMAT(LVENTZZ)
