      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas FC Periodic Rpt Reqs by User for Output')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Report Control Facility Module
     A*                                                               *
     A*  LF/FCPREQL5 - PERIODIC REPORT REQUESTS BY USER FOR OUTPUT    *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. E60733             DATE 26OCT93               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  E60733 - Deletion of user causes DB error in COB             *
     A*                                                               *
     A*****************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A          R FCPREQD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                      PFILE(FCPREQPD)
     A*
     A** Key fields
     A*
     A          K D9USRO
