      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_RB                                                        *
/*EXI *  TEXT('Midas FC Rpt Requests Close of Business Rpt')
     A**************************************************************
     A*                                                            *
     A*  Midas - Report Control Facility Module
     A*                                                            *
     A*   LF/FCRREQL4 - CLOSE OF BUSINESS REPORTS                  *
     A*                                                            *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                            *
     A*                                                            *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*     LAST AMEND NO.  LN0409            DATE   21/06/90      *
     A*     PREV AMEND NO.  0                 DATE   00/00/00      *
     A*                                                            *
     A**************************************************************
     A*                                                            *
     A*     LN0409 - CHANGE ACCESS PATH MAINTENANCE PARAMETER      *
     A*              FROM *IMMED TO *REBLD                         *
     A**************************************************************
     /*T: Report Requests           Close of Business Report
      *
     H* Generated by  : Synon/2  Version:  8646
     H* Company    : Report Control Facility Model
     H* System     : Report Control Facility Model
     H* User name  : F6875SY
     H* Date       : 02/02/90 time: 16:19:31
      *  (c) Misys International Banking Systems Ltd. 2001            *
     H*
     A*=====================================================================
     M* Maintenance   : *NONE
     A*=====================================================================
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A********************************************************************
     A                                      DYNSLT
     A*=====================================================================
     A          R @RREQAG                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                      PFILE(FCRREQPD)
     A*---------------------------------------------------------------------
     A            D5RNAM                    TEXT('Report name')
     A            D5RQSQ                    TEXT('Sequence Number')
     A            D5SOID                    TEXT('Instruction Identifier')
     A            D5LVL                     TEXT('Level')
     A            D5ETTY                    TEXT('Entity')
     A            D5IPCY                    TEXT('Input Cycle')
     A            D5PDFL                    TEXT('Periodic')
     A            D5DLS1                    TEXT('Distribution List part 1')
     A            D5DLS2                    TEXT('Distribution List part 2')
     A            D5USRO                    TEXT('User ID For Output')
     A            D5ARMF                    TEXT('Archived On Microfiche')
     A            D5AROD                    TEXT('Archived On Optical Disk')
     A            D5DRQD                    TEXT('Distribution Required')
     A            D5USRR                    TEXT('User ID For Request')
     A            D5DBRN                    TEXT('User''s Branch')
     A            D5RQTM                    TEXT('Request Time')
     A            D5COBR                    TEXT('Close Of Business')
     A            D5JBNM                    TEXT('Job Name')
     A            D5JUSR                    TEXT('User Name')
     A            D5JBNB                    TEXT('Job Number')
     A            D5PSQR                    TEXT('Periodic Sequence no')
     A            D5COTT                    TEXT('Component Name')
     A            D5CSEQ                    TEXT('Component Sequence Number')
     A            D5TNLU                    TEXT('Transaction No. Last Upd')
     A*.....................................................................
     A* Key fields
     A          K D5RNAM
     A          K D5COTT
     A          K D5CSEQ
     A*.....................................................................
     A* Select: Close of Business
     A*          Fld/Cond: Close Of Business         Yes
     A          S D5COBR                    COMP(EQ 'Y')
     A*.....................................................................
     A* Select: periodic
     A*          Fld/Cond: Periodic                  Yes
     A          S D5PDFL                    COMP(EQ 'Y')
     A*=====================================================================
