      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas FC Yesterdays file no. update index')
      *****************************************************************
      *                                                               *
      *  Midas - Report Control Facility Module                       *
      *                                                               *
      *  LF/FCYFNOL0 - Midas FC Yesterdays file No. Update            *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.03 -----------------------------------------------*
      *  Last Amend No. 142799             Date 14Feb99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. nnnnnn  *CREATE    Date ddmmmyy               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  142799 - Some reports were not distributed by RCF.           *
      *         - Add ELSFNO as one of the key field.                 *
      *  nnnnnn - (change description)                                *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A*=====================================================================
     A          R @ELREKI                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                      PFILE(FCYFNOPD)
     A*---------------------------------------------------------------------
     A            ELRQSQ                    TEXT('Sequence Number')
     A            ELRSFX                    TEXT('Print File Name')
     A            ELXETY                    TEXT('Entity of Spool File')
     A            ELAURP                    TEXT('Audit Report Flag')
     A            ELSFNO                    TEXT('Spool File Number')
     A            ELPSTS                    TEXT('Status')
     A*.....................................................................
     A* Key fields
     A          K ELRQSQ
     A          K ELRSFX
     A          K ELXETY
      *                                              Begin /142799/
     A          K ELSFNO
      *                                              End   /142799/
     A*=====================================================================
