      *****************************************************************
/*STD *  PRTFP1                                                       *
/*EXI *  TEXT('Midas ER Print Production Extract Audit Report')
     A*****************************************************************
     A*                                                               *
     A*    ERLU87P1 - PRODUCTION EXTRACT AUDIT REPORT                 *
     A*                                                               *
      *  (c) Finastra International Limited 2005                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CER001             Date 25Apr05               *
      *                 ULX004             Date 26Mar97               *
      *                 ERL425 PT          Date 25Aug94               *
     A*                     71013  DDJ    DATE    20MAI94             *
     A*                     ERL349 TLI    DATE    02JUN93             *
     A*                     ER0336 TLI    DATE    16APR93             *
     A*                     ERL303 TLI    DATE    21JAN93             *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CER001 - LUX Upgrade to MidasPlus                            *
     A*   ULX004 - CAPITAL ADEQUACY                                   *
     A*   ERL425 - PRINT GUARANTOR DETAILS INSTEAD OF COUNTERPARTY    *
     A*   71013  - ADD IML RUBRIQUE NAME                              *
     A*   ERL349 - Change Country by Country of Citizenship           *
     A*   ER0336 - IML 2.3 DEVELOPMENT - Add total by Guarantee type  *
     A*   ERL303 - New layout - Only Guaranties                       *
     A*                                                               *
     A*****************************************************************
     A*
     A          R ERLU87H1                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2005')
     A                                      SKIPB(003)
     A                                     2'Reference  ERLU87'
     A            BJURPT        53   O    37
     A                                   101'Date'
     A            BJMRDT         7   O   107
     A                                   119'Page'
     A                                   125PAGNBR
     A                                      EDTCDE(Z)
     A                                    35'LUXEMBOURG'
     A                                      SPACEB(002)
     A                                    46'EUROPEAN REPORTING PRODUC'
     A                                    71'TION EXTRACT - AUDIT REPORT'
     A                                    35'-----------'
     A                                      SPACEB(001)
     A                                    46'-------------------------'
     A                                    71'---------------------------'
     A*%%***********************************************************************
     A          R ERLU87H2
     A                                      SPACEB(001)
     A                                     2'Rubric number for IML:'
     A            EXSCHA         8  0O    30
     A*** 71013 BEGIN ***
     A            IMLNAR        60A       43
     A************************************82'Record Type:'
     A************EXRECT*********3**0O***100EDTWRD('  0')
     A                                   104'Record Type:'
     A            EXRECT         3  0O   114EDTWRD('  0')
     A*** 71013 END ***
     A*%%***********************************************************************
     A          R ERLU87H3
     A                                      SPACEB(002)
      **Start of change CER001
     A**********                           2'Lot Rec      Brcd Transaction'                   CER001
     A**********                          36'Decision Ccy Ctry Customer'                      CER001
     A**********                          66'Amount in         Amount in'                     CER001
     A**********                          97'D/C  Start    End    Revision'                   CER001
     A**********                         128'Rec'                                             CER001
     A**********                           6'Iden     Code Reference        '                 CER001
     A                                     2'Lot Rec  Brcd Transaction'
     A                                    37'Decision       Ccy Cty Cust'
     A                                    67'Amount in            Amount in'
     A                                   103'D/C Start   End      Rev'
     A                                   131'Rec'
     A                                     6'Iden Cde  Reference'
      **End of change CER001
     A                                      SPACEB(001)
      **Start of change CER001
     A**********                          36'Key          Code Number'                        CER001
     A**********                          66'Currency       Report Currency'                  CER001
     A**********                         102'Date     Date   Date      Seq'                   CER001
     A                                    36'Key                Cde   No.'
     A                                    67'Currency           Report Currency'
     A                                   107'Date    Date     Date'
     A                                   131'Seq'
      **End of change CER001
     A                                     6'                               '
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A          R ERLU87D1
     A                                      SPACEB(001)
     A            EXLOTD         3A  O     2
     A            EXRIND         4A  O     6
      **Start of change CER001
     A**********  EXBRCD         3A  O    15                                                  CER001
     A**********  EXTREF        15A  O    20                                                  CER001
     A**********  EXDECK         8A  O    36                                                  CER001
     A**********  EXCCYL         3A  O    45                                                  CER001
     A            EXBRCD         3A  O    11
     A            EXTREF        21A  O    15
     A            EXDECK        14A  O    37
     A            EXCCYL         3A  O    52
      **End of change CER001
     A*** ERL349 BEGIN ***
     A************EXCUCL         3A  O    50
     A** ERL425 START
     A************EXCNCZ         2A  O    50
     A*- ULX004 START --------------------------------------------------- ULX004
     A**********  EXGUCL         3A  O    50
      **Start of change CER001
     A**********  EXCUCL         3A  O    50                                                  CER001
     A            EXCUCL         3A  O    56
      **End of change CER001
     A*- ULX004 END ----------------------------------------------------- ULX004
     A*** ERL349 END ***
     A** ERL425 START
     A************EXCUST         6A  O    54
     A*- ULX004 START --------------------------------------------------- ULX004
     A**********  EXGUCN         6A  O    54
      **Start of change CER001
     A**********  EXCUST         6A  O    54                                                  CER001
     A            EXCUST         6A  O    60
      **End of change CER001
     A*- ULX004 END ----------------------------------------------------- ULX004
     A** ERL425 END
      **Start of change CER001
     A**********  P1AMNT        16  3O    62EDTWRD('           0 .   ')                       CER001
     A**********  P1LAMT        16  3O    80EDTWRD('           0 .   ')                       CER001
     A**********  P1DRCR         1A  O    98                                                  CER001
     A**********  P1STRD         8A  O   100                                                  CER001
     A**********  P1ENDD         8A  O   109                                                  CER001
     A**********  P1REVD         8A  O   118                                                  CER001
     A**********  EXSEQN         6  0O   127EDTWRD('     0')                                  CER001
     A            P1AMNT        16  3O    67EDTWRD('           0 .   ')
     A            P1LAMT        16  3O    85EDTWRD('           0 .   ')
     A            P1DRCR         1A  O   103
     A            P1STRD         8A  O   105
     A            P1ENDD         8A  O   114
     A            P1REVD         8A  O   123
     A            EXSEQN         6  0O   131EDTWRD('     0')
      **End of change CER001
     A*%%***********************************************************************
     A          R ERLU87D2
     A                                      SPACEB(001)
      **Start of change CER001                                                                CER001
     A**********                          80'================='
     A                                    85'================='
      **End of change CER001
     A                                     2'Rec Typ:'
     A                                      SPACEB(001)
     A            BKRECT         3  0O    11EDTWRD('  0')
     A                                    17'Total for Rubric IML'
     A            BKSCHA         8  0O    43
     A                                    51':'
      **Start of change CER001
     A**********  P1TOT2        16  3O    80EDTWRD('           0 .   ')                       CER001
     A**********  P2DRCR         1A  O    98                                                  CER001
     A            P1TOT2        16  3O    85EDTWRD('           0 .   ')
     A            P2DRCR         1A  O   103
      **End of change CER001
     A** ER0336 BEGIN *********************
     A          R ERLU87D3
     A                                      SPACEB(001)
      **Start of change CER001
     A**********                          80'================='                               CER001
     A                                    85'================='
      **End of change CER001
     A                                    17'Total for Guarantee'
     A                                      SPACEB(001)
     A            BKGUAT         1A  O    40
     A                                    51':'
      **Start of change CER001
     A**********  P1TOT1        16  3O    80EDTWRD('           0 .   ')                       CER001
     A**********  P3DRCR         1A  O    98                                                  CER001
     A            P1TOT1        16  3O    85EDTWRD('           0 .   ')
     A            P3DRCR         1A  O   103
      **End of change CER001
     A** ER0336 END ***********************
     A*%%***********************************************************************
     A          R ERLU87E1
     A                                      SPACEB(004)
     A                                    52'***  NO DETAILS TO REPORT  ***'
     A*%%***********************************************************************
     A          R ERLU87E2
     A                                      SPACEB(004)
     A                                    55'***  END OF REPORT  ***'
     A*%%***********************************************************************
