0001 H        1
0002 F****************************************************************
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas DL Exposure by customer')                        *
/*OVRF*: OVRDBF FILE(EVLP) TOFILE(EVLPCB)                           : *
/*OVRF*: OVRDBF FILE(EVLN) TOFILE(EVLNCB)                           : *
/*OVRF*: OVRDBF FILE(FXNEVTP) TOFILE(FXNEVTL5)                      : *   CDL002
/*OVRF*: OVRDBF FILE(FXNEVTN) TOFILE(FXNEVTL6)                      : *   CDL002
0002 F****************************************************************
0004 F*                                                              *
     F*  Midas - Dealing Module
0004 F*                                                              *
     F***DL0762*-*CUSTOMER EXPOSURE AGAINST LIMITS-BY CUSTOMER       *
     F*  DL0762A- CUSTOMER EXPOSURE AGAINST LIMITS-BY CUSTOMER       *
0005 F*           CALLED BY DLC806OA OR DLC806BA ACCORDING TO MENU   *
0005 F*           SELECTION OF ORIGINATING BRANCH OR BOOKING BRANCH; *
0005 F*           PROMPT PROGRAM USED IS DL0806A WITH DSPF DL806AFM. *
0006 F*                                                              *
      *  (c) Misys International Banking Systems Ltd. 2001            *
0008 F*                                                              *
      *  Last Amend No. CDL099             Date 06Oct17               *
      *  Prev Amend No. CDL096             Date 22Sep14               *
      *                 CDL094             Date 11Jun14               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CDL049             Date 05Jul06               *
      *                 CSD031             Date 10Apr06               *
      *                 CDL028             Date 07Feb05               *
     F*                 BUG8901            DATE 11OCT05               *
      *                 CSD027             Date 09Dec05               *
      *                 BUG10711           Date 27Feb06               *
      *                 CDL038             Date 10May05               *
      *                 CLE025             Date 20Oct03               *
      *                 CGL029             Date 01Sep03               *
      *                 222373             Date 03Nov03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      * Midas DBA 3.01 -----------------------------------------------*
      *                 CDL006             Date 26Apr99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 126977             Date 10Dec97               *
      *                 CDL002             Date 16Sep97              *
     F*                 099251             DATE 24FEB97              *
     F*                 S01408             DATE 07NOV95               *
     F*                 S01498             DATE 10AUG94              *
     F*                 067533             DATE 11MAR94               *
     F*                 062422             DATE 08NOV93              *
     F*                 062164             DATE 08NOV93              *
     F*                 S01433             DATE 11OCT93              *
     F*                 S01393             DATE 30OCT92              *
     F*                 E38323             DATE 29JUL92              *
     F*                 LN0746             DATE 17SEP90              *
     F*                  LN0632             DATE  15AUG90            *
     F*                  LN0226             DATE  05JUN90            *
     F*                  E309               DATE  10APR90            *
0008 F*                  E305               DATE  06APR90            *
0008 F*                  E257               DATE   9MAR90            *
     F*                  S01157             DATE  15MAR90            *    S01157
0008 F*                  E150               DATE   5DEC89            *     E150
0008 F*                  E00099             DATE  24NOV89            *
0008 F*                  E00013             DATE  20NOV89            *
0010 F*                                                              *
     F*****************************************************************
     F*  ANY CHANGES MADE TO THIS PROGRAM SHOULD ALSO BE MADE TO      *
     F*                    DL0762                                     *
     F*****************************************************************
     F*                                                               *
      *  CDL099 - Split Value Date (Recompile)                        *
      *  CDL096 - Business Day Conventions on MM Deals                *
      *           (Recompile)                                         *
      *  CDL094 - Enhance  Receive Settlement Instructions            *
      *           (Recompiled)                                        *
      *  CDL049 - Addition of a Reference Rate field (recompile)      *
      *  CSD031 - Enhanced Centralised Static Data (Recompile)        *
      *  CDL028 - Automatic Rate Interpolations (Recompile)           *
     F*  BUG8901- FX Spot Limits should be calculated and displayed   *
     F*           on the report in the same way as FX Forward Limits. *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  BUG10711 - Attempted to CHAIN on file DEALS while the file   *
      *             was closed (Applied fix 218389)                   *
      *  CDL038 - Extended Deal Sub Type (Recompile)                  *
      *  CLE025 - Credit Lines (Recompile)                            *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  222373 - Correct parameters on program calls                 *
      *  CDL006 - Dealing Fiduciary                                   *
     F*  126977 - Prevent looping if only one Net Event               *
     F*  CDL002 - FX Netting. Exclude netted FX deal events and       *
     F*           include FX net events.                              *
     F*  099251 - Different exposure amount shown on the report       *
     F*           and on exception report.                            *
     F*  S01408 - Core hook added : DL0762ACP1                        *
     F*           Core hook added : DL0762ACP2                        *
     F*  S01498 - Portfolio Lending Upgrade to Release 10.            *
     F*           Ensure LB clients are printed when Portfolio        *
     F*           Lending is on and LB Clients are to be reported.    *
     F*  067533 - Set up Overflow Line correctly in the Print File    *
     F*           definition instead of amending it in the RPG code.  *
     F*  062422 - PAR Indicator appearing on the reoprt when not a    *
     F*           parent.                                             *
     F*  062164 - Wrong indicators used to check for spot.            *
     F*  S01433 - Enhanced processing to include precious metals      *
     F*           and money market deals on the report                *
     F*           (NB. This function is to remain switchable until    *
     F*           after Alpha-site testing, when it will become       *
     F*           mandatory. At this point DL0762A  will be           *
     F*           renamed to DL0762 and the old version discarded.    *
     F*           Meanwhile version with SAR = DL0762A, without =     *
     F*           DL0762).                                            *
     F*  S01393 - RECOMPILED FOR STRATEGIC RISK MANAGEMENT            *
     F*  E38323 - Recompilation of the program done due to a          *
     F*           change in subroutine ZFWDT                          *
     F*  LN0746 - P1 & AU FILES CHANGED TO SAME NAME AS PROGRAM       *
     F*           DUMMY FILES CREATED                                 *
     F*  LN0632 - EXPOSURE AND LIMITS NOT CALCULATED                  *
     F*           PROPERLY FOR FRA/IRS                                *
     F*  LN0226 - INCORPORATE FURTHER CHANGES MADE FOR                *
     F*           R10 - FRA/IRS.  S01117, S01194, S01157 ETC.         *
     F*  E309   - ASSUMES LAST LIMIT PERIOD IS 999 OR BLANK           *
     F*           ACTUALLY IF LEFT BLANK WILL DEFAULT TO 000          *
     F*  E305   - WHEN NO DETAILS, AU SHOULD SPECIFY LEVEL            *
     F*           AND ORIG/BOOKING BRANCH                             *
     F*  E257   - INCORRECT AU AND P1 FILES SPECIFIED FOR RCF         *
     F*  S01157 - FRA/IRS  INCORPORATION                              *
     F*  E150   - NO HEADINGS PRODUCED ON FIRST PAGE                  *
     F*  E00099 - 'NO DETAILS' MSG INCORRECTLY POSITIONED IN          *
     F*           AUDIT REPORT                                        *
     F*  E00013 - CORRECT PROGRAM TO NOT TO PRODUCE A P1 IF           *
     F*           THERE ARE NO DETAILS FOR THAT PARTICULAR            *
     F*           CUSTOMER OR PARENT                                  *
     F*                                                              *
     F****************************************************************
     F*
     F*  PRODUCTION OPTIONS USING THIS RPG:
     F*    P.O:                               FILE OVERRIDES:
     F*    1. VS SYSTEM LIMITS,               EVLNCB,PCB OR NCO,PCO
     F*    2. VS ALL      "     ALL CUSTS              "
     F*    3. VS ALL      "     ONE CUSTS              "
     F*    4. VS PARENT + CHILDREN                     "
     F*
     F*    -- WITH 'O' = USING TRANS. ORIGINATING BRANCH
     F*            'B' =  "     "     BOOKING BRANCH
     F*    -- FOR 'ONE BR','ONE CO' OPTIONS, FILE OVERRIDE TO THIS
     F*       BR OR CO IS DONE IN COMPONENT CL PGM
     F*       (DLC806OA OR DLC806BA DEPENDING ON ORIG. OR BOOK. BRANCH)
     F*    -- REPORT VS SYSTEM LIMITS IS NOT DEPENDENT ON BOOKING OR      LN0632
     F*       ORIG BRANCH                                                 LN0632
     F*
0011 F********************************************************************
0012 FEVLP    IP  E           K        DISK
0012 FEVLN    IS  E           K        DISK
      *                                                                   CDL002
     FFXNEVTP IF  E           K        DISK                           UC  CDL002
     F            FXNEVTD0                          KRENAMEFXNEVTP0       CDL002
     FFXNEVTN IF  E           K        DISK                           UC  CDL002
     F            FXNEVTD0                          KRENAMEFXNEVTN0       CDL002
      *                                                                   CDL002
      * Deals                                                             CDL002
     FDEALS   IF  E           K        DISK                           UC  CDL002
     F            DEALSDAF                          KIGNORE               CDL002
     F/COPY WNCPYSRC,DL0762AF02
     F*********** DEALSDCF                          KIGNORE        CDL002 CDL006
     F            DEALSDDF                          KIGNORE               CDL002
     F            DEALSDEF                          KIGNORE               CDL002
     F            DEALSDFF                          KIGNORE               CDL002
     F            DEALSDGF                          KIGNORE               CDL002
     F/COPY WNCPYSRC,DL0762AF03
      *                                                                   CDL002
     F**DL0762AUO***F     132     OA     PRINTER      KINFDS SPOOLU       E257
     F**DL0762P1O***F     132     OF    LPRINTER      KINFDS SPOOL1       E257
     F**DL0761AUO***F     132     OA     PRINTER      KINFDS SPOOLU  E257 LN0746
     F**DL0761P1O***F     132     OF    LPRINTER      KINFDS SPOOL1  E257 LN0746
     FDL0762AUO   F     132     OA     PRINTER      KINFDS SPOOLU         LN0746
     F***DL0762P1O** F     132     OF    LPRINTER     KINFDS SPOOL1LN0746 067533
     FDL0762P1O   F     132     OF     PRINTER      KINFDS SPOOL1         067533
     F/COPY WNCPYSRC,DL0762AF01
     F* 01,46             PARENT EVENT
     F* 02,47             NON-PARENT EVENT
     F* 30                FRA/IRS MODULE PRESENT IND.                     S01157
     F**40****************1ST PAGE OF DL0762P1                       E150 E257
     F**40****************1ST PAGE OF DL0761P1                       E257 LN0746
     F* 40                1ST PAGE OF DL0762P1                            LN0746
     F* 41                NO DETAILS
     F* 42                1ST CYCLE DONE
     F* 43                PO = 1 - SYS LIMITS ONLY
     F* 44                PO = 2 - ALL LIMITS - ALL ENTITIES
     F* 45                PARENT ON EVENT IS 0
     F* 48                CHANGE OF CUSTOMER/PARENT
     F* 49                PO = 3 - ALL LIMITS ONE ENTITY OR PO = 4
     F* 50                PO = 4 - ALL LIMITS ONE PARENT
     F* 53                FX LIMIT END DATE NON ZERO
     F* 54                LN   "     "        "
     F* 60                ZERO EXPOSURE FOR CUSTOMER/ENTITY
     F* 70                EXPOSURE GTR THAN LIMIT(EXCEPTION REPORTS).
     F* 71                1ST PERIOD IS SPOT-SYS LIM-FX
     F* 72                     "        "           -LN
     F* 73                     "        "   -CO LIM -FX
     F* 74                     "        "           -LN
     F* 75                     "        "   -BR LIM -FX
     F* 76                     "        "           -LN
     F* 86 87 88 89       WORK INDS
     F*
     F* L1                BRANCH
     F* L2                COMPANY
     F* L3                CUSTOMER
     F*
     F* U1                FOR EXCEPTION REPORTS(SETON IN CALLING CL).
0295 E********************************************************************
     E                    CPY@    1   1 80
0015 E                    FCT     1   4  4 0
0016 E                    HCY        25  3
     E                    HDG     1   7 22
0071 E                    ZYDY    4   4  4 0             ZDATE1/2 SR.ARRAY
0072 E                    ZMDY   13  13  3 0             ZDATE1/2 SR.ARRAY
0073 E                    ZMNM   12  12  3               ZDATE2 SR. ARRAY
0295 E********************************************************************
     E**   SYSTEM LEVEL LIMITS
0019 E**   SIX  ARRAYS FOR FX LIMITS
0020 E                    XFDA        6  3 0             PERIOD END DAYS
0021 E                    XFDT        6  5 0             PERIOD END DATES
0022 E                    XFLM        6  9 0             PERIOD LIMIT AMT.
0023 E                    XFXP        6 13 0             PERIOD EXPOS AMT.
0024 E                    XFXS        6 10 0             PERIOD EXCES AMT.
0025 E                    XFPC        6  3 2             PERIOD PERCENTGE.
     E*****SIX ARRAYS FOR LOANS LIMITS.                                   S01433
     E********            XLDA        6  3 0             PERIOD END DAYS  S01433
     E********            XLDT        6  5 0             PERIOD END DATES S01433
     E********            XLLM        6  9 0             PERIOD LIMIT AMT.S01433
     E********            XLXP        6 13 0             PERIOD EXPOS AMT.S01433
     E********            XLXS        6 10 0             PERIOD EXCES AMT.S01433
     E********            XLPC        6  3 2             PERIOD PERCENTGE S01433
     E**   SIX ARRAYS FOR MONEY MARKET LIMITS.                            S01433
     E                    XMDA        6  3 0             PERIOD END DAYS  S01433
     E                    XMDT        6  5 0             PERIOD END DATES S01433
     E                    XMLM        6  9 0             PERIOD LIMIT AMT.S01433
     E                    XMXP        6 13 0             PERIOD EXPOS AMT.S01433
     E                    XMXS        6 10 0             PERIOD EXCES AMT.S01433
     E                    XMPC        6  3 2             PERIOD PERCENTGE S01433
     E**   SIX ARRAYS FOR PRECIOUS METAL LIMITS.                          S01433
     E                    XPDA        6  3 0             PERIOD END DAYS  S01433
     E                    XPDT        6  5 0             PERIOD END DATES S01433
     E                    XPLM        6  9 0             PERIOD LIMIT AMT.S01433
     E                    XPXP        6 13 0             PERIOD EXPOS AMT.S01433
     E                    XPXS        6 10 0             PERIOD EXCES AMT.S01433
     E                    XPPC        6  3 2             PERIOD PERCENTGE S01433
     E**   COMPANY LEVEL LIMITS
0019 E**   SIX  ARRAYS FOR FX LIMITS
0020 E                    CFDA        6  3 0             PERIOD END DAYS
0021 E                    CFDT        6  5 0             PERIOD END DATES
0022 E                    CFLM        6  9 0             PERIOD LIMIT AMT.
0023 E                    CFXP        6 13 0             PERIOD EXPOS AMT.
0024 E                    CFXS        6 10 0             PERIOD EXCES AMT.
0025 E                    CFPC        6  3 2             PERIOD PERCENTGE.
     E*****SIX ARRAYS FOR LOANS LIMITS.                                   S01433
     E********            CLDA        6  3 0             PERIOD END DAYS  S01433
     E********            CLDT        6  5 0             PERIOD END DATES S01433
     E********            CLLM        6  9 0             PERIOD LIMIT AMT.S01433
     E********            CLXP        6 13 0             PERIOD EXPOS AMT.S01433
     E********            CLXS        6 10 0             PERIOD EXCES AMT.S01433
     E********            CLPC        6  3 2             PERIOD PERCENTGE S01433
     E**   SIX ARRAYS FOR MONEY MARKET LIMITS.                            S01433
     E                    CMDA        6  3 0             PERIOD END DAYS  S01433
     E                    CMDT        6  5 0             PERIOD END DATES S01433
     E                    CMLM        6  9 0             PERIOD LIMIT AMT.S01433
     E                    CMXP        6 13 0             PERIOD EXPOS AMT.S01433
     E                    CMXS        6 10 0             PERIOD EXCES AMT.S01433
     E                    CMPC        6  3 2             PERIOD PERCENTGE S01433
     E**   SIX ARRAYS FOR PRECIOUS METAL LIMITS.                          S01433
     E                    CPDA        6  3 0             PERIOD END DAYS  S01433
     E                    CPDT        6  5 0             PERIOD END DATES S01433
     E                    CPLM        6  9 0             PERIOD LIMIT AMT.S01433
     E                    CPXP        6 13 0             PERIOD EXPOS AMT.S01433
     E                    CPXS        6 10 0             PERIOD EXCES AMT.S01433
     E                    CPPC        6  3 2             PERIOD PERCENTGE S01433
     E**   BRANCH LEVEL LIMITS
0019 E**   SIX  ARRAYS FOR FX LIMITS
0020 E                    BFDA        6  3 0             PERIOD END DAYS
0021 E                    BFDT        6  5 0             PERIOD END DATES
0022 E                    BFLM        6  9 0             PERIOD LIMIT AMT.
0023 E                    BFXP        6 13 0             PERIOD EXPOS AMT.
0024 E                    BFXS        6 10 0             PERIOD EXCES AMT.
0025 E                    BFPC        6  3 2             PERIOD PERCENTGE.
     E*****SIX ARRAYS FOR LOANS LIMITS.                                   S01433
     E********            BLDA        6  3 0             PERIOD END DAYS  S01433
     E********            BLDT        6  5 0             PERIOD END DATES S01433
     E********            BLLM        6  9 0             PERIOD LIMIT AMT.S01433
     E********            BLXP        6 13 0             PERIOD EXPOS AMT.S01433
     E********            BLXS        6 10 0             PERIOD EXCES AMT.S01433
     E********            BLPC        6  3 2             PERIOD PERCENTGE S01433
     E**   SIX ARRAYS FOR MONEY MARKET LIMITS.                            S01433
     E                    BMDA        6  3 0             PERIOD END DAYS  S01433
     E                    BMDT        6  5 0             PERIOD END DATES S01433
     E                    BMLM        6  9 0             PERIOD LIMIT AMT.S01433
     E                    BMXP        6 13 0             PERIOD EXPOS AMT.S01433
     E                    BMXS        6 10 0             PERIOD EXCES AMT.S01433
     E                    BMPC        6  3 2             PERIOD PERCENTGE S01433
     E**   SIX ARRAYS FOR PRECIOUS METAL LIMITS.                          S01433
     E                    BPDA        6  3 0             PERIOD END DAYS  S01433
     E                    BPDT        6  5 0             PERIOD END DATES S01433
     E                    BPLM        6  9 0             PERIOD LIMIT AMT.S01433
     E                    BPXP        6 13 0             PERIOD EXPOS AMT.S01433
     E                    BPXS        6 10 0             PERIOD EXCES AMT.S01433
     E                    BPPC        6  3 2             PERIOD PERCENTGE S01433
0295 E********************************************************************
     E**
     E**   SYSTEM LEVEL LIMITS
     E*****XFDA*&*XLDA DEFINED AS ALPHANUMERIC.                           S01433
     E**   XFDA & XMDA  XPDAA DEFINED AS ALPHANUMERIC.                    S01433
0036 E                    XFDAA       6  3                                S01433
     E********            XLDAA       6  3                                S01433
     E                    XMDAA       6  3                                S01433
     E                    XPDAA       6  3                                S01433
     E**
     E**   COMPANY LEVEL LIMITS
     E*****CFDA*&*CLDA DEFINED AS ALPHANUMERIC.                           S01433
     E**   CFDA & CMDA CPDA DEFINED AS ALPHANUMERIC.                      S01433
0036 E                    CFDAA       6  3
     E********            CLDAA       6  3                                S01433
     E                    CMDAA       6  3                                S01433
     E                    CPDAA       6  3                                S01433
     E**
     E**   BRANCH LEVEL LIMITS
     E*****BFDA*&*BLDA DEFINED AS ALPHANUMERIC.                           S01433
     E**   BFDA & BMDA BPDA DEFINED AS ALPHANUMERIC.                      S01433
0036 E                    BFDAA       6  3
     E********            BLDAA       6  3                                S01433
     E                    BMDAA       6  3                                S01433
     E                    BPDAA       6  3                                S01433
0719 E/COPY ZSRSRC,ZHOLE                                               ***
     E/COPY WNCPYSRC,DL0762AE01
      **  Arrays for Fiduciary Deposits                                   CDL006
      *                                                                   CDL006
     E                    SIDA        6  3 0             PERIOD END DAYS  CDL006
     E                    SIDT        6  5 0             PERIOD END DATES CDL006
     E                    SILM        6  9 0             PERIOD LIMIT AMT.CDL006
     E                    SIXP        6 13 0             PERIOD EXPOS AMT.CDL006
     E                    SIXS        6 10 0             PERIOD EXCES AMT.CDL006
     E                    SIPC        6  3 2             PERIOD PERCENTGE CDL006
      *                                                                   CDL006
     E                    BBDA        6  3 0             PERIOD END DAYS  CDL006
     E                    BBDT        6  5 0             PERIOD END DATES CDL006
     E                    BBLM        6  9 0             PERIOD LIMIT AMT.CDL006
     E                    BBXP        6 13 0             PERIOD EXPOS AMT.CDL006
     E                    BBXS        6 10 0             PERIOD EXCES AMT.CDL006
     E                    BBPC        6  3 2             PERIOD PERCENTGE CDL006
      *                                                                   CDL006
     E                    CCDA        6  3 0             PERIOD END DAYS  CDL006
     E                    CCDT        6  5 0             PERIOD END DATES CDL006
     E                    CCLM        6  9 0             PERIOD LIMIT AMT.CDL006
     E                    CCXP        6 13 0             PERIOD EXPOS AMT.CDL006
     E                    CCXS        6 10 0             PERIOD EXCES AMT.CDL006
     E                    CCPC        6  3 2             PERIOD PERCENTGE CDL006
      *                                                                   CDL006
     E                    SIDAA       6  3               PERIOD END DAYS  CDL006
     E                    BBDAA       6  3               PERIOD END DAYS  CDL006
     E                    CCDAA       6  3               PERIOD END DAYS  CDL006
0295 I********************************************************************
     L**DL0762P1*66FL*54OL                                                  E257
     L**DL0761P1*66FL*54OL                                           E257 LN0746
     L***DL0762P1 66FL 54OL                                        LN0746 067533
0040 IEVLPF       01
     I                                              PTNU  L3
     I                                              CO    L2
     I                                              BR    L1
0088 I*
0040 IEVLNF       02
     I                                              CUNR  L3
     I                                              CO    L2
     I                                              BR    L1
0088 I*
0088 I*
0295 I********************************************************************
0296 I**   SYSTEM LEVEL LIMITS
     I*****DATA*STRUCTURES TO LINK XFDAA & XLDAA & INPUT FIELDS           S01433
     I**   DATA STRUCTURES TO LINK XFDAA & XMDAA & XPDAA & INPUT FIELDS   S01433
0298 I            DS
0300 I                                        1  18 XFDAA
     I***********                             1   3 FLEP1S                CDL002
     I***********                             4   60FLEP2S                CDL002
     I***********                             7   90FLEP3S                CDL002
     I***********                            10  120FLEP4S                CDL002
     I***********                            13  150FLEP5S                CDL002
     I***********                            16  180FLEP6S                CDL002
     I                                        1   3 WFEP1S                CDL002
     I                                        4   60WFEP2S                CDL002
     I                                        7   90WFEP3S                CDL002
     I                                       10  120WFEP4S                CDL002
     I                                       13  150WFEP5S                CDL002
     I                                       16  180WFEP6S                CDL002
     I            DS                                                      S01433
     I********                                1  18 XLDAA                 S01433
     I********                                1   3 LLEP1S                S01433
     I********                                4   60LLEP2S                S01433
     I********                                7   90LLEP3S                S01433
     I********                               10  120LLEP4S                S01433
     I********                               13  150LLEP5S                S01433
     I********                               16  180LLEP6S                S01433
     I                                        1  18 XMDAA                 S01433
     I/COPY WNCPYSRC,DL0762AI01
     I                                        1  18 SIDAA                 CDL006
     I***********                             1   3 MLEP1S          S01433CDL002
     I***********                             4   60MLEP2S          S01433CDL002
     I***********                             7   90MLEP3S          S01433CDL002
     I***********                            10  120MLEP4S          S01433CDL002
     I***********                            13  150MLEP5S          S01433CDL002
     I***********                            16  180MLEP6S          S01433CDL002
     I                                        1   3 WMEP1S                CDL002
     I                                        4   60WMEP2S                CDL002
     I                                        7   90WMEP3S                CDL002
     I                                       10  120WMEP4S                CDL002
     I                                       13  150WMEP5S                CDL002
     I                                       16  180WMEP6S                CDL002
     I            DS                                                      S01433
     I                                        1  18 XPDAA                 S01433
     I***********                             1   3 PLEP1S          S01433CDL002
     I***********                             4   60PLEP2S          S01433CDL002
     I***********                             7   90PLEP3S          S01433CDL002
     I***********                            10  120PLEP4S          S01433CDL002
     I***********                            13  150PLEP5S          S01433CDL002
     I***********                            16  180PLEP6S          S01433CDL002
     I                                        1   3 WPEP1S                CDL002
     I                                        4   60WPEP2S                CDL002
     I                                        7   90WPEP3S                CDL002
     I                                       10  120WPEP4S                CDL002
     I                                       13  150WPEP5S                CDL002
     I                                       16  180WPEP6S                CDL002
0306 I            DS
0307 I                                        1  18 XFPC
     I                                        1  18 XFPCA
     I***********                             1   30FLPC1S                CDL002
     I***********                             4   60FLPC2S                CDL002
     I***********                             7   90FLPC3S                CDL002
     I***********                            10  120FLPC4S                CDL002
     I***********                            13  150FLPC5S                CDL002
     I***********                            16  180FLPC6S                CDL002
     I                                        1   30WFPC1S                CDL002
     I                                        4   60WFPC2S                CDL002
     I                                        7   90WFPC3S                CDL002
     I                                       10  120WFPC4S                CDL002
     I                                       13  150WFPC5S                CDL002
     I                                       16  180WFPC6S                CDL002
0309 I            DS
     I********                                1  18 XLPC                  S01433
     I********                                1  18 XLPCA                 S01433
     I********                                1   30LLPC1S                S01433
     I********                                4   60LLPC2S                S01433
     I********                                7   90LLPC3S                S01433
     I********                               10  120LLPC4S                S01433
     I********                               13  150LLPC5S                S01433
     I********                               16  180LLPC6S                S01433
     I                                        1  18 XMPC                  S01433
     I                                        1  18 XMPCA                 S01433
     I/COPY WNCPYSRC,DL0762AI02
     I                                        1  18 SIPC                  CDL006
     I                                        1  18 SIPCA                 CDL006
     I***********                             1   30MLPC1S          S01433CDL002
     I***********                             4   60MLPC2S          S01433CDL002
     I***********                             7   90MLPC3S          S01433CDL002
     I***********                            10  120MLPC4S          S01433CDL002
     I***********                            13  150MLPC5S          S01433CDL002
     I***********                            16  180MLPC6S          S01433CDL002
     I                                        1   30WMPC1S                CDL002
     I                                        4   60WMPC2S                CDL002
     I                                        7   90WMPC3S                CDL002
     I                                       10  120WMPC4S                CDL002
     I                                       13  150WMPC5S                CDL002
     I                                       16  180WMPC6S                CDL002
     I            DS                                                      S01433
     I                                        1  18 XPPC                  S01433
     I                                        1  18 XPPCA                 S01433
     I***********                             1   30PLPC1S          S01433CDL002
     I***********                             4   60PLPC2S          S01433CDL002
     I***********                             7   90PLPC3S          S01433CDL002
     I***********                            10  120PLPC4S          S01433CDL002
     I***********                            13  150PLPC5S          S01433CDL002
     I***********                            16  180PLPC6S          S01433CDL002
     I                                        1   30WPPC1S                CDL002
     I                                        4   60WPPC2S                CDL002
     I                                        7   90WPPC3S                CDL002
     I                                       10  120WPPC4S                CDL002
     I                                       13  150WPPC5S                CDL002
     I                                       16  180WPPC6S                CDL002
0295 I********************************************************************
0296 I**   COMPANY LEVEL LIMITS
     I*****DATA*STRUCTURES TO LINK CFDAA & CLDAA & INPUT FIELDS           S01433
     I**   DATA STRUCTURES TO LINK CFDAA & CMDAA & CPDAA & INPUT FIELDS   S01433
0298 I            DS
0300 I                                        1  18 CFDAA
     I***********                             1   3 FLEP1C                CDL002
     I***********                             4   60FLEP2C                CDL002
     I***********                             7   90FLEP3C                CDL002
     I***********                            10  120FLEP4C                CDL002
     I***********                            13  150FLEP5C                CDL002
     I***********                            16  180FLEP6C                CDL002
     I                                        1   3 WFEP1C                CDL002
     I                                        4   60WFEP2C                CDL002
     I                                        7   90WFEP3C                CDL002
     I                                       10  120WFEP4C                CDL002
     I                                       13  150WFEP5C                CDL002
     I                                       16  180WFEP6C                CDL002
0302 I            DS
     I********                                1  18 CLDAA                 S01433
     I********                                1   3 LLEP1C                S01433
     I********                                4   60LLEP2C                S01433
     I********                                7   90LLEP3C                S01433
     I********                               10  120LLEP4C                S01433
     I********                               13  150LLEP5C                S01433
     I********                               16  180LLEP6C                S01433
     I                                        1  18 CMDAA                 S01433
     I/COPY WNCPYSRC,DL0762AI03
     I                                        1  18 CCDAA                 CDL006
     I***********                             1   3 MLEP1C          S01433CDL002
     I***********                             4   60MLEP2C          S01433CDL002
     I***********                             7   90MLEP3C          S01433CDL002
     I***********                            10  120MLEP4C          S01433CDL002
     I***********                            13  150MLEP5C          S01433CDL002
     I***********                            16  180MLEP6C          S01433CDL002
     I                                        1   3 WMEP1C                CDL002
     I                                        4   60WMEP2C                CDL002
     I                                        7   90WMEP3C                CDL002
     I                                       10  120WMEP4C                CDL002
     I                                       13  150WMEP5C                CDL002
     I                                       16  180WMEP6C                CDL002
     I            DS                                                      S01433
     I                                        1  18 CPDAA                 S01433
     I***********                             1   3 PLEP1C          S01433CDL002
     I***********                             4   60PLEP2C          S01433CDL002
     I***********                             7   90PLEP3C          S01433CDL002
     I***********                            10  120PLEP4C          S01433CDL002
     I***********                            13  150PLEP5C          S01433CDL002
     I***********                            16  180PLEP6C          S01433CDL002
     I                                        1   3 WPEP1C                CDL002
     I                                        4   60WPEP2C                CDL002
     I                                        7   90WPEP3C                CDL002
     I                                       10  120WPEP4C                CDL002
     I                                       13  150WPEP5C                CDL002
     I                                       16  180WPEP6C                CDL002
0306 I            DS
0307 I                                        1  18 CFPC
     I                                        1  18 CFPCA
     I***********                             1   30FLPC1C                CDL002
     I***********                             4   60FLPC2C                CDL002
     I***********                             7   90FLPC3C                CDL002
     I***********                            10  120FLPC4C                CDL002
     I***********                            13  150FLPC5C                CDL002
     I***********                            16  180FLPC6C                CDL002
     I                                        1   30WFPC1C                CDL002
     I                                        4   60WFPC2C                CDL002
     I                                        7   90WFPC3C                CDL002
     I                                       10  120WFPC4C                CDL002
     I                                       13  150WFPC5C                CDL002
     I                                       16  180WFPC6C                CDL002
0309 I            DS
     I********                                1  18 CLPC                  S01433
     I********                                1  18 CLPCA                 S01433
     I********                                1   30LLPC1C                S01433
     I********                                4   60LLPC2C                S01433
     I********                                7   90LLPC3C                S01433
     I********                               10  120LLPC4C                S01433
     I********                               13  150LLPC5C                S01433
     I********                               16  180LLPC6C                S01433
     I*                                                                   S01433
     I                                        1  18 CMPC                  S01433
     I                                        1  18 CMPCA                 S01433
     I/COPY WNCPYSRC,DL0762AI04
     I                                        1  18 CCPC                  CDL006
     I                                        1  18 CCPCA                 CDL006
     I***********                             1   30MLPC1C          S01433CDL002
     I***********                             4   60MLPC2C          S01433CDL002
     I***********                             7   90MLPC3C          S01433CDL002
     I***********                            10  120MLPC4C          S01433CDL002
     I***********                            13  150MLPC5C          S01433CDL002
     I***********                            16  180MLPC6C          S01433CDL002
     I                                        1   30WMPC1C                CDL002
     I                                        4   60WMPC2C                CDL002
     I                                        7   90WMPC3C                CDL002
     I                                       10  120WMPC4C                CDL002
     I                                       13  150WMPC5C                CDL002
     I                                       16  180WMPC6C                CDL002
     I*                                                                   S01433
0309 I            DS                                                      S01433
     I                                        1  18 CPPC                  S01433
     I                                        1  18 CPPCA                 S01433
     I***********                             1   30PLPC1C          S01433CDL002
     I***********                             4   60PLPC2C          S01433CDL002
     I***********                             7   90PLPC3C          S01433CDL002
     I***********                            10  120PLPC4C          S01433CDL002
     I***********                            13  150PLPC5C          S01433CDL002
     I***********                            16  180PLPC6C          S01433CDL002
     I                                        1   30WPPC1C                CDL002
     I                                        4   60WPPC2C                CDL002
     I                                        7   90WPPC3C                CDL002
     I                                       10  120WPPC4C                CDL002
     I                                       13  150WPPC5C                CDL002
     I                                       16  180WPPC6C                CDL002
0295 I********************************************************************
0296 I**   BRANCH LEVEL LIMITS
0297 I*****DATA*STRUCTURES TO LINK BFDAA & BLDAA & INPUT FIELDS           S01433
0297 I**   DATA STRUCTURES TO LINK BFDAA & BMDAA & BPDAA & INPUT FIELDS   S01433
0298 I            DS
0300 I                                        1  18 BFDAA
     I***********                             1   3 FLEP1B                CDL002
     I***********                             4   60FLEP2B                CDL002
     I***********                             7   90FLEP3B                CDL002
     I***********                            10  120FLEP4B                CDL002
     I***********                            13  150FLEP5B                CDL002
     I***********                            16  180FLEP6B                CDL002
     I                                        1   3 WFEP1B                CDL002
     I                                        4   60WFEP2B                CDL002
     I                                        7   90WFEP3B                CDL002
     I                                       10  120WFEP4B                CDL002
     I                                       13  150WFEP5B                CDL002
     I                                       16  180WFEP6B                CDL002
0302 I            DS
     I********                                1  18 BLDAA                 S01433
     I********                                1   3 LLEP1B                S01433
     I********                                4   60LLEP2B                S01433
     I********                                7   90LLEP3B                S01433
     I********                               10  120LLEP4B                S01433
     I********                               13  150LLEP5B                S01433
     I********                               16  180LLEP6B                S01433
     I                                        1  18 BMDAA                 S01433
     I/COPY WNCPYSRC,DL0762AI05
     I                                        1  18 BBDAA                 CDL006
     I***********                             1   3 MLEP1B          S01433CDL002
     I***********                             4   60MLEP2B          S01433CDL002
     I***********                             7   90MLEP3B          S01433CDL002
     I***********                            10  120MLEP4B          S01433CDL002
     I***********                            13  150MLEP5B          S01433CDL002
     I***********                            16  180MLEP6B          S01433CDL002
     I                                        1   3 WMEP1B                CDL002
     I                                        4   60WMEP2B                CDL002
     I                                        7   90WMEP3B                CDL002
     I                                       10  120WMEP4B                CDL002
     I                                       13  150WMEP5B                CDL002
     I                                       16  180WMEP6B                CDL002
     I            DS                                                      S01433
     I***********                             1  18 BPDAA           S01433CDL002
     I***********                             1   3 PLEP1B          S01433CDL002
     I***********                             4   60PLEP2B          S01433CDL002
     I***********                             7   90PLEP3B          S01433CDL002
     I***********                            10  120PLEP4B          S01433CDL002
     I***********                            13  150PLEP5B          S01433CDL002
     I***********                            16  180PLEP6B          S01433CDL002
     I                                        1   3 WPEP1B                CDL002
     I                                        4   60WPEP2B                CDL002
     I                                        7   90WPEP3B                CDL002
     I                                       10  120WPEP4B                CDL002
     I                                       13  150WPEP5B                CDL002
     I                                       16  180WPEP6B                CDL002
0306 I            DS
0307 I                                        1  18 BFPC
     I***********                             1   30FLPC1B                CDL002
     I***********                             4   60FLPC2B                CDL002
     I***********                             7   90FLPC3B                CDL002
     I***********                            10  120FLPC4B                CDL002
     I***********                            13  150FLPC5B                CDL002
     I***********                            16  180FLPC6B                CDL002
     I                                        1   30WFPC1B                CDL002
     I                                        4   60WFPC2B                CDL002
     I                                        7   90WFPC3B                CDL002
     I                                       10  120WFPC4B                CDL002
     I                                       13  150WFPC5B                CDL002
     I                                       16  180WFPC6B                CDL002
0309 I            DS
     I********                                1  18 BLPC                  S01433
     I********                                1   30LLPC1B                S01433
     I********                                4   60LLPC2B                S01433
     I********                                7   90LLPC3B                S01433
     I********                               10  120LLPC4B                S01433
     I********                               13  150LLPC5B                S01433
     I********                               16  180LLPC6B                S01433
     I                                        1  18 BMPC                  S01433
     I/COPY WNCPYSRC,DL0762AI06
     I                                        1  18 BBPC                  CDL006
     I***********                             1   30MLPC1B          S01433CDL002
     I***********                             4   60MLPC2B          S01433CDL002
     I***********                             7   90MLPC3B          S01433CDL002
     I***********                            10  120MLPC4B          S01433CDL002
     I***********                            13  150MLPC5B          S01433CDL002
     I***********                            16  180MLPC6B          S01433CDL002
     I                                        1   30WMPC1B                CDL002
     I                                        4   60WMPC2B                CDL002
     I                                        7   90WMPC3B                CDL002
     I                                       10  120WMPC4B                CDL002
     I                                       13  150WMPC5B                CDL002
     I                                       16  180WMPC6B                CDL002
0309 I            DS                                                      S01433
     I                                        1  18 BPPC                  S01433
     I***********                             1   30PLPC1B          S01433CDL002
     I***********                             4   60PLPC2B          S01433CDL002
     I***********                             7   90PLPC3B          S01433CDL002
     I***********                            10  120PLPC4B          S01433CDL002
     I***********                            13  150PLPC5B          S01433CDL002
     I***********                            16  180PLPC6B          S01433CDL002
     I                                        1   30WPPC1B                CDL002
     I                                        4   60WPPC2B                CDL002
     I                                        7   90WPPC3B                CDL002
     I                                       10  120WPPC4B                CDL002
     I                                       13  150WPPC5B                CDL002
     I                                       16  180WPPC6B                CDL002
0295 I********************************************************************
0719 I/COPY ZSRSRC,ZHOLI                                               ***
     I*
     ISDBANK    E DSSDBANKPD
     I** EXTERNAL DS FOR BANK DETAILS
     I*
     ISDDEAL    E DSSDDEALPD
     I** EXTERNAL DS FOR DEALING DETAILS
     I*
     ISDCURR    E DSSDCURRPD
     I** EXTERNAL DS FOR CURRENCY DETAILS
     I*
     ISDMMOD    E DSSDMMODPD                                              S01157
     I** EXTERNAL DS FOR MODULE DETAILS                                   S01157
     I*                                                                   S01157
     ISDLOMB    E DSSDLOMBPD                                              S01498
     I** Dummy record format for Portfolio Lending ICD.                   S01498
     I*                                                                   S01498
     ISDLBCS    E DSSDLBCSPD                                              S01498
     I** Dummy record format for Portfolio Lending Customer File          S01498
     I*                                                                   CDL002
     ISDLIMT    E DSSDLIMTPD                                              CDL002
     I** Limit Types                                                      CDL002
     I*                                                                   CDL002
     ISDCLLM    E DSSDCLLMPD                                              CDL002
     I** Client Limits                                                    CDL002
     I*                                                                   CDL002
     ISCSARD    E DSSCSARDPD                                              CDL002
     I** Switchable features details                                      CDL002
     I*                                                                   S01498
     IDSFDY     E DSDSFDY                                                 S01194
     I* FIRST DS FOR ACCESS PROGRAMS, SHORT DATA STRUCTURE                S01194
     I*                                                                   S01117
     IDSSDY     E DSDSSDY                                                 S01194
     I* SECOND DS FOR ACCESS PROGRAMS, LONG DATA STRUCTURE                S01194
     I**
     ISPOOL1      DS
     I**   FILE INFORMATION DATA STRUCTURE
     I                                       83  92 SFILE1
     I                                    B 123 1240SFNUM1
     I                                    B 243 2460SWRIT                 E00013
     I**
     I@BINRY      DS                                                      E00013
     I** DEFINE A BLANK BINARY FIELD FOR USE WITH SWRIT                   E00013
     I                                    B   1   40@BKBIN                E00013
     I**
     ISPOOLU      DS
     I**   FILE INFORMATION DATA STRUCTURE
     I                                       83  92 SFILEU
     I                                    B 123 1240SFNUMU
     I*                                                                   CDL002
     IW1KEYP      DS                                                      CDL002
     I                                        1   8 W1PASK                CDL002
     I                                        9  14 W1PTNU                CDL002
     I                                       15  17 W1CO                  CDL002
     I                                       18  20 W1BR                  CDL002
     I*                                                                   CDL002
     IW2KEYN      DS                                                      CDL002
     I                                        1   8 W2PASK                CDL002
     I                                        9  14 W2PTNU                CDL002
     I                                       15  22 W2CASK                CDL002
     I                                       23  28 W2CUNR                CDL002
     I                                       29  31 W2CO                  CDL002
     I                                       32  34 W2BR                  CDL002
     I*                                                                   CDL002
     IW3KEYP      DS                                                      CDL002
     I                                        1   8 W3PASK                CDL002
     I                                        9  14 W3PTNU                CDL002
     I                                       15  17 W3CO                  CDL002
     I                                       18  20 W3BR                  CDL002
     I*                                                                   CDL002
     IW4KEYN      DS                                                      CDL002
     I                                        1   8 W4PASK                CDL002
     I                                        9  14 W4PTNU                CDL002
     I                                       15  22 W4CASK                CDL002
     I                                       23  28 W4CUNR                CDL002
     I                                       29  31 W4CO                  CDL002
     I                                       32  34 W4BR                  CDL002
     I*                                                                   CDL002
     IWRKEYP      DS                                                      CDL002
     I                                        1   8 WRPPAS                CDL002
     I                                        9  14 WRPPTN                CDL002
     I                                       15  17 WRPCO                 CDL002
     I                                       18  20 WRPBR                 CDL002
     I*                                                                   CDL002
     IWRKEYN      DS                                                      CDL002
     I                                        1   8 WRNPAS                CDL002
     I                                        9  14 WRNPTN                CDL002
     I                                       15  22 WRNCAS                CDL002
     I                                       23  28 WRNCUN                CDL002
     I                                       29  31 WRNCO                 CDL002
     I                                       32  34 WRNBR                 CDL002
     I*                                                                   CDL002
     IWREVL     E DSEVLPCB                                                CDL002
     I* Event fields                                                      CDL002
     I*                                                                   CDL002
     I**                                                                  CDL002
     IWRSAVE      DS                           1000                       CDL002
     I* Saved Net fields                                                  CDL002
     I**                                                                  CDL002
     IWNSAVE      DS                           1000                       CDL002
     I* Saved Net fields                                                  CDL002
     I*                                                                   CDL002
     I/EJECT
0295 C********************************************************************
     C**
     C**  PARAMETERS - SEQUENCE NUMBER - 5 ALPHA
     C**               PRODUCTION OPTION - ALPHA
     C**               CUST/PAR NO FOR P.O. 3 AND 4 - ALPHA
     C**               ORIGINATING OR BOOKING BRANCH
     C           *ENTRY    PLIST
     C                     PARM           @RSEQ   5
     C                     PARM           @PROD   1
     C                     PARM           CNUMA   6
     C                     PARM           @OB     1
     C**
0295 C********************************************************************
0312 C**   ON FIRST CYCLE - GET ICDR1 & 2
     C           *IN42     IFNE '1'
0313 C                     EXSR FIRST
     C   U8                GOTO LRTAG
     C                     SETON                     40                   E150
     C                     ELSE                                           E150
     C                     SETOF                     40                   E150
     C                     END
0314 C**
0295 C********************************************************************
     C**  DETAIL CYCLE
      *                                                                   CDL002
      * Current Event                                                     CDL002
     C           W#NTCE    IFEQ 'Y'                                       CDL002
     C           *IN01     IFEQ *ON                                       CDL002
     C                     MOVE PASK      WRPPAS                          CDL002
     C                     MOVE PTNU      WRPPTN                          CDL002
     C                     MOVE CO        WRPCO                           CDL002
     C                     MOVE BR        WRPBR                           CDL002
     C                     ELSE                                           CDL002
     C                     MOVE PASK      WRNPAS                          CDL002
     C                     MOVE PTNU      WRNPTN                          CDL002
     C                     MOVE CASK      WRNCAS                          CDL002
     C                     MOVE CUNR      WRNCUN                          CDL002
     C                     MOVE CO        WRNCO                           CDL002
     C                     MOVE BR        WRNBR                           CDL002
     C                     ENDIF                                          CDL002
     C                     ENDIF                                          CDL002
     C*                                                                   CDL002
     C                     MOVE FLEP1S    WFEP1S                          CDL002
     C                     MOVE FLEP2S    WFEP2S                          CDL002
     C                     MOVE FLEP3S    WFEP3S                          CDL002
     C                     MOVE FLEP4S    WFEP4S                          CDL002
     C                     MOVE FLEP5S    WFEP5S                          CDL002
     C                     MOVE FLEP6S    WFEP6S                          CDL002
     C*                                                                   CDL002
     C                     MOVE MLEP1S    WMEP1S                          CDL002
     C                     MOVE MLEP2S    WMEP2S                          CDL002
     C                     MOVE MLEP3S    WMEP3S                          CDL002
     C                     MOVE MLEP4S    WMEP4S                          CDL002
     C                     MOVE MLEP5S    WMEP5S                          CDL002
     C                     MOVE MLEP6S    WMEP6S                          CDL002
     C*                                                                   CDL002
     C                     MOVE PLEP1S    WPEP1S                          CDL002
     C                     MOVE PLEP2S    WPEP2S                          CDL002
     C                     MOVE PLEP3S    WPEP3S                          CDL002
     C                     MOVE PLEP4S    WPEP4S                          CDL002
     C                     MOVE PLEP5S    WPEP5S                          CDL002
     C                     MOVE PLEP6S    WPEP6S                          CDL002
     C*                                                                   CDL002
     C                     MOVE FLPC1S    WFPC1S                          CDL002
     C                     MOVE FLPC2S    WFPC2S                          CDL002
     C                     MOVE FLPC3S    WFPC3S                          CDL002
     C                     MOVE FLPC4S    WFPC4S                          CDL002
     C                     MOVE FLPC5S    WFPC5S                          CDL002
     C                     MOVE FLPC6S    WFPC6S                          CDL002
     C*                                                                   CDL002
     C                     MOVE MLPC1S    WMPC1S                          CDL002
     C                     MOVE MLPC2S    WMPC2S                          CDL002
     C                     MOVE MLPC3S    WMPC3S                          CDL002
     C                     MOVE MLPC4S    WMPC4S                          CDL002
     C                     MOVE MLPC5S    WMPC5S                          CDL002
     C                     MOVE MLPC6S    WMPC6S                          CDL002
     C*                                                                   CDL002
     C                     MOVE PLPC1S    WPPC1S                          CDL002
     C                     MOVE PLPC2S    WPPC2S                          CDL002
     C                     MOVE PLPC3S    WPPC3S                          CDL002
     C                     MOVE PLPC4S    WPPC4S                          CDL002
     C                     MOVE PLPC5S    WPPC5S                          CDL002
     C                     MOVE PLPC6S    WPPC6S                          CDL002
     C*                                                                   CDL002
     C                     MOVE FLEP1S    WFEP1S                          CDL002
     C                     MOVE FLEP2S    WFEP2S                          CDL002
     C                     MOVE FLEP3S    WFEP3S                          CDL002
     C                     MOVE FLEP4S    WFEP4S                          CDL002
     C                     MOVE FLEP5S    WFEP5S                          CDL002
     C                     MOVE FLEP6S    WFEP6S                          CDL002
     C*                                                                   CDL002
     C                     MOVE MLEP1S    WMEP1S                          CDL002
     C                     MOVE MLEP2S    WMEP2S                          CDL002
     C                     MOVE MLEP3S    WMEP3S                          CDL002
     C                     MOVE MLEP4S    WMEP4S                          CDL002
     C                     MOVE MLEP5S    WMEP5S                          CDL002
     C                     MOVE MLEP6S    WMEP6S                          CDL002
     C*                                                                   CDL002
     C                     MOVE PLEP1S    WPEP1S                          CDL002
     C                     MOVE PLEP2S    WPEP2S                          CDL002
     C                     MOVE PLEP3S    WPEP3S                          CDL002
     C                     MOVE PLEP4S    WPEP4S                          CDL002
     C                     MOVE PLEP5S    WPEP5S                          CDL002
     C                     MOVE PLEP6S    WPEP6S                          CDL002
     C*                                                                   CDL002
     C                     MOVE FLPC1C    WFPC1C                          CDL002
     C                     MOVE FLPC2C    WFPC2C                          CDL002
     C                     MOVE FLPC3C    WFPC3C                          CDL002
     C                     MOVE FLPC4C    WFPC4C                          CDL002
     C                     MOVE FLPC5C    WFPC5C                          CDL002
     C                     MOVE FLPC6C    WFPC6C                          CDL002
     C*                                                                   CDL002
     C                     MOVE MLPC1C    WMPC1C                          CDL002
     C                     MOVE MLPC2C    WMPC2C                          CDL002
     C                     MOVE MLPC3C    WMPC3C                          CDL002
     C                     MOVE MLPC4C    WMPC4C                          CDL002
     C                     MOVE MLPC5C    WMPC5C                          CDL002
     C                     MOVE MLPC6C    WMPC6C                          CDL002
     C*                                                                   CDL002
     C                     MOVE PLPC1C    WPPC1C                          CDL002
     C                     MOVE PLPC2C    WPPC2C                          CDL002
     C                     MOVE PLPC3C    WPPC3C                          CDL002
     C                     MOVE PLPC4C    WPPC4C                          CDL002
     C                     MOVE PLPC5C    WPPC5C                          CDL002
     C                     MOVE PLPC6C    WPPC6C                          CDL002
     C*                                                                   CDL002
     C                     MOVE FLEP1B    WFEP1B                          CDL002
     C                     MOVE FLEP2B    WFEP2B                          CDL002
     C                     MOVE FLEP3B    WFEP3B                          CDL002
     C                     MOVE FLEP4B    WFEP4B                          CDL002
     C                     MOVE FLEP5B    WFEP5B                          CDL002
     C                     MOVE FLEP6B    WFEP6B                          CDL002
     C*                                                                   CDL002
     C                     MOVE MLEP1B    WMEP1B                          CDL002
     C                     MOVE MLEP2B    WMEP2B                          CDL002
     C                     MOVE MLEP3B    WMEP3B                          CDL002
     C                     MOVE MLEP4B    WMEP4B                          CDL002
     C                     MOVE MLEP5B    WMEP5B                          CDL002
     C                     MOVE MLEP6B    WMEP6B                          CDL002
     C*                                                                   CDL002
     C                     MOVE PLEP1B    WPEP1B                          CDL002
     C                     MOVE PLEP2B    WPEP2B                          CDL002
     C                     MOVE PLEP3B    WPEP3B                          CDL002
     C                     MOVE PLEP4B    WPEP4B                          CDL002
     C                     MOVE PLEP5B    WPEP5B                          CDL002
     C                     MOVE PLEP6B    WPEP6B                          CDL002
     C*                                                                   CDL002
     C                     MOVE FLPC1B    WFPC1B                          CDL002
     C                     MOVE FLPC2B    WFPC2B                          CDL002
     C                     MOVE FLPC3B    WFPC3B                          CDL002
     C                     MOVE FLPC4B    WFPC4B                          CDL002
     C                     MOVE FLPC5B    WFPC5B                          CDL002
     C                     MOVE FLPC6B    WFPC6B                          CDL002
      *                                                                   CDL002
      * Process any net group settlement customers before next            CDL002
      * customer with events                                              CDL002
      *                                                                   CDL002
      * Customer Changed                                                  CDL002
     C           *INL3     IFEQ *ON                                       CDL002
     C           W#NTCE    ANDEQ'Y'                                       CDL002
     C*                                                                   CDL002
     C                     EXSR NEVT1                                     CDL002
     C                     ENDIF                                          CDL002
      *                                                                   CDL002
     C**  IF NEW CUSTOMER, GET SYSTEM LIMIT ,OUTPUT CUST HEADING
     C           *INL3     IFEQ '1'
     C                     SETOF                     48
     C*********************EXSR LMTS                                      LN0632
     C           *IN01     IFEQ '1'
     C                     MOVE PTNU      CUST    6
     C                     MOVE PTNU      CPARX
     C                     SETON                     46
     C                     END
     C           *IN02     IFEQ '1'
     C                     MOVE CUNR      CUST
     C                     MOVE CUNR      CPARX   6
     C   50                MOVE PTNU      CPARX   6
     C                     SETON                     47
     C   46N49             SETON                     OF
     C                     SETOF                     46
     C                     END
     C*                                                                   LN0632
      ** If Portfolio Lending is switched on, if a LB customer            S01498
      ** is selected for extraction ignore it when the LB setup           S01498
      ** is to, not include LB customers for DL Exposure reports.         S01498
      *                                                                   S01498
     C           BGLMCR    IFEQ 'Y'                                       S01498
     C           LBLCDL    ANDEQ'N'                                       S01498
      *                                                                   S01498
      ** Call Access Program to determine if a LB Customer.               S01498
     C                     CALL 'AOLBCSR0'                                S01498
     C                     PARM '*MSG    '@RTCD                           S01498
     C                     PARM '*KEY    '@OPTN                           S01498
     C                     PARM CUST      @AENB  10                       S01498
     C***********          PARM *BLANKS   @KYST   7                                    S01498 222373
     C           SDLBCS    PARM SDLBCS    DSSDY                           S01498
     C*                                                                   S01498
     C           @RTCD     IFNE *BLANK                                    S01498
     C           @RTCD     ANDNE'*NRF'                                    S01498
     C                     MOVEL'SDLBCSPD'DBFILE            ************* S01498
     C                     MOVEL'05'      DBASE             *DBERROR 005* S01498
     C                     MOVEL@OPTN     DBOPTN            ************* S01498
     C                     MOVELCUST      DBKEY  29                       S01498
     C                     SETON                     U7U8LR               S01498
     C                     EXSR *PSSR                                     S01498
     C                     END                                            S01498
      *                                                                   S01498
      ** Customer is a LB customer - ignore.                              S01498
     C           @RTCD     IFEQ *BLANKS                                   S01498
     C                     GOTO LRTAG                                     S01498
     C                     END                                            S01498
     C                     END                                            S01498
     C/COPY WNCPYSRC,DL0762AC01
      *                                                                   CDL006
      **  If CDL006 is installed, access Client Limits file to retrieve   CDL006
      **  Fiduciary Limit Type & Limit Amounts                            CDL006
      *                                                                   CDL006
     C           CDL006    IFEQ 'Y'                                       CDL006
     C                     CALL 'AOCLLMR0'                                CDL006
     C                     PARM *BLANKS   PRTCD                           CDL006
     C                     PARM '*KEY   ' POPTN                           CDL006
     C                     PARM CUST      PCUST   6                       CDL006
     C                     PARM 'S'       PLEVL   1                       CDL006
     C                     PARM 'SYS'     PBCCD   3                       CDL006
     C           SDCLLM    PARM SDCLLM    DSFDY                           CDL006
      *                                                                   CDL006
     C           PRTCD     IFNE *BLANKS                                   CDL006
     C                     Z-ADD0         FIFILT  30                      CDL006
     C                     Z-ADD0         FIFILA  90                      CDL006
     C                     ELSE                                           CDL006
     C                     MOVE DZFILA    FIFILA                          CDL006
     C                     MOVE DZFILT    FIFILT                          CDL006
     C                     ENDIF                                          CDL006
     C                     ENDIF                                          CDL006
      *                                                                   S01498
     C                     EXSR LMTS                                      LN0632
     C*
     C                     MOVE 'N'       NAMPRT  1
     C**
     C**  IS THIS CUST THE ENTITY REQD, FOR OPTION 3 AND 4
     C           *IN49     IFEQ '1'
     C           *IN02     IFEQ '1'
     C           CPARX     ANDEQCNUMA
     C                     MOVE 'Y'       GOT1    1
     C                     END
     C           CPARX     COMP CNUMA                4848
     C**                                                                  LN0632
     C**  IF REQUIRED CUST HAS BEEN PROCESSED AND THERE IS A CHANGE       LN0632
     C**  OF CUST, DO NOT DO ANY MORE FILE PROCESSING                     LN0632
     C           GOT1      IFEQ 'Y'
     C   48 02             SETON                     LR
     C   48                GOTO ENDDET
     C                     END
     C                     END
     C                     END
     C**                                                                  LN0632
     C**  IF THIS CUST IS NOT THE REQUIRED CUST, DO NOT                   LN0632
     C**  CALCULATE EXPOSURE                                              LN0632
     C           *IN48     IFEQ '1'                                       LN0632
     C                     GOTO ENDDET                                    LN0632
     C                     END                                            LN0632
     C/COPY WNCPYSRC,DL0762AC02
      *                                                                   CDL006
      **  If CDL006 is installed, access Client Limits file to retrieve   CDL006
      **  Fiduciary Limit Type & Limit Amounts                            CDL006
      *                                                                   CDL006
     C           CDL006    IFEQ 'Y'                                       CDL006
     C                     CALL 'AOCLLMR0'                                CDL006
     C                     PARM *BLANKS   PRTCD                           CDL006
     C                     PARM '*KEY   ' POPTN                           CDL006
     C                     PARM CUST      PCUST   6                       CDL006
     C                     PARM 'S'       PLEVL   1                       CDL006
     C                     PARM 'SYS'     PBCCD   3                       CDL006
     C           SDCLLM    PARM SDCLLM    DSFDY                           CDL006
      *                                                                   CDL006
     C           PRTCD     IFNE *BLANKS                                   CDL006
     C                     Z-ADD0         FIFILT                          CDL006
     C                     Z-ADD0         FIFILA                          CDL006
     C                     ELSE                                           CDL006
     C                     MOVE DZFILA    FIFILA                          CDL006
     C                     MOVE DZFILT    FIFILT                          CDL006
     C                     ENDIF                                          CDL006
     C                     ENDIF                                          CDL006
     C**
     C**  IF NEW COMPANY & PO NE 1, GET COMPANY LIMIT
     C   L2N43             EXSR LMTC
     C**
     C**  IF NEW BRANCH & PO NE 1, GET BRANCH LIMIT
     C   L1N43             EXSR LMTB
     C**
0295 C********************************************************************
     C*                                                                   CDL002
     C* Net FX Customer Exposure?                                         CDL002
     C           W#NTCE    IFEQ 'Y'                                       CDL002
     C           EXEI      ANDEQ'F'                                       CDL002
     C*                                                                   CDL002
     C           DLNO      CHAINDEALSDBF             85                   CDL002
     C           *IN85     IFEQ *ON                                       CDL002
     C                     MOVEL'DEALS   'DBFILE           ************   CDL002
     C                     MOVEL'09'      DBASE            * DBERR 09 *   CDL002
     C                     MOVELDLNO      DBKEY            ************   CDL002
     C                     SETON                     U7U8LR               CDL002
     C                     EXSR *PSSR                                     CDL002
     C                     ELSE                                           CDL002
     C*   Exclude netted FX deal events                                   CDL002
     C           NETBR     IFNE *BLANKS                                   CDL002
     C                     MOVE 'N'       EXEI                            CDL002
     C                     ENDIF                                          CDL002
     C                     ENDIF                                          CDL002
     C                     ENDIF                                          CDL002
      *                                                                   CDL002
     C** CALC EXPOSURE AGAINST BR,CO & SYS LIMITS
     C** -FX
     C           EXEI      IFEQ 'F'
     C                     Z-ADDEDAT      DLVALU
     C********** A6NBDP    ADD  1         DEP                             S01433
     C           LCEQ      DIV  FCT,DEP   DLAMTF    H
     C* Call Access Prog.                                                 S01433
     C*  Check if first currency precious metal.                          S01433
     C*                                                                   S01433
     C                     CALL 'AOCURRR0'                                S01433
     C                     PARM '*MSG   ' @RTCD   7                       S01433
     C                     PARM '*KEY   ' @OPTN   7                       S01433
     C                     PARM ECCY      @AJCD   3                       S01433
     C           SDCURR    PARM SDCURR    DSSDY                           S01433
     C*                                                                   S01433
     C           @RTCD     IFNE *BLANK                                    S01433
     C                     MOVEL'SDCURRPD'DBFILE           ************   S01433
     C                     MOVEL'06'      DBASE            * DBERR 06 *   S01433
     C                     MOVEL@OPTN     DBOPTN           ************   S01433
     C                     MOVEL@AJCD     DBKEY                           S01433
     C                     SETON                     U7U8LR               S01433
     C                     EXSR *PSSR                                     S01433
     C                     GOTO ENDDET                                    S01433
     C                     END                                            S01433
     C*  If first currency is not precious metal check the other          S01433
     C*  currency                                                         S01433
     C*                                                                   S01433
     C           A6PMRT    IFEQ 'N'                                       S01433
     C* Call Access Prog.                                                 S01433
     C                     CALL 'AOCURRR0'                                S01433
     C                     PARM '*MSG   ' @RTCD                           S01433
     C                     PARM '*KEY   ' @OPTN                           S01433
     C                     PARM OTHC      @AJCD                           S01433
     C           SDCURR    PARM SDCURR    DSSDY                           S01433
     C*                                                                   S01433
     C           @RTCD     IFNE *BLANK                                    S01433
     C                     MOVEL'SDCURRPD'DBFILE           ************   S01433
     C                     MOVEL'07'      DBASE            * DBERR 07 *   S01433
     C                     MOVEL@OPTN     DBOPTN           ************   S01433
     C                     MOVEL@AJCD     DBKEY                           S01433
     C                     SETON                     U7U8LR               S01433
     C                     EXSR *PSSR                                     S01433
     C                     GOTO ENDDET                                    S01433
     C                     END                                            S01433
     C                     END                                            S01433
     C* If either currency is precious metal it is a                      S01433
     C* precious metal deal.                                              S01433
     C*                                                                   S01433
     C           A6PMRT    IFEQ 'Y'                                       S01433
     C*                                                                   S01433
     C           *IN43     IFEQ '0'                                       S01433
     C                     EXSR EXPPB                                     S01433
     C                     EXSR EXPPC                                     S01433
     C                     END                                            S01433
     C*                                                                   S01433
     C                     EXSR EXPPS                                     S01433
     C* Else it is an FX deal                                             S01433
     C                     ELSE                                           S01433
     C  N43                EXSR EXPFB
     C  N43                EXSR EXPFC
     C                     EXSR EXPFS
     C*                                                                   S01433
     C**********           ADD  1         RREAD                           S01433
     C                     END                                            S01433
     C*                                                                   S01433
     C                     ADD  1         RREAD   50
     C                     END
     C**
     C****-LENDING******                                                  S01433
     C**  -MONEY MARKET                                                   S01433
     C           EXEI      IFEQ 'L'
     C           EDAT      IFLT BJRDNB
     C           EDAT      ADD  BJRDNB    DLMATD
     C                     ELSE
     C                     Z-ADDEDAT      DLMATD
     C                     END
     C**
     C********** A6NBDP    ADD  1         DEP     10                      S01433
     C           LCEQ      DIV  FCT,DEP   DLAMTL    H
     C  N43                EXSR EXPLB
     C  N43                EXSR EXPLC
     C                     EXSR EXPLS
     C                     ADD  1         RREAD
     C                     END
      *                                                                   S01157
      ** -FRA EVENT                                                       S01157
      *                                                                   S01157
     C           EXEI      IFEQ 'R'                                       S01157
     C********** A6NBDP    ADD  1         DEP                       S01157S01433
      *                                                                   S01157
     C           LCEQ      DIV  FCT,DEP   DLAMTR 130H                     S01157
     C  N43      RBPOS     ADD  DLAMTR    RBPOS  100                      S01157
     C  N43      RCPOS     ADD  DLAMTR    RCPOS  100                      S01157
     C           RXPOS     ADD  DLAMTR    RXPOS  100                      S01157
      *                                                                   S01157
     C                     ADD  1         RREAD                           S01157
      *                                                                   S01157
     C                     END                                            S01157
      *                                                                   S01157
      ** -IRS EVENT                                                       S01157
      *                                                                   S01157
     C           EXEI      IFEQ 'I'                                       S01157
     C********** A6NBDP    ADD  1         DEP                       S01157S01433
      *                                                                   S01157
     C           LCEQ      DIV  FCT,DEP   DLAMTI 130H                     S01157
     C  N43      IBPOS     ADD  DLAMTI    IBPOS  100                      S01157
     C  N43      ICPOS     ADD  DLAMTI    ICPOS  100                      S01157
     C           IXPOS     ADD  DLAMTI    IXPOS  100                      S01157
      *                                                                   S01157
     C                     ADD  1         RREAD                           S01157
      *                                                                   S01157
     C                     END                                            S01157
      *                                                                   S01157
     C**
     C           ENDDET    TAG                             ** ENDDET **
     C**
0295 C********************************************************************
     C** ONLY DO FOLLOWING SUBROUTINES IF AT LEAST ONE RECORD IE. FIRST
     C** CYCLE HAS BEEN PROCESSED
     C*                                                                   CDL002
     C* Include any nets for the customer                                 CDL002
     CL1         *IN48     IFEQ *OFF                                      CDL002
     CL1         *IN42     ANDEQ*ON                                       CDL002
     CL1         W#NTCE    ANDEQ'Y'                                       CDL002
     CL1                   EXSR NEVTD                                     CDL002
     CL1                   ENDIF                                          CDL002
     C*                                                                   CDL002
      *                                                                   S01157
      *   Execute FRA/IRS subroutines only if FRA/IRS module present.     S01157
      *                                                                   S01157
     CL1N43N48 42          EXSR FXBWRT
     CL1N43N48 42          EXSR PMBWRT                                    S01433
     CL1N43N48 42          EXSR LNBWRT
     C*                                                                   S01157
     CL1N43N48 42                                                         S01157
     CAN 30                EXSR FRBWRT                                    S01157
     CL1N43N48 42                                                         S01157
     CAN 30                EXSR IRBWRT                                    S01157
     C*                                                                   S01157
     CL2N43N48 42          EXSR FXCWRT
     CL2N43N48 42          EXSR PMCWRT                                    S01433
     CL2N43N48 42          EXSR LNCWRT
      *                                                                   S01157
     CL2N43N48 42                                                         S01157
     CAN 30                EXSR FRCWRT                                    S01157
     CL2N43N48 42                                                         S01157
     CAN 30                EXSR IRCWRT                                    S01157
     C*                                                                   S01157
     CL3N48    42          EXSR FXSWRT
     CL3N48    42          EXSR PMSWRT                                    S01433
     CL3N48    42          EXSR LNSWRT
      *                                                                   S01157
     CL3N48 30 42          EXSR FRSWRT                                    S01157
     CL3N48 30 42          EXSR IRSWRT                                    S01157
      *                                                                   S01157
     CLR         LRTAG     TAG                             ** LRTAG **
     C*                                                                   CDL002
     C* Process any Net Group Settlement Customers after last customer    CDL002
     C* with events                                                       CDL002
     CLR         W#NTCE    IFEQ 'Y'                                       CDL002
     CLR                   EXSR NEVTLR                                    CDL002
     CLR                   ENDIF                                          CDL002
     C*                                                                   CDL002
     CLR         RLIST     COMP 0                        41
     C*
     C** IF 1ST CYCLE NOT DONE CALL #ZZ FOR HEADING/DATE ETC. FOR AU
     C************IN42     IFEQ '0'                                       E00013
     CLR         *IN41     IFEQ '1'                                       E00013
     CLR                   EXSR #ZZ
     CLR                   END
     C*
0460 CLR                   SETON                     OF
     C*R**********         FREE 'DL0131'                                  S01433
     CLR                   FREE 'DL0131A'                                 S01433
     C**
     C** CALL ZSFILE FOR AU FILE - ONCE ONLY
     CLR                   Z-ADDSFNUMU    ZSNUM   60
     CLR                   CALL 'ZSFILE'
     CLR                   PARM           @RSEQ   5
     CLR                   PARM *BLANKS   @PARM   3
     CLR                   PARM           SFILEU
     CLR                   PARM           ZSNUM
     CLR                   PARM           ZSERR   1
     C*
     CLR         ZSERR     IFEQ 'Y'
     C** Error during ZSFILE processing, return to calling program
     C*****************    SETON                     U7U8LR               E00013
     CLR                   SETON                     U7U8                 E00013
     CLR                   RETRN
     CLR                   END
     C**
     C** CALL ZSFILE FOR P1 FILE - ONCE ONLY - ONLY IF DETAILS OUTPUT
     CLR         *IN41     IFEQ '0'                                       E00013
     CLR                   MOVE '0'       *IN25                           E00013
     CLR         SWRIT     IFNE 0                                         E00013
     CLR         SWRIT     ANDNE@BKBIN                                    E00013
     CLR                   MOVE '1'       *IN25                           E00013
     CLR                   Z-ADDSFNUM1    ZSNUM   60
     CLR                   CALL 'ZSFILE'
     CLR                   PARM           @RSEQ   5
     CLR                   PARM *BLANKS   @PARM   3
     CLR                   PARM           SFILE1
     CLR                   PARM           ZSNUM
     CLR                   PARM           ZSERR   1
     CLR                   END                                            E00013
     C*
     CLR         ZSERR     IFEQ 'Y'
     C** Error during ZSFILE processing, return to calling program
     C*****************    SETON                     U7U8LR               E00013
     CLR                   SETON                     U7U8                 E00013
     CLR                   RETRN
     CLR                   END
     C**                                                                  E00013
     CLR                   END                                            E00013
     C**
0461 C********************************************************************
     C/EJECT
0461 C********************************************************************
     C**
     C**    LIST OF SR'S CALLED, FREQUENCY & SEQUENCE
     C**
     C**        SR             FREQ                   SEQ
     C**        --             ----                   ---
     C**        LMTS,SF,SL     X CUST                  4
     C**        LMTSP,CP,PC                                               S01433
     C**        LMTC,CF,CL     X CUST,CO               3
     C**        LMTB           X CUST,BR               2
     C**
     C**        EXPFS,FC,FB    X FX EVENTS             1
     C**        EXPPS,PC,PB    X PM EVENTS             1                  S01433
     C**********EXPLS,LC,LB    X LN EVENTS             1                  S01433
     C**        EXPLS,LC,LB    X MM EVENTS             1                  S01433
     C**
     C**        FXSWRT         X CUST                  4
     C**        PMSWRT         X CUST                  4                  S01433
     C**        LNSWRT         X CUST                  4
     C**        FRSWRT         X CUST                  4                  S01157
     C**        IRSWRT         X CUST                  4                  S01157
     C**        FXCWRT         X CUST,CO               3
     C**        PMCWRT         X CUST,CO               3                  S01433
     C**        LNCWRT         X CUST,CO               3
     C**        FRCWRT         X CUST,CO               3                  S01157
     C**        IRCWRT         X CUST,CO               3                  S01157
     C**        FXBWRT         X CUST,BR               2
     C**        LNCWRT         X CUST,BR               2
     C**        FRBWRT         X CUST,BR               2                  S01157
     C**        PMBWRT         X CUST,BR               2                  S01433
     C**        IRBWRT         X CUST,BR               2                  S01157
     C**
     C**   EXCESS EXPOSURE SUBROUTINES
     C**        EXSFS,LS       = FXSWRT,LNSWRT         4
     C**        EXSPS          = PMSWRT,LNSWRT         4                  S01433
     C**        EXSRS,IS       = FRSWRT,IRSWRT         4                  S01157
     C**
     C**        EXSFC,LC       = FXCWRT,LNCWRT         3
     C**        EXSRC,IC       = FRCWRT,IRCWRT         3                  S01157
     C**
     C**        EXSFB,LB       = FXBWRT,LNBWRT         2
     C**        EXSPB,                                 2                  S01433
     C**        EXSRB,IB       = FRBWRT,IRBWRT         2                  S01157
     C**
     C**        DL0131         X CUST + X CUST,CO      5
     C**        ZACCH          1                       7
     C**        ZFWDT          1                       7
     C**        FIRST          1                       7
     C**
0595 C********************************************************************
     C/EJECT
0595 C********************************************************************
     C**
     C**   EXPOSURE SUBROUTINES, AGAINST:
     C**     SYS LIMIT -FX - EXPFS    CO LIMIT -FX - EXPFC
     C**               -PM - EXPPS             -PM - EXPPC                S01433
     C**********       -LN - EXPLS             -LN - EXPLC                S01433
     C**               -MM - EXPLS             -MM - EXPLC                S01433
     C**     BR LIMIT  -FX - EXPFB
     C**               -PM - EXPPB                                        S01433
     C********         -LN - EXPLB                                        S01433
     C**               -MM - EXPLB                                        S01433
     C**
0595 C********************************************************************
     C*    SYSTEM LEVEL LIMITS
0603 C**   EXPFS  SR. CALCULATES EXPOSURE FOR A FX DEAL.
0604 C**
0605 C           EXPFS     BEGSR                           **  EXPFS   **
0606 C**
0607 C**   DEFINE INPUT FIELDS
0608 C                     Z-ADDDLVALU    DLVALU  50       VALUE DATE
0609 C                     Z-ADDDLAMTF    DLAMTF 130       LIMIT CCY EQUIV
0610 C**                                                       AMOUNT
0611 C* IF VALUE DATE IS LESS OR EQUAL TO RUN DATE - FIRST PERIOD ONLY
     C********   DLVALU    COMP BJRDNB                 8989               S01433
     C           DLVALU    COMP RUND2                  8989               S01433
     C           FXSP      IFEQ 'Y'                                       S01433
     C           *IN89     ANDEQ'1'                                       S01433
     C           XFXP1     ADD  DLAMTF    XFXP1  130                      S01433
0614 C   89                GOTO EXPFS9
     C                     END                                            S01433
0615 C**
0616 C**   VALUE DATE IS GREATER THAN TODAY - AMOUNT IS ADDED INTO EVERY
0617 C**   PERIOD PRECEDING & INCLUDING THE PERIOD WHICH INCLUDES THE
0618 C**   VALUE DATE.
0619 C                     Z-ADD0         D       20
0620 C**
0621 C           EXPFS1    TAG                             **  EXPFS1  **
0622 C           D         ADD  1         D
0623 C**
0624 C**   ADD AMOUNT INTO THIS PERIOD
     C*                                                                   S01408
     C/COPY WNCPYSRC,DL0762ACP1                                           S01408
     C*                                                                   S01408
0625 C           XFXP,D    ADD  DLAMTF    XFXP,D
     C*                                                                   S01408
     C/COPY WNCPYSRC,DL0762ACP2                                           S01408
     C*                                                                   S01408
0626 C**
0627 C**   LOOP AGAIN TO ADD AMOUNT INTO NEXT PERIOD IF
0628 C**   - VALUE DATE EXCEEDS THIS END OF PERIOD DATE.
0629 C**   - LESS THAN SIX PERIODS HAVE BEEN USED.
0630 C           DLVALU    COMP XFDT,D               88
0631 C           D         COMP 6                      87
0632 C   87 88             GOTO EXPFS1
0633 C**
0634 C           EXPFS9    ENDSR                           **  EXPFS9  **
0635 C**
0595 C********************************************************************S01433
     C*    SYSTEM LEVEL LIMITS                                            S01433
     C**   EXPPS  SR. CALCULATES EXPOSURE FOR A PM DEAL.                  S01433
     C**                                                                  S01433
     C           EXPPS     BEGSR                           **  EXPPS   ** S01433
     C**                                                                  S01433
     C**   DEFINE INPUT FIELDS                                            S01433
     C                     Z-ADDDLVALU    DLVALU  50       VALUE DATE     S01433
     C                     Z-ADDDLAMTF    DLAMTF 130       LIMIT CCY EQUIVS01433
     C**                                                       AMOUNT     S01433
     C* IF VALUE DATE IS LESS OR EQUAL TO RUN DATE - FIRST PERIOD ONLY    S01433
     C           DLVALU    COMP RUND2                  8989               S01433
     C           PMSP      IFEQ 'Y'                                       S01433
     C           *IN89     ANDEQ'1'                                       S01433
     C           XPXP1     ADD  DLAMTF    XPXP1  130                      S01433
     C   89                GOTO EXPPS9                                    S01433
     C                     END                                            S01433
     C**                                                                  S01433
     C**   VALUE DATE IS GREATER THAN TODAY - AMOUNT IS ADDED INTO EVERY  S01433
     C**   PERIOD PRECEDING & INCLUDING THE PERIOD WHICH INCLUDES THE     S01433
     C**   VALUE DATE.                                                    S01433
     C                     Z-ADD0         D       20                      S01433
     C**                                                                  S01433
     C           EXPPS1    TAG                             **  EXPPS1  ** S01433
     C           D         ADD  1         D                               S01433
     C**                                                                  S01433
     C**   ADD AMOUNT INTO THIS PERIOD                                    S01433
     C           XPXP,D    ADD  DLAMTF    XPXP,D                          S01433
     C**                                                                  S01433
     C**   LOOP AGAIN TO ADD AMOUNT INTO NEXT PERIOD IF                   S01433
     C**   - VALUE DATE EXCEEDS THIS END OF PERIOD DATE.                  S01433
     C**   - LESS THAN SIX PERIODS HAVE BEEN USED.                        S01433
     C           DLVALU    COMP XPDT,D               88                   S01433
     C           D         COMP 6                      87                 S01433
     C   87 88             GOTO EXPPS1                                    S01433
     C**                                                                  S01433
     C           EXPPS9    ENDSR                           **  EXPPS9  ** S01433
     C**                                                                  S01433
     C********************************************************************S01433
     C**   SYSTEM LEVEL  LIMITS
     C*****EXPLS**SR. CALCULATES EXPOSURE FOR A LOAN DEAL.                S01433
     C**   EXPLS  SR. CALCULATES EXPOSURE FOR A MONEY MARKET DEAL.        S01433
0638 C**
0639 C           EXPLS     BEGSR                           **  EXPLS   **
0640 C**
0641 C**   DEFINE INPUT FIELDS
0642 C                     Z-ADDDLMATD    DLMATD  50
0643 C                     Z-ADDDLAMTL    DLAMTL 130
     C/COPY WNCPYSRC,DL0762AC03
0648 C**
0649 C**   LOOP TO ADD AMOUNT INTO EVERY PERIOD PRECEDING & INCLUDING
0650 C**   THE PERIOD WHICH INCLUDES THE MATURITY DATE.
0651 C                     Z-ADD0         D       20
0652 C           EXPLS1    TAG                             **  EXPLS1  **
     C/COPY WNCPYSRC,DL0762AC04
      *                                                                   CDL006
      ** If CDL006 is installed, and deal type is FL, DP or LP            CDL006
      *                                                                   CDL006
     C           CDL006    IFEQ 'Y'                                       CDL006
     C           DLNO      CHAINDEALSDCF             85                   CDL006
     C           DTYP      IFEQ 'FL'                                      CDL006
     C           DTYP      OREQ 'DP'                                      CDL006
     C           DTYP      OREQ 'LP'                                      CDL006
      *                                                                   CDL006
     C           D         ADD  1         D                               CDL006
      *                                                                   CDL006
      ** Add amount into this period                                      CDL006
      *                                                                   CDL006
     C           SIXP,D    ADD  DLAMTL    SIXP,D                          CDL006
      *                                                                   CDL006
      ** Loop again to add amount into next period if                     CDL006
      ** - Maturity date exceeds this end of period date                  CDL006
      ** - Less than six periods have been used                           CDL006
      *                                                                   CDL006
     C           DLMATD    COMP SIDT,D               88                   CDL006
     C           D         COMP 6                      87                 CDL006
     C   87 88             GOTO EXPLS1                                    CDL006
     C                     ENDIF                                          CDL006
     C                     ELSE                                           CDL006
0653 C           D         ADD  1         D
0654 C**
0655 C**   ADD AMOUNT INTO THIS PERIOD
     C********   XLXP,D    ADD  DLAMTL    XLXP,D                          S01433
     C           XMXP,D    ADD  DLAMTL    XMXP,D                          S01433
0657 C**
0658 C**   LOOP AGAIN TO ADD AMOUNT INTO NEXT PERIOD IF
0659 C**   - MATURITY DATE EXCEEDS THIS END OF PERIOD DATE.
0660 C**   - LESS THAN SIX PERIODS HAVE BEEN USED
     C********   DLMATD    COMP XLDT,D               88                   S01433
     C           DLMATD    COMP XMDT,D               88                   S01433
0662 C           D         COMP 6                      87
0663 C   87 88             GOTO EXPLS1
     C/COPY WNCPYSRC,DL0762AC05
     C                     ENDIF                                          CDL006
0664 C**
0665 C                     ENDSR
0666 C********************************************************************
     C*    COMPANY LEVEL LIMITS                                           S01433
0603 C**   EXPFC  SR. CALCULATES EXPOSURE FOR A FX DEAL.                  S01433
0604 C**                                                                  S01433
0605 C           EXPFC     BEGSR                           **  EXPFC   ** S01433
0606 C**
0607 C**   DEFINE INPUT FIELDS
0608 C                     Z-ADDDLVALU    DLVALU           VALUE DATE
0609 C                     Z-ADDDLAMTF    DLAMTF           LIMIT CCY EQUIV
0606 C**                                                                  S01433
0611 C* IF VALUE DATE IS LESS OR EQUAL TO RUN DATE - FIRST PERIOD ONLY    S01433
     C********   DLVALU    COMP BJRDNB                 8989               S01433
     C           DLVALU    COMP RUND2                  8989               S01433
     C           FXSPC     IFEQ 'Y'                                       S01433
     C           *IN89     ANDEQ'1'                                       S01433
     C           CFXP1     ADD  DLAMTF    CFXP1  130                      S01433
0614 C   89                GOTO EXPFC9                                    S01433
     C                     END                                            S01433
0615 C**                                                                  S01433
0616 C**   VALUE DATE IS GREATER THAN TODAY - AMOUNT IS ADDED INTO EVERY  S01433
0617 C**   PERIOD PRECEDING & INCLUDING THE PERIOD WHICH INCLUDES THE     S01433
0618 C**   VALUE DATE.                                                    S01433
0619 C                     Z-ADD0         D       20                      S01433
0620 C**                                                                  S01433
0621 C           EXPFC1    TAG                             **  EXPFC1  ** S01433
0622 C           D         ADD  1         D                               S01433
0623 C**                                                                  S01433
0624 C**   ADD AMOUNT INTO THIS PERIOD                                    S01433
     C           CFXP,D    ADD  DLAMTF    CFXP,D                          S01433
0625 C********** CFXP,D    ADD  DLAMTF    CFXP,D                          S01433
0626 C**                                                                  S01433
0627 C**   LOOP AGAIN TO ADD AMOUNT INTO NEXT PERIOD IF                   S01433
0628 C**   - VALUE DATE EXCEEDS THIS END OF PERIOD DATE.                  S01433
0629 C**   - LESS THAN SIX PERIODS HAVE BEEN USED.                        S01433
0630 C           DLVALU    COMP CFDT,D               88                   S01433
0631 C           D         COMP 6                      87                 S01433
0632 C   87 88             GOTO EXPFC1                                    S01433
0633 C**                                                                  S01433
0634 C           EXPFC9    ENDSR                           **  EXPFC9  ** S01433
0635 C**                                                                  S01433
0636 C********************************************************************
     C*    COMPANY LEVEL LIMITS                                           S01433
     C**   EXPPC  SR. CALCULATES EXPOSURE FOR A PM DEAL.                  S01433
     C**                                                                  S01433
     C           EXPPC     BEGSR                           **  EXPPC   ** S01433
     C**                                                                  S01433
     C**   DEFINE INPUT FIELDS                                            S01433
     C                     Z-ADDDLVALU    DLVALU  50       VALUE DATE     S01433
     C                     Z-ADDDLAMTF    DLAMTF 130       LIMIT CCY EQUIVS01433
     C**                                                                  S01433
     C* IF VALUE DATE IS LESS OR EQUAL TO RUN DATE - FIRST PERIOD ONLY    S01433
     C           DLVALU    COMP RUND2                  8989               S01433
     C           PMSPC     IFEQ 'Y'                                       S01433
     C           *IN89     ANDEQ'1'                                       S01433
     C           CPXP1     ADD  DLAMTF    CPXP1  130                      S01433
     C   89                GOTO EXPPC9                                    S01433
     C                     END                                            S01433
     C**                                                                  S01433
     C**   VALUE DATE IS GREATER THAN TODAY - AMOUNT IS ADDED INTO EVERY  S01433
     C**   PERIOD PRECEDING & INCLUDING THE PERIOD WHICH INCLUDES THE     S01433
     C**   VALUE DATE.                                                    S01433
     C                     Z-ADD0         D       20                      S01433
     C**                                                                  S01433
     C           EXPPC1    TAG                             **  EXPPC1  ** S01433
     C           D         ADD  1         D                               S01433
     C**                                                                  S01433
     C**   ADD AMOUNT INTO THIS PERIOD                                    S01433
     C           CPXP,D    ADD  DLAMTF    CPXP,D                          S01433
     C**                                                                  S01433
     C**   LOOP AGAIN TO ADD AMOUNT INTO NEXT PERIOD IF                   S01433
     C**   - VALUE DATE EXCEEDS THIS END OF PERIOD DATE.                  S01433
     C**   - LESS THAN SIX PERIODS HAVE BEEN USED.                        S01433
     C           DLVALU    COMP CPDT,D               88                   S01433
     C           D         COMP 6                      87                 S01433
     C   87 88             GOTO EXPPC1                                    S01433
     C**                                                                  S01433
     C           EXPPC9    ENDSR                           **  EXPPC9  ** S01433
     C**                                                                  S01433
0666 C********************************************************************S01433
     C**   COMPANY LEVEL  LIMITS
     C*****EXPLC**SR. CALCULATES EXPOSURE FOR A LOAN DEAL.                S01433
     C**   EXPLC  SR. CALCULATES EXPOSURE FOR A MONEY MARKET DEAL.        S01433
0638 C**
0639 C           EXPLC     BEGSR                           **  EXPLC   **
     C/COPY WNCPYSRC,DL0762AC06
0640 C**
0648 C**
0649 C**   LOOP TO ADD AMOUNT INTO EVERY PERIOD PRECEDING & INCLUDING
0650 C**   THE PERIOD WHICH INCLUDES THE MATURITY DATE.
0651 C                     Z-ADD0         D       20
0652 C           EXPLC1    TAG                             **  EXPLC1  **
     C/COPY WNCPYSRC,DL0762AC07
      *                                                                   CDL006
      ** If CDL006 is installed and deal type is FL, DP or LP             CDL006
      *                                                                   CDL006
     C           DTYP      IFEQ 'FL'                                      CDL006
     C           CDL006    ANDEQ'Y'                                       CDL006
     C           DTYP      OREQ 'DP'                                      CDL006
     C           CDL006    ANDEQ'Y'                                       CDL006
     C           DTYP      OREQ 'LP'                                      CDL006
     C           CDL006    ANDEQ'Y'                                       CDL006
      *                                                                   CDL006
     C           D         ADD  1         D                               CDL006
      *                                                                   CDL006
      ** Add amount into this period                                      CDL006
      *                                                                   CDL006
     C           CCXP,D    ADD  DLAMTL    CCXP,D                          CDL006
      *                                                                   CDL006
      ** Loop again to add amount into next period if                     CDL006
      ** - Matirity date exceeds this end of period date                  CDL006
      ** - Less than six periods have been used                           CDL006
      *                                                                   CDL006
     C           DLMATD    COMP CCDT,D               88                   CDL006
     C           D         COMP 6                      87                 CDL006
     C   87 88             GOTO EXPLC1                                    CDL006
     C                     ELSE                                           CDL006
0653 C           D         ADD  1         D
0654 C**
0655 C**   ADD AMOUNT INTO THIS PERIOD
     C********   CLXP,D    ADD  DLAMTL    CLXP,D                          S01433
     C           CMXP,D    ADD  DLAMTL    CMXP,D                          S01433
0657 C**
0658 C**   LOOP AGAIN TO ADD AMOUNT INTO NEXT PERIOD IF
0659 C**   - MATURITY DATE EXCEEDS THIS END OF PERIOD DATE.
0660 C**   - LESS THAN SIX PERIODS HAVE BEEN USED
     C********   DLMATD    COMP CLDT,D               88                   S01433
     C           DLMATD    COMP CMDT,D               88                   S01433
0662 C           D         COMP 6                      87
0663 C   87 88             GOTO EXPLC1
     C/COPY WNCPYSRC,DL0762AC08
     C                     ENDIF                                          CDL006
0664 C**
0665 C                     ENDSR
0666 C********************************************************************
     C*    BRANCH LEVEL LIMITS
0603 C**   EXPFB  SR. CALCULATES EXPOSURE FOR A FX DEAL.
0604 C**
0605 C           EXPFB     BEGSR                           **  EXPFB   **
0606 C**                                                                  S01433
0607 C**   DEFINE INPUT FIELDS                                            S01433
0608 C                     Z-ADDDLVALU    DLVALU  50       VALUE DATE     S01433
0609 C                     Z-ADDDLAMTF    DLAMTF 130       LIMIT CCY EQUIVS01433
0606 C**
0611 C* IF VALUE DATE IS LESS OR EQUAL TO RUN DATE - FIRST PERIOD ONLY
     C********   DLVALU    COMP BJRDNB                 8989               S01433
     C           DLVALU    COMP RUND2                  8989               S01433
     C           FXSPB     IFEQ 'Y'                                       S01433
     C           *IN89     ANDEQ'1'                                       S01433
     C           BFXP1     ADD  DLAMTF    BFXP1  130                      S01433
0614 C   89                GOTO EXPFB9
     C                     END                                            S01433
0615 C**
0616 C**   VALUE DATE IS GREATER THAN TODAY - AMOUNT IS ADDED INTO EVERY
0617 C**   PERIOD PRECEDING & INCLUDING THE PERIOD WHICH INCLUDES THE
0618 C**   VALUE DATE.
0619 C                     Z-ADD0         D       20
0 20 C**
0621 C           EXPFB1    TAG                             **  EXPFB1  **
0622 C           D         ADD  1         D
0623 C**
0624 C**   ADD AMOUNT INTO THIS PERIOD
0625 C           BFXP,D    ADD  DLAMTF    BFXP,D
0626 C**
0627 C**   LOOP AGAIN TO ADD AMOUNT INTO NEXT PERIOD IF
0628 C**   - VALUE DATE EXCEEDS THIS END OF PERIOD DATE.
0629 C**   - LESS THAN SIX PERIODS HAVE BEEN USED.
0630 C           DLVALU    COMP BFDT,D               88
0631 C           D         COMP 6                      87
0632 C   87 88             GOTO EXPFB1
0633 C**
0634 C           EXPFB9    ENDSR                           **  EXPFB9  **
0635 C**
0636 C********************************************************************
     C*    BRANCH LEVEL LIMITS                                            S01433
     C**   EXPPB  SR. CALCULATES EXPOSURE FOR A PM DEAL.                  S01433
     C**                                                                  S01433
     C           EXPPB     BEGSR                           **  EXPPB   ** S01433
     C**                                                                  S01433
     C* IF VALUE DATE IS LESS OR EQUAL TO RUN DATE - FIRST PERIOD ONLY    S01433
     C           DLVALU    COMP RUND2                  8989               S01433
     C           PMSPB     IFEQ 'Y'                                       S01433
     C           *IN89     ANDEQ'1'                                       S01433
     C           BPXP1     ADD  DLAMTF    BPXP1  130                      S01433
     C   89                GOTO EXPPB9                                    S01433
     C                     END                                            S01433
     C**                                                                  S01433
     C**   VALUE DATE IS GREATER THAN TODAY - AMOUNT IS ADDED INTO EVERY  S01433
     C**   PERIOD PRECEDING & INCLUDING THE PERIOD WHICH INCLUDES THE     S01433
     C**   VALUE DATE.                                                    S01433
     C                     Z-ADD0         D       20                      S01433
     C**                                                                  S01433
     C           EXPPB1    TAG                             **  EXPPB1  ** S01433
     C           D         ADD  1         D                               S01433
     C**                                                                  S01433
     C**   ADD AMOUNT INTO THIS PERIOD                                    S01433
     C           BPXP,D    ADD  DLAMTF    BPXP,D                          S01433
     C**                                                                  S01433
     C**   LOOP AGAIN TO ADD AMOUNT INTO NEXT PERIOD IF                   S01433
     C**   - VALUE DATE EXCEEDS THIS END OF PERIOD DATE.                  S01433
     C**   - LESS THAN SIX PERIODS HAVE BEEN USED.                        S01433
     C           DLVALU    COMP BPDT,D               88                   S01433
     C           D         COMP 6                      87                 S01433
     C   87 88             GOTO EXPPB1                                    S01433
     C**                                                                  S01433
     C           EXPPB9    ENDSR                           **  EXPPB9  ** S01433
     C********************************************************************S01433
     C**                                                                  S01433
     C**   BRANCH LEVEL  LIMITS
     C*****EXPLB**SR. CALCULATES EXPOSURE FOR A LOAN DEAL.                S01433
     C**   EXPLB  SR. CALCULATES EXPOSURE FOR A MONEY MARKET DEAL.        S01433
0638 C**
0639 C           EXPLB     BEGSR                           **  EXPLB   **
     C/COPY WNCPYSRC,DL0762AC09
0640 C**
0648 C**
0649 C**   LOOP TO ADD AMOUNT INTO EVERY PERIOD PRECEDING & INCLUDING
0650 C**   THE PERIOD WHICH INCLUDES THE MATURITY DATE.
0651 C                     Z-ADD0         D       20
0652 C           EXPLB1    TAG                             **  EXPLB1  **
     C/COPY WNCPYSRC,DL0762AC10
      *                                                                   CDL006
      ** If CDL006 is installed and deal type is FL, DP or LP             CDL006
      *                                                                   CDL006
     C           CDL006    IFEQ 'Y'                                       CDL006
     C           DLNO      CHAINDEALSDCF             85                   CDL006
     C           DTYP      IFEQ 'FL'                                      CDL006
     C           DTYP      OREQ 'DP'                                      CDL006
     C           DTYP      OREQ 'LP'                                      CDL006
      *                                                                   CDL006
     C           D         ADD  1         D                               CDL006
      *                                                                   CDL006
      ** Add amount into this period                                      CDL006
      *                                                                   CDL006
     C           BBXP,D    ADD  DLAMTL    BBXP,D                          CDL006
      *                                                                   CDL006
      **   LOOP AGAIN TO ADD AMOUNT INTO NEXT PERIOD IF                   CDL006
      **   - MATURITY DATE EXCEEDS THIS END OF PERIOD DATE.               CDL006
      **   - LESS THAN SIX PERIODS HAVE BEEN USED                         CDL006
     C           DLMATD    COMP BBDT,D               88                   CDL006
     C           D         COMP 6                      87                 CDL006
     C   87 88             GOTO EXPLB1                                    CDL006
     C                     ENDIF                                          CDL006
     C                     ELSE                                           CDL006
0653 C           D         ADD  1         D
0654 C**
0655 C**   ADD AMOUNT INTO THIS PERIOD
     C********   BLXP,D    ADD  DLAMTL    BLXP,D                          S01433
     C           BMXP,D    ADD  DLAMTL    BMXP,D                          S01433
0657 C**
0658 C**   LOOP AGAIN TO ADD AMOUNT INTO NEXT PERIOD IF
0659 C**   - MATURITY DATE EXCEEDS THIS END OF PERIOD DATE.
0660 C**   - LESS THAN SIX PERIODS HAVE BEEN USED
     C********   DLMATD    COMP BLDT,D               88                   S01433
     C           DLMATD    COMP BMDT,D               88                   S01433
0662 C           D         COMP 6                      87
0663 C   87 88             GOTO EXPLB1
     C/COPY WNCPYSRC,DL0762AC11
     C                     ENDIF                                          CDL006
0664 C**
0665 C                     ENDSR
0666 C********************************************************************
     C/EJECT
0595 C********************************************************************
     C**   BRANCH LEVEL SR'S -
     C**      LMTB
     C********FXBWRT,LNBWRT                                               S01157
     C********EXSFB, EXSLB                                                S01157
     C**      FXBWRT,LNBWRT,FRBWRT,IRBWRT                                 S01157
     C**      EXSFB, EXSLB, EXSRB, EXSIB                                  S01157
0595 C********************************************************************
     C*   BRANCH LEVEL LIMITS
0472 C*     LMTB SR. SETS UP ARRAYS OF LIMIT PERIODS & AMOUNTS,
     C*****FOR*FX LIMITS AND LENDING LIMITS.                              S01433
     C* FOR FX LIMITS, MONEY MARKET LIMITS AND PRECIOUS METAL LIMITS      S01433
0474 C           LMTB      BEGSR                           **  LMTB *  *
     C                     MOVE *BLANK    FDESCB  7
     C                     MOVE *BLANK    PDESCB  7                       S01433
     C********             MOVE *BLANK    LDESCB  7                       S01433
     C                     MOVE *BLANK    MDESCB  7                       S01433
     C                     MOVE *BLANKS   RDESCB  7                       S01157
     C                     MOVE *BLANKS   IDESCB  7                       S01157
0475 C**
0476 C**   FIRST RESET ARRAYS TO ZEROES
3478 C                     Z-ADD0         BFDA
0478 C                     Z-ADD0         BFDT
0479 C                     Z-ADD0         BFLM
0480 C                     Z-ADD0         BFXP
0481 C                     Z-ADD0         BFXS
     C********             Z-ADD0         BLDA                            S01433
     C********             Z-ADD0         BLDT                            S01433
     C********             Z-ADD0         BLLM                            S01433
     C********             Z-ADD0         BLXP                            S01433
     C********             Z-ADD0         BLXS                            S01433
     C                     Z-ADD0         BMDA                            S01433
     C                     Z-ADD0         BMDT                            S01433
     C                     Z-ADD0         BMLM                            S01433
     C                     Z-ADD0         BMXP                            S01433
     C                     Z-ADD0         BMXS                            S01433
     C                     Z-ADD0         BPDA                            S01433
     C                     Z-ADD0         BPDT                            S01433
     C                     Z-ADD0         BPLM                            S01433
     C                     Z-ADD0         BPXP                            S01433
     C                     Z-ADD0         BPXS                            S01433
     C                     Z-ADD0         BFDA1   30                      S01433
     C                     Z-ADD0         BFDT1   50                      S01433
     C                     Z-ADD0         BFLM1   90                      S01433
     C                     Z-ADD0         BPDA1   30                      S01433
     C                     Z-ADD0         BPDT1   50                      S01433
     C                     Z-ADD0         BPLM1   90                      S01433
     C                     Z-ADD0         BFXS1                           S01433
     C                     Z-ADD0         BPXS1                           S01433
     C                     Z-ADD0         BFXP1                           S01433
     C                     Z-ADD0         BPXP1                           S01433
     C******               MOVE 'N'       FXSPB                                       S01433 BUG8901
     C                     MOVE 'Y'       FXSPB   1                                          BUG8901
     C                     MOVE 'N'       PMSPB                           S01433
     C/COPY WNCPYSRC,DL0762AC12
      *                                                                   CDL006
      ** If CDL006 is installed                                           CDL006
      *                                                                   CDL006
     C           CDL006    IFEQ 'Y'                                       CDL006
     C                     MOVE *BLANKS   FIDEF   1                       CDL006
     C                     MOVE *BLANKS   FIDESB  7                       CDL006
     C                     Z-ADD0         BBDA                            CDL006
     C                     Z-ADD0         BBDT                            CDL006
     C                     Z-ADD0         BBLM                            CDL006
     C                     Z-ADD0         BBXP                            CDL006
     C                     Z-ADD0         BBXS                            CDL006
     C                     END                                            CDL006
0489 C*
0491 C                     SETOF                     7576
0491 C                     SETOF                     79                   S01433
0492 C**
0494 C**
0495 C**   PROCESS FX LIMITS FIRST
     C** CASE 1 - LIVE, NON ZERO
     C** IF FX LIMIT TYPE NON ZERO & EXPIRY DATE GT RUN DATE (BJAKTX)
     C           FLTYB     IFNE *BLANKS
     C           FLEDB     IFGT BJRDNB
     C           FLEDB     OREQ 0
0513 C**
0518 C**   LMTB1   PROCESSES BFDAA - IF ANY ELEMENT IS BLANK OR 999       S01433
0519 C**   THE CORRESPONDING ELEMENTS IN BFDA & BFDT ARE SET TO NINES.    S01433
0520 C**   ELSE,BFDT IS CALCULATED BY ADDING RUN DATE (BJAKTX) TO BFDA,
0521 C**        BFLM,IS CALCULATED BY MULTIPLYING LIMIT AMOUNT BY BFPC
0522 C**
0523 C                     Z-ADD0         D       20
     C           BFDAA,1   IFEQ 'SP '                                     S01433
     C**********           MOVE 'Y'       FXSPB   1                                   S01433 BUG8901
     C                     END                                            S01433
0532 C********   BFDAA,1   COMP 'SP '                    75               S01433
0524 C           LMTB1     TAG                             ** LMTB1   **
0525 C**
0526 C           D         ADD  1         D
0527 C********** BFDAA,D   COMP '   '                    88               E309
     C           BFDAA,D   COMP 'SP '                    75               S01433
0527 C           BFDAA,D   COMP '000'                    88               E309
0528 C           BFDAA,D   COMP '999'                    87
0529 C**
0530 C   88                Z-ADD999       BFDA,D
     C  N88                MOVE BFDAA,D   BFDA,D                          S01433
0531 C*
0534 C**
0535 C           BFDA,D    ADD  BJRDNB    BFDT,D
0536 C   88
0537 COR 87                Z-ADD99999     BFDT,D
     C   88                                                               S01433
     COR 87                Z-ADD99999     BFDT1                           S01433
0538 C**
0539 C**N88***** FLAMB     MULT BFPC,D    BFLM,D                          S01433
0540 C**
     C           FXFAB     MULT BFPC,D    BFLM,D                          S01433
     C********** *IN75     IFEQ '1'                                                   S01433 BUG8901
     C           FLAMB     MULT BFPC,1    BFLM1                           S01433
     C**********           END                                                        S01433 BUG8901
0541 C           D         COMP 6                      86                 S01433
     C*                                                                   S01433
     C   75                Z-ADDSP        BFDA,1                          S01433
     C   75                Z-ADDSP        BFDA1                           S01433
     C   75      SP        ADD  BJRDNB    BFDT,1                          S01433
     C   75      SP        ADD  BJRDNB    BFDT1                           S01433
0542 C   86N87N88          GOTO LMTB1
     C**  GET EXPIRY DATE
     C                     MOVE FLEDB     ZDAYNO
     C                     EXSR ZDATE2
     C                     MOVE ZADATE    FDESCB
     C                     END
     C                     END
0543 C**
0500 C**   CASE 2-EXPIRED
0501 C**   - IF EXPIRED, SET FIRST PERIOD END DAYS & DATE TO NINES
0502 C**     & ZEROIZE AMOUNT
     C           FLEDB     IFLE BJRDNB
     C           FLEDB     ANDNE0
     C                     MOVE 'EXPIRED' FDESCB  7
0503 C                     Z-ADD999       BFDA,1
0504 C                     Z-ADD99999     BFDT,1
0505 C                     Z-ADD0         BFLM,1
     C                     END
0508 C**   CASE 3 - NO LIMIT
0509 C**   - IF FX LIMIT TYPE 0, NO DEFAULT FOR BRANCH
     C           FLTYB     IFEQ *BLANKS
     C                     MOVE 'NO LIM.' FDESCB
0503 C                     Z-ADD999       BFDA,1
0504 C                     Z-ADD99999     BFDT,1
0505 C                     Z-ADD0         BFLM,1
     C                     END
     C**                                                                  S01433
     C**   PROCESS PM LIMITS                                              S01433
     C** CASE 1 - LIVE, NON ZERO                                          S01433
     C** IF PM LIMIT TYPE NON ZERO & EXPIRY DATE GT RUN DATE (BJAKTX)     S01433
     C           PLTYB     IFNE *BLANKS                                   S01433
     C           PLEDB     IFGT BJRDNB                                    S01433
     C           PLEDB     OREQ 0                                         S01433
     C**                                                                  S01433
     C**   LMTB1   PROCESSES XPDAA - IF ANY ELEMENT IS BLANK OR 999       S01433
     C**   THE CORRESPONDING ELEMENTS IN XPDA & XPDT ARE SET TO NINES.    S01433
     C**   ELSE,XPDT IS CALCULATED BY ADDING RUN DATE (BJAKTX) TO XPDA,   S01433
     C**        XPLM,IS CALCULATED BY MULTIPLYING LIMIT AMOUNT BY XPPC    S01433
     C**                                                                  S01433
     C                     Z-ADD0         D       20                      S01433
     C           BPDAA,1   IFEQ 'SP '                                     S01433
     C                     MOVE 'Y'       PMSPB   1                       S01433
     C                     END                                            S01433
     C           LMTB1P    TAG                             ** LMTB1P  **  S01433
     C**                                                                  S01433
     C           D         ADD  1         D                               S01433
     C           BPDAA,D   COMP 'SP '                    79               S01433
     C           BPDAA,D   COMP '000'                    88               S01433
     C           BPDAA,D   COMP '999'                    87               S01433
     C**                                                                  S01433
     C   88                Z-ADD999       BPDA,D                          S01433
     C  N88                MOVE BPDAA,D   BPDA,D                          S01433
     C**                                                                  S01433
     C           BPDA,D    ADD  BJRDNB    BPDT,D                          S01433
     C   88                                                               S01433
     COR 87                Z-ADD99999     BPDT,D                          S01433
     C   88                                                               S01433
     COR 87                Z-ADD99999     BPDT1                           S01433
     C**                                                                  S01433
     C           PFAMB     MULT BPPC,D    BPLM,D                          S01433
     C           *IN79     IFEQ '1'                                       S01433
     C           PSAMB     MULT BPPC,1    BPLM1                           S01433
     C                     END                                            S01433
     C*                                                                   S01433
     C           D         COMP 6                      86                 S01433
     C   79                Z-ADDSP        BPDA,1                          S01433
     C   79                Z-ADDSP        BPDA1                           S01433
     C   79      SP        ADD  BJRDNB    BPDT,1                          S01433
     C   79      SP        ADD  BJRDNB    BPDT1                           S01433
     C   86N87N88          GOTO LMTB1P                                    S01433
     C**  GET EXPIRY DATE                                                 S01433
     C                     MOVE PLEDB     ZDAYNO                          S01433
     C                     EXSR ZDATE2                                    S01433
     C                     MOVE ZADATE    PDESCB                          S01433
     C                     END                                            S01433
     C                     END                                            S01433
     C**                                                                  S01433
     C**   CASE 2-EXPIRED                                                 S01433
     C**   - IF EXPIRED, SET FIRST PERIOD END DAYS & DATE TO NINES        S01433
     C**     & ZEROIZE AMOUNT                                             S01433
     C           PLEDB     IFLE BJRDNB                                    S01433
     C           PLEDB     ANDNE0                                         S01433
     C                     MOVE 'EXPIRED' PDESCB  7                       S01433
     C                     Z-ADD999       BPDA,1                          S01433
     C                     Z-ADD99999     BPDT,1                          S01433
     C                     Z-ADD0         BPLM,1                          S01433
     C                     END                                            S01433
     C**   CASE 3 - NO LIMIT                                              S01433
     C**   - IF PM LIMIT TYPE 0, NO DEFAULT FOR BRANCH                    S01433
     C           PLTYB     IFEQ *BLANKS                                   S01433
     C                     MOVE 'NO LIM.' PDESCB                          S01433
     C                     Z-ADD999       BPDA,1                          S01433
     C                     Z-ADD99999     BPDT,1                          S01433
     C                     Z-ADD0         BPLM,1                          S01433
     C                     END                                            S01433
0545 C**
     C*****PROCESS LENDING LIMITS.                                        S01433
     C**   PROCESS MONEY MARKET LIMITS.                                   S01433
0569 C**
0565 C**   CASE 1 - LIVE, NON ZERO
     C*****IF*LN LIMIT TYPE NON ZERO & EXPIRY DATE GT RUN DATE (BJAKTX)   S01433
     C**   IF MM LIMIT TYPE NON ZERO & EXPIRY DATE GT RUN DATE (BJAKTX)   S01433
     C********   LLTYB     IFNE *BLANKS                                   S01433
     C********   LLEDB     IFGT BJRDNB                                    S01433
     C********   LLEDB     OREQ 0                                         S01433
     C           MMTYB     IFNE *BLANKS                                   S01433
     C           MMEDB     IFGT BJRDNB                                    S01433
     C           MMEDB     OREQ 0                                         S01433
     C**
     C*****LMTB2***PROCESSES BLDAA IN THE SAME WAY AS LMTB1               S01433
     C**   LMTB2   PROCESSES BMDAA IN THE SAME WAY AS LMTB1               S01433
     C********   BLDAA,1   COMP 'SP '                    76               S01433
     C********   BMDAA,1   COMP 'SP '                    76               S01433
0570 C                     Z-ADD0         D
0572 C           LMTB2     TAG                             **  LMTB2   **
0573 C**
0574 C           D         ADD  1         D
     C           BMDAA,D   COMP 'SP '                    76               S01433
0575 C********** BLDAA,D   COMP '   '                    88               E309
     C********   BLDAA,D   COMP '000'                    88               S01433
     C********   BLDAA,D   COMP '999'                    87               S01433
     C           BMDAA,D   COMP '000'                    88               S01433
     C           BMDAA,D   COMP '999'                    87               S01433
0577 C**
     C***88**              Z-ADD999       BLDA,D                          S01433
     C**N88**              MOVE BLDAA,D   BLDA,D                          S01433
     C   88                Z-ADD999       BMDA,D                          S01433
     C  N88                MOVE BMDAA,D   BMDA,D                          S01433
0579 C*
0582 C**
     C********   BLDA,D    ADD  BJRDNB    BLDT,D                          S01433
     C           BMDA,D    ADD  BJRDNB    BMDT,D                          S01433
0584 C   88
     C*R*87**              Z-ADD99999     BLDT,D                          S01433
     COR 87                Z-ADD99999     BMDT,D                          S01433
0586 C**
     C**N88***** LLAMB     MULT BLPC,D    BLLM,D                          S01433
     C  N88      MMAMB     MULT BMPC,D    BMLM,D                          S01433
0588 C**
0589 C           D         COMP 6                      86                 S01433
     C   76                Z-ADDSP        BMDA,1                          S01433
     C   76      SP        ADD  BJRDNB    BMDT,1                          S01433
0590 C   86N87N88          GOTO LMTB2
     C***76**              Z-ADDSP        BLDA,1                          S01433
     C***76**    SP        ADD  BJRDNB    BLDT,1                          S01433
     C**  GET EXPIRY DATE
     C********             MOVE LLEDB     ZDAYNO                          S01433
     C                     MOVE MMEDB     ZDAYNO                          S01433
     C                     EXSR ZDATE2
     C********             MOVE ZADATE    LDESCB                          S01433
     C                     MOVE ZADATE    MDESCB                          S01433
     C                     END
     C                     END
0591 C**
0552 C**   CASE 2 - EXPIRED
0553 C**   - IF EXPIRED, SET FIRST PERIOD END DAYS & DATE TO NINES
0554 C**     & ZEROISE AMOUNT
     C********   LLEDB     IFLE BJRDNB                                    S01433
     C********   LLEDB     ANDNE0                                         S01433
     C********             MOVE 'EXPIRED' LDESCB  7                       S01433
     C********             Z-ADD999       BLDA,1                          S01433
     C********             Z-ADD99999     BLDT,1                          S01433
     C********             Z-ADD0         BLLM,1                          S01433
     C           MMEDB     IFLE BJRDNB                                    S01433
     C           MMEDB     ANDNE0                                         S01433
     C                     MOVE 'EXPIRED' MDESCB  7                       S01433
     C                     Z-ADD999       BMDA,1                          S01433
     C                     Z-ADD99999     BMDT,1                          S01433
     C                     Z-ADD0         BMLM,1                          S01433
0559 C                     END                                         **
     C**
0560 C**   CASE 3 - NO  LIMIT
0561 C**   - IF LIMIT TYPE 0, NO DEFAULT FOR BRANCH
     C********   LLTYB     IFEQ *BLANKS                                   S01433
     C********             MOVE 'NO LIM.' LDESCB                          S01433
     C********             Z-ADD999       BLDA,1                          S01433
     C********             Z-ADD99999     BLDT,1                          S01433
     C********             Z-ADD0         BLLM,1                          S01433
     C           MMTYB     IFEQ *BLANKS                                   S01433
     C                     MOVE 'NO LIM.' MDESCB                          S01433
     C                     Z-ADD999       BMDA,1                          S01433
     C                     Z-ADD99999     BMDT,1                          S01433
     C                     Z-ADD0         BMLM,1                          S01433
     C                     END
     C/COPY WNCPYSRC,DL0762AC13
      *                                                                   CDL006
      ** If CDL006 is installed, process Fiduciary limits                 CDL006
      ** Case 1 - Live, non zero                                          CDL006
      ** If FI Limit type non zero & expiry date GT Rundate               CDL006
      *                                                                   CDL006
     C           CDL006    IFEQ 'Y'                                       CDL006
     C           FIFILT    IFNE 0                                         CDL006
     C           MMEDB     IFGT BJRDNB                                    CDL006
     C           MMEDB     OREQ 0                                         CDL006
     C                     Z-ADD0         D                               CDL006
     C           LMTBFI    TAG                                            CDL006
      *                                                                   CDL006
     C           D         ADD  1         D                               CDL006
     C           BBDAA,D   COMP 'SP '                    76               CDL006
     C           BBDAA,D   COMP '000'                    88               CDL006
     C           BBDAA,D   COMP '999'                    87               CDL006
      *                                                                   CDL006
     C   88                Z-ADD999       BBDA,D                          CDL006
     C  N88                MOVE BBDAA,D   BBDA,D                          CDL006
      *                                                                   CDL006
     C           BBDA,D    ADD  BJRDNB    BBDT,D                          CDL006
     C   88                                                               CDL006
     COR 87                Z-ADD99999     BBDT,D                          CDL006
      *                                                                   CDL006
     C  N88      FIFILA    MULT BBPC,D    BBLM,D                          CDL006
      *                                                                   CDL006
     C           D         COMP 6                      86                 CDL006
     C   76                Z-ADDSP        BBDA,1                          CDL006
     C   76      SP        ADD  BJRDNB    BBDT,1                          CDL006
     C   86N87N88          GOTO LMTBFI                                    CDL006
      *                                                                   CDL006
      ** Get Expriy Date                                                  CDL006
      *                                                                   CDL006
     C                     MOVE MMEDB     ZDAYNO                          CDL006
     C                     EXSR ZDATE2                                    CDL006
     C                     MOVE ZADATE    FIDESB                          CDL006
     C                     END                                            CDL006
     C                     END                                            CDL006
      *                                                                   CDL006
      ** Case 2 - Expired                                                 CDL006
      ** If expired, set first period end days & date to nines            CDL006
      ** & zeroise amount                                                 CDL006
      *                                                                   CDL006
     C           MMEDB     IFLE BJRDNB                                    CDL006
     C           MMEDB     ANDNE0                                         CDL006
     C                     MOVE 'EXPIRED' FIDESB  7                       CDL006
     C                     Z-ADD999       BBDA,1                          CDL006
     C                     Z-ADD99999     BBDT,1                          CDL006
     C                     Z-ADD0         BBLM,1                          CDL006
     C                     END                                            CDL006
      *                                                                   CDL006
      ** Case 3 - No limit                                                CDL006
      ** If Limit type 0, No default for branch                           CDL006
      *                                                                   CDL006
     C           MMTYB     IFEQ *BLANKS                                   CDL006
     C                     MOVE 'NO LIM.' FIDESB                          CDL006
     C                     Z-ADD999       BBDA,1                          CDL006
     C                     Z-ADD99999     BBDT,1                          CDL006
     C                     Z-ADD0         BBLM,1                          CDL006
     C                     END                                            CDL006
     C                     END                                            CDL006
      *                                                                   S01157
      *   PROCESS FRA LIMITS ===> CASE 1 - Live, Non Zero                 S01157
      *   ------------------                                              S01157
      *                                                                   S01157
      ** If Expiry Date GT Rundate...                                     S01157
      *                                                                   S01157
     C           RLEDB     IFGT BJRDNB                                    S01157
     C           RLEDB     OREQ 0                                         S01157
      *                                                                   S01157
      *   Get Expiry Date                                                 S01157
      *                                                                   S01157
     C                     Z-ADDRLAMB     BRLM    90                      S01157
     C                     MOVE RLEDB     ZDAYNO                          S01157
     C                     EXSR ZDATE2                                    S01157
     C                     MOVE ZADATE    RDESCB                          S01157
      *                                                                   S01157
     C                     END                                            S01157
      *                                                                   S01157
      *   PROCESS FRA LIMITS ===> CASE 2 - Expired                        S01157
      *   ------------------                                              S01157
      *                                                                   S01157
      ** If Expired, Set Description field.                               S01157
      *                                                                   S01157
     C           RLEDB     IFLE BJRDNB                                    S01157
     C           RLEDB     ANDNE0                                         S01157
     C                     MOVE 'EXPIRED' RDESCB  7                       S01157
     C                     Z-ADD0         BRLM                            LN0632
     C                     END                                            S01157
      *                                                                   S01157
      *   PROCESS FRA LIMITS ===> CASE 3 - No Limit                       S01157
      *   ------------------                                              S01157
      *                                                                   S01157
      ** If limit amount blank...                                         S01157
      *                                                                   S01157
     C           RLAMB     IFEQ 0                                         S01157
      *                                                                   S01157
     C*********************MOVE 'Y'       RDEF                     S01157 LN0632
     C*********************MOVE 'DEFAULT' RDESCB                   S01157 LN0632
     C                     MOVE 'NO LIM.' RDESCB                          LN0632
     C                     END                                            S01157
      *                                                                   S01157
      *   PROCESS IRS LIMITS ===> CASE 1 - Live, Non Zero                 S01157
      *   ------------------                                              S01157
      *                                                                   S01157
      ** If Expiry Date GT Rundate...                                     S01157
      *                                                                   S01157
     C           ILEDB     IFGT BJRDNB                                    S01157
     C           ILEDB     OREQ 0                                         S01157
      *                                                                   S01157
      *   Get Expiry Date                                                 S01157
      *                                                                   S01157
     C                     Z-ADDILAMB     BILM    90                      S01157
     C                     MOVE ILEDB     ZDAYNO                          S01157
     C                     EXSR ZDATE2                                    S01157
     C                     MOVE ZADATE    IDESCB                          S01157
      *                                                                   S01157
     C                     END                                            S01157
      *                                                                   S01157
      *   PROCESS IRS LIMITS ===> CASE 2 - Expired                        S01157
      *   ------------------                                              S01157
      *                                                                   S01157
      ** If Expired, Set Description field.                               S01157
      *                                                                   S01157
     C           ILEDB     IFLE BJRDNB                                    S01157
     C           ILEDB     ANDNE0                                         S01157
     C                     MOVE 'EXPIRED' IDESCB  7                       S01157
     C                     Z-ADD0         BILM                            LN0632
     C                     END                                            S01157
      *                                                                   S01157
      *   PROCESS IRS LIMITS ===> CASE 3 - No Limit                       S01157
      *   ------------------                                              S01157
      *                                                                   S01157
      ** If limit amount blank...                                         S01157
      *                                                                   S01157
     C           ILAMB     IFEQ 0                                         S01157
      *                                                                   S01157
     C*********************MOVE 'Y'       IDEF                     S01157 LN0632
     C*********************MOVE 'DEFAULT' IDESCB                   S01157 LN0632
     C                     MOVE 'NO LIM.' IDESCB                          LN0632
     C                     END                                            S01157
     C**                                                                  S01157
     C**
0593 C                     ENDSR                                       **
0594 C**
     C********************************************************************S01157
      /EJECT                                                              S01157
0667 C********************************************************************
     C**   BRANCH LEVEL LIMITS
0668 C**   EXSFB  SR. WORKS OUT EXCESS EXPOSURE FOR FX
0669 C**   -FIRST ROUNDS EXPOSURE FOR EACH PERIOD TO NEAREST 1000 UNITS
0670 C**   -THEN COMPARES EXPOSURE AMOUNTS TO CORRESP. LIMIT AMOUNTS.
0671 C           EXSFB     BEGSR                           **  EXSFB   **
     C           BFXP1     DIV  1000      BFXP1     H                     S01433
     C   60      BFXP1     COMP 0                        60               S01433
     C           BFXP1     COMP BFLM1                89                   S01433
     C   89                SETON                     70                   S01433
     C   89      BFXP1     SUB  BFLM1     BFXS1  100                      S01433
0672 C                     Z-ADD0         D
0673 C           EXSFB1    TAG                             **  EXSFB1  **
0674 C           D         ADD  1         D
0675 C           BFXP,D    DIV  1000      BFXP,D    H
     C   60      BFXP,D    COMP 0                        60
0676 C           BFXP,D    COMP BFLM,D               89
0677 C   89      BFXP,D    SUB  BFLM,D    BFXS,D
     C   89                SETON                     70
0678 C**
0679 C**   LOOP ROUND AGAIN IF LESS THAN 6 PERIODS HAVE BEEN PROCESSED
0680 C           D         COMP 6                      89
0681 C   89                GOTO EXSFB1
0682 C                     ENDSR
0683 C**
      /EJECT                                                              S01433
     C********************************************************************S01433
     C**   BRANCH LEVEL LIMITS                                            S01433
     C**   EXSPB  SR. WORKS OUT EXCESS EXPOSURE FOR PM                    S01433
     C**   -FIRST ROUNDS EXPOSURE FOR EACH PERIOD TO NEAREST 1000 UNITS   S01433
     C**   -THEN COMPARES EXPOSURE AMOUNTS TO CORRESP. LIMIT AMOUNTS.     S01433
     C           EXSPB     BEGSR                           **  EXSPB   ** S01433
     C           BPXP1     DIV  1000      BPXP1     H                     S01433
     C   60      BPXP1     COMP 0                        60               S01433
     C           BPXP1     COMP BPLM1                89                   S01433
     C   89                SETON                     70                   S01433
     C   89      BPXP1     SUB  BPLM1     BPXS1  100                      S01433
     C                     Z-ADD0         D                               S01433
     C           EXSPB1    TAG                             **  EXSPB1  ** S01433
     C           D         ADD  1         D                               S01433
     C           BPXP,D    DIV  1000      BPXP,D    H                     S01433
     C   60      BPXP,D    COMP 0                        60               S01433
     C           BPXP,D    COMP BPLM,D               89                   S01433
     C   89      BPXP,D    SUB  BPLM,D    BPXS,D                          S01433
     C   89                SETON                     70                   S01433
0678 C**                                                                  S01433
0679 C**   LOOP ROUND AGAIN IF LESS THAN 6 PERIODS HAVE BEEN PROCESSED    S01433
0680 C           D         COMP 6                      89                 S01433
0681 C   89                GOTO EXSPB1                                    S01433
0682 C                     ENDSR                                          S01433
0683 C**                                                                  S01433
0685 C********************************************************************
     C**   BRANCH LEVEL LIMITS
     C*****EXSLB  SR. WORKS OUT EXCESS EXPOSURE FOR LOANS.                S01433
     C**   EXSLB  SR. WORKS OUT EXCESS EXPOSURE FOR MONEY MARKET          S01433
0687 C           EXSLB     BEGSR                           **  EXSLB **
0688 C                     Z-ADD0         D
0689 C           EXSLB1    TAG                             **  EXSLB1  **
0690 C           D         ADD  1         D
     C********   BLXP,D    DIV  1000      BLXP,D    H                     S01433
     C***60***   BLXP,D    COMP 0                        60               S01433
     C********   BLXP,D    COMP BMLM,D               89                   S01433
     C***89***   BLXP,D    SUB  BMLM,D    BMXS,D                          S01433
     C           BMXP,D    DIV  1000      BMXP,D    H                     S01433
     C   60      BMXP,D    COMP 0                        60               S01433
     C           BMXP,D    COMP BMLM,D               89                   S01433
     C   89      BMXP,D    SUB  BMLM,D    BMXS,D                          S01433
     C   89                SETON                     70
0694 C**
0695 C           D         COMP 6                      89
0696 C   89                GOTO EXSLB1
     C/COPY WNCPYSRC,DL0762AC14
      *                                                                   CDL006
      ** If CDL006 is installed                                           CDL006
      *                                                                   CDL006
     C           CDL006    IFEQ 'Y'                                       CDL006
     C                     Z-ADD0         D                               CDL006
     C           EXSLB2    TAG                                            CDL006
     C           D         ADD  1         D                               CDL006
     C           BBXP,D    DIV  1000      BBXP,D    H                     CDL006
     C   60      BBXP,D    COMP 0                        60               CDL006
     C           BBXP,D    COMP BBLM,D               89                   CDL006
     C   89      BBXP,D    SUB  BBLM,D    BBXS,D                          CDL006
     C   89                SETON                     70                   CDL006
      *                                                                   CDL006
     C           D         COMP 6                      89                 CDL006
     C   89                GOTO EXSLB2                                    CDL006
      *                                                                   CDL006
     C                     ENDIF                                          CDL006
0697 C                     ENDSR
0698 C**
0699 C********************************************************************
      /EJECT                                                              S01157
      ********************************************************************S01157
      *                                                                  *S01157
      *    EXSRB - CALCULATE FRA EXCESS EXPOSURE                         *S01157
      *          - BRANCH LEVEL                                          *S01157
      ********************************************************************S01157
      *                                                                   S01157
     C           EXSRB     BEGSR                           ** EXSRB **    S01157
      *                                                                   S01157
      ** FRA EVENT                                                        S01157
      ** Convert exposure amount to thousands first                       S01157
     C           RBPOS     DIV  1000      RBPOS     H                     S01157
     C           RBPOS     SUB  BRLM      BRXS                            S01157
     C           BRXS      IFLT 0                                         S01157
     C                     Z-ADD0         BRXS   100                      S01157
     C                     ELSE                                           S01157
     C                     SETON                         70               S01157
     C                     END                                            S01157
      *                                                                   S01157
      ** If exposure is non-zero, then set-off ind 60                     S01157
     C           RBPOS     IFGT 0                                         S01157
     C                     MOVE '0'       *IN60                           S01157
     C                     END                                            S01157
      *                                                                   S01157
     C                     ENDSR                           *** EXSRB ***  S01157
      *                                                                   S01157
      ********************************************************************S01157
      /EJECT                                                              S01157
      ********************************************************************S01157
      *                                                                  *S01157
      *    EXSIB - CALCULATE IRS EXCESS EXPOSURE                         *S01157
      *          - BRANCH LEVEL                                          *S01157
      *                                                                  *S01157
      ********************************************************************S01157
      *                                                                   S01157
     C           EXSIB     BEGSR                           ** EXSIB **    S01157
      *                                                                   S01157
      ** IRS EVENT                                                        S01157
      ** Convert exposure amount to thousands first                       S01157
     C           IBPOS     DIV  1000      IBPOS     H                     S01157
     C           IBPOS     SUB  BILM      BIXS                            S01157
     C           BIXS      IFLT 0                                         S01157
     C                     Z-ADD0         BIXS   100                      S01157
     C                     ELSE                                           S01157
     C                     SETON                         70               S01157
     C                     END                                            S01157
      *                                                                   S01157
      ** If exposure is non-zero, then set-off ind 60                     S01157
     C           IBPOS     IFGT 0                                         S01157
     C                     MOVE '0'       *IN60                           S01157
     C                     END                                            S01157
      *                                                                   S01157
     C                     ENDSR                           *** EXSIB ***  S01157
      *                                                                   S01157
      ********************************************************************S01157
      /EJECT                                                              S01157
0684 C********************************************************************
     C**   FORMAT & OUTPUT CUST/BR  LIMIT & EXPOSURE  FOR FX
     C**
     C           FXBWRT    BEGSR                            ** FXBWRT **
     C                     SETON                     60
     C                     SETOF                     70
     C**   CALC EXCESS, CHECK FOR ZERO EXPOSURE
     C                     EXSR EXSFB
0459 C**
     C**   IF NOT ZERO, PRINT. IN60 STILL ON IF ZERO
     C           *IN60     IFNE '1'
0295 C**                                                               ***
     C**   IF U1 NOT ON, PRINT EVEN IF EXPOSURE LESS THAN LIMIT.
     C**    IF U1 ON, ONLY PRINT IF EXPOSURE GREATER THAN LIMIT.
     C           *INU1     IFEQ '0'
     C           *INU1     OREQ '1'
     C           *IN70     ANDEQ'1'
0430 C**
0431 C**   PRINT DETAILS
0432 C                     Z-ADD0         D
     C**
0433 C           D         DOUEQ6                                      **
     C                     ADD  1         D                               S01433
     C           D         IFEQ 1                                         S01433
     C********** BFDAA,1   ANDEQ'SP'                                      S01433
     C********** FXSPB     ANDEQ'Y'                                                   S01433 BUG8901
     C**   MOVE EXPOSURE AMT. TO 10 DIGIT FIELD                           S01433
     C**********           Z-ADDBFXP1     BFPOS                           S01433
     C                     Z-ADDBFXP1     BFPOSS 100                      S01433
     C**********           ELSE                                           S01433
     C                     END                                            S01433
0442 C**   MOVE EXPOSURE AMT. TO 10 DIGIT FIELD
0443 C                     Z-ADDBFXP,D    BFPOS  100                      S01433
     C**********           END                                            S01433
0446 C**   PRINT 1ST LINE
     C           D         IFEQ 1                                         S01433
     C**   PRINT CUST IF NOT ALREADY DONE
     C           NAMPRT    IFEQ 'N'
     C           PTNU      COMP *BLANK                   45
     C  N45      PTNU      COMP '000000'                 45
     C                     EXCPTCUSTO
     C                     MOVE 'Y'       NAMPRT
     C                     END
     C**
     C********             EXCPTBFLIN1                                    S01433
     C********   BFDAA,D   IFEQ 'SP'                                      S01433
     C********** FXSPB     IFEQ 'Y'                                                   S01433 BUG8901
     C                     EXCPTBFLN1S                                    S01433
     C                     EXCPTBFLN1F                                    S01433
     C**********           ELSE                                                       S01433 BUG8901
     C**********           EXCPTBFLN1F                                                S01433 BUG8901
     C**********           END                                                        S01433 BUG8901
     C                     ADD  1         RLIST   50
     C                     ELSE
0437 C**   PRINT LINES 2-6 IF REQD
0438 C**   - TEST IF PERIOD END DATE ZERO
0439 C           BFDT,D    COMP 0                    53    PRINT
0447 C   53                EXCPTBFLIN2
     C                     END                                            S01433
0448 C**
0449 C**   - CALCULATE NEXT START OF PERIOD
0450 C           BFDA,D    ADD  1         NEXTF   30
0452 C**
     C                     END
     C                     END                             *inu1=1
     C                     END
     C                     ENDSR
     C**
      /EJECT                                                              S01433
     C********************************************************************S01433
     C**   FORMAT & OUTPUT CUST/BR  LIMIT & EXPOSURE FOR PM               S01433
     C**                                                                  S01433
     C           PMBWRT    BEGSR                            ** PMBWRT **  S01433
     C                     SETON                     60                   S01433
     C                     SETOF                     70                   S01433
     C**   CALC EXCESS, CHECK FOR ZERO EXPOSURE                           S01433
     C                     EXSR EXSPB                                     S01433
     C**                                                                  S01433
     C**   IF NOT ZERO, PRINT. IN60 STILL ON IF ZERO                      S01433
     C           *IN60     IFNE '1'                                       S01433
     C**                                                               ***S01433
     C**   IF U1 NOT ON, PRINT EVEN IF EXPOSURE LESS THAN LIMIT.          S01433
     C**    IF U1 ON, ONLY PRINT IF EXPOSURE GREATER THAN LIMIT.          S01433
     C           *INU1     IFEQ '0'                                       S01433
     C           *INU1     OREQ '1'                                       S01433
     C           *IN70     ANDEQ'1'                                       S01433
     C**                                                                  S01433
     C**   PRINT DETAILS                                                  S01433
     C                     Z-ADD0         D                               S01433
     C**                                                                  S01433
     C           D         DOUEQ6                                         S01433
     C                     ADD  1         D                               S01433
     C           D         IFEQ 1                                         S01433
     C********** BPDAA,1   ANDEQ'SP'                                      S01433
     C           PMSPB     ANDEQ'Y'                                       S01433
     C**   MOVE EXPOSURE AMT. TO 10 DIGIT FIELD                           S01433
     C**********           Z-ADDBPXP1     BPPOS  100                      S01433
     C                     Z-ADDBPXP1     BPPOSS 100                      S01433
     C**********           ELSE                                           S01433
     C                     END                                            S01433
     C**   MOVE EXPOSURE AMT. TO 10 DIGIT FIELD                           S01433
     C                     Z-ADDBPXP,D    BPPOS  100                      S01433
     C**********           END                                            S01433
     C**   PRINT 1ST LINE                                                 S01433
     C           D         IFEQ 1                                         S01433
     C**   PRINT CUST IF NOT ALREADY DONE                                 S01433
     C           NAMPRT    IFEQ 'N'                                       S01433
     C           PTNU      COMP *BLANK                   45               S01433
     C  N45      PTNU      COMP '000000'                 45               S01433
     C                     EXCPTCUSTO                                     S01433
     C                     MOVE 'Y'       NAMPRT                          S01433
     C                     END                                            S01433
     C**                                                                  S01433
     C********** BPDAA,D   IFEQ 'SP'                                      S01433
     C           PMSPB     IFEQ 'Y'                                       S01433
     C                     EXCPTBPLN1S                                    S01433
     C                     EXCPTBPLN1F                                    S01433
     C                     ELSE                                           S01433
     C                     EXCPTBPLN1F                                    S01433
     C                     END                                            S01433
     C                     ADD  1         RLIST   50                      S01433
     C                     ELSE                                           S01433
     C**   PRINT LINES 2-6 IF REQD                                        S01433
     C**   - TEST IF PERIOD END DATE ZERO                                 S01433
     C           BPDT,D    COMP 0                    55    PRINT          S01433
     C   55                EXCPTBPLIN2                                    S01433
     C                     END                                            S01433
     C**                                                                  S01433
     C**   - CALCULATE NEXT START OF PERIOD                               S01433
     C           BPDA,D    ADD  1         NEXTP   30                      S01433
     C**                                                                  S01433
     C                     END                                            S01433
     C                     END                                            S01433
     C                     END                                            S01433
     C                     ENDSR                                          S01433
     C**                                                                  S01433
0595 C********************************************************************
     C*****FORMAT & OUTPUT CUST/BR  LIMIT & EXPOSURE  FOR LENDING         S01433
     C**   FORMAT & OUTPUT CUST/BR  LIMIT & EXPOSURE  FOR MONEY MARKET    S01433
     C**
     C           LNBWRT    BEGSR                            ** LNBWRT **
     C                     SETON                     60
     C                     SETOF                     70
     C**   CALC EXCESS, CHECK FOR ZERO EXPOSURE
     C                     EXSR EXSLB
0459 C**
     C**   IF NOT ZERO, PRINT. IN60 STILL ON IF ZERO
     C           *IN60     IFNE '1'
0295 C**                                                               ***
     C**   IF U1 NOT ON, PRINT EVEN IF EXPOSURE LESS THAN LIMIT.
     C**    IF U1 ON, ONLY PRINT IF EXPOSURE GREATER THAN LIMIT.
     C           *INU1     IFEQ '0'
     C           *INU1     OREQ '1'
     C           *IN70     ANDEQ'1'
0430 C**
0431 C**   PRINT DETAILS
0432 C                     Z-ADD0         D
     C**
0433 C           D         DOUEQ6                                      **
0434 C                     ADD  1         D
0442 C**   MOVE EXPOSURE AMT. TO 10 DIGIT FIELD
     C********             Z-ADDBLXP,D    LXPOS  100                      S01433
     C                     Z-ADDBMXP,D    LXPOS  100                      S01433
0446 C**   PRINT 1ST LINE
     C           D         IFEQ 1
     C**   PRINT CUST IF NOT ALREADY DONE
     C           NAMPRT    IFEQ 'N'
     C           PTNU      COMP *BLANK                   45
     C  N45      PTNU      COMP '000000'                 45
     C                     EXCPTCUSTO
     C                     MOVE 'Y'       NAMPRT
     C                     END
     C**
0447 C                     EXCPTBLLIN1
     C                     ADD  1         RLIST   50
     C                     Z-ADD1         NEXTL                           S01433
     C                     ELSE
0437 C**   PRINT LINES 2-6 IF REQD
0438 C**   - TEST IF PERIOD END DATE ZERO
     C********   BLDT,D    COMP 0                    54    PRINT          S01433
     C           BMDT,D    COMP 0                    54    PRINT          S01433
0447 C   54                EXCPTBLLIN2
     C                     END
0448 C**
0449 C**   - CALCULATE NEXT START OF PERIOD
     C********   BLDA,D    ADD  1         NEXTL   30                      S01433
     C           BMDA,D    ADD  1         NEXTL   30                      S01433
0452 C**
     C                     END
     C/COPY WNCPYSRC,DL0762AC15
      *                                                                   CDL006
      ** If CDL006 is installed                                           CDL006
      *                                                                   CDL006
     C           CDL006    IFEQ 'Y'                                       CDL006
     C                     MOVE *ON       *IN80                           CDL006
     C                     Z-ADD0         D                               CDL006
      *                                                                   CDL006
     C           D         DOUEQ6                                         CDL006
     C                     ADD  1         D                               CDL006
      *                                                                   CDL006
      ** Move exposure amount to 10 digit field                           CDL006
      *                                                                   CDL006
     C                     Z-ADDBBXP,D    FIXPOS 100                      CDL006
      *                                                                   CDL006
      ** Print 1st line                                                   CDL006
      *                                                                   CDL006
     C           D         IFEQ 1                                         CDL006
      *                                                                   CDL006
      ** Print Cust if not already done                                   CDL006
      *                                                                   CDL006
     C           NAMPRT    IFEQ 'N'                                       CDL006
     C           PTNU      COMP *BLANK                   45               CDL006
     C  N45      PTNU      COMP '000000'                 45               CDL006
     C                     EXCPTCUSTO                                     CDL006
     C                     MOVE 'Y'       NAMPRT                          CDL006
     C                     END                                            CDL006
      **                                                                  CDL006
     C                     EXCPTBBLIN1                                    CDL006
     C                     ADD  1         RLIST   50                      CDL006
     C                     Z-ADD1         FIEXTL                          CDL006
     C                     ELSE                                           CDL006
      *                                                                   CDL006
      ** Print lines 2-6 if required                                      CDL006
      ** - Test if period end date zero                                   CDL006
      *                                                                   CDL006
     C           BBDT,D    COMP 0                    61    PRINT          CDL006
     C   61                EXCPTBBLIN2                                    CDL006
     C                     END                                            CDL006
      *                                                                   CDL006
      ** - Calculate next start of period                                 CDL006
      *                                                                   CDL006
     C           BBDA,D    ADD  1         FIEXTL  30                      CDL006
      *                                                                   CDL006
     C                     END                                            CDL006
     C                     END                                            CDL006
      *                                                                   CDL006
     C                     END                             *inu1=1
     C                     END
     C                     ENDSR
     C**
0595 C********************************************************************
      *                                                                  *S01157
      *    FRA - FORMAT & OUTPUT CUST/BR LIMIT & EXPOSURE                *S01157
      *                                                                  *S01157
      ********************************************************************S01157
      *                                                                   S01157
     C           FRBWRT    BEGSR                           ** FRBWRT **   S01157
      *                                                                   S01157
     C                     MOVE '1'       *IN60                           S01157
     C                     MOVE '0'       *IN70                           S01157
      *                                                                   S01157
      *  Calculate Excess Exposure, Check for Zero Exposure               S01157
     C                     EXSR EXSRB                                     S01157
      *                                                                   S01157
      *  If Not Zero, PRINT...*IN60 still ON if Zero                      S01157
     C           *IN60     IFNE '1'                                       S01157
      *                                                                   S01157
      *  If U1 NOT on, PRINT even if exposure LESS than Limit.            S01157
      *  If U1 on, only PRINT if exposure GREATER than Limit.             S01157
     C           *INU1     IFEQ '0'                                       S01157
     C           *INU1     OREQ '1'                                       S01157
     C           *IN70     ANDEQ'1'                                       S01157
      *                                                                   S01157
      *  Print Customer if not already done.                              S01157
     C           NAMPRT    IFEQ 'N'                                       S01157
     C           PTNU      COMP *BLANK                   45               062422
     C  N45      PTNU      COMP '000000'                 45               062422
     C                     EXCPTCUSTO                                     S01157
     C                     MOVE 'Y'       NAMPRT                          S01157
     C                     END                                            S01157
      *                                                                   S01157
      *  Print details.                                                   S01157
     C                     EXCPTBRLIN                                     S01157
      *                                                                   S01157
     C                     ADD  1         RLIST   50                      S01157
      *                                                                   S01157
      ***Initialise*exposure*field.***                             S01157 099251
     C***********          Z-ADD0         RBPOS                    S01157 099251
     C                     END                                            S01157
      *  Initialise exposure field.                                       099251
     C                     Z-ADD0         RBPOS                           099251
     C                     END                                            S01157
      *                                                                   S01157
     C                     ENDSR                           *** FRBWRT *** S01157
      *                                                                   S01157
      ********************************************************************S01157
      /EJECT                                                              S01157
      ********************************************************************S01157
      *                                                                  *S01157
      *    IRS - FORMAT & OUTPUT CUST/BR LIMIT & EXPOSURE                *S01157
      *                                                                  *S01157
      ********************************************************************S01157
      *                                                                   S01157
     C           IRBWRT    BEGSR                           ** IRBWRT **   S01157
      *                                                                   S01157
     C                     MOVE '1'       *IN60                           S01157
     C                     MOVE '0'       *IN70                           S01157
      *                                                                   S01157
      *  Calculate Excess Exposure, Check for Zero Exposure               S01157
     C                     EXSR EXSIB                                     S01157
      *                                                                   S01157
      *  If Not Zero, PRINT...*IN60 still ON if Zero                      S01157
     C           *IN60     IFNE '1'                                       S01157
      *                                                                   S01157
      *  If U1 NOT on, PRINT even if exposure LESS than Limit.            S01157
      *  If U1 on, only PRINT if exposure GREATER than Limit.             S01157
     C           *INU1     IFEQ '0'                                       S01157
     C           *INU1     OREQ '1'                                       S01157
     C           *IN70     ANDEQ'1'                                       S01157
      *                                                                   S01157
      *  Print Customer if not already done.                              S01157
     C           NAMPRT    IFEQ 'N'                                       S01157
     C           PTNU      COMP *BLANK                   45               062422
     C  N45      PTNU      COMP '000000'                 45               062422
     C                     EXCPTCUSTO                                     S01157
     C                     MOVE 'Y'       NAMPRT                          S01157
     C                     END                                            S01157
      *                                                                   S01157
      *  Print details.                                                   S01157
     C                     EXCPTBILIN                                     S01157
      *                                                                   S01157
     C                     ADD  1         RLIST   50                      S01157
      *                                                                   S01157
      ***Initialise*exposure*field.***                             S01157 099251
     C***********          Z-ADD0         IBPOS                    S01157 099251
     C                     END                                            S01157
      *  Initialise exposure field.                                       099251
     C                     Z-ADD0         IBPOS                           099251
     C                     END                                            S01157
      *                                                                   S01157
     C                     ENDSR                           *** IRBWRT *** S01157
      *                                                                   S01157
      ********************************************************************S01157
     C/EJECT
0595 C********************************************************************
     C**   COMPANY LEVEL SR'S -
     C**      LMTC
     C********FXCWRT,LNCWRT                                               S01157
     C********EXSFC, EXSLC                                                S01157
     C**      FXCWRT,LNCWRT,FRCWRT,IRCWRT                                 S01157
     C**      EXSFC, EXSLC, EXSRC, EXSIC                                  S01157
0595 C********************************************************************
     C*   COMPANY LEVEL LIMITS
0472 C*     LMTC SR. SETS UP ARRAYS OF LIMIT PERIODS & AMOUNTS,
     C*****FOR*FX*LIMITS AND LENDING LIMITS.                              S01433
     C*    FOR FX LIMITS AND MONEY MARKET LIMITS.                         S01433
0474 C           LMTC      BEGSR                           **  LMTC *  *
     C                     MOVE *BLANKS   FDESCC  7
     C                     MOVE *BLANKS   PDESCC  7                       S01433
     C********             MOVE *BLANKS   LDESCC  7                       S01433
     C                     MOVE *BLANKS   MDESCC  7                       S01433
     C                     MOVE *BLANKS   RDESCC  7                       S01157
     C                     MOVE *BLANKS   IDESCC  7                       S01157
     C                     MOVE *BLANKS   FDEF
     C                     MOVE *BLANKS   PDEF                            S01433
     C********             MOVE *BLANKS   LDEF                            S01433
     C                     MOVE *BLANKS   MDEF                            S01433
     C                     MOVE *BLANKS   RDEF    1                       S01157
     C                     MOVE *BLANKS   IDEF    1                       S01157
     C                     MOVE *BLANKS   ASTFC   1
     C                     MOVE *BLANKS   ASTPC   1                       S01433
     C********             MOVE *BLANKS   ASTLC   1                       S01433
     C                     MOVE *BLANKS   ASTMC   1                       S01433
     C**********           MOVE 'N'       FXSPC                                       S01433 BUG8901
     C                     MOVE 'Y'       FXSPC   1                                          BUG8901
     C                     MOVE 'N'       PMSPC                           S01433
0475 C**
0476 C**   FIRST RESET ARRAYS TO ZEROES
0478 C                     Z-ADD0         CFDA
0478 C                     Z-ADD0         CFDT
0479 C                     Z-ADD0         CFLM
0480 C                     Z-ADD0         CFXP
0481 C                     Z-ADD0         CFXS
     C********             Z-ADD0         CLDA                            S01433
     C********             Z-ADD0         CLDT                            S01433
     C********             Z-ADD0         CLLM                            S01433
     C********             Z-ADD0         CLXP                            S01433
     C********             Z-ADD0         CLXS                            S01433
     C                     Z-ADD0         CMDA                            S01433
     C                     Z-ADD0         CMDT                            S01433
     C                     Z-ADD0         CMLM                            S01433
     C                     Z-ADD0         CMXP                            S01433
     C                     Z-ADD0         CMXS                            S01433
     C                     Z-ADD0         CPDA                            S01433
     C                     Z-ADD0         CPDT                            S01433
     C                     Z-ADD0         CPLM                            S01433
     C                     Z-ADD0         CPXP                            S01433
     C                     Z-ADD0         CPXS                            S01433
     C                     Z-ADD0         CPDA1   30                      S01433
     C                     Z-ADD0         CPDT1   50                      S01433
     C                     Z-ADD0         CPLM1   90                      S01433
     C                     Z-ADD0         CFDA1   30                      S01433
     C                     Z-ADD0         CFDT1   50                      S01433
     C                     Z-ADD0         CFLM1   90                      S01433
     C                     Z-ADD0         CFXS1                           S01433
     C                     Z-ADD0         CPXS1                           S01433
     C                     Z-ADD0         CFXP1                           S01433
     C                     Z-ADD0         CPXP1                           S01433
     C/COPY WNCPYSRC,DL0762AC16
      *                                                                   CDL006
      ** If CDL006 is installed                                           CDL006
      *                                                                   CDL006
     C           CDL006    IFEQ 'Y'                                       CDL006
     C                     MOVE *BLANKS   FIDESC  7                       CDL006
     C                     Z-ADD0         CCDA                            CDL006
     C                     Z-ADD0         CCDT                            CDL006
     C                     Z-ADD0         CCLM                            CDL006
     C                     Z-ADD0         CCXP                            CDL006
     C                     Z-ADD0         CCXS                            CDL006
     C                     END                                            CDL006
0489 C*
0491 C                     SETOF                     7374                 S01433
     C                     SETOF                     77                   S01433
0494 C**
0495 C**   PROCESS FX LIMITS FIRST
0517 C**
     C** CASE 1 - LIVE, NON ZERO
     C** IF FX LIMIT TYPE NON ZERO & EXPIRY DATE GT RUN DATE (BJAKTX)
     C           FLTYC     IFNE *BLANKS
     C           FLEDC     IFGT BJRDNB
     C           FLEDC     OREQ 0
     C                     EXSR LMTCF
     C**  GET EXPIRY DATE
     C                     MOVE FLEDC     ZDAYNO
     C                     EXSR ZDATE2
     C                     MOVE ZADATE    FDESCC
     C                     END
     C                     END
0513 C**
0543 C**
0500 C**   CASE 2-EXPIRED
0501 C**   - IF EXPIRED, SET FIRST PERIOD END DAYS & DATE TO NINES
0502 C**     & ZEROIZE AMOUNT
     C           FLEDC     IFLE BJRDNB
     C           FLEDC     ANDNE0
     C                     MOVE 'EXPIRED' FDESCC  7
0503 C                     Z-ADD999       CFDA,1
     C                     Z-ADD999       CFDA1                           S01433
0504 C                     Z-ADD99999     CFDT,1
     C                     Z-ADD99999     CFDT1                           S01433
0505 C                     Z-ADD0         CFLM,1
     C                     Z-ADD0         CFLM1                           S01433
     C                     END
0508 C**   CASE 3 - NO LIMIT
0509 C**   - IF FX LIMIT TYPE 0, CONDITION DEFAULT
     C           FLTYC     IFEQ *BLANKS
     C                     MOVE 'Y'       FDEF    1
     C                     MOVE 'DEFAULT' FDESCC
     C                     END
     C**
0545 C**
     C*****PROCESS*LENDING LIMITS.                                        S01433
     C**   PROCESS MONEY MARKET LIMITS.                                   S01433
0569 C**
0565 C**   CASE 1 - LIVE, NON ZERO
     C*****IF*LN*LIMIT TYPE NON ZERO & EXPIRY DATE GT RUN DATE (BJAKTX)   S01433
     C**   IF MM LIMIT TYPE NON ZERO & EXPIRY DATE GT RUN DATE (BJAKTX)   S01433
     C********   LLTYC     IFNE *BLANKS                                   S01433
     C********   LLEDC     IFGT BJRDNB                                    S01433
     C********   LLEDC     OREQ 0                                         S01433
     C           MMTYC     IFNE *BLANKS                                   S01433
     C           MMEDC     IFGT BJRDNB                                    S01433
     C           MMEDC     OREQ 0                                         S01433
     C                     EXSR LMTCL
     C**  GET EXPIRY DATE
     C********             MOVE LLEDC     ZDAYNO                          S01433
     C                     MOVE MMEDC     ZDAYNO                          S01433
     C                     EXSR ZDATE2
     C********             MOVE ZADATE    LDESCC                          S01433
     C                     MOVE ZADATE    MDESCC                          S01433
     C                     END
     C                     END
     C**
0591 C**
0552 C**   CASE 2 - EXPIRED
0553 C**   - IF EXPIRED, SET FIRST PERIOD END DAYS & DATE TO NINES
0554 C**     & ZEROISE AMOUNT
     C********   LLEDC     IFLE BJRDNB                                    S01433
     C********   LLEDC     ANDNE0                                         S01433
     C********             MOVE 'EXPIRED' LDESCC  7                       S01433
     C********             Z-ADD999       CLDA,1                          S01433
     C********             Z-ADD99999     CLDT,1                          S01433
     C********             Z-ADD0         CLLM,1                          S01433
     C           MMEDC     IFLE BJRDNB                                    S01433
     C           MMEDC     ANDNE0                                         S01433
     C                     MOVE 'EXPIRED' MDESCC  7                       S01433
     C                     Z-ADD999       CMDA,1                          S01433
     C                     Z-ADD99999     CMDT,1                          S01433
     C                     Z-ADD0         CMLM,1                          S01433
0559 C                     END                                         **
     C**
0560 C**   CASE 3 - NO  LIMIT
0561 C**   - IF LIMIT TYPE 0, CONDITION DEFAULT
     C********   LLTYC     IFEQ *BLANKS                                   S01433
     C********             MOVE 'Y'       LDEF    1                       S01433
     C********             MOVE 'DEFAULT' LDESCC                          S01433
     C           MMTYC     IFEQ *BLANKS                                   S01433
     C                     MOVE 'Y'       MDEF    1                       S01433
     C                     MOVE 'DEFAULT' MDESCC                          S01433
     C                     END
     C/COPY WNCPYSRC,DL0762AC17
      *                                                                   CDL006
      ** If CDL006 is installed, process fiduciary limits                 CDL006
      ** Case 1 - Live, non zero                                          CDL006
      ** If FI Limit type non zero & expiry date GT rundate               CDL006
      *                                                                   CDL006
     C           CDL006    IFEQ 'Y'                                       CDL006
     C           FIFILT    IFNE 0                                         CDL006
     C           MMEDC     IFGT BJRDNB                                    CDL006
     C           MMEDC     OREQ 0                                         CDL006
     C                     EXSR LMTCI                                     CDL006
      *                                                                   CDL006
      ** Get expiry date                                                  CDL006
      *                                                                   CDL006
     C                     MOVE MMEDC     ZDAYNO                          CDL006
     C                     EXSR ZDATE2                                    CDL006
     C                     MOVE ZADATE    FIDESC                          CDL006
     C                     END                                            CDL006
     C                     END                                            CDL006
      *                                                                   CDL006
      ** Case 2 - Expired                                                 CDL006
      ** If Expired, set first period end days and date to nines          CDL006
      ** & Zeroise amount                                                 CDL006
      *                                                                   CDL006
     C           MMEDC     IFLE BJRDNB                                    CDL006
     C           MMEDC     ANDNE0                                         CDL006
     C                     MOVE 'EXPIRED' FIDESC  7                       CDL006
     C                     Z-ADD999       CCDA,1                          CDL006
     C                     Z-ADD99999     CCDT,1                          CDL006
     C                     Z-ADD0         CCLM,1                          CDL006
     C                     END                                            CDL006
      *                                                                   CDL006
      ** Case 3 - No limit                                                CDL006
      ** If Limit Type 0, condition default                               CDL006
      *                                                                   CDL006
     C           FIFILT    IFEQ 0                                         CDL006
     C                     MOVE 'Y'       FIDEF                           CDL006
     C                     MOVE 'DEFAULT' FIDESC  7                       CDL006
     C                     END                                            CDL006
     C                     END                                            CDL006
     C**
     C**   PROCESS PRECIOUS METAL LIMITS.                                 S01433
     C**                                                                  S01433
     C**   CASE 1 - LIVE, NON ZERO                                        S01433
     C**   IF PM LIMIT TYPE NON ZERO & EXPIRY DATE GT RUN DATE (BJAKTX)   S01433
     C           PLTYC     IFNE *BLANKS                                   S01433
     C           PLEDC     IFGT BJRDNB                                    S01433
     C           PLEDC     OREQ 0                                         S01433
     C                     EXSR LMTCP                                     S01433
     C**  GET EXPIRY DATE                                                 S01433
     C                     MOVE PLEDC     ZDAYNO                          S01433
     C                     EXSR ZDATE2                                    S01433
     C                     MOVE ZADATE    PDESCC                          S01433
     C                     END                                            S01433
     C                     END                                            S01433
     C**                                                                  S01433
     C**                                                                  S01433
     C**   CASE 2 - EXPIRED                                               S01433
     C**   - IF EXPIRED, SET FIRST PERIOD END DAYS & DATE TO NINES        S01433
     C**     & ZEROISE AMOUNT                                             S01433
     C           PLEDC     IFLE BJRDNB                                    S01433
     C           PLEDC     ANDNE0                                         S01433
     C                     MOVE 'EXPIRED' PDESCC  7                       S01433
     C                     Z-ADD999       CPDA,1                          S01433
     C                     Z-ADD99999     CPDT,1                          S01433
     C                     Z-ADD0         CPLM,1                          S01433
     C                     END                                         ** S01433
     C**                                                                  S01433
     C**   CASE 3 - NO  LIMIT                                             S01433
     C**   - IF LIMIT TYPE 0, CONDITION DEFAULT                           S01433
     C           PLTYC     IFEQ *BLANKS                                   S01433
     C                     MOVE 'Y'       PDEF    1                       S01433
     C                     MOVE 'DEFAULT' PDESCC                          S01433
     C                     END                                            S01433
     C**                                                                  S01433
     C**
      *                                                                   S01157
      *   PROCESS FRA LIMITS ===> CASE 1 - Live, Non Zero                 S01157
      *   ------------------                                              S01157
      *                                                                   S01157
      ** If Expiry Date GT Rundate...                                     S01157
      *                                                                   S01157
     C           RLEDC     IFGT BJRDNB                                    S01157
     C           RLEDC     OREQ 0                                         S01157
      *                                                                   S01157
      *   Get Expiry Date                                                 S01157
      *                                                                   S01157
     C                     Z-ADDRLAMC     CRLM    90                      S01157
     C                     MOVE RLEDC     ZDAYNO                          S01157
     C                     EXSR ZDATE2                                    S01157
     C                     MOVE ZADATE    RDESCC                          S01157
      *                                                                   S01157
     C                     END                                            S01157
      *                                                                   S01157
      *   PROCESS FRA LIMITS ===> CASE 2 - Expired                        S01157
      *   ------------------                                              S01157
      *                                                                   S01157
      ** If Expired, Set Description field.                               S01157
      *                                                                   S01157
     C           RLEDC     IFLE BJRDNB                                    S01157
     C           RLEDC     ANDNE0                                         S01157
     C                     MOVE 'EXPIRED' RDESCC  7                       S01157
     C                     Z-ADD0         CRLM                            LN0632
     C                     END                                            S01157
      *                                                                   S01157
      *   PROCESS FRA LIMITS ===> CASE 3 - No Limit                       S01157
      *   ------------------                                              S01157
      *                                                                   S01157
      ** If limit amount blank...                                         S01157
      *                                                                   S01157
     C           RLAMC     IFEQ 0                                         S01157
      *                                                                   S01157
     C                     MOVE 'Y'       RDEF                            S01157
     C                     MOVE 'DEFAULT' RDESCC                          S01157
     C                     END                                            S01157
      *                                                                   S01157
      *   PROCESS IRS LIMITS ===> CASE 1 - Live, Non Zero                 S01157
      *   ------------------                                              S01157
      *                                                                   S01157
      ** If Expiry Date GT Rundate...                                     S01157
      *                                                                   S01157
     C           ILEDC     IFGT BJRDNB                                    S01157
     C           ILEDC     OREQ 0                                         S01157
      *                                                                   S01157
      *   Get Expiry Date                                                 S01157
      *                                                                   S01157
     C                     Z-ADDILAMC     CILM    90                      S01157
     C                     MOVE ILEDC     ZDAYNO                          S01157
     C                     EXSR ZDATE2                                    S01157
     C                     MOVE ZADATE    IDESCC                          S01157
      *                                                                   S01157
     C                     END                                            S01157
      *                                                                   S01157
      *   PROCESS IRS LIMITS ===> CASE 2 - Expired                        S01157
      *   ------------------                                              S01157
      *                                                                   S01157
      ** If Expired, Set Description field.                               S01157
      *                                                                   S01157
     C           ILEDC     IFLE BJRDNB                                    S01157
     C           ILEDC     ANDNE0                                         S01157
     C                     MOVE 'EXPIRED' IDESCC  7                       S01157
     C                     Z-ADD0         CILM                            LN0632
     C                     END                                            S01157
      *                                                                   S01157
      *   PROCESS IRS LIMITS ===> CASE 3 - No Limit                       S01157
      *   ------------------                                              S01157
      *                                                                   S01157
      ** If limit amount blank...                                         S01157
      *                                                                   S01157
     C           ILAMC     IFEQ 0                                         S01157
      *                                                                   S01157
     C                     MOVE 'Y'       IDEF                            S01157
     C                     MOVE 'DEFAULT' IDESCC                          S01157
     C                     END                                            S01157
     C**                                                                  S01157
     C***IF*FX*OR*LN*DEFAULT*REQD*****************                        S01157
     C** If FX, LN,FRA or IRS default required...                         S01157
     C           FDEF      IFEQ 'Y'
     C           PDEF      OREQ 'Y'                                       S01433
     C********   LDEF      OREQ 'Y'                                       S01433
     C           MDEF      OREQ 'Y'                                       S01433
     C           RDEF      OREQ 'Y'                                       S01157
     C           IDEF      OREQ 'Y'                                       S01157
     C                     MOVE 'C'       LEVEL
     C                     MOVE CO        ENTITY
     C                     EXSR DL0131
     C**
     C**  APPLY DEFAULT VALUES
     C**                                                                  LN0632
     C** IF FX DEFAULT REQUIRED
     C           FDEF      IFEQ 'Y'
     C*                                                                   S01433
     C***IF*FX LIMIT FOUND                                                S01433
     C******     FXLIM     IFNE 0                                         S01433
     C** IF FX SPOT LIMIT FOUND                                           S01433
     C           FXLMS     IFNE 0                                         S01433
     C*                                                                   S01433
     C           FXSAME    IFEQ 'Y'                                       S01433
     C                     Z-ADDSP        CFDA1                           S01433
     C                     Z-ADDFXLMS     FLAMC                           S01433
     C                     MOVE FXPC      CFPCA                           S01433
     C           FXFAC     DIV  CFPC,1    FXFAC     H                     S01433
     C*                                                                   S01433
     C                     ELSE                                           S01433
     C                     Z-ADDSP        CFDA1                           S01433
     C           SP        ADD  BJRDNB    CFDT1                           S01433
     C                     Z-ADDFXLMS     CFLM1                           S01433
     C                     MOVE '*'       ASTFC                           S01433
     C                     END                                            S01433
     C                     MOVEL'SP'      FLEP1C                          S01433
     C                     MOVEL'999'     FLEP2C                          S01433
     C                     Z-ADDSP        CFDA,1                          S01433
     C                     Z-ADD999       CFDA,2                          S01433
     C           SP        ADD  BJRDNB    CFDT,1                          S01433
     C                     Z-ADD99999     CFDT,2                          S01433
     C                     ELSE                                           S01433
     C                     Z-ADD999       CFDA1                           S01433
     C                     Z-ADD99999     CFDT1                           S01433
     C                     Z-ADD999       CFDA,1                          S01433
     C                     Z-ADD99999     CFDT,1                          S01433
     C                     MOVEL'999'     FLEP1C                          S01433
     C*                                                                   S01433
     C                     END                                            S01433
     C*                                                                   S01433
     C****IF*ALL*LOWER LEVEL LIMITS HAD SAME TYPE,                        S01433
     C****USE*THIS FOR 1ST PERIOD                                         S01433
     C*                                                                   S01433
     C** IF FX FORWARD LIMIT FOUND                                        S01433
     C           FXLMF     IFNE 0                                         S01433
     C           FXSAME    IFEQ 'Y'
     C                     MOVEAFXPER     CFDAA
     C*******              Z-ADDFXLIM     FLAMC                           S01433
     C                     Z-ADDFXLMF     FXFAC                           S01433
     C                     MOVE FXPC      CFPCA
     C*
     C           FLAMC     DIV  CFPC,1    FLAMC     H
     C*                                                                   S01433
     C********             EXSR LMTCF                                     S01433
     C                     ELSE
     C**  ELSE SET UP SPOT PERIOD                                         S01433
     C********             Z-ADDSP        CFDA,1                          S01433
     C********   SP        ADD  BJRDNB    CFDT,1                          S01433
     C********             Z-ADD999       CFDA,2                          S01433
     C********             Z-ADD99999     CFDT,2                          S01433
     C********             Z-ADDFXLIM     CFLM,1                          S01433
     C                     Z-ADDFXLMF     CFLM,1                          S01433
     C                     MOVE '*'       ASTFC
     C                     END
     C*                                                                   S01433
     C                     END                                            S01433
     C*                                                                   S01433
     C           FXLMF     IFGT 0                                         S01433
     C           FXLMS     ORGT 0                                         S01433
     C           FXSAME    IFEQ 'Y'                                       S01433
     C                     EXSR LMTCF                                     S01433
     C                     END                                            S01433
     C********             ELSE                                           S01433
     C****IF*NOT FOUND                                                    S01433
     C********   FXLMF     IFEQ 0                                         S01433
     C********             Z-ADD999       CFDA,1                          S01433
     C********             Z-ADD99999     CFDT,1                          S01433
     C********             END                                            S01433
     C********   FXLMS     IFEQ 0                                         S01433
     C********             Z-ADD999       CFDA1                           S01433
     C********             Z-ADD99999     CFDT1                           S01433
     C********             END                                            S01433
     C********                                                            S01433
     C********             END                                            S01433
     C*                                                                   S01433
     C                     END                                            S01433
     C*                                                                   S01433
     C                     END                                            S01433
     C**
     C****IF*LN DEFAULT REQUIRED                                          S01433
     C**  IF MM DEFAULT REQUIRED                                          S01433
     C********   LDEF      IFEQ 'Y'                                       S01433
     C           MDEF      IFEQ 'Y'                                       S01433
     C****IF*LENDING LIMIT FOUND                                          S01433
     C**  IF MONEY MARKET LIMIT FOUND                                     S01433
     C           LNLIM     IFNE 0                                         S01433
     C**  IF ALL LOWER LEVEL LIMITS HAD SAME TYPE,
     C**  USE THIS FOR 1ST PERIOD
     C           LNSAME    IFEQ 'Y'
     C********             MOVEALNPER     CLDAA                           S01433
     C********             Z-ADDLNLIM     LLAMC                           S01433
     C********             MOVE LNPC      CLPCA                           S01433
     C                     MOVEALNPER     CMDAA                           S01433
     C                     Z-ADDLNLIM     MMAMC                           S01433
     C                     MOVE LNPC      CMPCA                           S01433
     C*
     C********   LLAMC     DIV  CLPC,1    LLAMC     H                     S01433
     C           MMAMC     DIV  CMPC,1    MMAMC     H                     S01433
     C*
     C                     EXSR LMTCL
     C                     ELSE
     C**  ELSE SET UP OVERNIGHT PERIOD
     C********             Z-ADD1         CLDA,1                          S01433
     C********   1         ADD  BJRDNB    CLDT,1                          S01433
     C********             Z-ADD999       CLDA,2                          S01433
     C********             Z-ADD99999     CLDT,2                          S01433
     C********             Z-ADDLNLIM     CLLM,1                          S01433
     C********             MOVE '*'       ASTLC                           S01433
     C                     Z-ADD1         CMDA,1                          S01433
     C           1         ADD  BJRDNB    CMDT,1                          S01433
     C                     Z-ADD999       CMDA,2                          S01433
     C                     Z-ADD99999     CMDT,2                          S01433
     C                     Z-ADDLNLIM     CMLM,1                          S01433
     C                     MOVE '*'       ASTMC                           S01433
     C                     END
     C                     ELSE
     C** IF NOT FOUND
     C********             Z-ADD999       CLDA,1                          S01433
     C********             Z-ADD99999     CLDT,1                          S01433
     C                     Z-ADD999       CMDA,1                          S01433
     C                     Z-ADD99999     CMDT,1                          S01433
     C                     END
     C                     END
     C/COPY WNCPYSRC,DL0762AC18
      *                                                                   CDL006
      ** If CDL006 is installed, check if FI limit is required            CDL006
      *                                                                   CDL006
     C           CDL006    IFEQ 'Y'                                       CDL006
     C           FIDEF     IFEQ 'Y'                                       CDL006
     C           FIFILA    IFNE 0                                         CDL006
     C           LNSAME    IFEQ 'Y'                                       CDL006
     C                     MOVEALNPER     CCDAA                           CDL006
     C                     MOVE LNPC      CCPCA                           CDL006
     C           FIFILA    DIV  CCPC,1    FIFILA    H                     CDL006
     C                     EXSR LMTCI                                     CDL006
     C                     ELSE                                           CDL006
      *                                                                   CDL006
      ** Set up overnight period                                          CDL006
      *                                                                   CDL006
     C                     Z-ADD1         CCDA,1                          CDL006
     C           1         ADD  BJRDNB    CCDT,1                          CDL006
     C                     Z-ADD999       CCDA,2                          CDL006
     C                     Z-ADD99999     CCDT,2                          CDL006
     C                     Z-ADDFIFILA    CCLM,1                          CDL006
     C                     MOVE '*'       ASTMC                           CDL006
     C                     END                                            CDL006
     C                     ELSE                                           CDL006
      *                                                                   CDL006
      ** If not found                                                     CDL006
      *                                                                   CDL006
     C                     Z-ADD999       CCDA,1                          CDL006
     C                     Z-ADD99999     CCDT,1                          CDL006
     C                     END                                            CDL006
     C                     END                                            CDL006
     C                     END                                            CDL006
      *                                                                   CDL006
     C**  IF PM DEFAULT REQUIRED                                          S01433
     C           PDEF      IFEQ 'Y'                                       S01433
     C** IF PM SPOT LIMIT FOUND                                           S01433
     C           PMLMS     IFNE 0                                         S01433
     C*                                                                   S01433
     C           PMSAME    IFEQ 'Y'                                       S01433
     C                     Z-ADDSP        CPDA1                           S01433
     C                     Z-ADDPMLMS     PSAMC                           S01433
     C                     MOVE PMPC      CPPCA                           S01433
     C           PSAMC     DIV  CPPC,1    PSAMC     H                     S01433
     C*                                                                   S01433
     C                     ELSE                                           S01433
     C                     Z-ADDSP        CPDA1                           S01433
     C           SP        ADD  BJRDNB    CPDT1                           S01433
     C                     Z-ADDPMLMS     CPLM1                           S01433
     C                     MOVE '*'       ASTPC                           S01433
     C                     END                                            S01433
     C                     MOVEL'SP'      PLEP1C                          S01433
     C                     MOVEL'999'     PLEP2C                          S01433
     C                     Z-ADDSP        CPDA,1                          S01433
     C                     Z-ADD999       CPDA,2                          S01433
     C           SP        ADD  BJRDNB    CPDT,1                          S01433
     C                     Z-ADD99999     CPDT,2                          S01433
     C                     ELSE                                           S01433
     C                     Z-ADD999       CPDA1                           S01433
     C                     Z-ADD99999     CPDT1                           S01433
     C                     Z-ADD999       CPDA,1                          S01433
     C                     Z-ADD99999     CPDT,1                          S01433
     C                     MOVEL'999'     PLEP1C                          S01433
     C*                                                                   S01433
     C                     END                                            S01433
     C*                                                                   S01433
     C**  IF PRECIOUS METAL FORWARD LIMIT FOUND                           S01433
     C           PMLMF     IFNE 0                                         S01433
     C*                                                                   S01433
     C           PMSAME    IFEQ 'Y'                                       S01433
     C                     MOVEAPMPER     CPDAA                           S01433
     C                     Z-ADDPMLMF     PFAMC                           S01433
     C                     MOVE PMPC      CPPCA                           S01433
     C           PFAMC     DIV  CPPC,1    PFAMC     H                     S01433
     C*                                                                   S01433
     C                     ELSE                                           S01433
     C                     Z-ADDPMLMF     CPLM,1                          S01433
     C                     MOVE '*'       ASTPC                           S01433
     C                     END                                            S01433
     C*                                                                   S01433
     C                     END                                            S01433
     C*                                                                   S01433
     C           PMLMF     IFGT 0                                         S01433
     C           PMLMS     ORGT 0                                         S01433
     C           PMSAME    IFEQ 'Y'                                       S01433
     C                     EXSR LMTCP                                     S01433
     C                     END                                            S01433
     C*                                                                   S01433
     C                     END                                            S01433
     C*                                                                   S01433
     C                     END                                            S01433
      *                                                                   LN0632
      ** If FRA default required, set up company limit                    LN0632
     C           RDEF      IFEQ 'Y'                                       LN0632
     C                     Z-ADDFRLIM     CRLM                            LN0632
     C                     END                                            LN0632
      *                                                                   LN0632
      ** If IRS default required, set up company limit                    LN0632
     C           IDEF      IFEQ 'Y'                                       LN0632
     C                     Z-ADDIRLIM     CILM                            LN0632
     C                     END                                            LN0632
      *                                                                   LN0632
     C                     END
     C**
0592 C**
0593 C                     ENDSR                                       **
0594 C**
     C********************************************************************
     C**  LMTCF SR SETS UP LIMIT ARRAYS FOR FX
     C**  INPUT - CFDAA - PERIOD ARRAY
     C**          CFPC - PERCENTAGE ARRAY
     C**          FLAMC - LIMIT AMOUNT
     C**   IF ANY ELEMENT IS BLANK OR 999
     C**   THE CORRESPONDING ELEMENTS IN CFDA & CFDT ARE SET TO NINES.
     C**   ELSE,CFDT IS CALCULATED BY ADDING RUN DATE (BJAKTX) TO CFDA,
     C**        CFLM,IS CALCULATED BY MULTIPLYING LIMIT AMOUNT BY CFPC
     C**
     C           LMTCF     BEGSR                           **  LMTCF **
     C                     Z-ADD0         D       20
     C********   CFDAA,1   COMP 'SP '                    71               062164
     C********   CFDAA,1   COMP 'SP '                    73               062164
     C           CFDAA,1   IFEQ 'SP '                                     S01433
     C**********           MOVE 'Y'       FXSPC   1                                   S01433 BUG8901
     C                     END                                            S01433
     C           LMTC1     TAG                             ** LMTC1   **
     C**
     C           D         ADD  1         D
     C           CFDAA,D   COMP 'SP '                    73               S01433
     C********** CFDAA,D   COMP '   '                    88               E309
     C           CFDAA,D   COMP '000'                    88               E309
     C           CFDAA,D   COMP '999'                    87
     C**
     C   88                Z-ADD999       CFDA,D
     C  N88                MOVE CFDAA,D   CFDA,D                          S01433
     C*
     C**
     C           CFDA,D    ADD  BJRDNB    CFDT,D
     C   88
     COR 87                Z-ADD99999     CFDT,D
     C   88                                                               S01433
     COR 87                Z-ADD99999     CFDT1                           S01433
     C**
     C**N88******FLAMC     MULT CFPC,D    CFLM,D                          S01433
     C           FXFAC     MULT CFPC,D    CFLM,D                          S01433
     C********** *IN73     IFEQ '1'                                                   S01433 BUG8901
     C           FLAMC     MULT CFPC,1    CFLM1                           S01433
     C**********           END                                                        S01433 BUG8901
     C           D         COMP 6                      86                 S01433
     C**                                                                  S01433
     C   73                Z-ADDSP        CFDA,1                          S01433
     C   73                Z-ADDSP        CFDA1                           S01433
     C   73      SP        ADD  BJRDNB    CFDT,1                          S01433
     C   73      SP        ADD  BJRDNB    CFDT1                           S01433
     C   86N87N88          GOTO LMTC1
     C***73******          Z-ADDSP        CFDA,1                          S01433
     C***73******SP        ADD  BJRDNB    CFDT,1                          S01433
     C                     ENDSR                                          S01433
     C**
     C********************************************************************S01433
     C**  LMTCP SR SETS UP LIMIT ARRAYS FOR PM                            S01433
     C**  INPUT - CPDAA - PERIOD ARRAY                                    S01433
     C**          CPPC - PERCENTAGE ARRAY                                 S01433
     C**          PFAMC - LIMIT AMOUNT                                    S01433
     C**   IF ANY ELEMENT IS BLANK OR 999                                 S01433
     C**   THE CORRESPONDING ELEMENTS IN CPDA & CPDT ARE SET TO NINES.    S01433
     C**   ELSE,CPDT IS CALCULATED BY ADDING RUN DATE (BJAKTX) TO CPDA,   S01433
     C**        CPLM,IS CALCULATED BY MULTIPLYING LIMIT AMOUNT BY CPPC    S01433
     C**                                                                  S01433
     C           LMTCP     BEGSR                           **  LMTCP **   S01433
     C                     Z-ADD0         D       20                      S01433
     C           CPDAA,1   IFEQ 'SP '                                     S01433
     C                     MOVE 'Y'       PMSPC   1                       S01433
     C                     END                                            S01433
     C           LMTCP1    TAG                             ** LMTCP1  **  S01433
     C**                                                                  S01433
     C           D         ADD  1         D                               S01433
     C           CPDAA,D   COMP 'SP '                    77               S01433
     C           CPDAA,D   COMP '000'                    88               S01433
     C           CPDAA,D   COMP '999'                    87               S01433
     C**                                                                  S01433
     C   88                Z-ADD999       CPDA,D                          S01433
     C  N88                MOVE CPDAA,D   CPDA,D                          S01433
     C**                                                                  S01433
     C           CPDA,D    ADD  BJRDNB    CPDT,D                          S01433
     C   88                                                               S01433
     COR 87                Z-ADD99999     CPDT,D                          S01433
     C   88                                                               S01433
     COR 87                Z-ADD99999     CPDT1                           S01433
     C**                                                                  S01433
     C           PFAMC     MULT CPPC,D    CPLM,D                          S01433
     C           *IN77     IFEQ '1'                                       S01433
     C           PSAMC     MULT CPPC,1    CPLM1                           S01433
     C                     END                                            S01433
     C           D         COMP 6                      86                 S01433
     C**                                                                  S01433
     C   77                Z-ADDSP        CPDA,1                          S01433
     C   77                Z-ADDSP        CPDA1                           S01433
     C   77      SP        ADD  BJRDNB    CPDT,1                          S01433
     C   77      SP        ADD  BJRDNB    CPDT1                           S01433
     C   86N87N88          GOTO LMTCP1                                    S01433
     C                     ENDSR                                          S01433
     C**                                                                  S01433
     C********************************************************************
     C****LMTCL*SR SETS UP LIMIT ARRAYS FOR LN                            S01433
     C*****NPUT*- CLDAA - PERIOD ARRAY                                    S01433
     C**********  CLPC - PERCENTAGE ARRAY                                 S01433
     C**********  LLAMC - LIMIT AMOUNT                                    S01433
     C****PROCESSES*CLDAA IN THE SAME WAY AS LMTCF                        S01433
     C**  LMTCL SR SETS UP LIMIT ARRAYS FOR MM                            S01433
     C**  INPUT - CMDAA - PERIOD ARRAY                                    S01433
     C**          CMPC - PERCENTAGE ARRAY                                 S01433
     C**          MMAMC - LIMIT AMOUNT                                    S01433
     C**  PROCESSES CMDAA IN THE SAME WAY AS LMTCF                        S01433
     C           LMTCL     BEGSR                           **  LMTCL **
     C                     Z-ADD0         D
     C********   CLDAA,1   COMP 'SP '                    72               062164
     C           CMDAA,1   COMP 'SP '                    74               062164
     C           LMTC2     TAG                             **  LMTC2   **
     C**
     C           D         ADD  1         D
     C********** CLDAA,D   COMP '   '                    88               E309
     C********   CLDAA,D   COMP '000'                    88               S01433
     C********   CLDAA,D   COMP '999'                    87               S01433
     C           CMDAA,D   COMP '000'                    88               S01433
     C           CMDAA,D   COMP '999'                    87               S01433
     C**
     C***88**              Z-ADD999       CLDA,D                          S01433
     C**N88**              MOVE CLDAA,D   CLDA,D                          S01433
     C   88                Z-ADD999       CMDA,D                          S01433
     C  N88                MOVE CMDAA,D   CMDA,D                          S01433
     C*
     C**
     C*******    CLDA,D    ADD  BJRDNB    CLDT,D                          S01433
     C           CMDA,D    ADD  BJRDNB    CMDT,D                          S01433
     C   88
     COR 87                Z-ADD99999     CMDT,D                          S01433
     C*R*87**              Z-ADD99999     CLDT,D                          S01433
     C**
     C**N88***   LLAMC     MULT CLPC,D    CLLM,D                          S01433
     C  N88      MMAMC     MULT CMPC,D    CMLM,D                          S01433
     C**
     C           D         COMP 6                      86
     C   86N87N88          GOTO LMTC2
     C***74**              Z-ADDSP        CLDA,1                          S01433
     C***74**    SP        ADD  BJRDNB    CLDT,1                          S01433
     C   74                Z-ADDSP        CMDA,1                          S01433
     C   74      SP        ADD  BJRDNB    CMDT,1                          S01433
     C                     ENDSR
     C**
0684 C********************************************************************
     C**   FORMAT & OUTPUT CUST/CO  LIMIT & EXPOSURE   FOR FX
     C**
     C           FXCWRT    BEGSR                           ** FXCWRT **
     C                     SETON                     60
     C                     SETOF                     70
     C**   CALC EXCESS, CHECK FOR ZERO EXPOSURE
     C                     EXSR EXSFC
     C**   IF NOT ZERO, PRINT. IN60 STILL ON IF ZERO
     C           *IN60     IFNE '1'
     C**
     C**   IF U1 NOT ON, PRINT EVEN IF EXPOSURE LESS THAN LIMIT.
     C**    IF U1 ON, ONLY PRINT IF EXPOSURE GREATER THAN LIMIT.
     C           *INU1     IFEQ '0'
     C           *INU1     OREQ '1'
     C           *IN70     ANDEQ'1'
0430 C**
0431 C**   PRINT DETAILS
0432 C                     Z-ADD0         D
     C**
0433 C           D         DOUEQ6                                      **
     C                     ADD  1         D                               S01433
     C           D         IFEQ 1                                         S01433
     C********** FXSPC     ANDEQ'Y'                                                   S01433 BUG8901
     C********** CFDAA,1   ANDEQ'SP'                                      S01433
     C**   MOVE EXPOSURE AMT. TO 10 DIGIT FIELD                           S01433
     C                     Z-ADDCFXP1     CFPOSS 100                      S01433
     C**********           Z-ADDCFXP1     CFPOS                           S01433
     C**********           ELSE                                           S01433
     C                     END                                            S01433
0442 C**   MOVE EXPOSURE AMT. TO 10 DIGIT FIELD
0443 C                     Z-ADDCFXP,D    CFPOS  100                      S01433
     C**********           END                                            S01433
0446 C**   PRINT 1ST LINE
     C           D         IFEQ 1                                         S01433
     C**   PRINT CUST IF NOT ALREADY DONE
     C           NAMPRT    IFEQ 'N'
     C           PTNU      COMP *BLANK                   45
     C  N45      PTNU      COMP '000000'                 45
     C                     EXCPTCUSTO
     C                     MOVE 'Y'       NAMPRT
     C                     END
     C**
     C********** CFDAA,D   IFEQ 'SP'                                      S01433
     C********** FXSPC     IFEQ 'Y'                                                   S01433 BUG8901
     C********             EXCPTCFLIN1                                    S01433
     C                     EXCPTCFLN1S                                    S01433
     C                     EXCPTCFLN1F                                    S01433
     C**********           ELSE                                                       S01433 BUG8901
     C**********           EXCPTCFLN1F                                                S01433 BUG8901
     C**********           END                                                        S01433 BUG8901
     C                     ADD  1         RLIST   50
     C                     ELSE
0437 C**   PRINT LINES 2-6 IF REQD
0438 C**   - TEST IF PERIOD END DATE ZERO
0439 C           CFDT,D    COMP 0                    53    PRINT
0447 C   53                EXCPTCFLIN2
     C                     END                                            S01433
0448 C**
0449 C**   - CALCULATE NEXT START OF PERIOD
0450 C           CFDA,D    ADD  1         NEXTF   30
0452 C**
     C                     END
     C                     END                             *inu1=1
     C                     END
     C**
     C                     MOVE *BLANKS   ASTFC
     C**
     C                     ENDSR
     C**
     C********************************************************************S01433
     C**   FORMAT & OUTPUT CUST/CO  LIMIT & EXPOSURE FOR PM               S01433
     C**                                                                  S01433
     C           PMCWRT    BEGSR                           ** PMCWRT **   S01433
     C                     SETON                     60                   S01433
     C                     SETOF                     70                   S01433
     C**   CALC EXCESS, CHECK FOR ZERO EXPOSURE                           S01433
     C                     EXSR EXSPC                                     S01433
     C**   IF NOT ZERO, PRINT. IN60 STILL ON IF ZERO                      S01433
     C           *IN60     IFNE '1'                                       S01433
     C**                                                                  S01433
     C**   IF U1 NOT ON, PRINT EVEN IF EXPOSURE LESS THAN LIMIT.          S01433
     C**    IF U1 ON, ONLY PRINT IF EXPOSURE GREATER THAN LIMIT.          S01433
     C           *INU1     IFEQ '0'                                       S01433
     C           *INU1     OREQ '1'                                       S01433
     C           *IN70     ANDEQ'1'                                       S01433
     C**                                                                  S01433
     C**   PRINT DETAILS                                                  S01433
     C                     Z-ADD0         D                               S01433
     C**                                                                  S01433
     C           D         DOUEQ6                                         S01433
     C                     ADD  1         D                               S01433
     C           D         IFEQ 1                                         S01433
     C********** CPDAA,1   ANDEQ'SP'                                      S01433
     C           PMSPC     ANDEQ'Y'                                       S01433
     C**   MOVE EXPOSURE AMT. TO 10 DIGIT FIELD                           S01433
     C**********           Z-ADDCPXP1     CPPOS                           S01433
     C                     Z-ADDCPXP1     CPPOSS 100                      S01433
     C**********           ELSE                                           S01433
     C                     END                                            S01433
     C**   MOVE EXPOSURE AMT. TO 10 DIGIT FIELD                           S01433
     C                     Z-ADDCPXP,D    CPPOS  100                      S01433
     C**********           END                                            S01433
     C**   PRINT 1ST LINE                                                 S01433
     C           D         IFEQ 1                                         S01433
     C**   PRINT CUST IF NOT ALREADY DONE                                 S01433
     C           NAMPRT    IFEQ 'N'                                       S01433
     C           PTNU      COMP *BLANK                   45               S01433
     C  N45      PTNU      COMP '000000'                 45               S01433
     C                     EXCPTCUSTO                                     S01433
     C                     MOVE 'Y'       NAMPRT                          S01433
     C                     END                                            S01433
     C**                                                                  S01433
     C********** CPDAA,D   IFEQ 'SP'                                      S01433
     C           PMSPC     IFEQ 'Y'                                       S01433
     C                     EXCPTCPLN1S                                    S01433
     C                     EXCPTCPLN1F                                    S01433
     C                     ELSE                                           S01433
     C                     EXCPTCPLN1F                                    S01433
     C                     END                                            S01433
     C                     ADD  1         RLIST   50                      S01433
     C                     ELSE                                           S01433
     C**   PRINT LINES 2-6 IF REQD                                        S01433
     C**   - TEST IF PERIOD END DATE ZERO                                 S01433
     C           CPDT,D    COMP 0                    55    PRINT          S01433
     C   55                EXCPTCPLIN2                                    S01433
     C                     END                                            S01433
     C**                                                                  S01433
     C**   - CALCULATE NEXT START OF PERIOD                               S01433
     C           CPDA,D    ADD  1         NEXTP   30                      S01433
     C**                                                                  S01433
     C                     END                                            S01433
     C                     END                             *inu1=1        S01433
     C                     END                                            S01433
     C**                                                                  S01433
     C                     MOVE *BLANKS   ASTPC                           S01433
     C**                                                                  S01433
     C                     ENDSR                                          S01433
     C**                                                                  S01433
0684 C********************************************************************
     C*****FORMAT & OUTPUT CUST/CO  LIMIT & EXPOSURE   FOR LENDING        S01433
     C**   FORMAT & OUTPUT CUST/CO  LIMIT & EXPOSURE FOR MONEY MARKET     S01433
     C**
     C           LNCWRT    BEGSR                           ** LNCWRT **
     C                     SETON                     60
     C                     SETOF                     70
     C**   CALC EXCESS, CHECK FOR ZERO EXPOSURE
     C                     EXSR EXSLC
     C**   IF NOT ZERO, PRINT. IN60 STILL ON IF ZERO
     C           *IN60     IFNE '1'
     C**
     C**   IF U1 NOT ON, PRINT EVEN IF EXPOSURE LESS THAN LIMIT.
     C**    IF U1 ON, ONLY PRINT IF EXPOSURE GREATER THAN LIMIT.
     C           *INU1     IFEQ '0'
     C           *INU1     OREQ '1'
     C           *IN70     ANDEQ'1'
0430 C**
0431 C**   PRINT DETAILS
0432 C                     Z-ADD0         D
     C**
0433 C           D         DOUEQ6                                      **
0434 C                     ADD  1         D
0442 C**   MOVE EXPOSURE AMT. TO 10 DIGIT FIELD
     C********             Z-ADDCLXP,D    LXPOS  100                      S01433
     C                     Z-ADDCMXP,D    LXPOS  100                      S01433
0446 C**   PRINT 1ST LINE
     C           D         IFEQ 1
     C**   PRINT CUST IF NOT ALREADY DONE
     C           NAMPRT    IFEQ 'N'
     C           PTNU      COMP *BLANK                   45
     C  N45      PTNU      COMP '000000'                 45
     C                     EXCPTCUSTO
     C                     MOVE 'Y'       NAMPRT
     C                     END
     C**
     C********             EXCPTCLLIN1                                    S01433
     C                     EXCPTCMLIN1                                    S01433
     C                     ADD  1         RLIST   50
     C                     Z-ADD1         NEXTL                           S01433
     C                     ELSE
0437 C**   PRINT LINES 2-6 IF REQD
0438 C**   - TEST IF PERIOD END DATE ZERO
     C********   CLDT,D    COMP 0                    54    PRINT          S01433
     C           CMDT,D    COMP 0                    54    PRINT          S01433
     C***54***             EXCPTCLLIN2                                    S01433
     C   54                EXCPTCMLIN2                                    S01433
     C                     END
0448 C**
0449 C**   - CALCULATE NEXT START OF PERIOD
     C********   CLDA,D    ADD  1         NEXTL   30                      S01433
     C           CMDA,D    ADD  1         NEXTL   30                      S01433
0452 C**
     C                     END
     C/COPY WNCPYSRC,DL0762AC19
      *                                                                   CDL006
      ** If CDL006 is installed                                           CDL006
      *                                                                   CDL006
     C           CDL006    IFEQ 'Y'                                       CDL006
     C                     MOVE *ON       *IN80                           CDL006
      *                                                                   CDL006
     C                     Z-ADD0         D                               CDL006
      *                                                                   CDL006
     C           D         DOUEQ6                                         CDL006
     C                     ADD  1         D                               CDL006
      *                                                                   CDL006
      ** Move exposure amount to 10 digit field                           CDL006
      *                                                                   CDL006
     C                     Z-ADDCCXP,D    FIXPOS 100                      CDL006
      *                                                                   CDL006
      ** Print 1st line                                                   CDL006
      *                                                                   CDL006
     C           D         IFEQ 1                                         CDL006
      *                                                                   CDL006
      ** Print Cust if not already done                                   CDL006
      *                                                                   CDL006
     C           NAMPRT    IFEQ 'N'                                       CDL006
     C           PTNU      COMP *BLANK                   45               CDL006
     C  N45      PTNU      COMP '000000'                 45               CDL006
     C                     EXCPTCUSTO                                     CDL006
     C                     MOVE 'Y'       NAMPRT                          CDL006
     C                     END                                            CDL006
      *                                                                   CDL006
     C                     EXCPTCCLIN1                                    CDL006
     C                     ADD  1         RLIST   50                      CDL006
     C                     Z-ADD1         FIEXTL                          CDL006
     C                     ELSE                                           CDL006
      *                                                                   CDL006
      ** Print lines 2-6 if required                                      CDL006
      ** - Test if period end date zero                                   CDL006
      *                                                                   CDL006
     C           CCDT,D    COMP 0                    61    PRINT          CDL006
     C   61                EXCPTCCLIN2                                    CDL006
     C                     END                                            CDL006
      *                                                                   CDL006
      ** - Calculate next start of period                                 CDL006
      *                                                                   CDL006
     C           CCDA,D    ADD  1         FIEXTL  30                      CDL006
      *                                                                   CDL006
     C                     END                                            CDL006
     C                     END                                            CDL006
      *                                                                   CDL006
     C                     END                             *inu1=1
     C                     END
     C**
     C********             MOVE *BLANKS   ASTLC                           S01433
     C                     MOVE *BLANKS   ASTMC                           S01433
     C**
     C                     ENDSR
     C**
      ********************************************************************S01157
      /EJECT                                                              S01157
      ********************************************************************S01157
      *                                                                  *S01157
      *    FRA - FORMAT & OUTPUT CUST/CO LIMIT & EXPOSURE                *S01157
      *                                                                  *S01157
      ********************************************************************S01157
      *                                                                   S01157
     C           FRCWRT    BEGSR                           ** FRCWRT **   S01157
      *                                                                   S01157
     C                     MOVE '1'       *IN60                           S01157
     C                     MOVE '0'       *IN70                           S01157
      *                                                                   S01157
      *  Calculate Excess Exposure, Check for Zero Exposure               S01157
     C                     EXSR EXSRC                                     S01157
      *                                                                   S01157
      *  If Not Zero, PRINT...*IN60 still ON if Zero                      S01157
     C           *IN60     IFNE '1'                                       S01157
      *                                                                   S01157
      *  If U1 NOT on, PRINT even if exposure LESS than Limit.            S01157
      *  If U1 on, only PRINT if exposure GREATER than Limit.             S01157
     C           *INU1     IFEQ '0'                                       S01157
     C           *INU1     OREQ '1'                                       S01157
     C           *IN70     ANDEQ'1'                                       S01157
      *                                                                   S01157
      *  Print Customer if not already done.                              S01157
     C           NAMPRT    IFEQ 'N'                                       S01157
     C           PTNU      COMP *BLANK                   45               062422
     C  N45      PTNU      COMP '000000'                 45               062422
     C                     EXCPTCUSTO                                     S01157
     C                     MOVE 'Y'       NAMPRT                          S01157
     C                     END                                            S01157
      *                                                                   S01157
      *  Print details.                                                   S01157
     C                     EXCPTCRLIN                                     S01157
      *                                                                   S01157
     C                     ADD  1         RLIST   50                      S01157
      *                                                                   S01157
      ***Initialise*exposure*field.***                             S01157 099251
     C***********          Z-ADD0         RCPOS                    S01157 099251
     C                     END                                            S01157
      *  Initialise exposure field.                                       099251
     C                     Z-ADD0         RCPOS                           099251
     C                     END                                            S01157
      *                                                                   S01157
     C                     ENDSR                           *** FRCWRT *** S01157
      *                                                                   S01157
      ********************************************************************S01157
      /EJECT                                                              S01157
      ********************************************************************S01157
      *                                                                  *S01157
      *    IRS - FORMAT & OUTPUT CUST/CO LIMIT & EXPOSURE                *S01157
      *                                                                  *S01157
      ********************************************************************S01157
      *                                                                   S01157
     C           IRCWRT    BEGSR                           ** IRCWRT **   S01157
      *                                                                   S01157
     C                     MOVE '1'       *IN60                           S01157
     C                     MOVE '0'       *IN70                           S01157
      *                                                                   S01157
      *  Calculate Excess Exposure, Check for Zero Exposure               S01157
     C                     EXSR EXSIC                                     S01157
      *                                                                   S01157
      *  If Not Zero, PRINT...*IN60 still ON if Zero                      S01157
     C           *IN60     IFNE '1'                                       S01157
      *                                                                   S01157
      *  If U1 NOT on, PRINT even if exposure LESS than Limit.            S01157
      *  If U1 on, only PRINT if exposure GREATER than Limit.             S01157
     C           *INU1     IFEQ '0'                                       S01157
     C           *INU1     OREQ '1'                                       S01157
     C           *IN70     ANDEQ'1'                                       S01157
      *                                                                   S01157
      *  Print Customer if not already done.                              S01157
     C           NAMPRT    IFEQ 'N'                                       S01157
     C           PTNU      COMP *BLANK                   45               062422
     C  N45      PTNU      COMP '000000'                 45               062422
     C                     EXCPTCUSTO                                     S01157
     C                     MOVE 'Y'       NAMPRT                          S01157
     C                     END                                            S01157
      *                                                                   S01157
      *  Print details.                                                   S01157
     C                     EXCPTCILIN                                     S01157
      *                                                                   S01157
     C                     ADD  1         RLIST   50                      S01157
      *                                                                   S01157
      ***Initialise*exposure*field.***                             S01157 099251
     C***********          Z-ADD0         ICPOS                    S01157 099251
     C                     END                                            S01157
      *  Initialise exposure field.                                       099251
     C                     Z-ADD0         ICPOS                           099251
     C                     END                                            S01157
      *                                                                   S01157
     C                     ENDSR                           *** IRCWRT *** S01157
      *                                                                   S01157
     C********************************************************************S01157
      /EJECT                                                              S01157
0684 C********************************************************************
     C**   COMPANY LEVEL LIMITS
0668 C**   EXSFC  SR. WORKS OUT EXCESS EXPOSURE FOR FX
0669 C**   -FIRST ROUNDS EXPOSURE FOR EACH PERIOD TO NEAREST 1000 UNITS
0670 C**   -THEN COMPARES EXPOSURE AMOUNTS TO CORRESP. LIMIT AMOUNTS.
0671 C           EXSFC     BEGSR                           **  EXSFC   **
     C           CFXP1     DIV  1000      CFXP1     H                     S01433
     C   60      CFXP1     COMP 0                        60               S01433
     C           CFXP1     COMP CFLM1                89                   S01433
     C   89                SETON                     70                   S01433
     C   89      CFXP1     SUB  CFLM1     CFXS1  100                      S01433
0672 C                     Z-ADD0         D
0673 C           EXSFC1    TAG                             **  EXSFC1  **
0674 C           D         ADD  1         D
0675 C           CFXP,D    DIV  1000      CFXP,D    H
     C   60      CFXP,D    COMP 0                        60
0676 C           CFXP,D    COMP CFLM,D               89
0677 C   89      CFXP,D    SUB  CFLM,D    CFXS,D
     C   89                SETON                     70
0678 C**
0679 C**   LOOP ROUND AGAIN IF LESS THAN 6 PERIODS HAVE BEEN PROCESSED
0680 C           D         COMP 6                      89
0681 C   89                GOTO EXSFC1
0682 C                     ENDSR
0683 C**
      /EJECT                                                              S01433
     C********************************************************************S01433
     C**   COMPANY LEVEL LIMITS                                           S01433
     C**   EXSPC  SR. WORKS OUT EXCESS EXPOSURE FOR PM                    S01433
     C**   -FIRST ROUNDS EXPOSURE FOR EACH PERIOD TO NEAREST 1000 UNITS   S01433
     C**   -THEN COMPARES EXPOSURE AMOUNTS TO CORRESP. LIMIT AMOUNTS.     S01433
     C           EXSPC     BEGSR                           **  EXSPC   ** S01433
     C           CPXP1     DIV  1000      CPXP1     H                     S01433
     C   60      CPXP1     COMP 0                        60               S01433
     C           CPXP1     COMP CPLM1                89                   S01433
     C   89                SETON                     70                   S01433
     C   89      CPXP1     SUB  CPLM1     CPXS1  100                      S01433
     C                     Z-ADD0         D                               S01433
     C           EXSPC1    TAG                             **  EXSPC1  ** S01433
     C           D         ADD  1         D                               S01433
     C           CPXP,D    DIV  1000      CPXP,D    H                     S01433
     C   60      CPXP,D    COMP 0                        60               S01433
     C           CPXP,D    COMP CPLM,D               89                   S01433
     C   89      CPXP,D    SUB  CPLM,D    CPXS,D                          S01433
     C   89                SETON                     70                   S01433
     C**                                                                  S01433
     C**   LOOP ROUND AGAIN IF LESS THAN 6 PERIODS HAVE BEEN PROCESSED    S01433
     C           D         COMP 6                      89                 S01433
     C   89                GOTO EXSPC1                                    S01433
     C                     ENDSR                                          S01433
     C**                                                                  S01433
0684 C********************************************************************
     C**   COMPANY LEVEL LIMITS
     C*****EXSLC**SR. WORKS OUT EXCESS EXPOSURE FOR LOANS.                S01433
     C**   EXSLC  SR. WORKS OUT EXCESS EXPOSURE FOR MONEY MARKET.         S01433
0687 C           EXSLC     BEGSR                           **  EXSLC  **
0688 C                     Z-ADD0         D
0689 C           EXSLC1    TAG                             **  EXSLC1  **
0690 C           D         ADD  1         D
     C********   CLXP,D    DIV  1000      CLXP,D    H                     S01433
     C***60***   CLXP,D    COMP 0                        60               S01433
     C********   CLXP,D    COMP CLLM,D               89                   S01433
     C***89***   CLXP,D    SUB  CLLM,D    CLXS,D                          S01433
     C           CMXP,D    DIV  1000      CMXP,D    H                     S01433
     C   60      CMXP,D    COMP 0                        60               S01433
     C           CMXP,D    COMP CMLM,D               89                   S01433
     C   89      CMXP,D    SUB  CMLM,D    CMXS,D                          S01433
     C   89                SETON                     70
0694 C**
0695 C           D         COMP 6                      89
0696 C   89                GOTO EXSLC1
     C/COPY WNCPYSRC,DL0762AC20
      *                                                                   CDL006
      ** If CDL006 is installed                                           CDL006
      *                                                                   CDL006
     C           CDL006    IFEQ 'Y'                                       CDL006
     C                     Z-ADD0         D                               CDL006
     C           EXFIC1    TAG                                            CDL006
     C           D         ADD  1         D                               CDL006
     C           CCXP,D    DIV  1000      CCXP,D    H                     CDL006
     C   60      CCXP,D    COMP 0                        60               CDL006
     C           CCXP,D    COMP CCLM,D               89                   CDL006
     C   89      CCXP,D    SUB  CCLM,D    CCXS,D                          CDL006
     C   89                SETON                     70                   CDL006
      *                                                                   CDL006
     C           D         COMP 6                      89                 CDL006
     C   89                GOTO EXFIC1                                    CDL006
      *                                                                   CDL006
     C                     ENDIF                                          CDL006
0697 C                     ENDSR
0698 C**
0699 C********************************************************************
      /EJECT                                                              S01157
      ********************************************************************S01157
      *                                                                  *S01157
      *    EXSRC - CALCULATE FRA EXCESS EXPOSURE                         *S01157
      *          - COMPANY LEVEL                                         *S01157
      ********************************************************************S01157
      *                                                                   S01157
     C           EXSRC     BEGSR                           ** EXSRC **    S01157
      *                                                                   S01157
      ** FRA EVENT                                                        S01157
      ** Convert exposure amount to thousands first                       S01157
     C           RCPOS     DIV  1000      RCPOS     H                     S01157
     C           RCPOS     SUB  CRLM      CRXS                            S01157
     C           CRXS      IFLT 0                                         S01157
     C                     Z-ADD0         CRXS   100                      S01157
     C                     ELSE                                           S01157
     C                     SETON                         70               S01157
     C                     END                                            S01157
      *                                                                   S01157
      ** If exposure is non-zero, then set-off ind 60                     S01157
     C           RCPOS     IFGT 0                                         S01157
     C                     MOVE '0'       *IN60                           S01157
     C                     END                                            S01157
      *                                                                   S01157
     C                     ENDSR                           *** EXSRC ***  S01157
      *                                                                   S01157
      ********************************************************************S01157
      /EJECT                                                              S01157
      ********************************************************************S01157
      *                                                                  *S01157
      *    EXSIC - CALCULATE IRS EXCESS EXPOSURE                         *S01157
      *          - COMPANY LEVEL                                         *S01157
      ********************************************************************S01157
      *                                                                   S01157
     C           EXSIC     BEGSR                           ** EXSIC **    S01157
      *                                                                   S01157
      ** IRS EVENT                                                        S01157
      ** Convert exposure amount to thousands first                       S01157
     C           ICPOS     DIV  1000      ICPOS     H                     S01157
     C           ICPOS     SUB  CILM      CIXS                            S01157
     C           CIXS      IFLT 0                                         S01157
     C                     Z-ADD0         CIXS   100                      S01157
     C                     ELSE                                           S01157
     C                     SETON                         70               S01157
     C                     END                                            S01157
      *                                                                   S01157
      ** If exposure is non-zero, then set-off ind 60                     S01157
     C           ICPOS     IFGT 0                                         S01157
     C                     MOVE '0'       *IN60                           S01157
     C                     END                                            S01157
      *                                                                   S01157
     C                     ENDSR                           *** EXSIC ***  S01157
      *                                                                   S01157
      ********************************************************************S01157
     C/EJECT
0595 C********************************************************************
     C**   SYSTEM LEVEL SR'S -
     C**      LMTS
     C********FXSWRT,LNSWRT                                               S01157
     C********EXSFS, EXSLS                                                S01157
     C**      FXSWRT,LNSWRT,FRSWRT,IRSWRT                                 S01157
     C**      EXSFS, EXSLS, EXSRS, EXSIS                                  S01157
0461 C********************************************************************
     C*   SYSTEM LEVEL LIMITS
0472 C*     LMTS SR. SETS UP ARRAYS OF LIMIT PERIODS & AMOUNTS,
     C*****FOR*FX LIMITS AND LENDING LIMITS.                              S01433
     C*    FOR FX LIMITS, MONEY MARKET AND PRECIOUS METALS.               S01433
0474 C           LMTS      BEGSR                           **  LMTS *  *
     C                     MOVE *BLANKS   FDESCS  7
     C                     MOVE *BLANKS   PDESCS  7                       S01433
     C********             MOVE *BLANKS   LDESCS  7                       S01433
     C                     MOVE *BLANKS   MDESCS  7                       S01433
     C                     MOVE *BLANKS   RDESC   7                       S01157
     C                     MOVE *BLANKS   IDESC   7                       S01157
     C                     MOVE *BLANKS   FDEF
     C                     MOVE *BLANKS   PDEF                            S01433
     C********             MOVE *BLANKS   LDEF                            S01433
     C                     MOVE *BLANKS   MDEF                            S01433
     C                     MOVE *BLANKS   RDEF    1                       S01157
     C                     MOVE *BLANKS   IDEF    1                       S01157
     C                     MOVE *BLANKS   ASTFS   1
     C                     MOVE *BLANKS   ASTPS   1                       S01433
     C********             MOVE *BLANKS   ASTLS   1                       S01433
     C                     MOVE *BLANKS   ASTMS   1                       S01433
     C                     Z-ADD0         XRLM                            S01157
     C                     Z-ADD0         XILM                            S01157
0475 C**
0476 C**   FIRST RESET ARRAYS TO ZEROES
0478 C                     Z-ADD0         XFDA
0478 C                     Z-ADD0         XFDT
0479 C                     Z-ADD0         XFLM
0480 C                     Z-ADD0         XFXP
0481 C                     Z-ADD0         XFXS
     C********             Z-ADD0         XLDA                            S01433
     C********             Z-ADD0         XLDT                            S01433
     C********             Z-ADD0         XLLM                            S01433
     C********             Z-ADD0         XLXP                            S01433
     C********             Z-ADD0         XLXS                            S01433
     C                     Z-ADD0         XMDA                            S01433
     C                     Z-ADD0         XMDT                            S01433
     C                     Z-ADD0         XMLM                            S01433
     C                     Z-ADD0         XMXP                            S01433
     C                     Z-ADD0         XMXS                            S01433
     C                     Z-ADD0         XPDA                            S01433
     C                     Z-ADD0         XPDT                            S01433
     C                     Z-ADD0         XPLM                            S01433
     C                     Z-ADD0         XPXP                            S01433
     C                     Z-ADD0         XPXS                            S01433
     C                     Z-ADD0         XFDA1   30                      S01433
     C                     Z-ADD0         XFDT1   50                      S01433
     C                     Z-ADD0         XFLM1   90                      S01433
     C                     Z-ADD0         XPDA1   30                      S01433
     C                     Z-ADD0         XPDT1   50                      S01433
     C                     Z-ADD0         XPLM1   90                      S01433
     C                     Z-ADD0         XFXS1                           S01433
     C                     Z-ADD0         XPXS1                           S01433
     C                     Z-ADD0         XFXP1                           S01433
     C                     Z-ADD0         XPXP1                           S01433
     C**********           MOVE 'N'       FXSP                                        S01433 BUG8901
     C                     MOVE 'Y'       FXSP    1                                          BUG8901
     C                     MOVE 'N'       PMSP                            S01433
     C/COPY WNCPYSRC,DL0762AC21
      *                                                                   CDL006
      ** If CDL006 is installed                                           CDL006
      *                                                                   CDL006
     C           CDL006    IFEQ 'Y'                                       CDL006
     C                     MOVE *BLANKS   FIDESS  7                       CDL006
     C                     Z-ADD0         SIDA                            CDL006
     C                     Z-ADD0         SIDT                            CDL006
     C                     Z-ADD0         SILM                            CDL006
     C                     Z-ADD0         SIXP                            CDL006
     C                     Z-ADD0         SIXS                            CDL006
     C                     END                                            CDL006
0489 C*
0491 C                     SETOF                     7172                 S01433
0491 C                     SETOF                     78                   S01433
0492 C**
0494 C**
0495 C**   PROCESS FX LIMITS FIRST
     C** CASE 1 - LIVE, NON ZERO
     C** IF FX LIMIT TYPE NON ZERO & EXPIRY DATE GT RUN DATE (BJAKTX)
     C           FLTYS     IFNE *BLANKS
     C           FLEDS     IFGT BJRDNB
     C           FLEDS     OREQ 0
     C                     EXSR LMTSF
     C**  GET EXPIRY DATE
     C                     MOVE FLEDS     ZDAYNO
     C                     EXSR ZDATE2
     C                     MOVE ZADATE    FDESCS
     C                     END
     C                     END
     C**
0500 C**   CASE 2-EXPIRED
0501 C**   - IF EXPIRED, SET FIRST PERIOD END DAYS & DATE TO NINES
0502 C**     & ZEROIZE AMOUNT
     C           FLEDS     IFLE BJRDNB
     C           FLEDS     ANDNE0
     C                     MOVE 'EXPIRED' FDESCS  7
0503 C                     Z-ADD999       XFDA,1
0504 C                     Z-ADD99999     XFDT,1
0505 C                     Z-ADD0         XFLM,1
     C                     END
0508 C**   CASE 3 - NO LIMIT
0509 C**   - IF FX LIMIT TYPE 0, CONDITION DEFAULT
     C           FLTYS     IFEQ *BLANKS
     C                     MOVE 'Y'       FDEF    1
     C                     MOVE 'DEFAULT' FDESCS
     C                     END
     C**
     C*****PROCESS*LENDING LIMITS.                                        S01433
     C**   PROCESS MONEY MARKET LIMITS.                                   S01433
0551 C**
0565 C**   CASE 1 - LIVE, NON ZERO
     C*****IF*LN LIMIT TYPE NON ZERO & EXPIRY DATE GT RUN DATE (BJAKTX)   S01433
     C**   IF MM LIMIT TYPE NON ZERO & EXPIRY DATE GT RUN DATE (BJAKTX)   S01433
     C********   LLTYS     IFNE *BLANKS                                   S01433
     C********   LLEDS     IFGT BJRDNB                                    S01433
     C********   LLEDS     OREQ 0                                         S01433
     C           MMTYS     IFNE *BLANKS                                   S01433
     C           MMEDS     IFGT BJRDNB                                    S01433
     C           MMEDS     OREQ 0                                         S01433
     C                     EXSR LMTSL
     C**  GET EXPIRY DATE
     C********             MOVE LLEDS     ZDAYNO                          S01433
     C                     MOVE MMEDS     ZDAYNO                          S01433
     C                     EXSR ZDATE2
     C********             MOVE ZADATE    LDESCS                          S01433
     C                     MOVE ZADATE    MDESCS                          S01433
     C                     END
     C                     END
     C**
0552 C**   CASE 2 - EXPIRED
0553 C**   - IF EXPIRED, SET FIRST PERIOD END DAYS & DATE TO NINES
0554 C**     & ZEROISE AMOUNT
     C********   LLEDS     IFLE BJRDNB                                    S01433
     C********   LLEDS     ANDNE0                                         S01433
     C********             MOVE 'EXPIRED' LDESCS  7                       S01433
     C********             Z-ADD999       XLDA,1                          S01433
     C********             Z-ADD99999     XLDT,1                          S01433
     C********             Z-ADD0         XLLM,1                          S01433
     C           MMEDS     IFLE BJRDNB                                    S01433
     C           MMEDS     ANDNE0                                         S01433
     C                     MOVE 'EXPIRED' MDESCS  7                       S01433
0555 C                     Z-ADD999       XMDA,1                          S01433
0556 C                     Z-ADD99999     XMDT,1                          S01433
0557 C                     Z-ADD0         XMLM,1                          S01433
0559 C                     END                                         **
     C**
0560 C**   CASE 3 - NO  LIMIT
0561 C**   - IF LIMIT TYPE 0, CONDITION DEFAULT
     C********   LLTYS     IFEQ *BLANKS                                   S01433
     C********             MOVE 'Y'       LDEF    1                       S01433
     C********             MOVE 'DEFAULT' LDESCS                          S01433
     C           MMTYS     IFEQ *BLANKS                                   S01433
     C                     MOVE 'Y'       MDEF    1                       S01433
     C                     MOVE 'DEFAULT' MDESCS                          S01433
     C                     END
     C/COPY WNCPYSRC,DL0762AC22
      *                                                                   CDL006
      ** If CDL006 is installed, process fiduciary limits                 CDL006
      ** Case 1 - Live, non zero                                          CDL006
      ** If FI limit type non zero & expiry date GT Rundate               CDL006
      *                                                                   CDL006
     C           CDL006    IFEQ 'Y'                                       CDL006
     C           FIFILT    IFNE 0                                         CDL006
     C           MMEDS     IFGT BJRDNB                                    CDL006
     C           MMEDS     OREQ 0                                         CDL006
     C                     EXSR LMTSIL                                    CDL006
      *                                                                   CDL006
      ** Get expiry date                                                  CDL006
      *                                                                   CDL006
     C                     MOVE MMEDS     ZDAYNO                          CDL006
     C                     EXSR ZDATE2                                    CDL006
     C                     MOVE ZADATE    FIDESS                          CDL006
     C                     END                                            CDL006
     C                     END                                            CDL006
      *                                                                   CDL006
      ** Case 2 - Expired                                                 CDL006
      ** If Expired, set first period end days & date to nines            CDL006
      ** & zeroise amount                                                 CDL006
      *                                                                   CDL006
     C           MMEDS     IFLE BJRDNB                                    CDL006
     C           MMEDS     ANDNE0                                         CDL006
     C                     MOVE 'EXPIRED' FIDESS  7                       CDL006
     C                     Z-ADD999       SIDA,1                          CDL006
     C                     Z-ADD99999     SIDT,1                          CDL006
     C                     Z-ADD0         SILM,1                          CDL006
     C                     END                                            CDL006
      *                                                                   CDL006
      ** Case 3 - No limit                                                CDL006
      ** If limit type 0, condition default                               CDL006
      *                                                                   CDL006
     C           FIFILT    IFEQ 0                                         CDL006
     C                     MOVE 'Y'       FIDEF                           CDL006
     C                     MOVE 'DEFAULT' FIDESS                          CDL006
     C                     END                                            CDL006
     C                     END                                            CDL006
     C**
     C**   PROCESS PRECIOUS METAL LIMITS.                                 S01433
     C**                                                                  S01433
     C**   CASE 1 - LIVE, NON ZERO                                        S01433
     C**   IF PM LIMIT TYPE NON ZERO & EXPIRY DATE GT RUN DATE (BJAKTX)   S01433
     C           PLTYS     IFNE *BLANKS                                   S01433
     C           PLEDS     IFGT BJRDNB                                    S01433
     C           PLEDS     OREQ 0                                         S01433
     C                     EXSR LMTSP                                     S01433
     C**  GET EXPIRY DATE                                                 S01433
     C                     MOVE PLEDS     ZDAYNO                          S01433
     C                     EXSR ZDATE2                                    S01433
     C                     MOVE ZADATE    PDESCS                          S01433
     C                     END                                            S01433
     C                     END                                            S01433
     C**                                                                  S01433
     C**   CASE 2 - EXPIRED                                               S01433
     C**   - IF EXPIRED, SET FIRST PERIOD END DAYS & DATE TO NINES        S01433
     C**     & ZEROISE AMOUNT                                             S01433
     C           PLEDS     IFLE BJRDNB                                    S01433
     C           PLEDS     ANDNE0                                         S01433
     C                     MOVE 'EXPIRED' PDESCS  7                       S01433
     C                     Z-ADD999       XPDA,1                          S01433
     C                     Z-ADD99999     XPDT,1                          S01433
     C                     Z-ADD0         XPLM,1                          S01433
     C                     END                                         ** S01433
     C**                                                                  S01433
     C**   CASE 3 - NO  LIMIT                                             S01433
     C**   - IF LIMIT TYPE 0, CONDITION DEFAULT                           S01433
     C           PLTYS     IFEQ *BLANKS                                   S01433
     C                     MOVE 'Y'       PDEF    1                       S01433
     C                     MOVE 'DEFAULT' PDESCS                          S01433
     C                     END                                            S01433
     C**                                                                  S01433
      *                                                                   S01157
      *   PROCESS FRA LIMITS ===> CASE 1 - Live, Non Zero                 S01157
      *   ------------------                                              S01157
      *                                                                   S01157
      ** If Expiry Date GT Rundate...                                     S01157
      *                                                                   S01157
     C           RLEDS     IFGT BJRDNB                                    S01157
     C           RLEDS     OREQ 0                                         S01157
      *                                                                   S01157
      *   Get Expiry Date                                                 S01157
      *                                                                   S01157
     C                     Z-ADDRLAMS     XRLM    90                      S01157
     C                     MOVE RLEDS     ZDAYNO                          S01157
     C                     EXSR ZDATE2                                    S01157
     C                     MOVE ZADATE    RDESCS                          S01157
      *                                                                   S01157
     C                     END                                            S01157
      *                                                                   S01157
      *   PROCESS FRA LIMITS ===> CASE 2 - Expired                        S01157
      *   ------------------                                              S01157
      *                                                                   S01157
      ** If Expired, Set Description field.                               S01157
      *                                                                   S01157
     C           RLEDS     IFLE BJRDNB                                    S01157
     C           RLEDS     ANDNE0                                         S01157
     C                     MOVE 'EXPIRED' RDESCS  7                       S01157
     C                     Z-ADD0         XRLM                            LN0632
     C                     END                                            S01157
      *                                                                   S01157
      *   PROCESS FRA LIMITS ===> CASE 3 - No Limit                       S01157
      *   ------------------                                              S01157
      *                                                                   S01157
      ** If limit amount blank...                                         S01157
      *                                                                   S01157
     C           RLAMS     IFEQ 0                                         S01157
      *                                                                   S01157
     C                     MOVE 'Y'       RDEF                            S01157
     C                     MOVE 'DEFAULT' RDESCS                          S01157
     C                     END                                            S01157
      *                                                                   S01157
      *   PROCESS IRS LIMITS ===> CASE 1 - Live, Non Zero                 S01157
      *   ------------------                                              S01157
      *                                                                   S01157
      ** If Expiry Date GT Rundate...                                     S01157
      *                                                                   S01157
     C           ILEDS     IFGT BJRDNB                                    S01157
     C           ILEDS     OREQ 0                                         S01157
      *                                                                   S01157
      *   Get Expiry Date                                                 S01157
      *                                                                   S01157
     C                     Z-ADDILAMS     XILM    90                      S01157
     C                     MOVE ILEDS     ZDAYNO                          S01157
     C                     EXSR ZDATE2                                    S01157
     C                     MOVE ZADATE    IDESCS                          S01157
      *                                                                   S01157
     C                     END                                            S01157
      *                                                                   S01157
      *   PROCESS IRS LIMITS ===> CASE 2 - Expired                        S01157
      *   ------------------                                              S01157
      *                                                                   S01157
      ** If Expired, Set Description field.                               S01157
      *                                                                   S01157
     C           ILEDS     IFLE BJRDNB                                    S01157
     C           ILEDS     ANDNE0                                         S01157
     C                     MOVE 'EXPIRED' IDESCS  7                       S01157
     C                     Z-ADD0         XILM                            LN0632
     C                     END                                            S01157
      *                                                                   S01157
      *   PROCESS IRS LIMITS ===> CASE 3 - No Limit                       S01157
      *   ------------------                                              S01157
      *                                                                   S01157
      ** If limit amount blank...                                         S01157
      *                                                                   S01157
     C           ILAMS     IFEQ 0                                         S01157
      *                                                                   S01157
     C                     MOVE 'Y'       IDEF                            S01157
     C                     MOVE 'DEFAULT' IDESCS                          S01157
     C                     END                                            S01157
     C**                                                                  S01157
     C***IF*FX*OR*LN*DEFAULT*REQD*****************                        S01157
     C***If*FX, LN, FRA or IRS default required...                 S01157 S01433
     C** If FX, MM, FRA or IRS default required...                        S01433
     C           FDEF      IFEQ 'Y'
     C           PDEF      OREQ 'Y'                                       S01433
     C********   LDEF      OREQ 'Y'                                       S01433
     C           MDEF      OREQ 'Y'                                       S01433
     C           RDEF      OREQ 'Y'                                       S01157
     C           IDEF      OREQ 'Y'                                       S01157
     C                     MOVE 'S'       LEVEL   1
     C                     MOVE '   '     ENTITY  3
     C                     EXSR DL0131
     C**
     C**  APPLY DEFAULT VALUES
     C**                                                                  LN0632
     C** IF FX DEFAULT REQUIRED
     C           FDEF      IFEQ 'Y'
     C***IF*FX LIMIT FOUND                                                S01433
     C********   FXLIM     IFNE 0                                         S01433
     C** IF FX SPOT LIMIT FOUND                                           S01433
     C           FXLMS     IFNE 0                                         S01433
     C****IF*ALL LOWER LEVEL LIMITS HAD SAME TYPE,                        S01433
     C****USE*THIS FOR 1ST PERIOD                                         S01433
     C*                                                                   S01433
     C           FXSAME    IFEQ 'Y'
     C                     Z-ADDSP        XFDA1                           S01433
     C********             MOVEAFXPER     XFDAA                           S01433
     C********             Z-ADDFXLIM     FLAMS                           S01433
     C                     Z-ADDFXLMS     FLAMS                           S01433
     C                     MOVE FXPC      XFPCA
     C           FLAMS     DIV  XFPC,1    FLAMS     H
     C*
     C                     ELSE                                           S01433
     C                     Z-ADDSP        XFDA1                           S01433
     C           SP        ADD  BJRDNB    XFDT1                           S01433
     C                     Z-ADDFXLMS     XFLM1                           S01433
     C                     MOVE '*'       ASTFC                           S01433
     C                     END                                            S01433
     C                     MOVEL'SP'      FLEP1S                          S01433
     C                     MOVEL'999'     FLEP2S                          S01433
     C                     Z-ADDSP        XFDA,1                          S01433
     C           SP        ADD  BJRDNB    XFDT,1                          S01433
     C                     Z-ADD999       XFDA,2                          S01433
     C                     Z-ADD99999     XFDT,2                          S01433
     C                     ELSE                                           S01433
     C                     Z-ADD999       XFDA1                           S01433
     C                     Z-ADD99999     XFDT1                           S01433
     C                     Z-ADD999       XFDA,1                          S01433
     C                     Z-ADD99999     XFDT,1                          S01433
     C                     MOVEL'999'     FLEP1S                          S01433
     C*                                                                   S01433
     C                     END                                            S01433
     C********             EXSR LMTSF                                     S01433
     C** IF FX FORWARD LIMIT FOUND                                        S01433
     C           FXLMF     IFNE 0                                         S01433
     C           FXSAME    IFEQ 'Y'                                       S01433
     C                     MOVEAFXPER     XFDAA                           S01433
     C                     Z-ADDFXLMF     FXFAS                           S01433
     C********             Z-ADDFXLIM     FXFAS                           S01433
     C                     MOVE FXPC      XFPCA                           S01433
     C           FXFAS     DIV  XFPC,1    FXFAS     H                     S01433
     C*                                                                   S01433
     C                     ELSE                                           S01433
     C**  ELSE SET UP SPOT PERIOD
     C********             Z-ADDSP        XFDA,1                          S01433
     C********   SP        ADD  BJRDNB    XFDT,1                          S01433
     C********             Z-ADD999       XFDA,2                          S01433
     C********             Z-ADD99999     XFDT,2                          S01433
     C********             Z-ADDFXLIM     XFLM,1                          S01433
     C                     Z-ADDFXLMF     XFLM,1                          S01433
     C                     MOVE '*'       ASTFS
     C                     END
     C*                                                                   S01433
     C                     END                                            S01433
     C*                                                                   S01433
     C           FXLMF     IFGT 0                                         S01433
     C           FXLMS     ORGT 0                                         S01433
     C           FXSAME    IFEQ 'Y'                                       S01433
     C                     EXSR LMTSF                                     S01433
     C                     END                                            S01433
     C********             ELSE                                           S01433
     C****IF*NOT FOUND                                                    S01433
     C********   FXLMF     IFEQ 0                                         S01433
     C********             Z-ADD999       XFDA,1                          S01433
     C********             Z-ADD99999     XFDT,1                          S01433
     C********             END                                            S01433
     C********   FXLMS     IFEQ 0                                         S01433
     C********             Z-ADD999       XFDA1                           S01433
     C********             Z-ADD99999     XFDT1                           S01433
     C********             END                                            S01433
     C********                                                            S01433
     C                     END                                            S01433
     C*                                                                   S01433
     C                     END
     C**
     C****IF*LN DEFAULT REQUIRED                                          S01433
     C********   LDEF      IFEQ 'Y'                                       S01433
     C****IF*LENDING LIMIT FOUND                                          S01433
     C**  IF MN DEFAULT REQUIRED                                          S01433
     C           MDEF      IFEQ 'Y'                                       S01433
     C**  IF MONEY MARKET LIMIT FOUND                                     S01433
     C           LNLIM     IFNE 0
     C**  IF ALL LOWER LEVEL LIMITS HAD SAME TYPE,
     C**  USE THIS FOR 1ST PERIOD
     C           LNSAME    IFEQ 'Y'
     C********             MOVEALNPER     XMDAA                           S01433
     C********             Z-ADDLNLIM     MMAMS                           S01433
     C********             MOVE LNPC      XMPCA                           S01433
     C                     MOVEALNPER     XMDAA                           S01433
     C                     Z-ADDLNLIM     MMAMS                           S01433
     C                     MOVE LNPC      XMPCA                           S01433
     C*                                                                   S01433
     C********   LLAMS     DIV  XLPC,1    LLAMS     H                     S01433
     C           MMAMS     DIV  XMPC,1    MMAMS     H                     S01433
     C*
     C                     EXSR LMTSL
     C                     ELSE
     C**  ELSE SET UP OVERNIGHT PERIOD
     C********             Z-ADD1         XLDA,1                          S01433
     C********   1         ADD  BJRDNB    XLDT,1                          S01433
     C********             Z-ADD999       XLDA,2                          S01433
     C********             Z-ADD99999     XLDT,2                          S01433
     C********             Z-ADDLNLIM     XLLM,1                          S01433
     C********             MOVE '*'       ASTLS                           S01433
     C                     Z-ADD1         XMDA,1                          S01433
     C           1         ADD  BJRDNB    XMDT,1                          S01433
     C                     Z-ADD999       XMDA,2                          S01433
     C                     Z-ADD99999     XMDT,2                          S01433
     C                     Z-ADDLNLIM     XMLM,1                          S01433
     C                     MOVE '*'       ASTMS                           S01433
     C                     END
     C                     ELSE
     C** IF NOT FOUND
     C********             Z-ADD999       XLDA,1                          S01433
     C********             Z-ADD99999     XLDT,1                          S01433
     C                     Z-ADD999       XMDA,1                          S01433
     C                     Z-ADD99999     XMDT,1                          S01433
     C                     END
     C                     END
     C/COPY WNCPYSRC,DL0762AC23
      *                                                                   CDL006
      ** If CDL006 is installed, check if FI default is required          CDL006
      *                                                                   CDL006
     C           CDL006    IFEQ 'Y'                                       CDL006
     C           FIDEF     IFEQ 'Y'                                       CDL006
     C           FIFILA    IFNE 0                                         CDL006
     C           LNSAME    IFEQ 'Y'                                       CDL006
     C                     MOVEALNPER     SIDAA                           CDL006
     C                     MOVE LNPC      SIPCA                           CDL006
     C           FIFILA    DIV  SIPC,1    FIFILA    H                     CDL006
     C                     EXSR LMTSIL                                    CDL006
     C                     ELSE                                           CDL006
      *                                                                   CDL006
      ** Set up overnight period                                          CDL006
      *                                                                   CDL006
     C                     Z-ADD1         SIDA,1                          CDL006
     C           1         ADD  BJRDNB    SIDT,1                          CDL006
     C                     Z-ADD999       SIDA,2                          CDL006
     C                     Z-ADD99999     SIDT,2                          CDL006
     C                     Z-ADDFIFILA    SILM,1                          CDL006
     C                     MOVE '*'       ASTMS                           CDL006
     C                     END                                            CDL006
     C                     ELSE                                           CDL006
      *                                                                   CDL006
      ** If not found                                                     CDL006
      *                                                                   CDL006
     C                     Z-ADD999       SIDA,1                          CDL006
     C                     Z-ADD99999     SIDT,1                          CDL006
     C                     END                                            CDL006
     C                     END                                            CDL006
     C                     END                                            CDL006
     C*                                                                   S01433
     C**  IF PM DEFAULT REQUIRED                                          S01433
     C           PDEF      IFEQ 'Y'                                       S01433
     C*                                                                   S01433
     C**  IF PRECIOUS METAL SPOT LIMIT FOUND                              S01433
     C           PMLMS     IFNE 0                                         S01433
     C*                                                                   S01433
     C           PMSAME    IFEQ 'Y'                                       S01433
     C                     Z-ADDSP        XPDA1                           S01433
     C                     Z-ADDPMLMS     PSAMS                           S01433
     C                     MOVE PMPC      XPPCA                           S01433
     C           PSAMS     DIV  XPPC,1    PSAMS     H                     S01433
     C*                                                                   S01433
     C                     ELSE                                           S01433
     C                     Z-ADDSP        XPDA1                           S01433
     C           SP        ADD  BJRDNB    XPDT1                           S01433
     C                     Z-ADDPMLMS     XPLM1                           S01433
     C                     MOVE '*'       ASTPS                           S01433
     C                     END                                            S01433
     C                     MOVEL'SP'      PLEP1S                          S01433
     C                     MOVEL'999'     PLEP2S                          S01433
     C                     Z-ADDSP        XPDA,1                          S01433
     C                     Z-ADD999       XPDA,2                          S01433
     C           SP        ADD  BJRDNB    XPDT,1                          S01433
     C                     Z-ADD99999     XPDT,2                          S01433
     C                     ELSE                                           S01433
     C                     Z-ADD999       XPDA1                           S01433
     C                     Z-ADD99999     XPDT1                           S01433
     C                     Z-ADD999       XPDA,1                          S01433
     C                     Z-ADD99999     XPDT,1                          S01433
     C                     MOVEL'999'     PLEP1S                          S01433
     C*                                                                   S01433
     C                     END                                            S01433
     C*                                                                   S01433
     C**  IF PRECIOUS METAL FORWARD LIMIT FOUND                           S01433
     C           PMLMF     IFNE 0                                         S01433
     C*                                                                   S01433
     C           PMSAME    IFEQ 'Y'                                       S01433
     C                     MOVEAPMPER     XPDAA                           S01433
     C                     Z-ADDPMLMF     PFAMS                           S01433
     C**********           MOVE PMPC      XFPCA                           S01433
     C                     MOVE PMPC      XPPCA                           S01433
     C           PFAMS     DIV  XPPC,1    PFAMS     H                     S01433
     C*                                                                   S01433
     C                     ELSE                                           S01433
     C                     Z-ADDPMLMF     XPLM,1                          S01433
     C                     MOVE '*'       ASTPS                           S01433
     C                     END                                            S01433
     C*                                                                   S01433
     C                     END                                            S01433
     C*                                                                   S01433
     C           PMLMF     IFGT 0                                         S01433
     C           PMLMS     ORGT 0                                         S01433
     C           PMSAME    IFEQ 'Y'                                       S01433
     C                     EXSR LMTSP                                     S01433
     C                     END                                            S01433
      *                                                                   S01433
     C                     END                                            S01433
      *                                                                   S01433
     C                     END                                            S01433
      *                                                                   LN0632
      ** If FRA default required, set up system limit                     LN0632
     C           RDEF      IFEQ 'Y'                                       LN0632
     C                     Z-ADDFRLIM     XRLM                            LN0632
     C                     END                                            LN0632
      *                                                                   LN0632
      ** If IRS default required, set up system limit                     LN0632
     C           IDEF      IFEQ 'Y'                                       LN0632
     C                     Z-ADDIRLIM     XILM                            LN0632
     C                     END                                            LN0632
      *                                                                   LN0632
     C                     END
     C**
0593 C                     ENDSR                                       **
0594 C**
     C********************************************************************
     C**  LMTSF SR SETS UP LIMIT ARRAYS FOR FX
     C**  INPUT - XFDAA - PERIOD ARRAY
     C**          XFPC - PERCENTAGE ARRAY
     C**          FLAMS - LIMIT AMOUNT
     C**   IF ANY ELEMENT IS BLANK OR 999
     C**   THE CORRESPONDING ELEMENTS IN XFDA & XFDT ARE SET TO NINES.
     C**   ELSE,XFDT IS CALCULATED BY ADDING RUN DATE (BJAKTX) TO XFDA,
     C**        XFLM,IS CALCULATED BY MULTIPLYING LIMIT AMOUNT BY XFPC
     C**
     C           LMTSF     BEGSR                           **  LMTSF **
     C                     Z-ADD0         D       20
     C           XFDAA,1   IFEQ 'SP '                                     S01433
     C**********           MOVE 'Y'       FXSP    1                                   S01433 BUG8901
     C                     END                                            S01433
     C********   XFDAA,1   COMP 'SP '                    71               S01433
     C           LMTS1     TAG                             ** LMTS1   **
     C**
     C           D         ADD  1         D
     C           XFDAA,D   COMP 'SP '                    71               S01433
     C********** XFDAA,D   COMP '   '                    88               E309
     C           XFDAA,D   COMP '000'                    88               E309
     C           XFDAA,D   COMP '999'                    87
     C**
     C   88                Z-ADD999       XFDA,D
     C  N88                MOVE XFDAA,D   XFDA,D                          S01433
     C*
     C**
     C           XFDA,D    ADD  BJRDNB    XFDT,D
     C   88
     COR 87                Z-ADD99999     XFDT,D
     C   88                                                               S01433
     COR 87                Z-ADD99999     XFDT1                           S01433
     C**
     C**N88***   FLAMS     MULT XFPC,D    XFLM,D                          S01433
     C**                                                                  S01433
     C           FXFAS     MULT XFPC,D    XFLM,D                          S01433
     C********** *IN71     IFEQ '1'                                                   S01433 BUG8901
     C           FLAMS     MULT XFPC,1    XFLM1                           S01433
     C**********           END                                                        S01433 BUG8901
     C           D         COMP 6                      86                 S01433
     C**
     C   71                Z-ADDSP        XFDA,1                          S01433
     C   71                Z-ADDSP        XFDA1                           S01433
     C   71      SP        ADD  BJRDNB    XFDT,1                          S01433
     C   71      SP        ADD  BJRDNB    XFDT1                           S01433
     C   86N87N88          GOTO LMTS1
     C***71****            Z-ADDSP        XFDA,1                          S01433
     C***71****  SP        ADD  BJRDNB    XFDT,1                          S01433
     C                     ENDSR
     C**
     C********************************************************************S01433
     C**  LMTSP SR SETS UP LIMIT ARRAYS FOR PM                            S01433
     C**  INPUT - XPDAA - PERIOD ARRAY                                    S01433
     C**          XPPC - PERCENTAGE ARRAY                                 S01433
     C**          PFAMS - LIMIT AMOUNT                                    S01433
     C**   IF ANY ELEMENT IS BLANK OR 999                                 S01433
     C**   THE CORRESPONDING ELEMENTS IN XPDA & XPDT ARE SET TO NINES.    S01433
     C**   ELSE,XPDT IS CALCULATED BY ADDING RUN DATE (BJAKTX) TO XPDA,   S01433
     C**        XPLM,IS CALCULATED BY MULTIPLYING LIMIT AMOUNT BY XPPC    S01433
     C**                                                                  S01433
     C           LMTSP     BEGSR                           **  LMTSP **   S01433
     C                     Z-ADD0         D       20                      S01433
     C           XPDAA,1   IFEQ 'SP '                                     S01433
     C                     MOVE 'Y'       PMSP    1                       S01433
     C                     END                                            S01433
     C           LMTSP1    TAG                             ** LMTSP1  **  S01433
     C**                                                                  S01433
     C           D         ADD  1         D                               S01433
     C           XPDAA,D   COMP 'SP '                    78               S01433
     C           XPDAA,D   COMP '000'                    88               S01433
     C           XPDAA,D   COMP '999'                    87               S01433
     C**                                                                  S01433
     C   88                Z-ADD999       XPDA,D                          S01433
     C  N88                MOVE XPDAA,D   XPDA,D                          S01433
     C**                                                                  S01433
     C           XPDA,D    ADD  BJRDNB    XPDT,D                          S01433
     C   88                                                               S01433
     COR 87                Z-ADD99999     XPDT,D                          S01433
     C   88                                                               S01433
     COR 87                Z-ADD99999     XPDT1                           S01433
     C**                                                                  S01433
     C           PFAMS     MULT XPPC,D    XPLM,D                          S01433
     C           *IN78     IFEQ '1'                                       S01433
     C           PSAMS     MULT XPPC,1    XPLM1                           S01433
     C                     END                                            S01433
     C**                                                                  S01433
     C           D         COMP 6                      86                 S01433
     C   78                Z-ADDSP        XPDA,1                          S01433
     C   78                Z-ADDSP        XPDA1                           S01433
     C   78      SP        ADD  BJRDNB    XPDT,1                          S01433
     C   78      SP        ADD  BJRDNB    XPDT1                           S01433
     C   86N87N88          GOTO LMTSP1                                    S01433
     C                     ENDSR                                          S01433
     C**                                                                  S01433
     C********************************************************************S01433
     C****LMTSL*SR SETS UP LIMIT ARRAYS FOR LN                            S01433
     C****INPUT*- XLDAA - PERIOD ARRAY                                    S01433
     C**********  XLPC - PERCENTAGE ARRAY                                 S01433
     C**********  LLAMS - LIMIT AMOUNT                                    S01433
     C****PROCESSES*XLDAA IN THE SAME WAY AS LMTSF                        S01433
     C**  LMTSL SR SETS UP LIMIT ARRAYS FOR MM                            S01433
     C**  INPUT - XMDAA - PERIOD ARRAY                                    S01433
     C**          XMPC - PERCENTAGE ARRAY                                 S01433
     C**          MMAMS - LIMIT AMOUNT                                    S01433
     C**  PROCESSES XMDAA IN THE SAME WAY AS LMTSF                        S01433
     C           LMTSL     BEGSR                           **  LMTSL **
     C                     Z-ADD0         D
     C********   XLDAA,1   COMP 'SP '                    72               S01433
     C           XMDAA,1   COMP 'SP '                    72               S01433
     C           LMTS2     TAG                             **  LMTS2   **
     C**
     C           D         ADD  1         D
     C********   XLDAA,D   COMP '   '                    88               S01433
     C********   XLDAA,D   COMP '000'                    88               S01433
     C********   XLDAA,D   COMP '999'                    87               S01433
     C           XMDAA,D   COMP '000'                    88               S01433
     C           XMDAA,D   COMP '999'                    87               S01433
     C**
     C***88***             Z-ADD999       XLDA,D                          S01433
     C**N88***             MOVE XLDAA,D   XLDA,D                          S01433
     C   88                Z-ADD999       XMDA,D                          S01433
     C  N88                MOVE XMDAA,D   XMDA,D                          S01433
     C**
     C********   XLDA,D    ADD  BJRDNB    XLDT,D                          S01433
     C           XMDA,D    ADD  BJRDNB    XMDT,D                          S01433
     C*R*87*****           Z-ADD99999     XLDT,D                          S01433
     C*R*87*****           Z-ADD99999     XLDT,D                          S01433
     C   88                                                               S01433
     COR 87                Z-ADD99999     XMDT,D                          S01433
     C**
     C**N88****  LLAMS     MULT XLPC,D    XLLM,D                          S01433
     C  N88      MMAMS     MULT XMPC,D    XMLM,D                          S01433
     C**
     C           D         COMP 6                      86
     C   86N87N88          GOTO LMTS2
     C***72*****           Z-ADDSP        XLDA,1                          S01433
     C***72***** SP        ADD  BJRDNB    XLDT,1                          S01433
     C   72                Z-ADDSP        XMDA,1                          S01433
     C   72      SP        ADD  BJRDNB    XMDT,1                          S01433
     C                     ENDSR
     C**
0684 C********************************************************************
     C**   FORMAT & OUTPUT CUST/SYS LIMIT & EXPOSURE   FOR FX
     C**
     C           FXSWRT    BEGSR                           ** FXSWRT **
     C                     SETON                     60
     C                     SETOF                     70
     C**   CALC EXCESS, CHECK FOR ZERO EXPOSURE
     C                     EXSR EXSFS
     C**   IF NOT ZERO, PRINT. IN60 STILL ON IF ZERO
     C           *IN60     IFNE '1'
0295 C**                                                               ***
     C**   IF U1 NOT ON, PRINT EVEN IF EXPOSURE LESS THAN LIMIT.
     C**    IF U1 ON, ONLY PRINT IF EXPOSURE GREATER THAN LIMIT.
     C           *INU1     IFEQ '0'
     C           *INU1     OREQ '1'
     C           *IN70     ANDEQ'1'
0430 C**
0431 C**   PRINT DETAILS
0432 C                     Z-ADD0         D
     C**
0433 C           D         DOUEQ6                                      **
     C                     ADD  1         D                               S01433
     C           D         IFEQ 1                                         S01433
     C********** XFDAA,1   ANDEQ'SP'                                      S01433
     C********** FXSP      ANDEQ'Y'                                                   S01433 BUG8901
     C**   MOVE EXPOSURE AMT. TO 10 DIGIT FIELD                           S01433
     C**********           Z-ADDXFXP1     FXPOS                           S01433
     C                     Z-ADDXFXP1     FXPOSS 100                      S01433
     C**********           ELSE                                           S01433
     C                     END                                            S01433
0442 C**   MOVE EXPOSURE AMT. TO 10 DIGIT FIELD
0443 C                     Z-ADDXFXP,D    FXPOS  100
     C**********           END                                            S01433
0446 C**   PRINT 1ST LINE
     C           D         IFEQ 1                                         S01433
     C**   PRINT CUST IF NOT ALREADY DONE
     C           NAMPRT    IFEQ 'N'
     C           PTNU      COMP *BLANK                   45
     C  N45      PTNU      COMP '000000'                 45
     C                     EXCPTCUSTO
     C                     MOVE 'Y'       NAMPRT
     C                     END
     C**
0447 C  N43                EXCPTDASH1
     C********** XFDAA,1   IFEQ 'SP'                                      S01433
     C********** FXSP      IFEQ 'Y'                                                   S01433 BUG8901
     C********             EXCPTFXLIN1                                    S01433
     C                     EXCPTFXLN1S                                    S01433
     C                     EXCPTFXLN1F                                    S01433
     C**********           ELSE                                                       S01433 BUG8901
     C**********           EXCPTFXLN1F                                                S01433 BUG8901
     C**********           END                                                        S01433 BUG8901
     C                     ADD  1         RLIST   50
     C                     ELSE
0437 C**   PRINT LINES 2-6 IF REQD
0438 C**   - TEST IF PERIOD END DATE ZERO
0439 C           XFDT,D    COMP 0                    53    PRINT
0447 C   53                EXCPTFXLIN2
     C                     END                                            S01433
0448 C**
0449 C**   - CALCULATE NEXT START OF PERIOD
0450 C           XFDA,D    ADD  1         NEXTF   30
0452 C**
     C                     END
     C  N43                EXCPTDASH2
     C                     END                             *inu1=1
     C                     END
     C**
     C                     ENDSR
     C**
     C********************************************************************S01433
     C**   FORMAT & OUTPUT CUST/SYS LIMIT & EXPOSURE FOR PM               S01433
     C**                                                                  S01433
     C           PMSWRT    BEGSR                           ** PMSWRT **   S01433
     C                     SETON                     60                   S01433
     C                     SETOF                     70                   S01433
     C**   CALC EXCESS, CHECK FOR ZERO EXPOSURE                           S01433
     C                     EXSR EXSPS                                     S01433
     C**   IF NOT ZERO, PRINT. IN60 STILL ON IF ZERO                      S01433
     C           *IN60     IFNE '1'                                       S01433
     C**                                                                  S01433
     C**   IF U1 NOT ON, PRINT EVEN IF EXPOSURE LESS THAN LIMIT.          S01433
     C**    IF U1 ON, ONLY PRINT IF EXPOSURE GREATER THAN LIMIT.          S01433
     C           *INU1     IFEQ '0'                                       S01433
     C           *INU1     OREQ '1'                                       S01433
     C           *IN70     ANDEQ'1'                                       S01433
     C**                                                                  S01433
     C**   PRINT DETAILS                                                  S01433
     C                     Z-ADD0         D                               S01433
     C**                                                                  S01433
     C           D         DOUEQ6                                         S01433
     C                     ADD  1         D                               S01433
     C           D         IFEQ 1                                         S01433
     C********** XPDAA,1   ANDEQ'SP'                                      S01433
     C           PMSP      ANDEQ'Y'                                       S01433
     C**   MOVE EXPOSURE AMT. TO 10 DIGIT FIELD                           S01433
     C**********           Z-ADDXPXP1     PXPOS                           S01433
     C                     Z-ADDXPXP1     PXPOSS 100                      S01433
     C**********           ELSE                                           S01433
     C                     END                                            S01433
     C**   MOVE EXPOSURE AMT. TO 10 DIGIT FIELD                           S01433
     C                     Z-ADDXPXP,D    PXPOS  100                      S01433
     C**********           END                                            S01433
     C**   PRINT 1ST LINE                                                 S01433
     C           D         IFEQ 1                                         S01433
     C**   PRINT CUST IF NOT ALREADY DONE                                 S01433
     C           NAMPRT    IFEQ 'N'                                       S01433
     C           PTNU      COMP *BLANK                   45               S01433
     C  N45      PTNU      COMP '000000'                 45               S01433
     C                     EXCPTCUSTO                                     S01433
     C                     MOVE 'Y'       NAMPRT                          S01433
     C                     END                                            S01433
     C**                                                                  S01433
     C  N43                EXCPTDASH1                                     S01433
     C********** XPDAA,D   IFEQ 'SP'                                      S01433
     C           PMSP      IFEQ 'Y'                                       S01433
     C                     EXCPTPMLN1S                                    S01433
     C                     EXCPTPMLN1F                                    S01433
     C                     ELSE                                           S01433
     C                     EXCPTPMLN1F                                    S01433
     C                     END                                            S01433
     C                     ADD  1         RLIST   50                      S01433
     C                     ELSE                                           S01433
     C**   PRINT LINES 2-6 IF REQD                                        S01433
     C**   - TEST IF PERIOD END DATE ZERO                                 S01433
     C           XPDT,D    COMP 0                    55    PRINT          S01433
     C   55                EXCPTPMLIN2                                    S01433
     C                     END                                            S01433
     C**                                                                  S01433
     C**   - CALCULATE NEXT START OF PERIOD                               S01433
     C           XPDA,D    ADD  1         NEXTP   30                      S01433
     C**                                                                  S01433
     C                     END                                            S01433
     C  N43                EXCPTDASH2                                     S01433
     C                     END                             *inu1=1        S01433
     C                     END                                            S01433
     C**                                                                  S01433
     C                     ENDSR                                          S01433
     C**                                                                  S01433
0684 C********************************************************************
     C*****FORMAT*& OUTPUT CUST/SYS LIMIT & EXPOSURE   FOR LENDING        S01433
     C**   FORMAT & OUTPUT CUST/SYS LIMIT & EXPOSURE FOR MONEY MARKET     S01433
     C**
     C           LNSWRT    BEGSR                           ** LNSWRT **
     C                     SETON                     60
     C                     SETOF                     70
     C**   CALC EXCESS, CHECK FOR ZERO EXPOSURE
     C                     EXSR EXSLS
     C**   IF NOT ZERO, PRINT. IN60 STILL ON IF ZERO
     C           *IN60     IFNE '1'
0295 C**                                                               ***
     C**   IF U1 NOT ON, PRINT EVEN IF EXPOSURE LESS THAN LIMIT.
     C**    IF U1 ON, ONLY PRINT IF EXPOSURE GREATER THAN LIMIT.
     C           *INU1     IFEQ '0'
     C           *INU1     OREQ '1'
     C           *IN70     ANDEQ'1'
0430 C**
0431 C**   PRINT DETAILS
0432 C                     Z-ADD0         D
     C**
0433 C           D         DOUEQ6                                      **
0434 C                     ADD  1         D
0442 C**   MOVE EXPOSURE AMT. TO 10 DIGIT FIELD
     C********             Z-ADDXLXP,D    LXPOS  100                      S01433
     C                     Z-ADDXMXP,D    LXPOS  100                      S01433
0446 C**   PRINT 1ST LINE
     C           D         IFEQ 1
     C**   PRINT CUST IF NOT ALREADY DONE
     C           NAMPRT    IFEQ 'N'
     C           PTNU      COMP *BLANK                   45
     C  N45      PTNU      COMP '000000'                 45
     C                     EXCPTCUSTO
     C                     MOVE 'Y'       NAMPRT
     C                     END
     C**
0447 C  N43                EXCPTDASH1
0447 C                     EXCPTLNLIN1
     C                     ADD  1         RLIST   50
     C                     Z-ADD1         NEXTL                           S01433
     C                     ELSE
0437 C**   PRINT LINES 2-6 IF REQD
0438 C**   - TEST IF PERIOD END DATE ZERO
     C********   XLDT,D    COMP 0                    54    PRINT          S01433
     C           XMDT,D    COMP 0                    54    PRINT          S01433
0447 C   54                EXCPTLNLIN2
     C                     END
0448 C**
0449 C**   - CALCULATE NEXT START OF PERIOD
     C********   XLDA,D    ADD  1         NEXTL   30                      S01433
     C           XMDA,D    ADD  1         NEXTL   30                      S01433
0452 C**
     C                     END
     C/COPY WNCPYSRC,DL0762AC24
      *                                                                   CDL006
      ** If CDL006 is installed                                           CDL006
      *                                                                   CDL006
     C           CDL006    IFEQ 'Y'                                       CDL006
     C                     MOVE *ON       *IN80                           CDL006
      *                                                                   CDL006
     C                     Z-ADD0         D                               CDL006
      *                                                                   CDL006
     C           D         DOUEQ6                                         CDL006
     C                     ADD  1         D                               CDL006
      *                                                                   CDL006
      ** Move exposure amount to 10 digit field                           CDL006
      *                                                                   CDL006
     C                     Z-ADDSIXP,D    FIXPOS 100                      CDL006
      *                                                                   CDL006
      ** Print 1st line                                                   CDL006
      *                                                                   CDL006
     C           D         IFEQ 1                                         CDL006
      *                                                                   CDL006
      ** Print Cust if not already done                                   CDL006
      *                                                                   CDL006
     C           NAMPRT    IFEQ 'N'                                       CDL006
     C           PTNU      COMP *BLANK                   45               CDL006
     C  N45      PTNU      COMP '000000'                 45               CDL006
     C                     EXCPTCUSTO                                     CDL006
     C                     MOVE 'Y'       NAMPRT                          CDL006
     C                     END                                            CDL006
      *                                                                   CDL006
     C                     EXCPTSILIN1                                    CDL006
     C                     ADD  1         RLIST   50                      CDL006
     C                     Z-ADD1         FIEXTL                          CDL006
     C                     ELSE                                           CDL006
      *                                                                   CDL006
      ** Print Lines 2-6 if required                                      CDL006
      ** - Test if period end date zero                                   CDL006
      *                                                                   CDL006
     C           SIDT,D    COMP 0                    61    PRINT          CDL006
     C   61                EXCPTSILIN2                                    CDL006
     C                     END                                            CDL006
      *                                                                   CDL006
      ** - Calculate next start of period                                 CDL006
      *                                                                   CDL006
     C           SIDA,D    ADD  1         FIEXTL  30                      CDL006
      *                                                                   CDL006
     C                     END                                            CDL006
      *                                                                   CDL006
     C                     END                                            CDL006
     C  N43                EXCPTDASH2
     C                     END                             *inu1=1
     C                     END
     C**
     C                     ENDSR
     C**
0684 C********************************************************************
      /EJECT                                                              S01157
      ********************************************************************S01157
      *                                                                  *S01157
      *    FRA - FORMAT & OUTPUT CUST/SYS LIMIT & EXPOSURE               *S01157
      *                                                                  *S01157
      ********************************************************************S01157
      *                                                                   S01157
     C           FRSWRT    BEGSR                           ** FRSWRT **   S01157
      *                                                                   S01157
     C                     MOVE '1'       *IN60                           S01157
     C                     MOVE '0'       *IN70                           S01157
      *                                                                   S01157
      *  Calculate Excess Exposure, Check for Zero Exposure               S01157
     C                     EXSR EXSRS                                     S01157
      *                                                                   S01157
      *  If Not Zero, PRINT...*IN60 still ON if Zero                      S01157
     C           *IN60     IFNE '1'                                       S01157
      *                                                                   S01157
      *  If U1 NOT on, PRINT even if exposure LESS than Limit.            S01157
      *  If U1 on, only PRINT if exposure GREATER than Limit.             S01157
     C           *INU1     IFEQ '0'                                       S01157
     C           *INU1     OREQ '1'                                       S01157
     C           *IN70     ANDEQ'1'                                       S01157
      *                                                                   S01157
      *  Print Customer if not already done.                              S01157
     C           NAMPRT    IFEQ 'N'                                       S01157
     C           PTNU      COMP *BLANK                   45               062422
     C  N45      PTNU      COMP '000000'                 45               062422
     C                     EXCPTCUSTO                                     S01157
     C                     MOVE 'Y'       NAMPRT                          S01157
     C                     END                                            S01157
      *                                                                   S01157
      *  Print details.                                                   S01157
     C  N43                EXCPTDASH1                                     S01157
      *                                                                   S01157
     C                     EXCPTSRLIN                                     S01157
      *                                                                   S01157
     C  N43                EXCPTDASH2                                     S01157
      *                                                                   S01157
     C                     ADD  1         RLIST   50                      S01157
      *                                                                   S01157
      ***Initialise*exposure*field.***                             S01157 099251
     C***********          Z-ADD0         RXPOS                    S01157 099251
     C                     END                                            S01157
      *  Initialise exposure field.                                       099251
     C                     Z-ADD0         RXPOS                           099251
     C                     END                                            S01157
      *                                                                   S01157
     C                     ENDSR                           *** FRSWRT *** S01157
      *                                                                   S01157
      ********************************************************************S01157
      /EJECT                                                              S01157
      ********************************************************************S01157
      *                                                                  *S01157
      *    IRS - FORMAT & OUTPUT CUST/SYS LIMIT & EXPOSURE               *S01157
      *                                                                  *S01157
      ********************************************************************S01157
      *                                                                   S01157
     C           IRSWRT    BEGSR                           ** IRSWRT **   S01157
      *                                                                   S01157
     C                     MOVE '1'       *IN60                           S01157
     C                     MOVE '0'       *IN70                           S01157
      *                                                                   S01157
      *  Calculate Excess Exposure, Check for Zero Exposure               S01157
     C                     EXSR EXSIS                                     S01157
      *                                                                   S01157
      *  If Not Zero, PRINT...*IN60 still ON if Zero                      S01157
     C           *IN60     IFNE '1'                                       S01157
      *                                                                   S01157
      *  If U1 NOT on, PRINT even if exposure LESS than Limit.            S01157
      *  If U1 on, only PRINT if exposure GREATER than Limit.             S01157
     C           *INU1     IFEQ '0'                                       S01157
     C           *INU1     OREQ '1'                                       S01157
     C           *IN70     ANDEQ'1'                                       S01157
      *                                                                   S01157
      *  Print Customer if not already done.                              S01157
     C           NAMPRT    IFEQ 'N'                                       S01157
     C           PTNU      COMP *BLANK                   45               062422
     C  N45      PTNU      COMP '000000'                 45               062422
     C                     EXCPTCUSTO                                     S01157
     C                     MOVE 'Y'       NAMPRT                          S01157
     C                     END                                            S01157
      *                                                                   S01157
      *  Print details.                                                   S01157
     C  N43                EXCPTDASH1                                     S01157
      *                                                                   S01157
     C                     EXCPTSILIN                                     S01157
      *                                                                   S01157
     C  N43                EXCPTDASH2                                     S01157
      *                                                                   S01157
     C                     ADD  1         RLIST   50                      S01157
      *                                                                   S01157
      ***Initialise*exposure*field.***                             S01157 099251
     C***********          Z-ADD0         IXPOS                    S01157 099251
     C                     END                                            S01157
      *  Initialise exposure field.                                       099251
     C                     Z-ADD0         IXPOS                           099251
     C                     END                                            S01157
      *                                                                   S01157
     C                     ENDSR                           *** IRSWRT *** S01157
      *                                                                   S01157
     C********************************************************************S01157
      /EJECT                                                              S01157
0595 C********************************************************************
     C**   SYSTEM LEVEL LIMITS
0668 C**   EXSFS  SR. WORKS OUT EXCESS EXPOSURE FOR FX
0669 C**   -FIRST ROUNDS EXPOSURE FOR EACH PERIOD TO NEAREST 1000 UNITS
0670 C**   -THEN COMPARES EXPOSURE AMOUNTS TO CORRESP. LIMIT AMOUNTS.
0671 C           EXSFS     BEGSR                           **  EXSFS   **
     C           XFXP1     DIV  1000      XFXP1     H                     S01433
     C   60      XFXP1     COMP 0                        60               S01433
     C           XFXP1     COMP XFLM1                89                   S01433
     C   89                SETON                     70                   S01433
     C   89      XFXP1     SUB  XFLM1     XFXS1  100                      S01433
0672 C                     Z-ADD0         D
0673 C           EXSFS1    TAG                             **  EXSFS1  **
0674 C           D         ADD  1         D
0675 C           XFXP,D    DIV  1000      XFXP,D    H
     C   60      XFXP,D    COMP 0                        60
0676 C           XFXP,D    COMP XFLM,D               89
0677 C   89      XFXP,D    SUB  XFLM,D    XFXS,D
     C   89                SETON                     70
0678 C**
0679 C**   LOOP ROUND AGAIN IF LESS THAN 6 PERIODS HAVE BEEN PROCESSED
0680 C           D         COMP 6                      89
0681 C   89                GOTO EXSFS1
0682 C                     ENDSR
0683 C**
      /EJECT                                                              S01433
     C********************************************************************S01433
     C**   SYSTEM LEVEL LIMITS                                            S01433
     C**   EXSPS  SR. WORKS OUT EXCESS EXPOSURE FOR PM                    S01433
     C**   -FIRST ROUNDS EXPOSURE FOR EACH PERIOD TO NEAREST 1000 UNITS   S01433
     C**   -THEN COMPARES EXPOSURE AMOUNTS TO CORRESP. LIMIT AMOUNTS.     S01433
     C           EXSPS     BEGSR                           **  EXSPS   ** S01433
     C           XPXP1     DIV  1000      XPXP1     H                     S01433
     C   60      XPXP1     COMP 0                        60               S01433
     C           XPXP1     COMP XPLM1                89                   S01433
     C   89                SETON                     70                   S01433
     C   89      XPXP1     SUB  XPLM1     XPXS1  100                      S01433
     C                     Z-ADD0         D                               S01433
     C           EXSPS1    TAG                             **  EXSPS1  ** S01433
     C           D         ADD  1         D                               S01433
     C           XPXP,D    DIV  1000      XPXP,D    H                     S01433
     C   60      XPXP,D    COMP 0                        60               S01433
     C           XPXP,D    COMP XPLM,D               89                   S01433
     C   89      XPXP,D    SUB  XPLM,D    XPXS,D                          S01433
     C   89                SETON                     70                   S01433
     C**                                                                  S01433
     C**   LOOP ROUND AGAIN IF LESS THAN 6 PERIODS HAVE BEEN PROCESSED    S01433
     C           D         COMP 6                      89                 S01433
     C   89                GOTO EXSPS1                                    S01433
     C                     ENDSR                                          S01433
     C**                                                                  S01433
0685 C********************************************************************
     C**   SYSTEM LEVEL LIMITS
     C*****EXSLS**SR. WORKS OUT EXCESS EXPOSURE FOR LOANS.                S01433
     C**   EXSLS  SR. WORKS OUT EXCESS EXPOSURE FOR MONEY MARKET.         S01433
0687 C           EXSLS     BEGSR                           **  EXSLS **
0688 C                     Z-ADD0         D
0689 C           EXSLS1    TAG                             **  EXSLS1  **
0690 C           D         ADD  1         D
     C********   XLXP,D    DIV  1000      XLXP,D    H                     S01433
     C***60***   XLXP,D    COMP 0                        60               S01433
     C********   XLXP,D    COMP XLLM,D               89                   S01433
     C***89***   XLXP,D    SUB  XLLM,D    XLXS,D                          S01433
     C           XMXP,D    DIV  1000      XMXP,D    H                     S01433
     C   60      XMXP,D    COMP 0                        60               S01433
     C           XMXP,D    COMP XMLM,D               89                   S01433
     C   89      XMXP,D    SUB  XMLM,D    XMXS,D                          S01433
     C   89                SETON                     70
0694 C**
0695 C           D         COMP 6                      89
0696 C   89                GOTO EXSLS1
     C/COPY WNCPYSRC,DL0762AC25
      *                                                                   CDL006
      ** If CDL006 is installed                                           CDL006
      *                                                                   CDL006
     C           CDL006    IFEQ 'Y'                                       CDL006
     C                     Z-ADD0         D                               CDL006
     C           EXSLS2    TAG                                            CDL006
     C           D         ADD  1         D                               CDL006
     C           SIXP,D    DIV  1000      SIXP,D    H                     CDL006
     C   60      SIXP,D    COMP 0                        60               CDL006
     C           SIXP,D    COMP SILM,D               89                   CDL006
     C   89      SIXP,D    SUB  SILM,D    SIXS,D                          CDL006
     C   89                SETON                     70                   CDL006
      *                                                                   CDL006
     C           D         COMP 6                      89                 CDL006
     C   89                GOTO EXSLS2                                    CDL006
      *                                                                   CDL006
     C                     ENDIF                                          CDL006
0697 C                     ENDSR
0698 C**
0699 C********************************************************************
      /EJECT                                                              S01157
      ********************************************************************S01157
      *                                                                  *S01157
      *    EXSRS - CALCULATE FRA EXCESS EXPOSURE                         *S01157
      *          - SYSTEM LEVEL                                          *S01157
      ********************************************************************S01157
      *                                                                   S01157
     C           EXSRS     BEGSR                           ** EXSRS **    S01157
      *                                                                   S01157
      ** FRA EVENT                                                        S01157
      ** Convert exposure amount to thousands first                       S01157
     C           RXPOS     DIV  1000      RXPOS     H                     S01157
     C           RXPOS     SUB  XRLM      XRXS                            S01157
     C           XRXS      IFLT 0                                         S01157
     C                     Z-ADD0         XRXS   100                      S01157
     C                     ELSE                                           S01157
     C                     SETON                         70               S01157
     C                     END                                            S01157
      *                                                                   S01157
      ** If exposure is non-zero, then set-off ind 60                     S01157
     C           RXPOS     IFGT 0                                         S01157
     C                     MOVE '0'       *IN60                           S01157
     C                     END                                            S01157
      *                                                                   S01157
     C                     ENDSR                           *** EXSRC ***  S01157
      *                                                                   S01157
      ********************************************************************S01157
      /EJECT                                                              S01157
      ********************************************************************S01157
      *                                                                  *S01157
      *    EXSIS - CALCULATE IRS EXCESS EXPOSURE                         *S01157
      *          - SYSTEM LEVEL                                          *S01157
      ********************************************************************S01157
      *                                                                   S01157
     C           EXSIS     BEGSR                           ** EXSIS **    S01157
      *                                                                   S01157
      ** IRS EVENT                                                        S01157
      ** Convert exposure amount to thousands first                       S01157
     C           IXPOS     DIV  1000      IXPOS     H                     S01157
     C           IXPOS     SUB  XILM      XIXS                            S01157
     C           XIXS      IFLT 0                                         S01157
     C                     Z-ADD0         XIXS   100                      S01157
     C                     ELSE                                           S01157
     C                     SETON                         70               S01157
     C                     END                                            S01157
      *                                                                   S01157
      ** If exposure is non-zero, then set-off ind 60                     S01157
     C           IXPOS     IFGT 0                                         S01157
     C                     MOVE '0'       *IN60                           S01157
     C                     END                                            S01157
      *                                                                   S01157
     C                     ENDSR                           *** EXSIS ***  S01157
      *                                                                   S01157
      ********************************************************************S01157
      /EJECT                                                              S01157
0848 C********************************************************************
0849 C**
0850 C**   ZDATE2 SR. TO CONVERT A DAY NUMBER TO DATE FORMATS.
0851 C**
0852 C**   THE YEAR 2000, BEING DIVISIBLE BY 400, IS A LEAP YEAR.
0853 C**
0854 C           ZDATE2    BEGSR                           *** ZDATE2 ***
0855 C**
0856 C**   CLEAR DATE FIELDS.
0857 C                     Z-ADD0         ZDATE   60
0858 C                     MOVEL'       ' ZADATE  7
0859 C**
0860 C**   CALCULATION TO DEFINE INPUT DAY NUMBER.
0861 C                     Z-ADDZDAYNO    ZDAYNO  50
0862 C**
0863 C**   DETERMINE YEAR NUMBER.
0864 C**
0865 C**   ADJUST DAY NUMBER IN CASE LAST DAY OF YEAR.
0866 C           ZDAYNO    SUB  1         ZDAYN1  50   99
0867 C   99                GOTO ZDEND2
0868 C**
0869 C**   CALCULATE NUMBER OF 4 YEAR SPANS SINCE 31/12/1971.
0870 C           ZDAYN1    DIV  1461      ZLYR    20
0871 C                     MVR            ZDAYN1           SAVE REMAINING
0872 C**                                                   DAYS
0873 C**   CALCULATE NUMBER OF REMAINING YEARS.
0874 C                     Z-ADD1         ZWRK2   20
0875 C           ZDTAG1    TAG                             ** ZDTAG1 TAG *
0876 C           ZDAYN1    COMP ZYDY,ZWRK2             90
0877 C  N90      ZWRK2     ADD  1         ZWRK2
0878 C  N90                GOTO ZDTAG1
0879 C           ZWRK2     SUB  1         ZWRK2          91LEAP YR, 91 ON
0880 C**
0881 C**   DECREMENT DAY NO. BY DAYS IN REMAINING YEARS.
0882 C  N91      ZDAYN1    SUB  ZYDY,ZWRK2ZDAYN1
0883 C**
0884 C**   CALCULATE ACTUAL YEAR NUMBER.
0885 C           ZLYR      MULT 4         ZWRK3   30
0886 C           ZWRK3     ADD  72        ZWRK3            BASE IS 1972
0887 C                     Z-ADDZWRK3     ZYEAR   20
0888 C           ZYEAR     ADD  ZWRK2     ZYEAR            YEAR
0889 C**
0890 C**   DETERMINE MONTH NUMBER.
0891 C**
0892 C**   ADJUST DAY NO. IN CASE LAST DAY OF LEAP YEAR FEBRUARY.
0893 C                     SETOF                     9293
0894 C   91      ZDAYN1    COMP 59                     9293
0895 C   91N92   ZDAYN1    SUB  1         ZDAYN1
0896 C**
0897 C**   CALCULATE MONTH NUMBER.
0898 C                     Z-ADD2         ZWRK2
0899 C           ZDTAG2    TAG                             ** ZDTAG2 TAG *
0900 C           ZDAYN1    COMP ZMDY,ZWRK2             94
0901 C  N94      ZWRK2     ADD  1         ZWRK2
0902 C  N94                GOTO ZDTAG2
0903 C           ZWRK2     SUB  1         ZWRK2
0904 C**
0905 C                     Z-ADDZWRK2     ZMTH    20       MONTH
0906 C**
0907 C**   DETERMINE DAY OF MONTH.
0908 C**
0909 C**   ADD BACK LAST DAY OF YEAR ADJUSTMENT.
0910 C           ZDAYN1    ADD  1         ZDAYN1
0911 C**
0912 C**   CALCULATE DAY OF MONTH.
0913 C           ZDAYN1    SUB  ZMDY,ZWRK2ZDAY    20       DAY
0914 C**
0915 C**   ADD BACK LEAP YEAR 29TH FEBUARY ADJUSTMENT, IF REQUIRED.
0916 C   93      ZDAY      ADD  1         ZDAY
0917 C**
0918 C**   FORMAT DATE, DDMMYY OR MMDDYY.
0919 C  N98                MOVELZDAY      ZWRK4   40
0920 C   98                MOVE ZDAY      ZWRK4
0921 C  N98                MOVE ZMTH      ZWRK4
0922 C   98                MOVELZMTH      ZWRK4
0923 C                     MOVELZWRK4     ZDATE
0924 C                     MOVE ZYEAR     ZDATE
0925 C**
0926 C**   FORMAT ALPHA DATE, DDMMMYY.
0927 C           ZDAY      COMP 10                     95
0928 C                     MOVELZDAY      ZWRK5   5
0929 C   95                MOVEL' '       ZWRK5
0930 C                     MOVE ZMNM,ZMTH ZWRK5
0931 C                     MOVELZWRK5     ZADATE
0932 C                     MOVE ZYEAR     ZADATE
0933 C**
0934 C           ZDEND2    ENDSR                           * ZDEND2 ENDSR*
0935 C**
0936 C**
0700 C********************************************************************
     C/EJECT
0699 C********************************************************************
     C**
     C**   P/DL0131 TO GET DEFAULT LIMITS FOR SYSTEM OR COMPANY LEVEL
     C**
     C           DL0131    BEGSR
     C********             Z-ADD0         FXLIM   90                      S01433
     C                     Z-ADD0         FXLMS   90                      S01433
     C                     Z-ADD0         FXLMF   90                      S01433
     C                     Z-ADD0         PMLMS   90                      S01433
     C                     Z-ADD0         PMLMF   90                      S01433
     C                     Z-ADD0         LNLIM   90
     C                     MOVE 'Y'       FXSAME  1
     C                     MOVE 'Y'       PMSAME  1                       S01433
     C                     MOVE 'Y'       LNSAME  1
     C                     MOVE *BLANKS   FXPER  18
     C                     MOVE *BLANKS   PMPER  18                       S01433
     C                     MOVE *BLANKS   LNPER  18
     C                     MOVE *BLANKS   FXPC   18
     C                     MOVE *BLANKS   PMPC   18                       S01433
     C                     MOVE *BLANKS   LNPC   18
     C********             CALL 'DL0131'                                  S01433
     C                     CALL 'DL0131A'                                 S01433
     C                     PARM           CUST
     C                     PARM           LEVEL
     C                     PARM           ENTITY
     C                     PARM           FDEF
     C********             PARM           LDEF                            S01433
     C                     PARM           MDEF                            S01433
     C                     PARM           PDEF                            S01433
     C******************   PARM           FRA     1                       S01157
     C******************   PARM           IRS     1                       S01157
     C                     PARM           RDEF    1                       S01157
     C                     PARM           IDEF    1                       S01157
     C********             PARM           FXLIM                           S01433
     C                     PARM           FXLMS                           S01433
     C                     PARM           FXLMF                           S01433
     C                     PARM           LNLIM
     C                     PARM           PMLMS                           S01433
     C                     PARM           PMLMF                           S01433
     C                     PARM           FRLIM   90
     C                     PARM           IRLIM   90
     C                     PARM           FXSAME
     C                     PARM           LNSAME
     C                     PARM           PMSAME                          S01433
     C                     PARM           FXPER
     C                     PARM           LNPER
     C                     PARM           PMPER                           S01433
     C                     PARM           FXPC
     C                     PARM           LNPC
     C                     PARM           PMPC                            S01433
     C                     PARM           BJRDNB
     C                     ENDSR
0719 C********************************************************************
0719 C/COPY ZSRSRC,ZFWDT                                               ***
0719 C/COPY ZSRSRC,ZACCH                                               ***
0700 C********************************************************************
     C**  FIRST CYCLE PROCESS
     C           FIRST     BEGSR                            ** FIRST **
     C**************       SETON                     42OF                 E00013
     C                     SETON                     42                   E00013
     C                     MOVEACPY@      BIS@   80
     C*
     C** OBTAIN BANK DETAILS VIA ACCESS PROGRAM
     C                     CALL 'AOBANKR0'
     C                     PARM '*MSG   ' @RTCD   7
     C                     PARM '*FIRST ' @OPTN   7
     C           SDBANK    PARM SDBANK    DSFDY
     C           @RTCD     IFNE *BLANK
     C                     MOVEL'SDBANKPD'DBFILE 10        ************
     C                     MOVEL'01'      DBASE   3        * DBERR 01 *
     C                     MOVEL@OPTN     DBOPTN  7        ************
     C                     SETON                     U7U8LR
     C                     EXSR *PSSR
     C                     GOTO END
     C                     END
     C*
     C** TEST DATE FORMAT VALUE
0951 C           BJDFIN    COMP 'M'                      98MMDDYY, 98 ON
     C*                                                                   S01157
     C** Obtain MODULE details via ACCESS PROGRAM                         S01157
     C                     CALL 'AOMMODR0'                                S01157
     C                     PARM '*MSG   ' @RTCD   7                       S01157
     C                     PARM '*FIRST ' @OPTN   7                       S01157
     C           SDMMOD    PARM SDMMOD    DSFDY                           S01157
     C           @RTCD     IFNE *BLANK                                    S01157
     C                     MOVEL'SDMMODPD'DBFILE 10        ************   S01157
     C                     MOVEL'04'      DBASE   3        * DBERR 04 *   S01157
     C                     MOVEL@OPTN     DBOPTN  7        ************   S01157
     C                     SETON                     U7U8LR               S01157
     C                     EXSR *PSSR                                     S01157
     C                     GOTO END                                       S01157
     C                     END                                            S01157
     C*                                                                   S01157
      *                                                                   S01498
      ** Call Access Program for Portfolio Lending ICD.                   S01498
     C           BGLMCR    IFEQ 'Y'                                       S01498
     C                     CALL 'AOLOMBR0'                                S01498
     C                     PARM '*MSG    '@RTCD   7                       S01498
     C                     PARM '*FIRST  '@OPTN   7                       S01498
     C           SDLOMB    PARM SDLOMB    DSFDY                           S01498
      *                                                                   S01498
     C           @RTCD     IFNE *BLANK                                    S01498
     C                     MOVEL'SDLOMBPD'DBFILE 10         ************* S01498
     C                     MOVEL'06'      DBASE   3         *DBERROR 006* S01498
     C                     MOVEL@OPTN     DBOPTN  7         ************* S01498
     C                     SETON                     U7U8LR               S01498
     C                     EXSR *PSSR                                     S01498
     C                     GOTO END                                       S01498
     C                     END                                            S01498
     C                     END                                            S01498
     C** Check if FRA/IRS module present.                                 S01157
     C           BGFIIN    IFEQ 'Y'                                       S01157
     C                     MOVE '1'       *IN30                           S01157
     C                     END                                            S01157
     C*
     C** READ DEAL DETAILS VIA ACCESS PROGRAM FOR BASE CCY FOR LIMITS
     C**********           CALL 'AODEALR0'                                                    CGL029
     C                     CALL 'AODEALR1'                                                    CGL029
     C                     PARM '*MSG   ' @RTCD   7
     C                     PARM '*FIRST ' @OPTN   7
     C********** SDDEAL    PARM SDDEAL    DSFDY                                               CGL029
     C           SDDEAL    PARM SDDEAL    DSSDY                                               CGL029
     C           @RTCD     IFNE *BLANK
     C                     MOVEL'SDDEALPD'DBFILE           ************
     C                     MOVEL'02'      DBASE            * DBERR 02 *
     C                     MOVEL@OPTN     DBOPTN           ************
     C                     SETON                     U7U8LR
     C                     EXSR *PSSR
     C                     GOTO END
     C                     END
0951 C*                                                                N
     C** READ CCY DETAILS VIA ACCESS PROGRAM FOR DECIMAL PLACES
     C                     CALL 'AOCURRR0'
     C                     PARM '*MSG   ' @RTCD   7
     C                     PARM '*KEY   ' @OPTN   7
     C                     PARM BNCYCD    @AJCD   3
     C           SDCURR    PARM SDCURR    DSSDY
     C           @RTCD     IFNE *BLANK
     C                     MOVEL'SDCURRPD'DBFILE           ************
     C                     MOVEL'03'      DBASE            * DBERR 03 *
     C                     MOVEL@OPTN     DBOPTN  7        ************
     C                     MOVEL@AJCD     DBKEY  29
     C                     SETON                     U7U8LR
     C                     EXSR *PSSR
     C                     GOTO END
     C                     END
     C*    SAVE DP                                                        S01433
     C           A6NBDP    ADD  1         DEP     10                      S01433
0330 C*
0331 C*    OBTAIN NO. OF DAYS FORWARD FOR 'SP'
0332 C                     Z-ADDBJRDNB    ZDAYNO
0333 C                     MOVE BNCYCD    ZCCY
0334 C                     Z-ADD2         ZNRDYS
0334 C                     MOVE BJSLCD    ZLOC
0335 C                     EXSR ZFWDT
0336 C           ZDYNBR    SUB  BJRDNB    SP      50
     C                     Z-ADDZDYNBR    RUND2   50                      S01433
     C**  CHECK FOR PO 1 - BANK (SYS) LIMITS ONLY
     C           @PROD     COMP '1'                      43
     C**  CHECK FOR PO 2 - FOR ALL ENTITIES
     C           @PROD     COMP '2'                      44
     C**  CHECK FOR PO 3 - FOR ONE ENTITY
     C           @PROD     COMP '3'                      49
     C  N49      @PROD     COMP '4'                      49
     C**  CHECK FOR PO 4 - FOR PARENT & CHILDREN
     C           @PROD     COMP '4'                      50
     C**
     C**  SET RPT HEADING ACCORDING TO PROD OPT.
     C                     MOVE @PROD     @PO     10
     C                     MOVE HDG,@PO   OPTION 22
     C**
     C**  IF PRODUCTION OPTION NOT 1, 2 OR 3 THEN INCORRECT PO
     C  N43N44N49
     CANN50                MOVE HDG,5     OPTION
     C**
     C**  FOR ORIGINATING OR BOOKING BRANCH
     C           @OB       IFEQ 'O'
     C                     MOVE HDG,6     BRANCH 22
     C                     ELSE
     C           @OB       IFEQ 'B'
     C                     MOVE HDG,7     BRANCH
     C                     END
     C                     END
     C/COPY WNCPYSRC,DL0762AC26
      *                                                                   CDL006
      **  Access SAR Details File to determine if Fiduciary Deposits is   CDL006
      **  installed                                                       CDL006
      *                                                                   CDL006
     C                     MOVEL'N'       CDL006  1                       CDL006
     C                     CALL 'AOSARDR0'                                CDL006
     C                     PARM '       ' PRTCD   7                       CDL006
     C                     PARM '*VERIFY' POPTN   7                       CDL006
     C                     PARM 'CDL006'  PSARD   6                       CDL006
      *                                                                   CDL006
     C           PRTCD     IFEQ *BLANK                                    CDL006
     C                     MOVEL'Y'       CDL006                          CDL006
     C                     END                                            CDL006
      *                                                                   CDL006
     C           PRTCD     IFNE *BLANKS                                   CDL006
     C           PRTCD     ANDNE'*NRF   '                                 CDL006
     C                     MOVEL'SCSARDPD'DBFILE                          CDL006
     C                     MOVEL'011'     DBASE                           CDL006
     C                     MOVELPOPTN     DBOPTN                          CDL006
     C                     MOVELPOPTN     DBKEY                           CDL006
     C                     MOVE *ON       *INU7                           CDL006
     C                     MOVE *ON       *INU8                           CDL006
     C                     MOVE *ON       *INLR                           CDL006
     C                     EXSR *PSSR                                     CDL006
     C                     GOTO END                                       CDL006
     C                     ENDIF                                          CDL006
      *                                                                                     BUG10711
      ** Open deals file if Net FX Customer Limits indicator is 'N' but                     BUG10711
      ** feature CDL006 is installed                                                        BUG10711
      *                                                                                     BUG10711
     C           CDL006    IFEQ 'Y'                                                         BUG10711
     C           BNNTCE    ANDNE'Y'                                                         BUG10711
     C                     OPEN DEALS                                                       BUG10711
     C                     ENDIF                                                            BUG10711
0337 C**
0338 C**   SET OF SO THAT FIRST PAGE HEADINGS ARE FETCHED
0339 C************         SETON                         OF               E00013
0340 C**
0341 C           END       ENDSR
     C*                                                                   CDL002
     C*****************************************************************   CDL002
     C           *INZSR    BEGSR                            ** INZSR **   CDL002
     C*****************************************************************   CDL002
     C*                                                                   CDL002
     C* Get Dealing ICD                                                   CDL002
     C**********           CALL 'AODEALR0'                                CDL002              CGL029
     C                     CALL 'AODEALR1'                                                    CGL029
     C                     PARM '*MSG   ' @RTCD                           CDL002
     C                     PARM '*FIRST ' @OPTN                           CDL002
     C********** SDDEAL    PARM SDDEAL    DSFDY                           CDL002              CGL029
     C           SDDEAL    PARM SDDEAL    DSSDY                                               CGL029
     C           @RTCD     IFNE *BLANK                                    CDL002
     C                     MOVEL'SDDEALPD'DBFILE           ************   CDL002
     C                     MOVEL'08'      DBASE            * DBERR 08 *   CDL002
     C                     MOVEL@OPTN     DBOPTN           ************   CDL002
     C                     SETON                     U7U8LR               CDL002
     C                     EXSR *PSSR                                     CDL002
     C                     END                                            CDL002
     C*                                                                   CDL002
     C* FX Netting?                                                       CDL002
     C                     CALL 'AOSARDR0'                                CDL002
     C                     PARM *BLANKS   @RTCD                           CDL002
     C                     PARM '*VERIFY' @OPTN                           CDL002
     C                     PARM 'CDL002'  WSARD   6                       CDL002
     C           SCSARD    PARM SCSARD    DSFDY                           CDL002
     C                     MOVE 'N'       CDL002  1                       CDL002
     C           @RTCD     IFEQ *BLANK                                    CDL002
     C                     MOVE 'Y'       CDL002                          CDL002
     C                     CLEARW#NTCE                                    CDL002
     C*                                                                   CDL002
     C* Net FX Customer Exposure?                                         CDL002
     C           BNNTCE    IFEQ 'Y'                                       CDL002
     C                     MOVE BNNTCE    W#NTCE  1                       CDL002
     C/COPY WNCPYSRC,DL0762AC28
     C                     OPEN DEALS                                     CDL002
     C/COPY WNCPYSRC,DL0762AC29
     C                     OPEN FXNEVTP                                   CDL002
     C                     OPEN FXNEVTN                                   CDL002
     C*   Get first parent net event                                      CDL002
     C                     READ FXNEVTP                  83               CDL002
     C           *IN83     IFEQ *OFF                                      CDL002
     C                     MOVE PASK      W3PASK                          CDL002
     C                     MOVE PTNU      W3PTNU                          CDL002
     C                     MOVE CO        W3CO                            CDL002
     C                     MOVE BR        W3BR                            CDL002
     C                     MOVE *ON       *IN03                           CDL002
     C                     ELSE                                           CDL002
     C*   Get first customer net event                                    CDL002
     C                     READ FXNEVTN                  84               CDL002
     C           *IN84     IFEQ *ON                                       CDL002
     C                     MOVE *HIVAL    W4PASK                          CDL002
     C                     MOVE *HIVAL    W4PTNU                          CDL002
     C                     MOVE *HIVAL    W4CASK                          CDL002
     C                     MOVE *HIVAL    W4CUNR                          CDL002
     C                     MOVE *HIVAL    W4CO                            CDL002
     C                     MOVE *HIVAL    W4BR                            CDL002
     C                     ELSE                                           CDL002
     C                     MOVE PASK      W4PASK                          CDL002
     C                     MOVE PTNU      W4PTNU                          CDL002
     C                     MOVE CASK      W4CASK                          CDL002
     C                     MOVE CUNR      W4CUNR                          CDL002
     C                     MOVE CO        W4CO                            CDL002
     C                     MOVE BR        W4BR                            CDL002
     C                     MOVE *ON       *IN04                           CDL002
     C                     ENDIF                                          CDL002
     C                     ENDIF                                          CDL002
     C                     ENDIF                                          CDL002
     C                     ENDIF                                          CDL002
     C*                                                                   CDL002
     C*                                                                   CDL002
     C                     ENDSR                                          CDL002
     C*                                                                   CDL002
     C*****************************************************************   CDL002
     C           NEVT1     BEGSR                                          CDL002
     C*****************************************************************   CDL002
      *                                                                   CDL002
     C           *IN03     IFEQ *ON                                       CDL002
     C           W3KEYP    ANDLTWRKEYP                                    CDL002
      *                                                                   CDL002
     C           *IN04     OREQ *ON                                       CDL002
     C           W4KEYN    ANDLTWRKEYN                                    CDL002
      *                                                                   CDL002
      * Save event fields and indicators                                  CDL002
     C                     MOVELWREVL     WRSAVE    P                     CDL002
     C                     MOVE PASK      W1PASK                          CDL002
     C                     MOVE PTNU      W1PTNU                          CDL002
     C                     MOVE CO        W1CO                            CDL002
     C                     MOVE BR        W1BR                            CDL002
     C                     MOVE PASK      W2PASK                          CDL002
     C                     MOVE PTNU      W2PTNU                          CDL002
     C                     MOVE CASK      W2CASK                          CDL002
     C                     MOVE CUNR      W2CUNR                          CDL002
     C                     MOVE CO        W2CO                            CDL002
     C                     MOVE BR        W2BR                            CDL002
     C                     MOVE *IN01     WRIN01                          CDL002
     C                     MOVE *IN02     WRIN02                          CDL002
     C                     MOVE *IN44     WRIN44                          CDL002
     C                     MOVE *IN46     WRIN46                          CDL002
     C                     MOVE *IN47     WRIN47                          CDL002
      *                                                                   CDL002
      * Get FX Net again                                                  CDL002
     C           *IN03     IFEQ *ON                                       CDL002
     C           K3PTNU    CHAINFXNEVTP              83                   CDL002
     C                     ELSE                                           CDL002
     C           K4CUNR    CHAINFXNEVTN              84                   CDL002
     C                     ENDIF                                          CDL002
      *                                                                   CDL002
     C                     MOVE PASK      WRPPAS                          CDL002
     C                     MOVE PTNU      WRPPTN                          CDL002
     C                     MOVE CO        WRPCO                           CDL002
     C                     MOVE BR        WRPBR                           CDL002
     C                     MOVE PASK      WRNPAS                          CDL002
     C                     MOVE PTNU      WRNPTN                          CDL002
     C                     MOVE CASK      WRNCAS                          CDL002
     C                     MOVE CUNR      WRNCUN                          CDL002
     C                     MOVE CO        WRNCO                           CDL002
     C                     MOVE BR        WRNBR                           CDL002
      *                                                                   CDL002
     C           *IN03     DOWEQ*ON                                       CDL002
     C           W3KEYP    ANDLTW1KEYP                                    CDL002
     C           *IN83     ANDEQ*OFF                                      126977
     C           *IN04     OREQ *ON                                       CDL002
     C           W4KEYN    ANDLTW2KEYN                                    CDL002
     C           *IN84     ANDEQ*OFF                                      126977
      *                                                                   CDL002
     C                     EXSR NEVTSL                                    CDL002
      *                                                                   CDL002
     C                     EXSR NEVTP                                     CDL002
     C                     ENDDO                                          CDL002
      *                                                                   CDL002
      * Restore event fields and indicators                               CDL002
     C                     MOVELWRSAVE    WREVL                           CDL002
     C                     MOVE PASK      WRPPAS                          CDL002
     C                     MOVE PTNU      WRPPTN                          CDL002
     C                     MOVE CO        WRPCO                           CDL002
     C                     MOVE BR        WRPBR                           CDL002
     C                     MOVE PASK      WRNPAS                          CDL002
     C                     MOVE PTNU      WRNPTN                          CDL002
     C                     MOVE CASK      WRNCAS                          CDL002
     C                     MOVE CUNR      WRNCUN                          CDL002
     C                     MOVE CO        WRNCO                           CDL002
     C                     MOVE BR        WRNBR                           CDL002
     C                     MOVE WRIN01    *IN01                           CDL002
     C                     MOVE WRIN02    *IN02                           CDL002
     C                     MOVE WRIN44    *IN44                           CDL002
     C                     MOVE WRIN46    *IN46                           CDL002
     C                     MOVE WRIN47    *IN47                           CDL002
      *                                                                   CDL002
     C                     ENDIF                                          CDL002
      *                                                                   CDL002
      *                                                                   CDL002
     C           K3PTNU    KLIST                                          CDL002
     C                     KFLD           W3PASK                          CDL002
     C                     KFLD           W3PTNU                          CDL002
     C                     KFLD           W3CO                            CDL002
     C                     KFLD           W3BR                            CDL002
      *                                                                   CDL002
     C           K4CUNR    KLIST                                          CDL002
     C                     KFLD           W4PASK                          CDL002
     C                     KFLD           W4PTNU                          CDL002
     C                     KFLD           W4CASK                          CDL002
     C                     KFLD           W4CUNR                          CDL002
     C                     KFLD           W4CO                            CDL002
     C                     KFLD           W4BR                            CDL002
      *                                                                   CDL002
     C           *LIKE     DEFN *IN01     WRIN01                          CDL002
     C           *LIKE     DEFN *IN02     WRIN02                          CDL002
     C           *LIKE     DEFN *IN44     WRIN44                          CDL002
     C           *LIKE     DEFN *IN46     WRIN46                          CDL002
     C           *LIKE     DEFN *IN47     WRIN47                          CDL002
      *                                                                   CDL002
      *                                                                   CDL002
     C                     ENDSR                                          CDL002
     C*                                                                   CDL002
      *****************************************************************   CDL002
      * Process any Net Group Settlement Customers after last customer*   CDL002
      * with events                                                   *   CDL002
      *****************************************************************   CDL002
     C           NEVTLR    BEGSR                                      *   CDL002
      *****************************************************************   CDL002
      *                                                                   CDL002
      *                                                                   CDL002
     C           *IN83     DOWEQ*OFF                                      CDL002
     C           *IN84     OREQ *OFF                                      CDL002
      *                                                                   CDL002
      * Get FX Net again                                                  CDL002
     C           *IN03     IFEQ *ON                                       CDL002
     C           K3PTNU    CHAINFXNEVTP              83                   CDL002
     C                     ELSE                                           CDL002
     C           K4CUNR    CHAINFXNEVTN              84                   CDL002
     C                     ENDIF                                          CDL002
      *                                                                   CDL002
     C                     MOVE PASK      WRPPAS                          CDL002
     C                     MOVE PTNU      WRPPTN                          CDL002
     C                     MOVE CO        WRPCO                           CDL002
     C                     MOVE BR        WRPBR                           CDL002
     C                     MOVE PASK      WRNPAS                          CDL002
     C                     MOVE PTNU      WRNPTN                          CDL002
     C                     MOVE CASK      WRNCAS                          CDL002
     C                     MOVE CUNR      WRNCUN                          CDL002
     C                     MOVE CO        WRNCO                           CDL002
     C                     MOVE BR        WRNBR                           CDL002
      *                                                                   CDL002
     C                     EXSR NEVTSL                                    CDL002
      *                                                                   CDL002
     C                     EXSR NEVTP                                     CDL002
     C*                                                                   CDL002
     C                     ENDDO                                          CDL002
      *                                                                   CDL002
      *                                                                   CDL002
     C                     ENDSR                                          CDL002
     C*                                                                   CDL002
     C*****************************************************************   CDL002
     C           NEVTSL    BEGSR                                      *   CDL002
     C*****************************************************************   CDL002
      *                                                                   CDL002
     C                     SELEC                                          CDL002
      * Net parent                                                        CDL002
     C           *IN83     WHEQ *OFF                                      CDL002
     C                     MOVE *ON       *IN46                           CDL002
     C                     MOVE PTNU      CUST                            CDL002
     C                     MOVE PTNU      CPARX                           CDL002
      *                                                                   CDL002
     C                     OTHER                                          CDL002
     C                     MOVE *ON       *IN47                           CDL002
     C                     MOVE CUNR      CUST                            CDL002
     C                     MOVE CUNR      CPARX                           CDL002
     C           *IN50     IFEQ *ON                                       CDL002
     C                     MOVE PTNU      CPARX                           CDL002
     C                     ENDIF                                          CDL002
     C                     ENDSL                                          CDL002
      *                                                                   CDL002
      *                                                                   CDL002
     C                     ENDSR                                          CDL002
      *                                                                   CDL002
      *****************************************************************   CDL002
      * Process net group settlement customer.                        *   CDL002
      *****************************************************************   CDL002
     C           NEVTP     BEGSR                                      *   CDL002
      *****************************************************************   CDL002
      *                                                                   CDL002
      *                                                                   CDL002
      * Portfolio Lending on and Portfolio Lending customers not to be    CDL002
      * included?                                                         CDL002
     C           BGLMCR    IFEQ 'Y'                                       CDL002
     C           LBLCDL    ANDEQ'N'                                       CDL002
      *                                                                   CDL002
      * Call Access Program to determine if a LB Customer.                CDL002
     C                     CALL 'AOLBCSR0'                                CDL002
     C                     PARM *BLANKS   @RTCD                           CDL002
     C                     PARM '*KEY   ' @OPTN                           CDL002
     C                     PARM CUST      @AENB  10                       CDL002
     C***********          PARM *BLANKS   @KYST   7                                    CDL002 222373
     C           SDLBCS    PARM SDLBCS    DSSDY                           CDL002
     C*                                                                   CDL002
     C           @RTCD     IFNE *BLANK                                    CDL002
     C           @RTCD     ANDNE'*NRF'                                    CDL002
     C                     MOVEL'SDLBCSPD'DBFILE            ************  CDL002
     C                     MOVEL'10'      DBASE             *DBERROR 10*  CDL002
     C                     MOVEL@OPTN     DBOPTN            ************  CDL002
     C                     MOVELCUST      DBKEY  29                       CDL002
     C                     SETON                     U7U8LR               CDL002
     C                     EXSR *PSSR                                     CDL002
     C                     ENDIF                                          CDL002
      *                                                                   CDL002
      * Customer is a LB customer - ignore.                               CDL002
     C           @RTCD     IFEQ *BLANKS                                   CDL002
     C                     GOTO LRTAG                                     CDL002
     C                     ENDIF                                          CDL002
     C                     ENDIF                                          CDL002
      *                                                                   CDL002
      * Get Client Limits for Branch                                      CDL002
     C                     CALL 'AOCLLMR0'                                CDL002
     C                     PARM *BLANKS   @RTCD                           CDL002
     C                     PARM '*KEY   ' @OPTN                           CDL002
     C                     PARM CUST      @CUST   6                       CDL002
     C                     PARM 'B'       WWLEV   1                       CDL002
     C                     PARM BR        WWENT   3                       CDL002
     C           SDCLLM    PARM SDCLLM    DSFDY                           CDL002
      *                                                                   CDL002
     C           @RTCD     IFEQ *BLANKS                                   CDL002
     C                     MOVE DZFXLT    FLTYB                           CDL002
     C                     MOVE DZFLED    FLEDB                           CDL002
     C                     MOVE DZFLAM    FLAMB                           CDL002
     C                     MOVE DZLLTY    LLTYB                           CDL002
     C                     MOVE DZLLED    LLEDB                           CDL002
     C                     MOVE DZLLAM    LLAMB                           CDL002
     C                     MOVE DZFRLA    RLAMB                           CDL002
     C                     MOVE DZFRED    RLEDB                           CDL002
     C                     MOVE DZIRLM    ILAMB                           CDL002
     C                     MOVE DZIRED    ILEDB                           CDL002
     C                     MOVE DZFXFA    FXFAB                           CDL002
     C                     MOVE DZMMTY    MMTYB                           CDL002
     C                     MOVE DZMMAM    MMAMB                           CDL002
     C                     MOVE DZMMED    MMEDB                           CDL002
     C                     MOVE DZPLTY    PLTYB                           CDL002
     C                     MOVE DZPFAM    PFAMB                           CDL002
     C                     MOVE DZPSAM    PSAMB                           CDL002
     C                     MOVE DZPLED    PLEDB                           CDL002
      *                                                                   CDL002
      * Get FX Limits                                                     CDL002
     C                     CALL 'AOLIMTR0'                                CDL002
     C                     PARM *BLANKS   @RTCD                           CDL002
     C                     PARM '*KEY   ' @OPTN                           CDL002
     C                     PARM DZFXLT    WWLTYP  3                       CDL002
     C           SDLIMT    PARM SDLIMT    DSFDY                           CDL002
      *                                                                   CDL002
     C           @RTCD     IFEQ *BLANKS                                   CDL002
     C                     MOVE A2E1LP    FLEP1B                          CDL002
     C                     MOVE A2E2LP    FLEP2B                          CDL002
     C                     MOVE A2E3LP    FLEP3B                          CDL002
     C                     MOVE A2E4LP    FLEP4B                          CDL002
     C                     MOVE A2E5LP    FLEP5B                          CDL002
     C                     MOVE A2E6LP    FLEP6B                          CDL002
     C                     MOVE A2PL1P    FLPC1B                          CDL002
     C                     MOVE A2PL2P    FLPC2B                          CDL002
     C                     MOVE A2PL3P    FLPC3B                          CDL002
     C                     MOVE A2PL4P    FLPC4B                          CDL002
     C                     MOVE A2PL5P    FLPC5B                          CDL002
     C                     MOVE A2PL6P    FLPC6B                          CDL002
     C                     ENDIF                                          CDL002
      *                                                                   CDL002
      * Get Lending Limits                                                CDL002
     C                     CALL 'AOLIMTR0'                                CDL002
     C                     PARM *BLANKS   @RTCD                           CDL002
     C                     PARM '*KEY   ' @OPTN                           CDL002
     C                     PARM DZLLTY    WWLTYP  3                       CDL002
     C           SDLIMT    PARM SDLIMT    DSFDY                           CDL002
      *                                                                   CDL002
     C           @RTCD     IFEQ *BLANKS                                   CDL002
     C                     MOVE A2E1LP    LLEP1B                          CDL002
     C                     MOVE A2E2LP    LLEP2B                          CDL002
     C                     MOVE A2E3LP    LLEP3B                          CDL002
     C                     MOVE A2E4LP    LLEP4B                          CDL002
     C                     MOVE A2E5LP    LLEP5B                          CDL002
     C                     MOVE A2E6LP    LLEP6B                          CDL002
     C                     MOVE A2PL1P    LLPC1B                          CDL002
     C                     MOVE A2PL2P    LLPC2B                          CDL002
     C                     MOVE A2PL3P    LLPC3B                          CDL002
     C                     MOVE A2PL4P    LLPC4B                          CDL002
     C                     MOVE A2PL5P    LLPC5B                          CDL002
     C                     MOVE A2PL6P    LLPC6B                          CDL002
     C                     ENDIF                                          CDL002
     C                     ENDIF                                          CDL002
     C*                                                                   CDL002
      * Get Lending Limits                                                CDL002
     C                     CALL 'AOLIMTR0'                                CDL002
     C                     PARM *BLANKS   @RTCD                           CDL002
     C                     PARM '*KEY   ' @OPTN                           CDL002
     C                     PARM DZMMTY    WWLTYP  3                       CDL002
     C           SDLIMT    PARM SDLIMT    DSFDY                           CDL002
      *                                                                   CDL002
     C           @RTCD     IFEQ *BLANKS                                   CDL002
     C                     MOVE A2E1LP    MLEP1B                          CDL002
     C                     MOVE A2E2LP    MLEP2B                          CDL002
     C                     MOVE A2E3LP    MLEP3B                          CDL002
     C                     MOVE A2E4LP    MLEP4B                          CDL002
     C                     MOVE A2E5LP    MLEP5B                          CDL002
     C                     MOVE A2E6LP    MLEP6B                          CDL002
     C                     MOVE A2PL1P    MLPC1B                          CDL002
     C                     MOVE A2PL2P    MLPC2B                          CDL002
     C                     MOVE A2PL3P    MLPC3B                          CDL002
     C                     MOVE A2PL4P    MLPC4B                          CDL002
     C                     MOVE A2PL5P    MLPC5B                          CDL002
     C                     MOVE A2PL6P    MLPC6B                          CDL002
     C                     ENDIF                                          CDL002
     C*                                                                   CDL002
      * Get Lending Limits                                                CDL002
     C                     CALL 'AOLIMTR0'                                CDL002
     C                     PARM *BLANKS   @RTCD                           CDL002
     C                     PARM '*KEY   ' @OPTN                           CDL002
     C                     PARM DZPLTY    WWLTYP  3                       CDL002
     C           SDLIMT    PARM SDLIMT    DSFDY                           CDL002
      *                                                                   CDL002
     C           @RTCD     IFEQ *BLANKS                                   CDL002
     C                     MOVE A2E1LP    PLEP1B                          CDL002
     C                     MOVE A2E2LP    PLEP2B                          CDL002
     C                     MOVE A2E3LP    PLEP3B                          CDL002
     C                     MOVE A2E4LP    PLEP4B                          CDL002
     C                     MOVE A2E5LP    PLEP5B                          CDL002
     C                     MOVE A2E6LP    PLEP6B                          CDL002
     C                     MOVE A2PL1P    PLPC1B                          CDL002
     C                     MOVE A2PL2P    PLPC2B                          CDL002
     C                     MOVE A2PL3P    PLPC3B                          CDL002
     C                     MOVE A2PL4P    PLPC4B                          CDL002
     C                     MOVE A2PL5P    PLPC5B                          CDL002
     C                     MOVE A2PL6P    PLPC6B                          CDL002
     C                     ENDIF                                          CDL002
     C*                                                                   CDL002
      * Get Client Limits for Branch                                      CDL002
     C                     CALL 'AOCLLMR0'                                CDL002
     C                     PARM *BLANKS   @RTCD                           CDL002
     C                     PARM '*KEY   ' @OPTN                           CDL002
     C                     PARM CUST      @CUST                           CDL002
     C                     PARM 'C'       WWLEV                           CDL002
     C                     PARM CO        WWENT                           CDL002
     C           SDCLLM    PARM SDCLLM    DSFDY                           CDL002
      *                                                                   CDL002
     C           @RTCD     IFEQ *BLANKS                                   CDL002
     C                     MOVE DZFXLT    FLTYC                           CDL002
     C                     MOVE DZFLED    FLEDC                           CDL002
     C                     MOVE DZFLAM    FLAMC                           CDL002
     C                     MOVE DZLLTY    LLTYC                           CDL002
     C                     MOVE DZLLED    LLEDC                           CDL002
     C                     MOVE DZLLAM    LLAMC                           CDL002
     C                     MOVE DZFRLA    RLAMC                           CDL002
     C                     MOVE DZFRED    RLEDC                           CDL002
     C                     MOVE DZIRLM    ILAMC                           CDL002
     C                     MOVE DZLLTY    LLTYC                           CDL002
     C                     MOVE DZIRED    ILEDC                           CDL002
     C                     MOVE DZFXFA    FXFAC                           CDL002
     C                     MOVE DZMMTY    MMTYC                           CDL002
     C                     MOVE DZMMAM    MMAMC                           CDL002
     C                     MOVE DZMMED    MMEDC                           CDL002
     C                     MOVE DZPLTY    PLTYC                           CDL002
     C                     MOVE DZPFAM    PFAMC                           CDL002
     C                     MOVE DZPSAM    PSAMC                           CDL002
     C                     MOVE DZPLED    PLEDC                           CDL002
     C                     ENDIF                                          CDL002
     C*                                                                   CDL002
      * Get Lending Limits                                                CDL002
     C                     CALL 'AOLIMTR0'                                CDL002
     C                     PARM *BLANKS   @RTCD                           CDL002
     C                     PARM '*KEY   ' @OPTN                           CDL002
     C                     PARM DZFXLT    WWLTYP                          CDL002
     C           SDLIMT    PARM SDLIMT    DSFDY                           CDL002
      *                                                                   CDL002
     C           @RTCD     IFEQ *BLANKS                                   CDL002
     C                     MOVE A2E1LP    FLEP1C                          CDL002
     C                     MOVE A2E2LP    FLEP2C                          CDL002
     C                     MOVE A2E3LP    FLEP3C                          CDL002
     C                     MOVE A2E4LP    FLEP4C                          CDL002
     C                     MOVE A2E5LP    FLEP5C                          CDL002
     C                     MOVE A2E6LP    FLEP6C                          CDL002
     C                     MOVE A2PL1P    FLPC1C                          CDL002
     C                     MOVE A2PL2P    FLPC2C                          CDL002
     C                     MOVE A2PL3P    FLPC3C                          CDL002
     C                     MOVE A2PL4P    FLPC4C                          CDL002
     C                     MOVE A2PL5P    FLPC5C                          CDL002
     C                     MOVE A2PL6P    FLPC6C                          CDL002
     C                     ENDIF                                          CDL002
     C*                                                                   CDL002
      * Get Lending Limits                                                CDL002
     C                     CALL 'AOLIMTR0'                                CDL002
     C                     PARM *BLANKS   @RTCD                           CDL002
     C                     PARM '*KEY   ' @OPTN                           CDL002
     C                     PARM DZLLTY    WWLTYP                          CDL002
     C           SDLIMT    PARM SDLIMT    DSFDY                           CDL002
      *                                                                   CDL002
     C           @RTCD     IFEQ *BLANKS                                   CDL002
     C                     MOVE A2E1LP    LLEP1C                          CDL002
     C                     MOVE A2E2LP    LLEP2C                          CDL002
     C                     MOVE A2E3LP    LLEP3C                          CDL002
     C                     MOVE A2E4LP    LLEP4C                          CDL002
     C                     MOVE A2E5LP    LLEP5C                          CDL002
     C                     MOVE A2E6LP    LLEP6C                          CDL002
     C                     MOVE A2PL1P    LLPC1C                          CDL002
     C                     MOVE A2PL2P    LLPC2C                          CDL002
     C                     MOVE A2PL3P    LLPC3C                          CDL002
     C                     MOVE A2PL4P    LLPC4C                          CDL002
     C                     MOVE A2PL5P    LLPC5C                          CDL002
     C                     MOVE A2PL6P    LLPC6C                          CDL002
     C                     ENDIF                                          CDL002
     C*                                                                   CDL002
      * Get Lending Limits                                                CDL002
     C                     CALL 'AOLIMTR0'                                CDL002
     C                     PARM *BLANKS   @RTCD                           CDL002
     C                     PARM '*KEY   ' @OPTN                           CDL002
     C                     PARM DZMMTY    WWLTYP                          CDL002
     C           SDLIMT    PARM SDLIMT    DSFDY                           CDL002
      *                                                                   CDL002
     C           @RTCD     IFEQ *BLANKS                                   CDL002
     C                     MOVE A2E1LP    MLEP1C                          CDL002
     C                     MOVE A2E2LP    MLEP2C                          CDL002
     C                     MOVE A2E3LP    MLEP3C                          CDL002
     C                     MOVE A2E4LP    MLEP4C                          CDL002
     C                     MOVE A2E5LP    MLEP5C                          CDL002
     C                     MOVE A2E6LP    MLEP6C                          CDL002
     C                     MOVE A2PL1P    MLPC1C                          CDL002
     C                     MOVE A2PL2P    MLPC2C                          CDL002
     C                     MOVE A2PL3P    MLPC3C                          CDL002
     C                     MOVE A2PL4P    MLPC4C                          CDL002
     C                     MOVE A2PL5P    MLPC5C                          CDL002
     C                     MOVE A2PL6P    MLPC6C                          CDL002
     C                     ENDIF                                          CDL002
     C*                                                                   CDL002
      * Get Lending Limits                                                CDL002
     C                     CALL 'AOLIMTR0'                                CDL002
     C                     PARM *BLANKS   @RTCD                           CDL002
     C                     PARM '*KEY   ' @OPTN                           CDL002
     C                     PARM DZPLTY    WWLTYP                          CDL002
     C           SDLIMT    PARM SDLIMT    DSFDY                           CDL002
      *                                                                   CDL002
     C           @RTCD     IFEQ *BLANKS                                   CDL002
     C                     MOVE A2E1LP    PLEP1C                          CDL002
     C                     MOVE A2E2LP    PLEP2C                          CDL002
     C                     MOVE A2E3LP    PLEP3C                          CDL002
     C                     MOVE A2E4LP    PLEP4C                          CDL002
     C                     MOVE A2E5LP    PLEP5C                          CDL002
     C                     MOVE A2E6LP    PLEP6C                          CDL002
     C                     MOVE A2PL1P    PLPC1C                          CDL002
     C                     MOVE A2PL2P    PLPC2C                          CDL002
     C                     MOVE A2PL3P    PLPC3C                          CDL002
     C                     MOVE A2PL4P    PLPC4C                          CDL002
     C                     MOVE A2PL5P    PLPC5C                          CDL002
     C                     MOVE A2PL6P    PLPC6C                          CDL002
     C                     ENDIF                                          CDL002
     C*                                                                   CDL002
      * Get Client Limits for Branch                                      CDL002
     C                     CALL 'AOCLLMR0'                                CDL002
     C                     PARM *BLANKS   @RTCD                           CDL002
     C                     PARM '*KEY   ' @OPTN                           CDL002
     C                     PARM CUST      @CUST                           CDL002
     C                     PARM 'S'       WWLEV                           CDL002
     C                     PARM 'SYS'     WWENT                           CDL002
     C           SDCLLM    PARM SDCLLM    DSFDY                           CDL002
      *                                                                   CDL002
     C           @RTCD     IFEQ *BLANKS                                   CDL002
     C                     MOVE DZFXLT    FLTYS                           CDL002
     C                     MOVE DZFLED    FLEDS                           CDL002
     C                     MOVE DZFLAM    FLAMS                           CDL002
     C                     MOVE DZLLTY    LLTYS                           CDL002
     C                     MOVE DZLLED    LLEDS                           CDL002
     C                     MOVE DZLLAM    LLAMS                           CDL002
     C                     MOVE DZFRLA    RLAMS                           CDL002
     C                     MOVE DZFRED    RLEDS                           CDL002
     C                     MOVE DZIRLM    ILAMS                           CDL002
     C                     MOVE DZLLTY    LLTYS                           CDL002
     C                     MOVE DZIRED    ILEDS                           CDL002
     C                     MOVE DZFXFA    FXFAS                           CDL002
     C                     MOVE DZMMTY    MMTYS                           CDL002
     C                     MOVE DZMMAM    MMAMS                           CDL002
     C                     MOVE DZMMED    MMEDS                           CDL002
     C                     MOVE DZPLTY    PLTYS                           CDL002
     C                     MOVE DZPFAM    PFAMS                           CDL002
     C                     MOVE DZPSAM    PSAMS                           CDL002
     C                     MOVE DZPLED    PLEDS                           CDL002
     C                     ENDIF                                          CDL002
     C*                                                                   CDL002
      * Get Lending Limits                                                CDL002
     C                     CALL 'AOLIMTR0'                                CDL002
     C                     PARM *BLANKS   @RTCD                           CDL002
     C                     PARM '*KEY   ' @OPTN                           CDL002
     C                     PARM DZFXLT    WWLTYP                          CDL002
     C           SDLIMT    PARM SDLIMT    DSFDY                           CDL002
      *                                                                   CDL002
     C           @RTCD     IFEQ *BLANKS                                   CDL002
     C                     MOVE A2E1LP    FLEP1S                          CDL002
     C                     MOVE A2E2LP    FLEP2S                          CDL002
     C                     MOVE A2E3LP    FLEP3S                          CDL002
     C                     MOVE A2E4LP    FLEP4S                          CDL002
     C                     MOVE A2E5LP    FLEP5S                          CDL002
     C                     MOVE A2E6LP    FLEP6S                          CDL002
     C                     MOVE A2PL1P    FLPC1S                          CDL002
     C                     MOVE A2PL2P    FLPC2S                          CDL002
     C                     MOVE A2PL3P    FLPC3S                          CDL002
     C                     MOVE A2PL4P    FLPC4S                          CDL002
     C                     MOVE A2PL5P    FLPC5S                          CDL002
     C                     MOVE A2PL6P    FLPC6S                          CDL002
     C                     ENDIF                                          CDL002
     C*                                                                   CDL002
      * Get Lending Limits                                                CDL002
     C                     CALL 'AOLIMTR0'                                CDL002
     C                     PARM *BLANKS   @RTCD                           CDL002
     C                     PARM '*KEY   ' @OPTN                           CDL002
     C                     PARM DZLLTY    WWLTYP                          CDL002
     C           SDLIMT    PARM SDLIMT    DSFDY                           CDL002
      *                                                                   CDL002
     C           @RTCD     IFEQ *BLANKS                                   CDL002
     C                     MOVE A2E1LP    LLEP1S                          CDL002
     C                     MOVE A2E2LP    LLEP2S                          CDL002
     C                     MOVE A2E3LP    LLEP3S                          CDL002
     C                     MOVE A2E4LP    LLEP4S                          CDL002
     C                     MOVE A2E5LP    LLEP5S                          CDL002
     C                     MOVE A2E6LP    LLEP6S                          CDL002
     C                     MOVE A2PL1P    LLPC1S                          CDL002
     C                     MOVE A2PL2P    LLPC2S                          CDL002
     C                     MOVE A2PL3P    LLPC3S                          CDL002
     C                     MOVE A2PL4P    LLPC4S                          CDL002
     C                     MOVE A2PL5P    LLPC5S                          CDL002
     C                     MOVE A2PL6P    LLPC6S                          CDL002
     C                     ENDIF                                          CDL002
     C*                                                                   CDL002
      * Get Lending Limits                                                CDL002
     C                     CALL 'AOLIMTR0'                                CDL002
     C                     PARM *BLANKS   @RTCD                           CDL002
     C                     PARM '*KEY   ' @OPTN                           CDL002
     C                     PARM DZMMTY    WWLTYP                          CDL002
     C           SDLIMT    PARM SDLIMT    DSFDY                           CDL002
      *                                                                   CDL002
     C           @RTCD     IFEQ *BLANKS                                   CDL002
     C                     MOVE A2E1LP    MLEP1S                          CDL002
     C                     MOVE A2E2LP    MLEP2S                          CDL002
     C                     MOVE A2E3LP    MLEP3S                          CDL002
     C                     MOVE A2E4LP    MLEP4S                          CDL002
     C                     MOVE A2E5LP    MLEP5S                          CDL002
     C                     MOVE A2E6LP    MLEP6S                          CDL002
     C                     MOVE A2PL1P    MLPC1S                          CDL002
     C                     MOVE A2PL2P    MLPC2S                          CDL002
     C                     MOVE A2PL3P    MLPC3S                          CDL002
     C                     MOVE A2PL4P    MLPC4S                          CDL002
     C                     MOVE A2PL5P    MLPC5S                          CDL002
     C                     MOVE A2PL6P    MLPC6S                          CDL002
     C                     ENDIF                                          CDL002
     C*                                                                   CDL002
      * Get Lending Limits                                                CDL002
     C                     CALL 'AOLIMTR0'                                CDL002
     C                     PARM *BLANKS   @RTCD                           CDL002
     C                     PARM '*KEY   ' @OPTN                           CDL002
     C                     PARM DZPLTY    WWLTYP                          CDL002
     C           SDLIMT    PARM SDLIMT    DSFDY                           CDL002
      *                                                                   CDL002
     C           @RTCD     IFEQ *BLANKS                                   CDL002
     C                     MOVE A2E1LP    PLEP1S                          CDL002
     C                     MOVE A2E2LP    PLEP2S                          CDL002
     C                     MOVE A2E3LP    PLEP3S                          CDL002
     C                     MOVE A2E4LP    PLEP4S                          CDL002
     C                     MOVE A2E5LP    PLEP5S                          CDL002
     C                     MOVE A2E6LP    PLEP6S                          CDL002
     C                     MOVE A2PL1P    PLPC1S                          CDL002
     C                     MOVE A2PL2P    PLPC2S                          CDL002
     C                     MOVE A2PL3P    PLPC3S                          CDL002
     C                     MOVE A2PL4P    PLPC4S                          CDL002
     C                     MOVE A2PL5P    PLPC5S                          CDL002
     C                     MOVE A2PL6P    PLPC6S                          CDL002
     C                     ENDIF                                          CDL002
     C*                                                                   CDL002
     C                     EXSR LMTS                                      CDL002
     C*                                                                   CDL002
     C                     MOVE 'N'       NAMPRT  1                       CDL002
     C*                                                                   CDL002
     C           *IN43     IFEQ *OFF                                      CDL002
     C                     EXSR LMTC                                      CDL002
     C                     EXSR LMTB                                      CDL002
     C                     ENDIF                                          CDL002
      *                                                                   CDL002
     C                     EXSR NEVTD                                     CDL002
      *                                                                   CDL002
     C           *IN42     IFEQ *ON                                       CDL002
     C           *IN48     ANDEQ*OFF                                      CDL002
      *                                                                   CDL002
     C           *IN43     IFEQ *OFF                                      CDL002
     C                     EXSR FXBWRT                                    CDL002
     C                     EXSR LNBWRT                                    CDL002
     C           *IN30     IFEQ *ON                                       CDL002
     C                     EXSR FRBWRT                                    CDL002
     C                     EXSR IRBWRT                                    CDL002
     C                     ENDIF                                          CDL002
      *                                                                   CDL002
     C                     EXSR FXCWRT                                    CDL002
     C                     EXSR LNCWRT                                    CDL002
     C           *IN30     IFEQ *ON                                       CDL002
     C                     EXSR FRCWRT                                    CDL002
     C                     EXSR IRCWRT                                    CDL002
     C                     ENDIF                                          CDL002
     C                     ENDIF                                          CDL002
      *                                                                   CDL002
     C                     EXSR FXSWRT                                    CDL002
     C                     EXSR LNSWRT                                    CDL002
     C           *IN30     IFEQ *ON                                       CDL002
     C                     EXSR FRSWRT                                    CDL002
     C                     EXSR IRSWRT                                    CDL002
     C                     ENDIF                                          CDL002
     C                     ENDIF                                          CDL002
      *                                                                   CDL002
      *                                                                   CDL002
     C                     ENDSR                                          CDL002
      *                                                                   CDL002
      *****************************************************************   CDL002
      * Process all net events for this customer                      *   CDL002
      *****************************************************************   CDL002
     C           NEVTD     BEGSR                                      *   CDL002
      *****************************************************************   CDL002
      *                                                                   CDL002
      *                                                                   CDL002
      * Any net events for this parent/customer?                          CDL002
     C           *IN03     IFEQ *ON                                       CDL002
     C           WRKEYP    ANDEQW3KEYP                                    CDL002
     C           *IN04     OREQ *ON                                       CDL002
     C           WRKEYN    ANDEQW4KEYN                                    CDL002
      *                                                                   CDL002
      * Get FX Net again                                                  CDL002
     C           *IN03     IFEQ *ON                                       CDL002
     C           K3PTNU    CHAINFXNEVTP              83                   CDL002
     C                     ELSE                                           CDL002
     C           K4CUNR    CHAINFXNEVTN              84                   CDL002
     C                     ENDIF                                          CDL002
      *                                                                   CDL002
     C                     MOVE PASK      WRPPAS                          CDL002
     C                     MOVE PTNU      WRPPTN                          CDL002
     C                     MOVE CO        WRPCO                           CDL002
     C                     MOVE BR        WRPBR                           CDL002
     C                     MOVE PASK      WRNPAS                          CDL002
     C                     MOVE PTNU      WRNPTN                          CDL002
     C                     MOVE CASK      WRNCAS                          CDL002
     C                     MOVE CUNR      WRNCUN                          CDL002
     C                     MOVE CO        WRNCO                           CDL002
     C                     MOVE BR        WRNBR                           CDL002
      *                                                                   CDL002
      * Process all net events for this parent/customer                   CDL002
     C           *IN03     DOWEQ*ON                                       CDL002
     C           WRKEYP    ANDEQW3KEYP                                    CDL002
     C           *IN83     ANDEQ*OFF                                      CDL002
     C           *IN04     OREQ *ON                                       CDL002
     C           WRKEYN    ANDEQW4KEYN                                    CDL002
     C           *IN84     ANDEQ*OFF                                      CDL002
      *                                                                   CDL002
      * Incoming only                                                     CDL002
     C           INOI      IFEQ 'I'                                       CDL002
     C                     Z-ADDEDAT      DLVALU                          CDL002
     C           A6NBDP    ADD  1         DEP                             CDL002
     C           LCEQ      DIV  FCT,DEP   DLAMTF                          CDL002
     C           *IN43     IFEQ *OFF                                      CDL002
     C                     EXSR EXPFB                                     CDL002
     C                     EXSR EXPFC                                     CDL002
     C                     ENDIF                                          CDL002
     C                     EXSR EXPFS                                     CDL002
     C                     ADD  1         RREAD                           CDL002
     C                     ENDIF                                          CDL002
     C*                                                                   CDL002
     C* Save current rec                                                  CDL002
     C                     MOVELWREVL     WNSAVE    P                     CDL002
      *                                                                   CDL002
      * Get Parent Net Events                                             CDL002
     C           *IN03     IFEQ *ON                                       CDL002
      *                                                                   CDL002
     C                     READ FXNEVTP                  83               CDL002
     C                     MOVE PASK      WRPPAS                          CDL002
     C                     MOVE PTNU      WRPPTN                          CDL002
     C                     MOVE CO        WRPCO                           CDL002
     C                     MOVE BR        WRPBR                           CDL002
     C                     ENDIF                                          CDL002
      *                                                                   CDL002
      * Get Customer Net Events                                           CDL002
     C           *IN04     IFEQ *ON                                       CDL002
      *                                                                   CDL002
     C                     READ FXNEVTN                  84               CDL002
     C                     MOVE PASK      WRNPAS                          CDL002
     C                     MOVE PTNU      WRNPTN                          CDL002
     C                     MOVE CASK      WRNCAS                          CDL002
     C                     MOVE CUNR      WRNCUN                          CDL002
     C                     MOVE CO        WRNCO                           CDL002
     C                     MOVE BR        WRNBR                           CDL002
     C                     ENDIF                                          CDL002
      *                                                                   CDL002
     C                     ENDDO                                          CDL002
     C*                                                                   CDL002
     C* Parent                                                            CDL002
     C           *IN03     IFEQ *ON                                       CDL002
     C*   No more Parents Left?                                           CDL002
     C           *IN83     IFEQ *ON                                       CDL002
     C                     CLEAR*IN03                                     CDL002
     C*     Get first customer net event                                  CDL002
     C                     READ FXNEVTN                  84               CDL002
     C           *IN84     IFEQ *OFF                                      CDL002
     C                     MOVE *ON       *IN04                           CDL002
     C                     ENDIF                                          CDL002
     C                     ELSE                                           CDL002
     C                     MOVE PASK      W3PASK                          CDL002
     C                     MOVE PTNU      W3PTNU                          CDL002
     C                     MOVE CO        W3CO                            CDL002
     C                     MOVE BR        W3BR                            CDL002
     C                     ENDIF                                          CDL002
     C                     ENDIF                                          CDL002
     C*                                                                   CDL002
     C* Customer                                                          CDL002
     C           *IN04     IFEQ *ON                                       CDL002
     C                     MOVE PASK      W4PASK                          CDL002
     C                     MOVE PTNU      W4PTNU                          CDL002
     C                     MOVE CASK      W4CASK                          CDL002
     C                     MOVE CUNR      W4CUNR                          CDL002
     C                     MOVE CO        W4CO                            CDL002
     C                     MOVE BR        W4BR                            CDL002
     C                     ENDIF                                          CDL002
     C*                                                                   CDL002
     C* Restore Current rec                                               CDL002
     C                     MOVELWNSAVE    WREVL                           CDL002
     C*                                                                   CDL002
     C                     MOVE PASK      WRPPAS                          CDL002
     C                     MOVE PTNU      WRPPTN                          CDL002
     C                     MOVE CO        WRPCO                           CDL002
     C                     MOVE BR        WRPBR                           CDL002
     C                     MOVE PASK      WRNPAS                          CDL002
     C                     MOVE PTNU      WRNPTN                          CDL002
     C                     MOVE CASK      WRNCAS                          CDL002
     C                     MOVE CUNR      WRNCUN                          CDL002
     C                     MOVE CO        WRNCO                           CDL002
     C                     MOVE BR        WRNBR                           CDL002
      *                                                                   CDL002
     C                     ENDIF                                          CDL002
      *                                                                   CDL002
      *                                                                   CDL002
     C                     ENDSR                                          CDL002
      *                                                                   CDL002
0590 C********************************************************************
     C           *PSSR     BEGSR
     C*
     C           @RUN      IFEQ *BLANK
     C                     MOVE 'Y'       @RUN    1
     C                     DUMP
     C                     END
     C*
     C                     ENDSR
     C********************************************************************S01157
      /EJECT                                                              S01157
0295 C********************************************************************
     C*
     C* SUBROUTINE : #ZZ
     C*
     C* CALLED BY MAIN PROCESSING DURING TOTAL TIME CALCULATIONS IF
     C* NO RECORDS READ AND THEREFORE SDBANKPD NOT READ
     C*
     C           #ZZ       BEGSR
     C*
     C** IF FIRST CYCLE NOT PERFORMED GET BANK DETAILS FOR HEADINGS
     C*
     C                     CALL 'AOBANKR0'
     C                     PARM '*MSG   ' @RTCD   7
     C                     PARM '*FIRST ' @OPTN   7
     C           SDBANK    PARM SDBANK    DSFDY
     C           @RTCD     IFNE *BLANK
     C                     MOVEL'SDBANKPD'DBFILE           ************
     C                     MOVEL'04'      DBASE            * DBERR 04 *
     C                     MOVEL@OPTN     DBOPTN           ************
     C                     SETON                     U7U8LR
     C                     EXSR *PSSR
     C                     GOTO #ZZ9
     C                     END
     C*
     C** READ DEAL DETAILS VIA ACCESS PROGRAM FOR BASE CCY FOR LIMITS
     C**********           CALL 'AODEALR0'                                                    CGL029
     C                     CALL 'AODEALR1'                                                    CGL029
     C                     PARM '*MSG   ' @RTCD   7
     C                     PARM '*FIRST ' @OPTN   7
     C********** SDDEAL    PARM SDDEAL    DSFDY                                               CGL029
     C           SDDEAL    PARM SDDEAL    DSSDY                                               CGL029
     C           @RTCD     IFNE *BLANK
     C                     MOVEL'SDDEALPD'DBFILE           ************
     C                     MOVEL'10'      DBASE            * DBERR 10 *
     C                     MOVEL@OPTN     DBOPTN           ************
     C                     SETON                     U7U8LR
     C                     EXSR *PSSR
     C                     GOTO #ZZ9
     C                     END
     C*                                                                   E305
     C**  FOR ORIGINATING OR BOOKING BRANCH                               E305
     C           @OB       IFEQ 'O'                                       E305
     C                     MOVE HDG,6     BRANCH                          E305
     C                     END                                            E305
     C           @OB       IFEQ 'B'                                       E305
     C           @OB       OREQ ' '                                       E305
     C                     MOVE HDG,7     BRANCH                          E305
     C                     END                                            E305
     C*                                                                   E305
     C           #ZZ9      ENDSR
     C/COPY WNCPYSRC,DL0762AC27
      *****************************************************************   CDL006
      *  S/R  LMTCI                                                   *   CDL006
      *****************************************************************   CDL006
     C           LMTCI     BEGSR                                          CDL006
      *                                                                   CDL006
     C                     Z-ADD0         D                               CDL006
     C           CCDAA,1   COMP 'SP '                    74               CDL006
     C           LMTCFI    TAG                                            CDL006
      *                                                                   CDL006
     C           D         ADD  1         D                               CDL006
     C           CCDAA,D   COMP '000'                    88               CDL006
     C           CCDAA,D   COMP '999'                    87               CDL006
      *                                                                   CDL006
     C   88                Z-ADD999       CCDA,D                          CDL006
     C  N88                MOVE CCDAA,D   CCDA,D                          CDL006
      *                                                                   CDL006
     C           CCDA,D    ADD  BJRDNB    CCDT,D                          CDL006
     C   88                                                               CDL006
     COR 87                Z-ADD99999     CCDT,D                          CDL006
      *                                                                   CDL006
     C  N88      FIFILA    MULT CCPC,D    CCLM,D                          CDL006
      *                                                                   CDL006
     C           D         COMP 6                      86                 CDL006
     C   86N87N88          GOTO LMTCFI                                    CDL006
     C   74                Z-ADDSP        CCDA,1                          CDL006
     C   74      SP        ADD  BJRDNB    CCDT,1                          CDL006
      *                                                                   CDL006
     C                     ENDSR                                          CDL006
      *****************************************************************   CDL006
      *  S/R  LMTSIL                                                  *   CDL006
      *****************************************************************   CDL006
     C           LMTSIL    BEGSR                                          CDL006
      *                                                                   CDL006
     C                     Z-ADD0         D                               CDL006
     C           SIDAA,1   COMP 'SP '                    72               CDL006
     C           LMTSFI    TAG                                            CDL006
      *                                                                   CDL006
     C           D         ADD  1         D                               CDL006
     C           SIDAA,D   COMP '000'                    88               CDL006
     C           SIDAA,D   COMP '999'                    87               CDL006
      *                                                                   CDL006
     C   88                Z-ADD999       SIDA,D                          CDL006
     C  N88                MOVE SIDAA,D   SIDA,D                          CDL006
      *                                                                   CDL006
     C           SIDA,D    ADD  BJRDNB    SIDT,D                          CDL006
     C   88                                                               CDL006
     COR 87                Z-ADD99999     SIDT,D                          CDL006
      *                                                                   CDL006
     C  N88      FIFILA    MULT SIPC,D    SILM,D                          CDL006
      *                                                                   CDL006
     C           D         COMP 6                      86                 CDL006
     C   86N87N88          GOTO LMTSFI                                    CDL006
     C   72                Z-ADDSP        SIDA,1                          CDL006
     C   72      SP        ADD  BJRDNB    SIDT,1                          CDL006
      *                                                                   CDL006
     C                     ENDSR                                          CDL006
     C********************************************************************S01157
      /EJECT                                                              S01157
0597 C*****************************************************************
0922 O**DL0762P1H***03***OF                                               E257
0922 O**DL0761P1H***03***OF                                          E257 LN0746
0922 ODL0762P1H   03   OF                                                 LN0746
     O       OR   03   40                                                 E150
     O********                           22 'REFERENCE DL0762P1'          S01433
     O                                   22 'REFERENCE DL0762AP1'         S01433
0924 O                         BJURPT    89
0925 O                                  122 'DATE              PAGE'
0926 O                         BJMRDT   112
0927 O                         PAGE  Z  127
0928 O        H 2      OFNU1
     O       OR 2      40NU1                                              E150
0929 O                                   68 'EXPOSURE AGAINST LIMITS '
0930 O                                   77 'IN 000''S '
0931 O                         BNCYCD    80
     O                                   82 '-'
     O                         OPTION   106
     O                         CNUMA    113
0928 O        H 2      OF U1
     O       OR 2      40 U1                                              E150
     O                                   53 'EXCEPTION EXPOSURE '
0929 O                                   68 'AGAINST LIMITS '
0930 O                                   77 'IN 000''S '
0931 O                         BNCYCD    80
     O                                   82 '-'
     O                         OPTION   106
     O                         CNUMA    113
0932 O        H 1      OFNU1
     O       OR 1      40NU1                                              E150
0933 O                                   68 '------------------------'
0934 O                                   80 '------------'
     O                         BRANCH   106
0932 O        H 1      OF U1
     O       OR 1      40 U1                                              E150
     O                                   53 '-------------------'
0933 O                                   68 '---------------'
0934 O                                   80 '------------'
     O                         BRANCH   106
0935 O        H 21     OF                                                 E150
     O       OR 21     40                                                 E150
0941 O                                   11 'CUSTOMER'
0941 O                 46N50             20 '(PARENT)'
0941 O                 47                24 '(NON-PARENT)'
     O                                   82 'PERIOD'
     O                                   96 'LIMIT'
     O                                  125 'EXPOSURE         EXCESS'
     O**
0946 O        EF 1             DASH1
     O                                   54 '-----------------------'
     O                                   78 '------------------------'
     O                                  102 '------------------------'
     O                                  126 '------------------------'
     O                                  129 '---'
0946 O        E  1             DASH2
     O                                   54 '-----------------------'
     O                                   78 '------------------------'
     O                                  102 '------------------------'
     O                                  126 '------------------------'
     O                                  129 '---'
     O**  CUSTOMER HEADING
     O        EF21             CUSTO
0950 O                         CUST       6
0951 O                         NAME      27
0954 O                         TOWN      38
0952 O                 46 50             50 'PARENT'
0953 O                 47N45             48 'PAR-'
     O                 47N45   PTNU      54
     O        E  1             CUSTO
     O                                   24 '------------------------'
     O                                   38 '--------------'
     O**
     O**  SYSTEM LIMIT - LINE 1 - FX
     O********EF 1             FXLIN1                                     S01433
     O        EF 1             FXLN1S                                     S01433
     O                                    7 'BK.LIM.'
     O                         FDESCS    45
     O                                   63 'FOREIGN EXCHANGE'
     O********                           79 '001-'                        S01433
     O********                 XFDA,1    82                               S01433
     O********            71             80 ' SPOT  '                     S01433
     O                                   82 ' SPOT  '                     S01433
     O********                 XFLM,11   96                               S01433
     O                         XFLM1 1   96                               S01433
0963 O**********               FXPOS 1  110                               S01433
     O                         FXPOSS1  110                               S01433
0964 O********                 XFXS,11  125                               S01433
     O                         XFXS1 1  125                               S01433
     O        EF 1             FXLN1F                                     S01433
     O                                    7 'BK.LIM.'                     S01433
     O                         FDESCS    45                               S01433
     O                                   63 'FOREIGN EXCHANGE'            S01433
     O                                   79 '001-'                        S01433
     O                         XFDA,1    82                               S01433
     O                         XFLM,11   96                               S01433
     O                         ASTFS     97                               S01433
     O                         FXPOS 1  110                               S01433
     O                         XFXS,11  125                               S01433
     O**
     O**  SYSTEM LIMIT - LINES 2-6   - FX
     O********E  1             FXLIN2                                     S01433
     O        E  1           53FXLIN2                                     S01433
0955 O                       53NEXTF     78
0957 O                       53          79 '-'
0958 O                       53XFDA,D    82
0960 O                       53XFLM,D1   96
     O                       53ASTFS     97
0963 O                       53FXPOS 1  110
0964 O                       53XFXS,D1  125
     O**
     O****SYSTEM*LIMIT - LINE 1 - LENDING                                 S01433
     O**  SYSTEM LIMIT - LINE 1 - MONEY MARKET                            S01433
0947 O        EF 1             LNLIN1
     O                                    7 'BK.LIM.'
     O********                 LDESCS    45                               S01433
     O                         MDESCS    45                               S01433
     O********                           54 'LENDING'                     S01433
     O                                   59 'MONEY MARKET'                S01433
0956 O                                   79 '001-'
     O********                 XLDA,1    82                               S01433
     O                         XMDA,1    82                               S01433
0959 O                    72             80 ' SPOT  '
     O********                 XLLM,11   96                               S01433
     O                         XMLM,11   96                               S01433
0963 O                         LXPOS 1  110
     O********                 XLXS,11  125                               S01433
     O                         XMXS,11  125                               S01433
     O**
     O****SYSTEM*LIMIT - LINES 2-6   - LENDING                            S01433
     O**  SYSTEM LIMIT - LINES 2-6   - MONEY MARKET                       S01433
     O********E  1             LNLIN2                                     S01433
     O        E  1           54LNLIN2                                     S01433
0965 O                       54NEXTL     78
0967 O                       54          79 '-'
     O********               54XLDA,D    82                               S01433
     O********               54XLLM,D1   96                               S01433
     O********               54ASTLS     97                               S01433
     O                       54XMDA,D    82                               S01433
     O                       54XMLM,D1   96                               S01433
     O                       54ASTMS     97                               S01433
0973 O                       54LXPOS 1  110
     O********               54XLXS,D1  125                               S01433
     O                       54XMXS,D1  125                               S01433
     O/COPY WNCPYSRC,DL0762AO01
      *                                                                   CDL006
      ** System limit - Line 1 - Fiduciary deposits                       CDL006
      *                                                                   CDL006
     O        EF 1     80      SILIN1                                     CDL006
     O                 80                 7 'BK.LIM.'                     CDL006
     O                 80      FIDESS    45                               CDL006
     O                 80                65 'FIDUCIARY DEPOSITS'          CDL006
     O                 80                79 '001-'                        CDL006
     O                 80      SIDA,1    82                               CDL006
     O                 80 72             80 ' SPOT  '                     CDL006
     O                 80      SILM,11   96                               CDL006
     O                 80      FIXPOS1  110                               CDL006
     O                 80      SIXS,11  125                               CDL006
      *                                                                   CDL006
      ** System Limit - Lines 2-6 - Fiduciary deposits                    CDL006
      *                                                                   CDL006
     O        E  1     80    61SILIN2                                     CDL006
     O                 80    61FIEXTL    78                               CDL006
     O                 80    61          79 '-'                           CDL006
     O                 80    61SIDA,D    82                               CDL006
     O                 80    61SILM,D1   96                               CDL006
     O                 80    61ASTMS     97                               CDL006
     O                 80    61FIXPOS1  110                               CDL006
     O                 80    61SIXS,D1  125                               CDL006
     O*                                                                   S01157
     O**  SYSTEM LIMIT - LINE 1 - PRECIOUS METALS                         S01433
     O        EF 1             PMLN1S                                     S01433
     O                                    7 'BK.LIM.'                     S01433
     O                         PDESCS    45                               S01433
     O                                   61 'PRECIOUS METAL'              S01433
     O                                   82 'SPOT'                        S01433
     O                         XPLM1 1   96                               S01433
     O**********               PXPOS 1  110                               S01433
     O                         PXPOSS1  110                               S01433
     O                         XPXS1 1  125                               S01433
     O        EF 1             PMLN1F                                     S01433
     O                                    7 'BK.LIM.'                     S01433
     O                         PDESCS    45                               S01433
     O                                   61 'PRECIOUS METAL'              S01433
     O                                   79 '001-'                        S01433
     O                         XPDA,1    82                               S01433
     O                         XPLM,11   96                               S01433
     O                         ASTPS     97                               S01433
     O                         PXPOS 1  110                               S01433
     O                         XPXS,11  125                               S01433
     O**                                                                  S01433
     O**  SYSTEM LIMIT - LINES 2-6   - PRECIOUS METALS                    S01433
     O        E  1           55PMLIN2                                     S01433
     O                       55NEXTP     78                               S01433
     O                       55          79 '-'                           S01433
     O                       55XPDA,D    82                               S01433
     O                       55XPLM,D1   96                               S01433
     O                       55ASTPS     97                               S01433
     O                       55PXPOS 1  110                               S01433
     O                       55XPXS,D1  125                               S01433
     O*                                                                   S01433
     O*   SYSTEM LIMIT - FRA                                              S01157
     O*                                                                   S01157
     O        EF 1             SRLIN                                      S01157
     O                                    7 'BK.LIM.'                     S01157
     O                         RDESCS    45                               S01157
     O                                   69 'FORWARD RATE AGREEMENT'      S01157
     O                         XRLM  1   96                               S01157
     O                         RXPOS 1  110                               S01157
     O                         XRXS  1  125                               S01157
     O*                                                                   S01157
     O*                                                                   S01157
     O*   SYSTEM LIMIT - IRS                                              S01157
     O*                                                                   S01157
     O        EF 1             SILIN                                      S01157
     O                                    7 'BK.LIM.'                     S01157
     O                         IDESCS    45                               S01157
     O                                   66 'INTEREST RATE SWAPS'         S01157
     O                         XILM  1   96                               S01157
     O                         IXPOS 1  110                               S01157
     O                         XIXS  1  125                               S01157
     O*                                                                   S01157
      /EJECT                                                              S01157
     O**
     O**  COMPANY LIMIT - LINE 1  FOR FX
     O********EF 1             CFLIN1                                     S01433
     O        EF 1             CFLN1S                                     S01433
     O                                    3 'CO-'
     O                         CO         6
     O                         FDESCC    45
     O                                   63 'FOREIGN EXCHANGE'
0956 O                                   79 '001-'
     O********                 CFDA,1    82                               S01433
     O                         CFDA1     82                               S01433
0959 O********               73          80 ' SPOT  '                     S01433
0959 O                                   82 ' SPOT  '                     S01433
     O********                 CFLM,11   96                               S01433
     O                         CFLM1 1   96                               S01433
0963 O**********               CFPOS 1  110                               S01433
0963 O                         CFPOSS1  110                               S01433
0964 O********                 CFXS,11  125                               S01433
     O                         CFXS1 1  125                               S01433
     O        EF 1             CFLN1F                                     S01433
     O                                    3 'CO-'                         S01433
     O                         CO         6                               S01433
     O                         FDESCC    45                               S01433
     O                                   63 'FOREIGN EXCHANGE'            S01433
     O                                   79 '001-'                        S01433
     O                         CFDA,1    82                               S01433
     O                         CFLM,11   96                               S01433
     O                         ASTFC  B  97                               S01433
     O                         CFPOS 1  110                               S01433
     O                         CFXS,11  125                               S01433
     O**
     O**  COMPANY LIMIT - LINES 2-6  FOR FX
     O********E  1             CFLIN2                                     S01433
     O        E  1           53CFLIN2                                     S01433
0965 O                       53NEXTF     78
0967 O                       53          79 '-'
0968 O                       53CFDA,D    82
0970 O                       53CFLM,D1   96
     O                       53ASTFC  B  97
0973 O                       53CFPOS 1  110                               S01433
0974 O                       53CFXS,D1  125
     O**
     O**  COMPANY LIMIT - LINE 1  FOR LENDING
     O********EF 1             CLLIN1                                     S01433
     O        EF 1             CMLIN1                                     S01433
     O                                    3 'CO-'
     O                         CO         6
     O********                 LDESCC    45                               S01433
     O                         MDESCC    45                               S01433
     O********                           54 'LENDING'                     S01433
     O                                   59 'MONEY MARKET'                S01433
0956 O                                   79 '001-'
     O********                 CLDA,1    82                               S01433
     O                         CMDA,1    82                               S01433
0969 O                    74             80 ' SPOT  '                     S01433
     O********                 CLLM,11   96                               S01433
     O                         CMLM,11   96                               S01433
0973 O                         LXPOS 1  110
     O********                 CLXS,11  125                               S01433
     O                         CMXS,11  125                               S01433
     O**                                                                  S01433
     O****COMPANY*LIMIT - LINES 2-6  FOR LENDING                          S01433
     O**  COMPANY LIMIT - LINES 2-6 FOR MONEY MARKET                      S01433
     O********E  1             CLLIN2                                     S01433
     O        E  1           54CMLIN2                                     S01433
0965 O                       54NEXTL     78
0967 O                       54          79 '-'
     O********               54CLDA,D    82                               S01433
     O********               54CLLM,D1   96                               S01433
     O********               54ASTLC  B  97                               S01433
     O                       54CMDA,D    82                               S01433
     O                       54CMLM,D1   96                               S01433
     O                       54ASTMC  B  97                               S01433
0973 O                       54LXPOS 1  110
     O********               54CLXS,D1  125                               S01433
     O                       54CMXS,D1  125                               S01433
     O/COPY WNCPYSRC,DL0762AO02
      *                                                                   CDL006
      ** Company limit - Line 1 for fiduciary deposits                    CDL006
      *                                                                   CDL006
     O        EF 1     80      CCLIN1                                     CDL006
     O                 80                 3 'CO-'                         CDL006
     O                 80      CO         6                               CDL006
     O                 80      FIDESC    45                               CDL006
     O                 80                65 'FIDUCIARY DEPOSITS'          CDL006
     O                 80                79 '001-'                        CDL006
     O                 80      CCDA,1    82                               CDL006
     O                 80 74             80 ' SPOT  '                     CDL006
     O                 80      CCLM,11   96                               CDL006
     O                 80      FIXPOS1  110                               CDL006
     O                 80      CCXS,11  125                               CDL006
      *                                                                   CDL006
      ** Company limit - Lines 2-6 for fiduciary deposits                 CDL006
      *                                                                   CDL006
     O        E  1     80    61CCLIN2                                     CDL006
     O                 80    61FIEXTL    78                               CDL006
     O                 80    61          79 '-'                           CDL006
     O                 80    61CCDA,D    82                               CDL006
     O                 80    61CCLM,D1   96                               CDL006
     O                 80    61ASTMC  B  97                               CDL006
     O                 80    61FIXPOS1  110                               CDL006
     O                 80    61CCXS,D1  125                               CDL006
     O*                                                                   CDL006
     O*                                                                   S01157
     O**  COMPANY LIMIT - LINE 1  FOR PRECIOUS METALS                     S01433
     O        EF 1             CPLN1S                                     S01433
     O                                    3 'CO-'                         S01433
     O                         CO         6                               S01433
     O                         PDESCC    45                               S01433
     O                                   61 'PRECIOUS METAL'              S01433
     O                                   79 '001-'                        S01433
     O                         CPDA1     82                               S01433
     O                                   82 ' SPOT  '                     S01433
     O                         CPLM1 1   96                               S01433
     O                         CPPOSS1  110                               S01433
     O                         CPXS1 1  125                               S01433
     O        EF 1             CPLN1F                                     S01433
     O                                    3 'CO-'                         S01433
     O                         CO         6                               S01433
     O                         PDESCC    45                               S01433
     O                                   61 'PRECIOUS METAL'              S01433
     O                                   79 '001-'                        S01433
     O                         CPDA,1    82                               S01433
     O                         CPLM,11   96                               S01433
     O                         ASTPC  B  97                               S01433
     O**********               PXPOS 1  110                               S01433
     O                         CPPOS 1  110                               S01433
     O                         CPXS,11  125                               S01433
     O**                                                                  S01433
     O**  COMPANY LIMIT - LINES 2-6 FOR PRECIOUS METAL                    S01433
     O        E  1           55CPLIN2                                     S01433
     O                       55NEXTP     78                               S01433
     O                       55          79 '-'                           S01433
     O                       55CPDA,D    82                               S01433
     O                       55CPLM,D1   96                               S01433
     O                       55ASTPC  B  97                               S01433
     O**********             55LXPOS 1  110                               S01433
     O                       55CPPOS 1  110                               S01433
     O                       55CPXS,D1  125                               S01433
     O*                                                                   S01433
     O*   COMPANY LIMIT - FRA                                             S01157
     O*                                                                   S01157
     O        EF 1             CRLIN                                      S01157
     O                                    3 'CO-'                         S01157
     O                         CO         6                               S01157
     O                         RDESCC    45                               S01157
     O                                   69 'FORWARD RATE AGREEMENT'      S01157
     O                         CRLM  1   96                               S01157
     O                         RCPOS 1  110                               S01157
     O                         CRXS  1  125                               S01157
     O*                                                                   S01157
     O*                                                                   S01157
     O*   COMPANY LIMIT - IRS                                             S01157
     O*                                                                   S01157
     O        EF 1             CILIN                                      S01157
     O                                    3 'CO-'                         S01157
     O                         CO         6                               S01157
     O                         IDESCC    45                               S01157
     O                                   66 'INTEREST RATE SWAPS'         S01157
     O                         CILM  1   96                               S01157
     O                         ICPOS 1  110                               S01157
     O                         CIXS  1  125                               S01157
     O*                                                                   S01157
      /EJECT                                                              S01157
     O**
     O**  BRANCH LIMIT - LINE 1 FOR FX
     O********EF 1             BFLIN1                                     S01433
     O        EF 1             BFLN1S                                     S01433
     O                                    3 'BR-'
     O                         BR         6
     O                         FDESCB    45
     O                                   63 'FOREIGN EXCHANGE'
0956 O                                   79 '001-'
     O********                 BFDA,1    82                               S01433
     O                         BFDA1     82                               S01433
0959 O********            75             80 ' SPOT  '                     S01433
0959 O                                   82 ' SPOT  '                     S01433
     O********                 BFLM,11   96                               S01433
     O                         BFLM1 1   96                               S01433
0963 O**********               FXPOS 1  110                               S01433
0963 O                         BFPOSS1  110                               S01433
0964 O********                 BFXS,11  125                               S01433
     O                         BFXS1 1  125                               S01433
     O        EF 1             BFLN1F                                     S01433
     O                                    3 'BR-'                         S01433
     O                         BR         6                               S01433
     O                         FDESCB    45                               S01433
     O                                   63 'FOREIGN EXCHANGE'            S01433
     O                                   79 '001-'                        S01433
     O                         BFDA,1    82                               S01433
     O                         BFLM,11   96                               S01433
     O**********               FXPOS 1  110                               S01433
     O                         BFPOS 1  110                               S01433
     O                         BFXS,11  125                               S01433
     O**
     O**  BRANCH LIMIT - LINES 2-6  FOR FX
     O********E  1             BFLIN2                                     S01433
     O        E  1           53BFLIN2                                     S01433
0955 O                       53NEXTF     78
0957 O                       53          79 '-'
0958 O                       53BFDA,D    82
0960 O                       53BFLM,D1   96
0963 O**********             53FXPOS 1  110                               S01433
0963 O                       53BFPOS 1  110                               S01433
0964 O                       53BFXS,D1  125
     O**
     O****BRANCH*LIMIT - LINE 1   FOR LENDING                             S01433
     O**  BRANCH LIMIT - LINE 1 FOR MONEY MARKET                          S01433
0947 O        EF 1             BLLIN1
     O                                    3 'BR-'
     O                         BR         6
     O********                 LDESCB    45                               S01433
     O                         MDESCB    45                               S01433
     O********                           54 'LENDING'                     S01433
     O                                   59 'MONEY MARKET'                S01433
0966 O                                   79 '001-'
     O********                 BLDA,1    82                               S01433
     O                         BMDA,1    82                               S01433
0969 O                    76             80 ' SPOT  '                     S01433
     O********                 BLLM,11   96                               S01433
     O                         BMLM,11   96                               S01433
0973 O                         LXPOS 1  110                               S01433
     O********                 BLXS,11  125                               S01433
     O                         BMXS,11  125                               S01433
     O**                                                                  S01433
     O****BRANCH*LIMIT - LINES 2-6   FOR LENDING                          S01433
     O**  BRANCH LIMIT - LINES 2-6 FOR MONEY MARKET                       S01433
     O******* E  1             BLLIN2                                     S01433
     O        E  1           54BLLIN2                                     S01433
0965 O                       54NEXTL     78
0967 O                       54          79 '-'
     O********               54BLDA,D    82                               S01433
     O********               54BLLM,D1   96                               S01433
     O                       54BMDA,D    82                               S01433
     O                       54BMLM,D1   96                               S01433
0973 O                       54LXPOS 1  110
     O********               54BLXS,D1  125                               S01433
     O                       54BMXS,D1  125                               S01433
     O/COPY WNCPYSRC,DL0762AO03
      *                                                                   CDL006
      ** Branch Limit - Line 1 for fiduciary deposits                     CDL006
      *                                                                   CDL006
     O        EF 1     80      BBLIN1                                     CDL006
     O                 80                 3 'BR-'                         CDL006
     O                 80      BR         6                               CDL006
     O                 80      FIDESB    45                               CDL006
     O                 80                65 'FIDUCIARY DEPOSITS'          CDL006
     O                 80                79 '001-'                        CDL006
     O                 80      BBDA,1    82                               CDL006
     O                 80 76             80 ' SPOT  '                     CDL006
     O                 80      BBLM,11   96                               CDL006
     O                 80      FIXPOS1  110                               CDL006
     O                 80      BBXS,11  125                               CDL006
      *                                                                   CDL006
      ** Branch limit - Lines 2-6 for fiduciary deposits                  CDL006
      *                                                                   CDL006
     O        E  1     80    61BBLIN2                                     CDL006
     O                 80    61FIEXTL    78                               CDL006
     O                 80    61          79 '-'                           CDL006
     O                 80    61BBDA,D    82                               CDL006
     O                 80    61BBLM,D1   96                               CDL006
     O                 80    61FIXPOS1  110                               CDL006
     O                 80    61BBXS,D1  125                               CDL006
     O*                                                                   S01157
     O**                                                                  S01433
     O**  BRANCH LIMIT - LINE 1 FOR PRECIOUS METAL                        S01433
     O        EF 1             BPLN1S                                     S01433
     O                                    3 'BR-'                         S01433
     O                         BR         6                               S01433
     O                         PDESCB    45                               S01433
     O                                   61 'PRECIOUS METAL'              S01433
     O                                   79 '001-'                        S01433
     O                         BPDA1     82                               S01433
     O                                   82 ' SPOT  '                     S01433
     O                         BPLM1 1   96                               S01433
     O**********               BPPOS 1  110                               S01433
     O                         BPPOSS1  110                               S01433
     O                         BPXS1 1  125                               S01433
     O        EF 1             BPLN1F                                     S01433
     O                                    3 'BR-'                         S01433
     O                         BR         6                               S01433
     O                         PDESCB    45                               S01433
     O                                   61 'PRECIOUS METAL'              S01433
     O                                   79 '001-'                        S01433
     O                         BPDA,1    82                               S01433
     O                         BPLM,11   96                               S01433
     O**********               PXPOS 1  110                               S01433
     O                         BPPOS 1  110                               S01433
     O                         BPXS,11  125                               S01433
     O**  BRANCH LIMIT - LINES 2-6 FOR MONEY MARKET                       S01433
     O        E  1           55BPLIN2                                     S01433
     O                       55NEXTP     78                               S01433
     O                       55          79 '-'                           S01433
     O                       55BPDA,D    82                               S01433
     O                       55BPLM,D1   96                               S01433
     O**********             55PXPOS 1  110                               S01433
     O                       55BPPOS 1  110                               S01433
     O                       55BPXS,D1  125                               S01433
     O*                                                                   S01157
     O*   BRANCH LIMIT - FRA                                              S01157
     O*                                                                   S01157
     O        EF 1             BRLIN                                      S01157
     O                                    3 'BR-'                         S01157
     O                         BR         6                               S01157
     O                         RDESCB    45                               S01157
     O                                   69 'FORWARD RATE AGREEMENT'      S01157
     O                         BRLM  1   96                               S01157
     O                         RBPOS 1  110                               S01157
     O                         BRXS  1  125                               S01157
     O*                                                                   S01157
     O*                                                                   S01157
     O*   BRANCH LIMIT - IRS                                              S01157
     O*                                                                   S01157
     O        EF 1             BILIN                                      S01157
     O                                    3 'BR-'                         S01157
     O                         BR         6                               S01157
     O                         IDESCB    45                               S01157
     O                                   66 'INTEREST RATE SWAPS'         S01157
     O                         BILM  1   96                               S01157
     O                         IBPOS 1  110                               S01157
     O                         BIXS  1  125                               S01157
     O*                                                                   S01157
     O**
     O****    T   22   LR 41 42                                           E00013
     O******                             63 '***   NO DETAILS TO REPO'    E00013
     O******                             71 'RT   ***'                    E00013
     O**
     O        T 3      LRN41
     O                                   66 '*** END OF REPORT FOR'
     O                 43                77 ' SYSTEM ***'
     O                N43                79 ' CUSTOMER ***'
     O********         43                66 '*** END OF SYSTEM '
     O********        N43                66 '*** END OF CUSTOMER '
     O********                           76 'REPORT ***'
     O**
     O**DL0762AUT***03***LR                                                 E257
     O**DL0761AUT***03***LR                                          E257 LN0746
     ODL0762AUT   03   LR                                                 LN0746
     O                                   24 'REFERENCE DL0762AU'
     O                         BJURPT    89
     O                                  122 'DATE              PAGE'
     O                         BJMRDT   112
     O                         PAGE1 Z  127
     O*       T 2      LR
     O        T 2      LRNU1
     O                                   68 'EXPOSURE AGAINST LIMITS '
     O                                   77 'IN 000''S '
     O                         BNCYCD    80
     O                                   82 '-'
     O                                   95 'RUN CONTROLS'
     O        T 2      LR U1
     O                                   53 'EXCEPTION EXPOSURE '
0929 O                                   68 'AGAINST LIMITS '
     O                                   77 'IN 000''S '
     O                         BNCYCD    80
     O                                   82 '-'
     O                                   95 'RUN CONTROLS'
     O        T 1      LRNU1
     O                                   68 '------------------------'
     O                                   83 '---------------'
     O                                   95 '------------'
     O        T 1      LR U1
     O                                   53 '-------------------'
     O                                   68 '---------------'
     O                                   83 '---------------'
     O                                   95 '------------'
     O*****   T   22   LR 41                                              E00013
     O*****   T   22   LR 41N25                                    E00013 E99
     O*****  AND      NU7                                          E00013 E99
1004 O*****                              63 '***   NO DETAILS TO REPO'    E99
1005 O*****                              71 'RT   ***'                    E99
0976 O*****   T 2      LR                                                 E99
0976 O        T 2 22   LR                                                 E99
0979 O                                   59 'NUMBER'
0995 O        T 2      LR
0996 O                                   28 'RECORDS READ IN THIS'
0997 O                                   35 ' REPORT'
0998 O                         RREAD 3   59
0981 O        T 2      LR
0982 O                                   29 'LIMITS/EXPOSURES REPO'
0983 O                                   33 'RTED'
0984 O                         RLIST 3   59
     O        T 2      LR 41N25                                           E99
     O       AND      NU7                                                 E99
1004 O                                   63 '***   NO DETAILS TO REPO'    E99
1005 O                                   71 'RT   ***'                    E99
     O        T 3      LR 41N25                                           E305
     O       AND      NU7                                                 E305
1004 O                                   62 '***   AGAINST SYSTEM LIM'    E305
1005 O                                   72 'ITS    ***'                  E305
     O        T 1      LR 41N25                                           E305
     O       AND      NU7                                                 E305
1004 O                                   39 '***'                         E305
1005 O                         BRANCH    65                               E305
1005 O                                   73 '***'                         E305
     O        T 3      LR U7 U8
     O                                   71 '*** PRINT TERMINATED ***'
     O        T 1      LR U7 U8
     O                                   57 'DATABASE ERROR'
     O                         DBASE     61
     O                                   67 'FILE'
     O                         DBFILE    78
     O        T 13     LR U7 U8
     O                                   49 'OPTION'
     O                         DBOPTN    57
     O                                   66 'KEY'
     O                         DBKEY     96
** CPY@   **      OBJECT COPYRIGHT
(c) Misys International Banking Systems Ltd. 2001
**   FCT - CONVERSION FACTORS
0001
0010
0100
1000
**   HEAD - REPORT HEADINGS, FOR PRODUCTION OPTION & ORIGIN./BOOKING BR
AGAINST BANK LIMITS
ALL CUSTOMERS
ONE CUSTOMER
ONE PARENT
INCORRECT P.O.
FOR ORIGINATING BRANCH
FOR BOOKING BRANCH
**   ZYDY - YEARS IN DAYS CUMULATIVE, FOUR YEAR SPAN
0366073110961461
**   ZMDY - MONTHS IN DAYS CUMULATIVE THROUGH YEAR
000031059090120151181212243273304334365
**   ZMNM - MONTHS SHORT NAMES
JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC
