     H        1
      *****************************************************************
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas DL Exposure by region of risk report')           *
     F*****************************************************************
     F*                                                               *
     F*  Midas - Dealing Module                                       *
     F*                                                               *
     F*  DL0800 - EXPOSURE BY REGION OF RISK REPORT                   *
     F*           (CALLED BY DLC0806)                                 *
     F*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     F*                                                               *
      *  Last Amend No. CLE154             Date 06Aug12               *     
      *  Prev Amend No. CGL165             Date 17Feb15               *
      *                 CDL096             Date 22Sep14               *
      *                 CDL094             Date 11Jun14               *
      *                 CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      *                 CCB016             Date 30Nov05               *
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD031             Date 10Apr06               *
      *                 236334             Date 06Jan06               *
      *                 218582             Date 06Jun06               *
      *                 CDL049             Date 05Jul06               *
      *                 CSD027             Date 09Dec05               *
      *                 CLE042             Date 06Sep05               *
      *                 CDL038             Date 10May05               *
      *                 CDL028             Date 07Feb05               *
      *                 CGL029             Date 01Sep03               *
      *                 CAS006             Date 21Jan03               *
      *                 CAS005             Date 16Dec02               *
      *                 CLE028             Date 27Jun02               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *                 163486             Date 14Oct99               *
      * Midas DBA 3.01 -----------------------------------------------*
      *                 CDL006             Date 19May99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CLE005             Date 22May97               *
      *                 CDL002             Date 17Sep97               *
     F*                 102159             DATE 24FEB97               *
     F*                 067533             DATE 09MAR94               *
     F*                 046303             DATE 13JAN94               *
     F*                 048332             DATE 14JAN93               *
     F*                 E38323             DATE 30JUL92               *
     F*                 E28817             DATE 14OCT91               *
     F*                 E25515             DATE 08AUG91               *
     F*                 DT0081             DATE 12APR91               *
     F*                 BHF416             DATE 19AUG90               *
     F*                 BHF245             DATE 27JUL90               *
     F*                 BHF244             DATE 27JUL90               *
     F*                 LN0236             DATE 22MAY90               *
     F*                 E273               DATE 16MAR90               *
     F*                 S01194             DATE 18/08/89              *
     F*                 S01196             DATE 18/08/89              *
     F*                 S01117             DATE 18/08/89              *
     F*                 S01195             DATE 18/08/89              *
     F*                 S01157             DATE 08/12/88              *
     F*                 E13283             DATE 12/05/88              *
     F*                 E12072             DATE 06/05/88              *
     F*                 E10421             DATE 03/08/87              *
     F*                 S01119             DATE 17/06/87              *
     F*                 S1105              DATE 28/04/86              *
     F*                 S01124             DATE 00/00/00              *
     F*                                                               *
     F*---------------------------------------------------------------*
     F*                                                               *
      *  CLE154 - Loan Repayment Schedule Enhancement (Recompile)     *     
      *  CGL165 - Dual Withholding Tax (Recompile)                    *
      *  CDL096 - Business Day Conventions on MM Deals                *
      *           (Recompile)                                         *
      *  CDL094 - Enhance  Receive Settlement Instructions            *
      *           (Recompiled)                                        *
      *  CLE148 - Alpha Loan Reference (Recompile)                    *
     F*  CCB016 - CoB Performance Enhancements                        *
     F*           Call AOLIMTR0 with blank return code instead of     *
     F*           *MSG.                                               *
      *  CSD031 - Enhanced Centralised Static Data (Recompile)        *
      *  236334 - DLC0806 often fails due to FCOOB. Recompiled due to *
      *           change in length of NORE in PF/EVLXCEG. Applied fix *
      *           213645.                                             *
      *  218582 - DLC0806 often fails due to FCOOB. Recompiled due to *
      *           change in length of NORE in PF/EVLXCEG. Applied fix *
      *           213645.                                             *
      *  CDL049 - Addition of a Reference Rate field (recompile)      *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CLE042 - Extended Loan Sub Type (Recompile)                  *
      *  CDL038 - Extended Deal Sub Type (Recompile)                  *
      *  CDL028 - Automatic Rate Interpolations (Recompile)           *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CAS006 - Hedge Accounting Phase B (Recompile)                *
      *  CAS005 - Enhancements to CAS001, CAS002 and CAS004           *
      *           (Recompile)                                         *
      *  CLE028 - Flat Rate Personal Loans (Rule of 78s)              *
     F*  163486 - Recompile due to changes in LVENTEL.                *
      *  CDL006 - Dealing Fiduciary                                   *
     F*  CLE005 - Customer Lending Enhancements - Others (T3)         *
     F*  CDL002 - FX Netting. Exclude netted FX deal events and       *
     F*           include FX net events.                              *
     F*  102159 - Exception report shows full report.                 *
     F*           Applied fix 078707.                                 *
     F*  067533 - Set up Overflow Line correctly in the Print File    *
     F*           definition instead of amending it in the RPG code.  *
     F*  046303 - /COPY source subr. ZFWDT amended to prevent array   *
     F*           error if no holiday record found - fixed by S01434. *
     F*           Program recompiled.                                 *
     F*  048332 - Report shows 'EXPIRED' when there is no limit for   *
     F*           the country - should show 'NO LIM.'                 *
     F*  E38323 - Recompilation of the program done due to a          *
     F*           change in ZFWDT subroutine                          *
     F*  E28817 - STEVEAB and STEVEFC are now redundant               *
     F*  E25515 - REMOVAL OF SYNDICATED LOANS                         *
     F*  DT0081 - IF NO RECORDS FOUND ON SDRGLMPD DO NOT PERFORM      *
     F*           DBASE ERROR PROCESSING - ASSUME BLANK LIMITS        *
     F*  BHF416 - ASSUMES LAST LIMIT PERIOD WILL BE 999,              *
     F*           ACTUALLY IF LEFT BLANK WILL DEFAULT TO 000          *
     F*  BHF245 - SHOULD CALL AORGLMR0 WITH ENTITY PARM = 'SYS'       *
     F*  BHF244 - PROGRAM CALLED AOSYLNR0 UNNECESSARILY               *
     F*  LN0236 - AUDIT REPORT HEADING WAS BEING OVERWRITTEN BY       *
     F*           UNDERLINING.                                        *
     F***E273***- PRINTER FILE SHOULD BE CHANGED TO DL0760 REPORT     *
     F**********  PRINTER FILE                                        *
     F*  S01194 - RELEASE 10 - NEW STANDING DATA                      *
     F*  S01196 - REMOVE LETTERS OF CREDIT                            *
     F*  S01117 - RELEASE 10 - MULTIBRANCHING                         *
     F*  S01195 - NEW HOLIDAY PROCESSING                              *
     F*  S01157 - REMOVE FRA/IRS DETAILS FROM LENDING AMOUNTS.        *
     F*           CHANGE REPORT LAYOUT.                               *
     F*  E13283 - LOANS WERE BEING CONTRASTED AGAINST                 *
     F*           FOREIGN EXCHANGE LIMITS.                            *
     F*  E12072 - A LOAN REPORTED AN EXPOSURE                         *
     F*           BEFORE THE VALUE DATE WAS REACHED.                  *
     F*  E10421 - NO HEADING ON 'NO DETAILS TO REPORT' PAGE           *
     F*  S01119 - INCLUDE PROCESSING FOR FRA/IRS DEAL TYPES           *
     F*  S1105  - LIMITS EXCEPTION REPORTS                            *
     F*                                                               *
     F*****************************************************************
     F*                                                               *
     F*  C R E A T I O N     P A R A M E T E R S                      *
     F*                                                               *
     F*                                                               *
     F*****************************************************************
 012 F* ID F  C  H  L    FUNCTION OF INDICATORS                       *   S01157
     F**07************EVENT DETAIL - LETTERS OF CREDIT              S01157S01196
     F* 08            EVENT DETAIL - SECURITIES TRADING               *   S01157
     F* 55            FUTURE RATE AGREEMENT PRINT LINE.               *   S01157
     F* 56            INTEREST RATE SWAP PRINT LINE.                  *   S01157
     F* 57            FRA/IRS NOT PRESENT DO NOT PRINT LINE.          *   S01157
     F* 84            No record on FXNEVTLC                           *   CDL002
     F* 85            No record on DEALS                              *   CDL002
     F*****************************************************************
0012 FEVLSR   IP  E           K        DISK
     F*                                                                   CDL002
     F* Net Events Extract by Region                                      CDL002
     FFXNEVTLCIS  E           K        DISK                           U3  CDL002
      *                                                                   CDL002
      * Deals                                                             CDL002
     FDEALS   IF  E           K        DISK                           UC  CDL002
     F            DEALSDAF                          KIGNORE               CDL002
     F            DEALSDCF                          KIGNORE               CDL002
     F            DEALSDDF                          KIGNORE               CDL002
     F            DEALSDEF                          KIGNORE               CDL002
     F            DEALSDFF                          KIGNORE               CDL002
     F            DEALSDGF                          KIGNORE               CDL002
0013 F*ABLE   IF  F      96 12AI     2 DISK                               S01157
0013 F*TABLE***IF**F     125 12AI     2 DISK                        S01157S01194
0014 F*DL0800P1O***F*****132     OF    LPRINTER                     S01124S01117
0014 F**DL0800AUO   F     132            PRINTER      KINFDS SPOOLU S01117E273
     FDL0800AUO   F     132            PRINTER      KINFDS SPOOLU         S01117
     F***DL0800P1O** F     132     OF    LPRINTER     KINFDS SPOOL1S01117 067533
     FDL0800P1O   F     132     OF     PRINTER      KINFDS SPOOL1         067533
0014 F****DL0760AUO   F     132            PRINTER      KINFDS SPOOLU     E273
0014 F**DL0800P1O   F     132     OF    LPRINTER      KINFDS SPOOL1 S01117E273
0014 F***DL0760P1O   F     132     OF    LPRINTER      KINFDS SPOOL1      E273
     E                    CPY@    1   1 80
0015 E                    FCT     1   4  4 0
0016 E**   SIX  ARRAYS FOR FX LIMITS
0017 E                    XFDA        6  3 0             PERIOD END DAYS
0018 E                    XFDT        6  5 0             PERIOD END DATES
0019 E                    XFLM        6  9 0             PERIOD LIMIT AMT.
0020 E                    XFXP        6 13 0             PERIOD EXPOS AMT.
0021 E                    XFXS        6 10 0             PERIOD EXCES AMT.
0022 E                    XFPC        6  3 2             PERIOD PERCENTGE.
 023 E**   SIX ARRAYS FOR LOANS LIMITS.
0024 E                    XLDA        6  3 0             PERIOD END DAYS
0025 E                    XLDT        6  5 0             PERIOD END DATES
0026 E                    XLLM        6  9 0             PERIOD LIMIT AMT.
0027 E                    XLXP        6 13 0             PERIOD EXPOS AMT.
0028 E                    XLXS        6 10 0             PERIOD EXCES AMT.
0029 E                    XLPC        6  3 2             PERIOD PERCENTGE
0030 E*****ONE-ELEMENT COMPILE-TIME ARRAY - KEY TO LIMIT REC ON S/TABLE   S01194
0031 E*****               DLKY    1   1 12                                S01194
0032 E**   XFDA & XLDA DEFINED AS ALPHANUMERIC.
0033 E                    XFDAA       6  3
0034 E                    XLDAA       6  3
0035 E                    HCCY       25  3
0071 E                    ZYDY    4   4  4 0             ZDATE2 SR.ARRAY  S01117
0072 E                    ZMDY   13  13  3 0             ZDATE2 SR.ARRAY  S01117
0073 E                    ZMNM   12  12  3               ZDATE2 SR.ARRAY  S01117
     E/COPY ZSRSRC,ZHOLE                                                  S01195
0036 L***DL0800P1 66FL 54OL                                         S01124E273
0036 L*****DL0760P1 66FL 54OL                                             E273
     L***DL0800P1 66FL 54OL                                        S01117 067533
0037 I*
0040 IEVLXCEEF    03
0038 I*    EVENTS FILE LIMIT RECORD
0041 I*
0044 IEVLXCEDF    01
0042 I*    EVENTS FILE DETAIL RECORD
0043 I*    DEALING RECORD
0074 I                                              PARI            10
0083 I***********                                   REGC  L1        21    CDL002
     I                                              REGC  L1M1      21    CDL002
0044 IEVNTXEDF    01
0074 I                                              PARI            10
0083 I***********                                   REGC  L1        21    CDL002
     I                                              REGC  L1M1      21    CDL002
0092 I*
0093 I***********                                                         E25515
0095 I***CEVNXCCF****05                                                   E25515
0094 I***********- COMMERCIAL LOANS EVENT                  - DETAIL       E25515
0133 I***********                                   REGC  L1        21    E25515
0138 I***********                                   PARI            10    E25515
0140 I*
     ILVENTELF    06
     I***       CUSTOMER LENDING EVENT
0083 I***********                                   REGC  L1        21    CDL002
     I                                              REGC  L1M1      21    CDL002
     I                                              PARI            10
     I              DFCE                            LCEQ
     I              CDOM                            CLOC
     I              ECDP                            DEC1
     I**********                                                          S01196
     I**********LETTERS OF CREDIT EVENT - DETAIL                          S01196
     I**********                                                          S01196
     I*BVNTXEDF****07                                                     S01196
     I**********                                    PARI            10    S01196
     I**********                                    REGC  L1              S01196
     I*
     I*STEVEABF    08                                                     E28817
     I**********SECURITIES*TRADING*EVENT*-*DETAIL**********************   E28817
     I**********                                    PARI            10    E28817
     I**********    REGR                            REGC  L1              E28817
     I**********    DNEE                            LCEQ                  E28817
0141 I*
0143 IEVLXCEGF    02
0142 I*    EVLSR -                                         - TRAILER
     I*                                                                   CDL002
     IFXNEVTD0    07                                                      CDL002
     I*    EVENTS FILE DETAIL RECORD                                      CDL002
     I                                              REGC  L1M1      21    CDL002
0153 I*
0154 I*****                                                               S01194
0155 I*****TABLE FILE - INSTALLATION CONTROL DATA RECORD 1.               S01194
0156 I*****                                                               S01194
0157 I*TABLE***NS       2 C0   3 C1  12 C1                                S01194
0158 I*****  AND      13 C0                                               S01194
0159 I*****                                   1   1 RECI                  S01194
0160 I*****                                   2   30RECT                  S01194
0161 I*****                                  12  130RCDE                  S01194
0162 I*****                                  14  66 TITL                  S01194
0163 I*****                                  67  67 DATF                  S01194
0164 I*****                                  68  700DFBR                  S01194
0165 I*****                                  74  74 MODI1                 S01194
0166 I*****                                  75  75 MODI2                 S01194
0167 I*****                                  76  76 MODI3                 S01194
0168 I*****                               P  77  790RUND                  S01194
0169 I*****                                  80  86 RUNA                  S01194
0170 I*****                                  87  870SFLG                  S01194
0171 I*****                               P  90  920LCD                   S01194
0172 I*****                                  93  93 CHTP                  S01194
0173 I*****                               P  94  960TNLU                  S01194
0174 I*****                                                               S01194
0175 I*****                                                               S01194
0176 I*****TABLE FILE - INSTALLATION CONTROL DATA RECORD 2.               S01194
0177 I*****                                                               S01194
0178 I*TABLE***NS       1 CD   2 C0   3 C1                                S01194
0179 I*****  AND      12 C1  13 C1                                        S01194
0180 I*****                                   1   1 RECI                  S01194
0181 I*****                                   2   30RECT                  S01194
0182 I*****                                  12  130RCDE                  S01194
0183 I*****                                  14  16 BCCY                  S01194
0184 I*****                                  17  19 BCYL                  S01194
0185 I*****                                  20  22 HOCY                  S01194
0186 I*****                                  23  280HEAD                  S01194
0187 I*****                               P  29  310APDA                  S01194
0188 I*****                                  35  35 APFQ                  S01194
0189 I*****                               P  36  380LOGS                  S01194
0190 I*****                                  39  40 CUZR                  S01194
0191 I*****                               P  41  430DNWD                  S01194
0192 I*****                                  44  460BVLP                  S01194
0193 I*****                                  47  49 LOCY                  S01194
0194 I*****                                  50  510FDAY                  S01194
0195 I*****                                  86  86 ISAV                  S01194
0196 I*****                               P  87  890LLOG                  S01194
0197 I*****                               P  90  920LCD                   S01194
0198 I*****                                  93  93 CHTP                  S01194
0199 I*****                               P  94  960TNLU                  S01194
0200 I*****                                                               S01194
0201 I*****                                                               S01194
0202 I*****                                                               S01194
0203 I*****TABLE FILE - INSTALLATION CONTROL DATA RECORD 5.               S01194
0204 I*****                                                               S01194
0205 I*****   NS       1 CD   2 C0   3 C1                                 S01194
0206 I*****  AND      12 C4  13 C0                                        S01194
     I*****                                  14  14 IRFRA           S01157S01194
0207 I*****                                  61  61 ETBI                  S01194
0208 I*****                                                               S01194
0209 I*****                                                               S01194
0210 I*****TABLE FILE - LIMIT TYPES RECORD.                               S01194
0211 I*****                                                               S01194
0212 I*TABLE***NS       1 CD   2 C4   3 C5                                S01194
0213 I*****                                   1   1 RECI                  S01194
0214 I*****                                   2   30RECT                  S01194
0215 I*****                                  11  130LMTP                  S01194
0216 I*****                                  14  16 LEP1                  S01194
0217 I*****                                  17  19 LEP2                  S01194
0218 I*****                                  20  22 LEP3                  S01194
0219 I*****                                  23  25 LEP4                  S01194
0220 I*****                                  26  28 LEP5                  S01194
0221 I*****                                  29  31 LEP6                  S01194
0222 I*****                                  32  340LPC1                  S01194
0223 I*****                                  35  370LPC2                  S01194
0224 I*****                                  38  400LPC3                  S01194
0225 I*****                                  41  430LPC4                  S01194
0226 I*****                                  44  460LPC5                  S01194
0227 I*****                                  47  490LPC6                  S01194
0228 I*****                               P  90  920LCD                   S01194
0229 I*****                                  93  93 CHTP                  S01194
0230 I*****                               P  94  960TNLU                  S01194
0231 I*****                                  14  31 LEPSIN                S01194
0232 I*****                                  32  49 LPCSIN                S01194
0233 I*****                                                               S01194
0234 I*****TABLE FILE - REGION CODES RECORD.                              S01194
0235 I*****                                                               S01194
0236 I*TABLE***NS  04   1 CD   2 C5   3 C1                                S01194
0237 I*****                                   1   1 RECI                  S01194
0238 I*****                                   2   30RECT                  S01194
0239 I*****                                  12  13 REGC                  S01194
0240 I*****                                  14  43 REGN                  S01194
0241 I*****                                  44  460DEPT                  S01194
0242 I*****                               P  47  490DEPX                  S01194
0243 I*****                               P  50  540DEPA                  S01194
0244 I*****                                  55  55 DEPF                  S01194
0245 I*****                               P  56  580DEPR                  S01194
0246 I*****                                  59  600DLRD                  S01194
0247 I*****                                  61  630FRXT                  S01194
0248 I*****                               P  64  660FRXX                  S01194
0249 I*****                               P  67  710FRXA                  S01194
0250 I*****                                  72  72 FRXF                  S01194
0251 I*****                               P  73  750FRXR                  S01194
0252 I*****                                  76  770FLRD                  S01194
0253 I*****                               P  90  920LCD                   S01194
0254 I*****                                  93  93 CHTP                  S01194
0255 I*****                               P  94  960TNLU                  S01194
     I***** NEW FIELDS FOR FRA/IRS                                  S01157S01194
     I*****                               P  97  990FRAX            S01157S01194
     I*****                               P 100 1040FRAA            S01157S01194
     I*****                                 105 105 FRAF            S01157S01194
     I*****                               P 106 1080FRAR            S01157S01194
     I*****                                 109 1100FRAD            S01157S01194
     I*****                               P 111 1130IRSX            S01157S01194
     I*****                               P 114 1180IRSA            S01157S01194
     I*****                                 119 119 IRSF            S01157S01194
     I*****                               P 120 1220IRSR            S01157S01194
     I*****                                 123 1250IRSD            S01157S01194
0256 I*****                                                               S01194
0257 I*****TABLE FILE - CURRENCIES RECORD 1.                              S01194
0258 I*****                                                               S01194
0259 I*TABLE***NS       1 CD   2 C2   3 C0                                S01194
0260 I*****  AND      13 C1                                               S01194
0261 I*****                                   1   1 RECI                  S01194
0262 I*****                                   2   30RECT                  S01194
0263 I*****                                  10  12 CCY                   S01194
0264 I*****                                  13  130SREC                  S01194
0265 I*****                                  14  27 CCNM                  S01194
0266 I*****                               P  28  348SPOT                  S01194
0267 I*****                                  35  37 CCYS                  S01194
0268 I*****                                  38  380CDP                   S01194
0269 I*****                                  39  390TNOT                  S01194
0270 I*****                                  40  40 DCCY                  S01194
0271 I*****                                  41  44 SRC1                  S01194
0272 I*****                                  45  48 SRC2                  S01194
0273 I*****                                  49  520TACC                  S01194
0274 I*****                                  53  560TEQV                  S01194
0275 I*****                                  57  600SWQV                  S01194
0276 I*****                                  61  640TAC4                  S01194
0277 I*****                                  65  680TAC5                  S01194
0278 I*****                                  69  69 HIND                  S01194
0279 I*****                               P  70  768PART                  S01194
0280 I*****                                  77  780SSNO                  S01194
0281 I*****                               P  79  858ERLC                  S01194
0282 I*****                               P  90  920LCD                   S01194
0283 I*****                                  93  93 CHTP                  S01194
0284 I*****                               P  94  960TNLU                  S01194
0285 I*****                                                               S01194
0286 I*****TABLE FILE - HOLIDAY RECORD.                                   S01194
0287 I*****   E-EXCLUDE, I-INCLUDE.                                       S01194
0288 I*****                                                               S01194
0289 I*TABLE***NS       1 CD   2 C2   3 C2                                S01194
0290 I*****  AND      14 CE                                               S01194
0291 I*****  OR        1 CD   2 C2   3 C2                                 S01194
0292 I*****  AND      14 CI                                               S01194
0293 I*****                                   1   1 RECI                  S01194
0294 I*****                                   2   30RECT                  S01194
0295 I*****                                   8  120HOL                   S01194
0296 I*****                                  13  130SREC                  S01194
0297 I*****                                  14  14 INEX                  S01194
0298 I*****                                  15  89 HCCY                  S01194
0299 I*****                               P  90  920LCD                   S01194
0300 I*****                                  93  93 CHTP                  S01194
0301 I*****                               P  94  960TNLU                  S01194
0302 I*****                                                               S01194
0303 I*****                                                               S01194
0304 I*****CATCHALL                                                       S01194
0305 I*****   NS                                                          S01194
0306 I*****                                   1   1 RECI                  S01194
0307 I*****                                   2   30RECT                  S01194
0308 I*****                                                               S01194
0309 I*****                                                               S01194
0310 I*****                                                               S01194
     E/COPY ZSRSRC,ZHOLI                                                  S01195
     I*                                                                   S01194
     ISDBANK    E DSSDBANKPD                                              S01194
     I** EXTERNAL DS FOR BANK DETAILS                                     S01194
     I*                                                                   S01194
     ISDDEAL    E DSSDDEALPD                                              S01194
     I** EXTERNAL DS FOR DEALING DETAILS                                  S01194
     I*                                                                   S01194
     ISDCURR    E DSSDCURRPD                                              S01194
     I** EXTERNAL DS FOR CURRENCY DETAILS                                 S01194
     I*                                                                   S01194
     I***SDSYLN****E DSSDSYLNPD                                     S01194E25515
     I***EXTERNAL*DS*FOR*SYNDICATED*LOANS*DETAILS                   S01194E25515
     I**********                                                    S01194E25515
     ISDMMOD    E DSSDMMODPD                                              S01194
     I** EXTERNAL DS FOR MIDAS MODULES DETAILS                            S01194
     I*                                                                   S01194
     ISDRGLM    E DSSDRGLMPD                                              S01194
     I** EXTERNAL DS FOR REGION LIMITS DETAILS                            S01194
     I*                                                                   S01194
     ISDREGN    E DSSDREGNPD                                              S01194
     I** EXTERNAL DS FOR REGION CODE DETAILS                              S01194
     I*                                                                   S01194
     ISDLIMT    E DSSDLIMTPD                                              S01194
     I** EXTERNAL DS FOR LIMITS DETAILS                                   S01194
     I*                                                                   S01194
     ISCSARD    E DSSCSARDPD                                              CLE005
     I** Switchable Features File                                         CLE005
     I*                                                                   CLE005
     IDSFDY     E DSDSFDY                                                 S01194
     I* FIRST DS FOR ACCESS PROGRAMS, SHORT DATA STRUCTURE                S01194
     I*                                                                   S01117
     IDSSDY     E DSDSSDY                                                 S01194
     I* SECOND DS FOR ACCESS PROGRAMS, LONG DATA STRUCTURE                S01194
     I**                                                                  S01117
     ISPOOL1      DS                                                      S01117
     I**   FILE INFORMATION DATA STRUCTURE                                S01117
     I                                       83  92 SFILE1                S01117
     I                                    B 123 1240SFNUM1                S01117
     I**                                                                  S01117
     ISPOOLU      DS                                                      S01117
     I**   FILE INFORMATION DATA STRUCTURE                                S01117
     I                                       83  92 SFILEU                S01117
     I                                    B 123 1240SFNUMU                S01117
0312 I**                                                                  S01117
0311 I********************************************************************S01117
     I**                                                                  S01117
0313 I**   DATA STRUCTURES TO LINK XFDAA/XFDA & XLDAA/XLDA & INPUT FIELDS
0314 I            DS
0315 I                                        1  18 XFDA
0316 I                                        1  18 XFDAA
0317 I                                        1  18 XFDAIN
0318 I            DS
0319 I                                        1  18 XLDA
0320 I                                        1  18 XLDAA
0321 I                                        1  18 XLDAIN
0322 I            DS
0323 I                                        1  18 XFPC
0324 I                                        1  18 XFPCIN
0314 ILEPSIN      DS                                                      S01194
     I* DATA STRUCTURE OF END/1ST TO 6TH LIMIT PERIODS                    S01194
0216 I                                        1   3 XLEP1                 S01194
0217 I                                        4   6 XLEP2                 S01194
0218 I                                        7   9 XLEP3                 S01194
0219 I                                       10  12 XLEP4                 S01194
0220 I                                       13  15 XLEP5                 S01194
0221 I                                       16  18 XLEP6                 S01194
0314 ILPCSIN      DS                                                      S01194
     I* DATA STRUCTURE OF %/LIMIT FOR 1ST TO 6TH PERIODS                  S01194
0222 I                                        1   30XLPC1                 S01194
0223 I                                        4   60XLPC2                 S01194
0224 I                                        7   90XLPC3                 S01194
0225 I                                       10  120XLPC4                 S01194
0226 I                                       13  150XLPC5                 S01194
0227 I                                       16  180XLPC6                 S01194
0325 I            DS
0326 I                                        1  18 XLPC
0327 I                                        1  18 XLPCIN
     C*                                                                   S01117
0111 C*
     C           *ENTRY    PLIST                                          S01117
     C                     PARM           SEQ     5                       S01117
     C*                                                                   S01117
0328 C**   ON FIRST CYCLE - GET ICDR1 & 2
0329 C   40                GOTO DETAIL
      *                                                                   CDL006
      ** Check if CDL006 is switched *ON.                                 CDL006
      *                                                                   CDL006
     C                     MOVE 'N'       CDL006  1                       CDL006
     C                     CALL 'AOSARDR0'                                CDL006
     C                     PARM *BLANKS   @RTCD                           CDL006
     C                     PARM '*VERIFY' @OPTN                           CDL006
     C                     PARM 'CDL006'  @SARD                           CDL006
     C           SCSARD    PARM SCSARD    DSFDY                           CDL006
      *                                                                   CDL006
     C           @RTCD     IFEQ *BLANKS                                   CDL006
     C                     MOVE 'Y'       CDL006                          CDL006
     C                     END                                            CDL006
      *                                                                   CDL006
     C           @RTCD     IFNE *BLANKS                                   CDL006
     C           @RTCD     ANDNE'*NRF  '                                  CDL006
     C                     MOVEL'SCSARDPD'DBFILE                          CDL006
     C                     MOVEL'09'      DBASE                           CDL006
     C                     MOVEL@SARD     DBKEY                           CDL006
     C                     MOVE *ON       *INU7                           CDL006
     C                     MOVE *ON       *INU8                           CDL006
     C                     MOVE *ON       *INLR                           CDL006
     C                     EXSR *PSSR                                     CDL006
     C                     GOTO END                                       CDL006
     C                     END                                            CDL006
      *                                                                   CDL006
0330 C**
0331 C*****                EXSR ZSYSTM                                    S01194
0332 C***99                SETON                     U7U8LR               S01194
0333 C*****                MOVE '1'       ZTABKY                          S01194
0334 C*****      ZTABKY    CHAINTABLE                40                   S01194
0335 C***40                SETON                     U7U8LR               S01194
0336 C***40                                                               S01194
0337 C*R*99**              GOTO END                                       S01194
0338 C*****                                                               S01194
0339 C*****                MOVEL'20      'TABKEY 12                       S01194
0340 C*****                MOVELBCYL      WK4     4                       S01194
0341 C*****                MOVE '1'       WK4                             S01194
0342 C*****                MOVE WK4       TABKEY                          S01194
0343 C*****      TABKEY    CHAINTABLE                40                   S01194
0344 C***40                SETON                     U7U8LR               S01194
0345 C***40                GOTO END                                       S01194
0346 C*****      CDP       ADD  1         DEP     10                      S01194
0347 C******                                                              S01194
0348 C*****CHAIN TO INSTALLATION CONTROL DATA RECORD 5 TO CHECK           S01194
0349 C*****WHETHER 'EVENTS TO END OF BOOK' INDICATOR IS 'Y'               S01194
0350 C*****                                                               S01194
0351 C*****                MOVEL'01      'TABKEY                          S01194
0352 C*****                MOVE '  40'    TABKEY                          S01194
0353 C*****      TABKEY    CHAINTABLE                40                   S01194
0354 C***40                SETON                     U7U8LR               S01194
0355 C***40                GOTO END                                       S01194
0356 C*****      ETBI      COMP 'Y'                      78               S01194
      *
     C                     MOVEACPY@      BIS@   80
     C*                                                                   S01194
     C** OBTAIN BANK DETAILS VIA ACCESS PROGRAM                           S01194
     C                     CALL 'AOBANKR0'                                S01194
     C                     PARM '*MSG   ' @RTCD   7                       S01194
     C                     PARM '*FIRST ' @OPTN   7                       S01194
     C           SDBANK    PARM SDBANK    DSFDY                           S01194
     C           @RTCD     IFNE *BLANK                                    S01194
     C                     MOVEL'SDBANKPD'DBFILE 10        ************   S01194
     C                     MOVEL'01'      DBASE   3        * DBERR 01 *   S01194
     C                     MOVEL@OPTN     DBOPTN  7        ************   S01194
     C                     SETON                     U7U8LR               S01194
     C                     EXSR *PSSR                                     S01194
     C                     GOTO END                                       S01194
     C                     END                                            S01194
     C*                                                                   S01194
     C** TEST DATE FORMAT VALUE                                           S01194
0951 C           BJDFIN    COMP 'M'                      98MMDDYY, 98 ON  S01194
0951 C*                                                                N  S01194
     C** READ DEAL DETAILS VIA ACCESS PROGRAM FOR BASE CCY FOR LIMITS     S01194
     C**********           CALL 'AODEALR0'                                S01194              CGL029
     C                     CALL 'AODEALR1'                                                    CGL029
     C                     PARM '*MSG   ' @RTCD   7                       S01194
     C                     PARM '*FIRST ' @OPTN   7                       S01194
     C********** SDDEAL    PARM SDDEAL    DSFDY                           S01194              CGL029
     C           SDDEAL    PARM SDDEAL    DSSDY                                               CGL029
     C           @RTCD     IFNE *BLANK                                    S01194
     C                     MOVEL'SDDEALPD'DBFILE           ************   S01194
     C                     MOVEL'02'      DBASE            * DBERR 02 *   S01194
     C                     MOVEL@OPTN     DBOPTN           ************   S01194
     C                     SETON                     U7U8LR               S01194
     C                     EXSR *PSSR                                     S01194
     C                     GOTO END                                       S01194
     C                     END                                            S01194
0951 C*                                                                N  S01194
     C** READ CCY DETAILS VIA ACCESS PROGRAM FOR DECIMAL PLACES           S01194
     C                     CALL 'AOCURRR0'                                S01194
     C                     PARM '*MSG   ' @RTCD   7                       S01194
     C                     PARM '*KEY   ' @OPTN   7                       S01194
     C                     PARM BNCYCD    @AJCD   3                       S01194
     C           SDCURR    PARM SDCURR    DSSDY                           S01194
     C           @RTCD     IFNE *BLANK                                    S01194
     C                     MOVEL'SDCURRPD'DBFILE           ************   S01194
     C                     MOVEL'03'      DBASE            * DBERR 03 *   S01194
     C                     MOVEL@OPTN     DBOPTN  7        ************   S01194
     C                     MOVEL@AJCD     DBKEY  29                       S01194
     C                     SETON                     U7U8LR               S01194
     C                     EXSR *PSSR                                     S01194
     C                     GOTO END                                       S01194
     C                     END                                            S01194
0951 C*                                                                N  S01194
0346 C           A6NBDP    ADD  1         DEP     10                      S01194
0951 C*                                                                N  S01194
     C* Call Access Prog. For MODULE DETAILS.                             BHF244
     C                     CALL 'AOMMODR0'                                BHF244
     C                     PARM '*MSG   ' @RTCD   7                       BHF244
     C                     PARM '*FIRST ' @OPTN   7                       BHF244
     C           SDMMOD    PARM SDMMOD    DSFDY                           BHF244
0951 C*                                                                   BHF244
     C* If error occurs...                                                BHF244
     C           @RTCD     IFNE *BLANK                                    BHF244
     C                     MOVEL'SDMMODPD'DBFILE           ************   BHF244
     C                     MOVEL'05'      DBASE            * DBERR 05 *   BHF244
     C                     MOVEL@OPTN     DBOPTN  7        ************   BHF244
     C                     MOVEL@OPTN     DBKEY                           BHF244
     C                     SETON                     U7U8LR               BHF244
     C                     EXSR *PSSR                                     BHF244
     C                     GOTO END                                       BHF244
     C                     END                                            BHF244
      *                                                                   CLE005
      ** Check if CLE005 is switched *ON.                                 CLE005
      *                                                                   CLE005
     C                     MOVE 'N'       CLE005  1                       CLE005
     C                     CALL 'AOSARDR0'                                CLE005
     C                     PARM *BLANKS   @RTCD   7                       CLE005
     C                     PARM '*VERIFY' @OPTN   7                       CLE005
     C                     PARM 'CLE005'  @SARD   6                       CLE005
     C           SCSARD    PARM SCSARD    DSFDY                           CLE005
      *                                                                   CLE005
     C           @RTCD     IFEQ *BLANKS                                   CLE005
     C                     MOVE 'Y'       CLE005                          CLE005
     C                     END                                            CLE005
      *                                                                   CLE005
     C           @RTCD     IFNE *BLANKS                                   CLE005
     C           @RTCD     ANDNE'*NRF  '                                  CLE005
     C                     MOVEL'SCSARDPD'DBFILE           ************   CLE005
     C                     MOVEL'08'      DBASE            * DBERR 08 *   CLE005
     C                     MOVEL@SARD     DBKEY            ************   CLE005
     C                     SETON                     U7U8LR               CLE005
     C                     EXSR *PSSR                                     CLE005
     C                     GOTO END                                       CLE005
     C                     END                                            CLE005
      *                                                                   CLE005
      ** Check if Flat Rate Personal Loans (Rule of 78s) is installed.                        CLE028
      *                                                                                       CLE028
     C                     MOVE 'N'       CLE028  1                                           CLE028
     C                     CALL 'AOSARDR0'                                                    CLE028
     C                     PARM *BLANKS   @RTCD                                               CLE028
     C                     PARM '*VERIFY' @OPTN                                               CLE028
     C                     PARM 'CLE028'  @SARD                                               CLE028
     C           SCSARD    PARM SCSARD    DSFDY                                               CLE028
      *                                                                                       CLE028
     C           @RTCD     IFEQ *BLANKS                                                       CLE028
     C                     MOVE 'Y'       CLE028                                              CLE028
     C                     ENDIF                                                              CLE028
      *                                                                                       CLE028
     C           @RTCD     IFNE *BLANKS                                                       CLE028
     C           @RTCD     ANDNE'*NRF  '                                                      CLE028
     C                     MOVEL'SCSARDPD'DBFILE                                              CLE028
     C                     MOVEL'10'      DBASE                                               CLE028
     C                     MOVEL@SARD     DBKEY                                               CLE028
     C                     MOVE *ON       *INU7                                               CLE028
     C                     MOVE *ON       *INU8                                               CLE028
     C                     MOVE *ON       *INLR                                               CLE028
     C                     EXSR *PSSR                                                         CLE028
     C                     GOTO END                                                           CLE028
     C                     ENDIF                                                              CLE028
      *                                                                                       CLE028
     C***********                                                   BHF244E25515
     C**ONLY*DO*IF*SYNDICATED*LOANS*IS*PRESENT:                     BHF244E25515
     C***********BGSYLN    IFEQ 'Y'                                 BHF244E25515
0951 C***********                                                   S01194E25515
     C***READ*SYNDICATED*LOANS*DETAILS*VIA*ACCESS*PROGRAM           S01194E25515
     C***********          CALL 'AOSYLNR0'                          S01194E25515
     C***********          PARM '*MSG   ' @RTCD   7                 S01194E25515
     C***********          PARM '*FIRST ' @OPTN   7                 S01194E25515
     C***********SDSYLN    PARM SDSYLN    DSFDY                     S01194E25515
     C***********@RTCD     IFNE *BLANK                              S01194E25515
     C***********          MOVEL'SDSYLNPD'DBFILE        ************S01194E25515
     C***********          MOVEL'04'      DBASE         * DBERR 04 *S01194E25515
     C***********          MOVEL@OPTN     DBOPTN  7     ************S01194E25515
     C***********          SETON                     U7U8LR         S01194E25515
     C***********          EXSR *PSSR                               S01194E25515
     C***********          GOTO END                                 S01194E25515
     C***********          END                                      S01194E25515
0356 C***********                                                   S01194E25515
0349 C*****WHETHER*'EVENTS*TO*END*OF*BOOK'*INDICATOR*IS*'Y'         S01194E25515
0356 C***********BOGEEB    COMP 'Y'                      78         S01194E25515
     C***********          END                                      BHF244E25515
0951 C***********                                                   S01194E25515
     C***READ*MIDAS*MODULES*DETAILS*VIA ACCESS PROGRAM                    S01194
     C**********           CALL 'AOMMODR0'                          S01194BHF244
     C**********           PARM '*MSG   ' @RTCD   7                 S01194BHF244
     C**********           PARM '*FIRST ' @OPTN   7                 S01194BHF244
     C********** SDMMOD    PARM SDMMOD    DSFDY                     S01194BHF244
0951 C**********                                                    S01194BHF244
     C**If*error*occurs...                                          S01194BHF244
     C********** @RTCD     IFNE *BLANK                              S01194BHF244
     C**********           MOVEL'SDMMODPD'DBFILE           *********S01194BHF244
     C**********           MOVEL'05'      DBASE            * DBERR 0S01194BHF244
     C**********           MOVEL@OPTN     DBOPTN  7        *********S01194BHF244
     C**********           MOVEL@OPTN     DBKEY                     S01194BHF244
     C**********           SETON                     U7U8LR         S01194BHF244
     C**********           EXSR *PSSR                               S01194BHF244
     C**********           GOTO END                                 S01194BHF244
     C**********           END                                      S01194BHF244
     C*                                                                   S01157
     C**   CHECK WETHER FRA/IRS PRESENT. IF NOT DO NOT PRINT.             S01157
     C*****      IRFRA     IFEQ 'Y'                                 S01157S01194
     C           BGFIIN    IFEQ 'Y'                                       S01194
     C                     SETON                     57                   S01157
     C                     ELSE                                           S01157
     C                     SETOF                     57                   S01157
     C                     END                                            S01157
0357 C**
0358 C*    OBTAIN NO. OF DAYS FORWARD FOR 'SP'
0359 C*****                Z-ADDRUND      ZDAYNO                          S01194
0360 C*****                MOVE BCYL      ZCCY                            S01194
0359 C                     Z-ADDBJRDNB    ZDAYNO                          S01194
0360 C                     MOVE BNCYCD    ZCCY                            S01194
0361 C                     Z-ADD2         ZNRDYS
0361 C                     MOVE BJSLCD    ZLOC                            S01195
0362 C                     EXSR ZFWDT                                     S01195
0362 C*****                EXSR ZDATE3                                    S01195
0363 C*****      ZDYNBR    SUB  RUND      SP      50                      S01194
0363 C           ZDYNBR    SUB  BJRDNB    SP      50                      S01194
0364 C*****                                                               S01117
0365 C*****SET OF SO THAT FIRST PAGE HEADINGS ARE FETCHED                 S01117
0366 C*****                SETON                         OF               S01117
0367 C**
0368 C                     SETON                     40
     C*                                                                   CDL002
     C* Net FX Customer Exposure?                                         CDL002
     C           *INU3     IFEQ *ON                                       CDL002
     C                     MOVE BNNTCE    W#NFCE  1                       CDL002
     C                     OPEN DEALS                                     CDL002
     C                     ENDIF                                          CDL002
     C*                                                                   CDL002
0369 C           DETAIL    TAG                             **  DETAIL  **
0370 C   02                GOTO TRAILR
0371 C**N01N03N05******                                                   E25515
     C  N01N03                                                            E25515
     CANN07                                                               CDL002
     C*NN06N07N08**********GOTO END                                       S01196
     C*ANN06N08            GOTO END                                 S01196E28817
     CANN06                GOTO END                                       E28817
0372 C**
0373 C**   CONTROL TOTALS
     C           *IN07     IFEQ '0'                                       CDL002
0374 C           RREAD     ADD  1         RREAD   70
     C                     ELSE                                           CDL002
     C           NREAD     ADD  1         NREAD   70                      CDL002
     C                     END                                            CDL002
0375 C  N21                SETON                     32
0376 C*
0377 C*    IGNORE LIMIT RECORDS
0378 C   03                GOTO END
0379 C**   DETAILS TO REPORT
0364 C**                                                                  S01117
0365 C**   SET OVERFLOW IND. AND WRITE HEADINGS FOR FIRST TIME            S01117
0366 C  N31                SETON                         OF               S01117
     C  N31                EXCPTHEADS                                     S01117
     C**                                                                  S01117
0380 C                     SETON                     31
0381 C           EAMT      DIV  1000      ZZAMT        25
0382 C   25                Z-SUBZZAMT     ZZAMT
     C           *IN07     IFEQ '0'                                       CDL002
0383 C                     Z-ADDTOTI      ZZTOTI
0384 C                     Z-ADDTOTD      ZZTOTD
     C                     ELSE                                           CDL002
     C                     Z-ADDTOTNI     ZZTOTI                          CDL002
     C                     Z-ADDTOTND     ZZTOTD                          CDL002
     C                     END                                            CDL002
0385 C                     EXSR GLZADD
     C           *IN07     IFEQ '0'                                       CDL002
0386 C                     Z-ADDZZTOTI    TOTI   150
0387 C                     Z-ADDZZTOTD    TOTD    30
     C                     ELSE                                           CDL002
     C                     Z-ADDZZTOTI    TOTNI  150                      CDL002
     C                     Z-ADDZZTOTD    TOTND   30                      CDL002
     C                     END                                            CDL002
     C/COPY WNCPYSRC,DL0800C001
0388 C**
0389 C**   IGNORE FOLLOWING RECORDS
0390 C**   BLANK REGION CODE
0391 C   21                GOTO END
0392 C*    FROM THE DEALING FILE
0393 C   01      RLVI      COMP 'Y'                      30
0394 C   01N30   FCTI      COMP 'Y'                      30
0395 C   01 30 L1          GOTO CNTRY
0396 C   01 30             GOTO END
0397 C*
0398 C**
0399 C**   DISREGARD RECORDS WITH PARENT INDICATOR - 1
0400 C  N10 L1             GOTO CNTRY
0401 C  N10                GOTO END
0402 C*****BLANK*REGION*CODE**********************************************
0403 C**
0404 C**   - COUNT RECORDS LISTED IN THIS REPORT
0405 C           RLIST     ADD  1         RLIST   70
0406 C**
0407 C**   HASH TOTAL THE RECORDS LISTED
0408 C                     Z-ADDTOTIL     ZZTOTI
0409 C                     Z-ADDTOTDL     ZZTOTD
0410 C                     EXSR GLZADD
0411 C                     Z-ADDZZTOTI    TOTIL  150
0412 C                     Z-ADDZZTOTD    TOTDL   30
      *                                                                   CDL006
      ** Skip all the processing if CDL006 is on and the                  CDL006
      ** the Deal Type = FL, DP, LP, FT, DT or LT.                        CDL006
      *                                                                   CDL006
     C           CDL006    IFEQ 'Y'                                       CDL006
     C           DTYP      ANDEQ'FL'                                      CDL006
     C           CDL006    OREQ 'Y'                                       CDL006
     C           DTYP      ANDEQ'DP'                                      CDL006
     C           CDL006    OREQ 'Y'                                       CDL006
     C           DTYP      ANDEQ'LP'                                      CDL006
     C           CDL006    OREQ 'Y'                                       CDL006
     C           DTYP      ANDEQ'FT'                                      CDL006
     C           CDL006    OREQ 'Y'                                       CDL006
     C           DTYP      ANDEQ'DT'                                      CDL006
     C           CDL006    OREQ 'Y'                                       CDL006
     C           DTYP      ANDEQ'LT'                                      CDL006
     C                     GOTO END                                       CDL006
     C                     END                                            CDL006
      *                                                                   CDL006
0413 C**
0414 C**   ON CHANGE OF REGION
0415 C  NL1                GOTO FXCHEK
0416 C*
0417 C*    CHAIN TO REGION RECORD
0418 C           CNTRY     TAG                             ** CNTRY TAG **
0419 C*****                MOVEL'51      'TABKEY 12                       S01194
0420 C*****                MOVE '    '    TABKEY                          S01194
0421 C*****                MOVE REGC      TABKEY                          S01194
0422 C*****      TABKEY    CHAINTABLE                41                   S01194
0423 C**N04*               SETON                     U7U8LR               S01194
0424 C**N04*               GOTO END                                       S01194
0951 C*                                                                N  S01194
     C** READ REGION LIMITS DETAILS VIA ACCESS PROGRAM                    S01194
     C                     CALL 'AORGLMR0'                                S01194
     C                     PARM '*MSG   ' @RTCD   7                       S01194
     C                     PARM '*KEY   ' @OPTN   7                       S01194
     C                     PARM REGC      @REGC   2                       S01194
     C                     PARM 'S'       @LEVL   1                       S01194
     C*****                PARM *BLANKS   @ENTY   3                S01194 BHF245
     C                     PARM 'SYS'     @ENTY   3                       BHF245
     C           SDRGLM    PARM SDRGLM    DSFDY                           S01194
     C           @RTCD     IFNE *BLANK                                    S01194
     C******************** MOVEL'SDRGLMPD'DBFILE           *********S01194DT0081
     C******************** MOVEL'06'      DBASE           * DBERR 06S01194DT0081
     C*********************MOVEL@REGC     DBKEY            *********S01194DT0081
     C*********************MOVEL@OPTN     DBOPTN                    S01194DT0081
     C*********************SETON                     U7U8LR         S01194DT0081
     C*********************EXSR *PSSR                               S01194DT0081
     C*********************GOTO END                                 S01194DT0081
     C                     Z-ADD0         DYFLED                          DT0081
     C                     Z-ADD0         DYLLED                          DT0081
     C                     MOVE *BLANKS   DYFXLT                          DT0081
     C                     MOVE *BLANKS   DYLLTY                          DT0081
     C                     Z-ADD0         DYFLAM                          DT0081
     C                     Z-ADD0         DYLLAM                          DT0081
     C                     END                                            S01194
     C*                                                                   S01194
     C** READ REGION CODES DETAILS VIA ACCESS PROGRAM                     S01194
     C                     CALL 'AOREGNR0'                                S01194
     C                     PARM '*MSG   ' @RTCD   7                       S01194
     C                     PARM '*KEY   ' @OPTN   7                       S01194
     C                     PARM REGC      @REGC   2                       S01194
     C           SDREGN    PARM SDREGN    DSFDY                           S01194
     C           @RTCD     IFNE *BLANK                                    S01194
     C                     MOVEL'SDREGNPD'DBFILE           ************   S01194
     C                     MOVEL'07'      DBASE            * DBERR 07 *   S01194
     C                     MOVEL@REGC     DBKEY            ************   S01194
     C                     MOVEL@OPTN     DBOPTN                          S01194
     C                     SETON                     U7U8LR               S01194
     C                     EXSR *PSSR                                     S01194
     C                     GOTO END                                       S01194
     C                     END                                            S01194
     C*                                                                   S01194
0425 C**   MOVE FIELDS TO DLLMT I/P FIELDS
0426 C*****                Z-ADDFRXX      FLED    50       LIMIT EXPIRY   S01194
0426 C                     Z-ADDDYFLED    FLED    50       LIMIT EXPIRY   S01194
0427 C*****                Z-ADDDEPX      LLED    50             DATE     S01194
0427 C                     Z-ADDDYLLED    LLED    50             DATE     S01194
0428 C**
0429 C*****                MOVE FRXT      FLTY    30       LIMIT TYPE     S01194
0429 C                     MOVE DYFXLT    FLTY    30       LIMIT TYPE     S01194
0430 C*****                MOVE DEPT      LLTY    30                      S01194
0430 C                     MOVE DYLLTY    LLTY    30                      S01194
0431 C**
0432 C*****                Z-ADDFRXA      FLAM    90       LIMIT AMOUNT   S01194
0432 C                     Z-ADDDYFLAM    FLAM    90       LIMIT AMOUNT   S01194
0434 C*****                Z-ADDDEPA      LLAM    90                      S01194
0434 C                     Z-ADDDYLLAM    LLAM    90                      S01194
0434 C**
0435 C**   SET UP LIMIT PERIODS & AMOUNTS
0436 C                     EXSR DLLMT
0437 C   LR
0438 COR 30 01
0439 CORN10                GOTO END
0440 C**
0441 C**   CHECK IF EVENT TYPE FOR FX DEAL.
0442 C           FXCHEK    TAG                             **  FXCHEK  **
0443 C           ETYP      COMP '11V1'                   42
0444 C  N42      ETYP      COMP '12V1'                   42
0445 C  N42      ETYP      COMP '13V1'                   42
0446 C  N42      ETYP      COMP '14V1'                   42
     C  N42      ETYP      COMP 'NTV1'                   42               CDL002
0447 C**
0448 C**   - IF SO CALCULATE EXPOSURE
0449 C  N42                GOTO LONCHK
     C*                                                                   CDL002
     C* Net FX Customer Exposure?                                         CDL002
     C           W#NFCE    IFEQ 'Y'                                       CDL002
      *   FX Deal Events                                                  CDL002
     C           *IN01     IFEQ *ON                                       CDL002
     C*                                                                   CDL002
     C           DLNO      CHAINDEALSDBF             85                   CDL002
     C           *IN85     IFEQ *ON                                       CDL002
     C                     MOVEL'DEALS   'DBFILE           ************   CDL002
     C                     MOVEL'08'      DBASE            * DBERR 08 *   CDL002
     C                     MOVELDLNO      DBKEY            ************   CDL002
     C                     SETON                     U7U8LR               CDL002
     C                     EXSR *PSSR                                     CDL002
     C                     GOTO END                                       CDL002
     C                     ELSE                                           CDL002
     C*   Exclude netted FX deal events                                   CDL002
     C           NETBR     IFNE *BLANKS                                   CDL002
     C                     GOTO END                                       CDL002
     C                     ENDIF                                          CDL002
     C                     ENDIF                                          CDL002
     C                     ENDIF                                          CDL002
     C                     ENDIF                                          CDL002
     C*                                                                   CDL002
     C*   Net buy event                                                   CDL002
     C           *IN07     IFEQ *ON                                       CDL002
     C*     Include FX net buy events                                     CDL002
     C           INOI      IFNE 'I'                                       CDL002
     C           W#NFCE    ORNE 'Y'                                       CDL002
     C                     GOTO END                                       CDL002
     C                     ENDIF                                          CDL002
     C                     ENDIF                                          CDL002
     C*                                                                   CDL002
0450 C                     Z-ADDEDAT      DLVALU
0451 C           LCEQ      DIV  FCT,DEP   DLAMTF    H
0452 C                     EXSR DLEXPF
0453 C                     GOTO END
0454 C**
0455 C**   CHECK IF EVENT TYPE FOR LOAN DEAL.
0456 C           LONCHK    TAG                             **  LONCHK  **
     C           ETYP      COMP '15V1'                   44               E12072
     C  N44      ETYP      COMP '17V1'                   44               E12072
0457 C           ETYP      COMP '15M1'                   42
0458 C  N42      ETYP      COMP '17M1'                   42
0459 C  N42      ETYP      COMP '17S1'                   42
     C*                                                                   S01157
     C**   FRA/IRS EVENTS NO LONGER INCLUDED IN LENDING                   S01157
     C*                                                                   S01157
0465 C**N42      ETYP      COMP '21E1'                   42        S01119 S01157
0466 C**N42      ETYP      COMP '22E1'                   42        S01119 S01157
0467 C**N42      ETYP      COMP '23E1'                   42        S01119 S01157
0468 C**N42      ETYP      COMP '24E1'                   42        S01119 S01157
0460 C*****DO*NOT*INCLUDE*COMMERCIAL*LOANS*EVENTS*UNLESS                  E25515
0461 C*****'EVENTS*TO*END*OF*BOOK'*INDICATOR*=*'Y'.                       E25515
0462 C***********                                                         E25515
0463 C**N78******          GOTO Z1                                        E25515
0464 C***********                                                         E25515
0465 C**N42******ETYP      COMP '41M3'                   42               E25515
0466 C**N42******ETYP      COMP '41R1'                   42               E25515
0467 C**N42******ETYP      COMP '41R3'                   42               E25515
0468 C**N42******ETYP      COMP '41M1'                   42               E25515
0469 C**N42******ETYP      COMP '41R4'                   42               E25515
0470 C**N42******ETYP      COMP '42M1'                   42               E25515
0471 C***********ETYP      COMP '41R3'                   45               E25515
0472 C***45******          Z-SUBLCEQ      LCEQ                            E25515
0473 C***********Z1        TAG                                            E25515
0474 C**
     C***
     C***   CUSTOMER LENDING EVENTS
     C***
     C  N42      ETYP      COMP '61R1'                   42
     C  N42      ETYP      COMP '61M1'                   42
      *                                                                   CLE005
      ** Check if CLE005 is *ON                                           CLE005
     C           CLE005    IFEQ 'Y'                                       CLE005
     C           *IN42     ANDEQ'0'                                       CLE005
      *                                                                   CLE005
     C           ETYP      IFEQ '68R1'                                    CLE005
     C           ETYP      OREQ '68M1'                                    CLE005
     C                     SETON                     42                   CLE005
     C                     ENDIF                                          CLE005
      *                                                                   CLE005
     C                     ENDIF                                          CLE005
      *                                                                   CLE005
     C  N42      ETYP      COMP '62R1'                   42
     C  N42      ETYP      COMP '62M1'                   42
     C  N42      ETYP      COMP '63M1'                   42
     C  N42      ETYP      COMP '64R1'                   42
     C  N42      ETYP      COMP '64M1'                   42
     C  N42      ETYP      COMP '65M1'                   42
      *                                                                                       CLE028
      ** If Flat Rate Personal Loans (Rule of 78s) is installed,                              CLE028
      ** include the new event types '80R1' and '80M1' on the                                 CLE028
      ** processing.                                                                          CLE028
      *                                                                                       CLE028
     C           CLE028    IFEQ 'Y'                                                           CLE028
     C           *IN42     ANDEQ*OFF                                                          CLE028
      *                                                                                       CLE028
     C           ETYP      IFEQ '80R1'                                                        CLE028
     C           ETYP      OREQ '80M1'                                                        CLE028
     C                     MOVE *ON       *IN42                                               CLE028
     C                     ENDIF                                                              CLE028
      *                                                                                       CLE028
     C                     ENDIF                                                              CLE028
      *                                                                                       CLE028
     C*****                                                               S01196
     C***** LETTERS OF CREDIT EVENTS                                      S01196
     C**N42      ETYP      COMP '80M1'                   42               S01196
     C**N42      ETYP      COMP '81D1'                   42               S01196
     C**N42      ETYP      COMP '81M1'                   42               S01196
     C**N42      ETYP      COMP '81M3'                   42               S01196
     C**N42      ETYP      COMP '82A1'                   42               S01196
     C**N42      ETYP      COMP '82M1'                   42               S01196
     C**N42      ETYP      COMP '84V1'                   42               S01196
     C**N42      ETYP      COMP '84V2'                   42               S01196
     C***   SECURITIES TRADING EVENTS
     C  N42      ETYP      COMP '30P1'                   42
     C  N42      ETYP      COMP '30S1'                   42
     C  N42      ETYP      COMP '30C1'                   42
     C  N42      ETYP      COMP '30C2'                   42
     C  N42      ETYP      COMP '30A1'                   42
     C  N42      ETYP      COMP '30D1'                   42
     C  N42      ETYP      COMP '30D2'                   42
     C  N42      ETYP      COMP '30M1'                   42
     C  N42      ETYP      COMP '30M2'                   42
     C**
     C           ETYP      COMP '61V3'                   36
      *                                                                   CLE005
      ** Check if CLE005 is *ON                                           CLE005
     C           CLE005    IFEQ 'Y'                                       CLE005
     C           *IN36     IFEQ '0'                                       CLE005
     C           ETYP      ANDEQ'68V3'                                    CLE005
     C                     SETON                     36                   CLE005
     C                     ENDIF                                          CLE005
     C                     ENDIF                                          CLE005
      *                                                                   CLE005
     C  N36      RCSI      COMP 'Y'                      35
     C  N36 35             GOTO Z2
     C  N36      ETYP      COMP '66R1'                   36
     C  N36      ETYP      COMP '66M1'                   36
     C  N36      ETYP      COMP '67M1'                   36
      *                                                                   CLE005
      ** Check if CLE005 is *ON                                           CLE005
     C           CLE005    IFEQ 'Y'                                       CLE005
     C           *IN36     ANDEQ'0'                                       CLE005
      *                                                                   CLE005
     C           ETYP      IFEQ '69R1'                                    CLE005
     C           ETYP      OREQ '69M1'                                    CLE005
     C           ETYP      OREQ '72R1'                                    CLE005
     C           ETYP      OREQ '72M1'                                    CLE005
     C                     SETON                     36                   CLE005
     C                     ENDIF                                          CLE005
      *                                                                   CLE005
     C                     ENDIF                                          CLE005
     C**
     C   36                SETON                         42
     C   36                Z-SUBLCEQ      LCEQ
     C           Z2        TAG                             *** Z2  TAG ***
0475 C**   - IF SO - CALCULATE EXPOSURE
0476 C**N42                GOTO END                                       S01157
0476 C  N42N44             GOTO FRAIRS                             S01157 E12072
0477 C                     Z-ADDEDAT      DLMATD
0478 C           LCEQ      DIV  FCT,DEP   DLAMTL    H
0479 C                     EXSR DLEXPL
     C                     GOTO END                                       S01157
     C*                                                                   S01157
     C**   CHECK FOR FRA/IRS EVENT TYPES                                  S01157
     C*                                                                   S01157
     C           FRAIRS    TAG                             ***  FRAIRS ***S01157
     C* FRA EVENT                                                         S01157
     C           ETYP      IFEQ '21E1'                                    S01157
     C           LCEQ      DIV  FCT,DEP   DLAMTL                          S01157
     C           DLAMTL    ADD  RXPOS     RXPOS                           S01157
     C                     END                                            S01157
     C* IRS EVENT                                                         S01157
     C           ETYP      IFEQ '22E1'                                    S01157
     C           ETYP      OREQ '23E1'                                    S01157
     C           ETYP      OREQ '24E1'                                    S01157
     C           LCEQ      DIV  FCT,DEP   DLAMTL                          S01157
     C           DLAMTL    ADD  IXPOS     IXPOS                           S01157
     C                     END                                            S01157
0480 C**
0481 C           TRAILR    TAG                             **  TRAILR  **
0482 C  N02                GOTO END
0483 C           RREAD     ADD  2         RREAD
0484 C**
0485 C**   COMPARE RUN CONTROLS,
0486 C           RREAD     COMP NORE                 4343
0487 C  N43      TOTI      COMP HRWN                 4343
0488 C  N43      TOTD      COMP HRDC                 4343
0489 C   43                SETON                     U8
0490 C**
0491 C**
0492 C           END       TAG                             **  END  **
0493 C**
0494 C*    BYPASS IF NO EVENTS FILE DETAIL RECORDS READ
0495 CL0 LRN31
0496 CANNU7                GOTO ENDL1
0497 CL1 U7 U8             GOTO ENDL1
0498 C**
0499 C**   ON CHANGE OF COUNTRY, WORK OUT EXCESS EXPOSURE
0500 C**   - FIRST FOR FX
0501 CL1                   EXSR DLXCSF
0502 C**   - THEN FOR LOANS
0503 CL1                   EXSR DLXCSL
     C**   - THEN FOR FRA                                                 S01157
     C*                                                                   S01157
     C** Convert exposure amount to thousands first                       S01157
     C*                                                                   S01157
     CL1         RXPOS     DIV  1000      RXPOS     H                     S01157
     CL1         RXPOS     SUB  XRLM      XRXS                            S01157
     C***L1******XRXS      IFLT 0                                  S01157 102159
     CL1         XRXS      IFLE 0                                         102159
     CL1                   Z-ADD0         XRXS                            S01157
     CL1                   ELSE                                           S01157
     CL1                   SETON                         70               S01157
     CL1                   END                                            S01157
     C**   - THEN FOR IRS                                                 S01157
     C*                                                                   S01157
     C** Convert exposure amount to thousands first                       S01157
     C*                                                                   S01157
     CL1         IXPOS     DIV  1000      IXPOS     H                     S01157
     CL1         IXPOS     SUB  XILM      XIXS                            S01157
     C***L1******XIXS      IFLT 0                                  S01157 102159
     CL1         XIXS      IFLE 0                                         102159
     CL1                   Z-ADD0         XIXS                            S01157
     CL1                   ELSE                                           S01157
     CL1                   SETON                         70               S01157
     CL1                   END                                            S01157
     C*                                                                   S1105
     C*   IF EXCEPTION ONLY AND REGION NOT                                S1105
     C*                      OVER LIMIT    DO NOT PRINT                   S1105
     CL1 U1N70             GOTO ENDL1                                     S1105
     CL1                   SETOF                         70               S1105
0504 C**
     C*                                                                   S01157
     C**     PRINTING SPLIT INTO FOUR SEPERATE ROUTINES. FX, LENDING,     S01157
     C**     FRA AND IRS.                                                 S01157
     C*                                                                   S01157
0505 C*****-*THEN*PRINT*DETAILS                                           S01157
0505 C**   - THEN PRINT FX DETAILS                                        S01157
0506 CL1                   Z-ADD0         D
     CL1                   SETOF                     54                   S01157
0507 C*1**       DLOOP7    TAG                             **  DLOOP7  ** S01157
0507 CL1         FXLOP1    TAG                             **  FXLOP1  ** S01157
0508 CL1         D         ADD  1         D
0509 CL1         D         COMP 1                    51  50
0510 C**
0511 C*****-*TEST*IF*PERIOD*END*DATE*ZERO                                 S01157
0511 C**   - TEST IF FX PERIOD END DATE ZERO                              S01157
0512 CL1         XFDT,D    COMP 0                    5353  PRINT
0513 C*1**       XLDT,D    COMP 0                    5454  PRINT          S01157
0514 C**
0515 C**   - MOVE EXPOSURE AMT. TO 10 DIGIT FIELD
0516 CL1                   Z-ADDXFXP,D    FXPOS  100
0517 C*1**                 Z-ADDXLXP,D    LXPOS  100                      S01157
0518 C**
0519 C**   - PRINT LINE
0520 CL1                   EXCPT
0521 C**
0522 C**   - CALCULATE NEXT START OF PERIOD
0523 CL1         XFDA,D    ADD  1         NEXTF   30
0524 C*1**       XLDA,D    ADD  1         NEXTL   30                      S01157
0525 C**
0526 C**   - IF LESS THAN SIX PERIODS PRINTED, DO AGAIN.
0527 CL1         D         COMP 6                      89
0528 C*1*89                GOTO DLOOP7                                    S01157
0528 CL1 89                GOTO FXLOP1                                    S01157
     C*                                                                   S01157
     C**   - THEN PRINT LENDING DETAILS                                   S01157
     C*                                                                   S01157
     CL1                   Z-ADD0         D                               S01157
     CL1                   SETOF                     53                   S01157
     CL1         LNLOP1    TAG                             **  LNLOP1  ** S01157
     CL1         D         ADD  1         D                               S01157
     CL1         D         COMP 1                    51  50               S01157
     C**                                                                  S01157
     C**   - TEST IF LENDING PERIOD END DATE ZERO                         S01157
     CL1         XLDT,D    COMP 0                    5454  PRINT          S01157
     C**                                                                  S01157
     C**   - MOVE EXPOSURE AMT. TO 10 DIGIT FIELD                         S01157
     CL1                   Z-ADDXLXP,D    LXPOS  100                      S01157
     C**                                                                  S01157
     C**   - PRINT LINE                                                   S01157
     CL1                   EXCPT                                          S01157
     C**                                                                  S01157
     C**   - CALCULATE NEXT START OF PERIOD                               S01157
     CL1         XLDA,D    ADD  1         NEXTL   30                      S01157
     C**                                                                  S01157
     C**   - IF LESS THAN SIX PERIODS PRINTED, DO AGAIN.                  S01157
     CL1         D         COMP 6                      89                 S01157
     CL1 89                GOTO LNLOP1                                    S01157
     C**                                                                  S01157
     C**   - THEN PRINT FRA DETAILS                                       S01157
     CL1                   SETOF                     54                   S01157
     CL1                   SETON                     5550                 S01157
     CL1                   EXCPT                                          S01157
     C**                                                                  S01157
     C**   - THEN PRINT IRS DETAILS                                       S01157
     CL1                   SETOF                     55                   S01157
     CL1                   SETON                     5650                 S01157
     CL1                   EXCPT                                          S01157
0529 C**
0530 C**   - COUNT RECORDS LISTED IN THIS REPORT
0531 CL1         ENDL1     TAG
0532 C**   CHECK IF NO DETAILS REPORTED
0533 CLR         RLIST     COMP 0                        46
0534 C*RN46******          SETON                     OF                   E10421
0534 C*R*****              SETON                     OF             E10421S01117
0534 CLRN46                SETON                     OF                   S01117
     CLR                   FREE 'DL0133'                                  S01117
     C**                                                                  S01117
     C**                                                                  S01117
     C** CALL ZSFILE FOR P1 FILE - ONCE - ONLY IF DETAILS TO REPORT       S01117
     CLR         *IN46     IFEQ '0'                                       S01117
     CLR                   Z-ADDSFNUM1    ZSNUM   60                      S01117
     CLR                   CALL 'ZSFILE'                                  S01117
     CLR                   PARM           SEQ     5                       S01117
     CLR                   PARM *BLANKS   @PARM   3                       S01117
     CLR                   PARM           SFILE1                          S01117
     CLR                   PARM           ZSNUM                           S01117
     CLR                   PARM           ZSERR   1                       S01117
     C*                                                                   S01117
     CLR         ZSERR     IFEQ 'Y'                                       S01117
     C** Error during ZSFILE processing, return to calling program        S01117
     CLR                   SETON                     U7U8LR               S01117
     CLR                   RETRN                                          S01117
     CLR                   END                                            S01117
     CLR                   END                                            S01117
     C**                                                                  S01117
     C**                                                                  S01117
     C** CALL ZSFILE FOR AU FILE - ONCE ONLY                              S01117
     CLR                   Z-ADDSFNUMU    ZSNUM   60                      S01117
     CLR                   CALL 'ZSFILE'                                  S01117
     CLR                   PARM           SEQ     5                       S01117
     CLR                   PARM *BLANKS   @PARM   3                       S01117
     CLR                   PARM           SFILEU                          S01117
     CLR                   PARM           ZSNUM                           S01117
     CLR                   PARM           ZSERR   1                       S01117
     C*                                                                   S01117
     CLR         ZSERR     IFEQ 'Y'                                       S01117
     C** Error during ZSFILE processing, return to calling program        S01117
     CLR                   SETON                     U7U8LR               S01117
     CLR                   RETRN                                          S01117
     CLR                   END                                            S01117
     C**                                                                  S01117
0535 C********************************************************************
0536 C*    DLLMT SR. SETS UP ARRAYS OF LIMIT PERIODS & AMOUNTS,
0537 C*    FOR FX LIMITS AND LENDING LIMITS.
0538 C           DLLMT     BEGSR                           **  DLLMT  **
0539 C**
0540 C**   FIRST RESET ARRAYS TO ZEROES
0541 C                     Z-ADD0         XFDA
0542 C                     Z-ADD0         XFDT
0543 C                     Z-ADD0         XFLM
0544 C                     Z-ADD0         XFXP
0545 C                     Z-ADD0         XFXS
0546 C                     Z-ADD0         XFPC
0547 C                     Z-ADD0         XLDA
0548 C                     Z-ADD0         XLDT
0549 C                     Z-ADD0         XLLM
0550 C                     Z-ADD0         XLXP
0551 C                     Z-ADD0         XLXS
0552 C                     Z-ADD0         XLPC
     C                     MOVE *BLANKS   FDESC   7                       S01117
     C                     MOVE *BLANKS   LDESC   7                       S01117
     C                     MOVE *BLANKS   FDEF    1                       S01117
     C                     MOVE *BLANKS   LDEF    1                       S01117
     C*                                                                   S01157
     C**   SETUP FRA/IRS FIELDS.                                          S01157
     C*                                                                   S01157
     C                     Z-ADD0         XRLM   100                      S01157
     C                     Z-ADD0         RXPOS  100                      S01157
     C                     Z-ADD0         XRXS   100                      S01157
     C                     Z-ADD0         XILM   100                      S01157
     C                     Z-ADD0         IXPOS  100                      S01157
     C                     Z-ADD0         XIXS   100                      S01157
     C                     SETOF                     5556                 S01157
0553 C*
0554 C                     SETOF                     7172
0555 C**
0556 C**
0557 C**
0558 C**   PROCESS FX LIMITS FIRST
0559 C**   - CHECK IF LIMIT HAS EXPIRED.
0560 C*****      FLED      COMP RUND                 89                   S01194
0560 C           FLED      COMP BJRDNB               89                   S01194
0560 C           FLED      IFNE *ZERO                                     048332
     C  N89                MOVEL'EXPIRED' FDESC            ** IF EXPIRED*.S01117
0561 C  N89                GOTO BYPAS1                     ** IF EXPIRED*.
0560 C                     END                                            048332
0557 C**
     C***-*NOT*EXPIRED*-*CHAIN*TO*LIMITS*REC.*ON*S/TABLE,*TI**            S01194
     C*****                MOVE FLTY      DLKY,1                          S01194
     C*****                EXSR DLCHN                                     S01194
     C**N90*               GOTO XFDTAG                                    S01194
0951 C*                                                                   S01194
     C** - NOT EXPIRED - ACCESS LIMITS FILE                               S01194
     C                     MOVELFLTY      @CRNB                           S01194
     C                     CALL 'AOLIMTR0'                                S01194
     C**********           PARM '*MSG   ' @RTCD   7                                    S01194 CCB016
     C                     PARM *BLANKS   @RTCD   7                                           CCB016
     C                     PARM '*KEY   ' @OPTN   7                       S01194
     C                     PARM           @CRNB   3                       S01194
     C           SDLIMT    PARM SDLIMT    DSFDY                           S01194
     C           @RTCD     IFEQ *BLANK                                    S01194
     C** IF LIMITS EXIST CONVERT EXPIRY DATE TO DDMMMYY FORMAT            S01117
     C                     MOVELFLED      ZDAYNO                          S01117
     C                     EXSR ZDATE2                                    S01117
     C                     MOVE ZADATE    FDESC                           S01117
     C                     GOTO XFDTAG                                    S01194
     C** ELSE, IF NO LIMITS ACCESS DEFAULTS                               S01117
     C                     ELSE                                           S01117
     C                     MOVE 'Y'       FDEF                            S01117
     C                     MOVE *BLANKS   LDEF                            S01117
     C                     EXSR DL0133                                    S01117
     C** IF NO DEFAULTS THEN THERE ARE NO LIMITS                          S01117
     C           FXLIM     IFEQ 0                                         S01117
     C                     MOVEL'NO LIM.' FDESC                           S01117
     C                     ELSE                                           S01194
     C                     MOVEL'DEFAULT' FDESC                           S01117
     C** IF ALL LOWER LEVEL LIMITS HAD SAME TYPE, USE THIS FOR 1ST PRD    S01117
     C           FXSAME    IFEQ 'Y'                                       S01117
     C                     MOVEAFXPER     XFDAA                           S01117
     C                     Z-ADDFXLIM     FLAM                            S01117
     C                     MOVE FXPC      XFPCIN                          S01117
     C           FLAM      DIV  XFPC,1    FLAM      H                     S01117
     C                     GOTO LMTSF                                     S01194
     C                     ELSE                                           S01117
     C**  ELSE SET UP SPOT PERIOD                                         S01117
     C                     Z-ADDSP        XFDA,1                          S01117
     C           SP        ADD  BJRDNB    XFDT,1                          S01117
     C                     Z-ADD999       XFDA,2                          S01117
     C                     Z-ADD99999     XFDT,2                          S01117
     C                     Z-ADDFXLIM     XFLM,1                          S01117
     C                     GOTO LNPROC                                    S01194
     C                     END                                            S01117
     C                     END                                            S01117
     C                     END                                            S01194
0562 C**
     C*******IF*NO*LIMIT*DETAILS*ON*TABLE*FILE,*OR****                    S01194
     C**     IF NO LIMIT DETAILS ON FILE, OR                              S01194
0563 C**   - IF EXPIRED, SET FIRST PERIOD END DAYS & DATE TO NINES
0564 C**     & ZEROIZE AMOUNT
0569 C           BYPAS1    TAG                             **  BYPAS1  **
0565 C                     Z-ADD999       XFDA,1
0566 C                     Z-ADD99999     XFDT,1
0567 C                     Z-ADD0         XFLM,1
0568 C                     GOTO LNPROC
0575 C**
0576 C**   - MOVE DATA FROM INPUT FIELDS TO FX ARRAYS
     C           XFDTAG    TAG                             **  XFDTAG   **
0578 C** MOVE END OF LIMIT PERIODS INTO LEPSIN (DS)                       S01194
0578 C                     MOVELA2E1LP    XLEP1                           S01194
0578 C                     MOVELA2E2LP    XLEP2                           S01194
0578 C                     MOVELA2E3LP    XLEP3                           S01194
0578 C                     MOVELA2E4LP    XLEP4                           S01194
0578 C                     MOVELA2E5LP    XLEP5                           S01194
0578 C                     MOVELA2E6LP    XLEP6                           S01194
0577 C                     MOVE LEPSIN    XFDAIN
0578 C** MOVE %/LIMIT FOR PERIODS INTO UP LPCSIN (DS)                     S01194
0578 C                     MOVELA2PL1P    XLPC1                           S01194
0578 C                     MOVELA2PL2P    XLPC2                           S01194
0578 C                     MOVELA2PL3P    XLPC3                           S01194
0578 C                     MOVELA2PL4P    XLPC4                           S01194
0578 C                     MOVELA2PL5P    XLPC5                           S01194
0578 C                     MOVELA2PL6P    XLPC6                           S01194
0578 C                     MOVE LPCSIN    XFPCIN
0579 C**
0580 C**   DLLOOP1 PROCESSES XFDAA - IF ANY ELEMENT IS BLANK OR 999
0581 C**   THE CORRESPONDING ELEMENTS IN XFDA & XFDT ARE SET TO NINES.
0582 C*****ELSE,XFDT*IS*CALCULATED*BY*ADDING*RUND*TO*XFDA,***********     S01194
0582 C**   ELSE,XFDT IS CALCULATED BY ADDING RUN DATE TO XFDA,            S01194
0583 C**        XFLM,IS CALCULATED BY MULTIPLYING LIMIT AMOUNT BY XFPC
0584 C**
     C           LMTSF     TAG                                            S01117
0585 C                     Z-ADD0         D       20
0586 C           DLOOP1    TAG                             ** DLOOP1  **
0587 C**
0588 C           D         ADD  1         D
0589 C********** XFDAA,D   COMP '   '                    88               BHF416
     C           XFDAA,D   COMP '000'                    88               BHF416
0590 C           XFDAA,D   COMP '999'                    87
0591 C**
0592 C   88                Z-ADD999       XFDA,D
0593 C*
0594 C  N71      XFDAA,1   COMP 'SP '                    71
0595 C   71                Z-ADDSP        XFDA,1
0596 C**
0597 C******     XFDA,D    ADD  RUND      XFDT,D                          S01194
0597 C           XFDA,D    ADD  BJRDNB    XFDT,D                          S01194
0598 C   88
0599 COR 87                Z-ADD99999     XFDT,D
0600 C**
0601 C  N88      FLAM      MULT XFPC,D    XFLM,D
0602 C**
0603 C           D         COMP 6                      86
0604 C   86N87N88          GOTO DLOOP1
0605 C**
0606 C           LNPROC    TAG                             **  LNPROC  **
0607 C**
0608 C**   PROCESS LENDING LIMITS.
0609 C**   -  CHECK IF LIMIT HAS EXPIRED
0610 C******     LLED      COMP RUND                 89                   S01194
0610 C           LLED      COMP BJRDNB               89                   S01194
0560 C           LLED      IFNE *ZERO                                     048332
     C  N89                MOVEL'EXPIRED' LDESC            ** IF EXPIRED*.S01117
0611 C  N89                GOTO BYPAS2                     * IF EXPIRED. *
0560 C                     END                                            048332
0621 C**
     C***-*NOT*EXPIRED*-*CHAIN*TO*LIMITS*REC.*ON*S/TABLE,*TI**            S01194
     C******************** MOVE FLTY      DLKY,1 *********          E13283S01194
     C*****                MOVE LLTY      DLKY,1                    E13283S01194
     C*****                EXSR DLCHN                                     S01194
     C**N90**              GOTO XLDTAG                                    S01194
0951 C*                                                             N     S01194
     C** - NOT EXPIRED - ACCESS LIMITS FILE                               S01194
     C                     MOVELLLTY      @CRNB                           S01194
     C                     CALL 'AOLIMTR0'                                S01194
     C**********           PARM '*MSG   ' @RTCD   7                                    S01194 CCB016
     C                     PARM *BLANKS   @RTCD   7                                           CCB016
     C                     PARM '*KEY   ' @OPTN   7                       S01194
     C                     PARM           @CRNB   3                       S01194
     C           SDLIMT    PARM SDLIMT    DSFDY                           S01194
     C           @RTCD     IFEQ *BLANK                                    S01194
     C** IF LIMITS EXIST CONVERT EXPIRY DATE TO DDMMMYY FORMAT            S01117
     C                     MOVELLLED      ZDAYNO                          S01117
     C                     EXSR ZDATE2                                    S01117
     C                     MOVE ZADATE    LDESC                           S01117
     C                     GOTO XLDTAG                                    S01117
     C** ELSE, IF NO LIMITS ACCESS DEFAULTS                               S01117
     C                     ELSE                                           S01117
     C                     MOVE 'Y'       LDEF                            S01117
     C                     MOVE *BLANKS   FDEF                            S01117
     C                     EXSR DL0133                                    S01117
     C** IF NO DEFAULTS THEN THERE ARE NO LIMITS                          S01117
     C           LNLIM     IFEQ 0                                         S01117
     C                     MOVEL'NO LIM.' LDESC                           S01117
     C                     ELSE                                           S01194
     C                     MOVEL'DEFAULT' LDESC                           S01117
     C** IF ALL LOWER LEVEL LIMITS HAD SAME TYPE, USE THIS FOR 1ST PRD    S01117
     C           LNSAME    IFEQ 'Y'                                       S01117
     C                     MOVEALNPER     XLDAA                           S01117
     C                     Z-ADDLNLIM     LLAM                            S01117
     C                     MOVELLNPC      XLPCIN                          S01117
     C           LLAM      DIV  XLPC,1    LLAM      H                     S01117
     C                     GOTO LMTSL                                     S01194
     C                     ELSE                                           S01117
     C**  ELSE SET UP SPOT PERIOD                                         S01117
     C                     Z-ADDSP        XLDA,1                          S01117
     C           SP        ADD  BJRDNB    XLDT,1                          S01117
     C                     Z-ADD999       XLDA,2                          S01117
     C                     Z-ADD99999     XLDT,2                          S01117
     C                     Z-ADDLNLIM     XLLM,1                          S01117
     C                     GOTO FRPROC                                    S01194
     C                     END                                            S01117
     C                     END                                            S01117
     C                     END                                            S01194
0562 C**
     C*******IF*NO*LIMIT*DETAILS*ON*TABLE*FILE**OR****                    S01194
     C**     IF NO LIMIT DETAILS ON FILE, OR                              S01194
0614 C**   - IF EXPIRED, SET FIRST PERIOD END DAYS & DATE TO NINES
0615 C**     & ZEROISE AMOUNT
0620 C           BYPAS2    TAG                             **  BYPAS2  **
0616 C                     Z-ADD999       XLDA,1
0617 C                     Z-ADD99999     XLDT,1
0618 C                     Z-ADD0         XLLM,1                          S01157
0619 C****                 GOTO DLLEND                                    S01157
     C                     GOTO FRPROC                                    S01157
0626 C**
0627 C**   MOVE DATA FROM INPUT FIELDS TO LENDING ARRAYS
     C           XLDTAG    TAG                             **   XLDTAG  **
0578 C** MOVE END OF LIMIT PERIODS INTO LEPSIN (DS)                       S01194
0578 C                     MOVELA2E1LP    XLEP1                           S01194
0578 C                     MOVELA2E2LP    XLEP2                           S01194
0578 C                     MOVELA2E3LP    XLEP3                           S01194
0578 C                     MOVELA2E4LP    XLEP4                           S01194
0578 C                     MOVELA2E5LP    XLEP5                           S01194
0578 C                     MOVELA2E6LP    XLEP6                           S01194
0628 C                     MOVE LEPSIN    XLDAIN
0578 C** MOVE %/LIMIT FOR PERIODS INTO UP LPCSIN (DS)                     S01194
0578 C                     MOVELA2PL1P    XLPC1                           S01194
0578 C                     MOVELA2PL2P    XLPC2                           S01194
0578 C                     MOVELA2PL3P    XLPC3                           S01194
0578 C                     MOVELA2PL4P    XLPC4                           S01194
0578 C                     MOVELA2PL5P    XLPC5                           S01194
0578 C                     MOVELA2PL6P    XLPC6                           S01194
0629 C                     MOVE LPCSIN    XLPCIN
0630 C**
     C           LMTSL     TAG                                            S01117
0631 C                     Z-ADD0         D
0632 C**   DLOOP 2 PROCESSES XLDAA IN THE SAME WAY AS DLOOP1
0633 C           DLOOP2    TAG                             **  DLOOP2  **
0634 C**
0635 C           D         ADD  1         D
0636 C********** XLDAA,D   COMP '   '                    88               BHF416
     C           XLDAA,D   COMP '000'                    88               BHF416
0637 C           XLDAA,D   COMP '999'                    87
0638 C**
0639 C   88                Z-ADD999       XLDA,D
0640 C*
0641 C  N72      XLDAA,1   COMP 'SP '                    72
0642 C   72                Z-ADDSP        XLDA,1
0643 C**
0644 C*****      XLDA,D    ADD  RUND      XLDT,D                          S01194
0644 C           XLDA,D    ADD  BJRDNB    XLDT,D                          S01194
0645 C   88
0646 COR 87                Z-ADD99999     XLDT,D
0647 C**
0648 C  N88      LLAM      MULT XLPC,D    XLLM,D
0649 C**
0650 C           D         COMP 6                      86
0651 C   86N87N88          GOTO DLOOP2
     C*                                                                   S01157
     C**   SETUP FRA/IRS DETAILS. FRA FIRST                               S01157
     C*                                                                   S01157
     C           FRPROC    TAG                             **  FRPROC  ** S01157
     C*****      FRAX      IFLT RUND                                S01157S01194
     C*****      FRAX      ANDNE0                                   S01157S01194
     C           DYFRED    IFLT BJRDNB                                    S01194
     C           DYFRED    ANDNE0                                         S01194
     C                     Z-ADD0         XRLM                            S01157
     C                     ELSE                                           S01157
     C*****                Z-ADDFRAA      XRLM                      S01157S01194
     C                     Z-ADDDYFRLA    XRLM                      S01157S01194
     C                     END                                            S01157
     C*  IRS                                                              S01157
     C*****      IRSX      IFLT RUND                                S01157S01194
     C*****      IRSX      ANDNE0                                   S01157S01194
     C           DYIRED    IFLT BJRDNB                                    S01194
     C           DYIRED    ANDNE0                                         S01194
     C                     Z-ADD0         XILM                            S01157
     C                     ELSE                                           S01157
     C*****                Z-ADDIRSA      XILM                      S01157S01194
     C                     Z-ADDDYIRLM    XILM                            S01194
     C                     END                                            S01157
0652 C**
0653 C**
0654 C           DLLEND    ENDSR                           **  DLLEND  **
0655 C**
0656 C********************************************************************S01194
0657 C*****DLCHN SR. CHAINS TO TABLE FILE FOR LIMIT TYPE RECORD.          S01194
0658 C*****      DLCHN     BEGSR                           **  DLCHN  **  S01194
0659 C*****      DLKY,1    CHAINTABLE                90                   S01194
0661 C*****                ENDSR                                          S01194
0662 C********************************************************************
0663 C**   DLEXPF SR. CALCULATES EXPOSURE FOR A FX DEAL.
0664 C**
0665 C           DLEXPF    BEGSR                           **  DLEXPF  **
0666 C**
0667 C**   DEFINE INPUT FIELDS
0668 C                     Z-ADDDLVALU    DLVALU  50       VALUE DATE
0669 C                     Z-ADDDLAMTF    DLAMTF 130       LIMIT CCY EQUIV
0670 C**                                                       AMOUNT
0671 C*****IF*VALUE*DATE*IS*LESS*OR*EQUAL*TO*RUND*-*FIRST*PERIOD*ONLY*    S01194
0672 C*****      DLVALU    COMP RUND                   8989               S01194
0671 C**   IF VALUE DATE IS LESS OR EQUAL TO RUN DATE - 1ST PERIOD ONLY   S01194
0672 C           DLVALU    COMP BJRDNB                 8989               S01194
0673 C   89      XFXP,1    ADD  DLAMTF    XFXP,1
0674 C   89                GOTO DLFEND
0675 C**
0676 C**   VALUE DATE IS GREATER THAN TODAY - AMOUNT IS ADDED INTO EVERY
0677 C**   PERIOD PRECEDING & INCLUDING THE PERIOD WHICH INCLUDES THE
0678 C**   VALUE DATE.
0679 C                     Z-ADD0         D       20
0680 C**
0681 C           DLOOP3    TAG                             **  DLOOP3  **
0682 C           D         ADD  1         D
0683 C**
0684 C**   ADD AMOUNT INTO THIS PERIOD
0685 C           XFXP,D    ADD  DLAMTF    XFXP,D
0686 C**
0687 C**   LOOP AGAIN TO ADD AMOUNT INTO NEXT PERIOD IF
0688 C**   - VALUE DATE EXCEEDS THIS END OF PERIOD DATE.
0689 C**   - LESS THAN SIX PERIODS HAVE BEEN USED.
0690 C           DLVALU    COMP XFDT,D               88
0691 C           D         COMP 6                      87
0692 C   87 88             GOTO DLOOP3
0693 C**
0694 C           DLFEND    ENDSR                           **  DLFEND  **
0695 C**
0696 C********************************************************************
0697 C**   DLEXPL SR. CALCULATES EXPOSURE FOR A LOAN DEAL.
0698 C**
0699 C           DLEXPL    BEGSR                           **  DLEXPL  **
0700 C**
0701 C**   DEFINE INPUT FIELDS
0702 C                     Z-ADDDLMATD    DLMATD  50
0703 C                     Z-ADDDLAMTL    DLAMTL 130
0704 C**
0705 C*****IF*MATURITY*DATE*IS*LESS*THAN*RUND,*ADD*RUND*TO*IT.******      S01194
0706 C******     DLMATD    COMP RUND                   89                 S01194
0707 C***89*     DLMATD    ADD  RUND      DLMATD                          S01194
0705 C**   IF MATURITY DATE IS LESS THAN RUN DATE, ADD RUN DATE TO IT.    S01194
0706 C           DLMATD    COMP BJRDNB                 89                 S01194
0707 C   89      DLMATD    ADD  BJRDNB    DLMATD                          S01194
0708 C**
0709 C**   LOOP TO ADD AMOUNT INTO EVERY PERIOD PRECEDING & INCLUDING
0710 C**   THE PERIOD WHICH INCLUDES THE MATURITY DATE.
0711 C                     Z-ADD0         D       20
0712 C           DLOOP4    TAG                             **  DLOOP4  **
0713 C           D         ADD  1         D
0714 C**
     C**   SUBTRACT EXPOSURE FROM THE PERIOD BEFORE THE VALUE DATE.       E12072
     C   44      XLDT,D    IFLT DLMATD                                    E12072
     C           XLXP,D    SUB  DLAMTL    XLXP,D                          E12072
     C                     END                                            E12072
     C**                                                                  E12072
0715 C**   ADD AMOUNT INTO THIS PERIOD
0716 C*********  XLXP,D    ADD  DLAMTL    XLXP,D   *********              E12072
0716 C  N44      XLXP,D    ADD  DLAMTL    XLXP,D                          E12072
0717 C**
0718 C**   LOOP AGAIN TO ADD AMOUNT INTO NEXT PERIOD IF
0719 C**   - MATURITY DATE EXCEEDS THIS END OF PERIOD DATE.
0720 C**   - LESS THAN SIX PERIODS HAVE BEEN USED
0721 C           DLMATD    COMP XLDT,D               88
0722 C           D         COMP 6                      87
0723 C   87 88             GOTO DLOOP4
0724 C**
0725 C                     ENDSR
0726 C********************************************************************
0727 C**   DLXCSF SR. WORKS OUT EXCESS EXPOSURE FOR FX
0728 C**   -FIRST ROUNDS EXPOSURE FOR EACH PERIOD TO NEAREST 1000 UNITS
0729 C**   -THEN COMPARES EXPOSURE AMOUNTS TO CORRESP. LIMIT AMOUNTS.
0730 C           DLXCSF    BEGSR                           **  DLXCSF  **
0731 C                     Z-ADD0         D       20
0732 C           DLOOP5    TAG                             **  DLOOP5  **
0733 C           D         ADD  1         D
0734 C           XFXP,D    DIV  1000      XFXP,D    H
0735 C           XFXP,D    COMP XFLM,D               89
0736 C   89      XFXP,D    SUB  XFLM,D    XFXS,D
     C   89                SETON                     70                   S1105
0737 C**
0738 C**   LOOP ROUND AGAIN IF LESS THAN 6 PERIODS HAVE BEEN PROCESSED
0739 C           D         COMP 6                      89
0740 C   89                GOTO DLOOP5
0741 C                     ENDSR
0742 C**
0743 C********************************************************************
0744 C**   DLXCSL SR. WORKS OUT EXCESS EXPOSURE FOR LOANS.
0745 C           DLXCSL    BEGSR
0746 C                     Z-ADD0         D       20
0747 C           DLOOP6    TAG                             **  DLOOP6  **
0748 C           D         ADD  1         D
0749 C           XLXP,D    DIV  1000      XLXP,D    H
0750 C           XLXP,D    COMP XLLM,D               89
0751 C   89      XLXP,D    SUB  XLLM,D    XLXS,D
     C   89                SETON                     70                   S1105
0752 C**
0753 C           D         COMP 6                      89
0754 C   89                GOTO DLOOP6
0755 C                     ENDSR
0756 C**
0757 C********************************************************************
0757 C/COPY ZSRSRC,ZFWDT                                               ***S01195
0757 C/COPY ZSRSRC,ZACCH                                               ***S01195
0757 C********************************************************************S01194
0758 C*****                                                               S01194
0759 C*****                                                               S01194
0760 C*****ZDATE3 SR. TO CALCULATE ANY NUMBER OF WORKING                  S01194
0761 C*****           DAYS FORWARD IN ANY CURRENCY.                       S01194
0762 C*****                                                               S01194
0763 C*****    THIS SR. CAN BE USED WHEN THE INPUT CYCLE IS RUNNING AS    S01194
0764 C*****    HOLIDAY RECORDS ARE ACCESSED BY CHAIN. THEREFORE NEWLY     S01194
0765 C*****    ADDED RECORDS IN THE OVERFLOW AREA CAN ALSO BE ACCESSED.   S01194
0766 C*****                                                               S01194
0767 C*****      ZDATE3    BEGSR                           *** ZDATE3 *** S01194
0768 C*****                                                               S01194
0769 C*****CALCULATIONS TO DEFINE INPUT FIELDS.                           S01194
0770 C*****                Z-ADDZDAYNO    ZDAYNO  50       STARTING DATE  S01194
0771 C*****                MOVE ZCCY      ZCCY    3        DATE CURRENCY  S01194
0772 C*****                Z-ADDZNRDYS    ZNRDYS  20       NBR OF WORKING S01194
0773 C*****                                                DAYS FORWARD   S01194
0774 C*****CLEAR COUNT OF NBR OF DAYS ADDED, & DEFINE ZDYNBR.             S01194
0775 C*****                Z-ADD0         ZDCNT   20                      S01194
0776 C*****                Z-ADDZDAYNO    ZDYNBR  50                      S01194
0777 C*****                                                               S01194
0778 C*****LOOP TO INCREMENT DAY NUMBER AND CHECK FOR HOLIDAY.            S01194
0779 C*****      ZDLOP1    TAG                             ** ZDLOP1 TAG *S01194
0780 C*****                                                               S01194
0781 C*****                SETOF                     9596                 S01194
0782 C*****      ZDYNBR    ADD  1         ZDYNBR                          S01194
0783 C*****                                                               S01194
0784 C*****SET KEY FOR FIRST HOLIDAY RECORD.                              S01194
0785 C*****                MOVEL'22    '  ZDHKEY 12                       S01194
0786 C*****                MOVELZDYNBR    ZWRK6   6                       S01194
0787 C*****                MOVE '1'       ZWRK6                           S01194
0788 C*****                MOVE ZWRK6     ZDHKEY                          S01194
0789 C*****                                                               S01194
0790 C*****CHAIN FOR HOLIDAY RECORD, RECORD 1 OR 2                        S01194
0791 C*****      ZDHCHN    TAG                             ** ZDHCHN TAG *S01194
0792 C*****                                                               S01194
0793 C*****      ZDHKEY    CHAINTABLE                90    ON NOT THERE   S01194
0794 C**N90      RECI      COMP 'D'                  9090  DELETED        S01194
0795 C*****                                                               S01194
0796 C*****NO RECORD 1 FOUND, IS NOT A HOLIDAY                            S01194
0797 C***90N95             GOTO ZDOAGN                                    S01194
0798 C*****                                                               S01194
0799 C*****NO RECORD 2 FOUND                                              S01194
0800 C***90 95 96          GOTO ZDLOP1                     EXC. NOT FOUND S01194
0801 C***90 95N96          GOTO ZDOAGN                     INC. NOT FOUND S01194
0802 C*****                                                               S01194
0803 C*****DETERMINE TYPE FOUND, INCLUDE OR EXCLUDE                       S01194
0804 C*****      INEX      COMP 'E'                  92  91               S01194
0805 C*****                                                               S01194
0806 C*****CHECK IF DAY IS HOLIDAY FOR CURRENCY.                          S01194
0807 C*****      ZCCY      LOKUPHCCY                     93               S01194
0808 C***91 93             GOTO ZDOAGN                     EXCLUDE FOUND  S01194
0809 C***92 93             GOTO ZDLOP1                     INCLUDE FOUND  S01194
0810 C*****                                                               S01194
0811 C*****IF EXCLUDE OR INCLUDE NOT FOUND CHECK                          S01194
0812 C*****FOR SECOND HOLIDAY RECORD, IF REQUIRED.                        S01194
0813 C*****      '   '     LOKUPHCCY                     94ON IF NO RCD.2 S01194
0814 C*****                MOVE ZDHKEY    ZWRK1   1                       S01194
0815 C*****      ZWRK1     COMP '1'                      95               S01194
0816 C***91 95             SETON                     96                   S01194
0817 C***95N94             MOVE '2'       ZDHKEY                          S01194
0818 C***95N94             GOTO ZDHCHN                     GET SECOND REC S01194
0819 C*****                                                               S01194
0820 C***91                GOTO ZDLOP1                     EXC. NOT FOUND S01194
0821 C***92                GOTO ZDOAGN                     INC. NOT FOUND S01194
0822 C*****                                                               S01194
0823 C*****INCREMENT COUNT AND CHECK IF REQUIRED NUMBER OF DAYS           S01194
0824 C*****HAVE BEEN ADDED. IF NOT, GO THROUGH LOOP1 AGAIN.               S01194
0825 C*****      ZDOAGN    TAG                             ** ZDOAGN TAG *S01194
0826 C*****                                                               S01194
0827 C*****      ZDCNT     ADD  1         ZDCNT                           S01194
0828 C*****      ZDCNT     COMP ZNRDYS                 97                 S01194
0829 C***97                GOTO ZDLOP1                                    S01194
0830 C*****                                                               S01194
0831 C*****                ENDSR                                          S01194
0832 C*****                                                               S01194
0833 C********************************************************************S01194
0834 C*****                                                               S01194
0835 C*****ZSYSTM SR. TO CHAIN TO THE INSTALLATION CONTROL DATA RECORD.   S01194
0836 C*****                                                               S01194
0837 C*****      ZSYSTM    BEGSR                           *** ZSYSTM *** S01194
0838 C*****                                                               S01194
0839 C*****SET UP KEY FOR INSTALLATION CONTROL RECORD.                    S01194
0840 C*****                MOVEL'01      'ZTABKY 12                       S01194
0841 C*****                MOVE '  10'    ZTABKY                          S01194
0842 C*****                                                               S01194
0843 C*****      ZTABKY    CHAINTABLE                99    ON NOT THERE   S01194
0844 C**N99      RECI      COMP 'D'                  9999  ON, IS DELETED S01194
0845 C*****                                                               S01194
0846 C*****CHECK SYSTEM DATE FORMAT, DDMMYY OR MMDDYY.                    S01194
0847 C*****      DATF      COMP 'M'                      98MMDDYY, 98 ON  S01194
0848 C*****                                                               S01194
0849 C*****                ENDSR                                          S01194
0850 C*****                                                               S01194
0851 C*****                                                               S01194
0852 C********************************************************************
0853 C* SUBROUTINE TO ADD AN AMOUNT (ZZAMT) TO THE TOTAL (ZZTOTI,ZZTOTD)
0854 C*   IND '99' IS SET BY AN OVERFLOW ERROR
0855 C*
0856 CSR         GLZADD    BEGSR                           *** GLZADD ****
0857 C*
0858 CSR                   Z-ADDZZAMT     ZZAMT  153     91-DEFINE ZZAMT
0859 CSR 91                GOTO ZZAEND                     AMT = 0.BYPASS
0860 C*
0861 C* SPLIT ZZAMT INTO INTEGER AND DECIMAL FIELDS
0862 CSR                   Z-ADDZZAMT     ZZAMTI 150       INTEGER FIELD
0863 CSR                   MOVE ZZAMT     ZZAMTD  30       DECIMAL FIELD
0864 C* BOTH ZZAMTI AND ZZAMTD CONTAIN A 'SIGN' ZONE NOW
0865 C*
0866 CSR                   EXSR GLZSUM
0867 CSR         ZZAEND    ENDSR                           ** ZZAEND TAG *
0868 C*
0869 C********************************************************************
0870 C* SUBROUTINE TO CARRY OUT THE ADDITION FOR SUBROUTINES -
0871 C*                        GLZADD, GLZSUB, GLZCMP.
0872 C*          PARAMETERS PASSED -
0873 C*                     I/P ZZAMTI ZZAMTD
0874 C*                     O/P ZZTOTI ZZTOTD ZZNEGD IND 96 IND 99.
0875 C*
0876 CSR         GLZSUM    BEGSR                           *** GLZSUM ****
0877 C*
0878 CSR                   Z-ADDZZTOTI    ZZTOTI 150       DEFINE ZZTOTI
0879 CSR                   Z-ADDZZTOTD    ZZTOTD  30       DEFINE ZZTOTD
0880 CSR                   SETOF                     919293
0881 CSR                   SETOF                     949599
0882 C*
0883 C*    DETERMINE SIGN OF ZZAMTI & D,   92 IF NEG
0884 CSR         ZZAMTI    COMP 0                      9293
0885 CSR 93      ZZAMTD    COMP 0                      9293
0886 CSR 93                GOTO ZZSEND                     ZERO BYPASS
0887 C*
0888 C*    DETERMINE SIGN OF ZZTOTI & D, 91 IF NEG.
0889 CSR         ZZTOTI    COMP 0                      9193
0890 CSR 93      ZZTOTD    COMP 0                      9193
0891 C*
0892 C*    IF ZZTOTAL IS ZERO, RETURN ZZAMOUNT.
0893 CSR 93                Z-ADDZZAMTI    ZZTOTI
0894 CSR 93                Z-ADDZZAMTD    ZZTOTD
0895 CSR 93                GOTO ZZSEND                     ZERO BYPASS
0896 C*    IF SIGNS DIFFER BYPASS OVERFLOW CHECKS.
0897 CSR 91N92
0898 CORN91 92             GOTO ZZOFPS
0899 C*
0900 CSR         ZZAMTD    ADD  ZZTOTD    ZZWK2   40
0901 CSR         ZZWK2     COMP 999                  93    '93' = CARRY
0902 CSRN93      ZZWK2     COMP -999                   93    INTO INTEGER.
0903 C*
0904 CSR 93N92   ZZAMTI    ADD  1         ZZWK3  150       ADD 'CARRY' +VE
0905 CSR    93 92ZZAMTI    SUB  1         ZZWK3            SUB 'CARRY' -VE
0906 CSR 93      ZZTOTI    ADD  ZZWK3     ZZWK3
0907 CSRN93      ZZTOTI    ADD  ZZAMTI    ZZWK3
0908 C*
0909 C* IF THE MODULUS OF ZZWK3 IS LT MOD. ZZTOTI THEN O/F HAS OCCURED
0910 CSRN92      ZZWK3     COMP ZZTOTI                 99  -92 MEANS NOS.
0911 CSR 92      ZZWK3     COMP ZZTOTI               99     NEGATIVE
0912 CSRN99                Z-ADDZZWK2     ZZTOTD
0913 CSRN99                Z-ADDZZWK3     ZZTOTI
0914 C*
0915 C* IF O/F ZEROIZE ZZAMT , IND '99' SET AND ZZTOT FIELDS LEFT INTACT.
0916 CSR 99                Z-ADD0         ZZAMT  153
0917 CSR                   GOTO ZZSEND
0918 C*
0919 C* THE 'SIGNS' ARE DIFFERENT
0920 CSR         ZZOFPS    TAG                             ** ZZOFPS TAG**
0921 C* IF ZZAMT WAS NEGATIVE, MAKE IT POS. TO COMP WITH ZZTOT
0922 C*
0923 CSR 92                Z-SUBZZAMTI    ZZAMTI 150
0924 CSR 92                Z-SUBZZAMTD    ZZAMTD  30
0925 C*
0926 C* IF ZZTOT WAS NEGATIVE, MAKE IT POS. TO COMP WITH ZZAMT.
0927 C*
0928 CSR 91                Z-SUBZZTOTI    ZZTOTI
0929 CSR 91                Z-SUBZZTOTD    ZZTOTD
0930 C* BOTH ZZAMT AND ZZTOT ARE NOW POSITIVE.
0931 C*
0932 CSR         ZZTOTI    COMP ZZAMTI               93  95
0933 CSR 95      ZZTOTD    COMP ZZAMTD               93  95
0934 C*
0935 C* IF ZZTOT EQ. ZZAMT RETURN ZERO.
0936 CSR 95                Z-ADD0         ZZTOTI
0937 CSR 95                Z-ADD0         ZZTOTD
0938 CSR 95                GOTO ZZSEND
0939 C*
0940 C* IF ZZTOT GT. ZZAMT.
0941 CSR 93      ZZAMTD    COMP ZZTOTD               94
0942 CSR 93 94   ZZTOTI    SUB  1         ZZTOTI
0943 CSR 93 94   ZZTOTD    ADD  1000      ZZWK2
0944 CSR 93      ZZTOTI    SUB  ZZAMTI    ZZTOTI
0945 CSR 93 94   ZZWK2     SUB  ZZAMTD    ZZTOTD
0946 CSR 93N94   ZZTOTD    SUB  ZZAMTD    ZZTOTD
0947 C*
0948 C*
0949 C* IF ZZAMT GT. ZZTOT.
0950 CSRN93      ZZTOTD    COMP ZZAMTD               94
0951 CSRN93 94   ZZAMTI    SUB  1         ZZWK3  150
0952 CSRN93 94   ZZAMTD    ADD  1000      ZZWK2
0953 CSRN93 94   ZZWK3     SUB  ZZTOTI    ZZTOTI
0954 CSRN93N94   ZZAMTI    SUB  ZZTOTI    ZZTOTI
0955 CSRN93 94   ZZWK2     SUB  ZZTOTD    ZZTOTD
0956 CSRN93N94   ZZAMTD    SUB  ZZTOTD    ZZTOTD
0957 C*
0958 C* REVERSE SIGN OF ZZTOT IF LARGER I/P FIELDS WERE NEGATIVE
0959 CSR                   SETOF                     94
0960 CSR 93 91
0961 CORN93 92             SETON                     94
0962 CSR 94                Z-SUBZZTOTI    ZZTOTI
0963 CSR 94                Z-SUBZZTOTD    ZZTOTD
0964 C**
0965 C**   RESTORE SIGN OF ZZAMTI & ZZAMTD IF IT WAS REVERSED.
0966 CSR 92                Z-SUBZZAMTI    ZZAMTI
0967 CSR 92                Z-SUBZZAMTD    ZZAMTD
0968 CSR         ZZSEND    TAG                             ** ZZSEND TAG *
0969 C**
0970 C**   IF ZZTOTD IS ZERO, AND ZZTOTI IS NEG. SET UP ZZNEGD.
0971 CSR                   SETOF                     96
0972 CSR         ZZTOTD    COMP 0                        91
0973 CSR 91      ZZTOTI    COMP 0                      96
0974 CSR 96                MOVE '.000-'   ZZNEGD  5
0975 CSR                   ENDSR                             ** ENDSR **
0976 C********************************************************************
     C/EJECT                                                              S01117
0699 C********************************************************************S01117
     C**                                                                  S01117
     C**   P/DL0133 TO GET DEFAULT LIMITS FOR SYSTEM OR COMPANY LEVEL     S01117
     C**                                                                  S01117
     C           DL0133    BEGSR                                          S01117
     C                     Z-ADD0         FXLIM   90                      S01117
     C                     Z-ADD0         LNLIM   90                      S01117
     C                     MOVE 'Y'       FXSAME  1                       S01117
     C                     MOVE 'Y'       LNSAME  1                       S01117
     C                     MOVE *BLANKS   FXPER  18                       S01117
     C                     MOVE *BLANKS   LNPER  18                       S01117
     C                     MOVE *BLANKS   FXPC   18                       S01117
     C                     MOVE *BLANKS   LNPC   18                       S01117
     C                     MOVE 'S'       @RLEV   1                       S01117
     C                     MOVE *BLANKS   ENTY    3                       S01117
     C                     CALL 'DL0133'                                  S01117
     C                     PARM           REGC                            S01117
     C                     PARM           @RLEV                           S01117
     C                     PARM           ENTY                            S01117
     C                     PARM           FDEF                            S01117
     C                     PARM           LDEF                            S01117
     C                     PARM           FRA     1                       S01117
     C                     PARM           IRS     1                       S01117
     C                     PARM           FXLIM                           S01117
     C                     PARM           LNLIM                           S01117
     C                     PARM           FRLIM   90                      S01117
     C                     PARM           IRLIM   90                      S01117
     C                     PARM           FXSAME                          S01117
     C                     PARM           LNSAME                          S01117
     C                     PARM           FXPER                           S01117
     C                     PARM           LNPER                           S01117
     C                     PARM           FXPC                            S01117
     C                     PARM           LNPC                            S01117
     C                     PARM           BJRDNB                          S01117
     C                     ENDSR                                          S01117
0848 C********************************************************************S01117
     C/EJECT                                                              S01117
0699 C********************************************************************S01117
0849 C**                                                                  S01117
0850 C**   ZDATE2 SR. TO CONVERT A DAY NUMBER TO DATE FORMATS.            S01117
0851 C**                                                                  S01117
0852 C**   THE YEAR 2000, BEING DIVISIBLE BY 400, IS A LEAP YEAR.         S01117
0853 C**                                                                  S01117
0854 C           ZDATE2    BEGSR                           *** ZDATE2 *** S01117
0855 C**                                                                  S01117
0856 C**   CLEAR DATE FIELDS.                                             S01117
0857 C                     Z-ADD0         ZDATE   60                      S01117
0858 C                     MOVEL'       ' ZADATE  7                       S01117
0859 C**                                                                  S01117
0860 C**   CALCULATION TO DEFINE INPUT DAY NUMBER.                        S01117
0861 C                     Z-ADDZDAYNO    ZDAYNO  50                      S01117
0862 C**                                                                  S01117
0863 C**   DETERMINE YEAR NUMBER.                                         S01117
0864 C**                                                                  S01117
0865 C**   ADJUST DAY NUMBER IN CASE LAST DAY OF YEAR.                    S01117
0866 C           ZDAYNO    SUB  1         ZDAYN1  50   99                 S01117
0867 C   99                GOTO ZDEND2                                    S01117
0868 C**                                                                  S01117
0869 C**   CALCULATE NUMBER OF 4 YEAR SPANS SINCE 31/12/1971.             S01117
0870 C           ZDAYN1    DIV  1461      ZLYR    20                      S01117
0871 C                     MVR            ZDAYN1           SAVE REMAINING S01117
0872 C**                                                   DAYS           S01117
0873 C**   CALCULATE NUMBER OF REMAINING YEARS.                           S01117
0874 C                     Z-ADD1         ZWRK2   20                      S01117
0875 C           ZDTAG1    TAG                             ** ZDTAG1 TAG *S01117
0876 C           ZDAYN1    COMP ZYDY,ZWRK2             90                 S01117
0877 C  N90      ZWRK2     ADD  1         ZWRK2                           S01117
0878 C  N90                GOTO ZDTAG1                                    S01117
0879 C           ZWRK2     SUB  1         ZWRK2          91LEAP YR, 91 ON S01117
0880 C**                                                                  S01117
0881 C**   DECREMENT DAY NO. BY DAYS IN REMAINING YEARS.                  S01117
0882 C  N91      ZDAYN1    SUB  ZYDY,ZWRK2ZDAYN1                          S01117
0883 C**                                                                  S01117
0884 C**   CALCULATE ACTUAL YEAR NUMBER.                                  S01117
0885 C           ZLYR      MULT 4         ZWRK3   30                      S01117
0886 C           ZWRK3     ADD  72        ZWRK3            BASE IS 1972   S01117
0887 C                     Z-ADDZWRK3     ZYEAR   20                      S01117
0888 C           ZYEAR     ADD  ZWRK2     ZYEAR            YEAR           S01117
0889 C**                                                                  S01117
0890 C**   DETERMINE MONTH NUMBER.                                        S01117
0891 C**                                                                  S01117
0892 C**   ADJUST DAY NO. IN CASE LAST DAY OF LEAP YEAR FEBRUARY.         S01117
0893 C                     SETOF                     9293                 S01117
0894 C   91      ZDAYN1    COMP 59                     9293               S01117
0895 C   91N92   ZDAYN1    SUB  1         ZDAYN1                          S01117
0896 C**                                                                  S01117
0897 C**   CALCULATE MONTH NUMBER.                                        S01117
0898 C                     Z-ADD2         ZWRK2                           S01117
0899 C           ZDTAG2    TAG                             ** ZDTAG2 TAG *S01117
0900 C           ZDAYN1    COMP ZMDY,ZWRK2             94                 S01117
0901 C  N94      ZWRK2     ADD  1         ZWRK2                           S01117
0902 C  N94                GOTO ZDTAG2                                    S01117
0903 C           ZWRK2     SUB  1         ZWRK2                           S01117
0904 C**                                                                  S01117
0905 C                     Z-ADDZWRK2     ZMTH    20       MONTH          S01117
0906 C**                                                                  S01117
0907 C**   DETERMINE DAY OF MONTH.                                        S01117
0908 C**                                                                  S01117
0909 C**   ADD BACK LAST DAY OF YEAR ADJUSTMENT.                          S01117
0910 C           ZDAYN1    ADD  1         ZDAYN1                          S01117
0911 C**                                                                  S01117
0912 C**   CALCULATE DAY OF MONTH.                                        S01117
0913 C           ZDAYN1    SUB  ZMDY,ZWRK2ZDAY    20       DAY            S01117
0914 C**                                                                  S01117
0915 C**   ADD BACK LEAP YEAR 29TH FEBUARY ADJUSTMENT, IF REQUIRED.       S01117
0916 C   93      ZDAY      ADD  1         ZDAY                            S01117
0917 C**                                                                  S01117
0918 C**   FORMAT DATE, DDMMYY OR MMDDYY.                                 S01117
0919 C  N98                MOVELZDAY      ZWRK4   40                      S01117
0920 C   98                MOVE ZDAY      ZWRK4                           S01117
0921 C  N98                MOVE ZMTH      ZWRK4                           S01117
0922 C   98                MOVELZMTH      ZWRK4                           S01117
0923 C                     MOVELZWRK4     ZDATE                           S01117
0924 C                     MOVE ZYEAR     ZDATE                           S01117
0925 C**                                                                  S01117
0926 C**   FORMAT ALPHA DATE, DDMMMYY.                                    S01117
0927 C           ZDAY      COMP 10                     95                 S01117
0928 C                     MOVELZDAY      ZWRK5   5                       S01117
0929 C   95                MOVEL' '       ZWRK5                           S01117
0930 C                     MOVE ZMNM,ZMTH ZWRK5                           S01117
0931 C                     MOVELZWRK5     ZADATE                          S01117
0932 C                     MOVE ZYEAR     ZADATE                          S01117
0933 C**                                                                  S01117
0934 C           ZDEND2    ENDSR                           * ZDEND2 ENDSR*S01117
0935 C**                                                                  S01117
0719 C********************************************************************S01117
     C*                                                                   S01194
     C           *PSSR     BEGSR                                          S01194
     C*                                                                   S01194
     C           @RUN      IFEQ *BLANK                                    S01194
     C                     MOVE 'Y'       @RUN    1                       S01194
     C                     DUMP                                           S01194
     C                     END                                            S01194
     C*                                                                   S01194
     C                     ENDSR                                          S01194
0590 C********************************************************************S01194
0977 O*L0800P1H***03   OF                                           S01124S01117
0977 O***DL0800P1E   03   OF      HEADS                             S01117E273
0977 O****DL0760P1E   03   OF      HEADS                                  E273
     ODL0800P1E   03   OF      HEADS                                      S01117
0978 O*****                              22 'REFERENCE DL0800'            S01117
0978 O                                   22 'REFERENCE DL0800P1'          S01117
0979 O*****                    TITL      89                               S01194
0979 O                         BJURPT    89                               S01194
0980 O                                  122 'DATE              PAGE'
0981 O*****                    RUNA     112                               S01194
0981 O                         BJMRDT   112                               S01194
0982 O                         PAGE  Z  127
0983 O*       H 2      OF                                                 S1105
     O*****   H 2      OFNU1                                        S1105 S01117
     O        E 2      OFNU1   HEADS                                      S01117
     O                                   19 'CONSOLIDATED'                S01117
0984 O                                   66 'EXPOSURE BY REGION OF '
0985 O                                   80 'RISK IN 000''S '
0986 O*****                    BCYL      83                               S01194
0986 O                         BNCYCD    83                               S01194
     O*****   H 2      OF U1                                        S1105 S01117
     O        E 2      OF U1   HEADS                                      S01117
     O                                   19 'CONSOLIDATED'                S01117
     O                                   57 'EXCEPTION EXPOSURE'          S1105
     O                                   75 'BY REGION OF RISK'           S1105
     O                                   84 'IN 000''S'                   S1105
     O*****                    BCYL      88                         S1105 S01194
     O                         BNCYCD    88                               S01194
0987 O*       H 1      OF                                                 S1105
     O*****   H 1      OFNU1                                        S1105 S01117
     O        E 1      OFNU1   HEADS                                      S01117
0988 O                                   66 '----------------------'
0989 O                                   83 '-----------------'
     O*****   H 1      OF U1                                        S1105 S01117
     O        E 1      OF U1   HEADS                                      S01117
     O                                   57 '------------------'          S1105
     O                                   75 '------------------'          S1105
     O                                   88 '-------------'               S1105
0990 O****    H 21     OFNLR                                              S01157
0991 O****                               58 '------- F O R E I G N  '     S01157
0992 O****                               81 'E X C H A N G E -------'     S01157
0993 O****                              109 '--------------- L E N D '    S01157
0994 O****                              131 'I N G ----------------'      S01157
0995 O****    H  1     OFNLR                                              S01157
0996 O****                               14 'REGION NAME'                 S01157
0997 O****                               59 'PERIOD       LIMIT      '    S01157
0998 O****                               81 'EXPOSURE        EXCESS'      S01157
0999 O****                              109 'PERIOD       LIMIT     '     S01157
1000 O****                              131 'EXPOSURE        EXCESS'      S01157
     O*****   H 21     OFNLR                                        S01157S01117
     O        E 21     OF      HEADS                                      S01117
     O                                   16 'REGION NAME'                 S01157
     O                                   82 'PERIOD'                      S01157
     O                                   96 'LIMIT'                       S01157
     O                                  125 'EXPOSURE         EXCESS'     S01157
     O**                                                                  S01157
1001 O****    EF2      50 32N21                                           S01157
1002 O****   OR 1      51 53N21                                           S01157
1003 O****   OR 1      51 54N21                                           S01157
1004 O****                50   REGC       2                               S01157
1005 O****                50   REGN      33                               S01157
1006 O****                   53NEXTF     37                               S01157
1007 O****                50             37 '001'                         S01157
1008 O****                   53          38 '-'                           S01157
1009 O****                   53XFDA,D    41                               S01157
1010 O****             50 71             41 ' SPOT  '                     S01157
1011 O****                   53XFLM,D1   53                               S01157
1012 O****                   53FXPOS 1   67                               S01157
1013 O****                   53XFXS,D1   81                               S01157
1014 O****                   54NEXTL     87                               S01157
1015 O****                50             87 '001'                         S01157
1016 O****                   54          88 '-'                           S01157
1017 O****                   54XLDA,D    91                               S01157
1018 O****             50 72             91 ' SPOT  '                     S01157
1019 O****                   54XLLM,D1  103                               S01157
1020 O****                   54LXPOS 1  117                               S01157
1021 O****                   54XLXS,D1  131                               S01157
     O*                                                                   S01157
     O**   FOREIGN EXCHANGE DETAIL LINE                                   S01157
     O*                                                                   S01157
     O        EF2      50 32N21                                           S01157
     O       AND       53                                                 S01157
     O       OR 1      51 53N21                                           S01157
     O                    50 53REGC      04                               S01157
     O*****               50 53REGN      35                         S01157S01194
     O                    50 53A3RGNM    35                               S01194
     O                    50 53FDESC     45                               S01117
     O                    50 53          63 'FOREIGN EXCHANGE'            S01157
     O                       53NEXTF     78                               S01157
     O                    50 53          78 '001'                         S01157
     O                       53          79 '-'                           S01157
     O                       53XFDA,D    82                               S01157
     O                 50 71 53          80 ' SPOT  '                     S01157
     O                       53XFLM,D1   96                               S01157
     O                       53FXPOS 1  110                               S01157
     O                       53XFXS,D1  125                               S01157
     O*                                                                   S01157
     O**   LENDING DETAIL LINE                                            S01157
     O*                                                                   S01157
     O        EF2      50 32N21                                           S01157
     O       AND       54                                                 S01157
     O       OR 1      51 54N21                                           S01157
     O                    50 54REGC      04                               S01157
     O*****               50 54REGN      35                         S01157S01194
     O                    50 54A3RGNM    35                               S01194
     O                    50 54LDESC     45                               S01117
     O                    50 54          54 'LENDING'                     S01157
     O                       54NEXTL     78                               S01157
     O                    50 54          78 '001'                         S01157
     O                       54          79 '-'                           S01157
     O                       54XLDA,D    82                               S01157
     O                 50 71 54          80 ' SPOT  '                     S01157
     O                       54XLLM,D1   96                               S01157
     O                       54LXPOS 1  110                               S01157
     O                       54XLXS,D1  125                               S01157
     O*                                                                   S01157
     O**   FORWARD RATE AGREEMENT DETAIL LINE                             S01157
     O*                                                                   S01157
     O        EF2      55 32N21                                           S01157
     O       AND       57                                                 S01157
     O       OR 1      57 55N21                                           S01157
     O                    57 55REGC      04                               S01157
     O*****               57 55REGN      35                         S01157S01194
     O                    57 55A3RGNM    35                               S01194
     O                    57 55          70 'FORWARD RATE AGREEMENTS'     S01157
     O                    57 55XRLM  1   96                               S01157
     O                    57 55RXPOS 1  110                               S01157
     O                    57 55XRXS  1  125                               S01157
     O*                                                                   S01157
     O**   INTEREST RATE SWAPS DETAIL LINE                                S01157
     O*                                                                   S01157
     O        EF2      56 32N21                                           S01157
     O       AND       57                                                 S01157
     O       OR 1      57 56N21                                           S01157
     O                    57 56REGC      04                               S01157
     O*****               57 56REGN      35                         S01157S01194
     O                    57 56A3RGNM    35                               S01194
     O                    57 56          66 'INTEREST RATE SWAPS'         S01157
     O                    57 56XILM  1   96                               S01157
     O                    57 56IXPOS 1  110                               S01157
     O                    57 56XIXS  1  125                               S01157
     O**                                                                  S01157
     O********T   22   LR 46NU7                                           E10421
     O*****   TF  22   LR 46NU7                                     E10421S01117
1051 O*****                              63 '***   NO DETAILS TO REPO'    S01117
1052 O*****                              71 'RT   ***'                    S01117
1053 O        T 3      LRNU7 31                                           S01117
1054 O                                   71 '*** END OF REPORT ***'       S01117
0977 O***DL0800AUT   03   LR                                        S01194E273
0977 O****DL0760AUT   03   LR                                             E273
     ODL0800AUT   03   LR                                                 S01117
0978 O                                   22 'REFERENCE DL0800AU'          S01117
0979 O                         BJURPT    89                               S01194
0980 O                                  122 'DATE              PAGE'      S01194
0981 O                         BJMRDT   112                               S01194
0982 O                         PAGE1 Z  127                               S01194
0983 O        T 2      LRNU1                                              S01194
0984 O                                   66 'EXPOSURE BY REGION OF '      S01194
0985 O                                   80 'RISK IN 000''S '             S01194
0986 O                         BNCYCD    83                               S01194
     O        T 2      LR U1                                              S01194
     O                                   57 'EXCEPTION EXPOSURE'          S01194
     O                                   75 'BY REGION OF RISK'           S01194
     O                                   84 'IN 000''S'                   S01194
     O                         BNCYCD    88                               S01194
0987 O*       T 1      LRNU1                                              S01194
0987 O        T 1      LRNU1                                              LN0236
0988 O                                   66 '----------------------'      S01194
0989 O                                   83 '-----------------'           S01194
     O        T 1      LR U1                                              S01194
     O                                   57 '------------------'          S01194
     O                                   75 '------------------'          S01194
     O                                   88 '-------------'               S01194
1022 O*****   TF00     LR                                                 S01194
1023 O        T   36   LR
1024 O                                   18 'RUN CONTROLS'
1025 O        T 2      LR
1026 O                                   59 'NUMBER'
1027 O                                   84 'VALUE'
1028 O        T 2      LR
1029 O                                   29 'EXTRACT FILE RECORDS '
1030 O                                   34 'INPUT'
1031 O                         RREAD 3   59
1032 O                         TOTI  Z   81
1033 O                         TOTD      84
1034 O                 43                89 '***'
1035 O        T 2      LR
1036 O                                   29 'EXTRACT FILE CONTROL '
1037 O                                   35 'TOTALS'
1038 O                         NORE  3   59
1039 O                         HRWN  Z   81
1040 O                         HRDC      84
1041 O                 43                89 '***'
     O        T 2      LR U3                                              CDL002
     O                                   29 'NETTING FILE RECORDS '       CDL002
     O                                   34 'INPUT'                       CDL002
     O                         NREAD 3   59                               CDL002
     O                         TOTNI Z   81                               CDL002
     O                         TOTND     84                               CDL002
1042 O        T 2      LR
1043 O                                   28 'RECORDS READ IN THIS'
1044 O                                   35 ' REPORT'
1045 O                         RLIST 3   59
1046 O                         TOTIL Z   81
1047 O                         TOTDL     84
1048 O        T 3      LR 43
1049 O                                   71 '***   DIFFERENCE   ***'
     O        T 3      LR 46NU7                                           S01117
1051 O                                   63 '***   NO DETAILS TO REPO'    S01117
1052 O                                   71 'RT   ***'                    S01117
1055 O        T 3      LR U7 U8                                           S01117
     O                                   71 '*** PRINT TERMINATED ***'    S01117
     O        T 1      LR U7 U8                                           S01117
     O                                   57 'DATABASE ERROR'              S01117
     O                         DBASE     61                               S01117
     O                                   67 'FILE'                        S01117
     O                         DBFILE    78                               S01117
     O        T 13     LR U7 U8                                           S01117
     O                                   49 'OPTION'                      S01117
     O                         DBOPTN    57                               S01117
     O                                   66 'KEY'                         S01117
     O                         DBKEY     96                               S01117
1053 O*****   T 3      LRNU7                                              S01117
1054 O*****                              71 '*** END OF REPORT ***'       S01117
1055 O*****   T 3      LR U7 U8                                           S01117
1056 O*****                              40 'REFERENCE DL0800'            S01117
1057 O*****                              62 'PRINT TERMINATED'            S01117
1058 O*****                              80 '-DATABASE IN ERROR'          S01117
** CPY@   **      OBJECT COPYRIGHT
(c) Misys International Banking Systems Ltd. 2001
**   FCT - CONVERSION FACTORS
0001
0010
0100
1000
**   ZYDY - YEARS IN DAYS CUMULATIVE, FOUR YEAR SPAN
0366073110961461
**   ZMDY - MONTHS IN DAYS CUMULATIVE THROUGH YEAR
000031059090120151181212243273304334365
**   ZMNM - MONTHS SHORT NAMES
JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC
