     H        1
      *****************************************************************
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas DL MM Automatic Rollover COB Process')           *
      *****************************************************************
      *                                                               *
      *  Midas - Dealing Module                                       *
      *                                                               *
      *  DL5350 - Money Market Rollover COB Processing                *
      *                                                               *
      *  (c) Finastra International Limited 2004                      *
      *                                                               *
      *  Last Amend No. 261960             Date 26Apr13               *      
      *  Prev Amend No. CER050             Date 16Jun19               *
      *                 MD053295           Date 13Apr19               *
      *                 MD046248           Date 27Oct17               *
      *                 CDL099             Date 06Oct17               *
      *                 CGL165             Date 23Feb15               *
      *                 CDL096             Date 22Sep14               *
      *                 CDL094             Date 11Jun14               *
      *                 CDL093             Date 08Apr14               *
      *                 MD023322           Date 07Feb14               *
      *                 MD023337           Date 12Nov13               *
      *                 259376             Date 11Feb13               *
      *                 AR996895           Date 11Feb13               *
      *                 CRE073             Date 06Dec10               *
      *                 AR787620           Date 10Jun11               *
      *                 CLE064             Date 06Dec10               *
      *                 CER059             Date 19Jul10               *
      *                 CER054             Date 07Apr09               *
      *                 CER016A            Date 19May08               *
      *                 CER048             Date 19May08               *
      *                 CER020             Date 19May08               *
      *                 CER043             Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *                 246498             Date 19Mar07               *
      * Midas Plus 1.4 Base ------------------------------------------*
      *                 243842             Date 29Nov06               *
      *                 244735A            Date 28Dec06               *
      *                 244735             Date 28Dec06               *
      *                 243473             Date 09Nov06               *
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 BUG12835           Date 11Dec06               *
      *                 GBO005             Date 19Sep06               *
      *                 239182             Date 31Aug06               *
      *                 241513             Date 13Aug06               *
      *                 CSD031             Date 10Apr06               *
      *                 CDL049             Date 05Jul06               *
      *                 CSD027             Date 09Dec05               *
      *                 CRN001             Date 07Dec05               *
      *                 CDL038             Date 10May05               *
      *                 BUG8231            Date 31Aug05               *
      *                 BUG7887            Date 21Jul05               *
      *                 BUG7853            Date 19Jul05               *
      *                 BUG7448            Date 07Jun05               *
      *                 CDL033             Date 10Feb05               *
      *                 CSW037A            Date 02May05               *
      *                 CDL028             Date 07Feb05               *
      *                 CSD025             Date 11Jan05               *
      *                 CSW037             Date 15Dec04               *
      *                 CSW036             Date 15Dec04               *
      *                 BUG4847            Date 01Nov04               *
      *                 BUG4541            Date 18Oct04               *
      *                 BUG4475            Date 06Oct04               *
      *                 BUG4122            Date 15Sep04               *
      *                 BUG4069            Date 03Sep04               *
      *                 BUG4068            Date 03Sep04               *
      *                 BUG3850            Date 10Aug04               *
      *                 Bug03936           Date 09Aug04               *
      *                 BUG3838            Date 07Aug04               *
      *                 BUG3873            Date 30Jul04               *
      *                 BUG3611            Date 12Jul04               *
      *                 CDL016 *CREATE     Date 03Feb04               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  261960 - Use correct interest rate HKINTR instead of HKIIRT. *      
      *  CER050 - Annualised Percentage Rate (Recompile)              *
      *  MD053295 - Lending loan with Interest Calculation Basis      *
      *             method 3 (30/360) has wrong interest payment      *
      *             amount for month of March (Recompile)             *
      *  MD046248 - Finastra Rebranding                               *
      *  CDL099 - Split Value Date (Recompile)                        *
      *  CGL165 - Dual Withholding Tax                                *
      *  CDL096 - Business Day Conventions on MM Deals                *
      *           (Recompile)                                         *
      *  CDL094 - Enhance  Receive Settlement Instructions            *
      *           (Recompiled)                                        *
      *  CDL093 - MM Interest calculation type 9.                     *
      *  MD023322 - Wrong new principal amount generated from         *
      *             autorollover deal with rollover indicator = F     *
      *  MD023337 - New deal generated from a blocked autoroll        *
      *             deal cannot be authorized                         *
      *  259376 - Produce confirmations in Correspondence Manager for *
      *           auto-rollover deals.                                *
      *         - Applied for AR1034429 (Child: AR1034430)            *
      *  AR996895 - Incorrect accrual interest calculation            *
      *             (Child: AR996897) (Recompile)                     *
      *  CRE073 - Interest Rate Rounding (Recompile)                  *
      *  AR787620 - Hooks Incorporation                               *
      *             WNCPYSRC,DLH00081                                 *
      *             WNCPYSRC,DLH00082                                 *
      *             WNCPYSRC,DLH00062                                 *
      *             WNCPYSRC,DLH00063                                 *
      *             WNCPYSRC,DLH00083                                 *
      *             WNCPYSRC,DLH00084                                 *
      *             WNCPYSRC,DLH00085                                 *
      *             WNCPYSRC,DLH00086                                 *
      *             WNCPYSRC,DLH00087                                 *
      *             WNCPYSRC,DLH00088                                 *
      *             WNCPYSRC,DLH00089                                 *
      *             WNCPYSRC,DLH00090                                 *
      *             WNCPYSRC,DLH00091                                 *
      *             WNCPYSRC,DLH00092                                 *
      *             WNCPYSRC,DLH00093                                 *
      *             WNCPYSRC,DLH00094                                 *
      *             WNCPYSRC,DLH00095                                 *
      *             WNCPYSRC,DLH00064                                 *
      *  CLE064 - Enhancement of Lending Frequencies (Recompile)      *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER054 - German Features - Church Tax (Recompile)            *
      *  CER016A - German Interest Calculation: Upgarde of FGE059     *
      *            to Midas Plus                                      *
      *  CER048 - German Features - Taxes (Recompile)                 *
      *  CER020 - Enhanced Rollover Window: Upgrade FGE089 to         *
      *           Midas Plus (Recompile)                              *
      *  CER043 - German Features LF041-00 New Fields and Defaulting  *
      *           (Recompile)                                         *
      *  246498  - Rectify processing for P+I processing for deal     *
      *            type = 'TD'. It becames P-I instead of P+I.        *
      *            Also rectify DL5350P2 report.                      *
      *  243842 - Prevent looping when daily accrual and rollover     *
      *           frequency is 'A'.                                   *
      *  244735A - Rectify processing for RBDA field. This field      *
      *            should always be positive in DEALSDC file.         *
      *  244735 - Rectify principal and interest processing for       *
      *           DTYP = 'IP' and 'TI'. It is causing a negative      *
      *           amount to be written in DEALSDC. PCPL and TOTI      *
      *           must always be +ve in DEALSDC file.                 *
      *  243473 - OCUR is outside of range. Increase MULT length and  *
      *           pointers X and Y. Reverse part of BUG8231 fix so    *
      *           that checking will not be limited to 999. Prevent   *
      *           another rollover when rollover frequency is 'A' and *
      *           rollover generation date is equal to rundate and    *
      *           BKAPDT is equal to the current maturity date.       *
      *  BUG12835 - DLC0602 00001 failed FOOB                         *
      *  GBO005 - Added Hooks: DL5350FFP1, DL5350C010, DL5350C011.    *
      *  239182 - Basic Rate Tax is not applied to Fixed Deposits.    *
      *  241513 - Consider rollover indicator FSROLI during           *
      *           population of principal in DEALSDC.                 *
      *  CSD031 - Enhanced Centralised Static Data (Recompile)        *
      *  CDL049 - Addition of a Reference Rate field (recompile)      *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CRN001 - Improve error reporting.                            *
      *  CDL038 - Extended Deal Sub Type                              *
      *  BUG8231 - Trailer processing does not consider overflow      *
      *            (carry over) that causes FOOB in COB.              *
      *  BUG7887 - DL5350 Time Deposit Confirmation (for renewal) not *
      *            acceptable                                         *
      *  BUG7853 - Upon rollover, the new maturity date is set to a   *
      *            holiday. Need to call CHKHOL to check for holiday  *
      *            before setting the new maturity date.              *
      *  BUG7448- Incorrect principal and interest amount being       *
      *           rolled over in DEALSDC file.                        *
      *  CDL033 - Floating Rate CDs Issued (Recompile)                *
      *  CSW037A- Additional Field extended to 40 chars (recompile)   *
      *  CDL028 - Automatic Rate Interpolations (Recompile)           *
      *  CSD025 - Customer De-Activation                              *
      *  CSW037 - Additional Field Data on MT300/MT320                *
      *  CSW036 - Dual SWIFT BIC held on Client Details               *
      *  BUG4847 - Form Length should be 48 & adjust confirmation     *
      *            layout.                                            *
      *  BUG4541 - Don't roll over previously rolled over deals       *
      *  BUG4475 - Generated deal numbers do not match with R4's      *
      *  BUG4122 - Need to seton U7 and U8 in *PSSR.                  *
      *            Re-write update of PF/DEALSDF. Incorp of BOI737.   *
      *  BUG4069- Produce confirmations for Rolled over Deals         *
      *  BUG4068- Deal number range for Fixed Loan/Deposit            *
      *  BUG3850- Add Old Deal No., Interest Rate & Cust Shortname    *
      *           to DL5350P1 report and sort by Branch.              *
      *  Bug03936 - TPCPL (15,0) was z-add to @AMT1 (15,3) then moved *
      *             right to ZZAMT (15,3).  This resulted in the 3    *
      *             left most digits being dropped as well as the     *
      *             retention of the previous decimal places.         *
      *  BUG3838 - Various errors in rollover deal generation:        *
      *          1.FCOOB in DLC0601A                                  *
      *          2.Errors in generated deal fields (HKDDND, HKDVSD etc)
      *          3.Complete deals generated too late (on deal maturity)
      *          4.Complete rollover deals generated in COB must not  *
      *            be deleted. (Fix to MM0101 and  MM0102)            *
      *          5.DLDLDCQD (CL Extension) record not created         *
      *  BUG3873 - Rollover deals shouldn't carry over                *
      *            further settlement instructions                    *
      *  BUG3611 - FOOB in DLC0602                                    *
      *  CDL016 - Automatic Rollover of Fixed Term Loans/Deposits     *
      *                                                               *
      *****************************************************************
      /EJECT
      *****************************************************************
      *
     FDEALS   UF  E           K        DISK         KINFSR *PSSR A
     F            DEALSDCF                          KRENAMEDEALSDC9
     F            DEALSDAF                          KIGNORE
     F            DEALSDBF                          KIGNORE
     F            DEALSDDF                          KIGNORE
     F            DEALSDEF                          KIGNORE
     F            DEALSDGF                          KIGNORE
     F                                              KCOMIT                                   BUG4847
      **  Access DEALSDCF (detail record) and DEALSDFF (trailer record)
      **  only.
      *
     F*DLDLDCL1IF**E***********K********DISK                                                 BUG3850
     F*DLDLHGL1IF**E***********K********DISK                                         BUG3850 BUG4475
     F**********  DEALSDCF                          KRENAMEDEALSFD9                          BUG4475
     F**********  DEALSDBF                          KIGNORE                          BUG3850 BUG4475
     F**********  DEALSDDF                          KIGNORE                          BUG3850 BUG4475
     F**********  DEALSDGF                          KIGNORE                          BUG3850 BUG4475
     FDEALSL4 IF  E           K        DISK                                                  BUG4475
     F            DEALSDCF                          KRENAMEDEALSFD9                          BUG4475
      **  Deal file - input
     FDLDEALL5IF  E           K        DISK                      A                           BUG3838
     F            DLDLDBD0                          KIGNORE                                  BUG3838
     F            DLDLDGD0                          KIGNORE                                  BUG3838
      *
     FDL5350P1O   E             10     PRINTER      KINFDS SPOOL1     UC
      **  Rollover deals report
      *
     FDL5350P2O   E                    PRINTER      KINFDS SPOOL2     UC                     BUG4069
      **  Confirmations report                                                               BUG4069
      *                                                                                      BUG4069
     FMMDEAULLUF  E           K        DISK         KINFSR *PSSR A
     F            MMDENBP0                          KIGNORE
     F            MMDENSP0                          KIGNORE
     F                                              KCOMIT                                   BUG4847
      *  MM Deals file
      *
     FSDBRTDL1IF  E           K        DISK                                                   239182
      *                                                                                       239182
      ** BRT Control Data                                                                     239182
      *                                                                                       239182
     FSDCBRTL1IF  E           K        DISK                                                   239182
      ** Customer's Tax Indicator                                                             239182
      *                                                                                       239182
     FCADLFALLUF  E                    DISK         KINFSR *PSSR
     F                                              KCOMIT
      ** Deal Numbers for Allocation
      *
     FSDFDDRL0UF  E           K        DISK         KINFSR *PSSR                             BUG4068
     F                                              KCOMIT                                   BUG4068
      ** Fixed Loan/Deposit Deal Number Range file                                           BUG4068
      *                                                                                      BUG4068
     FMMDEALLLIF  E           K        DISK         KINFSR *PSSR                             BUG4068
     F            MMDELDP0                          KRENAMEMMDELDP9                          BUG4068
     F            MMDENBP0                          KIGNORE                                  BUG4068
     F            MMDENSP0                          KIGNORE                                  BUG4068
      *                                                                                      BUG4068
     FSDTIX   UF  E           K        DISK         KINFSR *PSSR A
     F                                              KCOMIT                                   BUG4847
     FSDSTAAL1IF  E           K        DISK                                                 MD023322
      /COPY WNCPYSRC,DL5350FFP1
      *****************************************************************
      /EJECT
      *****************************************************************
      *                                                               *
      *               INDICATOR USAGE                                 *
      *                                                               *
      *       10      Page overflow indicator for DL5350P1            *
      *                                                               *
      *       30      'TD' Confirmation Heading                       *                      BUG4069
      *       31      'TI' Confirmation Heading                       *                      BUG4069
      *       32      'IT' Confirmation Heading                       *                      BUG4069
      *       33      'IP' Confirmation Heading                       *                      BUG4069
      *                                                               *                      BUG4069
      *       40      'All deals' in Report                           *
      *       40-43   Deal currency has 0-3 decimal places            *
      *                                                               *
      *       50      Multibranching on.                              *
      *       58      Blocked Deal                                    *                      BUG4069
      *                                                               *
      *       64      Table lookup indicator for deal no. data area   *
      *       65      GBO005 is ON                                    *
      *       66      GBO011 is ON                                    *
      *                                                               *
      *       71      End of file indicator                           *
      *       72      General error indicator                         *
      *       73      Skip-input-record indicator                     *
      *       75      Leap year indicator                             *
      *                                                               *
      *       80      Used by date conversion routine                 *
      *       81      Used by date conversion routine                 *
      *       82      Used by date conversion routine                 *
      *                                                               *
      *       87      Print Tax on Confirmation                       *                      BUG4069
      *                                                               *                      BUG4069
      *       U7 & U8 Database error                                  *
      *                                                               *
      ********************************************************************
      /EJECT
      ********************************************************************
     E                    NUM        20  1  A                                                BUG4847
     E                    CPY@    1   1 80
      **  Arrays for hash total subroutine
     E                    INT         2 15 0             ZHASH INTEGERS
     E                    DEC         2  3 0             ZHASH DECIMALS
      *
     E                    @YD     4   4  5 0A
      **  Array for SR. ZA0710 - Cumulative days in year for 4 year period
      *
     E                    @MD    13  13  5 0A
      **  Array for SR. ZA0710 - Cumulative days in year per month.
      *
     E                    @M     12  12  2 0
      **  Array for SR. MM1004 - Days in a month.  (Compile time array)
      *
     E                    @MN    12  12  3
      **  Array for SR. ZA0660 - Month names       (Compile time array)
      *
      **  System values array
     E                    SVAL    1   2 20
      *
     E/COPY WNCPYSRC,DLH00484
     E/COPY ZSRSRC,ZHOLE
     E/COPY ZSRSRC,ZFRQAZ1
     E/COPY ZSRSRC,ZDATE2Z1
     E/COPY ZSRSRC,ZEDITZ1
     E/COPY ZSRSRC,ZSEDITZ1                                                                  BUG4847
      *
      *  SETTLEMENT INSTRACTIONS ARE PRINTED ONLY FOR TYPES  02,12
     E                    LDES      120  1               DESC INPUT ARRAY
     E                    ARR1      120  1               DESC OUTPUT ARRAY
     E                    ARR3       95 40               HASH CODE DEFIN
     E                    ARR4       40  1               HOOK CODE CONTENT
     E                    ARR5       14  1               OUTPUT AMOUNT ARR
     E                    ARR6       17  1               OUTPUT AMOUNT ARR
     E                    ZHC        50  3
      *
      ********************************************************************
      /EJECT
      ********************************************************************
      *
      **  Copy for hash total subroutine
     I/COPY ZSRSRC,ZHASHZ2
     I/COPY ZSRSRC,ZHOLI
     I/COPY ZSRSRC,ZAOZ2
      *
     I              QQACCD                          QQACCZ
     I/COPY ZSRSRC,ZDAT10Z1                                                                  BUG3838
     I/COPY ZSRSRC,ZSEDITZ2                                                                  BUG4847
      *
     I            DS
     I                                        1  153@AMT1
     I                                        1  120@AMT2
     I                                       13  150@AMT3
      *
     I            DS
      **  Data structure for date in, to change format.
     I                                        1   80@@DTIN
     I                                        3   40@@YY
     I                                        5   60@@MM
     I                                        7   80@@DD
     I                                        1   40@@YYYY
     I                                        1   20@@CC
     I                                        5   60@@MTH
     I                                        7   80@@DAY
      *
     I            DS                              6
      **  Data structure to change format to MMDDYY/DDMMYY
     I                                        1   60@@DTOU
     I                                        1   20@@DAT1
     I                                        3   40@@DAT2
     I                                        5   60@@YYY
      *
     I            DS
     I                                        1  150@BRKG
     I                                        1  15 @@BRKG
      *
      **  Date of last update data structure
     I@HKLUP      DS                              7
     I                                        1   20HKDLUP
     I                                        3   5 HKMLUP
     I                                        6   70HKYLUP
      *
     I@DELNO      DS                             18
     I                                        1   60@IN
     I                                        7  120@LS
     I                                       13  180@CU
      *
     I@DFMT       DS
      **  Data structure to format separate dates into a 8N number
     I                                        1   40@YEAR
     I                                        5   60@MNTH
     I                                        7   80@DAY
     I                                        1   80@DATE
      *
      **  Data structure for SR. MM1004 - Manipulate date input.
     I@@WKDS      DS
     I                                        1   80@@WKDT
     I                                        1   40@@WKYY
     I                                        3   40@@WKY
     I                                        5   60@@WKM
     I                                        7   80@@WKD
      *
     I            DS
      **  Data Structure for SR. MM1009 - date field YYYYMMDD.
     I                                        1   80@@DATA
     I                                        1   40@@YY1
     I                                        5   60@@MM1
     I                                        7   80@@DD1
      *
     I            DS
      **  Data Structure for SR. MM1009 - date field YYYYMMDD.
     I                                        1   80@@DATB
     I                                        1   40@@YY2
     I                                        5   60@@MM2
     I                                        7   80@@DD2
      *
     I            DS
      **  Data structure for SR. ZA0710 - field is @@Z71Y
     I                                        1   40@@Z71Y
     I                                        1   10@@SSY1
     I                                        2   20@@SSY2
     I                                        3   30@@SSY3
     I                                        4   40@@SSY4
      *
     I            DS
      **  Data structure for SR. ZA0710 - field is @@VDT
     I                                        1   80@@VDT
     I                                        1   40@@YR
     I                                        5   60@@Z71M
     I                                        7   80@@Z71D
      *
     I            DS
      *
      ** Data structure for Prime Retail A/c for Settlement 04
      *
     I                                        1  15 #RPAC
     I**********                              1   60#CNUM                                     CSD027
     I                                        7  100#ACOD
     I                                       11  120#ACSQ
     I                                       13  15 #BRCA
     I            DS
     I                                        1   80@VDATN
     I                                        1   40Y1
     I                                        5   60M1
     I                                        7   80D1
      *
     I            DS
     I                                        1   80@MDATN
     I                                        1   40Y2
     I                                        5   60M2
     I                                        7   80D2
      *
     I            DS
      **  Data structure to store Hongkong interest tax rate
     I                                    P   1   32@TAXR
     I                                        1   3 @@TAXR
      *
     I            DS
      **   FIELDS USED FOR BENEFICIARY BANK DETAILS
     I                                        1  35 SPI
     I                                        1   3 SPEC3
     I                                        1   5 SPEC5
     I                                        6   8 SPEC8
     I                                        1   8 SPEC9
     I                                        6  12 SPEC12
     I                                        9  14 SPEC14
     I                                        9  17 SPEC17
     I                                       10  18 SPEC18
     I                                        5  34 SPEC34
     I                                        6  35 SPEC35
      *
     IPSDS       SDS
      **  Program status data structure.
     I                                        1  10 @PGM
     I                                       37  390@NOPMS
     I                                      244 253 @JOB
     I                                      254 263 @USER
     I                                      257 259 @USBR
     I                                      264 2690@JOBNO
      *
     ILDA        UDS                            256
      **  Local data area for data base errors.
     I                                      134 141 DBFILE
     I                                      142 170 DBKEY
     I                                      171 180 DBPGM
     I                                      181 1830DBASE
     I                                      134 183 DBLOT
      **
     ISPOOL1      DS
     I                                       83  92 SFILE1
     I                                    B 123 1240SFNUM1
      **                                                                                     BUG4069
     ISPOOL2      DS                                                                         BUG4069
     I                                       83  92 SFILE2                                   BUG4069
     I                                    B 123 1240SFNUM2                                   BUG4069
      *
      **   HASH CODES DEFINITION DATA STRUCTURE
      *
     I            DS
     I                                        13800 ARR3
#D1  I                                        1   7 DDATE
#D2  I                                       41  47 VDATE
#D3  I                                       81  87 MDATE
#D4  I                                      121 127 NIDATE
#D5  I                                      161 167 OTDATE
#D9  I                                      201 207 RDATE
#R1  I                                      241 252 BRTET#
#R2  I                                      281 292 RTSP#
#R3  I                                      321 3327TOTRT
#R4  I                                      361 3727DAMRT
#R4  I                                      401 4127YRAT#
#R7  I                                      441 4538EXRT#
#F1  I                                      481 4860DLNO#
#F2  I                                      521 522 DTYP#
#F3  I                                      561 562 DLST#
#F4  I                                      601 630 DSNM#
#F5  I                                      641 680 TERM
#F6  I                                      681 691 FRQDES
#F8  I                                      721 7260RODN#
#A1  I                                      761 7730AMT1#
#A2  I                                      801 8130AMT2#
#A3  I                                      841 853 DAAM#
#A4  I                                      881 8930AMT3
#A5  I                                      921 9330TOTI#
#A7  I                                      961 973 TAXM#
#A8  I                                     100110130AMT4
#B1  I                                     104110530FVAL#
#B2  I                                     108110930PURP#
#B3  I                                     112111330SALP#
#G1  I                                     11611163 CCY#
#G2  I                                     12011214 CCNM#
#G4  I                                     12411254 SCCNM#
#G5  I                                     12811310 BRNM#
#M1  I                                     13211355 CNA1#
#M2  I                                     13611395 CNA2#
#M3  I                                     14011435 CNA3#
#M4  I                                     14411475 CNA4#
#M5  I                                     14811484 BRKC#
#M6  I                                     15211550 BKNM#
#M7  I                                     15611570 BKTN#
#M8  I                                     16011620 CRNM#
#M9  I                                     16411650 CTWN#
#K1  I                                     16811715 ORCRNM
#KA  I                                     17211755 ORCNA1
#KB  I                                     17611795 ORCNA2
#KC  I                                     18011835 ORCNA3
#KD  I                                     18411875 ORCNA4
#K2  I                                     18811900 ORCTWN
#K3  I                                     19211955 OPCRNM
#KE  I                                     19611995 OPCNA1
#KF  I                                     20012035 OPCNA2
#KG  I                                     20412075 OPCNA3
#KH  I                                     20812115 OPCNA4
#K4  I                                     21212140 OPCTWN
#K5  I                                     21612195 ORCNME
#L1  I                                     22012235 RCPNM
#LA  I                                     22412275 RCCNA1
#LB  I                                     22812315 RCCNA2
#LC  I                                     23212355 RCCNA3
#LD  I                                     23612395 RCCNA4
#L2  I                                     24012420 RCPTN
#L3  I                                     24412475 PCPNM
#LE  I                                     24812515 PCCNA1
#LF  I                                     25212555 PCCNA2
#LG  I                                     25612595 PCCNA3
#LH  I                                     26012635 PCCNA4
#L4  I                                     26412660 PCPTN
#L5  I                                     26812715 FACONM
#LI  I                                     27212755 FACNA1
#LJ  I                                     27612795 FACNA2
#LK  I                                     28012835 FACNA3
#LL  I                                     28412875 FACNA4
#L6  I                                     28812890 FACOTN
#S1  I                                     29212960 FMTNA#
#S2  I                                     29612995 SPI#
#F9  I                                     30013011 INTCAP
#S3  I                                     30413073 PSET
#S4  I                                     30813113 RSET
#C1  I                                     31213130 NDAYO
#C2  I                                     31613170 NDAYN
#WT  I                                     32013215 WTAXI
#ID  I                                     32413247 SLID#
#DP  I                                     328132930DPAMT
#ZA  I                                     33213329 ZAMD
#ZC  I                                     33613364 ZCOP
#ZR  I                                     34013408 ZREV
#MA  I                                     34413460 ISNM#
#MB  I                                     34813490 ISTN#
#TX  I                                     35213532 TELX#
#S5  I                                     35613589 AUTO#
      *
#RI  I                                     35903590 ROLI#
#BK  I                                     35913591 BLKI#
#DN  I                                     35923593 DYNO#
#TM  I                                     35943595 TMDY#
#RF  I                                     35963615 RFNO#
      *
     IAUTONR      DS                             29
      *
     I                                        1   5 AUTO1
     I                                        6  13 AUTO2
     I                                       14  21 AUTO3
     I                                       22  29 AUTO4
      *
     I            DS
      ** FIELDS USED BY RNOS AND CNOS  SUBROUTINES
     I                                        1  12 NOSTRO
     I                                        1   2 NOS
     I                                        1   6 CUSTNO
     I                                        1   8 CPSH
     I                                        1  10 RETAC
     I                                        7  10 AC
     I                                       11  12 SEQ1
     I                                       13  15 BRC
     I                                       16  37 CPTN
     I                                       22  22 DASH
     I                                       23  25 RCCY
     I                                       26  26 DASH1
     I                                       27  30 RACOD
     I                                       31  31 DASH2
     I                                       32  33 RACSQ
     I                                       34  34 DASH3
     I                                       35  37 BRCX
      *
     I            DS
      *    FIELDS USED IN SRCONF SUBROUTINE
     I                                        1   6 KEYDS
     I                                        1   1 TYPE
     I                                        2   30N
     I                                        4   50P
     I                                        6   6 PAYREC
      *
     I            DS
      *    SETTLEMENT DETAILS
     I                                        1  27 SETTLR
     I                                        1   20PCST
     I                                        1   20SETP
     I                                        3  14 OPCA
     I                                        3  14 OSAC
     I                                       15  24 TSCN
     I                                       15  24 TSEN
     I                                       25  27 ROBR
     I                                       28  54 SETTLP
     I                                       28  290SCST
     I                                       28  290MDST
     I                                       30  41 OSCAQQ
     I                                       30  41 OMDAQQ
     I                                       42  51 TPCN
     I                                       42  51 TMAN
     I                                       52  54 POBR
     I                                       52  54 OMDB
     I                                       55  81 SETTL1
     I                                       55  560SDST
     I                                       57  68 OSDAQQ
     I                                       69  78 TSTN
     I                                       79  81 OSDB
     I                                       82 108 SETTLA
     I                                       82  830RSETM
     I                                       84  95 URACC
     I                                       96 105 CPPBK
     I                                      106 108 FIROBR
     I                                      109 135 SETTLB
     I                                      109 1100PSETM
     I                                      111 122 UPACC
     I                                      123 132 CPRBK
     I                                      133 135 FIPOBR
     I                                      136 153 OSDA
     I                                      154 171 OMDA
      *                                                                                      BUG8231
     I***MULT***  DS                        999                                       BUG8231 243473
     IMULT        DS                       9999                                               243473
      *                                                                                      BUG8231
     I                                        1  180TAMNP                                    BUG8231
      *                                                                                      BUG8231
     I            DS                                                                         BUG8231
     I                                        1  180W#TOTL                                   BUG8231
     I                                        1  150W#TOTN                                   BUG8231
     I                                       16  180W#TOTD                                   BUG8231
      *
     I/COPY WNCPYSRC,DLH00485
     I              'ROLLOVER OF DEAL NO.'C         UGTTLE
      *
     IDSFDY     E DSDSFDY
      * FIRST DS FOR ACCESS PROGRAMS, SHORT DATA STRUCTURE
      *
     IDSSDY     E DSDSSDY
      * SECOND DS FOR ACCESS PROGRAMS, LONG DATA STRUCTURE
      *
     IDLDCQD    E DSDLDLDCQD                                                                 BUG3838
     ISDBANK    E DSSDBANKPD
      ** DUMMY RECORD FORMAT FOR BANK DETAILS
      *
     ISDMMOD    E DSSDMMODPD
      ** DUMMY RECORD FORMAT FOR BANK DETAILS
      *
     ISDBRCH    E DSSDBRCHPD
      ** DUMMY RECORD FORMAT FOR BRANCH DETAILS
      *
     ISDBSRT    E DSSDBSRTPD
      ** DUMMY RECORD FORMAT FOR BASERATE DETAILS
      *
     ISDDLST    E DSSDDLSTPD
      ** EXTERNAL DS FOR DEAL SUBTYPE DETAILS
      *
     ISDBROK    E DSSDBROKPD
      ** EXTERNAL DS FOR BROKER DETAILS
      *
     ISDCURR    E DSSDCURRPD
      ** EXTERNAL DS FOR CURRENCY DETAILS
      *
     ISDCUST    E DSSDCUSTPD
      ** EXTERNAL DS FOR CUSTOMER DETAILS
     I              QQDFAC                          QQDFA1
      *
     ISDDEAL    E DSSDDEALPD
      ** EXTERNAL DS FOR CURRENCY DETAILS
     I              QQACCD                          QQACC1
      *
     ISCSARD    E DSSCSARDPD
      ** DUMMY RECORD FORMAT FOR SAR DETAILS
      *
     I@CNST     E DSSDCNSTPD
      ** DUMMY RECORD FORMAT FOR COUNTERPARTY DETAILS
      *
     I@NOST     E DSSDNOSTPD
     I              QQACCD                          QQACC2
      ** DUMMY RECORD FORMAT FOR NOSTRO DETAILS
      *
     I@TRAD     E DSSDTRADPD
      ** DUMMY RECORD FORMAT FOR TRADING DATA DETAILS
      *
     I/COPY ZSRSRC,ZINTDYZ1                                                                 MD023322
      *                                                                                     MD023322
      *****************************************************************
     I/EJECT
      *****************************************************************
      *                                                               *
      *                    LIST OF SUBROUTINES                        *
      *                                                               *
      *   1.  #AA01   - Main control routine                          *
      *   2.  #BA01   - Process loop                                  *
      *   3.  DBERR   - Database error handling routine               *
      *   4.  MM1004  - Calculate the next interest payment date      *
      *   5.  MM1009  - Calculate the number of interest days         *
      *   6.  MM1030  - Calculate interest                            *
      *   7.  *PSSR   - Program error handling routine                *
      *   8.  #RA01   - Read DLDLDCL1 sequentially                    *
      *   9.  #UA01   - Update new record for MMDELDPP                *
      *  10.  #UB01   - Update new record for DEALSDC                 *
      *  11.  #WA01   - Write new record for MMDELDPP                 *
      *  12.  #WB01   - Write new record for DEALSDC                  *
      *  13.  #WC01   - Write new record for DTRIXDD                  *
      *  14.  ZA0660  - Convert 8 digit date to DDMMMYY format        *
      *  15.  ZA0680  - Convert 8 digit date (yyyymmdd) to day no.    *
      *  16.  ZA0710  - Convert day no. to 8 digit date (yyyymmdd)    *
      *  17.  ZA0830  - Check holiday routine                         *
      *  18.  #ZZ01   - Initialization routine                        *
      *  20.  #ZZ20   - End-program routine                           *
      *                                                               *
      ********************************************************************
      /EJECT
      ********************************************************************
      *
     C                     MOVEACPY@      BIS@   80
      *
     C                     CALL 'AOSARDR0'
     C                     PARM *BLANKS   @RTCD
     C                     PARM '*VERIFY' @OPTN
     C                     PARM 'CDL016'  @SARD
     C           SCSARD    PARM SCSARD    DSFDY
      *
     C           @RTCD     IFNE *BLANK
     C                     MOVEL*ON       *INLR
     C                     RETRN
     C                     ENDIF
      *
     C                     OPEN DL5350P1
     C                     OPEN DL5350P2                                                     BUG4069
      *                                                                                      BUG8231
     C**********           Z-ADD1         X       30                                  BUG8231 243473
     C                     Z-ADD5         X       40                                          243473
      *                                                                                      BUG8231
     C/COPY WNCPYSRC,DLH00424
      *
      ** CALL ACCESS PROGRAM FOR TRADING DATA DETAILS
     C                     CALL 'AOTRADR0'
     C                     PARM '*MSG    '@RTCD
     C                     PARM '*FIRST  '@OPTN
     C           @TRAD     PARM @TRAD     DSFDY
      *
     C           @RTCD     IFNE *BLANK
     C                     MOVEL'SDTRADPD'DBFILE            *************
     C                     Z-ADD31        DBASE             *DBERROR 031*
     C                     EXSR DBERR                       *************
     C                     END
      *
      ** Access SAR Details file to see if GBO005 is switched on
      *
     C                     CALL 'AOSARDR0'
     C                     PARM *BLANKS   @RTCD
     C                     PARM '*VERIFY' @OPTN
     C                     PARM 'GBO005'  @SARD
     C           SCSARD    PARM SCSARD    DSFDY
      *
     C           @RTCD     IFEQ *BLANK
     C                     MOVEL*ON       *IN65
     C                     ELSE
     C                     MOVEL*OFF      *IN65
     C                     ENDIF
      *
      ** Access SAR Details file to see if GBO011 is switched on
      *
     C                     CALL 'AOSARDR0'
     C                     PARM *BLANKS   @RTCD
     C                     PARM '*VERIFY' @OPTN
     C                     PARM 'GBO011'  @SARD
     C           SCSARD    PARM SCSARD    DSFDY
      *
     C           @RTCD     IFEQ *BLANK
     C                     MOVEL*ON       *IN66
     C                     ELSE
     C                     MOVEL*OFF      *IN66
     C                     ENDIF
      *
      ** Access SAR Details file to see if User Defined Confirmations
      ** is switched on
      *
     C                     CALL 'AOSARDR0'
     C                     PARM *BLANKS   @RTCD
     C                     PARM '*VERIFY' @OPTN
     C                     PARM 'AUS009'  @SARD   6
     C           SCSARD    PARM SCSARD    DSFDY
      *
     C           @RTCD     IFNE *BLANK
     C           @RTCD     ANDNE'*NRF   '
     C                     MOVEL'SCSARDPD'DBFILE           **************
     C                     Z-ADD22        DBASE            * DBERROR 22 *
     C                     MOVEL'DFDR10'  DBKEY            **************
     C                     EXSR DBERR
     C                     END
      *
     C           @RTCD     IFEQ *BLANK
     C                     MOVEL'Y'       DFDR10  1
     C                     MOVEL'AUTO '   AUTO1
     C                     MOVEL'TRANSMIS'AUTO2
     C                     MOVEL'SION DO 'AUTO3
     C                     MOVEL'NOT SEND'AUTO4
     C                     END
      *                                                                                      BUG3838
      ** Access SAR Details file to see if CLE025 is switched on                             BUG3838
      *                                                                                      BUG3838
     C                     CALL 'AOSARDR0'                                                   BUG3838
     C                     PARM *BLANKS   @RTCD                                              BUG3838
     C                     PARM '*VERIFY' @OPTN                                              BUG3838
     C                     PARM 'CLE025'  @SARD                                              BUG3838
     C           SCSARD    PARM SCSARD    DSFDY                                              BUG3838
      *                                                                                      BUG3838
     C           @RTCD     IFEQ *BLANK                                                       BUG3838
     C                     MOVEL'Y'       CLE025  1                                          BUG3838
     C                     ELSE                                                              BUG3838
     C                     MOVEL'N'       CLE025                                             BUG3838
     C                     ENDIF                                                             BUG3838
      *                                                                                       259376
      ** Use Access Program to read the module details file                                   259376
      *                                                                                       259376
     C                     CALL 'AOMMODR0'                                                    259376
     C                     PARM '*MSG    '@RTCD                                               259376
     C                     PARM '*FIRST  '@OPTN                                               259376
     C           SDMMOD    PARM SDMMOD    DSFDY                                               259376
     C*                                                                                       259376
     C           @RTCD     IFNE *BLANK                                                        259376
     C                     MOVE '101'     DBASE            ***************                    259376
     C                     MOVEL'*FIRST ' DBKEY            *DB ERROR 101 *                    259376
     C                     MOVEL'AOMMODPD'DBFILE           ***************                    259376
     C                     EXSR DBERR                                                         259376
     C                     ENDIF                                                              259376
      *                                                                                       259376
      ** Access SAR Details file to see if CCG015 is switched on                              259376
      *                                                                                       259376
     C                     CALL 'AOSARDR0'                                                    259376
     C                     PARM *BLANKS   @RTCD                                               259376
     C                     PARM '*VERIFY' @OPTN                                               259376
     C                     PARM 'CCG015'  @SARD                                               259376
     C           SCSARD    PARM SCSARD    DSFDY                                               259376
      *                                                                                       259376
     C           @RTCD     IFEQ *BLANK                                                        259376
     C                     MOVEL'Y'       CCG015  1                                           259376
     C                     ELSE                                                               259376
     C                     MOVEL'N'       CCG015                                              259376
     C                     ENDIF                                                              259376
      *                                                                                      CER016A
      ** Call AOSARDR0 to check for CER016                                                   CER016A
      *                                                                                      CER016A
     C                     CALL 'AOSARDR0'                                                   CER016A
     C                     PARM *BLANKS   PRTCD   7                                          CER016A
     C                     PARM '*VERIFY' POPTN   7                                          CER016A
     C                     PARM 'CER016'  PSARD   6                                          CER016A
     C           SCSARD    PARM SCSARD    DSFDY                                              CER016A
      *                                                                                      CER016A
     C           PRTCD     IFEQ *BLANKS                                                      CER016A
     C                     MOVE 'Y'       CER016  1                                          CER016A
     C                     ENDIF                                                             CER016A
      *                                                                                      CER016A
     C           PRTCD     IFNE *BLANKS                                                      CER016A
     C           PRTCD     ANDNE'*NRF   '                                                    CER016A
     C           *LOCK     IN   LDA                                                          CER016A
     C                     MOVEL'CER016'  DBKEY                                              CER016A
     C                     MOVEL'SCSARDPD'DBFILE                                             CER016A
     C                     Z-ADD98        DBASE                                              CER016A
     C                     OUT  LDA                                                          CER016A
     C                     EXSR *PSSR                                                        CER016A
      *                                                                                      CER016A
     C                     ENDIF                                                             CER016A
     C/COPY WNCPYSRC,DLH00081
      *
      *                                                                                       259376
     C                     CALL 'AOSARDR0'                                                    CGL165
     C                     PARM *BLANKS   @RTCD                                               CGL165
     C                     PARM '*VERIFY' @OPTN                                               CGL165
     C                     PARM 'CGL165'  @SARD                                               CGL165
     C           SCSARD    PARM SCSARD    DSFDY                                               CGL165
      *                                                                                       CGL165
     C           @RTCD     IFEQ *BLANK                                                        CGL165
     C                     MOVEL'Y'       CGL165  1                                           CGL165
     C                     ELSE                                                               CGL165
     C                     MOVEL'N'       CGL165                                              CGL165
     C                     ENDIF                                                              CGL165
      ** Get Rollover details from System Values
      *
     C                     MOVE *OFF      *IN98
      *
     C                     CALL 'AOSVALR0'
     C                     PARM *BLANKS   @RTCD
     C                     PARM SVAL,1    P@OP01 20
     C                     PARM *BLANKS   P@VL01200
     C                     PARM SVAL,2    P@OP02 20
     C                     PARM *BLANKS   P@VL02200
     C                     PARM *BLANKS   P@OP03 20
     C                     PARM *BLANKS   P@VL03200
     C                     PARM *BLANKS   P@OP04 20
     C                     PARM *BLANKS   P@VL04200
     C                     PARM *BLANKS   P@OP05 20
     C                     PARM *BLANKS   P@VL05200
     C                     PARM *BLANKS   P@OP06 20
     C                     PARM *BLANKS   P@VL06200
     C                     PARM *BLANKS   P@OP07 20
     C                     PARM *BLANKS   P@VL07200
     C                     PARM *BLANKS   P@OP08 20
     C                     PARM *BLANKS   P@VL08200
     C                     PARM *BLANKS   P@OP09 20
     C                     PARM *BLANKS   P@VL09200
     C                     PARM *BLANKS   P@OP10 20
     C                     PARM *BLANKS   P@VL10200
      *
     C           @RTCD     IFNE *BLANKS
     C                     MOVEL'SDSVALPD'DBFILE
     C                     MOVEL'*KEY   ' DBKEY
     C                     Z-ADD900       DBASE
     C                     EXSR DBERR
     C                     ELSE
      *
      ** Save value of 'Automatic Authorisation' and 'Rollover days'
     C                     Z-ADD0         ROLDAY  20
     C                     MOVELP@VL01    AUTOAU  1
     C                     MOVELP@VL02    ROLDNU  2
     C                     MOVE ROLDNU    ROLDAY
     C                     ENDIF
      *
      **  Get Midas run date and next working date from ICD table
      *
     C                     EXSR #ZZ01
      *                                                                                      BUG3838
      * Default Generate Authorized Deal                                                     BUG3838
      * Generating non-authorized deals requires one extra days notice                       BUG3838
      *                                                                                      BUG3838
     C           AUTOAU    IFEQ 'Y'                                                          BUG3838
     C           BNMMAU    OREQ 'N'                                                          BUG3838
     C                     MOVEL'Y'       DGAUTH  1                                          BUG3838
     C                     ELSE                                                              BUG3838
     C                     MOVEL'N'       DGAUTH  1                                          BUG3838
     C                     ADD  1         ROLDAY                                             BUG3838
     C                     ENDIF                                                             BUG3838
      *
     C                     MOVE *OFF      *IN40
     C                     WRITEDL5350R0
     C                     WRITEDL5350R1
      *
      ****Read*LF/DLDLDCL1*sequentially*(first read)                                         BUG3850
      ****Read*LF/DLDLHGL1*sequentially*(first read)                                 BUG3850 BUG4475
      **  Read LF/DEALSL4 sequentially (first read)                                          BUG4475
      *
     C********** *LOVAL    SETLLDLDLDCL1                                                     BUG3850
     C********** *LOVAL    SETLLDLDLHGL1                                             BUG3850 BUG4475
     C           *LOVAL    SETLLDEALSL4                                                      BUG4475
     C                     EXSR #RA01
      *
      ****Until*end*of*LF/DLDLDCL1*or*any*error*occurrence,*process                          BUG3850
      ****Until*end*of*LF/DLDLHGL1*or*any*error*occurrence,*process                  BUG3850 BUG4475
      **  Until end of LF/DEALSL4 or any error occurrence, process                           BUG4475
      **  previously read record and read next one
      *
     C           *IN71     DOWEQ'0'                        Do
      *
     C                     EXSR #BA01
     C                     EXSR #RA01
      *
     C                     END                             End Do
      *
     C                     EXSR #ZZ20
      *
     C           REPORT    IFNE 'Y'
     C                     WRITEDL5350R5
     C                     ENDIF
      *
     C                     WRITEDL5350R3
     C                     CLOSEDL5350P1
     C                     CLOSEDL5350P2                                                     BUG4069
      *
      **  Return to the calling program
      *
     C                     SETON                     LR
     C                     RETRN
      *
     C********************************************************************
      /EJECT
      ********************************************************************
     C           #BA01     BEGSR                           ** #BA01  **
      *
      **  If skip-record indicator is on, do not process it
      *
     C           *IN73     IFEQ '1'
     C                     GOTO #BA09
     C                     END
      *
      **  Set up record for MMDELDPP
      *
     C                     EXSR #WA01
      *
      **  In case of write error, roll back this write
      *
     C           *IN72     IFEQ '1'
     C           *LOCK     IN   LDA
     C                     MOVEL'MMDELDPP'DBFILE
     C                     MOVEL@OLDDL    DBKEY
     C                     Z-ADD1         DBASE
     C                     EXSR DBERR
     C                     END
      *
      **  Set up record for DEALSDC
      **  if generate authorized deal                                                        BUG3838
      *                                                                                      BUG3838
     C           GAUTH     IFEQ 'Y'                                                          BUG3838
      *
     C                     EXSR #WB01
      **  In case of write error, roll back this & previous write
      *
     C           *IN72     IFEQ '1'
     C           *LOCK     IN   LDA
     C                     MOVEL'DEALSDC 'DBFILE
     C                     MOVELDLNO      DBKEY
     C                     Z-ADD2         DBASE
     C                     EXSR DBERR
     C                     END
      *
      **  Set up record for DTRIXDD
      *
     C                     EXSR #WC01
      *
      **  In case of write error, roll back this & previous writes
      *
     C           *IN72     IFEQ '1'
     C           *LOCK     IN   LDA
     C                     MOVEL'DTRIXDD 'DBFILE
     C                     MOVELDLNO      DBKEY
     C                     Z-ADD3         DBASE
     C                     EXSR DBERR
     C                     END
      *                                                                                      BUG3838
     C                     END                                                               BUG3838
      *
      **  Set report fields values
      *
     C                     MOVE HKCNUM    S1CNUM
     C                     MOVE HKORBR    S1ORBR
     C                     MOVE HKDN38    S1DLNO
     C                     MOVE HKMTYP    S1DTYP
     C                     MOVE HKSTYP    S1DLST
     C                     MOVE HKCLAS    S1CLAS                                              CDL038
      *
     C                     Z-ADD@NVDAT    ZDAYNO
     C                     EXSR ZDATE2
     C                     MOVE ZADATE    S1VDAT
      *
     C                     Z-ADD@NMDAT    ZDAYNO
     C                     EXSR ZDATE2
     C                     MOVE ZADATE    S1MDAT
      *
     C                     MOVE HKCCY     S1CCY
      *
     C                     MOVE *ALL'0'   ZFIELD
     C                     MOVE *BLANKS   S1AMNT
     C           HKAMNP    IFLT 0                                                            246498
     C           HKAMNP    MULT -1        WRKAMT 150                                         246498
     C                     MOVE WRKAMT    ZFIELD                                             246498
     C                     ELSE                                                              246498
     C                     MOVE HKAMNP    ZFIELD
     C                     ENDIF                                                             246498
     C                     MOVE A6NBDP    ZADEC
     C                     EXSR ZEDIT
     C                     MOVE ZFIELD    S1AMNT
      *                                                                                      BUG8231
      ** Save Details in Array                                                               BUG8231
      *                                                                                      BUG8231
     C********** X         IFLE 999                                                          BUG8231
      *                                                                               BUG8231 243473
     C           X         OCUR MULT                                                         BUG8231
     C                     Z-ADDHKAMNP    TAMNP                                              BUG8231
      *                                                                                      BUG8231
     C                     ADD  1         X                                                  BUG8231
      *                                                                                      BUG8231
     C**********           ELSE                                                       BUG8231 243473
     C********** *LOCK     IN   LDA                                                   BUG8231 243473
     C**********           MOVELX         DBKEY                                       BUG8231 243473
     C**********           MOVE 'ARRAY   'DBFILE           ***************            BUG8231 243473
     C**********           Z-ADD23        DBASE            *DB ERROR 23  *            BUG8231 243473
     C**********           OUT  LDA                        ***************            BUG8231 243473
     C**********           EXSR *PSSR                                                 BUG8231 243473
     C**********           ENDIF                                                      BUG8231 243473
      *
     C                     MOVE HKPRFC    S1PCEN
     C                     MOVE HKBRCA    S1BRCA
     C                     MOVE HKDADN    S1ODLN                                             BUG3850
      *                                                                                      BUG3850
     C                     MOVE *ALL'0'   ZFIELD                                             BUG3850
     C                     MOVE *BLANKS   S1IRAT                                             BUG3850
     C                     MOVE HKINTR    ZFIELD                                             BUG3850
     C                     Z-ADD7         ZADEC                                              BUG3850
     C                     EXSR ZEDIT                                                        BUG3850
     C                     MOVE ZFIELD    S1IRAT                                             BUG3850
      *                                                                                      BUG3850
     C                     MOVE HKCSNM    S1CSNM                                             BUG3850
     C                     MOVE HKMOPM    S1MOPM                                             BUG7887
     C                     MOVELHKMOPI    S1MOPI                                             BUG7887
     C                     MOVE HKBLKA    S1BLKA                                             BUG7887
     C                     MOVE HKROLI    S1ROLI                                             BUG7887
      *
      **  Check for overflow report indicator and write detail line
      *
     C                     MOVE *OFF      *IN40
      *
     C                     WRITEDL5350R2
      *
     C           *IN10     IFEQ '1'
     C                     WRITEDL5350R0
     C                     WRITEDL5350R1
     C                     MOVE '0'       *IN10
     C                     ENDIF
      *                                                                                      BUG4069
      **  Set confirmation report fields values                                              BUG4069
      *                                                                                      BUG4069
     C                     SETOF                     303132                                  BUG4069
     C                     SETOF                     33                                      BUG4069
      *                                                                                      BUG4069
      ** Header                                                                              BUG4069
     C                     SELEC                                                             BUG4069
     C           HKMTYP    WHEQ 'TD'                                                         BUG4069
     C                     MOVE '1'       *IN30                                              BUG4069
     C           HKMTYP    WHEQ 'TI'                                                         BUG4069
     C                     MOVE '1'       *IN31                                              BUG4069
     C           HKMTYP    WHEQ 'IT'                                                         BUG4069
     C                     MOVE '1'       *IN32                                              BUG4069
     C           HKMTYP    WHEQ 'IP'                                                         BUG4069
     C                     MOVE '1'       *IN33                                              BUG4069
     C                     ENDSL                                                             BUG4069
      *                                                                                      BUG4069
     C                     MOVE @BRNM     R1BRNM                                             BUG4069
     C                     MOVE BKNM      R1BKNM                                             BUG4069
      *                                                                                      BUG4069
     C                     MOVE HKCNUM    R1CNUM                                             BUG4069
     C                     MOVE HKDN38    R1DLNO                                             BUG4069
      *                                                                                      BUG4069
     C                     Z-ADD@NVDAT    ZDAYNO                                             BUG4069
     C                     EXSR ZDATE2                                                       BUG4069
     C                     MOVE ZADATE    R1VDAT                                             BUG4069
      *                                                                                      BUG4069
     C                     Z-ADD@NMDAT    ZDAYNO                                             BUG4069
     C                     EXSR ZDATE2                                                       BUG4069
     C                     MOVE ZADATE    R1MDAT                                             BUG4069
      *                                                                                      BUG4069
     C                     MOVE HKCCY     R1CCY                                              BUG4069
      *                                                                                      BUG4069
      ***Principal********                                                           BUG4069 BUG4847
     C******************** MOVE *ALL'0'   ZFIELD                                     BUG4069 BUG4847
     C******************** MOVE *BLANKS   R1AMNT                                     BUG4069 BUG4847
     C******************** MOVE HKAMNP    ZFIELD                                     BUG4069 BUG4847
     C******************** MOVE A6NBDP    ZADEC                                      BUG4069 BUG4847
     C******************** EXSR ZEDIT                                                BUG4069 BUG4847
     C******************** MOVE ZFIELD    R1AMNT                                     BUG4069 BUG4847
      ********************                                                           BUG4069 BUG4847
      ***Interest*Rate****                                                           BUG4069 BUG4847
     C******************** MOVE *ALL'0'   ZFIELD                                     BUG4069 BUG4847
     C******************** MOVE *BLANKS   R1IRAT                                     BUG4069 BUG4847
     C******************** MOVE HKINTR    ZFIELD                                     BUG4069 BUG4847
     C******************** Z-ADD7         ZADEC                                      BUG4069 BUG4847
     C******************** EXSR ZEDIT                                                BUG4069 BUG4847
     C******************** MOVE ZFIELD    R1IRAT                                     BUG4069 BUG4847
      ********************                                                           BUG4069 BUG4847
      ***Total Interest***                                                           BUG4069 BUG4847
     C******************** MOVE *ALL'0'   ZFIELD                                     BUG4069 BUG4847
     C******************** MOVE *BLANKS   R1MTTI                                     BUG4069 BUG4847
     C******************** MOVE HKMTTI    ZFIELD                                     BUG4069 BUG4847
     C******************** MOVE A6NBDP    ZADEC                                      BUG4069 BUG4847
     C******************** EXSR ZEDIT                                                BUG4069 BUG4847
     C******************** MOVE ZFIELD    R1MTTI                                     BUG4069 BUG4847
      ********************                                                           BUG4069 BUG4847
      ***Include*Tax******                                                           BUG4069 BUG4847
      ********************                                                           BUG4069 BUG4847
     C************IN87**** IFEQ *ON                                                  BUG4069 BUG4847
      ********************                                                           BUG4069 BUG4847
      ***Tax*Amount*******                                                           BUG4069 BUG4847
     C******************** MOVE *ALL'0'   ZFIELD                                     BUG4069 BUG4847
     C******************** MOVE *BLANKS   R1TAXA                                     BUG4069 BUG4847
     C******************** MOVE @TAXA     ZFIELD                                     BUG4069 BUG4847
     C******************** MOVE A6NBDP    ZADEC                                      BUG4069 BUG4847
     C******************** EXSR ZEDIT                                                BUG4069 BUG4847
     C******************** MOVE ZFIELD    R1TAXA                                     BUG4069 BUG4847
      ********************                                                           BUG4069 BUG4847
      ***Total*Amount*****                                                           BUG4069 BUG4847
     C******************** MOVE *ALL'0'   ZFIELD                                     BUG4069 BUG4847
     C******************** MOVE *BLANKS   R1TOT                                      BUG4069 BUG4847
     C******************** MOVE @TAMT     ZFIELD                                     BUG4069 BUG4847
     C******************** MOVE A6NBDP    ZADEC                                      BUG4069 BUG4847
     C******************** EXSR ZEDIT                                                BUG4069 BUG4847
     C******************** MOVE ZFIELD    R1TOT                                      BUG4069 BUG4847
      ********************                                                           BUG4069 BUG4847
     C******************** ELSE                                                      BUG4069 BUG4847
      ********************                                                           BUG4069 BUG4847
      ***Tax*Amount*******                                                           BUG4069 BUG4847
     C******************** MOVE *BLANKS   R1TAXA                                     BUG4069 BUG4847
      ********************                                                           BUG4069 BUG4847
      ***Total*Amount*****                                                           BUG4069 BUG4847
     C******************** MOVE *ALL'0'   ZFIELD                                     BUG4069 BUG4847
     C******************** MOVE *BLANKS   R1TOT                                      BUG4069 BUG4847
     C******************** MOVE AMT1      ZFIELD                                     BUG4069 BUG4847
     C******************** MOVE A6NBDP    ZADEC                                      BUG4069 BUG4847
     C******************** EXSR ZEDIT                                                BUG4069 BUG4847
     C******************** MOVE ZFIELD    R1TOT                                      BUG4069 BUG4847
      ********************                                                           BUG4069 BUG4847
     C******************** ENDIF                                                     BUG4069 BUG4847
      *                                                                                      BUG4847
      ** Principal                                                                           BUG4847
     C                     Z-ADD*ZERO     ZFLD15                                             BUG4847
     C                     MOVE HKAMNP    ZFLD15                                             BUG4847
     C           ZFLD15    IFLT 0                                                            246498
     C                     MULT -1        ZFLD15                                             246498
     C                     ENDIF                                                             246498
     C                     MOVE A6NBDP    ZDECS                                              BUG4847
     C                     MOVE 'J'       ZECODE                                             BUG4847
     C                     EXSR ZSEDIT                                                       BUG4847
     C                     MOVE ZOUT21    R1AMNT                                             BUG4847
      *                                                                                      BUG4847
      ** Interest Rate                                                                       BUG4847
     C                     Z-ADD*ZERO     ZFLD15                                             BUG4847
     C                     MOVE HKINTR    ZFLD15                                             BUG4847
     C                     Z-ADD7         ZDECS                                              BUG4847
     C                     MOVE 'J'       ZECODE                                             BUG4847
     C                     EXSR ZSEDIT                                                       BUG4847
     C                     MOVE ZOUT21    R1IRAT                                             BUG4847
      *                                                                                      BUG4847
      ** Total Interest                                                                      BUG4847
     C                     Z-ADD*ZERO     ZFLD15                                             BUG4847
     C                     MOVE HKMTTI    ZFLD15                                             BUG4847
     C           ZFLD15    IFLT 0                                                            246498
     C                     MULT -1        ZFLD15                                             246498
     C                     ENDIF                                                             246498
     C                     MOVE A6NBDP    ZDECS                                              BUG4847
     C                     MOVE 'J'       ZECODE                                             BUG4847
     C                     EXSR ZSEDIT                                                       BUG4847
     C                     MOVE ZOUT21    R1MTTI                                             BUG4847
      *                                                                                      BUG4847
      ** Include Tax                                                                         BUG4847
      *                                                                                      BUG4847
     C           *IN87     IFEQ *ON                                                          BUG4847
      *                                                                                      BUG4847
      ** Tax Amount                                                                          BUG4847
     C                     Z-ADD*ZERO     ZFLD15                                             BUG4847
     C                     MOVE @TAXA     ZFLD15                                             BUG4847
     C                     MOVE A6NBDP    ZDECS                                              BUG4847
     C                     MOVE 'J'       ZECODE                                             BUG4847
     C                     EXSR ZSEDIT                                                       BUG4847
     C                     MOVE ZOUT21    R1TAXA                                             BUG4847
      *                                                                                      BUG4847
      ** Total Amount                                                                        BUG4847
     C                     Z-ADD*ZERO     ZFLD15                                             BUG4847
     C                     MOVE @TAMT     ZFLD15                                             BUG4847
     C                     MOVE A6NBDP    ZDECS                                              BUG4847
     C                     MOVE 'J'       ZECODE                                             BUG4847
     C                     EXSR ZSEDIT                                                       BUG4847
     C                     MOVE ZOUT21    R1TOT                                              BUG4847
      *                                                                                      BUG4847
     C                     ELSE                                                              BUG4847
      *                                                                                      BUG4847
      ** Tax Amount                                                                          BUG4847
     C                     MOVE *BLANKS   R1TAXA                                             BUG4847
      *                                                                                      BUG4847
      ** Total Amount                                                                        BUG4847
     C                     Z-ADD*ZERO     ZFLD15                                             BUG4847
     C                     MOVE AMT1      ZFLD15                                             BUG4847
     C                     MOVE A6NBDP    ZDECS                                              BUG4847
     C                     MOVE 'J'       ZECODE                                             BUG4847
     C                     EXSR ZSEDIT                                                       BUG4847
     C                     MOVE ZOUT21    R1TOT                                              BUG4847
      *                                                                                      BUG4847
     C                     ENDIF                                                             BUG4847
      * Add asterixs                                                                         BUG4847
     C                     MOVEL*BLANK    NUM                                                BUG4847
     C                     MOVEAR1AMNT    NUM                                                BUG4847
     C                     EXSR EDITFL                                                       BUG4847
     C                     MOVEANUM       R1AMNT                                             BUG4847
      *                                                                                      BUG4847
     C                     MOVEL*BLANK    NUM                                                BUG4847
     C                     MOVEAR1IRAT    NUM                                                BUG4847
     C                     EXSR EDITFL                                                       BUG4847
     C                     MOVEANUM       R1IRAT                                             BUG4847
      *                                                                                      BUG4847
     C                     MOVEL*BLANK    NUM                                                BUG4847
     C                     MOVEAR1MTTI    NUM                                                BUG4847
     C                     EXSR EDITFL                                                       BUG4847
     C                     MOVEANUM       R1MTTI                                             BUG4847
      *                                                                                      BUG4847
     C                     MOVEL*BLANK    NUM                                                BUG4847
     C                     MOVEAR1TAXA    NUM                                                BUG4847
     C                     EXSR EDITFL                                                       BUG4847
     C                     MOVEANUM       R1TAXA                                             BUG4847
      *                                                                                      BUG4847
     C                     MOVEL*BLANK    NUM                                                BUG4847
     C                     MOVEAR1TOT     NUM                                                BUG4847
     C                     EXSR EDITFL                                                       BUG4847
     C                     MOVEANUM       R1TOT                                              BUG4847
      *                                                                                      BUG4069
      ** Remarks - Title & Rollover Deal No.                                                 BUG4069
     C                     MOVE UGTTLE    R1DESC                                             BUG4069
     C                     MOVE RODN      R1RODN                                             BUG4069
      *                                                                                      BUG4069
      ** Customer Name & Address                                                             BUG4069
     C                     MOVELBBCNA1    R1CNA1                                             BUG4069
     C                     MOVELBBCNA2    R1CNA2                                             BUG4069
     C                     MOVELBBCNA3    R1CNA3                                             BUG4069
     C                     MOVELBBCNA4    R1CNA4                                             BUG4069
      *                                                                                      BUG4069
      ** Bank to bank Information                                                            BUG7887
      *                                                                                      BUG7887
     C                     MOVELHKBTB1    R1BTB1                                             BUG7887
     C                     MOVELHKBTB2    R1BTB2                                             BUG7887
     C                     MOVELHKBTB3    R1BTB3                                             BUG7887
     C                     MOVELHKBTB4    R1BTB4                                             BUG7887
     C                     MOVELHKBTB5    R1BTB5                                             BUG7887
     C                     MOVELHKBTB6    R1BTB6                                             BUG7887
      *                                                                                      BUG7887
     C                     WRITEDL5350C1                                                     BUG4069
      *
      **  Update old record for MMDELDPP
      *
     C                     EXSR #UA01
      *
      **  In case of update error, roll back this update & prev. writes
      *
     C           *IN72     IFEQ '1'
     C           *LOCK     IN   LDA
     C                     MOVEL'MMDELDPP'DBFILE
     C                     MOVELHKDN38    DBKEY
     C                     Z-ADD4         DBASE
     C                     EXSR DBERR
     C                     END
      *
      **  Update old record for DEALSDC
      **  if generate authorized deal                                                        BUG3838
      *                                                                                      BUG3838
     C           GAUTH     IFEQ 'Y'                                                          BUG3838
      *
     C                     EXSR #UB01
      *
      **  In case of update error, roll back this update & prev. writes
      *
     C           *IN72     IFEQ '1'
     C           *LOCK     IN   LDA
     C                     MOVEL'DEALSDC 'DBFILE
     C                     MOVELDLNO      DBKEY
     C                     Z-ADD5         DBASE
     C                     EXSR DBERR
     C                     ELSE
      *
      **  Setoff all field level indicators
      *
     C                     SETOF                     404142
     C                     SETOF                     43
      *
     C                     END
      *                                                                                      BUG3838
     C                     END                                                               BUG3838
      *
     C                     MOVE 'Y'       REPORT
     C                     COMIT                                                             BUG4847
      *
     C           #BA09     ENDSR
      ********************************************************************
      /EJECT                                                                                 BUG4847
      ********************************************************************                   BUG4847
     C           EDITFL    BEGSR                                                             BUG4847
     C                     Z-ADD1         NB      20                                         BUG4847
     C                     Z-ADD1         NX      20                                         BUG4847
     C           *BLANK    LOKUPNUM,NB               99    *                                 BUG4847
     C           NX        DOWLTNB                                                           BUG4847
     C                     MOVE '*'       NUM,NX                                             BUG4847
     C                     ADD  1         NX                                                 BUG4847
     C                     ENDDO                                                             BUG4847
     C                     ENDSR                                                             BUG4847
      ********************************************************************                   BUG4847
      /EJECT
      ********************************************************************
     C           DBERR     BEGSR                           ** DBERR  **
      *
     C                     MOVEL@PGM      DBPGM
     C                     OUT  LDA
     C                     SETON                     U7U8LR
     C                     WRITEDL5350R4
     C                     CLOSEDL5350P1
     C                     CLOSEDL5350P2                                                     BUG4069
     C                     RETRN
      *
     C                     ENDSR
      *****************************************************************
      /EJECT
      *****************************************************************
      *
      * MM1004 - CALCULATE THE NEXT INTEREST PAYMENT DATE
      *
      * CALLED BY :
      *
      * CALLS :  ZA0830, A COMMON ROUTINE TO DETERMINE WHETHER A DATE
      *          IS A WORKING DAY OR A HOLIDAY.
      *       :  ZA0680, A COMMON ROUTINE TO CONVERT DATE IN YYYYMMDD
      *          FORMAT TO MIDAS DAY NUMBER.
      *       :  ZA0710, A COMMON ROUTINE TO CONVERT MIDAS DAY NUMBER
      *          TO DATE FORMAT OF YYYYMMDD.
      *
      * INPUT  : @@STRT START DATE                           (8N)
      *          @@FREQ PAYMENT FREQUENCY                    (1A)
      *          @@CCY  CURRENCY CODE                        (3A)
      *          @@MDAY INTEREST PAYMENT DAY IN THE MONTH    (2N)
      *          @@MDAT MATURITY DATE                        (8N)
      *
      * OUTPUT : @@NDAT NEXT PAYMENT DATE (MIDAS DAY NUMBER) (8N)
      *
      * USES :   @@DTIN DATE PASSED TO           SR ZA0680   (8N)
      *          @@MDNO MIDAS DAY NUMBER FROM    SR ZA0680   (5N)
      *          @@MNO  DAY NUMBER PASSED TO     SR ZA0830   (5N)
      *          @@HIND HOLIDAY/WORKING DAY IND. SR ZA0830   (1A)
      *          @@DAYN DAY NUMBER PASSED TO     SR ZA0710   (5N)
      *          @@VDT  DATE IN FORMAT YYYYMMDD  SR ZA0710   (8N)
      *          @@DNO  WORK FIELD - DAY NUMBER              (5N)
      *          @@CCY  CURRENCY CODE                        (3A)
      *          @@WF16 WORK FIELD - # DAYS IN THE MONTH     (2N)
      *          @@HWIN WORK FIELD - HOLIDAY/WORK INDICATOR  (1A)
      *          @@WKDT WORK FIELDS DS TO MANIPULATE DATE    (8N)
      *          @@WKYY WORK FIELDS DS  - YEAR FIELD YYYY    (4N)
      *          @@WKY  WORK FIELDS DS  - YEAR FIELD   YY    (2N)
      *          @@WKM  WORK FIELDS DS  - MONTH FIELD        (2N)
      *          @@WKD  WORK FIELDS DS  - DAY FIELD          (2N)
      *          @@WKD2 WORK FIELDS - MAXIMUM DAYS IN MONTH  (2N)
      *          @@REM2 LEAP YEAR CALCS - REMAINDER FIELD    (3N)
      *
      ********************************************************************
     C           MM1004    BEGSR
      *
      ** Re-set the indicators used within this subroutine.
     C                     MOVE '0'       *IN80
     C                     MOVE '0'       *IN82
      *
      ** Move the start date input into a working fields DS.
     C                     MOVE @@STRT    @@WKDS
      *
      ** IF     the interest payment day in month is blank
      **        THEN     substitue day from start date into that field.
      ** END
      *
     C           @@MDAY    IFEQ 0
     C                     Z-ADD@@WKD     @@MDAY  20
     C                     END
      *
      ** IF     the payment frequency is blank
      **        THEN next interest date is set to maturity date
      ** END
      *
     C           @@FREQ    IFEQ *BLANK
     C                     Z-ADD@@MDAT    @@NDAT
     C                     GOTO M10049
     C                     END
     C/COPY WNCPYSRC,DLH00326
      *
      ** IF     the payment frequency is monthly
      **        THEN     increment the month by 1.
      ** END
     C           @@FREQ    IFEQ 'M'
     C                     ADD  1         @@WKM
     C                     END
      *
      ** IF     the payment frequency is quarterly.
      **        THEN     increment the month by 3.
      ** END
     C           @@FREQ    IFEQ 'Q'
     C                     ADD  3         @@WKM
     C                     END
      *
      ** IF     the payment frequency is six-monthly
      **        THEN     increment the month by 6.
      ** END
     C           @@FREQ    IFEQ 'X'
     C                     ADD  6         @@WKM
     C                     END
      *
      ** IF     the payment frequency is yearly
      **        THEN     increment the year by 1.
      ** END
     C           @@FREQ    IFEQ 'Y'
     C                     ADD  1         @@WKYY
     C                     END
      *
      ** Substitute day in month into the day field.
      *
     C                     Z-ADD@@MDAY    @@WKD
      *
      ** IF     the new month now exceeds 12
      **        THEN     subtract 12 from the month
      **                 increment the year by 1
      ** END
      *
     C           @@WKM     IFGT 12
     C           @@WKM     SUB  12        @@WKM
     C                     ADD  1         @@WKYY
     C                     END
      *
      ** IF     the days now exceed the number of days for that month
      **        THEN     substitue the maximum # of days to that field
      **              IF     leap year and month is February
      **                     THEN     add an extra day to the day field
      **              END
      ** END
      *
     C                     MOVE @M,@@WKM  @@WKD2  20     80
     C           @@WKD     IFGT @@WKD2
     C                     Z-ADD@@WKD2    @@WKD            *1
      *
      ** Test for leap year, and turn of century leap year.
      ** NB: only every 400 years is a leap year.
     C           @@WKY     IFEQ 0
     C           @@WKYY    DIV  400       @@WF16  30
     C                     MVR            @@REM2  30     82
     C                     ELSE
     C           @@WKYY    DIV  4         @@WF16
     C                     MVR            @@REM2         82
     C                     END
      *
     C           *IN82     IFEQ '1'
     C           @@WKM     IFEQ 2
     C                     ADD  1         @@WKD
     C                     END
     C                     END
      *
     C                     END
      *
      ** Convert payment date to midas format.
      *
     C                     Z-ADD@@WKDT    @@DTIN
     C                     EXSR ZA0680
     C                     Z-ADD@@MDNO    @@DNO   50
      *
      ** DOWHILE     payment date is NOT a valid woking day
      **             increment the day number
      ** WEND
      *
     C           @@HWIN    DOUEQ'W'
     C                     Z-ADD@@DNO     ZDAYNO
     C                     EXSR ZCHKH
     C                     MOVE ZIND      @@HWIN  1
     C           @@HWIN    IFNE 'W'
     C                     ADD  1         @@DNO
     C                     END
     C                     END
      *
      ** Convert payment day number back to YYYYMMDD format.
      *
     C                     Z-ADD@@DNO     @@DAYN  50
     C                     EXSR ZA0710
     C                     Z-ADD@@VDT     @@NDAT  80
     C                     GOTO M10049
      *
      **  Unexecuted code to define fields
     C                     MOVEL@@FREQ    @@FREQ  1
     C                     MOVEL@@STRT    @@STRT  80
     C                     MOVEL@@MDAT    @@MDAT  80
     C                     MOVEL@@CCY     @@CCY   3
      *
     C           M10049    ENDSR
      *****************************************************************
      /EJECT
      *****************************************************************
      *                                                               *
      *   MM1009 - CALCULATE THE NUMBER OF INTEREST DAYS              *
      *                                                               *
      *  CALLED BY    -                                               *
      *                                                               *
      *  CALLS        -   ZA0710 CONVERT MIDAS DAY NUMBER TO YMD DATE *
      *                                                               *
      *  FIELDS INPUT @@BEG  - START DATE OF PERIOD                   *
      *               @@END  - END DATE OF PERIOD                     *
      *               @@CALC - INTEREST CALCULATION METHOD            *
      *                                                               *
      *  FIELDS OUTPUT @@INDY - NO. OF INTEREST DAYS                  *
      *                                                               *
      *  WORKFIELDS   @@WN5   - WORK FIELD 5N                         *
      *               @@WN5A  - WORK FIELD 5N                         *
      *               @@WDAT  - WORK FIELD 5N                         *
      *               @@DAYN  - WORK FIELD 5N                         *
      *               @@P1    - WORK FIELD 5N                         *
      *               @@P2    - WORK FIELD 5N                         *
      *               @@P3    - WORK FIELD 5N                         *
      *               @@LPNM  - WORKFIELD USED IN SETTING UP @@TG10   *
      *                                                               *
      *****************************************************************
     C           MM1009    BEGSR
      *
     C                     MOVE @@BEG     @@BEG   50
     C                     MOVE @@END     @@END   50
     C                     MOVE @@CALC    @@CALC  1
     C                     Z-ADD*ZEROS    @@INDY
     C                     Z-ADD*ZEROS    @@LPNM
      *
      *  FIND NUMBER OF DAYS DIFFERENCE BETWEEN DATES
      *
     C           @@END     SUB  @@BEG     @@WDAT  50
      **
      *    FOR CALCULATION METHODS 3,4 OR 5.
      **
     C           @@CALC    IFEQ '3'
     C           @@CALC    OREQ '4'
     C           @@CALC    OREQ '5'
     C           @@CALC    OREQ '0'                                                          CER016A
      *
     C                     Z-ADD@@BEG     @@DAYN  50
     C                     EXSR ZA0710
     C                     Z-ADD@@VDT     @@DATA
      *
     C                     Z-ADD@@END     @@DAYN
     C                     EXSR ZA0710
     C                     Z-ADD@@VDT     @@DATB
      *  IF IN SAME MONTH
     C           @@YY1     IFEQ @@YY2
     C           @@MM1     IFEQ @@MM2
     C           @@DD2     SUB  @@DD1     @@INDY
     C                     GOTO M10099
     C                     END
     C                     END
      *
     C                     ELSE
      * IF NOT 3,4 OR 5    ****
      * EXIT PROCESSING
     C                     Z-ADD@@WDAT    @@INDY  50
     C                     GOTO M10099
     C                     END
      *
     C           @@CALC    IFEQ '3'
     C           @@CALC    OREQ '0'                                                          CER016A
      *  CALC NO. DAYS IN FIRST MONTH
     C********** @@MM1     IFNE 2                                                            CER016A
     C********** 30        SUB  @@DD1     @@P1    50   80                                    CER016A
      ***IF*<*0,*INITIALISE*TO*0                                                             CER016A
     C***80*****           Z-ADD*ZEROS    @@P1                                               CER016A
      *
     C**********           ELSE                                                              CER016A
     C           @@CALC    IFEQ '3'                                                          CER016A
     C           @@CALC    OREQ '0'                                                          CER016A
     C           CER016    ANDEQ'N'                                                          CER016A
      *                                                                                      CER016A
     C           @@MM1     IFEQ 2                                                            CER016A
      *  TEST IF LEAP      ****
      *  YEAR
     C           @@YY1     DIV  4         @@WN5
     C                     MVR            @@WN5          80
      *
     C           *IN80     IFEQ '1'
     C           @@DD1     IFEQ 29                                                           CER016A
     C********** 29        SUB  @@DD1     @@P1    50                                         CER016A
     C                     Z-ADD30        @@DD1                                              CER016A
     C                     END                                                               CER016A
     C                     ELSE
      *  IF NOT LEAP       ++++
     C           @@DD1     IFEQ 28                                                           CER016A
     C********** 28        SUB  @@DD1     @@P1    50                                         CER016A
     C                     Z-ADD30        @@DD1                                              CER016A
     C                     END                                                               CER016A
     C                     END                                                               CER016A
     C                     END
     C                     END
     C           30        SUB  @@DD1     @@P1    50   80                                    CER016A
      *                                                                                      CER016A
      ** IF < 0, INITIALISE TO 0                                                             CER016A
      *                                                                                      CER016A
     C   80                Z-ADD*ZEROS    @@P1                                               CER016A
      *  CALC. NO. DAYS IN LAST MONTH
     C           @@DD2     IFLE 30
     C                     Z-ADD@@DD2     @@P2    50
     C                     ELSE
      *                    ****
     C                     Z-ADD30        @@P2
     C                     END
      *  CALC NO. DAYS IN INTERVENING MONTHS
     C           @@YY2     IFEQ @@YY1
     C           @@MM2     SUB  @@MM1     @@P3    50
     C                     SUB  1         @@P3
     C                     MULT 30        @@P3
     C                     ELSE
      *                    ****
     C           @@YY2     SUB  @@YY1     @@P3
     C                     SUB  1         @@P3
     C                     MULT 360       @@P3
      *
      * FIND NO. OF MONTHS FOR THE TWO PARTIAL YEARS
     C           12        SUB  @@MM1     @@WN5A  50
     C                     MULT 30        @@WN5A
      *
     C           @@MM2     SUB  1         @@WN5
     C           @@WN5     MULT 30        @@WN5
      *  ACCUMULATE
     C           @@WN5A    ADD  @@WN5     @@WN5A
     C           @@P3      ADD  @@WN5A    @@P3
     C                     END
      *  FINAL SUM
      *
     C           @@P1      ADD  @@P2      @@INDY
     C                     ADD  @@P3      @@INDY
     C                     END
      *  FOR METHODS 4 AND 5
      *
     C           @@CALC    IFEQ '4'
     C           @@CALC    OREQ '5'
      *   CALCULATE NUMBER OF LEAP YEARS BETWEEN START AND END DATES
     C           @@MM1     IFLE 2
     C           @@YY1     DIV  4         @@WN5   50
     C                     MVR            @@WN5          80
      *  ADD 1 IF LEAP YEAR
     C   80                ADD  1         @@LPNM  50
     C                     END
      *  BYPASS IF YEARS ARE THE SAME
     C           @@YY1     IFEQ @@YY2
     C           @@WDAT    SUB  @@LPNM    @@INDY
     C                     GOTO M10099
     C                     END
      *  LOOP TO CALCULATE NO. LEAP YEARS
     C           @@YY1     DOWNE@@YY2
      *  INCREMENT START YEAR
     C                     ADD  1         @@YY1
      *
     C           @@YY1     IFEQ @@YY2
     C           @@MM2     IFGT 2
     C           @@YY2     DIV  4         @@WN5
     C                     MVR            @@WN5          80
      *  INCREMENT IF LEAP YEAR
     C   80                ADD  1         @@LPNM
     C                     END
     C           @@WDAT    SUB  @@LPNM    @@INDY
     C                     END
     C           @@YY1     IFNE @@YY2
     C           @@YY1     DIV  4         @@WN5
     C                     MVR            @@WN5          80
      *  ADD 1 IF LEAP YEAR
     C   80                ADD  1         @@LPNM
     C                     END
     C                     END
     C                     END
      *
     C           M10099    ENDSR                           ***M10099***
      *****************************************************************
      /EJECT
      *****************************************************************
      *   MM1030 - CALCULATE INTEREST                                 *
      *            (MM1030 INCLUDES ADJUSTMENT FOR ERROR IN DIVISION) *
      *                                                               *
      *   COPYRIGHT BIS BANKING SYSTEMS 1988. COMPANY CONFIDENTIAL    *
      *  CALLED BY    -                                               *
      *                                                               *
      *  CALLS        -   MM1009 CALCULATE NO. OF INTEREST DAYS       *
      *                                                               *
      *  FIELDS INPUT @@BEG  - START DATE OF PERIOD                   *
      *               @@END  - END DATE OF PERIOD                     *
      *               @@CALC - INTEREST CALCULATION METHOD            *
      *               @@AMT  - PRINCIPAL AMOUNT  15N                  *
      *               @@RATE - INTEREST RATE 11,7                     *
      *                                                               *
      *  FIELDS OUTPUT @@INTR - INTEREST 15,0                         *
      *                                                               *
      *                @@YEAR - (NUMBER OF DAYS IN YEAR) x 100        *
      *                ZZWRK1 - 30,9                                  *
      *                ZZWK2  - 30,9  (rename field, used in core SR) *
      *                                                               *
      *****************************************************************
     C           MM1030    BEGSR
      *
     C                     MOVE @@BEG     ZZBEG9  50                                          CDL093
     C                     MOVE @@END     ZZEND9  50                                          CDL093
      *   CALCULATE NUMBER OF INTEREST DAYS
     C                     EXSR MM1009
      *                                                                                       CDL093
     C           @@CALC    IFEQ '9'                                                           CDL093
      *                                                                                       CDL093
      ** Convert start date to YYYYMMDD format                                                CDL093
      *                                                                                       CDL093
     C                     Z-ADDZZBEG9    @@DAYN  50                                          CDL093
     C                     EXSR ZDATE9                                                        CDL093
     C                     Z-ADD@@VDT     ZZDATA  80                                          CDL093
     C                     Z-ADD@@YR      ZZYY1   40                                          CDL093
      *                                                                                       CDL093
      ** Convert end date to YYYYMMDD format                                                  CDL093
      *                                                                                       CDL093
     C                     Z-ADDZZEND9    @@DAYN                                              CDL093
     C                     EXSR ZDATE9                                                        CDL093
     C                     Z-ADD@@VDT     ZZDATB  80                                          CDL093
     C                     Z-ADD@@YR      ZZYY2   40                                          CDL093
      *                                                                                       CDL093
     C                     EXSR #FEB29                                                        CDL093
      *                                                                                       CDL093
     C                     ENDIF                                                              CDL093
      *
     C           @@CALC    IFEQ '2'
     C           @@CALC    OREQ '3'
     C           @@CALC    OREQ '5'
     C           @@CALC    OREQ '0'                                                          CER016A
     C                     Z-ADD36000     @@YEAR  50
     C                     END
      *
     C           @@CALC    IFEQ '1'
     C           @@CALC    OREQ '4'
     C           @@CALC    OREQ '9'                                                           CDL093
     C           #29FEB    ANDNE'Y'                                                           CDL093
     C                     Z-ADD36500     @@YEAR
     C                     END
      *
     C           @@CALC    IFEQ '6'
     C           @@CALC    OREQ '9'                                                           CDL093
     C           #29FEB    ANDEQ'Y'                                                           CDL093
     C                     Z-ADD36600     @@YEAR
     C                     END
      *
      ** Multiply principal amount to rate then to the number of days
      *
     C           @@AMT     MULT @@RATE    ZZWRK1 309
     C           ZZWRK1    MULT @@INDY    ZZWK2  309
     C           ZZWK2     DIV  @@YEAR    @@INTR 150H
      *
     C           M10309    ENDSR
      *****************************************************************
      /EJECT
      *****************************************************************
     C           *PSSR     BEGSR
      *
      ** Check to see that *PSSR has not already been called                                 BUG4122
      *                                                                                      BUG4122
     C           WRUN      IFEQ *BLANK                                                       BUG4122
     C                     MOVE 'Y'       WRUN    1                                          BUG4122
     C                     SETON                     U7U8LR                                  BUG4122
     C                     DUMP
     C                     ENDIF                                                             BUG4122
      *                                                                                      BUG4122
      ** If *PSSR already run, then just end the program here                                BUG4122
      *                                                                                      BUG4122
     C                     SETON                     U7U8LR                                  BUG4122
     C                     RETRN                                                             BUG4122
      *
     C           #PSSR9    ENDSR                            **PSSR9**
      *****************************************************************
      /EJECT
      ********************************************************************
     C           #RA01     BEGSR                           ** #RA01  **
      *
     C                     READ DEALSFD9                 71
      *
     C                     SETOF                     73
      *
     C********** MDAT      SUB  ROLDAY    ROLDAT  50                                         BUG3838
      *
     C           *IN71     IFEQ '0'
     C********** AURO      IFEQ 'A'                                                          BUG3838
     C********** ROLDAT    ANDEQ@RUND                                                        BUG3838
     C********** DTYP      ANDEQ'IP'                                                         BUG3838
     C********** AURO      OREQ 'A'                                                          BUG3838
     C********** ROLDAT    ANDEQ@RUND                                                        BUG3838
     C********** DTYP      ANDEQ'IT'                                                         BUG3838
     C********** AURO      OREQ 'A'                                                          BUG3838
     C********** ROLDAT    ANDEQ@RUND                                                        BUG3838
     C********** DTYP      ANDEQ'TD'                                                         BUG3838
     C********** AURO      OREQ 'A'                                                          BUG3838
     C********** ROLDAT    ANDEQ@RUND                                                        BUG3838
     C********** DTYP      ANDEQ'TI'                                                         BUG3838
      *                                                                                      BUG3838
      ** Determine if deal to be selected for rolling over                                   BUG3838
      *                                                                                      BUG3838
     C                     EXSR DEAL2S                                                       BUG3838
     C           DEALSL    IFEQ 'Y'                                                          BUG3838
      *
      ** store the deal no. as old deal no.
     C                     MOVE DLNO      @OLDDL  60
      *
     C                     ELSE
      *
     C                     SETON                     73
     C                     END
     C                     END
      *
     C           #RA09     ENDSR
      ********************************************************************
      /EJECT                                                                                 BUG3838
      ********************************************************************                   BUG3838
     C           DEAL2S    BEGSR                                                             BUG3838
     C                     MOVEL'N'       DEALSL  1                                          BUG3838
      *                                                                                      BUG3838
      ** Ignore if not autorollover                                                          BUG3838
      *                                                                                      BUG3838
     C           AURO      CABNE'A'       #DEAL2                                             BUG3838
      *                                                                                      BUG3838
      ** Ignore if deal already matured or reversed                                          BUG3838
      *                                                                                      BUG3838
     C           RECI      CABNE'D'       #DEAL2                                             BUG3838
      *                                                                                      BUG4541
      ** Ignore if deal already rolled over                                                  BUG4541
      *                                                                                      BUG4541
     C           RBDN      CABNE*ZERO     #DEAL2                                             BUG4541
      *                                                                                      BUG3838
      ** Ignore if deal not IP, IT, TD or TI                                                 BUG3838
      *                                                                                      BUG3838
     C           DTYP      IFNE 'IP'                                                         BUG3838
     C           DTYP      ANDNE'IT'                                                         BUG3838
     C           DTYP      ANDNE'TD'                                                         BUG3838
     C           DTYP      ANDNE'TI'                                                         BUG3838
     C                     GOTO #DEAL2                                                       BUG3838
     C                     ENDIF                                                             BUG3838
      *                                                                                      BUG3838
      ** Calculate rollover generation date                                                  BUG3838
      ** = rollover days back from maturity date                                             BUG3838
      *                                                                                      BUG3838
     C                     Z-ADDMDAT      ZDAYNO                                             BUG3838
     C                     MOVE BJLCCY    ZCCY                                               BUG3838
     C                     MOVE *BLANK    ZLOC                                               BUG3838
     C                     Z-ADDROLDAY    ZNRDYS                                             BUG3838
     C                     EXSR ZBKDT                                                        BUG3838
      *                                                                                      BUG3838
      ** Ignore if rollover generation date is in the future                                 BUG3838
      *                                                                                      BUG3838
     C           ZDYNBR    IFGE BJDNWD                                                       BUG3838
     C                     GOTO #DEAL2                                                       BUG3838
     C                     ENDIF                                                             BUG3838
      *                                                                                      BUG3838
      ** Ignore if rollover generation date is equal to rundate for                           243473
      ** rollover frequency equal to A.                                                       243473
      **********                                                                       243473 243842
     C********** ZDYNBR    IFEQ BJRDNB                                                 243473 243842
     C********** HKROFQ    ANDEQ'A'                                                    243473 243842
     C********** BKAPDT    ANDEQ@NMDAT                                                 243473 243842
     C**********           GOTO #DEAL2                                                 243473 243842
     C**********           ENDIF                                                       243473 243842
      *                                                                                      BUG3838
      ** If maturity deal of deal rolled over < date of next wrkg day                        BUG3838
      ** then rollover deal generated must be authorized                                     BUG3838
      ** (It wouldn't be possible to authorize the rollover deal                             BUG3838
      **  before the deal being rolled over is matured).                                     BUG3838
      ** else use system default                                                             BUG3838
      *                                                                                      BUG3838
     C           MDAT      IFLT BJDNWD                                                       BUG3838
     C                     MOVEL'Y'       GAUTH   1                                          BUG3838
     C                     ELSE                                                              BUG3838
     C                     MOVELDGAUTH    GAUTH                                              BUG3838
     C                     ENDIF                                                             BUG3838
     C/COPY WNCPYSRC,DLH00327
      ** Select deal                                                                         BUG3838
     C                     MOVEL'Y'       DEALSL                                             BUG3838
     C           #DEAL2    ENDSR                                                             BUG3838
      ********************************************************************                   BUG3838
      /EJECT
      ********************************************************************
     C           #UA01     BEGSR                           ** #UA01  **
      *
      **  Read MM deals file using old deal no.
      *
     C           @OLDDL    CHAINMMDEAULL             72
     C           *IN72     CABEQ'1'       #UA09
      *
      **  Set up update fields for old MM deal record
      *
     C                     MOVEL'O'       HKRBSI
     C                     MOVE @NEWDL    HKROBY
     C                     UPDATMMDELDP0               72
      *
     C           #UA09     ENDSR
      ********************************************************************
      /EJECT
      ********************************************************************
     C           #UB01     BEGSR                           ** #UB01  **
      *
      **  Read deals file using old deal no.
      *
     C           @OLDDL    CHAINDEALS                72
     C           *IN72     CABEQ'1'       #UB09
      *
      **  Set up update fields for old deal record
      *
     C                     MOVE @NEWDL    RBDN
     C                     Z-ADD@RLAMT    RBDA
     C                     Z-ADD@RUND     LCD
     C                     MOVEL'A'       CHTP
     C                     UPDATDEALSDC9               72
      *
     C           #UB09     ENDSR
      ********************************************************************
      /EJECT
      ********************************************************************
     C           #WA01     BEGSR                           ** #WA01  **
      *
     C                     Z-ADD0         @NEWDL  60
      *                                                                                      BUG4068
      ** For Fixed Loan/Deposit get next deal number from the                                BUG4068
      ** fixed loan/deposit deal number range if set up.                                     BUG4068
      *                                                                                      BUG4068
     C           KFDDR     KLIST                                                             BUG4068
     C                     KFLD           BRCA             Branch Code                       BUG4068
     C                     KFLD           DTYP             Deal Type                         BUG4068
      *                                                                                      BUG4068
     C           KFDDR     CHAINSDFDDRL0             74                                      BUG4068
      *                                                                                      BUG4068
     C           *IN74     IFEQ '0'                                                          BUG4068
     C                     MOVE MMCU      @NEWDL                                             BUG4068
     C                     SETOF                     72                                      BUG4068
      *                                                                                      BUG4068
     C           *IN72     DOUEQ'1'                                                          BUG4068
     C           @NEWDL    CHAINMMDEALLL             72                                      BUG4068
      *                                                                                      BUG4068
     C           *IN72     IFEQ '0'                                                          BUG4068
     C                     ADD  1         @NEWDL                                             BUG4068
     C                     ELSE                                                              BUG4068
     C           @NEWDL    IFGT MMLS                                                         BUG4068
     C                     Z-ADDMMIN      @NEWDL                                             BUG4068
     C                     SETOF                     72                                      BUG4068
     C                     ELSE                                                              BUG4068
     C                     Z-ADD@NEWDL    MMCU                                               BUG4068
     C                     UPDATSDFDDRD0                                                     BUG4068
     C                     ENDIF                                                             BUG4068
     C                     ENDIF                                                             BUG4068
      *                                                                                      BUG4068
     C                     ENDDO                                                             BUG4068
     C                     ENDIF                                                             BUG4068
      *                                                                                      BUG4068
B01  C           @NEWDL    IFEQ 0                                                            BUG4068
      *
      ** Get next deal number
      *
     C           *IN62     DOUEQ'0'
     C           1         SETLLCADLFALL
     C                     READ CADLFALL                 62
      *
      **  If a live record is found, delete it
      *
     C           *IN62     IFEQ '0'
     C                     MOVE FKDN38    @NEWDL
     C                     DELETCADLFAP0
      *
      **  Otherwise, call the regeneration program
      *
     C                     ELSE
     C                     CALL 'CA0040'
     C                     PARM *BLANKS   PTERM   1
      *
      **  If an error occurs in the called program, perform a rollback,
      **  and by-pass all further processing.
      *
     C           PTERM     IFEQ 'E'
     C           *LOCK     IN   LDA
     C                     MOVELPTERM     DBKEY
     C                     MOVE 'CA0040  'DBFILE           ***************
     C                     Z-ADD901       DBASE            *DB ERROR 901 *
     C                     OUT  LDA                        ***************
     C                     EXSR *PSSR
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDDO
      *                                                                                      BUG4068
E01  C                     ENDIF                                                             BUG4068
      *
      **  Read MM deals file using old deal no.
      *
     C           @OLDDL    CHAINMMDEAULL             72
     C           *IN72     CABEQ'1'       #WA09
      *
     C                     MOVE HKDDYY    @@YR             old deal done date
     C                     MOVE HKDDMM    @@Z71M
     C                     MOVE HKDDDD    @@Z71D
     C                     Z-ADD@@VDT     @@DTIN
     C                     Z-ADD@@VDT     @DDATO  80
     C                     EXSR ZA0680
     C                     Z-ADD@@MDNO    @ODDAT  50
      *
     C                     MOVE HKMDYY    @@YR             old maturity date
     C                     MOVE HKMDMM    @@Z71M
     C                     MOVE HKMDDD    @@Z71D
     C                     Z-ADD@@VDT     @@DTIN
     C                     Z-ADD@@VDT     @MDATO  80
     C                     EXSR ZA0680
     C                     Z-ADD@@MDNO    @OMDAT  50
      *
     C                     MOVE HKNIYY    @@YR             old next int. paymnt.
     C                     MOVE HKNIMM    @@Z71M           date
     C                     MOVE HKNIDD    @@Z71D
     C                     Z-ADD@@VDT     @@DTIN
     C                     Z-ADD@@VDT     @NIDTO  80
     C                     EXSR ZA0680
     C                     Z-ADD@@MDNO    @ONIDT  50
      *
     C                     MOVE HKIAYY    @@YR             old int. accr. date
     C                     MOVE HKIAMM    @@Z71M
     C                     MOVE HKIADD    @@Z71D
     C                     Z-ADD@@VDT     @@DTIN
     C                     Z-ADD@@VDT     @IADTO  80
     C                     EXSR ZA0680
     C                     Z-ADD@@MDNO    @OIADT  50
      *
     C                     MOVE HKVDYY    @@YR             old value date
     C                     MOVE HKVDMM    @@Z71M
     C                     MOVE HKVDDD    @@Z71D
     C                     Z-ADD@@VDT     @@DTIN
     C                     Z-ADD@@VDT     @VDATO  80
     C                     EXSR ZA0680
     C                     Z-ADD@@MDNO    @OVDAT  50
      *
      **  Store old Midas total interest and old principal amount
      **  in print fields
      *
     C           HKMTTI    IFLT 0
     C                     Z-SUBHKMTTI    @TTOTI 150
     C                     ELSE
     C                     Z-ADDHKMTTI    @TTOTI
     C                     END
     C                     Z-ADDHKAMNP    @PRIN  150
      *
      **  Maturity date for the original deal now becomes the value
      **  date
      *
     C                     MOVE HKMDYY    HKVDYY           new value date
     C                     MOVE HKMDMM    HKVDMM
     C                     MOVE HKMDDD    HKVDDD
     C                     Z-ADD@MDATO    @VDATN  80
     C                     Z-ADD@OMDAT    @NVDAT  50
      *
      **  as well as start date for the new deal
      *
     C                     MOVE HKMDYY    HKSLYY           new start date
     C                     MOVE HKMDMM    HKSLMM
     C                     MOVE HKMDDD    HKSLDD
      *
      **  and interest accrual control date
      *
     C                     MOVE HKMDYY    HKIAYY           new int. accr. date
     C                     MOVE HKMDMM    HKIAMM
     C                     MOVE HKMDDD    HKIADD
     C                     Z-ADD@OMDAT    @NIACD  50
      *
     C                     MOVEL@RUNA     @HKLUP
      *
      *********************
      *   Maturity date   *
      *********************
      *
      ** If rollover frequency is BLANK:
      **      - New maturity date will be the New Value Date plus the
      **        'rollover days' of the old deal
      ** If rollover frequency is NOT BLANK:
      **      - Use SR/ZFRQA to calculate the new maturity date based on
      **        'Rollover Frequency', 'New value date' and 'Rollover days'
      *
     C           HKROFQ    IFEQ *BLANK
     C           @NVDAT    ADD  HKRLDN    @NMDAT  50
     C           @NMDAT    IFLT BJDNWD                                                       BUG3838
     C                     Z-ADDBJDNWD    @NMDAT                                             BUG3838
     C                     ENDIF                                                             BUG3838
     C                     EXSR CHKHOL
     C                     Z-ADD@NMDAT    @@DAYN
     C                     EXSR ZA0710
     C                     MOVE @@VDT     @MDATN  80
     C                     MOVE @@YR      HKMDYY
     C                     MOVE @@Z71M    HKMDMM
     C                     MOVE @@Z71D    HKMDDD
     C                     ELSE
      *                                                                                       243842
      ** HKROFQ=A means Monthly on Accrual Profit Date.                                       243842
      ** If system is not Monthly accrual, force HKROFQ to be = M Monthly                     243842
      *                                                                                       243842
     C           HKROFQ    IFEQ 'A'                                                           243842
     C           BKAPFQ    ANDEQ'D'                        Daily                              243842
     C           HKROFQ    OREQ 'A'                                                           243842
     C           BKAPFQ    ANDEQ'F'                        Fortnightly                        243842
     C           HKROFQ    OREQ 'A'                                                           243842
     C           BKAPFQ    ANDEQ'W'                        Weekly                             243842
     C                     MOVE 'M'       ZFREQ                                               243842
     C                     ELSE                                                               243842
     C                     MOVE HKROFQ    ZFREQ
     C                     ENDIF                                                              243842
      *                                                                                       243842
     C                     Z-ADD@NVDAT    ZDAYNO
     C                     Z-ADDHKRLDN    ZMDAY
     C                     MOVE HKCCY     ZCCY
     C                     EXSR ZFRQA
     C                     Z-ADDZDAYNO    @NMDAT
     C           @NMDAT    IFLT BJDNWD                                                       BUG3838
     C                     Z-ADDBJDNWD    @NMDAT                                             BUG3838
     C                     ENDIF                                                             BUG3838
     C                     EXSR CHKHOL                                                       BUG7853
     C                     Z-ADD@NMDAT    @@DAYN
     C                     EXSR ZA0710
     C                     MOVE @@VDT     @MDATN
     C                     MOVE @@YR      HKMDYY
     C                     MOVE @@Z71M    HKMDMM
     C                     MOVE @@Z71D    HKMDDD
     C                     ENDIF
      *
     C/COPY WNCPYSRC,DLH00328
      ************************
      *   Principal amount   *
      ************************
      *
      **  If rollover indicator is 'P', amount rolled over is the same
      **  as old principal amount, but if it is 'F', then add Midas total
      **  interest to principal amount in order to get new principal
      *
 s1  C           FSROLI    IFEQ 'F'
      *
     C                     Z-ADDIACD      ZIBEG                                             MD023322
     C                     Z-ADDMDAT      ZIEND                                             MD023322
     C                     Z-ADDPCPL      ZIAMT                                             MD023322
     C                     Z-ADDICBS      ZICALC                                            MD023322
     C                     Z-ADDINTR      ZIRATE                                            MD023322
     C                     EXSR GLINTC                                                      MD023322
     C           JRDFC     IFEQ 'Y'                                                         MD023322
     C                     Z-ADDZINTR     HKMTTI                                            MD023322
     C                     ELSE                                                             MD023322
     C                     Z-ADDZINTR     HKMTTI    H                                       MD023322
     C                     ENDIF                                                            MD023322
     C                     ADD  AIAN      HKMTTI                                            MD023322
     C                     ADD  AIAP      HKMTTI                                            MD023322
     C                     ADD  AITC      HKMTTI                                            MD023322
     C                     SUB  IPRD      HKMTTI                                            MD023322
     C/COPY WNCPYSRC,DLH00082
     C                     Z-ADDHKMTTI    MTTI   150
     C                     Z-ADD0         @TAXA
     C                     Z-ADD0         @TAXB
     C/COPY WNCPYSRC,DLH00062
      *                                                                                     MD023322
      ** If CAR CDL013 is installed.                                                        MD023322
      *                                                                                     MD023322
     C           CDL013    IFEQ 'Y'                                                         MD023322
     C           HKIPDS    ANDEQ'N'                                                         MD023322
      *                                                                                     MD023322
      ** If Tax indicator is ZERO set WHT rate to ZERO.                                     MD023322
      *                                                                                     MD023322
     C           HKMTAX    IFEQ '0'                                                         MD023322
     C                     Z-ADD0         ULWHTR  52                                        MD023322
     C                     ELSE                                                             MD023322
      *                                                                                     MD023322
      ** Set WHT rate.                                                                      MD023322
      *                                                                                     MD023322
     C                     SELEC                                                            MD023322
     C           HKMTAX    WHEQ '1'                                                         MD023322
     C                     Z-ADDETXR1     ULWHTR                                            MD023322
     C           HKMTAX    WHEQ '2'                                                         MD023322
     C                     Z-ADDETXR2     ULWHTR                                            MD023322
     C           HKMTAX    WHEQ '3'                                                         MD023322
     C                     Z-ADDETXR3     ULWHTR                                            MD023322
     C           HKMTAX    WHEQ '4'                                                         MD023322
     C                     Z-ADDETXR4     ULWHTR                                            MD023322
     C           HKMTAX    WHEQ '5'                                                         MD023322
     C                     Z-ADDETXR5     ULWHTR                                            MD023322
     C           HKMTAX    WHEQ '6'                                                         MD023322
     C                     Z-ADDETXR6     ULWHTR                                            MD023322
     C           HKMTAX    WHEQ '7'                                                         MD023322
     C                     Z-ADDETXR7     ULWHTR                                            MD023322
     C           HKMTAX    WHEQ '8'                                                         MD023322
     C                     Z-ADDETXR8     ULWHTR                                            MD023322
     C           HKMTAX    WHEQ '9'                                                         MD023322
     C                     Z-ADDETXR9     ULWHTR                                            MD023322
     C                     ENDSL                                                            MD023322
      *                                                                                     MD023322
     C                     ENDIF                                                            MD023322
      *                                                                                     MD023322
      ** If WHT rate is ZERO set tax amount to ZERO.                                        MD023322
      *                                                                                     MD023322
     C           ULWHTR    IFEQ *ZERO                                                       MD023322
     C                     Z-ADD0         @TAXA                                             MD023322
      *                                                                                     MD023322
      ** otherwise calculate tax amount.                                                    MD023322
      *                                                                                     MD023322
     C                     ELSE                                                             MD023322
      *                                                                                     MD023322
      ** If Deal Ccy is equal to Base Ccy round down Interest Amount.                       MD023322
      *                                                                                     MD023322
     C           HKCCY     IFEQ BJCYCD                                                      MD023322
      *                                                                                     MD023322
      ** Set work adjustment field according to decimal places.                             MD023322
      *                                                                                     MD023322
     C                     SELEC                                                            MD023322
     C           HKCYDP    WHEQ 1                                                           MD023322
     C                     Z-ADD10        ULWKAD  40                                        MD023322
     C           HKCYDP    WHEQ 2                                                           MD023322
     C                     Z-ADD100       ULWKAD                                            MD023322
     C           HKCYDP    WHEQ 3                                                           MD023322
     C                     Z-ADD1000      ULWKAD                                            MD023322
     C           HKCYDP    WHEQ 0                                                           MD023322
     C                     Z-ADD1         ULWKAD                                            MD023322
     C                     ENDSL                                                            MD023322
      *                                                                                     MD023322
      ** Calculate and then round down Tax Amount.                                          MD023322
      *                                                                                     MD023322
     C           MTTI      DIV  ULWKAD    ULTINT 150                                        MD023322
     C                     MULT ULWKAD    ULTINT                                            MD023322
     C           ULTINT    MULT ULWHTR    @TAXA                                             MD023322
     C                     DIV  100       @TAXA                                             MD023322
     C           @TAXA     DIV  ULWKAD    ULTXAM 150                                        MD023322
     C           ULTXAM    MULT ULWKAD    @TAXA                                             MD023322
      *                                                                                     MD023322
      ** Otherwise (Deal Ccy NOT = Base Ccy) calculate Tax amount                           MD023322
      ** without rounding down.                                                             MD023322
      *                                                                                     MD023322
     C                     ELSE                                                             MD023322
     C           MTTI      MULT ULWHTR    @TAXA                                             MD023322
     C                     DIV  100       @TAXA     H                                       MD023322
     C                     ENDIF                                                            MD023322
      *                                                                                     MD023322
     C                     ENDIF                                                            MD023322
      *                                                                                     MD023322
      ** Otherwise perform Original Tax calculations.                                       MD023322
      *                                                                                     MD023322
     C                     ELSE                                                             MD023322
      *
      **  If tax indicator is 'Y' & deal type is 'IT','CD','TD'
     C/COPY WNCPYSRC,DLH00063
 s2  C           TAXI      IFEQ 'Y'
     C           FUID      ANDNE'Y'                                                           239182
     C           IPDS      ANDEQ'N'                                                           239182
      *
 s3  C           HKMTYP    IFEQ 'IT'
     C           HKMTYP    OREQ 'CD'
     C           HKMTYP    OREQ 'TD'
     C/COPY WNCPYSRC,DLH00425
      *                                                                                       239182
      ** Check if Basic Rate Tax feature is installed.                                        239182
      *                                                                                       239182
     C           S01383    IFEQ 'Y'                                                           239182
     C           HKCNUM    CHAINSDCBRTL1             61                                       239182
     C           *IN61     IFEQ '1'                                                           239182
     C           *LOCK     IN   LDA                                                           239182
     C                     MOVEL'SDCBRTL1'DBFILE           ***************                    239182
     C                     Z-ADD15        DBASE            *DB ERROR 015 *                    239182
     C                     MOVELHKCNUM    DBKEY            ***************                    239182
     C                     OUT  LDA                                                           239182
     C                     EXSR *PSSR                                                         239182
     C                     ENDIF                                                              239182
      *                                                                                       239182
     C           TAXIND    IFEQ 'L'                                                           239182
     C           TAXIND    OREQ 'P'                                                           239182
     C           @NMDAT    IFLT DEFF                                                          239182
     C           MTTI      MULT PBRTR     @TAXA                                               239182
     C           @TAXA     DIV  100       @TAXA     H                                         239182
     C                     ELSE                                                               239182
     C           MTTI      MULT BRTR      @TAXA                                               239182
     C           @TAXA     DIV  100       @TAXA     H                                         239182
     C                     ENDIF                                                              239182
      *                                                                                       239182
     C           TAXIND    IFEQ 'P'                                                           239182
     C                     DIV  2         @TAXA     H                                         239182
     C                     ENDIF                                                              239182
     C                     ENDIF                                                              239182
     C                     ELSE                                                               239182
      *
      * If Dual Withholding Tax feature is On                                                 CGL165
     C           CGL165    IFEQ 'Y'                                                           CGL165
     C*                                                                                       CGL165
     C                     Z-ADDHKMTTI    PINTA                                               CGL165
     C                     CALL 'GL024000'                                                    CGL165
     C                     PARM           PRCOD1  1                                           CGL165
     C                     PARM 'AOOUMM'  PCPGM   6                                           CGL165
     C                     PARM *BLANKS   PBRCA   3                                           CGL165
     C                     PARM *BLANKS   PCNUM   6                                           CGL165
     C                     PARM *BLANKS   PACNO  10                                           CGL165
     C                     PARM CCY       PCCY    3                                           CGL165
     C                     PARM           PINTA  150                                          CGL165
     C                     PARM HKTAX1    PTXC1   2                                           CGL165
     C                     PARM HKTAX2    PTXC2   2                                           CGL165
     C                     PARM *ZEROS    PCPDT   50                                          CGL165
     C                     PARM *ZEROS    PVDAT   50                                          CGL165
     C                     PARM *ZEROS    PMDAT   50                                          CGL165
     C                     PARM *ZEROS    PINTR  117                                          CGL165
     C                     PARM *BLANKS   PDTYP   2                                           CGL165
     C                     PARM *ZEROS    PPCPL  150                                          CGL165
     C                     PARM *BLANKS   PACOD  10                                           CGL165
     C                     PARM *ZEROS    PACSQ   20                                          CGL165
     C                     PARM           PWTXA  150                                          CGL165
     C                     PARM           PSTXA  150                                          CGL165
      *                                                                                       CGL165
      **  Compute net total                                                                   CGL165
     C           HKMTTI    SUB  PWTXA     MTTI                                                CGL165
     C           MTTI      SUB  PSTXA     MTTI                                                CGL165
      *                                                                                       CGL165
     C                     ELSE                                                               CGL165
 s4   **  If Hongkong interest tax rate is non zeros
     C           @TAXR     IFNE *ZEROS
      *
      **  Compute tax amount
     C           HKMTTI    MULT BNHKTR    @TAXA     H
     C           @TAXA     DIV  100       @TAXA     H
      *
      **  Compute net total
     C           HKMTTI    SUB  @TAXA     MTTI
      *
 e4  C                     END
     C                     ENDIF                                                              CGL165
 e3  C                     END
     C/COPY WNCPYSRC,DLH00426
 e2  C                     END
     C                     ENDIF                                                              239182
     C                     ENDIF                                                            MD023322
     C/COPY WNCPYSRC,DLH00083
      *
      **  Compute withholding tax amount (Indonesian Requirement)
      *
     C                     MOVE *ZEROS    @TAXB  250
      *
     C           MTTI      SUB  @TAXA     MTTI
     C           MTTI      SUB  @TAXB     HKMTTI
      *
      * For TD/IT (HKAMNP > 0 and HKMTTI < 0);                                                244735
      * For IP/TI (HKAMNP < 0 and HKMTTI > 0)                                                 244735
 s2  C********** HKMTTI    IFLT 0
     C**********           SUB  HKMTTI    HKAMNP                                              246498
 x2  C**********           ELSE                                                               244735
     C**********           ADD  HKMTTI    HKAMNP                                              244735
 e2  C**********           END                                                                244735
      *
 b1  C           HKMTYP    IFEQ 'IP'                                                          246498
     C           HKMTYP    OREQ 'TI'                                                          246498
     C/COPY WNCPYSRC,DLH00084
 b2  C           HKMTTI    IFLT 0                                                             246498
     C                     ADD  HKMTTI    HKAMNP                                              246498
     C                     ELSE                                                               246498
     C                     SUB  HKMTTI    HKAMNP                                              246498
 e2  C                     ENDIF                                                              246498
      *                                                                                       246498
     C                     ELSE                                                               246498
 b3  C           HKMTTI    IFLT 0                                                             246498
     C                     SUB  HKMTTI    HKAMNP                                              246498
     C                     ELSE                                                               246498
     C                     ADD  HKMTTI    HKAMNP                                              246498
 e3  C                     ENDIF                                                              246498
      *                                                                                       246498
 e1  C                     ENDIF                                                              246498
      **  Include manual adjustment
     C                     ADD  AIAN      HKAMNP
     C                     ADD  AIAP      HKAMNP
     C/COPY WNCPYSRC,DLH00085
      *
 e1  C                     END
      *
     C           HKAMNP    IFLT 0                                                            244735A
     C                     Z-SUBHKAMNP    @RLAMT                                             244735A
     C                     ELSE                                                              244735A
     C                     Z-ADDHKAMNP    @RLAMT 150
     C                     ENDIF                                                             244735A
      *
      *********************
      *   Interest rate   *
      *********************
      *
     C           BRTT      IFNE *ZEROS
      *
      **  Access the base rates file to get the base rate
      *
     C                     MOVE BRTT      BRTTA   2
      *
     C                     CALL 'AOBSRTR0'
     C                     PARM *BLANKS   @RTCD   7
     C                     PARM '*KEY   ' @OPTN   7
     C                     PARM CCY       @AJCD   3
     C                     PARM BRTTA     @DWND   2
     C           SDBSRT    PARM SDBSRT    DSFDY
      *
     C           @RTCD     IFEQ *BLANKS
      *
      **  If the deal value date is less than value date of new rate
      **  change, use the previous base rate.
     C           @NVDAT    IFLT BAVDNR
     C                     Z-ADDBACBSR    @RATE  117
      *
      **  If the deal value date is greater than value date of new rate
      **  change, use the next base rate.
     C                     ELSE
     C                     Z-ADDBANBRT    @RATE
     C                     END
     C                     ELSE
     C           *LOCK     IN   LDA
     C                     Z-ADD8         DBASE
     C                     MOVEL'SDBSRTPD'DBFILE
     C**********           MOVEL@OPTN     DBKEY                                               CRN001
     C                     MOVELCCY       WKEY    5                                           CRN001
     C                     MOVE BRTTA     WKEY                                                CRN001
     C                     MOVELWKEY      DBKEY                                               CRN001
     C                     EXSR DBERR
     C                     END
      *
      **  If the spread/rate is valid, determine the effective rate and
      **  place it in the Standard Deal format.
     C           HKSPRD    ADD  @RATE     HKINTR
     C**********           ELSE                                                               261960
     C**********           Z-ADDHKIIRT    HKINTR                                              261960
     C                     END
      *
      **********************************
      *   Next interest payment date   *
      **********************************
      *
     C           HKIPFQ    IFEQ *BLANKS
     C                     Z-ADD0         HKNIYY
     C                     Z-ADD0         HKNIMM
     C                     Z-ADD0         HKNIDD
     C                     Z-ADD0         @NNIDT  50
     C                     ELSE
     C                     Z-ADD@NIDTO    @@STRT
     C                     MOVELHKIPFQ    @@FREQ
     C                     MOVELHKCCY     @@CCY
     C                     Z-ADDHKIPDM    @@MDAY
     C                     Z-ADD@MDATN    @@MDAT
     C                     EXSR MM1004
     C                     Z-ADD@@NDAT    @@VDT
     C                     MOVE @@YR      HKNIYY
     C                     MOVE @@Z71M    HKNIMM
     C                     MOVE @@Z71D    HKNIDD
     C                     EXSR ZA0680
     C                     Z-ADD@@MDNO    @NNIDT
     C                     END
      *
     C/COPY WNCPYSRC,DLH00329
      **********************
      *   Total interest   *
      **********************
      *
     C                     Z-ADD@NVDAT    @@BEG   50
     C                     Z-ADD@NMDAT    @@END   50
     C                     MOVELHKICMT    @@CALC  1
     C                     Z-ADDHKAMNP    @@AMT  150
     C                     Z-ADDHKINTR    @@RATE 117
     C                     EXSR MM1030
     C                     Z-ADD@@INTR    HKMTTI
     C           HKMTYP    IFEQ 'IP'                                                          244735
     C           HKMTYP    OREQ 'TI'                                                          244735
     C           @@INTR    IFLT 0                                                             244735
     C                     Z-SUB@@INTR    HKMTTI                                              244735
     C                     ENDIF                                                              244735
     C                     ELSE                                                               244735
     C           @@INTR    IFGT 0                                                             244735
     C                     Z-SUB@@INTR    HKMTTI                                              244735
     C                     ENDIF                                                              244735
     C                     ENDIF                                                              244735
      *
     C                     MOVEL*BLANKS   HKROBY
     C                     TIME           HKTLUP
     C                     MOVEL'I'       HKCHTP
     C                     MOVE @RUND     HKLCD
      *
      **  Move the original deal no. to associated deal no.
      *
     C                     MOVE HKDN38    HKDADN
      *
      **  then get the deal no. range for this branch from the data
      **  area FDDLNO
      *
      **  then get the deal no. range for this branch from MMFDDLNO
      *
     C                     MOVE @NEWDL    HKDN38
      *
      **  Set up deal transaction date
      **  and deal done date to start date (from old maturity date)
      **  if maturity date is before rundate, otherwise, it should be
      **  rundate.
      *
     C           @OMDAT    IFLT @RUND
     C                     Z-ADD@NVDAT    @@DAYN  50
     C                     ELSE
     C                     Z-ADD@RUND     @@DAYN
     C                     ENDIF
     C                     EXSR ZA0710
     C                     MOVE @@YR      HKDTYY
     C                     MOVE @@Z71M    HKDTMM
     C                     MOVE @@Z71D    HKDTDD
     C                     MOVE @@YR      HKDDYY
     C                     MOVE @@Z71M    HKDDMM
     C                     MOVE @@Z71D    HKDDDD
     C                     MOVE @@VDT     HKLDAT
      *
     C********** AUTOAU    IFEQ 'Y'                                                          BUG3838
     C********** BNMMAU    ANDEQ'Y'                                                          BUG3838
     C           GAUTH     IFEQ 'Y'                                                          BUG3838
     C                     MOVEL'A'       HKDSTS
     C                     MOVEL'X'       HKLACT
     C                     ELSE
     C                     MOVEL'C'       HKDSTS
     C                     MOVEL*BLANKS   HKLACT
     C                     ENDIF
      *
     C                     MOVEL'N'       HKRBSI
     C                     MOVE HKTLUP    HKTIME
     C                     MOVEL*BLANKS   HKDORM
     C                     MOVEL'COMP'    HKDORM
     C                     Z-ADD3         HKORCM
     C                     MOVEL*BLANKS   HKDORI
     C                     MOVEL*BLANKS   HKMORI
     C                     MOVEL*BLANKS   HKDCPI
     C                     MOVEL*BLANKS   HKMCPI
     C                     Z-ADD3         HKRSTM
     C                     MOVEL*BLANKS   HKRONS
     C                     MOVEL*BLANKS   HKRIBN
     C                     MOVEL*BLANKS   HKRIBA
     C**********           Z-ADD*ZERO     HKROBN                                              CSD027
     C**********           Z-ADD*ZERO     HKROCN                                              CSD027
     C                     MOVE *BLANKS   HKROBN                                              CSD027
     C                     MOVE *BLANKS   HKROCN                                              CSD027
     C                     Z-ADDHKMTTI    HKIMAT
     C                     MOVEL*BLANKS   HKROBR
      *
      **  GET THE SPOT RATE FROM TABTG10
      *
     C                     CALL 'AOCURRR0'
     C                     PARM *BLANKS   @RTCD   7
     C                     PARM '*KEY   ' @OPTN   7
     C                     PARM HKCCY     @AJCD   3
     C           SDCURR    PARM SDCURR    DSSDY
     C           @RTCD     IFNE *BLANK
     C           *LOCK     IN   LDA
     C                     Z-ADD18        DBASE
     C                     MOVEL'SDCURRPD'DBFILE
     C                     MOVELHKCCY     DBKEY
     C                     EXSR DBERR
     C                     ELSE
     C                     Z-ADDA6SPRT    HKBRAT
     C                     END
      *
      * Deal Done Date                                                                       BUG3838
     C                     MOVE HKDDYY    ZWYYYY                                             BUG3838
     C                     MOVE HKDDMM    ZWMTH                                              BUG3838
     C                     MOVE HKDDDD    ZWDAY                                              BUG3838
     C                     EXSR ZDAT10                                                       BUG3838
     C                     Z-ADDZZMDNO    HKDDND                                             BUG3838
      * Deal Value Date                                                                      BUG3838
     C                     MOVE HKVDYY    ZWYYYY                                             BUG3838
     C                     MOVE HKVDMM    ZWMTH                                              BUG3838
     C                     MOVE HKVDDD    ZWDAY                                              BUG3838
     C                     EXSR ZDAT10                                                       BUG3838
     C                     Z-ADDZZMDNO    HKDVSD                                             BUG3838
      * Next Int Pay Date                                                                    BUG3838
     C                     MOVE HKNIYY    ZWYYYY                                             BUG3838
     C                     MOVE HKNIMM    ZWMTH                                              BUG3838
     C                     MOVE HKNIDD    ZWDAY                                              BUG3838
     C                     EXSR ZDAT10                                                       BUG3838
     C                     Z-ADDZZMDNO    HKNIPD                                             BUG3838
      * Start/Last Int Date                                                                  BUG3838
     C                     MOVE HKSLYY    ZWYYYY                                             BUG3838
     C                     MOVE HKSLMM    ZWMTH                                              BUG3838
     C                     MOVE HKSLDD    ZWDAY                                              BUG3838
     C                     EXSR ZDAT10                                                       BUG3838
     C                     Z-ADDZZMDNO    HKSLID                                             BUG3838
      * Maturity Date                                                                        BUG3838
     C                     MOVE HKMDYY    ZWYYYY                                             BUG3838
     C                     MOVE HKMDMM    ZWMTH                                              BUG3838
     C                     MOVE HKMDDD    ZWDAY                                              BUG3838
     C                     EXSR ZDAT10                                                       BUG3838
     C                     Z-ADDZZMDNO    HKMATD                                             BUG3838
     C                     MOVE *BLANK    HKRMAC                                             BUG3873
     C                     MOVE *BLANK    HKPMAC                                             BUG3873
      *
     C           AUTOAU    IFEQ 'N'                                                         MD023337
     C                     MOVEL'N'       HKBLKA                                            MD023337
     C                     ENDIF                                                            MD023337
     C                     MOVELAUTH      HKAUTH                                            MD023337
      *                                                                                     MD023337
     C/COPY WNCPYSRC,DLH00486
     C                     WRITEMMDELDP0
      *                                                                                      BUG3838
      * If CLE025 is ON                                                                      BUG3838
      * Get CL extension record for rolled-over deal and                                     BUG3838
      * pass its details onto the record written for the rollover deal                       BUG3838
      *                                                                                      BUG3838
     C           CLE025    IFEQ 'Y'                                                          BUG3838
     C                     CLEARDLDCQD                                                       BUG3838
     C                     MOVELHKDADN    F1DLNO                                             BUG3838
     C           DLDCK     KLIST                                                             BUG3838
     C                     KFLD           F1DLNO                                             BUG3838
     C           DLDCK     CHAINDLDLDCD0             99                                      BUG3838
     C           *IN99     IFEQ '1'                                                          BUG3838
     C                     MOVELHKBRCA    F1BRCA                                             BUG3838
     C                     ENDIF                                                             BUG3838
     C                     MOVELHKDN38    F1DLNO                                             BUG3838
     C           DLDCK     CHAINDLDLDCD0             99                                      BUG3838
     C           *IN99     IFEQ '1'                                                          BUG3838
     C                     WRITEDLDLDCD0                                                     BUG3838
     C                     ENDIF                                                             BUG3838
     C                     ENDIF                                                             BUG3838
      *                                                                                      BUG3838
      /COPY WNCPYSRC,DL5350C010
      *
     C           #WA09     ENDSR
      ********************************************************************
      /EJECT
      ********************************************************************
     C           #WB01     BEGSR                           ** #WB01  **
      *
     C                     MOVEL'D'       RECI
     C                     MOVE HKDN38    DLNO
     C                     MOVEL'C'       RCDT
     C                     MOVE 16        RCDC
     C                     MOVE HKCNUM    CNUM
     C                     MOVE HKBRCA    BRCA
     C                     MOVELHKMTYP    DTYP
     C                     MOVELHKSTYP    DLST
     C                     Z-ADD@RUND     DDAT
     C                     Z-ADD@NVDAT    VDAT
     C                     Z-ADD@NMDAT    MDAT
     C                     MOVE HKACSQ    CDAS
     C                     MOVE HKBKCD    BRKC
     C                     MOVE HKCCY     CCY
      *                                                                                       241513
     C           FSROLI    IFEQ 'F'                                                           241513
     C                     Z-ADDHKAMNP    PCPL                                                241513
     C                     Z-ADDHKAMNP    RODA                                                241513
     C                     ENDIF                                                              241513
      *                                                                                       241513
     C                     Z-ADDHKMTTI    TOTI                                                244735
     C           HKMTYP    IFEQ 'IP'                                                         BUG7448
     C           HKMTYP    OREQ 'TI'                                                         BUG7448
     C********** HKMTYP    OREQ 'CL'                                                 BUG7448  244735
     C********** HKMTYP    OREQ 'LN'                                                 BUG7448  244735
     C********** HKMTYP    OREQ 'DL'                                                 BUG7448  244735
     C********** HKAMNP    IFGT 0                                                    BUG7448  244735
     C           HKAMNP    IFLT 0                                                             244735
     C**********           Z-ADDHKAMNP    PCPL                                               BUG7448
     C                     Z-SUBHKAMNP    PCPL                                               BUG7448
     C                     Z-SUBHKAMNP    RODA                                               BUG7448
     C                     ENDIF                                                             BUG7448
     C           HKMTTI    IFLT 0                                                            BUG7448
     C                     Z-SUBHKMTTI    TOTI                                               BUG7448
     C                     ENDIF                                                             BUG7448
      *                                                                                      BUG7448
     C                     ELSE                                                              BUG7448
     C           HKAMNP    IFLT 0                                                            BUG7448
     C                     Z-SUBHKAMNP    PCPL                                               BUG7448
     C                     Z-SUBHKAMNP    RODA                                               BUG7448
     C                     ENDIF                                                             BUG7448
     C********** HKMTTI    IFGT 0                                                    BUG7448  244735
     C           HKMTTI    IFLT 0                                                             244735
     C                     Z-SUBHKMTTI    TOTI                                               BUG7448
     C                     ENDIF                                                             BUG7448
     C                     ENDIF                                                             BUG7448
     C                     MOVELHKCPTI    INTC
     C                     Z-ADDHKINTR    INTR
     C                     Z-ADDHKNTCE    NOTD
     C                     MOVELHKCDRF    RNNA
     C                     MOVE HKMCDH    CHNA
     C                     MOVELHKFCLY    FACT
     C                     MOVE HKFCLY    FCNO
     C                     Z-ADD0         OPAM
     C                     Z-ADDHKBRAT    BCXR
     C                     MOVE HKORCM    SDST
     C                     MOVELHKMORI    OSDA
     C                     MOVELHKMCPI    TSTN
     C                     MOVE HKMOPM    MDST
     C                     MOVELHKMOPI    OMDA
     C                     MOVELHKMCRI    TMAN
      *
      *  SET UP EXTENDED SETTLEMENT FIELDS
     C                     MOVELHKRSTM    RSTM
     C                     MOVELHKRONS    RONS
     C                     MOVELHKRIBN    RIBN
     C                     MOVELHKRIBA    RIBA
     C**********           Z-ADDHKROBN    ROBN                                                CSD027
     C**********           Z-ADDHKROCN    ROCN                                                CSD027
     C                     MOVE HKROBN    ROBN                                                CSD027
     C                     MOVE HKROCN    ROCN                                                CSD027
     C                     MOVELHKPSTM    PSTM
     C                     MOVELHKPONS    PONS
     C                     MOVELHKPIBN    PIBN
     C                     MOVELHKPIBA    PIBA
     C**********           Z-ADDHKPOBN    POBN                                                CSD027
     C**********           Z-ADDHKPOCN    POCN                                                CSD027
     C                     MOVE HKPOBN    POBN                                                CSD027
     C                     MOVE HKPOCN    POCN                                                CSD027
      *
     C                     MOVELHKRCRN    RCRN
     C                     MOVELHKRCRA    RCRA
     C                     MOVELHKRVNO    RVNO
     C                     MOVELHKPIBA    PIBA
     C                     MOVELHKAWBN    AWBN
     C                     MOVELHKAWBA    AWBA
     C                     MOVELHKBENN    BENN
     C                     MOVELHKBENA    BENA
     C                     MOVELHKDTP1    DTP1
     C                     MOVELHKDTP2    DTP2
     C                     MOVELHKDTP3    DTP3
     C                     MOVELHKDTP4    DTP4
     C                     MOVELHKDCHG    DCHG
     C                     MOVELHKBTB1    BTB1
     C                     MOVELHKBTB2    BTB2
     C                     MOVELHKBTB3    BTB3
     C                     MOVELHKBTB4    BTB4
     C                     MOVELHKBTB5    BTB5
     C                     MOVELHKBTB6    BTB6
     C                     MOVELHKCVMR    CVMR
      *
     C                     MOVE HKDADN    RODN
     C**********           Z-ADDHKAMNP    RODA                                               BUG7448
     C                     Z-ADD0         RBDN
     C                     Z-ADD0         RBDA
     C                     MOVE HKICMT    ICBS
     C                     MOVELHKIPFQ    IPFR
     C**********           Z-ADDHKMTTI    TOTI                                               BUG7448
     C                     Z-ADD0         AIPD
     C                     Z-ADD0         DLRC
     C                     Z-ADD0         AITC
     C                     Z-ADD0         AIAN
     C                     Z-ADD0         AIAP
     C                     Z-ADD0         IPRD
     C                     Z-ADD0         IPRM
     C                     Z-ADD0         ICTD
     C                     Z-ADD0         DAVD
     C                     Z-ADD0         DASN
     C                     Z-ADD0         TAXD
     C                     Z-ADD0         TAXM
     C                     BITOF'01234567'CNFI
     C                     BITOF'01234567'ACEI
     C                     BITOF'01234567'TLXI
     C                     Z-ADD0         LSWC
     C                     Z-ADD0         LSWS
     C                     MOVEL'I'       CHTP
     C                     Z-ADD0         TNLU
     C                     MOVEL*BLANKS   DBLN
     C                     MOVELHKDRID    DRID
     C                     MOVELHKDDMR    DDMR
     C                     MOVELHKBOKC    BOKC
     C                     MOVELHKLNKN    LNKDN
     C                     MOVELHKORBR    ORBR
     C                     MOVELHKPRFC    PRFC
     C                     MOVELHKPOBR    POBR
     C                     MOVELHKROBR    ROBR
     C                     MOVELHKRDFC    JRDFC
     C                     MOVELHKFLID    JFLID
     C                     MOVELHKFUID    FUID
     C                     MOVELHKSOFD    FSSOFD
      /COPY WNCPYSRC,DL5350C011
      *
      ** Deal date should be set to the new start date instead of
      ** run date
      ** if old maturity date is before rundate, otherwise, should be
      ** rundate.
     C           @OMDAT    IFLT @RUND
     C                     Z-ADD@NVDAT    DDAT
     C                     ELSE
     C                     Z-ADD@RUND     DDAT
     C                     ENDIF
      *
     C                     Z-ADD@NVDAT    VDAT
     C                     Z-ADD@NVDAT    SLID
      *
     C                     Z-ADD@NMDAT    MDAT
      *
     C                     Z-ADD@NNIDT    NIDT
     C                     Z-ADD@NNIDT    IBDT
      *
     C                     Z-ADD@NIACD    IACD
      *
     C                     Z-ADD@RUND     ORED
     C                     Z-ADD@RUND     LCD
      *
      **  Brokerage amount
     C                     Z-ADDHKBRKG    @BRKG
     C           @@BRKG    IFEQ *ALL'9'
     C                     Z-ADD0         BAGE
     C                     ELSE
     C                     Z-ADDHKBRKG    BAGE
     C                     END
      *
      **  Deals non-static indicators
     C                     BITOF'01234567'DNSI
      *
      **  Deals static indicators
     C                     BITOF'01234567'DSTI
     C                     Z-ADDHKBRKG    @BRKG
     C           @@BRKG    IFEQ *ALL'9'
     C           HKBKCD    ORNE 'TELX'
     C           HKBKCD    ORNE 'MAIL'
     C           HKBKCD    ORNE 'PHON'
     C           HKBKCD    ORNE *BLANKS
     C                     BITON'0'       DSTI
     C                     END
      *
      **  Confirmation indicators
     C                     BITOF'01234567'CNFI
      *
      ** A rollover confirmation has been produced so set on
      ** the necessary bits of the confirmation indicator.
      *
     C                     BITON'7'       CNFI
      *
      **  Accounting entries indicators
     C                     BITOF'01234567'ACEI
      *
      **  Telex indicators
     C                     BITOF'01234567'TLXI
      *
     C           HKBSRC    IFEQ *BLANKS
     C           HKBSRC    OREQ *ZEROS
      **  Base rate code
     C                     Z-ADD0         BRTT
      **  Current base rate
     C                     Z-ADD0         BRTE
      **  Rate/spread
     C**********           Z-ADDHKIIRT    RTSP                                                261960
     C                     Z-ADDHKINTR    RTSP                                                261960
     C                     ELSE
     C                     BITON'1'       DNSI
     C                     Z-ADDHKSPRD    RTSP
      *
     C                     CALL 'AOBSRTR0'
     C                     PARM *BLANKS   @RTCD   7
     C                     PARM '*KEY   ' @OPTN   7
     C                     PARM HKCCY     @AJCD   3
     C                     PARM HKBSRC    @DWND   2
     C           SDBSRT    PARM SDBSRT    DSFDY
     C           @RTCD     IFEQ *BLANKS
     C           VDAT      IFGE BAVDNR
     C                     Z-ADDBANBRT    BRTE
     C                     ELSE
     C                     Z-ADDBACBSR    BRTE
     C                     END
     C                     ELSE
     C           *LOCK     IN   LDA
     C                     Z-ADD9         DBASE
     C                     MOVEL'SDBSRTPD'DBFILE
     C**********           MOVEL@OPTN     DBKEY                                               CRN001
     C                     MOVELHKCCY     WKEY    5                                           CRN001
     C                     MOVE HKBSRC    WKEY                                                CRN001
     C                     MOVELWKEY      DBKEY                                               CRN001
     C                     EXSR DBERR
     C                     END
     C                     END
      *
      **  Limit currency exchange rate
     C                     Z-ADD0         A6TXND
     C                     CALL 'AOCURRR0'
     C                     PARM *BLANKS   @RTCD   7
     C                     PARM '*KEY   ' @OPTN   7
     C                     PARM HKCCY     @AJCD   3
     C           SDCURR    PARM SDCURR    DSSDY
     C           @RTCD     IFEQ *BLANK
     C                     Z-ADDA6ERLC    LCXR
     C                     ELSE
     C           *LOCK     IN   LDA
     C                     Z-ADD10        DBASE
     C                     MOVEL'SDCURRPD'DBFILE
     C                     MOVELHKCCY     DBKEY
     C                     EXSR DBERR
     C                     END
      *                                                                                      BUG3873
     C                     MOVE *BLANK    FSRMAC                                             BUG3873
     C                     MOVE *BLANK    FSPMAC                                             BUG3873
      *                                                                                       CDL038
      *** Class                                                                               CDL038
     C                     MOVELHKCLAS    CLAS                                                CDL038
      *
     C           HKCYDP    COMP 0                        40
     C           HKCYDP    COMP 1                        41
     C           HKCYDP    COMP 2                        42
     C           HKCYDP    COMP 3                        43
      *
     C/COPY WNCPYSRC,DLH00330
     C********** HKAMNP    ADD  HKMTTI    AMT1   150                                         246498
     C           PCPL      ADD  TOTI      AMT1   150                                         246498
      *                                                                                      BUG3611
     C                     ADD  PCPL      TPCPL                                              BUG3611
      *
     C                     WRITEDEALSDC9
      *                                                                                      BUG3611
     C                     ADD  1         @NORE                                              BUG3611
     C   72                GOTO #WB09
      *
      **  Determine if Deal is Blocked                                                       BUG4069
      *                                                                                      BUG4069
     C           HKBLKA    IFEQ 'Y'                                                          BUG4069
     C                     MOVE '1'       *IN58                                              BUG4069
     C                     ELSE                                                              BUG4069
     C                     MOVE '0'       *IN58                                              BUG4069
     C                     ENDIF                                                             BUG4069
      *                                                                                      BUG4069
      **  Determine if tax is to be printed (logic taken from DL0110)                        BUG4069
      **  Set off indicator (87) to print tax & initialise print amts.                       BUG4069
      *                                                                                      BUG4069
     C                     SETOF                     87                                      BUG4069
     C                     Z-ADD0         @TAXA  130
     C                     Z-ADD0         @TAMT  150
      *
      **  If tax indicator is 'Y' & deal type is 'IT','CD','TD'
     C           TAXI      IFEQ 'Y'
      *
     C           DTYP      IFEQ 'IT'
     C           DTYP      OREQ 'CD'
     C           DTYP      OREQ 'TD'
     C/COPY WNCPYSRC,DLH00427
      *
      **  If Hongkong interest tax rate is non zeros
     C           @TAXR     IFNE *ZEROS
      *
      **  Compute tax amount
     C           HKMTTI    MULT BNHKTR    @TAXA     H
     C           @TAXA     DIV  100       @TAXA     H
      *
      **  If Deal type is one of the following (taken from pgm.DL0110)
     C           DTYP      IFEQ 'C1'
     C           DTYP      OREQ 'CI'
     C           DTYP      OREQ 'TD'
     C           DTYP      OREQ 'IT'
     C           DTYP      OREQ 'IP'
     C           DTYP      OREQ 'TI'
     C           DTYP      OREQ 'LN'
      *                                                                                      BUG4069
      **  Set on indicator (87) to print tax                                                 BUG4069
     C                     SETON                     87                                      BUG4069
      *
      **  Compute net total
     C           AMT1      SUB  @TAXA     @TAMT
      *
     C                     END
     C/COPY WNCPYSRC,DLH00428
      *
     C                     END
      *
     C                     END
      *
     C                     END
      *
      **  On change of branch code, access table file for branch name
     C           @PBRCA    IFNE BRCA
     C                     CALL 'AOBRCHR0'
     C                     PARM *BLANKS   @RTCD   7
     C                     PARM '*KEY   ' @OPTN   7
     C                     PARM BRCA      @DSNB   3
     C           SDBRCH    PARM SDBRCH    DSFDY
      *
     C           @RTCD     IFEQ *BLANKS
     C                     MOVELA8BRNM    @BRNM  30
     C                     END
     C                     END
      *
     C                     MOVEL*BLANKS   BKNM   30
     C           BRKC      IFEQ 'PHON'
     C                     MOVEL'PHONE'   BKNM
     C                     ELSE
     C           BRKC      IFEQ 'TELX'
     C                     MOVEL'TELEX'   BKNM
     C                     ELSE
     C           BRKC      IFEQ 'MAIL'
     C                     MOVEL'MAIL'    BKNM
     C                     ELSE
     C                     MOVEL*BLANKS   BKNM
     C                     CALL 'AOBROKR0'
     C                     PARM *BLANK    @RTCD   7
     C                     PARM '*KEY   ' @OPTN   7
     C                     PARM BRKC      BQTX    4
     C           SDBROK    PARM SDBROK    DSFDY
032   *
     C           @RTCD     IFNE *BLANK
     C           *LOCK     IN   LDA
     C                     Z-ADD11        DBASE
     C                     MOVEL'SDBROKPD'DBFILE
     C                     MOVELBRKC      DBKEY
     C                     EXSR DBERR
     C                     ELSE
     C                     MOVELA9BKNM    BKNM
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C                     Z-ADD@VDATN    @@DTIN
     C                     EXSR ZA0660
     C                     MOVE @@DATE    DVDATE  7
      *
     C                     Z-ADD@MDATN    @@DTIN
     C                     EXSR ZA0660
     C                     MOVE @@DATE    DMDATE  7
      *
     C                     MOVELCNUM      CNUMX  10
      **
     C                     CALL 'AOCUSTR0'
     C                     PARM *BLANKS   @RTCD   7
     C                     PARM '*KEY   ' @OPTN   7
     C                     PARM CNUMX     @KEY1  10
     C                     PARM *BLANKS   @KYST   7
     C           SDCUST    PARM SDCUST    DSSDY
     C           @RTCD     IFNE *BLANKS
     C           @KYST     OREQ '*ERROR '
     C           *LOCK     IN   LDA
     C                     MOVELCNUM      DBKEY
     C                     Z-ADD12        DBASE
     C                     MOVEL'SDCUSTPD'DBFILE
     C                     EXSR DBERR
     C                     END
      *
      **  On change of branch code, seton *in11 for a page break
      *
     C           @PBRCA    IFNE BRCA
     C                     MOVE BRCA      @PBRCA
     C                     END
      *
      **  On change of deal sub-type, seton *in11 for a page break
      *
     C           @PDLST    IFNE DLST
     C                     CALL 'AODLSTR0'
     C                     PARM *BLANKS   @RTCD   7
     C                     PARM '*KEY   ' @OPTN   7
     C                     PARM DLST      @AQCD   2
     C           SDDLST    PARM SDDLST    DSFDY
     C           @RTCD     IFNE *BLANK
     C           *LOCK     IN   LDA
     C                     Z-ADD13        DBASE
     C                     MOVEL'SDDLSTPD'DBFILE
     C                     MOVELDLST      DBKEY
     C                     EXSR DBERR
     C                     END
     C                     MOVE DLST      @PDLST
     C                     END
      *
      *    SPECIAL INSTRUCTIONS
      *
      **   RESTORE 'NORMAL' CONTENTS OF FIELD SPINST
     C                     MOVEL'SPECIAL 'SPINST 20
     C                     MOVEL'INSTRUCT'BENEF  12
     C                     MOVE 'IONS'    BENEF
     C                     MOVE BENEF     SPINST
      *
      **   IGNORE BLANK SPECIAL INSTRUCTIONS
     C                     SETOF                     24
     C           SPI       IFEQ *BLANKS
     C                     SETON                     24
     C                     GOTO BENEND
     C                     END
      *
      **   CHECK FOR BENEFICIARY BANK DETAILS
     C           SPEC5     COMP '/BEN/'              6060
     C   60                GOTO BENEND
     C                     MOVEL'BENEFICI'SPINST
     C                     MOVE *BLANKS   BENEF
     C                     MOVEL'ARY BANK'BENEF
     C                     MOVE BENEF     SPINST
      *
      **   CHECK FOR CHIPS NUMBER
     C           SPEC8     COMP '/CH'                    60
     C   60                MOVE SPEC14    WORK6   6
     C   60                MOVE *BLANKS   SPI
     C   60                MOVE 'CHIPS'   SPEC5
     C   60                MOVE WORK6     SPEC12
     C   60                GOTO BENEND
      *
      **   CHECK FOR FED. WIRE NUMBER
     C           SPEC8     COMP '/FW'                    60
     C   60                MOVE SPEC17    WORK9   9
     C   60                MOVE *BLANKS   SPI
     C   60                MOVE 'FED.WIRE'SPEC9
     C   60                MOVE WORK9     SPEC18
     C   60                GOTO BENEND
      *
      **   MUST NOW BE 'ACCOUNT'
     C                     MOVE SPEC35    WORK30 30
     C                     MOVE *BLANKS   SPI
     C                     MOVE 'A/C'     SPEC3
     C                     MOVE WORK30    SPEC34
      *
     C           BENEND    TAG                             * BENEND TAG *
1172 C  N24                MOVE SPINST    TITL6  20
      *
     C           #WB09     ENDSR
      ********************************************************************
      /EJECT
      *******************************************************************
     C           #WC01     BEGSR                           ** #WC01  **
      *
     C                     MOVEL'D'       RCDT
     C                     MOVELHKTLUP    TIM
     C                     MOVEL'I'       CHTP
     C                     MOVEL'Y'       CNRQ
     C           BGN1ST    IFEQ 'Y'                                                           259376
     C           CCG015    OREQ 'Y'                                                           259376
     C                     MOVEL'N'       CNPR                                                259376
     C                     ELSE                                                               259376
     C                     MOVEL'Y'       CNPR
     C                     ENDIF                                                              259376
     C                     MOVEL*BLANKS   REPR
     C                     MOVEL*BLANKS   ZZ001
     C                     MOVEL*BLANKS   ZZ004
     C                     MOVEL'N'       DADI
     C                     MOVE 0         ICIN
     C                     Z-ADD0         TNLU
     C                     Z-ADD0         PRI1
     C                     Z-ADD0         PRI2
     C                     Z-ADD0         PRI3
      *
     C                     Z-ADD@RUND     @FRWD   50
     C                     MOVEL*BLANKS   @@HIND
      *
     C           MDST      IFEQ 01                         B1
     C           MDST      OREQ 07                         B1
     C           MDST      OREQ 08                         B1
     C                     ADD  A6TXND    @FRWD            *1
     C                     MOVELHKCCY     @@CCY            *1
     C           @@HIND    DOUEQ'W'                        B*2
     C                     MOVELHKCCY     ZCCY             *1
     C                     Z-ADD@FRWD     ZDAYNO           *1
     C                     EXSR ZCHKH                      *1
     C                     MOVE ZIND      @@HIND  1
     C           @@HIND    IFNE 'W'
     C                     ADD  1         @FRWD
     C                     END
     C                     END
     C                     ELSE
     C                     ADD  @TNOT     @FRWD
     C                     MOVEL@LOCY     @@CCY
     C           @@HIND    DOUEQ'W'
     C                     MOVEL@LOCY     ZCCY
     C                     Z-ADD@FRWD     ZDAYNO
     C                     EXSR ZCHKH
     C                     MOVE ZIND      @@HIND
     C           @@HIND    IFNE 'W'
     C                     ADD  1         @FRWD
     C                     END
     C                     END
     C                     END
      *
     C           @NVDAT    IFGE @RUND
     C           @NVDAT    ANDLE@FRWD
     C                     ADD  1         PRI1
     C                     END
      *
     C           @NNIDT    IFGE @RUND
     C           @NNIDT    ANDLE@FRWD
     C                     ADD  1         PRI2
     C                     END
      *
     C           @NMDAT    IFGE @RUND
     C           @NMDAT    ANDLE@FRWD
     C                     ADD  1         PRI3
     C                     END
      *
     C                     WRITEDTRIXDF                72
      *
     C           #WC09     ENDSR
      *****************************************************************
      /EJECT
      *****************************************************************
      *                                                               *
      * ZA0660 - THIS SUBROUTINE CONVERTS DATE FORMAT YYYYMMDD TO     *
      *          DDMMMYY FORMAT                                       *
      *                                                               *
      * CALLED BY :                                                   *
      *                                                               *
      * INPUT  : @@DTIN DATE INPUT (YYYYMMDD)  - IN DATA STRUCTURE    *
      *                                                               *
      * OUTPUT : @@DATE DATE OUTPUT (DDMMMYY)                         *
      *                                                               *
      * USES :   @@MTH  MONTH NUMBER                                  *
      *          @@MNM  MONTH SHORTNAME                               *
      *          @@DAY  DAY NUMBER                                    *
      *          @@YYYY YEAR (4 CHARACTER)                            *
      *          @@DAT5 5A WORKFIELD                                  *
      *          @MN    ARRAY OF MONTH SHORTNAMES                     *
      *                                                               *
      *****************************************************************
     C           ZA0660    BEGSR
      *
     C           @@DTIN    IFNE 0                          B1
     C                     MOVE @@YYYY    @@DATE  7        *1
     C                     MOVE @MN,@@MTH @@DAT5  5        *1
     C                     MOVEL@@DAY     @@DAT5           *1
     C                     MOVEL@@DAT5    @@DATE           *1
     C                     ELSE                            X1
     C                     MOVE *BLANKS   @@DATE           *1
     C                     END                             E1
      *
     C           ZA0669    ENDSR                              *** ZA0669
      *****************************************************************
      /EJECT
      *******************************************************************
      *
      * ZA0680 - THIS SUBROUTINE CONVERTS YYYYMMDD FORMAT DATE TO
      *          MIDAS DAY NUMBER FORMAT (NO. DAYS FROM 31/12/71)
      *
      * CALLED BY :
      *
      * CALLS :
      *
      * INPUT  : @@DTIN DATE (YYYYMMDD) - IN DATA STRUCTURE (SIZE : 8N)
      *
      * OUTPUT : @@MDNO MIDAS DAY NUMBER  (SIZE : 5N)
      *
      * USES :   @@CC   NUMBER OF CENTURIES IN DATE
      *          @@DAY  DAY NUMBER
      *          @@REM  REMAINDER FROM DIVIDE
      *          @@MTH  MONTH NUMBER
      *          @MD    COMPILATION TIME ARRAY FOR CUMULATIVE DAYS IN
      *                 MONTH
      *          @@WK2  WORK FIELD (2,0)
      *          @@WK5  WORK FIELD (5,0)
      *          @@YYYY YEAR (4 CHARACTER)
      *          @@YY   YEAR (2 CHARACTER)
      *          @YD    COMPILATION TIME ARRAY FOR CUMULATIVE DAYS IN
      *                 A FOUR YEAR PERIOD
      *
      *******************************************************************
      *
     C           ZA0680    BEGSR                           ** ZA0680 **
      *
      **  CLEAR OUT ANY 'OLD' DATA IN FIELD
     C                     Z-ADD0         @@MDNO  50
      *
     C           @@DTIN    CABEQ0         ZA0689
      *
      **   IF DATE GREATER THAN 31/12/2071 NEED EXTRA PROCESSING
      **   WORK OUT THE NUMBER OF CENTURIES PASSED SINCE 1971,
      **   BY SUBTRACTING 1972 FROM THE YEAR FIELD.
     C           @@YYYY    IFGE 2072                       B1
     C           @@YYYY    SUB  1972      @@YYYY           *1
      *
      **   MULTIPLY BY NUMBER OF DAYS IN CENTURY (SINCE 1971)
      **   THEN RESTORE THE YEAR WHICH WAS INPUT BACK TO THE
      **   ORIGINAL VALUE BEFORE CONTINUING WITH NORMAL CALCULATIONS.
      **
     C           @@CC      MULT 36524     @@MDNO           *1
     C           @@YYYY    ADD  1972      @@YYYY           *1
     C                     END                             E1
      *
     C           @@YYYY    ADD  28        @@WK2   20
      *
     C           @@WK2     DIV  4         @@WK2
     C                     MVR            @@REM   10
      *
      **    MULTIPLY BY NUMBER OF DAYS IN FOUR YEAR PERIOD
     C           @@WK2     MULT 1461      @@WK5   50
     C                     ADD  @@WK5     @@MDNO
      *
      **  CHECK REMAINDER AND MONTH NUMBER
     C           @@REM     IFEQ 0                          B1
     C           @@MTH     ANDGT2                          B1
     C                     ADD  1         @@MDNO           *1
     C                     END                             E1
      *
      **  YEAR NOT LEAP YEAR,  ADD CUMULATIVE DAYS FOR YEAR
     C           @@REM     IFNE 0                          B1
     C                     ADD  @YD,@@REM @@MDNO           *1
     C                     END                             E1
      *
      **  ADD MONTHS THIS YEAR
     C                     ADD  @MD,@@MTH @@MDNO
      *
      **  ADD DAYS THIS MONTH
     C                     ADD  @@DAY     @@MDNO
      *
     C           ZA0689    ENDSR                           **ZA0689 TAG**
      *****************************************************************
      /EJECT
      ********************************************************************
      *                                                               *
      *       TITLE:CALCULATE MIDAS DAY NO. TO DRS (YYYYMMDD) FORMAT. *
      *                                                               *
      *       SUBROUTINE
      *       PASSED TO IT IN 5,0 FORMAT.IF THE ABOVE FIELD IS LESS   *
      *       THAN 1 IT RETURNS 1 IN FIELD '@@RTN'.THE MAIN PROGRAM   *
      *       SHOULD CHECK FOR THIS CONDITION AND DO THE NECESSARY.   *
      *       IF '@@RTN' IS NOT EQUAL TO 1 IT RETURNS THE FIELD       *
      *       '@@VDT'  IN 'YYYYMMDD' FORMAT.                          *
      *                                                               *
      * NOTE: FIELD TO BE DEFINED BY EXTERNAL ROUTINE IS
      *                                                               *
      *       1) @@DAYN   LENGTH 5,0.                                 *
      *                                                               *
      *       FIELDS USED AND ALREADY DEFINED IN THE ROUTINE ARE:     *
      *                                                               *
      *       1) @@VDT    LENGTH 8,0 DEFINED BY A DS.                 *
      *       2) @@RTN    LENGTH 1,0.                                 *
      *       3) @@I      LENGTH 2,0 USED TO ACCESS ARRAY @YD         *
      *       4) @@J      LENGTH 2,0 USED TO ACCESS ARRAY @MD         *
      *       5) @@Z71Y   LENGTH 4,0 DEFINED BY A DS.                 *
      *       6) @@RDAY   LENGTH 5,0.                                 *
      *       7) @@LEAP   LENGTH 1,0.
      *                                                               *
      *       INDICATORS USED ARE:                                    *
      *                                                               *
      *       1) 80       CHECK FOR LOW AND EQUAL ON ARRAY @YD        *
      *       2) 81       CHECK FOR LOW ON ARRAY @MD.                 *
      *                                                               *
      * INPUT FIELD:       @@DAYN                                     *
      *                                                               *
      * OUTPUT FIELD:      @@VDT                                      *
      *                                                               *
      * WORK FIELDS:       @@RTN                                      *
      *                    @@Z71Y                                     *
      *                    @@RDAY                                     *
      *                    @@LEAP                                     *
      *                    @@I                                        *
      *                    @@J                                        *
      *                                                               *
      * ARRAYS USED:       @YD COMPILE TIME ARRAY.
      *                    @MD COMPILE TIME ARRAY.
      *
      *****************************************************************
      *
     C           ZA0710    BEGSR                           ** ZA0710 **
      *
     C                     SETOF                     8081
     C/COPY WNCPYSRC,DLH00086
     C**********           Z-ADD0         @@RTN   10                                        MD023322
     C                     Z-ADD0         @@RTN1  10                                        MD023322
     C/COPY WNCPYSRC,DLH00087
     C                     Z-ADD0         @@VDT
     C                     Z-ADD1         @@I     20
     C                     Z-ADD1         @@J     20
     C                     Z-ADD1         @@LEAP  10
      *
     C           @@DAYN    CABEQ0         ZA0719
      *
     C           @@DAYN    IFLT 1
     C/COPY WNCPYSRC,DLH00088
     C**********           Z-ADD1         @@RTN                                             MD023322
     C                     Z-ADD1         @@RTN1                                            MD023322
     C/COPY WNCPYSRC,DLH00089
     C                     GOTO ZA0719
     C                     END
      *
      * DIVISION TO DETERMINE WETHER LEAP YEAR.
      *
     C           @@DAYN    DIV  1461      @@Z71Y
     C                     MVR            @@RDAY  50
      *
      * CALCULATING YEAR.
      *
     C           @@Z71Y    MULT 4         @@Z71Y
     C                     ADD  1972      @@Z71Y
      *
      * CHECKING IF YEAR IS GREATER THAN OR EQUAL TO 2100
      *
     C           @@Z71Y    IFGE 2100
     C                     ADD  @@SSY2    @@RDAY
     C                     END
      *
      * LOKUP ARRAY @YD TO SEE HOW MANY YEARS OF A FOUR YEAR CYCLE
      * HAVE PASSED.
      *
     C           @@RDAY    LOKUP@YD,@@I                8080
      *
      * IF YEAR IS A LEAP YEAR SSLEAP IS SET TO ZERO.
      *
     C           *IN80     IFEQ '0'
     C                     Z-ADD0         @@LEAP
     C                     END
      *
      * ADD INDEX TO YEAR TO GIVE CORRECT YEAR AND ADJUST '@@RDAY'.
      *
     C           @@LEAP    IFEQ 1
     C           @@RDAY    SUB  @YD,@@I   @@RDAY
     C                     ADD  @@I       @@Z71Y
     C                     END
      *
      * PROCESSING FOR A LEAP YEAR.
      *
     C           @@LEAP    IFEQ 0
      *
      * IF '@@RDAY' = 60 DATE MUST BE 29TH OF FEBRUARY.
      *
     C           @@RDAY    IFEQ 60
     C                     Z-ADD29        @@Z71D
     C                     Z-ADD2         @@Z71M
     C/COPY WNCPYSRC,DLH00090
     C**********           GOTO ZA0711                                                      MD023322
     C                     GOTO ZA0712                                                      MD023322
     C/COPY WNCPYSRC,DLH00091
     C                     END
      *
      * IF '@@RDAY' > 60 DATE IS AFTER 29TH OF FEBRUARY,CONVERSION CAN
      * PROCEED AS USUAL AFTER SUBTRACTING THE EXTRA DAY FOR THE LEAP
      * YEAR. NOTE : '@@RDAY' < 60 CONVERSION PROCEEDS AS USUAL.
      *
     C           @@RDAY    IFGT 60
     C           @@RDAY    SUB  1         @@RDAY
     C                     END
      *
     C                     END
      *
      * IF DAY '@@DAYN' IS EXACTLY DIVISIBLE BY 1461 (NUMBER OF DAYS
      * IN 4 YEARS) THEN DATE MUST BE LAST DAY OF PREVIOUS FOUR YEAR
      * GROUP.
      *
     C           @@RDAY    IFEQ 0
     C                     Z-ADD31        @@Z71D
     C                     Z-ADD12        @@Z71M
     C                     SUB  1         @@Z71Y
     C/COPY WNCPYSRC,DLH00092
     C**********           GOTO ZA0711                                                      MD023322
     C                     GOTO ZA0712                                                      MD023322
     C/COPY WNCPYSRC,DLH00093
     C                     END
      *
      * LOOK UP ARRAY ARRAY @MD TO DETERMINE WHICH MONTH '@@RDAY'
      * OCCURS IN
      *
     C           @@RDAY    LOKUP@MD,@@J                81
     C                     Z-ADD@@J       @@Z71M
     C           @@RDAY    SUB  @MD,@@J   @@Z71D
      *
      * DS @@VDT  IS RETURNED IN YYYYMMDD FORMAT
      *
     C/COPY WNCPYSRC,DLH00094
     C********** ZA0711    TAG                                                              MD023322
     C           ZA0712    TAG                                                              MD023322
     C/COPY WNCPYSRC,DLH00095
      *
     C                     MOVE @@Z71Y    @@YR
      *
     C           ZA0719    ENDSR
      *****************************************************************
      /EJECT
      *****************************************************************
      **  Copy for hash total subroutine
     C/COPY ZSRSRC,ZHASHZ3
     C/COPY ZSRSRC,ZEDITZ2
     C/COPY ZSRSRC,ZSEDITZ3                                                                  BUG4847
     C/COPY ZSRSRC,ZFEB29                                                                     CDL093
      *
      *****************************************************************
      /EJECT
      *****************************************************************
     C           #ZZ01     BEGSR                           ** #ZZ01  **
      *
      **  Define program work variables
      *
     C                     MOVEL*BLANKS   REPORT  1
     C                     MOVEL*BLANKS   @RUNA   7
     C                     Z-ADD0         @RUND   50
     C                     Z-ADD0         @NORE   50
     C                     Z-ADD0         @DNWD   50
     C                     Z-ADD0         @TNOT   50
     C                     Z-ADD0         TPCPL  150                                         BUG3611
     C                     MOVEL*BLANKS   @TABKY 12
     C                     MOVEL*BLANKS   @PBRCA  3
     C                     MOVEL*BLANKS   @PDLST  2
     C                     Z-ADD1         S
     C                     Z-ADD1         Z
     C                     Z-ADD0         INT,1
     C                     Z-ADD0         INT,2
     C                     Z-ADD0         DEC,1
     C                     Z-ADD0         DEC,2
      *
      **  Prepare LDA
      *
     C           *NAMVAR   DEFN           LDA
     C           *LOCK     IN   LDA
     C                     MOVEL*BLANK    DBLOT
     C                     OUT  LDA
      *
      **  Reset indicators
      *
     C                     SETOF                     717273
      *
      ** REPORT SPOOL FILE GENERATION FOR DL5350P1
     C                     Z-ADDSFNUM1    ZSNUM1  60
     C                     CALL 'ZSFILE'
     C                     PARM           SEQ     5
     C                     PARM BRCA      @PARM   3
     C                     PARM           SFILE1
     C                     PARM           ZSNUM1
     C                     PARM           ZSERR   1
      *
     C           ZSERR     IFEQ 'Y'
     C                     SETON                     U7U8LR
     C                     RETRN
     C                     END
      *
      ** Report Spool file Generation for DL5350P2                                           BUG4069
     C                     Z-ADDSFNUM2    ZSNUM2  60                                         BUG4069
     C                     CALL 'ZSFILE'                                                     BUG4069
     C                     PARM           SEQ                                                BUG4069
     C                     PARM BRCA      @PARM                                              BUG4069
     C                     PARM           SFILE2                                             BUG4069
     C                     PARM           ZSNUM2                                             BUG4069
     C                     PARM           ZSERR                                              BUG4069
      *                                                                                      BUG4069
     C           ZSERR     IFEQ 'Y'                                                          BUG4069
     C                     SETON                     U7U8LR                                  BUG4069
     C                     RETRN                                                             BUG4069
     C                     ENDIF                                                             BUG4069
      *
      ** Access table file for Hongkong interest tax rate (TAXR)
     C                     CALL 'AODEALR0'
     C                     PARM *BLANKS   @RTCD   7
     C                     PARM '*FIRST ' @OPTN   7
     C           SDDEAL    PARM SDDEAL    DSFDY
      *
      **  If there is any error in table file, seton U7, U8 & LR
      **  execute end process and exit
      *
     C           @RTCD     IFNE *BLANKS
     C           *LOCK     IN   LDA                        ***************
     C                     MOVEL'TABDLEI 'DBFILE
     C                     MOVEL@TABKY    DBKEY
     C                     Z-ADD17        DBASE            ***************
     C                     MOVEL'SDDEALPD'DBFILE           ** DB ERR 17 **
     C                     MOVEL@OPTN     DBKEY            ***************
     C                     EXSR DBERR
     C                     END
      *
      **  Store the Hongkong interest tax rate
     C                     Z-ADDBNHKTR    @TAXR
      *                                                                                       239182
      ** Access SAR Details file to determine if BRT SAR is installed                         239182
      *                                                                                       239182
     C                     CALL 'AOSARDR0'                                                    239182
     C                     PARM *BLANKS   @RTCD                                               239182
     C                     PARM '*VERIFY' @OPTN                                               239182
     C                     PARM 'S01383'  WSARD   6                                           239182
      *                                                                                       239182
      ** Handle Database Error                                                                239182
      *                                                                                       239182
     C           @RTCD     IFNE *BLANKS                                                       239182
     C           @RTCD     ANDNE'*NRF   '                                                     239182
     C           *LOCK     IN   LDA                                                           239182
     C                     MOVEL'SCSARDPD'DBFILE           ***************                    239182
     C                     Z-ADD6         DBASE            *DB ERROR 006 *                    239182
     C                     MOVEL'S01383  'DBKEY            ***************                    239182
     C                     OUT  LDA                                                           239182
     C                     EXSR *PSSR                                                         239182
     C                     ENDIF                                                              239182
      *                                                                                       239182
     C           @RTCD     IFEQ *BLANKS                                                       239182
     C                     MOVEL'Y'       S01383  1                                           239182
     C                     ENDIF                                                              239182
      *                                                                                       239182
      ** If BRT SAR installed, Access BRT Installation Control Data                           239182
      *                                                                                       239182
     C           S01383    IFEQ 'Y'                                                           239182
     C                     MOVE 'D'       BRTKEY  1                                           239182
     C           BRTKEY    CHAINSDBRTDD0             61                                       239182
      *                                                                                       239182
     C           *IN61     IFEQ '1'                                                           239182
     C           *LOCK     IN   LDA                                                           239182
     C                     MOVEL'SDBRTDPD'DBFILE           ***************                    239182
     C                     Z-ADD7         DBASE            *DB ERROR 007 *                    239182
     C                     MOVELBRTKEY    DBKEY            ***************                    239182
     C                     OUT  LDA                                                           239182
     C                     EXSR *PSSR                                                         239182
     C                     ENDIF                                                              239182
     C                     ENDIF                                                              239182
      *                                                                                     MD023322
      ** Check if CDL013 is switched on                                                     MD023322
      *                                                                                     MD023322
     C                     CALL 'AOSARDR0'                                                  MD023322
     C                     PARM *BLANKS   @RTCD                                             MD023322
     C                     PARM '*VERIFY' @OPTN                                             MD023322
     C                     PARM 'CDL013'  @SARD                                             MD023322
     C           SCSARD    PARM SCSARD    DSFDY                                             MD023322
      *                                                                                     MD023322
     C           @RTCD     IFEQ *BLANKS                                                     MD023322
      *                                                                                     MD023322
     C                     MOVEL'Y'       CDL013  1                                         MD023322
     C                     MOVEL'RETAIL'  WTYPE  10                                         MD023322
      *                                                                                     MD023322
      ** Access Withholding Tax file to retrieve WHT rate                                   MD023322
      *                                                                                     MD023322
     C           WTYPE     CHAINSDSTAAL1             70                                     MD023322
     C           *IN70     IFEQ '1'                                                         MD023322
     C                     EXSR *PSSR                                                       MD023322
     C                     ENDIF                                                            MD023322
      *                                                                                     MD023322
     C                     ELSE                                                             MD023322
      *                                                                                     MD023322
     C           @RTCD     IFNE '*NRF'                                                      MD023322
     C                     MOVEL'SCSARDPD'DBFILE                                            MD023322
     C                     Z-ADD50        DBASE                                             MD023322
     C                     MOVEL'CDL013'  DBKEY                                             MD023322
     C                     EXSR *PSSR                                                       MD023322
     C                     ENDIF                                                            MD023322
     C                     MOVE 'N'       CDL013                                            MD023322
      *                                                                                     MD023322
     C                     ENDIF                                                            MD023322
      *                                                                                     MD023322
     C/COPY WNCPYSRC,DLH00064
      *
     C                     CALL 'AOBANKR0'
     C                     PARM *BLANKS   @RTCD   7
     C                     PARM '*FIRST ' @OPTN   7
     C           SDBANK    PARM SDBANK    DSFDY
      *
      **  If there is any error in table file, seton U7, U8 & LR
      **  execute end process and exit
      *
     C           @RTCD     IFNE *BLANKS
     C           *LOCK     IN   LDA
     C                     Z-ADD14        DBASE            ***************
     C                     MOVEL'SDBANKPD'DBFILE           ** DB ERR 14 **
     C                     MOVEL@OPTN     DBKEY            ***************
     C                     EXSR DBERR                      *1
     C                     END                             E1
      *
      **  Get Midas run date in numeric & string format
     C                     MOVELBJMRDT    @RUNA
     C                     Z-ADDBJRDNB    @RUND
     C                     MOVELBJURPT    @TITL  53
     C                     MOVELBJDNWD    @DNWD
     C                     MOVELBJLCCY    @LOCY   3
      *
     C                     MOVELBJMRDT    RRRUNA
      *
      **  Get telex notice days for the local currency
      *
     C                     CALL 'AOCURRR0'
     C                     PARM *BLANKS   @RTCD   7
     C                     PARM '*KEY   ' @OPTN   7
     C                     PARM BJLCCY    @AJCD   3
     C           SDCURR    PARM SDCURR    DSSDY
     C           @RTCD     IFNE *BLANK
     C           *LOCK     IN   LDA
     C                     Z-ADD16        DBASE
     C                     MOVEL'SDCURRPD'DBFILE
     C                     MOVELBJLCCY    DBKEY
     C                     EXSR DBERR
     C                     END
      *
     C                     Z-ADDA6TXND    @TNOT
      *
      ** Access PF/SDMMODPD to check if multibranching
      ** indicator is on.
      *
     C                     CALL 'AOMMODR0'
     C                     PARM *BLANKS   @RTCD
     C                     PARM '*FIRST  '@OPTN
     C           SDMMOD    PARM SDMMOD    DSFDY
      *
     C           @RTCD     IFNE *BLANK
     C           *LOCK     IN   LDA                        ***************
     C                     Z-ADD21        DBASE            ** DB ERR 21 **
     C                     MOVEL'SDMMODPD'DBFILE           ***************
     C                     MOVEL@OPTN     DBKEY
     C                     EXSR DBERR
     C                     END
      *
     C           BGMBIN    IFEQ 'Y'
     C                     MOVE '1'       *IN50
     C                     END
      *                                                                                       243842
      ** Read AOGELRR1 to retrieve accrual/profit date/frequency                              243842
      *                                                                                       243842
     C                     CALL 'AOGELRR1'                                                    243842
     C                     PARM '*BLANKS' @RTCD                                               243842
     C                     PARM '*FIRST ' @OPTN                                               243842
     C           SDGELR    PARM SDGELR    DSSDY                                               243842
      *                                                                                       243842
     C           @RTCD     IFNE *BLANK                                                        243842
     C           *LOCK     IN   LDA                        ***************                    243842
     C                     Z-ADD25        DBASE            ** DB ERR 25 **                    243842
     C                     MOVEL'SDGELRPD'DBFILE           ***************                    243842
     C                     MOVEL@OPTN     DBKEY                                               243842
     C                     EXSR DBERR                                                         243842
     C                     END                                                                243842
      *
     C           #ZZ09     ENDSR
      *****************************************************************
      /EJECT
      *****************************************************************
     C           #ZZ20     BEGSR                           ** #ZZ20  **
      *
     C**********           Z-ADD1         Y       30                                  BUG8231 243473
     C                     Z-ADD5         Y       40                                          243473
     C                     Z-ADD0         W#TOTL                                             BUG8231
      *                                                                                      BUG8231
      ** Sum all elements of the array holding the Principal Amounts                         BUG8231
      *                                                                                      BUG8231
     C           Y         DOWLEX                                                            BUG8231
     C           Y         OCUR MULT                                                         BUG8231
     C                     ADD  TAMNP     W#TOTL                                             BUG8231
     C                     ADD  1         Y                                                  BUG8231
     C                     ENDDO                                                             BUG8231
      *                                                                                      BUG8231
     C                     Z-ADD999999    DLNO
     C           DLNO      CHAINDEALS                72
      *
     C           *IN72     IFEQ '0'
     C                     Z-ADDNORE      @NORE1  50
     C**********           ADD  @NORE     NORE                                               BUG4122
     C**********           ADD  @NORE     NLRA                                               BUG4122
     C**********           ADD  @NORE     NLRB                                       BUG3611 BUG4122
     C**********           MOVE VLAF      @AMT2                                              BUG3611
     C**********           MOVE VLAL      @AMT3                                              BUG3611
     C**********           MOVE VLAF      @VLAF  150                                         BUG3611
     C**********           MOVE VLAL      @VLAL   30                                         BUG3611
     C**********           Z-ADDVLBF      INT,1                                      BUG3611 BUG4122
     C**********           Z-ADDVLBL      DEC,1                                      BUG3611 BUG4122
     C**********           Z-ADDTPCPL     @AMT1                                     BUG3611 Bug03936
     C**********           Z-ADD1         S                                          BUG3611 BUG4122
     C**********           MOVE @AMT1     ZZAMT                                     BUG3611 Bug03936
     C**********           MOVE TPCPL     @AMT1                                      BUG3936 BUG4122
     C**********           MOVE TPCPL     ZZAMT                                      BUG3936 BUG4122
     C**********           EXSR ZHASH                                                BUG3611 BUG4122
     C**********           Z-ADDINT,1     VLBF                                       BUG3611 BUG4122
     C**********           Z-ADDDEC,1     VLBL                                       BUG3611 BUG4122
     C**********           Z-ADDINT,1     INT,2                                              BUG3611
     C**********           Z-ADDDEC,1     DEC,2                                              BUG3611
     C**********           Z-ADDVLAF      INT,2                                      BUG3611 BUG4122
     C**********           Z-ADDVLAL      DEC,2                                      BUG3611 BUG4122
     C**********           Z-ADD2         S                                                  BUG4122
     C**********           MOVE @AMT1     ZZAMT                                              BUG4122
     C**********           EXSR ZHASH                                                        BUG4122
     C**********           Z-ADDINT,2     VLAF                                               BUG4122
     C**********           Z-ADDDEC,2     VLAL                                               BUG4122
     C**********           Z-ADDNLRA      NLRB                                               BUG3611
     C**********           Z-ADDVLAF      VLBF                                               BUG3611
     C**********           Z-ADDVLAL      VLBL                                               BUG3611
     C**********           ADD  @NORE     NINS                                       BUG3838 BUG4122
     C**********           Z-ADDVRIF      INT,1                                      BUG3838 BUG4122
     C**********           Z-ADDVRIL      DEC,1                                      BUG3838 BUG4122
     C**********           Z-ADDTPCPL     @AMT1                                      BOI624 Bug03936
     C**********           Z-ADD1         S                                          BUG3838 BUG4122
     C**********           MOVE @AMT1     ZZAMT                                      BOI624 Bug03936
     C**********           MOVE TPCPL     @AMT1                                      BUG3936 BUG4122
     C**********           MOVE TPCPL     ZZAMT                                      BUG3936 BUG4122
     C**********           EXSR ZHASH                                                BUG3838 BUG4122
     C**********           Z-ADDINT,1     VRIF                                       BUG3838 BUG4122
     C**********           Z-ADDDEC,1     VRIL                                       BUG3838 BUG4122
      *                                                                                      BUG4122
      ** Update no. of records on file, inserted and after I/C                               BUG4122
      *                                                                                      BUG4122
     C                     ADD  @NORE     NORE                                               BUG4122
     C                     ADD  @NORE     NINS                                               BUG4122
     C                     ADD  @NORE     NLRA                                               BUG4122
      *                                                                                      BUG4122
      ** Update value of records inserted and total value of records on file                 BUG4122
      *                                                                                      BUG4122
     C**********           Z-ADDVRIF      INT,1                                      BUG4122 BUG8231
     C**********           Z-ADDVRIL      DEC,1                                      BUG4122 BUG8231
     C**********           Z-ADDVLAF      INT,2                                      BUG4122 BUG8231
     C**********           Z-ADDVLAL      DEC,2                                      BUG4122 BUG8231
     C                     MOVE TPCPL     @AMT1                                              BUG4122
     C                     MOVE TPCPL     ZZAMT                                              BUG4122
     C**********           Z-ADD1         S                                          BUG4122 BUG8231
     C**********           EXSR ZHASH                                                BUG4122 BUG8231
     C**********           Z-ADD2         S                                          BUG4122 BUG8231
     C**********           EXSR ZHASH                                                BUG4122 BUG8231
     C**********           Z-ADDINT,1     VRIF                                       BUG4122 BUG8231
     C**********           Z-ADDDEC,1     VRIL                                       BUG4122 BUG8231
     C**********           Z-ADDINT,2     VLAF                                       BUG4122 BUG8231
     C**********           Z-ADDDEC,2     VLAL                                       BUG4122 BUG8231
      *                                                                                      BUG4122
     C                     ADD  W#TOTN    VRIF                                               BUG8231
     C**********           ADD  W#TOTD    VRIL                                      BUG8231 BUG12835
      *                                                                                      BUG8231
      ** CHECK FOR CARRY OVER (OVERFLOW).                                                    BUG8231
      *                                                                                      BUG8231
     C                     Z-ADD0         @TOTDO                                             BUG8231
     C           W#TOTD    ADD  VRIL      @TOTDO  40                                         BUG8231
     C           @TOTDO    IFGT 999                                                          BUG8231
     C                     ADD  1         VRIF                                               BUG8231
     C                     ENDIF                                                             BUG8231
      *                                                                                     BUG12835
     C                     ADD  W#TOTD    VRIL                                              BUG12835
      *                                                                                      BUG8231
     C                     ADD  W#TOTN    VLAF                                               BUG8231
     C**********           ADD  W#TOTD    VLAL                                      BUG8231 BUG12835
      *                                                                                      BUG8231
      ** CHECK FOR CARRY OVER (OVERFLOW).                                                    BUG8231
      *                                                                                      BUG8231
     C                     Z-ADD0         @TOTDO                                             BUG8231
     C           W#TOTD    ADD  VLAL      @TOTDO  40                                         BUG8231
     C           @TOTDO    IFGT 999                                                          BUG8231
     C                     ADD  1         VLAF                                               BUG8231
     C                     ENDIF                                                             BUG8231
      *                                                                                     BUG12835
     C                     ADD  W#TOTD    VLAL                                              BUG12835
      *                                                                                      BUG8231
     C                     UPDATDEALSDFF               72
      *
     C                     COMIT                                                             BUG4847
     C                     END
      *
      **  Dummy read on file SDTIX
     C           *IN72     IFEQ '0'
     C           *IN72     ANDEQ'1'
     C                     READ DTRIXHF                  72
     C                     END
      *
     C           #ZZ29     ENDSR
      *****************************************************************
     C           CHKHOL    BEGSR                           ** CHKHOL **
      *
      *  FIND FD CCY WORKING DATE
     C                     MOVE HKCCY     ZCCY
     C                     MOVE @NMDAT    ZDAYNO
     C                     MOVE *BLANKS   ZLOC
     C                     Z-ADD0         ZNRDYS
     C                     EXSR ZFWDT
     C                     MOVE ZDYNBR    FDWRKD  50       FD CCY WORK DAY
      *
      *  FIND LOCAL CCY WORKING DATE
     C                     MOVE @LOCY     ZCCY
     C                     MOVE @NMDAT    ZDAYNO
     C                     MOVE *BLANKS   ZLOC
     C                     Z-ADD0         ZNRDYS
     C                     EXSR ZFWDT
     C                     MOVE ZDYNBR    LOWRKD  50       LOCY WORK DAY
      **
     C           LOWRKD    DOWNEFDWRKD
      **
     C           LOWRKD    IFGT FDWRKD
     C                     MOVE HKCCY     ZCCY
     C           FDWRKD    ADD  1         ZDAYNO
     C                     MOVE *BLANKS   ZLOC
     C                     Z-ADD0         ZNRDYS
     C                     EXSR ZFWDT
     C                     MOVE ZDYNBR    FDWRKD           FD CCY WORK DAY
     C                     ELSE
      **
     C                     MOVE @LOCY     ZCCY
     C           LOWRKD    ADD  1         ZDAYNO
     C                     MOVE *BLANKS   ZLOC
     C                     Z-ADD0         ZNRDYS
     C                     EXSR ZFWDT
     C                     MOVE ZDYNBR    LOWRKD           LOCY WORK DAY
     C                     END
     C                     END
     C                     MOVE LOWRKD    @NMDAT
     C                     ENDSR
3571  ********************************************************************
     C/COPY ZSRSRC,ZDAT10Z2                                                                  BUG3838
     C/COPY ZSRSRC,ZACCH
      /EJECT
     C/COPY ZSRSRC,ZCHKH
      /EJECT
     C/COPY ZSRSRC,ZBKDT
      /EJECT
     C/COPY ZSRSRC,ZFWDT
     C/COPY ZSRSRC,ZFRQAZ2
     C/COPY ZSRSRC,ZDATE1Z2
     C/COPY ZSRSRC,ZDATE2Z2
     C/COPY ZSRSRC,GLINTCZ1                                                                 MD023322
     C/COPY ZSRSRC,ZINTDYZ2                                                                 MD023322
     C/COPY ZSRSRC,ZDATE9Z3                                                                 MD023322
      *****************************************************************
      /EJECT
      *****************************************************************
** CPY@   **      OBJECT COPYRIGHT
(C) COPYRIGHT Finastra International Limited 2004
** @YD  USED BY SR. ZA0710 - YEARS, IN DAYS, CUMULATIVE IN 4 YEAR SPAN
00366007310109601461
** @MD  USED BY SR. ZA0710 - MONTHS IN DAYS CUMULATIVE THROUGH YEAR
00000000310005900090001200015100181002120024300273003040033400365
** @M  USED BY SR. MM1004 - DAYS IN A MONTH
312831303130313130313031
** @MN USED BY SR. ZA0660 - MONTH NAMES
JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC
**   SVAL  -  SYSTEM VALUES ARRAY
AutAuthRollDeal
RolloverDays
**   ZFMD  -  NUMBER OF DAYS IN THE MONTH
312831303130313130313031
**   ZYDY - YEARS IN DAYS CUMULATIVE, FOUR YEAR SPAN
0366073110961461
**   ZMDY - MONTHS IN DAYS CUMULATIVE THROUGH YEAR
000031059090120151181212243273304334365
**   ZMNM - MONTHS SHORT NAMES
JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC
