     H        1                                                           S01390
      *****************************************************************
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas DL Interest history purge report')               *
     H***********                                                         S01390
      *****************************************************************
      *                                                               *
      *  Midas - Dealing Module                                       *
      *                                                               *
      *     DL9111 - DEALING INTEREST HISTORY PURGE                   *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *  Last Amend No. MD047993           Date 23Sep17               *
      *  Prev Amend No. MD035545           Date 11Sep15               *
      *                 AR996895           Date 25Nov12               *
      *                 263666             Date 01Feb10               *
      *                 CER059             Date 19Jul10               *
      *                 CER016A            Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *                 246141             Date 26Mar07               *
      *                 164847             Date 30Nov06               *
      *                 BUG12990           Date 05Jan07               *
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 242286             Date 25Sep06               *
      *                 CSD031             Date 10Apr06               *
      *                 CSD027             Date 09Dec05               *
      *                 CDL038             Date 10May05               *
      *                 CIR013             Date 25Apr05               *
      *                 CSW037A            Date 02May05               *
      *                 CSD025             Date 11Jan05               *
      *                 CSW037             Date 15Dec04               *
      *                 CSW036             Date 15Dec04               *
      *                 CLE025             Date 20Oct03               *
      *                 CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 192749             Date 18Jun01               *
      * Midas DBA 3.04 -----------------------------------------------*
      *                 CSD007             Date 28Aug00               *
      * Midas DBA 3.03 -----------------------------------------------*
      *                 CIR004             Date 20Jan00               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 121768             Date 19Feb98               *
      *                 126017             Date 17Nov97               *
     F*                 097885             DATE 31JAN97                  *
     F*                 S01408             DATE 29AUG96                  *
     F*                 S01408             DATE 06JUN96                  *
     F*                 093198             DATE 18APR96                  *
     F*                 095244             DATE 01NOV95               *
     F*                 095238             DATE 31OCT95               *
     F*                 066550             DATE 04FEB94               *
     F*                 048911             DATE 23MAR93               *
     F*                 S01410             DATE 17FEB93               *
     F*                 S01390             DATE 12AUG92               *
     F*                 AUS006             DATE 18DEC90               *
     F*                 S36008             DATE 01/DEC/89                *
     F*                                                                  *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD047993 - Modified MD035545. Removed dependency on Accrue   *
      *             on Last Day indicator.                            *
      *  MD035545 - LE: Interest Calculation in Leap year. Consider   *
      *             Accrue on Last Day Indicator for method 6.        *
      *  AR996895 - Incorrect acrrual interest calculation            *
      *             (Child: AR996897) (Recompile)                     *
      *  263666 - Recompiled due to changes in ZINTDYZ2               *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER016A - German Interest Calculation: Upgarde of FGE059     *
      *            to Midas Plus (Recompile)                          *
      *  246141 - Recompiled due to changes in ZINTDYZ2               *
      *  164847 - Recompile over changes in /COPY ZINTDYZ2.           *
      *  BUG12990 - Recompiled due to changes in ZINTDYZ2/ZINTDYZ2LE  *
      *  242286 - Recompile over changes in /COPY ZINTDYZ2.           *
      *  CSD031 - Enhanced Centralised Static Data (Recompile)        *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CDL038 - Extended Deal Sub Type (Recompile)                  *
      *  CIR013 - Additional Calculation Method for FRA/IRS/CCF       *
      *           Recompile over GLINTC and ZINTDY.                   *
      *  CSW037A- Additional Field extended to 40 chars (recompile)   *
      *  CSD025 - Customer De-Activation                              *
      *  CSW037 - Additional Field Data on MT300/MT320                *
      *  CSW036 - Dual SWIFT BIC held on Client Details               *
      *  CLE025 - Credit Lines (Recompile)                            *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  192749 - Negative amount reported with Alpha characters.     *
      *  CSD007 - Customer Closing.                                   *
      *  CIR004 - Dealing Calculation Method Change.                  *
      *         - Recompiled due to GLINTC and ZINTDY changes         *
     F*  121768 - Recompile over changed GLINTCZ1                     *
     F*  126017 - Correction to interest calculation for calculation  *
     F*           basis 6 in SR/GLINTC. Add SR/ZDAT10                 *
     F*  097885 - Recompiled for wrong calculation of number of day      *
     F*           interest (ZINTDYZ2).                                   *
     F*  S01408 - Insertion of Hook DL9111CCP8                           *
     F*         - Insertion of Hook DL9111CCP9                           *
     F*         - Insertion of Hook DL9111CP10                           *
     F*         - Insertion of Hook DL9111CP11                           *
     F*         - Insertion of Hook DL9111CP12                           *
     F*         - Insertion of Hook DL9111CP13                           *
     F*         - Insertion of Hook DL9111CP14                           *
     F*         - Insertion of Hook DL9111CP15                           *
     F*         - Insertion of Hook DL9111CP16                           *
     F*         - Insertion of Hook DL9111CP17                           *
     F*         - Insertion of Hook DL9111CP18                           *
     F*         - Insertion of Hook DL9111CP19                           *
     F*         - Insertion of Hook DL9111CP20                           *
     F*         - Insertion of Hook DL9111CP21                           *
     F*         - Insertion of Hook DL9111CP22                           *
     F*         - Insertion of Hook DL9111CP23                           *
     F*         - Insertion of Hook DL9111CP24                           *
     F*         - Insertion of Hook DL9111CP25                           *
     F*         - Insertion of Hook DL9111CP26                           *
     F*         - Insertion of Hook DL9111CP27                           *
     F*         - Insertion of Hook DL9111CP28                           *
     F*         - Insertion of Hook DL9111CP29                           *
     F*         - Insertion of Hook DL9111CP30                           *
     F*         - Insertion of Hook DL9111CP31                           *
     F*         - Insertion of Hook DL9111CP32                           *
     F*         - Insertion of Hook DL9111FFP1                           *
     F*  S01408 - Insertion of Hook DL9111EEP2                           *
     F*         - Insertion of Hook DL9111EEP1                           *
     F*         - Insertion of Hook DL9111CCP7                           *
     F*         - Insertion of Hook DL9111CCP6                           *
     F*         - Insertion of Hook DL9111CCP5                           *
     F*         - Insertion of Hook DL9111CCP4                           *
     F*         - Insertion of Hook DL9111CCP3                           *
     F*         - Insertion of Hook DL9111CCP2                           *
     F*         - Insertion of Hook DL9111CCP1                           *
     F*  093198 - INTEREST HISTORY PURGE REPORT WRITE BEFORE OPEN        *
     F*           DUE TO EMPTY BRANCH CODE                               *
     F*  095244 - Recompiled for Calculation method 3                 *
     F*  095238 - Recompiled for Calculation method 3                 *
     F*  066550 - GLINTC has had historical problems and inaccuracies    *
     F*           and is now externaly descibed and changed to use       *
     F*           ZINTDYZ1. See document atached to error no on GEMS     *
     F*  048911 - Recompile over changes made to DL9111P1.               *
     F*                                                                  *
     F*  S01410 - Release 10.04 packaging change: program would no    *
     F*           longer compile due to the removal of ZSYSTM, by     *
     F*           S01390 and a later, incompatible change to GLINTC.  *
     F*     S01390 - Release 10 Changes for Australianisation            *
     F*     AUS006 - AUSTRALIAN PRODUCT - INTEREST HISTORY               *AUS006
     F*     S36008 - INTEREST HISTORY ENQUIRY AND PURGE                  *
     F*                                                                  *
     F********************************************************************
     F*
     F*  C R E A T I O N     P A R A M E T E R S                      *
     F*                                                               *
     F*                                                               *
     F********************************************************************
     F***DL9111P1O***E             18     PRINTER                         S01390
     FDL9111P1O   E             18     PRINTER      KINFDS SPOOL1     UC  S01390
     FDL9111AUO   E                    PRINTER      KINFDS SPOOLU         S01390
     F*
     F***CLINT***IF**E           K        DISK                            S01390
     F*********** CLINTCAF                          KIGNORE               S01390
     F*********** CLINTC1F                          KIGNORE               S01390
     F***********                                                         S01390
     F***TABDLEE*IF**E           K        DISK                            S01390
     F*********** TABLETAF                          KIGNORE               S01390
     F*********** TABTB20F                          KIGNORE               S01390
     F*********** TABTB40F                          KIGNORE               S01390
     F*********** TABTG20F                          KIGNORE               S01390
     F*********** TABLETHF                          KIGNORE               S01390
     F*********** TABLETIF                          KIGNORE               S01390
     F*********** TABLETKF                          KIGNORE               S01390
     F*********** TABLETLF                          KIGNORE               S01390
     F*********** TABLETMF                          KIGNORE               S01390
     F*********** TABLETPF                          KIGNORE               S01390
     F*********** TABLETSF                          KIGNORE               S01390
     F*********** TABLET1F                          KIGNORE               S01390
     F*********** TABLET2F                          KIGNORE               S01390
     F*********** TABLET5F                          KIGNORE               S01390
     F*
     FHISTPAA IF  E           K        DISK
     F            HISTPAAF                          KRENAMESTHST1F
     F*
     F/COPY WNCPYSRC,DL9111FFP1                                           S01408
     F/EJECT
     F********************************************************************
     F* ID F  C  H  L    FUNCTION OF INDICATORS
     F********************************************************************
     F*
     F*       10         AT LEAST 1 RECORD READ TO BE PROCESSED.
     F*             11   LEVEL BREAK ON BRANCH  (L4).
     F*             12   LEVEL BREAK ON CCY  (L3).
     F*             13   LEVEL BREAK ON CUSTOMER  (L2).
     F*             14   LEVEL BREAK ON DEAL NUMBER  (L1).
     F*       20         CURRENCY HAS 0 DECIMAL PLACES.
     F*       21         CURRENCY HAS 1 DECIMAL PLACES.
     F*       22         CURRENCY HAS 2 DECIMAL PLACES.
     F*       23         CURRENCY HAS 3 DECIMAL PLACES.
     F*       30         END OF HISTPAA INDICATOR.
     F*       31         END OF HISTPAA IN ERROR ROUTINE.
     F*       50         WORK INDICATOR.
     F*       51         WORK INDICATOR.
     F*       80         CHAIN FAIL TO CLINT FILE.
     F*       85         SIGN REQUIRED FOR FORMATTED OUTPUT FIELD
     F*       86         DECIMAL POINT INPUT TO FORMATTED OUTPUT FIELD
     F*       89         ERROR OCCURED WHEN FORMATTING OUTPUT FIELD
     F*     90-99        STANDARD SUBROUTINE INDICATORS.
     F*
     F*
     F/EJECT
     E*
     E                    ZYDY    4   4  4 0             ZDATE1/2 SR.ARRAY
     E                    ZMDY   13  13  3 0             ZDATE1/2 SR.ARRAY
     E                    ZMNM   12  12  3               ZDATE2 SR. ARRAY
     E*                                                                   S01408
     E*                                                                   S01408
     E/COPY WNCPYSRC,DL9111EEP1                                           S01408
     E*                                                                   S01408
     E*
     E                    NRTP    1  15  2   NRDS   11   NARRATIVES
     E*                                                                   S01408
     E*                                                                   S01408
     E/COPY WNCPYSRC,DL9111EEP2                                           S01408
     E*                                                                   S01408
     E*                                                                   S01408
     E                    LONT    5   5  2               LOAN TYPES
     E                    DEPT    4   4  2               DEPOSIT TYPES
     E                    ZAR1       20  1               AMOUNT ARRAY 1
     E                    ZAR2       20  1               AMOUNT ARRAY 2
     E                    CPY@    1   1 80                                S01390
     E*
     E/COPY ZSRSRC,ZDATE9Z1                                               066550
     E/EJECT
     I            DS
     I*    DATA STRUCTURE CONTAINING NEW RECORD
     I**                                      1  96 NREC                  E36489
     I                                        1 104 NREC                  E36489
     I                                        1   2 RTYP
     I                                        3   70EDAT
     I                                        8  130DLNO
     I                                       14  280PCPL
     I                                       29  418NRAT
     I                                       42  548ORAT
     I***********                            55  570BRCD                  S01390
     I                                       55  57 BRCA                  S01390
     I                                       58  60 CCY
     I                                       61  61 INTC
     I                                       62  760EAMT
     I***********                            77  790BRCC                  S01390
     I                                       77  79 BRCC                  S01390
     I                                       80  87 CASK
     I                                       88  88 ICBS
     I                                       89  930MDAT
     I                                       94  96 TERM
     I**********                             97 1020CNUM                               E36489 CSD027
     I                                       97 102 CNUM                                      CSD027
     I                                      103 104 DTYP
     I            DS
     I*    DATA STRUCTURE CONTAINING OLD RECORD
     I**                                      1  96 OREC                  E36489
     I                                        1 104 OREC                  E36489
     I                                        1   2 ORTYP
     I                                        3   70OEDAT
     I                                        8  130ODLNO
     I                                       14  280OPCPL
     I                                       29  418ONRAT
     I                                       42  548OORAT
     I***********                            55  570OBRCD                 S01390
     I                                       55  57 OBRCA                 S01390
     I                                       58  60 OCCY
     I                                       61  61 OINTC
     I                                       62  760OEAMT
     I***********                            77  790OBRCC                 S01390
     I                                       77  79 OBRCC                 S01390
     I                                       80  87 OCASK
     I                                       88  88 OICBS
     I                                       89  930OMDAT
     I                                       94  96 OTERM
     I**********                             97 1020OCNUM                              E36489 CSD027
     I                                       97 102 OCNUM                                     CSD027
     I                                      103 104 ODTYP
     I*********** DS                                                      S01390
     I***********                             1  12 TABKY                 S01390
     I***********                             1   2 TABKY1                S01390
     I***********                             9  11 TABKY2                S01390
     I***********                            12  12 TABKY3                S01390
     I***********                            10  12 TABKY4                S01390
     I*
     I***LDA********UDS                            256                    S01390
     I***********                           129 133 DBFILE                S01390
     I***********                           134 162 DBKEY                 S01390
     I***********                           163 170 DBPGM                 S01390
     I***********                           171 172 DBASE                 S01390
     ILDA         DS                            256                       S01390
     I*                                                                   S01390
     I** Local Data Area To Identify Database Errors                      S01390
     I*                                                                   S01390
     I                                      134 141 DBFILE                S01390
     I                                      142 170 DBKEY                 S01390
     I                                      171 180 DBPGM                 S01390
     I                                      181 1830DBASE                 S01390
     I*                                                                   S01390
     IRUNDT       DS                                                      S01390
     I                                       13  13 MBIN                  S01390
     I*                                                                   S01390
     ISDBANK    E DSSDBANKPD                                              S01390
     I* Bank Details Accesses Via Access Program                          S01390
     I*                                                                   S01390
     ISDBRCH    E DSSDBRCHPD                                              S01390
     I* Branch Details Accessed Via Access Program                        S01390
     I*                                                                   S01390
     ISDCURR    E DSSDCURRPD                                              S01390
     I* Currency Details Accessed Via Access Program                      S01390
     I*                                                                   S01390
     ISDCUST    E DSSDCUSTPD                                              S01390
     I* Customer Details Accessed Via Access Program                      S01390
     I              QQDFAC                          #DFAC1                                    CGL029
     I*                                                                   S01390
     ISCSARD    E DSSCSARDPD                                              CSD007
     I* SAR Details Accessed Via Access Program                           CSD007
     I*                                                                   CSD007
     I***SDGELR*   E DSSDGELRPD                                                    MD035545 MD047993
     I**GENERAL*LEDGER*DETAILS*ACCESSED*VIA*ACCESS*PROGRAM*************            MD035545 MD047993
     IDSFDY     E DSDSFDY                                                 S01390
     I* First DS For Access Programs, Short Data Structure                S01390
     I*                                                                   S01390
     IDSSDY     E DSDSSDY                                                 S01390
     I* Second DS For Access Programs, Long Data Structure                S01390
     I*                                                                   S01390
     IDSLDY     E DSDSLDY                                                 CSD007
      ** Third DS for access programs, very long data structure           CSD007
      *                                                                   CSD007
     ISPOOL1      DS                                                      S01390
     I**    SPOOL FILE INFORMATION DATA STRUCTURE FOR P1                  S01390
     I                                       83  92 SFILE1                S01390
     I                                    B 123 1240SFNUM1                S01390
     I*                                                                   S01390
     ISPOOLU      DS                                                      S01390
     I**    SPOOL FILE INFORMATION DATA STRUCTURE FOR AU                  S01390
     I                                       83  92 SFILEU                S01390
     I                                    B 123 1240SFNUMU                S01390
     I*
     I              'LECalcBasis6LeapYear'C         WPARML                                  MD035545
     I*
     I/COPY ZSRSRC,ZINTDYZ1                                               066550
     I/COPY ZSRSRC,ZDATE9Z2                                               066550
     I/COPY ZSRSRC,ZDAT10Z1                                               126017
     I/EJECT
     I/COPY WNCPYSRC,DL9111I001
     C********************************************************************
     C*
     C*    M A I N L I N E.
     C*
     C*    FIRST CYCLE PROCESSING
     C*
     C                     EXSR FIRSTC
     C*
     C*    SET UP LOOP TO READ FILE
     C*
     C                     MOVE OFF       *IN30
     C                     READ HISTPAA                  30
     C           *IN30     DOWEQOFF
     C*
     C*    ACCUMULATE DELETED RECORD TOTALS
     C*
     C                     ADD  1         TOTD
     C*
     C*    CHECK FOR LEVEL BREAK.
     C*
     C                     EXSR LEVBRK
     C*
     C*    PROCESS PREVIOUS EVENT.
     C*
     C           *IN10     IFEQ ON
     C                     EXSR PROCSS
     C*
     C*    OUPUT PREVIOUS EVENT
     C*
     C                     EXSR OUTDET
     C*
     C*    IF LEVEL BREAK ON DEAL ADD AMOUNTS TO TOTALS.
     C*
     C           *IN14     IFEQ ON
     C                     EXSR DEALSR                     DEAL TOTALS
     C                     END
     C*
     C*    IF LEVEL BREAK ON CUSTOMER THEN PRINT CUST NAME AND ADDRESS
     C*
     C           *IN13     IFEQ ON
     C                     EXSR CSTTSR                     CUST TOTALS
     C                     ELSE
     C*
     C*    IF OVERFLOW THEN PRINT HEADINGS ON NEXT PAGE.
     C*
     C           *IN18     IFEQ ON
     C                     WRITECUHEAD                     OVERFLOW
     C           *IN14     IFEQ OFF
     C                     WRITEDLHEAD
     C                     END
     C                     MOVE OFF       *IN18
     C                     END
     C                     END
     C*
     C                     END
     C*                                                                   S01390
     C** Only process if branch was requested.                            S01390
     C*                                                                   S01390
     C           ENT       IFEQ 'ALL'                                     S01390
     C           ENT       OREQ '   '                                     S01390
     C           ENT       OREQ BRCC                                      S01390
     C*
     C*    SET UP NEW BRANCH INFORMATION
     C*
     C           *IN11     IFEQ ON
     C                     EXSR BRHBRK
     C                     END
     C*
     C*    SET UP NEW CCY INFORMATION
     C*
     C           *IN12     IFEQ ON
     C                     EXSR CCYBRK
     C                     END
     C*
     C*    SET UP NEW CUSTOMER INFORMATION  AND PRINT HEADINGS.
     C*
     C           *IN13     IFEQ ON
     C                     EXSR CSTBRK
     C           *IN80     IFNE ON
     C                     WRITECUHEAD
     C                     END
     C                     END
     C*
     C*    SET UP NEW DEAL INFORMATION AND PRINT DEAL HEADING.
     C*
     C           *IN14     IFEQ ON
     C                     EXSR DLBRK
     C                     WRITEDLHEAD
     C                     END
     C*
     C*    SAVE CURRENT DEAL FOR PROCESSING.
     C*
     C                     EXSR DETAIL
     C*
     C*    SET ON RECORD READ INDICATOR.
     C*
     C                     MOVE ON        *IN10            1ST REC READ
     C                     END                                            S01390
     C*
     C*    READ NEXT RECORD.
     C*
     C                     READ HISTPAA                  30
     C                     END
     C*
     C*    PROCESS LAST EVENT AND OUTPUT.
     C*
     C           *IN10     IFEQ ON
     C                     MOVE ON        *IN14
     C                     EXSR PROCSS
     C*
     C*    OUPUT PREVIOUS EVENT
     C*
     C                     EXSR OUTDET
     C*
     C*    ADD AMOUNTS TO TOTALS.
     C*
     C                     EXSR DEALSR                     DEAL TOTALS
     C*
     C*    PRINT CUST NAME AND ADDRESS
     C*
     C                     EXSR CSTTSR                     CUST TOTALS
     C                     END
     C*
     C*    OUTPUT CONTROL REPORT AND TERMINATE PROGRAM.
     C*
     C                     EXSR CNTROL
     C                     MOVE ON        *INLR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*      FIRST IS A SUBROUTINE TO PERFORM ALL FIRST CYCLE
     C*      CALCULATIONS.
     C*
     C           FIRSTC    BEGSR                           *** FIRSTC ***
     C*
     C           *ENTRY    PLIST
     C                     PARM           PRDAT   7
     C                     PARM           SEQ     5                       S01390
     C                     PARM           ENT     3                       S01390
     C/COPY WNCPYSRC,DL9111C002
     C*
     C*
     C*    INITILIZE STANDARD VARIABLES & FIRST CYCLE AMOUNT
     C*
     C           *NAMVAR   DEFN           LDA                             S01390
     C           *LOCK     IN   LDA                                       S01390
     C                     MOVEL'DL9111'  DBPGM
     C                     OUT  LDA                                       S01390
     C           *NAMVAR   DEFN RUNDAT    RUNDT                           S01390
     C                     IN   RUNDT                                     S01390
     C                     MOVE '1'       ON      1
     C                     MOVE '0'       OFF     1
     C                     MOVE ON        *IN51
     C                     MOVEACPY@      BIS@   80                       S01390
     C*
     C*    KEY LIST FOR STHST2 FILE.
     C*
     C           KYHST2    KLIST
     C***********          KFLD           KY01    30       BRANCH         S01390
     C                     KFLD           KY01    3        BRANCH         S01390
     C                     KFLD           KY02    3        CCY
     C                     KFLD           KY03    8        CUST ALPHA
     C                     KFLD           KY04    60       CUST NO.       E36489
     C***********                                                         S01390
     C*****KEY*LIST*FOR*CLINT*FILE.***************************************S01390
     C***********                                                         S01390
     C***********CLTKY     KLIST                                          S01390
     C***********          KFLD           CLKY01  60       CUST           S01390
     C***********          KFLD           CLKY02  1        REC TYPE       S01390
     C*
     C*    INITILIZE LEVEL BREAK FIELDS.
     C*
     C                     MOVE *BLANKS   OCCY
     C                     MOVE *BLANKS   OBRCC
     C                     MOVE *BLANKS   OCASK
     C                     MOVE *BLANKS   ODLNO
     C                     MOVE *BLANKS   OCNUM                           E36489
     C*
     C*****ICD.*1*********************************************************S01390
     C*    ACCESS BANK DETAILS                                            S01390
     C*
     C***********          EXSR ZSYSTM                                    S01390
     C                     CALL 'AOBANKR0'                                S01390
     C                     PARM '*DBERR ' RTCD    7                       S01390
     C                     PARM '*FIRST ' OPTN    7                       S01390
     C           SDBANK    PARM SDBANK    DSFDY                           S01390
     C************IN99     IFEQ ON                                        S01390
     C***********          MOVEL'TABLE'   DBFILE                          S01390
     C***********          MOVELZTABKY    DBKEY                           S01390
     C***********          MOVE '01'      DBASE                           S01390
     C***********          MOVE ON        *INLR                           S01390
     C***********          MOVE ON        *INU8                           S01390
     C***********          ELSE                                           S01390
     C***********          MOVELTITL      TITLT  40                       S01390
     C                     MOVELBJURPT    TITLT  40                       S01390
     C***********          END                                            S01390
     C*                                                                   S01410
     C** Check the date format.                                           S01410
     C           BJDFIN    IFEQ 'M'                                       S01410
     C                     SETON                     98                   S01410
     C                     END                                            S01410
      *                                                                   CSD007
      ** Access Switchable Features file and check if CSD007              CSD007
      ** is switched on or not.                                           CSD007
      *                                                                   CSD007
     C                     CALL 'AOSARDR0'                                CSD007
     C                     PARM *BLANKS   RTCD    7                       CSD007
     C                     PARM '*VERIFY' OPTN    7                       CSD007
     C                     PARM 'CSD007'  KYSAR   6                       CSD007
     C           SCSARD    PARM SCSARD    DSFDY                           CSD007
      *                                                                   CSD007
     C           RTCD      IFEQ *BLANKS                                   CSD007
     C                     MOVE 'Y'       CSD007  1                       CSD007
      *                                                                   CSD007
     C                     ELSE                                           CSD007
     C                     MOVE 'N'       CSD007                          CSD007
      *                                                                   CSD007
      ** Database Error, if Return Code is not blanks or *NRF             CSD007
      *                                                                   CSD007
     C           RTCD      IFNE '*NRF   '                                 CSD007
     C           *LOCK     IN   LDA                                       CSD007
     C                     MOVEL'SCSARDPD'DBFILE                          CSD007
     C                     MOVEL'007'     DBASE                           CSD007
     C                     MOVEL'CSD007  'DBKEY                           CSD007
     C                     OUT  LDA                                       CSD007
     C                     MOVE *ON       *INU7                           CSD007
     C                     MOVE *ON       *INU8                           CSD007
     C                     MOVE *ON       *INLR                           CSD007
     C                     ENDIF                                          CSD007
     C                     ENDIF                                          CSD007
      *****************************************************************            MD035545 MD047993
      ***Call*access*program*for*General*Ledger*details.***************            MD035545 MD047993
      *****************************************************************            MD035545 MD047993
     C**********           CALL 'AOGELRR1'                                         MD035545 MD047993
     C**********           PARM '*MSG   ' @RTCD   7                                MD035545 MD047993
     C**********           PARM '*FIRST ' @OPTN   7                                MD035545 MD047993
     C********** SDGELR    PARM SDGELR    DSSDY                                    MD035545 MD047993
      *                                                                                     MD035545
     C********** @RTCD     IFNE *BLANK                                             MD035545 MD047993
     C**********           MOVEL'SDGELRPD'DBFILE                                   MD035545 MD047993
     C**********           MOVEL'062'     DBASE                                    MD035545 MD047993
     C**********           MOVEL@OPTN     DBKEY                                    MD035545 MD047993
     C**********           MOVE ON        *INLR                                    MD035545 MD047993
     C**********           MOVE ON        *INU8                                    MD035545 MD047993
     C**********           ENDIF                                                   MD035545 MD047993
      *                                                                                     MD035545
      ** Retrieve system value setting                                                      MD035545
      *                                                                                     MD035545
     C                     MOVELWPARML    P@OP01                                            MD035545
     C                     CALL 'AOSVALR0'                                                  MD035545
     C                     PARM *BLANKS   W0RTCD  7                                         MD035545
     C                     PARM           P@OP01 20                                         MD035545
     C                     PARM           P@VL01200                                         MD035545
     C                     PARM           P@OP02 20                                         MD035545
     C                     PARM           P@VL02200                                         MD035545
     C                     PARM           P@OP03 20                                         MD035545
     C                     PARM           P@VL03200                                         MD035545
     C                     PARM           P@OP04 20                                         MD035545
     C                     PARM           P@VL04200                                         MD035545
     C                     PARM           P@OP05 20                                         MD035545
     C                     PARM           P@VL05200                                         MD035545
     C                     PARM           P@OP06 20                                         MD035545
     C                     PARM           P@VL06200                                         MD035545
     C                     PARM           P@OP07 20                                         MD035545
     C                     PARM           P@VL07200                                         MD035545
     C                     PARM           P@OP08 20                                         MD035545
     C                     PARM           P@VL08200                                         MD035545
     C                     PARM           P@OP09 20                                         MD035545
     C                     PARM           P@VL09200                                         MD035545
     C                     PARM           P@OP10 20                                         MD035545
     C                     PARM           P@VL10200                                         MD035545
      *                                                                                     MD035545
      ** If system value is not found then default value to 'N'                             MD035545
      *                                                                                     MD035545
     C           W0RTCD    IFNE '       '                                                   MD035545
     C                     MOVE 'N'       WCALC6                                            MD035545
     C                     ELSE                                                             MD035545
     C                     MOVELP@VL01    WCALC6                                            MD035545
     C********** WCALC6    IFEQ 'Y'                                                MD035545 MD047993
     C********** BKALDI    ANDEQ'Y'                                                MD035545 MD047993
     C**********           MOVE 'Y'       WCALC6                                   MD035545 MD047993
     C**********           ELSE                                                    MD035545 MD047993
     C**********           MOVE 'N'       WCALC6                                   MD035545 MD047993
     C**********           ENDIF                                                   MD035545 MD047993
     C                     ENDIF                                                            MD035545
     C*
     C*    INITILIZE PARAMETERS FOR FORMAT SUBROUTINE.
     C*
     C                     Z-ADD13        ZCHRO
     C                     MOVE ' '       ZSIGNT
     C                     MOVE ' '       ZSIGN
     C                     MOVE 'Y'       ZCOMA
     C*
     C           ENDFC     ENDSR                           *** ENDFC  ***
     C*
     C/EJECT
     C********************************************************************
     C*
     C*      LEVBRK SR  CHECKS FOR A CHANGE IN CCY, BRCH, CUST & DLNO.
     C*
     C           LEVBRK    BEGSR                           *** LEVBRK ***
     C*
     C*    RESET ALL BREAK INDICATORS.
     C*
     C                     MOVE OFF       *IN11            BRANCH
     C                     MOVE OFF       *IN12            CCY
     C                     MOVE OFF       *IN13            CUSTOMER
     C                     MOVE OFF       *IN14            DEAL
     C*
     C*    CHANGE OF BRANCH.
     C*
     C           BRCC      IFNE OBRCC
     C                     MOVE ON        *IN11            NEW BRANCH
     C                     MOVE ON        *IN12            NEW CCY
     C                     MOVE ON        *IN13            NEW CUSTOMER
     C                     MOVE ON        *IN14            NEW DEAL
     C                     ELSE
     C*
     C*    CHANGE OF CURRENCY.
     C*
     C           CCY       IFNE OCCY
     C                     MOVE ON        *IN12            NEW CCY
     C                     MOVE ON        *IN13            NEW CUSTOMER
     C                     MOVE ON        *IN14            NEW DEAL
     C                     ELSE
     C*
     C*    CHANGE OF CUSTOMER.
     C*
     C**         CASK      IFNE OCASK                                     E36489
     C           CNUM      IFNE OCNUM                                     E36489
     C                     MOVE ON        *IN13            NEW CUSTOMER
     C                     MOVE ON        *IN14            NEW DEAL
     C                     ELSE
     C*
     C*    CHANGE OF DEAL.
     C*
     C           DLNO      IFNE ODLNO
     C                     MOVE ON        *IN14            NEW DEAL
     C                     END
     C                     END
     C                     END
     C                     END
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*      PROCSS SR  FORMAT PREVIOUS EVENT RECORD.
     C*
     C           PROCSS    BEGSR                           *** PROCSS ***
     C/COPY WNCPYSRC,DL9111C001
     C*
     C*    IF LAST EVENT FOR DEAL USE RUND AS NEXT EVENT DATE
     C*
     C           *IN14     IFEQ ON
     C***********          Z-ADDRUND      NXTDAT  50                      S01390
     C                     Z-ADDBJRDNB    NXTDAT  50                      S01390
     C                     ELSE
     C                     Z-ADDEDAT      NXTDAT
     C                     END
     C*
     C*    BLANK OUT AMOUNT HOLDING FIELDS
     C*
     C                     MOVE *BLANKS   HAMT   20
     C                     MOVE *BLANKS   HBAL   20
     C                     MOVE *BLANKS   HINT   20
     C*
     C*    FORMAT EVENT DATE.
     C*
     C                     Z-ADDOEDAT     ZDAYNO
     C                     EXSR ZDATE2
     C                     MOVE ZADATE    EDATE   7
     C*
     C*    NARRATIVE.
     C*
     C                     MOVE *BLANKS   NARR   11
     C                     Z-ADD1         X       20
     C           ORTYP     LOKUPNRTP,X                   50
     C                     MOVELNRDS,X    NARR
     C*
     C* CHECK IF DEAL TYPE A LOAN OR A DEPOSIT
     C*
     C                     MOVE *BLANK    DLFLAG  1
     C           ODTYP     LOKUPLONT                     99
     C           *IN99     IFEQ ON
     C                     MOVE 'L'       DLFLAG
     C           ORTYP     IFEQ 'LD'
     C                     MOVE *BLANKS   NARR
     C                     MOVEL'LOAN'    NARR
     C                     END
     C                     ELSE
     C           ODTYP     LOKUPDEPT                     99
     C           *IN99     IFEQ ON
     C                     MOVE 'D'       DLFLAG
     C                     END
     C                     END
     C                     MOVE OFF       BFFLAG
     C           ORTYP     IFEQ 'BF'
     C                     MOVE 'OB'      ORTYP
     C                     MOVE ON        BFFLAG  1
     C                     END
     C*
     C*    LOAN PROCESSING
     C*
     C           DLFLAG    IFEQ 'L'
     C*
     C*    PROCESSING FOR RECORD TYPE LD (LODGEMENT), IB
     C*       (INTERIM BALANCE) OR OB (OPENING BALANCE).
     C*
     C           ORTYP     IFEQ 'LD'
     C           ORTYP     OREQ 'IB'
     C           ORTYP     OREQ 'OB'
     C                     EXSR PROCOB
     C                     ELSE
     C*
     C*    PROCESSING FOR RECORD TYPE PI (PRINCIPLE INCREASE)
     C*
     C           ORTYP     IFEQ 'PI'
     C                     EXSR PROCPI
     C                     ELSE
     C*
     C*    PROCESSING FOR RECORD TYPE PD (PRINCIPLE DECREASE)
     C*
     C           ORTYP     IFEQ 'PD'
     C                     EXSR PROCPD
     C                     ELSE
     C*
     C*    PROCESSING FOR RECORD TYPE IA (INTEREST ADJUSTMENT)
     C*
     C           ORTYP     IFEQ 'IA'
     C                     EXSR PROCIA
     C                     ELSE
     C*
     C*    PROCESSING FOR RECORD TYPE FA (SERVICE CHARGES)
     C*
     C           ORTYP     IFEQ 'FA'
     C                     EXSR PROCFA
     C                     ELSE
     C*
     C*    PROCESSING FOR RECORD TYPE SC (RATE RENEGOTIATION)
     C*
     C           ORTYP     IFEQ 'SC'
     C                     EXSR PROCSC
     C                     ELSE
     C*
     C*    PROCESSING FOR RECORD TYPE MA (MATUTITY)
     C*
     C           ORTYP     IFEQ 'MA'
     C                     EXSR PROCMA
     C                     ELSE
     C*
     C*    PROCESSING FOR RECORD TYPE IP (INTEREST PAYMENT)
     C*
     C           ORTYP     IFEQ 'IP'
     C                     EXSR PROCIP
     C                     ELSE
     C*
     C*    PROCESSING FOR RECORD TYPE CB (CLOSING BALANCE)
     C*
     C           ORTYP     IFEQ 'CB'
     C                     EXSR PROCCB
     C                     ELSE
     C*
     C*    PROCESSING FOR RECORD TYPE RO (ROLLOVER)
     C*
     C           ORTYP     IFEQ 'RO'
     C                     EXSR PROCRO
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C*
     C*
     C                     END
     C*
     C*  DEPOSIT PROCESSING
     C*
     C           DLFLAG    IFEQ 'D'
     C*
     C*    PROCESSING FOR RECORD TYPE LD (LODGEMENT), IB
     C*       (INTERIM BALANCE) OR OB (OPENING BALANCE).
     C*
     C           ORTYP     IFEQ 'LD'
     C           ORTYP     OREQ 'IB'
     C           ORTYP     OREQ 'OB'
     C                     EXSR PRDCOB
     C                     ELSE
     C*
     C*    PROCESSING FOR RECORD TYPE PI (PRINCIPLE INCREASE)
     C*
     C           ORTYP     IFEQ 'PI'
     C                     EXSR PRDCPI
     C                     ELSE
     C*
     C*    PROCESSING FOR RECORD TYPE PD (PRINCIPLE DECREASE)
     C*
     C           ORTYP     IFEQ 'PD'
     C                     EXSR PRDCPD
     C                     ELSE
     C*
     C*    PROCESSING FOR RECORD TYPE IA (INTEREST ADJUSTMENT)
     C*
     C           ORTYP     IFEQ 'IA'
     C                     EXSR PRDCIA
     C                     ELSE
     C*
     C*    PROCESSING FOR RECORD TYPE FA (SERVICE CHARGE ADJUSTMENT)
     C*
     C           ORTYP     IFEQ 'FA'
     C                     EXSR PRDCFA
     C                     ELSE
     C*
     C*    PROCESSING FOR RECORD TYPE FD (SERVICE CHARGES)
     C*
     C           ORTYP     IFEQ 'FD'
     C                     EXSR PRDCFD
     C                     ELSE
     C*
     C*    PROCESSING FOR RECORD TYPE SC (RATE RENEGOTIATION)
     C*
     C           ORTYP     IFEQ 'SC'
     C                     EXSR PRDCSC
     C                     ELSE
     C*
     C*    PROCESSING FOR RECORD TYPE TX (WITHHOLDING TAX)
     C*
     C           ORTYP     IFEQ 'TX'
     C*                                                                   S01408
     C*                                                                   S01408
     C*/COPY WNCPYSRC,DL9111CCP1                                          S01408
     C*                                                                   S01408
     C*                                                                   S01408
     C                     EXSR PRDCTX
     C                     ELSE
     C*
     C*    PROCESSING FOR RECORD TYPE MA (MATUTITY)
     C*
     C           ORTYP     IFEQ 'MA'
     C                     EXSR PRDCMA
     C                     ELSE
     C*
     C*    PROCESSING FOR RECORD TYPE IP (INTEREST PAYMENT)
     C*
     C           ORTYP     IFEQ 'IP'
     C                     EXSR PRDCIP
     C                     ELSE
     C*
     C*    PROCESSING FOR RECORD TYPE CB (CLOSING BALANCE)
     C*
     C           ORTYP     IFEQ 'CB'
     C                     EXSR PRDCCB
     C                     ELSE
     C*
     C*    PROCESSING FOR RECORD TYPE RO (ROLLOVER)
     C*
     C           ORTYP     IFEQ 'RO'
     C                     EXSR PRDCRO
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C*
     C                     END
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*      OUTDET SR  OUTPUT PREVIOUS EVENT RECORD.
     C*
     C           OUTDET    BEGSR                           *** OUTDET ***
     C*
     C*    MOVE AMOUNT HOLDING FIELDS TO OUTPUT FIELDS.
     C*
     C                     MOVE HAMT      PAMT
     C                     MOVE HBAL      PBAL
     C                     MOVE HINT      PINT
     C*
     C*    OUTPUT DETAIL LINE.
     C*
     C                     WRITEDETLIN
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    CCYBRK SR. GET NEW CURRENCY INFORMATION.
     C*
     C           CCYBRK    BEGSR                           *** CCYBRK ***
     C*
     C*****CHAIN*TO*CCY*REC*ON*TABLE*FILE.********************************S01390
     C*    ACCESS CURRENCIES FILE.                                        S01390
     C*
     C***********          MOVE *BLANKS   TABKY                           S01390
     C***********          MOVE '20'      TABKY1                          S01390
     C***********          MOVE CCY       TABKY2                          S01390
     C***********          MOVE '1'       TABKY3                          S01390
     C***********TABKY     CHAINTABDLEE              99                   S01390
     C                     CALL 'AOCURRR0'                                S01390
     C                     PARM *BLANKS   RTCD                            S01390
     C                     PARM '*KEY   ' OPTN                            S01390
     C                     PARM CCY       KYCY    3                       S01390
     C           SDCURR    PARM SDCURR    DSSDY                           S01390
     C************IN99     IFEQ ON                                        S01390
     C***********RECI      ORNE 'D'                                       S01390
     C***********          MOVEL'TABLE'   DBFILE                          S01390
     C***********          MOVELTABKY     DBKEY                           S01390
     C***********          MOVE '02'      DBASE                           S01390
     C           RTCD      IFNE *BLANKS                                   S01390
     C           *LOCK     IN   LDA                                       S01390
     C                     MOVEL'SDCURRPD'DBFILE                          S01390
     C                     MOVELCCY       DBKEY                           S01390
     C                     Z-ADD2         DBASE                           S01390
     C                     OUT  LDA                                       S01390
     C                     MOVE ON        *INLR
     C                     MOVE ON        *INU8
     C                     END
     C*
     C*    OBTAIN DECIMAL PLACES FOR CCY.
     C*
     C***********CDP       IFGE 2                                         S01390
     C***********CDP       IFEQ 2                                         S01390
     C           A6NBDP    IFGE 2                                         S01390
     C           A6NBDP    IFEQ 2                                         S01390
     C                     Z-ADD2         DEC     20
     C                     ELSE
     C                     Z-ADD3         DEC
     C                     END
     C                     ELSE
     C***********CDP       IFEQ 1                                         S01390
     C           A6NBDP    IFEQ 1                                         S01390
     C                     Z-ADD1         DEC
     C                     ELSE
     C                     Z-ADD0         DEC
     C                     END
     C                     END
     C*
     C*    Z-ADD DECIMAL PLACES TO ZDEC FOR USE IN FORMAR SR.
     C*
     C                     Z-ADDDEC       ZDEC
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    BRHBRK SR. GET NEW BRANCH INFORMATION.
     C*
     C           BRHBRK    BEGSR                           *** BRHBRK ***
     C*
     C*****CHAIN*TO*BRANCH*REC*ON*TABLE*FILE.*****************************S01390
     C*    ACCESS BRANCHES FILE.                                          S01390
     C*
     C***********          MOVE *BLANKS   TABKY                           S01390
     C***********          MOVE '10'      TABKY1                          S01390
     C***********          MOVE BRCC      TABKY4                          S01390
     C***********TABKY     CHAINTABDLEE              99                   S01390
     C*                                                                   S01390
     C           MBIN      IFEQ 'Y'                                       S01390
     C                     SETON                     88                   S01390
     C**********           CALL 'AOBRCHR0'                                S01390              CGL029
     C                     CALL 'AOBRCHR1'                                                    CGL029
     C                     PARM *BLANKS   RTCD                            S01390
     C                     PARM '*KEY   ' OPTN                            S01390
     C                     PARM BRCC      KYBR    3                       S01390
     C********** SDBRCH    PARM SDBRCH    DSFDY                           S01390              CGL029
     C           SDBRCH    PARM SDBRCH    DSSDY                                               CGL029
     C************IN99     IFEQ ON                                        S01390
     C***********RECI      ORNE 'D'                                       S01390
     C***********          MOVEL'TABLE'   DBFILE                          S01390
     C***********          MOVELTABKY     DBKEY                           S01390
     C***********          MOVE '03'      DBASE                           S01390
     C           RTCD      IFNE *BLANKS                                   S01390
     C           *LOCK     IN   LDA                                       S01390
     C                     MOVEL'SDBRCHPD'DBFILE                          S01390
     C                     MOVELBRCC      DBKEY                           S01390
     C                     Z-ADD3         DBASE                           S01390
     C                     OUT  LDA                                       S01390
     C                     MOVE ON        *INLR
     C                     MOVE ON        *INU8
     C                     END
     C                     END                                            S01390
     C*                                                                   S01390
     C           FILOP1    IFEQ 'Y'                                       S01390
     C                     CLOSEDL9111P1                                  S01390
     C                     END                                            S01390
     C                     OPEN DL9111P1                                  S01390
     C                     Z-ADD0         PAGE                            S01390
     C                     MOVEL'Y'       FILOP1  1                       S01390
     C                     SETOF                     18                   S01390
     C*                                                                   S01390
     C** Report printer file to RCF via ZSFILE                            S01390
     C*                                                                   S01390
     C                     Z-ADDSFNUM1    ZSNUM   60                      S01390
     C                     CALL 'ZSFILE'                                  S01390
     C                     PARM           SEQ                             S01390
     C                     PARM BRCC      @ENT    3                       S01390
     C                     PARM           SFILE1                          S01390
     C                     PARM           ZSNUM                           S01390
     C                     PARM *BLANKS   ZSERR                           S01390
     C*                                                                   S01390
     C** Error during ZSFILE processing, return to calling program        S01390
     C*                                                                   S01390
     C           ZSERR     IFEQ 'Y'                                       S01390
     C                     SETON                     U7U8LR               S01390
     C                     END                                            S01390
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    CSTBRK SR. GET NEW CUSTOMER INFORMATION.
     C*
     C           CSTBRK    BEGSR                           *** CSTBRK ***
     C*
     C*****CHAIN*TO*CUSTOMER*REC.*TYPE*'A'.*******************************S01390
     C*    ACCESS CUSTOMER FILE                                           S01390
     C*
     C                     MOVE OFF       *IN80
     C***********          Z-ADDCNUM      CLKY01                          S01390
     C***********          MOVE 'A'       CLKY02                          S01390
     C***********          MOVELCNUM      CLTKEY  7                       S01390
     C***********          MOVE 'A'       CLTKEY                          S01390
     C***********CLTKY     CHAINCLINT                99                   S01390
     C*                    MOVE CNUM      KYCN   10                S01390 093198
     C                     MOVELCNUM      KYCN   10                       093198
     C***********          CALL 'AOCUSTR0'                         S01390 CSD007
     C                     CALL 'AOCUSTR2'                                CSD007
     C                     PARM *BLANKS   RTCD                            S01390
     C                     PARM '*KEY   ' OPTN                            S01390
     C                     PARM           KYCN                            S01390
     C                     PARM *BLANKS   KYST    7                       S01390
     C***********SDCUST    PARM SDCUST    DSSDY                    S01390 CSD007
     C           SDCUST    PARM SDCUST    DSLDY                           CSD007
     C************IN99     IFEQ ON                                        S01390
     C***********RECI      ORNE 'D'                                       S01390
     C***********          MOVEL'CLINT'   DBFILE                          S01390
     C***********          MOVELCLTKEY    DBKEY                           S01390
     C***********          MOVE '04'      DBASE                           S01390
      *                                                                   CSD007
      ** If CSD007 is on, allow processing of a closed record (return     CSD007
      ** code '*NRF' and date deleted equal to zero).                     CSD007
      *                                                                   CSD007
     C           CSD007    IFEQ 'Y'                                       CSD007
     C           RTCD      ANDEQ'*NRF'                                    CSD007
     C           BBDTDL    ANDEQ*ZERO                                     CSD007
     C                     MOVELBBCNA1    CNA1T  30                       CSD007
     C                     MOVELBBCNA2    CNA2T  30                       CSD007
     C                     MOVELBBCNA3    CNA3T  30                       CSD007
     C                     MOVELBBCNA4    CNA4T  30                       CSD007
      *                                                                   CSD007
     C                     ELSE                                           CSD007
      *                                                                   CSD007
     C           RTCD      IFNE *BLANKS                                   S01390
     C           *LOCK     IN   LDA                                       S01390
     C                     MOVEL'SDCUSTPD'DBFILE                          S01390
     C                     MOVELCNUM      DBKEY                           S01390
     C                     Z-ADD4         DBASE                           S01390
     C                     OUT  LDA                                       S01390
     C                     MOVE ON        *INLR
     C                     MOVE ON        *INU8
     C                     MOVE ON        *IN80
     C***********          END                                            S01390
     C***********                                                         S01390
     C*****CHAIN*TO*CUSTOMER*REC.*TYPE*'B'.*******************************S01390
     C***********                                                         S01390
     C************IN80     IFNE ON                                        S01390
     C***********          MOVE 'B'       CLKY02                          S01390
     C***********          MOVE 'B'       CLTKEY                          S01390
     C***********CLTKY     CHAINCLINT                99                   S01390
     C************IN99     IFEQ ON                                        S01390
     C***********RECI      ORNE 'D'                                       S01390
     C***********          MOVEL'CLINT'   DBFILE                          S01390
     C***********          MOVELCLTKEY    DBKEY                           S01390
     C***********          MOVE '05'      DBASE                           S01390
     C***********          MOVE ON        *INLR                           S01390
     C***********          MOVE ON        *INU8                           S01390
     C***********          MOVE ON        *IN80                           S01390
     C                     ELSE
     C***********          MOVELCNA1      CNA1T  30                       S01390
     C***********          MOVELCNA2      CNA2T  30                       S01390
     C***********          MOVELCNA3      CNA3T  30                       S01390
     C***********          MOVELCNA4      CNA4T  30                       S01390
     C                     MOVELBBCNA1    CNA1T  30                       S01390
     C                     MOVELBBCNA2    CNA2T  30                       S01390
     C                     MOVELBBCNA3    CNA3T  30                       S01390
     C                     MOVELBBCNA4    CNA4T  30                       S01390
     C                     END
     C***********          END                                            S01390
      *                                                                   CSD007
     C                     ENDIF                                          CSD007
     C*
     C*    INITILIZE FIELDS.
     C*
     C                     Z-ADD0         OINT   130
     C                     Z-ADD0         RINT   130
     C                     Z-ADD0         RFEE   130
     C                     Z-ADD0         RTOT   130
     C***********          Z-ADD0         PAGE                            S01390
     C***********          Z-ADD0         PAGE2                           S01390
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    DLBRK SR. SET UP NEW DEAL INFORMATION.
     C*
     C           DLBRK     BEGSR                           *** DLBRK  ***
     C*
     C*    PRINT TERM.
     C*
     C                     MOVE *BLANKS   TERMA  12
     C           TERM      IFEQ '99R'
     C*      PRINT 'FXD-NNAAANN'
     C                     Z-ADDMDAT      ZDAYNO
     C                     EXSR ZDATE2
     C                     MOVE ZADATE    MDATE   7
     C                     MOVEL'FXD -'   TERMA
     C                     MOVE MDATE     TERMA
     C                     ELSE
     C           TERM      IFEQ '000'
     C*      PRINT 'TERM 11AM'
     C                     MOVEL'TERM'    TERMA
     C                     MOVE '11AM  '  TERMA
     C                     ELSE
     C           TERM      IFEQ '001'
     C*      PRINT 'TERM 24HR'
     C                     MOVEL'TERM'    TERMA
     C                     MOVE '24HR  '  TERMA
     C                     END
     C                     END
     C                     END
     C*
     C*    ZEROISE BALANCE FIELD.
     C*
     C                     Z-ADD0         RBAL   130
     C                     Z-ADD0         RAMT   130
     C                     Z-ADD0         DINT   130
     C                     Z-ADD0         DFEE   130
     C                     Z-ADD0         RESIDU 130
     C/COPY WNCPYSRC,DL9111CCP8                                           S01408
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    DETAIL SR. PROCESS DETAIL RECORD.
     C*
     C           DETAIL    BEGSR                           *** DETAIL ***
     C*
     C*    SAVE WORK FIELDS
     C*
     C                     MOVE NREC      OREC
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    PROCOB SR. PROCESS LODGEMNT OR OPENING BALENCE RECORD.
     C*
     C           PROCOB    BEGSR                           *** PROCOB ***
     C*
     C*    UPDATE AMOUNT.
     C*
     C                     MOVE OEAMT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HAMT
     C*
     C           BFFLAG    IFEQ ON
     C                     MOVE *BLANKS   HAMT
     C                     END
     C*
     C*    UPDATE BALANCE.
     C*
     C                     Z-ADDOEAMT     RBAL
     C                     MOVE OEAMT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HBAL
     C*
     C*    UPDATE RATE.
     C*
     C                     Z-ADDONRAT     RATE
     C*
     C*    CALCULATE DAYS.
     C*
     C           NXTDAT    SUB  OEDAT     DAYS
     C*
     C/COPY WNCPYSRC,DL9111CCP9                                           S01408
     C*    IF NEXT RECORD TO PROCESS IS AN INTEREST PAYMENT (IP)
     C*      AND THE DEAL HAS NOT MATURED THEN INCREASE DAYS BY
     C*      1 TO INCLUDE THE MONTH END DAY.
     C*
     C           RTYP      IFEQ 'IP'
     C           OMDAT     IFEQ 0
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     ELSE
     C           EDAT      IFLT OMDAT
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     END
     C                     END
     C                     END
     C/COPY WNCPYSRC,DL9111CP10                                           S01408
     C*
     C*    CALCULATE INTEREST FROM PREVIOUS EDAT TO CURRENT EDAT.
     C*
     C           DAYS      IFGT 0
     C                     Z-ADDOEDAT     ZIBEG
     C                     Z-ADDNXTDAT    ZIEND
     C                     Z-ADDRBAL      ZIAMT
     C                     MOVE OICBS     ZICALC
     C                     Z-ADDONRAT     ZIRATE
     C                     EXSR GLINTC
     C                     Z-ADDZINTR     WKINT  130                      S01390
     C                     ADD  WKINT     DINT
     C                     ELSE
     C                     Z-ADD0         WKINT
     C                     END
     C           WKINT     IFGT 0
     C                     MOVE '+'       ZSIGNT
     C                     END
     C           WKINT     IFLT 0                                         192749
     C                     MOVE '-'       ZSIGNT                          192749
     C                     Z-SUBWKINT     WKINT                           192749
     C                     END                                            192749
     C                     MOVE WKINT     ZNUMIN
     C                     MOVE 'A'       ZSIGN
     C                     EXSR FORMAT
     C           *IN88     IFEQ '1'                        ENSURE ERROR   E36383
     C                     MOVE '1'       *IN89            IND. SET ON IF E36383
     C                     MOVE '0'       *IN88            APPLICABLE     E36383
     C                     END                                            E36383
     C                     MOVE ZNUMOT    HINT
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    PROCPI SR. PROCESS PRINCIPLE INCREASE RECORD.
     C*
     C           PROCPI    BEGSR                           *** PROCPI ***
     C*
     C*    UPDATE AMOUNT.
     C*
     C                     MOVE OEAMT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HAMT
     C*
     C*    UPDATE BALANCE.
     C*
     C                     ADD  OEAMT     RBAL
     C                     MOVE RBAL      ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HBAL
     C*
     C*    UPDATE RATE.
     C*
     C                     Z-ADDONRAT     RATE
     C*
     C*    CALCULATE DAYS.
     C*
     C           NXTDAT    SUB  OEDAT     DAYS
     C/COPY WNCPYSRC,DL9111CP31                                           S01408
     C*
     C*    IF NEXT RECORD TO PROCESS IS AN INTEREST PAYMENT (IP)
     C*      AND THE DEAL HAS NOT MATURED THEN INCREASE DAYS BY
     C*      1 TO INCLUDE THE MONTH END DAY.
     C*
     C           RTYP      IFEQ 'IP'
     C           OMDAT     IFEQ 0
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     ELSE
     C           EDAT      IFLT OMDAT
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     END
     C                     END
     C                     END
     C/COPY WNCPYSRC,DL9111CP32                                           S01408
     C*
     C*    CALCULATE INTEREST FROM PREVIOUS EDAT TO CURRENT EDAT.
     C*
     C           DAYS      IFGT 0
     C                     Z-ADDOEDAT     ZIBEG
     C                     Z-ADDNXTDAT    ZIEND
     C                     Z-ADDRBAL      ZIAMT
     C                     MOVE OICBS     ZICALC
     C                     Z-ADDONRAT     ZIRATE
     C                     EXSR GLINTC
     C                     Z-ADDZINTR     WKINT                           S01390
     C                     ADD  WKINT     DINT
     C                     ELSE
     C                     Z-ADD0         WKINT
     C                     END
     C           WKINT     IFGT 0
     C                     MOVE '+'       ZSIGNT
     C                     END
     C           WKINT     IFLT 0                                         192749
     C                     MOVE '-'       ZSIGNT                          192749
     C                     Z-SUBWKINT     WKINT                           192749
     C                     END                                            192749
     C                     MOVE 'A'       ZSIGN
     C                     MOVE WKINT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN88     IFEQ '1'                        ENSURE ERROR   E36383
     C                     MOVE '1'       *IN89            IND. SET ON IF E36383
     C                     MOVE '0'       *IN88            APPLICABLE     E36383
     C                     END                                            E36383
     C                     MOVE ZNUMOT    HINT
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    PROCPD SR. PROCESS PRINCIPLE DECREASE RECORD.
     C*
     C           PROCPD    BEGSR                           *** PROCPD ***
     C*
     C*    UPDATE AMOUNT.
     C*
     C                     MOVE OEAMT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HAMT
     C*
     C*    UPDATE BALANCE.
     C*
     C                     SUB  OEAMT     RBAL
     C           RBAL      IFLT 0                                         192749
     C                     Z-SUBRBAL      RBAL                            192749
     C                     MOVE 'A'       ZSIGN                           192749
     C                     MOVE '-'       ZSIGNT                          192749
     C                     END                                            192749
     C                     MOVE RBAL      ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HBAL
     C*
     C*    UPDATE RATE.
     C*
     C                     Z-ADDONRAT     RATE
     C*
     C*    CALCULATE DAYS.
     C*
     C           NXTDAT    SUB  OEDAT     DAYS
     C/COPY WNCPYSRC,DL9111CP14                                           S01408
     C*
     C*    IF NEXT RECORD TO PROCESS IS AN INTEREST PAYMENT (IP)
     C*      AND THE DEAL HAS NOT MATURED THEN INCREASE DAYS BY
     C*      1 TO INCLUDE THE MONTH END DAY.
     C*
     C           RTYP      IFEQ 'IP'
     C           OMDAT     IFEQ 0
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     ELSE
     C           EDAT      IFLT OMDAT
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     END
     C                     END
     C                     END
     C/COPY WNCPYSRC,DL9111CP15                                           S01408
     C*
     C*    CALCULATE INTEREST FROM PREVIOUS EDAT TO CURRENT EDAT.
     C*
     C           DAYS      IFGT 0
     C                     Z-ADDOEDAT     ZIBEG
     C                     Z-ADDNXTDAT    ZIEND
     C                     Z-ADDRBAL      ZIAMT
     C                     MOVE OICBS     ZICALC
     C                     Z-ADDONRAT     ZIRATE
     C                     EXSR GLINTC
     C                     Z-ADDZINTR     WKINT                           S01390
     C                     ADD  WKINT     DINT
     C                     ELSE
     C                     Z-ADD0         WKINT
     C                     END
     C           WKINT     IFGT 0
     C                     MOVE '+'       ZSIGNT
     C                     END
     C           WKINT     IFLT 0                                         192749
     C                     MOVE '-'       ZSIGNT                          192749
     C                     Z-SUBWKINT     WKINT                           192749
     C                     END                                            192749
     C                     MOVE 'A'       ZSIGN
     C                     MOVE WKINT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN88     IFEQ '1'                        ENSURE ERROR   E36383
     C                     MOVE '1'       *IN89            IND. SET ON IF E36383
     C                     MOVE '0'       *IN88            APPLICABLE     E36383
     C                     END                                            E36383
     C                     MOVE ZNUMOT    HINT
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    PROCIA SR. PROCESS INTEREST ADJUSTMENT RECORD.
     C*
     C           PROCIA    BEGSR                           *** PROCIA ***
     C*
     C*    UPDATE AMOUNT.
     C*
     C           OEAMT     IFLT 0
     C                     Z-SUBOEAMT     TMP130 130
     C                     MOVE TMP130    ZNUMIN
     C                     MOVE 'B'       ZSIGN
     C                     MOVE '-'       ZSIGNT
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HAMT
     C                     ELSE
     C                     MOVE OEAMT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HAMT
     C                     END
     C*
     C*    UPDATE BALANCE. (USE PREVIOUS BALANCE)
     C*
     C                     MOVE PBAL      HBAL                            E36324
     C*
     C*    CALCULATE DAYS.
     C*
     C           NXTDAT    SUB  OEDAT     DAYS
     C/COPY WNCPYSRC,DL9111CP16                                           S01408
     C*
     C*    IF NEXT RECORD TO PROCESS IS AN INTEREST PAYMENT (IP)
     C*      AND THE DEAL HAS NOT MATURED THEN INCREASE DAYS BY
     C*      1 TO INCLUDE THE MONTH END DAY.
     C*
     C           RTYP      IFEQ 'IP'
     C           OMDAT     IFEQ 0
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     ELSE
     C           EDAT      IFLT OMDAT
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     END
     C                     END
     C                     END
     C/COPY WNCPYSRC,DL9111CP17                                           S01408
     C*
     C*    CALCULATE INTEREST FROM PREVIOUS EDAT TO CURRENT EDAT.
     C*
     C           DAYS      IFGT 0
     C                     Z-ADDOEDAT     ZIBEG
     C                     Z-ADDNXTDAT    ZIEND
     C                     Z-ADDRBAL      ZIAMT
     C                     MOVE OICBS     ZICALC
     C                     Z-ADDONRAT     ZIRATE
     C                     EXSR GLINTC
     C                     Z-ADDZINTR     WKINT                           S01390
     C                     ADD  OEAMT     WKINT
     C                     ADD  WKINT     DINT
     C                     ELSE
     C                     Z-ADDOEAMT     WKINT
     C                     ADD  WKINT     DINT
     C                     END
     C           WKINT     IFGT 0
     C                     MOVE '+'       ZSIGNT
     C                     ELSE
     C           WKINT     IFLT 0
     C                     MOVE '-'       ZSIGNT
     C                     Z-SUBWKINT     WKINT
     C                     END
     C                     END
     C                     MOVE 'A'       ZSIGN
     C                     MOVE WKINT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN88     IFEQ '1'                        ENSURE ERROR   E36383
     C                     MOVE '1'       *IN89            IND. SET ON IF E36383
     C                     MOVE '0'       *IN88            APPLICABLE     E36383
     C                     END                                            E36383
     C                     MOVE ZNUMOT    HINT
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    PROCFA SR. PROCESS SERVICE FEE RECORD.
     C*
     C           PROCFA    BEGSR                           *** PROCFA ***
     C*
     C*    UPDATE AMOUNT.
     C*
     C                     MOVE OEAMT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HAMT
     C*
     C*    UPDATE BALANCE. (USE PREVOIUS BALANCE)
     C*
     C                     MOVE PBAL      HBAL                            E36324
     C*
     C*    CALCULATE DAYS.
     C*
     C           NXTDAT    SUB  OEDAT     DAYS
     C/COPY WNCPYSRC,DL9111CP18                                           S01408
     C*
     C*    IF NEXT RECORD TO PROCESS IS AN INTEREST PAYMENT (IP)
     C*      AND THE DEAL HAS NOT MATURED THEN INCREASE DAYS BY
     C*      1 TO INCLUDE THE MONTH END DAY.
     C*
     C           RTYP      IFEQ 'IP'
     C           OMDAT     IFEQ 0
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     ELSE
     C           EDAT      IFLT OMDAT
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     END
     C                     END
     C                     END
     C/COPY WNCPYSRC,DL9111CP19                                           S01408
     C*
     C*    CALCULATE INTEREST FROM PREVIOUS EDAT TO CURRENT EDAT.
     C*
     C           DAYS      IFGT 0
     C                     Z-ADDOEDAT     ZIBEG
     C                     Z-ADDNXTDAT    ZIEND
     C                     Z-ADDRBAL      ZIAMT
     C                     MOVE OICBS     ZICALC
     C                     Z-ADDONRAT     ZIRATE
     C                     EXSR GLINTC
     C                     Z-ADDZINTR     WKINT                           S01390
     C                     ADD  WKINT     DINT
     C                     ADD  OEAMT     WKINT
     C                     ADD  OEAMT     DFEE
     C                     ELSE
     C                     Z-ADDOEAMT     WKINT
     C                     ADD  OEAMT     DFEE
     C                     END
     C           WKINT     IFGT 0
     C                     MOVE '+'       ZSIGNT
     C                     END
     C           WKINT     IFLT 0                                         192749
     C                     MOVE '-'       ZSIGNT                          192749
     C                     Z-SUBWKINT     WKINT                           192749
     C                     END                                            192749
     C                     MOVE 'A'       ZSIGN
     C                     MOVE WKINT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN88     IFEQ '1'                        ENSURE ERROR   E36383
     C                     MOVE '1'       *IN89            IND. SET ON IF E36383
     C                     MOVE '0'       *IN88            APPLICABLE     E36383
     C                     END                                            E36383
     C                     MOVE ZNUMOT    HINT
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    PROCSC SR. PROCESS RENOGIATION RECORD.
     C*
     C           PROCSC    BEGSR                           *** PROCSC ***
     C*
     C*    COMPLETE NARRITIVE.
     C*
     C           OTERM     IFEQ '000'
     C                     MOVE '11AM '   NARR
     C                     ELSE
     C           OTERM     IFEQ '001'
     C                     MOVE '24HR '   NARR
     C                     END
     C                     END
     C*
     C*    UPDATE AMOUNT.
     C*
     C                     MOVE *BLANKS   HAMT
     C*
     C*    UPDATE BALANCE. (USE PREVIOUS BALANCE)
     C*
     C                     MOVE PBAL      HBAL                            E36324
     C*
     C*    UPDATE RATE.
     C*
     C                     Z-ADDONRAT     RATE
     C*
     C*    CALCULATE DAYS.
     C*
     C           NXTDAT    SUB  OEDAT     DAYS
     C/COPY WNCPYSRC,DL9111CP20                                           S01408
     C*
     C*    IF NEXT RECORD TO PROCESS IS AN INTEREST PAYMENT (IP)
     C*      AND THE DEAL HAS NOT MATURED THEN INCREASE DAYS BY
     C*      1 TO INCLUDE THE MONTH END DAY.
     C*
     C           RTYP      IFEQ 'IP'
     C           OMDAT     IFEQ 0
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     ELSE
     C           EDAT      IFLT OMDAT
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     END
     C                     END
     C                     END
     C/COPY WNCPYSRC,DL9111CP21                                           S01408
     C*
     C*    CALCULATE INTEREST FROM PREVIOUS EDAT TO CURRENT EDAT.
     C*
     C           DAYS      IFGT 0
     C                     Z-ADDOEDAT     ZIBEG
     C                     Z-ADDNXTDAT    ZIEND
     C                     Z-ADDRBAL      ZIAMT
     C                     MOVE OICBS     ZICALC
     C                     Z-ADDONRAT     ZIRATE
     C                     EXSR GLINTC
     C                     Z-ADDZINTR     WKINT                           S01390
     C                     ADD  WKINT     DINT
     C                     ELSE
     C                     Z-ADD0         WKINT
     C                     END
     C           WKINT     IFGT 0
     C                     MOVE '+'       ZSIGNT
     C                     END
     C           WKINT     IFLT 0                                         192749
     C                     MOVE '-'       ZSIGNT                          192749
     C                     Z-SUBWKINT     WKINT                           192749
     C                     END                                            192749
     C                     MOVE 'A'       ZSIGN
     C                     MOVE WKINT     ZNUMIN
     C                     EXSR FORMAT
     C                     MOVE ZNUMOT    HINT
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    PROCMA SR. PROCESS MATURITY RECORD.
     C*
     C           PROCMA    BEGSR                           *** PROCMA ***
     C*
     C*    UPDATE AMOUNT.
     C*
     C                     MOVE OEAMT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HAMT
     C*
     C*    UPDATE BALANCE.
     C*
     C                     Z-ADD0         RBAL
     C                     MOVE RBAL      ZNUMIN
     C                     EXSR FORMAT
     C           *IN88     IFEQ '1'                        ENSURE ERROR   E36383
     C                     MOVE '1'       *IN89            IND. SET ON IF E36383
     C                     MOVE '0'       *IN88            APPLICABLE     E36383
     C                     END                                            E36383
     C                     MOVE ZNUMOT    HBAL
     C*
     C*    UPDATE RATE.
     C*
     C                     Z-ADD0         RATE
     C*
     C*    CALCULATE DAYS.
     C*
     C                     Z-ADD0         DAYS
     C*
     C*    CALCULATE INTEREST FROM PREVIOUS EDAT TO CURRENT EDAT.
     C*
     C                     MOVE *BLANKS   HINT
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    PROCIP SR. PROCESS INTEREST DUE/CAPITILISATION RECORD.
     C*
     C           PROCIP    BEGSR                           *** PROCIP ***
     C*
     C*    CAPITILISE INTEREST IF OINTC = Y AND DEAL NOT MATURED AT
     C*      THE TIME OF THIS INTEREST PAYMENT.
     C*
     C                     MOVE OFF       *IN40
     C           OINTC     IFEQ 'Y'
     C           OMDAT     IFEQ 0
     C           OMDAT     ORGT OEDAT
     C                     MOVE ON        *IN40
     C                     END
     C                     END
     C*
     C*    COMPLETE NARRITIVE.
     C*
     C           *IN40     IFEQ OFF
     C                     MOVE 'DUE    ' NARR
     C                     ELSE
     C                     MOVE 'CAP    ' NARR
     C                     END
     C*
     C*    UPDATE AMOUNT.
     C*
     C           *IN40     IFEQ OFF
     C                     MOVE *BLANKS   HAMT
     C                     ELSE
     C           OEAMT     IFLT 0                                         192749
     C                     Z-SUBOEAMT     TMP130                          192749
     C                     MOVE TMP130    ZNUMIN                          192749
     C                     MOVE 'B'       ZSIGN                           192749
     C                     MOVE '-'       ZSIGNT                          192749
     C                     ELSE                                           192749
     C                     MOVE OEAMT     ZNUMIN
     C                     END                                            192749
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HAMT
     C                     END
     C*
     C*    UPDATE BALANCE.
     C*
     C           *IN40     IFEQ OFF
     C                     MOVE *BLANKS   HBAL
     C                     ELSE
     C                     ADD  OEAMT     RBAL
     C                     MOVE RBAL      ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HBAL
     C                     END
     C*
     C*    UPDATE RATE.
     C*
     C           *IN40     IFEQ OFF
     C                     Z-ADD0         RATE
     C                     ELSE
     C                     Z-ADDONRAT     RATE
     C                     END
     C*
     C*    CALCULATE DAYS.
     C*
     C                     Z-ADD0         DAYS
     C*
     C*    CALCULATE INTEREST FROM PREVIOUS EDAT TO CURRENT EDAT.
     C*
     C                     SUB  RESIDU    OEAMT
     C                     SUB  RESIDU    DINT                            E99998
     C                     ADD  OEAMT     OINT
     C                     MOVE OEAMT     ZNUMIN
     C                     MOVE 'A'       ZSIGN
     C           OEAMT     IFNE 0
     C           *IN40     IFEQ OFF
     C                     MOVE '-'       ZSIGNT
     C                     ELSE
     C                     MOVE '+'       ZSIGNT
     C                     END
     C                     END
     C                     EXSR FORMAT
     C           *IN88     IFEQ '1'                        ENSURE ERROR   E36383
     C                     MOVE '1'       *IN89            IND. SET ON IF E36383
     C                     MOVE '0'       *IN88            APPLICABLE     E36383
     C                     END                                            E36383
     C                     MOVE ZNUMOT    HINT
     C*
     C*    IF INTEREST IS CAPITILISED THEN RESET INTEREST PAID
     C*
     C           *IN40     IFEQ ON
     C                     Z-ADD0         OINT
     C                     Z-ADD0         DINT
     C                     Z-ADD0         DFEE
     C                     END
     C                     MOVE OEAMT     ZNUMIN
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    PROCCB SR. PROCESS CLOSING BALANCE RECORD.
     C*
     C           PROCCB    BEGSR                           *** PROCCB ***
     C*
     C*    UPDATE AMOUNT.
     C*
     C                     MOVE *BLANKS   HAMT
     C*
     C*    UPDATE BALANCE.
     C*
     C                     MOVE OEAMT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HBAL
     C*
     C*    UPDATE RATE.
     C*
     C                     Z-ADDONRAT     RATE
     C*
     C*    CALCULATE DAYS.
     C*
     C                     Z-ADD0         DAYS
     C*
     C*    CALCULATE INTEREST FROM PREVIOUS EDAT TO CURRENT EDAT.
     C*
     C                     Z-ADD0         WKINT
     C                     MOVE WKINT     ZNUMIN
     C                     MOVE 'A'       ZSIGN
     C                     EXSR FORMAT
     C           *IN88     IFEQ '1'                        ENSURE ERROR   E36383
     C                     MOVE '1'       *IN89            IND. SET ON IF E36383
     C                     MOVE '0'       *IN88            APPLICABLE     E36383
     C                     END                                            E36383
     C                     MOVE ZNUMOT    HINT
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    PROCRO SR. PROCESS ROLLOVER RECORD.
     C*
     C           PROCRO    BEGSR                           *** PROCRO ***
     C*
     C*    UPDATE AMOUNT.
     C*
     C           OEAMT     IFGT OPCPL
     C                     Z-ADDOPCPL     RAMT
     C                     ELSE
     C                     Z-ADDOEAMT     RAMT
     C                     END
     C                     MOVE RAMT      ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HAMT
     C*
     C*    UPDATE BALANCE.
     C*
     C                     MOVE *BLANKS   HBAL
     C*
     C*    UPDATE RATE.
     C*
     C                     Z-ADD0         RATE
     C*
     C*    CALCULATE DAYS.
     C*
     C                     Z-ADD0         DAYS
     C*
     C*    CALCULATE INTEREST FROM PREVIOUS EDAT TO CURRENT EDAT.
     C*
     C           OEAMT     IFGT OPCPL
     C           OEAMT     SUB  OPCPL     WKINT
     C                     ADD  WKINT     RESIDU
     C*                    MOVE '+'       ZSIGNT                          E99998
     C                     MOVE '-'       ZSIGNT                          E99998
     C                     ELSE
     C                     Z-ADD0         WKINT
     C                     END
     C                     MOVE WKINT     ZNUMIN
     C                     MOVE 'A'       ZSIGN
     C                     EXSR FORMAT
     C           *IN88     IFEQ '1'                        ENSURE ERROR   E36383
     C                     MOVE '1'       *IN89            IND. SET ON IF E36383
     C                     MOVE '0'       *IN88            APPLICABLE     E36383
     C                     END                                            E36383
     C                     MOVE ZNUMOT    HINT
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    PRDCOB SR. PROCESS LODGEMNT OR OPENING BALENCE RECORD.
     C*
     C           PRDCOB    BEGSR                           *** PROCOB ***
     C*
     C*    UPDATE AMOUNT.
     C*
     C                     MOVE OEAMT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HAMT
     C*
     C           BFFLAG    IFEQ ON
     C                     MOVE *BLANKS   HAMT
     C                     END
     C*
     C*    UPDATE BALANCE.
     C*
     C                     Z-ADDOEAMT     RBAL
     C                     MOVE OEAMT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HBAL
     C*
     C*    UPDATE RATE.
     C*
     C                     Z-ADDONRAT     RATE
     C*
     C*    CALCULATE DAYS.
     C*
     C           NXTDAT    SUB  OEDAT     DAYS
     C/COPY WNCPYSRC,DL9111CP11                                           S01408
     C*
     C*    IF NEXT RECORD TO PROCESS IS AN INTEREST PAYMENT (IP),
     C*      A WITHHOLDING TAX PAYMENT (TX) A SERVICE CHARGE (FD)
     C*      AND THE DEAL HAS NOT MATURED THEN INCREASE DAYS BY
     C*      1 TO INCLUDE THE MONTH END DAY.
     C*
     C           RTYP      IFEQ 'IP'
     C           RTYP      OREQ 'TX'
     C           RTYP      OREQ 'FD'
     C*                                                                   S01408
     C*                                                                   S01408
     C/COPY WNCPYSRC,DL9111CCP2                                           S01408
     C*                                                                   S01408
     C*                                                                   S01408
     C           OMDAT     IFEQ 0
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     ELSE
     C           EDAT      IFLT OMDAT
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     END
     C                     END
     C                     END
     C/COPY WNCPYSRC,DL9111CP22                                           S01408
     C*
     C*    CALCULATE INTEREST FROM PREVIOUS EDAT TO CURRENT EDAT.
     C*
     C           DAYS      IFGT 0
     C                     Z-ADDOEDAT     ZIBEG
     C                     Z-ADDNXTDAT    ZIEND
     C                     Z-ADDRBAL      ZIAMT
     C                     MOVE OICBS     ZICALC
     C                     Z-ADDONRAT     ZIRATE
     C                     EXSR GLINTC
     C                     Z-ADDZINTR     WKINT                           S01390
     C                     ADD  WKINT     RINT
     C                     ELSE
     C                     Z-ADD0         WKINT
     C                     END
     C           WKINT     IFGT 0
     C                     MOVE '+'       ZSIGNT
     C                     END
     C           WKINT     IFLT 0                                         192749
     C                     MOVE '-'       ZSIGNT                          192749
     C                     Z-SUBWKINT     WKINT                           192749
     C                     END                                            192749
     C                     MOVE WKINT     ZNUMIN
     C                     MOVE 'A'       ZSIGN
     C                     EXSR FORMAT
     C           *IN88     IFEQ '1'                        ENSURE ERROR   E36383
     C                     MOVE '1'       *IN89            IND. SET ON IF E36383
     C                     MOVE '0'       *IN88            APPLICABLE     E36383
     C                     END                                            E36383
     C                     MOVE ZNUMOT    HINT
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    PROCPI SR. PROCESS PRINCIPLE INCREASE RECORD.
     C*
     C           PRDCPI    BEGSR                           *** PROCPI ***
     C*
     C*    UPDATE AMOUNT.
     C*
     C                     MOVE OEAMT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HAMT
     C*
     C*    UPDATE BALANCE.
     C*
     C                     ADD  OEAMT     RBAL
     C                     MOVE RBAL      ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HBAL
     C*
     C*    UPDATE RATE.
     C*
     C                     Z-ADDONRAT     RATE
     C*
     C*    CALCULATE DAYS.
     C*
     C           NXTDAT    SUB  OEDAT     DAYS
     C/COPY WNCPYSRC,DL9111CP12                                           S01408
     C*
     C*    IF NEXT RECORD TO PROCESS IS AN INTEREST PAYMENT (IP),
     C*      A WITHHOLDING TAX PAYMENT (TX) A SERVICE CHARGE (FD)
     C*      AND THE DEAL HAS NOT MATURED THEN INCREASE DAYS BY
     C*      1 TO INCLUDE THE MONTH END DAY.
     C*
     C           RTYP      IFEQ 'IP'
     C           RTYP      OREQ 'TX'
     C           RTYP      OREQ 'FD'
     C*                                                                   S01408
     C*                                                                   S01408
     C/COPY WNCPYSRC,DL9111CCP3                                           S01408
     C*                                                                   S01408
     C*                                                                   S01408
     C           OMDAT     IFEQ 0
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     ELSE
     C           EDAT      IFLT OMDAT
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     END
     C                     END
     C                     END
     C/COPY WNCPYSRC,DL9111CP23                                           S01408
     C*
     C*    CALCULATE INTEREST FROM PREVIOUS EDAT TO CURRENT EDAT.
     C*
     C           DAYS      IFGT 0
     C                     Z-ADDOEDAT     ZIBEG
     C                     Z-ADDNXTDAT    ZIEND
     C                     Z-ADDRBAL      ZIAMT
     C                     MOVE OICBS     ZICALC
     C                     Z-ADDONRAT     ZIRATE
     C                     EXSR GLINTC
     C                     Z-ADDZINTR     WKINT                           S01390
     C                     ADD  WKINT     RINT
     C                     ELSE
     C                     Z-ADD0         WKINT
     C                     END
     C           WKINT     IFGT 0
     C                     MOVE '+'       ZSIGNT
     C                     END
     C           WKINT     IFLT 0                                         192749
     C                     MOVE '-'       ZSIGNT                          192749
     C                     Z-SUBWKINT     WKINT                           192749
     C                     END                                            192749
     C                     MOVE 'A'       ZSIGN
     C                     MOVE WKINT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN88     IFEQ '1'                        ENSURE ERROR   E36383
     C                     MOVE '1'       *IN89            IND. SET ON IF E36383
     C                     MOVE '0'       *IN88            APPLICABLE     E36383
     C                     END                                            E36383
     C                     MOVE ZNUMOT    HINT
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    PROCPD SR. PROCESS PRINCIPLE DECREASE RECORD.
     C*
     C           PRDCPD    BEGSR                           *** PROCPD ***
     C*
     C*    UPDATE AMOUNT.
     C*
     C                     MOVE OEAMT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HAMT
     C*
     C*    UPDATE BALANCE.
     C*
     C                     SUB  OEAMT     RBAL
     C           RBAL      IFLT 0                                         192749
     C                     Z-SUBRBAL      RBAL                            192749
     C                     MOVE 'A'       ZSIGN                           192749
     C                     MOVE '- '      ZSIGNT                          192749
     C                     END                                            192749
     C                     MOVE RBAL      ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HBAL
     C*
     C*    UPDATE RATE.
     C*
     C                     Z-ADDONRAT     RATE
     C*
     C*    CALCULATE DAYS.
     C*
     C           NXTDAT    SUB  OEDAT     DAYS
     C/COPY WNCPYSRC,DL9111CP13                                           S01408
     C*
     C*    IF NEXT RECORD TO PROCESS IS AN INTEREST PAYMENT (IP),
     C*      A WITHHOLDING TAX PAYMENT (TX) A SERVICE CHARGE (FD)
     C*      AND THE DEAL HAS NOT MATURED THEN INCREASE DAYS BY
     C*      1 TO INCLUDE THE MONTH END DAY.
     C*
     C           RTYP      IFEQ 'IP'
     C           RTYP      OREQ 'TX'
     C           RTYP      OREQ 'FD'
     C*                                                                   S01408
     C*                                                                   S01408
     C/COPY WNCPYSRC,DL9111CCP4                                           S01408
     C*                                                                   S01408
     C*                                                                   S01408
     C           OMDAT     IFEQ 0
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     ELSE
     C           EDAT      IFLT OMDAT
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     END
     C                     END
     C                     END
     C/COPY WNCPYSRC,DL9111CP24                                           S01408
     C*
     C*    CALCULATE INTEREST FROM PREVIOUS EDAT TO CURRENT EDAT.
     C*
     C           DAYS      IFGT 0
     C                     Z-ADDOEDAT     ZIBEG
     C                     Z-ADDNXTDAT    ZIEND
     C                     Z-ADDRBAL      ZIAMT
     C                     MOVE OICBS     ZICALC
     C                     Z-ADDONRAT     ZIRATE
     C                     EXSR GLINTC
     C                     Z-ADDZINTR     WKINT                           S01390
     C                     ADD  WKINT     RINT
     C                     ELSE
     C                     Z-ADD0         WKINT
     C                     END
     C           WKINT     IFGT 0
     C                     MOVE '+'       ZSIGNT
     C                     END
     C           WKINT     IFLT 0                                         192749
     C                     MOVE '-'       ZSIGNT                          192749
     C                     Z-SUBWKINT     WKINT                           192749
     C                     END                                            192749
     C                     MOVE 'A'       ZSIGN
     C                     MOVE WKINT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN88     IFEQ '1'                        ENSURE ERROR   E36383
     C                     MOVE '1'       *IN89            IND. SET ON IF E36383
     C                     MOVE '0'       *IN88            APPLICABLE     E36383
     C                     END                                            E36383
     C                     MOVE ZNUMOT    HINT
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    PRDCIA SR. PROCESS INTEREST ADJUSTMENT RECORD.
     C*
     C           PRDCIA    BEGSR                           *** PRDCIA ***
     C*
     C*    UPDATE AMOUNT.
     C*
     C           OEAMT     IFLT 0
     C                     Z-SUBOEAMT     TMP130 130
     C                     MOVE TMP130    ZNUMIN
     C                     MOVE 'B'       ZSIGN
     C                     MOVE '-'       ZSIGNT
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HAMT
     C                     ELSE
     C                     MOVE OEAMT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HAMT
     C                     END
     C*
     C*    UPDATE BALANCE. (USE PREVIOUS BALANCE)
     C*
     C                     MOVE PBAL      HBAL                            E36324
     C*
     C*    CALCULATE DAYS.
     C*
     C           NXTDAT    SUB  OEDAT     DAYS
     C/COPY WNCPYSRC,DL9111CP25                                           S01408
     C*
     C*    IF NEXT RECORD TO PROCESS IS AN INTEREST PAYMENT (IP),
     C*      A WITHHOLDING TAX PAYMENT (TX) A SERVICE CHARGE (FD)
     C*      AND THE DEAL HAS NOT MATURED THEN INCREASE DAYS BY
     C*      1 TO INCLUDE THE MONTH END DAY.
     C*
     C           RTYP      IFEQ 'IP'
     C           RTYP      OREQ 'TX'
     C           RTYP      OREQ 'FD'
     C*                                                                   S01408
     C*                                                                   S01408
     C/COPY WNCPYSRC,DL9111CCP5                                           S01408
     C*                                                                   S01408
     C*                                                                   S01408
     C           OMDAT     IFEQ 0
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     ELSE
     C           EDAT      IFLT OMDAT
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     END
     C                     END
     C                     END
     C/COPY WNCPYSRC,DL9111CP26                                           S01408
     C*
     C*    CALCULATE INTEREST FROM PREVIOUS EDAT TO CURRENT EDAT.
     C*
     C           DAYS      IFGT 0
     C                     Z-ADDOEDAT     ZIBEG
     C                     Z-ADDNXTDAT    ZIEND
     C                     Z-ADDRBAL      ZIAMT
     C                     MOVE OICBS     ZICALC
     C                     Z-ADDONRAT     ZIRATE
     C                     EXSR GLINTC
     C                     Z-ADDZINTR     WKINT                           S01390
     C                     ADD  OEAMT     WKINT
     C                     ADD  WKINT     RINT
     C                     ELSE
     C                     Z-ADDOEAMT     WKINT
     C                     ADD  WKINT     RINT
     C                     END
     C           WKINT     IFGT 0
     C                     MOVE '+'       ZSIGNT
     C                     ELSE
     C           WKINT     IFLT 0
     C                     MOVE '-'       ZSIGNT
     C                     Z-SUBWKINT     WKINT
     C                     END
     C                     END
     C                     MOVE 'A'       ZSIGN
     C                     MOVE WKINT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN88     IFEQ '1'                        ENSURE ERROR   E36383
     C                     MOVE '1'       *IN89            IND. SET ON IF E36383
     C                     MOVE '0'       *IN88            APPLICABLE     E36383
     C                     END                                            E36383
     C                     MOVE ZNUMOT    HINT
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    PRDCFA SR. PROCESS SERVICE CHARGE ADJUSTMENT RECORD.
     C*
     C           PRDCFA    BEGSR                           *** PRDCFA ***
     C*
     C*    UPDATE AMOUNT.
     C*
     C           OEAMT     IFLT 0
     C                     Z-SUBOEAMT     TMP130 130
     C                     MOVE TMP130    ZNUMIN
     C                     MOVE 'B'       ZSIGN
     C                     MOVE '-'       ZSIGNT
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HAMT
     C                     ELSE
     C                     MOVE OEAMT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HAMT
     C                     END
     C*
     C*    UPDATE BALANCE. (USE PREVIOUS BALANCE)
     C*
     C                     MOVE PBAL      HBAL                            E36324
     C*
     C*    CALCULATE DAYS.
     C*
     C           NXTDAT    SUB  OEDAT     DAYS
     C/COPY WNCPYSRC,DL9111CP27                                           S01408
     C*
     C*    IF NEXT RECORD TO PROCESS IS AN INTEREST PAYMENT (IP),
     C*      A WITHHOLDING TAX PAYMENT (TX) A SERVICE CHARGE (FD)
     C*      AND THE DEAL HAS NOT MATURED THEN INCREASE DAYS BY
     C*      1 TO INCLUDE THE MONTH END DAY.
     C*
     C           RTYP      IFEQ 'IP'
     C           RTYP      OREQ 'TX'
     C           RTYP      OREQ 'FD'
     C*                                                                   S01408
     C*                                                                   S01408
     C/COPY WNCPYSRC,DL9111CCP6                                           S01408
     C*                                                                   S01408
     C*                                                                   S01408
     C           OMDAT     IFEQ 0
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     ELSE
     C           EDAT      IFLT OMDAT
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     END
     C                     END
     C                     END
     C/COPY WNCPYSRC,DL9111CP28                                           S01408
     C*
     C*    CALCULATE INTEREST FROM PREVIOUS EDAT TO CURRENT EDAT.
     C*
     C           DAYS      IFGT 0
     C                     Z-ADDOEDAT     ZIBEG
     C                     Z-ADDNXTDAT    ZIEND
     C                     Z-ADDRBAL      ZIAMT
     C                     MOVE OICBS     ZICALC
     C                     Z-ADDONRAT     ZIRATE
     C                     EXSR GLINTC
     C                     Z-ADDZINTR     WKINT                           S01390
     C                     ADD  WKINT     RINT
     C**                   ADD  OEAMT     WKINT                           E36401
     C                     ADD  OEAMT     RFEE
     C                     ELSE
     C**                   Z-ADDOEAMT     WKINT                           E36401
     C                     ADD  OEAMT     RFEE
     C                     END
     C           WKINT     IFGT 0
     C                     MOVE '+'       ZSIGNT
     C                     ELSE
     C           WKINT     IFLT 0
     C                     MOVE '-'       ZSIGNT
     C                     Z-SUBWKINT     WKINT
     C                     END
     C                     END
     C                     MOVE 'A'       ZSIGN
     C                     MOVE WKINT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN88     IFEQ '1'                        ENSURE ERROR   E36383
     C                     MOVE '1'       *IN89            IND. SET ON IF E36383
     C                     MOVE '0'       *IN88            APPLICABLE     E36383
     C                     END                                            E36383
     C                     MOVE ZNUMOT    HINT
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    PRDCTX SR. PROCESS WITHHOLDING TAX RECORD.
     C*
     C           PRDCTX    BEGSR                           *** PRDCTX ***
     C*
     C*    UPDATE AMOUNT.
     C*
     C                     MOVE *BLANKS   HAMT
     C*
     C*    UPDATE BALANCE. (USE PREVOIUS BALANCE)
     C*
     C                     MOVE PBAL      HBAL                            E36324
     C*
     C*    CALCULATE DAYS.
     C*
     C                     Z-ADD0         DAYS
     C*
     C*    PRINT THE EVENT AMOUNT IN THE INTEREST FIELD.
     C*
     C                     Z-ADDOEAMT     WKINT
     C                     MOVE '-'       ZSIGNT
     C                     MOVE 'A'       ZSIGN
     C                     MOVE WKINT     ZNUMIN
     C                     EXSR FORMAT
     C                     MOVE ZNUMOT    HINT
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    PRDCFD SR. PROCESS SERVICE FEE RECORD.
     C*
     C           PRDCFD    BEGSR                           *** PRDCFD ***
     C*
     C*    UPDATE AMOUNT.
     C*
     C                     MOVE *BLANKS   HAMT
     C*
     C*    UPDATE BALANCE. (USE PREVOIUS BALANCE)
     C*
     C                     MOVE PBAL      HBAL                            E36324
     C*
     C*    CALCULATE DAYS.
     C*
     C                     Z-ADD0         DAYS
     C*
     C*    PRINT THE EVENT AMOUNT IN THE INTEREST FIELD.
     C*
     C           OEAMT     IFLT 0                                         E36380
     C                     Z-SUBOEAMT     WKINT
     C                     MOVE '+'       ZSIGNT                          E36400
     C                     ELSE                                           E36380
     C                     Z-ADDOEAMT     WKINT                           E36380
     C                     MOVE '-'       ZSIGNT
     C                     END                                            E36380
     C                     MOVE 'A'       ZSIGN
     C                     MOVE WKINT     ZNUMIN
     C                     EXSR FORMAT
     C                     MOVE ZNUMOT    HINT
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    PRDCSC SR. PROCESS RENOGIATION RECORD.
     C*
     C           PRDCSC    BEGSR                           *** PRDCSC ***
     C*
     C*    COMPLETE NARRITIVE.
     C*
     C           OTERM     IFEQ '000'
     C                     MOVE '11AM '   NARR
     C                     ELSE
     C           OTERM     IFEQ '001'
     C                     MOVE '24HR '   NARR
     C                     END
     C                     END
     C*
     C*    UPDATE AMOUNT.
     C*
     C                     MOVE *BLANKS   HAMT
     C*
     C*    UPDATE BALANCE. (USE PREVIOUS BALANCE)
     C*
     C                     MOVE PBAL      HBAL                            E36324
     C*
     C*    UPDATE RATE.
     C*
     C                     Z-ADDONRAT     RATE
     C*
     C*    CALCULATE DAYS.
     C*
     C           NXTDAT    SUB  OEDAT     DAYS
     C/COPY WNCPYSRC,DL9111CP29                                           S01408
     C*
     C*    IF NEXT RECORD TO PROCESS IS AN INTEREST PAYMENT (IP),
     C*      A WITHHOLDING TAX PAYMENT (TX) A SERVICE CHARGE (FD)
     C*      AND THE DEAL HAS NOT MATURED THEN INCREASE DAYS BY
     C*      1 TO INCLUDE THE MONTH END DAY.
     C*
     C           RTYP      IFEQ 'IP'
     C           RTYP      OREQ 'TX'
     C           RTYP      OREQ 'FD'
     C*                                                                   S01408
     C*                                                                   S01408
     C/COPY WNCPYSRC,DL9111CCP7                                           S01408
     C*                                                                   S01408
     C*                                                                   S01408
     C           OMDAT     IFEQ 0
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     ELSE
     C           EDAT      IFLT OMDAT
     C                     ADD  1         DAYS
     C                     ADD  1         NXTDAT
     C                     END
     C                     END
     C                     END
     C/COPY WNCPYSRC,DL9111CP30                                           S01408
     C*
     C*    CALCULATE INTEREST FROM PREVIOUS EDAT TO CURRENT EDAT.
     C*
     C           DAYS      IFGT 0
     C                     Z-ADDOEDAT     ZIBEG
     C                     Z-ADDNXTDAT    ZIEND
     C                     Z-ADDRBAL      ZIAMT
     C                     MOVE OICBS     ZICALC
     C                     Z-ADDONRAT     ZIRATE
     C                     EXSR GLINTC
     C                     Z-ADDZINTR     WKINT                           S01390
     C                     ADD  WKINT     RINT
     C                     ELSE
     C                     Z-ADD0         WKINT
     C                     END
     C           WKINT     IFGT 0
     C                     MOVE '+'       ZSIGNT
     C                     END
     C           WKINT     IFLT 0                                         192749
     C                     MOVE '-'       ZSIGNT                          192749
     C                     Z-SUBWKINT     WKINT                           192749
     C                     END                                            192749
     C                     MOVE 'A'       ZSIGN
     C                     MOVE WKINT     ZNUMIN
     C                     EXSR FORMAT
     C                     MOVE ZNUMOT    HINT
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    PROCMA SR. PROCESS MATURITY RECORD.
     C*
     C           PRDCMA    BEGSR                           *** PROCMA ***
     C*
     C*    UPDATE AMOUNT.
     C*
     C                     MOVE OEAMT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HAMT
     C*
     C*    UPDATE BALANCE.
     C*
     C                     Z-ADD0         RBAL
     C                     MOVE RBAL      ZNUMIN
     C                     EXSR FORMAT
     C           *IN88     IFEQ '1'                        ENSURE ERROR   E36383
     C                     MOVE '1'       *IN89            IND. SET ON IF E36383
     C                     MOVE '0'       *IN88            APPLICABLE     E36383
     C                     END                                            E36383
     C                     MOVE ZNUMOT    HBAL
     C*
     C*    UPDATE RATE.
     C*
     C                     Z-ADD0         RATE
     C*
     C*    CALCULATE DAYS.
     C*
     C                     Z-ADD0         DAYS
     C*
     C*    CALCULATE INTEREST FROM PREVIOUS EDAT TO CURRENT EDAT.
     C*
     C                     MOVE *BLANKS   HINT
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    PROCIP SR. PROCESS INTEREST DUE/CAPITILISATION RECORD.
     C*
     C           PRDCIP    BEGSR                           *** PROCIP ***
     C*
     C*    CAPITILISE INTEREST IF OINTC = Y AND DEAL NOT MATURED AT
     C*      THE TIME OF THIS INTEREST PAYMENT.
     C*
     C                     MOVE OFF       *IN40
     C           OINTC     IFEQ 'Y'
     C           OMDAT     IFEQ 0
     C           OMDAT     ORGT OEDAT
     C                     MOVE ON        *IN40
     C                     END
     C                     END
     C*
     C*    COMPLETE NARRITIVE.
     C*
     C           *IN40     IFEQ OFF
     C                     MOVE 'DUE    ' NARR
     C                     ELSE
     C                     MOVE 'CAP    ' NARR
     C                     END
     C*
     C*    UPDATE AMOUNT.
     C*
     C           *IN40     IFEQ OFF
     C                     MOVE *BLANKS   HAMT
     C                     ELSE
     C           OEAMT     IFLT 0                                         192749
     C                     Z-SUBOEAMT     TMP130                          192749
     C                     MOVE TMP130    ZNUMIN                          192749
     C                     MOVE 'B'       ZSIGN                           192749
     C                     MOVE '-'       ZSIGNT                          192749
     C                     ELSE                                           192749
     C                     MOVE OEAMT     ZNUMIN
     C                     END                                            192749
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HAMT
     C                     END
     C*
     C*    UPDATE BALANCE.
     C*
     C           *IN40     IFEQ OFF
     C                     MOVE *BLANKS   HBAL
     C                     ELSE
     C                     ADD  OEAMT     RBAL
     C                     MOVE RBAL      ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HBAL
     C                     END
     C*
     C*    UPDATE RATE.
     C*
     C           *IN40     IFEQ OFF
     C                     Z-ADD0         RATE
     C                     ELSE
     C                     Z-ADDONRAT     RATE
     C                     END
     C*
     C*    CALCULATE DAYS.
     C*
     C                     Z-ADD0         DAYS
     C*
     C*    CALCULATE INTEREST FROM PREVIOUS EDAT TO CURRENT EDAT.
     C*
     C                     SUB  RESIDU    OEAMT
     C                     SUB  RESIDU    DINT                            E99998
     C                     ADD  OEAMT     OINT
     C*                    MOVE OEAMT     ZNUMIN                          E36576
     C                     Z-ADDOEAMT     WKINT                           E36576
     C                     MOVE 'A'       ZSIGN
     C*          OEAMT     IFNE 0                                         E36576
     C           WKINT     IFGT 0                                         E36576
     C**         *IN40     IFEQ OFF                                       E36502
     C                     MOVE '-'       ZSIGNT
     C**                   ELSE                                           E36502
     C**                   MOVE '+'       ZSIGNT                          E36502
     C**                   END                                            E36502
     C                     ELSE                                           E36576
     C           WKINT     IFLT 0                                         E36576
     C                     MOVE '+'       ZSIGNT                          E36576
     C                     Z-SUBWKINT     WKINT                           E36576
     C                     END                                            E36576
     C                     END
     C                     MOVE WKINT     ZNUMIN                          E36576
     C                     EXSR FORMAT
     C           *IN88     IFEQ '1'                        ENSURE ERROR   E36383
     C                     MOVE '1'       *IN89            IND. SET ON IF E36383
     C                     MOVE '0'       *IN88            APPLICABLE     E36383
     C                     END                                            E36383
     C                     MOVE ZNUMOT    HINT
     C*
     C*    IF INTEREST IS CAPITILISED THEN RESET INTEREST PAID
     C*
     C           *IN40     IFEQ ON
     C                     Z-ADD0         OINT
     C                     Z-ADD0         DINT
     C                     Z-ADD0         DFEE
     C                     END
     C                     MOVE OEAMT     ZNUMIN
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    PROCCB SR. PROCESS CLOSING BALANCE RECORD.
     C*
     C           PRDCCB    BEGSR                           *** PROCCB ***
     C*
     C*    UPDATE AMOUNT.
     C*
     C                     MOVE *BLANKS   HAMT
     C*
     C*    UPDATE BALANCE.
     C*
     C                     MOVE OEAMT     ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HBAL
     C*
     C*    UPDATE RATE.
     C*
     C                     Z-ADDONRAT     RATE
     C*
     C*    CALCULATE DAYS.
     C*
     C                     Z-ADD0         DAYS
     C*
     C*    CALCULATE INTEREST FROM PREVIOUS EDAT TO CURRENT EDAT.
     C*
     C                     Z-ADD0         WKINT
     C                     MOVE WKINT     ZNUMIN
     C                     MOVE 'A'       ZSIGN
     C                     MOVE ' '       ZSIGNT
     C                     EXSR FORMAT
     C           *IN88     IFEQ '1'                        ENSURE ERROR   E36383
     C                     MOVE '1'       *IN89            IND. SET ON IF E36383
     C                     MOVE '0'       *IN88            APPLICABLE     E36383
     C                     END                                            E36383
     C                     MOVE ZNUMOT    HINT
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    PROCRO SR. PROCESS ROLLOVER RECORD.
     C*
     C           PRDCRO    BEGSR                           *** PROCRO ***
     C*
     C*    UPDATE AMOUNT.
     C*
     C           OEAMT     IFGT OPCPL
     C                     Z-ADDOPCPL     RAMT
     C                     ELSE
     C                     Z-ADDOEAMT     RAMT
     C                     END
     C                     MOVE RAMT      ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C                     MOVE ZNUMOT    HAMT
     C*
     C*    UPDATE BALANCE.
     C*
     C                     MOVE *BLANKS   HBAL
     C*
     C*    UPDATE RATE.
     C*
     C                     Z-ADD0         RATE
     C*
     C*    CALCULATE DAYS.
     C*
     C                     Z-ADD0         DAYS
     C*
     C*    CALCULATE INTEREST FROM PREVIOUS EDAT TO CURRENT EDAT.
     C*
     C           OEAMT     IFGT OPCPL
     C           OEAMT     SUB  OPCPL     WKINT
     C                     ADD  WKINT     RESIDU
     C*                    MOVE '+'       ZSIGNT                          E99998
     C                     MOVE '-'       ZSIGNT                          E99998
     C                     ELSE
     C                     Z-ADD0         WKINT
     C                     END
     C                     MOVE WKINT     ZNUMIN
     C                     MOVE 'A'       ZSIGN
     C                     EXSR FORMAT
     C           *IN88     IFEQ '1'                        ENSURE ERROR   E36383
     C                     MOVE '1'       *IN89            IND. SET ON IF E36383
     C                     MOVE '0'       *IN88            APPLICABLE     E36383
     C                     END                                            E36383
     C                     MOVE ZNUMOT    HINT
     C*
     C                     ENDSR
     C*
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    FORMAT SR. FORMAT FIELDS FOR OUTPUT.
     C*
     C*  PARAMETERS IN;
     C*              ZNUMIN : ALPHA FIELD CONTAINING THE NUMBER TO BE
     C*                       CONVERTED. THE NUMBER IS RIGHT JUSTIFIED.
     C*              ZDEC   : NUMBER OF DECIMAL PLACES
     C*              ZSIGNT : THE SIGN REQUIRED
     C*                        (ASSUME SIGN BLANK)
     C*              ZSIGN  : WHETHER A SIGN SHOULD APPEAR
     C*                        'A' = SIGN APPEARS AFTER THE NUMBER
     C*                        'B' = SIGN APPEARS BEFORE THE NUMBER
     C*                        ' ' = NO SIGN TO APPEAR.
     C*                        (ASSUME SIGN IS NOT REQUIRED)
     C*              ZCOMA  : WHETHER COMMA'S SHOULD APPEAR
     C*                        (ASSUME COMMA'S ARE REQUIRED)
     C*              ZCHRO  : MAXIMUM NUMBER OF OUTPUT CHARACTERS
     C*                        (ASSUME 13 IE. 10 NUMBERS
     C*                          WITH COMMA'S AND DECIMAL POINT)
     C* * * * * * * * * * *  W A R N I N G  * * * * * * * * * * *
     C*        ZSIGN, ZSIGNT, ZCOMA AND ZCHRO SHOULD BE INILILIZED
     C*        WITH DEFAULT VALUES IN THE FIRST CYCLE SUBROUTINE.
     C*
     C*  PARAMETERS OUT;
     C*              ZNUMOT : ARRAY CONTAINING FORMATTED NUMBER
     C*                        THE NUMBER IS RIGHT JUSTIFIED.
     C*              *IN89  : ERROR INDICATOR.
     C*
     C*  VARIABLES USED;
     C*              U      : WORK.
     C*              V      : USED TO CALCULATE IF A COMMA IS REQUIRED.
     C*              W      : STARTING POSITION OF THE NUMBER IN ZAR1.
     C*              X      : CURRENT ELEMENT IN ZAR1 BEING PROCESSED.
     C*              Y      : NEXT ELEMENT AVAILABLE IN ZAR2.
     C*              ZAR1   : ARRAY CONTAINING THE NUMBER TO BE
     C*                        FORMATTED. RIGHT JUSTIFIED.
     C*              ZAR2   : ARRAY CONTAINING THE FORMATTED NUMBER.
     C*                        RIGHT JUSTIFIED.
     C*
     C*
     C           FORMAT    BEGSR                           *** FORMAT ***
     C*
     C*    MOVE THE NUMBER COMING IN TO ARRAY 1.
     C*
     C                     MOVEA*BLANKS   ZAR1
     C                     MOVEA*BLANKS   ZAR2
     C                     MOVE *BLANKS   ZNUMOT 20
     C                     Z-ADDZDEC      ZDEC    10
     C                     MOVE OFF       *IN89
     C*
     C*    MOVE THE NUMBER COMING IN TO ARRAY 1.
     C*
     C                     MOVEAZNUMIN    ZAR1
     C*
     C*    FIND FIRST NUMBER IN INTEREST AMOUNT.
     C*
     C                     Z-ADD0         W       20
     C           20        SUB  ZDEC      U       20
     C                     MOVE OFF       *IN50
     C           *IN50     DOUEQON
     C                     ADD  1         W
     C*
     C*        FOUND FIRST NON '0' OR ' ' CHARACTER.
     C*
     C           ZAR1,W    IFNE ' '
     C           ZAR1,W    ANDNE'0'
     C                     MOVE ON        *IN50
     C                     END
     C*
     C*        IF NO CHARACTERS FOUND THEN SET W TO DECIMAL
     C*            PLACES + 1.
     C*
     C           W         IFEQ U
     C                     MOVE ON        *IN50
     C                     END
     C                     END
     C*
     C*    MOVE SIGN INTO OUTPUT FIELD. (APPEARS AFTER THE NUMBER)
     C*
     C                     Z-ADD20        X       20
     C                     Z-ADD20        Y       20
     C           ZSIGN     IFEQ 'A'
     C                     MOVE ZSIGNT    ZAR2,Y
     C                     SUB  1         Y
     C                     END
     C*
     C*    PROCESS NUMBER.
     C*
     C*    DECIMAL PORTION, (IF REQUIRED).
     C*
     C           ZDEC      IFGT 0
     C                     DO   ZDEC                       LOOP
     C                     MOVE ZAR1,X    ZAR2,Y
     C                     SUB  1         X
     C                     SUB  1         Y
     C                     END
     C                     MOVE '.'       ZAR2,Y
     C                     SUB  1         Y
     C                     END
     C                     Z-ADD0         V
     C*
     C*    PROCESS REST OF NUMBER.
     C*
     C                     MOVE OFF       *IN50
     C           *IN50     DOUEQON                         LOOP
     C*
     C*    COMMA'S.
     C*
     C           Y         IFGT 0
     C           ZCOMA     IFEQ 'Y'
     C           V         ANDGE3
     C                     MOVE ','       ZAR2,Y
     C                     SUB  1         Y
     C                     Z-ADD0         V       20
     C                     END
     C                     END
     C*
     C*    MOVE NUMERICS.
     C*
     C           Y         IFGT 0
     C                     MOVE ZAR1,X    ZAR2,Y
     C                     SUB  1         X
     C                     SUB  1         Y
     C                     ADD  1         V
     C                     END
     C*
     C           X         IFLT W                          PROCESSED
     C                     MOVE ON        *IN50            ALL NUMBERS
     C                     ELSE
     C           Y         IFLE 0                          NUMBER IS
     C                     MOVE ON        *IN50            TO BIG FOR
     C                     MOVE ON        *IN89            OUTPUT
     C                     END
     C                     END
     C*
     C                     END
     C*
     C*    MOVE SIGN INTO OUTPUT FIELD. (APPEARS BEFORE THE NUMBER)
     C*
     C           Y         IFGT 0
     C           ZSIGN     IFEQ 'B'
     C                     MOVE ZSIGNT    ZAR2,Y
     C                     SUB  1         Y
     C                     END
     C                     ELSE
     C                     MOVE ON        *IN89
     C                     END
     C*
     C*    IS OUTPUT VALUE TO LARGE
     C*
     C           20        SUB  Y         U
     C           U         IFGT ZCHRO
     C                     MOVE ON        *IN89
     C                     END
     C*
     C*    MOVE FORMATTED AMOUNT TO OUTPUT FIELD.
     C*
     C                     MOVEAZAR2      ZNUMOT 20
     C*
     C*    INITILIZE INPUT PARAMETERS.
     C*
     C                     Z-ADD20        ZCHRO   20
     C                     MOVE *BLANKS   ZNUMIN 20
     C                     MOVE ' '       ZSIGNT  1
     C                     MOVE 'N'       ZSIGN   1
     C                     MOVE 'Y'       ZCOMA   1
     C*
     C                     ENDSR
     C*
     C*
     C/EJECT
     C********************************************************************
     C*
     C*      DEALSR SR  ACCUMULATE DEAL TOTALS.
     C*
     C           DEALSR    BEGSR                           *** DEALSR ***
     C*
     C*    ADD TO CUSTOMER TOTALS.
     C*
     C                     ADD  DINT      RINT
     C                     ADD  DFEE      RFEE
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*      CSTTSR SR  OUTPUT CUSTOMER TOTAL.
     C*
     C           CSTTSR    BEGSR                           *** CSTTSR ***
     C*
     C*    INCREMENT AUDIT TOTALS.
     C*
     C                     ADD  1         STLT
     C*
     C*    FORMAT TOTAL AMOUNTS.
     C*
     C*      INTEREST.
     C*
     C*                    MOVE RINT      ZNUMIN                          E36431
     C                     MOVE OINT      ZNUMIN                          E36431
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C*
     C*      SERVICE FEES.
     C*
     C                     MOVE RFEE      ZNUMIN
     C                     EXSR FORMAT
     C           *IN89     IFEQ '1'                        SAVE ERROR IND.E36383
     C                     MOVE '1'       *IN88            IN CASE RESET  E36383
     C                     END                             BEFORE END SR. E36383
     C*
     C*      TOTAL.
     C*
     C           RINT      ADD  RFEE      RTOT
     C                     MOVE OINT      ZNUMIN
     C                     EXSR FORMAT
     C           *IN88     IFEQ '1'                        ENSURE ERROR   E36383
     C                     MOVE '1'       *IN89            IND. SET ON IF E36383
     C                     MOVE '0'       *IN88            APPLICABLE     E36383
     C                     END                                            E36383
     C*
     C*    OUTPUT CUSTOMER TOTAL LINES.
     C*
     C                     MOVE OFF       *IN18
     C*
     C                     ENDSR
     C*
     C/EJECT
     C********************************************************************
     C*
     C*    CNTROL SR. OUTPUT CONTROL REPORT.
     C*
     C           CNTROL    BEGSR                           *** CNTROL ***
     C*                                                                   S01390
     C** Report printer file to RCF via ZSFILE                            S01390
     C*                                                                   S01390
     C                     Z-ADDSFNUMU    ZSNUM   60                      S01390
     C                     CALL 'ZSFILE'                                  S01390
     C                     PARM           SEQ     5                       S01390
     C                     PARM *BLANKS   @ENT    3                       S01390
     C                     PARM           SFILEU                          S01390
     C                     PARM           ZSNUM                           S01390
     C                     PARM *BLANKS   ZSERR   1                       S01390
     C*                                                                   S01390
     C** Error during ZSFILE processing, return to calling program        S01390
     C*                                                                   S01390
     C           ZSERR     IFEQ 'Y'                                       S01390
     C                     SETON                     U7U8                 S01390
     C                     END                                            S01390
     C*
     C*    OUTPUT AUDIT REPORT
     C*
     C                     WRITEAUDIT
     C           *INU8     IFEQ '1'                                       S01390
     C                     WRITEDBERR                                     S01390
     C                     END                                            S01390
     C           FILOP1    IFNE 'Y'                                       S01390
     C                     WRITENODETL                                    S01390
     C                     END                                            S01390
     C*
     C                     ENDSR
     C*
     C***/EJECT****                                                       S01390
     C********************************************************************S01390
     C***********                                                         S01390
     C*****ZSYSTM*SR.*TO*CHAIN*TO*THE*INSTALLATION*CONTROL*DATA*RECORD.***S01390
     C***********                                                         S01390
     C***********ZSYSTM    BEGSR                           *** ZSYSTM *** S01390
     C***********                                                         S01390
     C*****SET*UP*KEY*FOR*INSTALLATION*CONTROL*RECORD.********************S01390
     C***********          MOVEL'01      'ZTABKY 12                       S01390
     C***********          MOVE '  10'    ZTABKY                          S01390
     C***********                                                         S01390
     C***********ZTABKY    CHAINTABDLEE              99    ON NOT THERE   S01390
     C**N99******RECI      COMP 'D'                  9999  ON, IS DELETED S01390
     C***********                                                         S01390
     C*****CHECK*SYSTEM*DATE*FORMAT,*DDMMYY*OR*MMDDYY.********************S01390
     C***********DATF      COMP 'M'                      98MMDDYY, 98 ON  S01390
     C***********                                                         S01390
     C***********          ENDSR                                          S01390
     C***********                                                         S01390
     C********************************************************************S01390
     C***********                                                         S01390
     C*****GLINTC*SR.*TO*CALCULATE*INTEREST*BETWEEN*ANY*TWO*DAY*NUMBERS.**S01390
     C***********                                                         S01390
     C*****THIS*VERSION*REPLACES*THE*ORIGINAL*GLINTC*SR.*NOW*NAMED        S01390
     C*****GLINTO.********************************************************S01390
     C***********                                                         S01390
     C*****CALCULATION*METHODS*ARE*-**************************************S01390
     C*****1**ACTUAL/365**************************************************S01390
     C*****2**ACTUAL/360**************************************************S01390
     C*****3**360/360*(SOMETIMES*CALLED*30/360)***************************S01390
     C*****4**365/365*(EXCLUDING*29/02)***********************************S01390
     C*****5**365/360*(EXCLUDING*29/02)***********************************S01390
     C*****6**ACTUAL/366**************************************************S01390
     C***********                                                         S01390
     C*****REQUIRES*SUBRS.*-*ZDATE2,*ZSAVE,*&*ZRSTOR.*********************S01390
     C***********                                                         S01390
     C***********                                                         S01390
     C***********GLINTC    BEGSR                           ** GLINTC  **  S01390
     C***********                                                         S01390
     C*****CALCULATIONS*TO*DEFINE*INPUT*FIELDS.***************************S01390
     C***********          Z-ADDZIBEG     ZIBEG   50       STARTING DATE  S01390
     C***********          Z-ADDZIEND     ZIEND   50       FINISHING DATE S01390
     C***********          Z-ADDZICALC    ZICALC  10       CALC. BASIS    S01390
     C***********          Z-ADDZIAMT     ZIAMT  150       PRINCIPAL      S01390
     C***********          Z-ADDZIRATE    ZIRATE 117       RATE OF INTRST S01390
     C***********                                                         S01390
     C****TO*DETERMINE*NUMBER*OF*DAYS*INTEREST*TO*BE*CALCULATED***********S01390
     C***********ZIEND     SUB  ZIBEG     ZDAYN1  50                      S01390
     C***********                                                         S01390
     C****CHECK*FOR*INTEREST*CALCULATION*BASIS****************************S01390
     C*****USE*OF*INDICATRS***********************************************S01390
     C*****1,92**2,90**3,91**4,97**5,96**6,95*****************************S01390
     C***********          SETOF                     959697               S01390
     C***********ZICALC    COMP 2                    919290               S01390
     C**N91******          GOTO ZICAL                                     S01390
     C***********ZICALC    COMP 5                    959796               S01390
     C***97******ZICALC    COMP 3                    97  91               S01390
     C***95******                                                         S01390
     C***OR*96******          SETOF                     91                S01390
     C**N91******          GOTO ZILPCK                                    S01390
     C***********                                                         S01390
     C*****THIS*CODING*WILL*CALCULATE*THE*NUMBER*OF*DAYS*TO*USE*WHEN******S01390
     C*****USING*THE*30/360*BASIS*-*METHOD*3.*****************************S01390
     C***********          EXSR ZSAVE                                     S01390
     C***********          Z-ADDZIBEG     ZDAYNO                          S01390
     C***********          EXSR ZDATE2                                    S01390
     C***********          MOVE ZDAY      ZISD    20                      S01390
     C***********          MOVE ZMTH      ZISM    20                      S01390
     C***********          MOVE ZYEAR     ZISY    20                      S01390
     C***********          Z-ADDZIEND     ZDAYNO                          S01390
     C***********          EXSR ZDATE2                                    S01390
     C***********          MOVE ZDAY      ZIFD    20                      S01390
     C***********          MOVE ZMTH      ZIFM    20                      S01390
     C***********          MOVE ZYEAR     ZIFY    20                      S01390
     C***********          EXSR ZRSTOR                                    S01390
     C***********          SETOF                     93                   S01390
     C****IN*ORDER*FOR*THE*FINISH*YEAR*TO*BE*LESS*THAN*THE*START*YEAR*IF**S01390
     C****ZIEND*IS*GREATER*THAN*ZIBEG,THEN*THE*DATE*ZIEND*MUST*BE*IN*A****S01390
     C****DIFFERENT*CENTURY*TO*ZIBEG.IF*SO*ADD*100*YEARS*TO*IT.***********S01390
     C***********ZIEND     COMP ZIBEG                93                   S01390
     C***93******ZIFY      COMP ZISY                   93                 S01390
     C***********          Z-ADDZISY      ZISY2   30                      S01390
     C**N93******          Z-ADDZIFY      ZIFY2   30                      S01390
     C***93******ZIFY      ADD  100       ZIFY2                           S01390
     C***********                                                         S01390
     C*****DETERMINE*WHETHER*START*YEAR*IS*A*LEAP*YEAR*AND*IF*START*******S01390
     C*****MONTH*IS*FEBRUARY.*********************************************S01390
     C***********                                                         S01390
     C**N98******          BITOF'0'       ZGLBIT  1                       S01390
     C***98******          BITON'0'       ZGLBIT                          S01390
     C***********ZISY2     ADD  1900      ZLYCHK  40                      S01390
     C***********ZLYCHK    DIV  4         ZLYCHK                          S01390
     C***********          MVR            ZLYREM  20                      S01390
     C***********ZLYREM    COMP *ZERO                    98*LEAP YEAR     S01390
     C***********ZISM      COMP 2                        99*FEBRUARY      S01390
     C**N99******30        SUB  ZISD      ZID1    50   93                 S01390
     C**N99*93***          Z-ADD0         ZID1                            S01390
     C***99N98***28        SUB  ZISD      ZID1                            S01390
     C***99*98***29        SUB  ZISD      ZID1                            S01390
     C***********ZISM      COMP 12                       93               S01390
     C***93******          Z-ADD0         ZISM                            S01390
     C***93******ZISY      ADD  1         ZISY                            S01390
     C***93******ZISY2     ADD  1         ZISY2                           S01390
     C***********                                                         S01390
     C*****DETERMINE*WHETHER*END*YEAR*IS*A*LEAP*YEAR*AND*IF*END*MONTH*****S01390
     C*****IS*FEBRUARY.***************************************************S01390
     C***********                                                         S01390
     C***********ZIFY2     ADD  1900      ZLYCHK  40                      S01390
     C***********ZLYCHK    DIV  4         ZLYCHK                          S01390
     C***********          MVR            ZLYREM  20                      S01390
     C***********ZLYREM    COMP *ZERO                    98*LEAP YEAR     S01390
     C***********ZIFM      COMP 2                        99*FEBRUARY      S01390
     C**N99******ZIFD      COMP 31                       93               S01390
     C***99N98***ZIFD      COMP 28                       93               S01390
     C***99*98***ZIFD      COMP 29                       93               S01390
     C***********          SETOF                     98                   S01390
     C***********          TESTB'0'       ZGLBIT         98               S01390
     C***93******ZID1      ADD  30        ZID1                            S01390
     C**N93******ZID1      ADD  ZIFD      ZID1                            S01390
     C***********ZIFM      SUB  1         ZIFM                            S01390
     C***********ZISY      COMP ZIFY                     93               S01390
     C***93******ZIFM      SUB  ZISM      ZINOM   30                      S01390
     C***93******          GOTO ZIOUT                                     S01390
     C***********12        SUB  ZISM      ZIM1    20                      S01390
     C***********          Z-ADD1         ZISM                            S01390
     C*****USE*ENLARGED*FIELDS*THAT*CAN*HANDLE*1999*ONWARDS***************S01390
     C***********ZISY2     ADD  1         ZISY2                           S01390
     C***********ZIFY2     SUB  ZISY2     ZIY1    20                      S01390
     C***********ZIY1      MULT 12        ZIM2    30                      S01390
     C***********ZIM2      ADD  ZIFM      ZIM2                            S01390
     C***********ZIM1      ADD  ZIM2      ZINOM                           S01390
     C***********ZIOUT     TAG                             * ZIOUT TAG *  S01390
     C***********ZINOM     MULT 30        ZID2    50                      S01390
     C***********ZID2      ADD  ZID1      ZDAYN1                          S01390
     C***********          SETOF                     93                   S01390
     C***********ZILPCK    TAG                             * ZILPCK TAG * S01390
     C**N96N97***          GOTO ZICAL                                     S01390
     C*****THE*FOLLOWING*CODING*APPLIES*FOR*METHODS*4*AND*5*ONLY.*********S01390
     C*****1*DAY*IS*SUBTRACTED*FROM*ZDAYN1*FOR*EACH*OCCURANCE*OF*29*FEB***S01390
     C*****IN*THE*INTEREST*CALCULATION*PERIOD*INCLUSIVE*OF*ZIBEG,*&*ZIEND.S01390
     C***********                                                         S01390
     C*****FIND*NO*OF*4*YEAR*PERIODS*BETWEEN*DATES************************S01390
     C***********ZDAYN1    DIV  1461      ZIMAN   20                      S01390
     C***********          MVR            ZIREM   50                      S01390
     C*****FIND*NEXT*29*FEB*DAY*NO.*ON*OR*AFTER*ZIBEG.********************S01390
     C***********ZIBEG     SUB  60        ZIBW1   50                      S01390
     C***********ZIBW1     DIV  1461      ZIDW1   20                      S01390
     C***********          MVR            ZIDREM  50                      S01390
     C***********ZIDREM    COMP 0                        94               S01390
     C***94******          Z-ADDZIBEG     ZIDW2   50                      S01390
     C***94******          GOTO ZILP1                                     S01390
     C*****ROUND*UP*RESULT************************************************S01390
     C***********ZIDW1     ADD  1         ZIDW2                           S01390
     C*****CALCULATE NEXT 29 FEB.                                         S01390
     C***********ZIDW2     MULT 1461      ZIDW2                           S01390
     C***********ZIDW2     ADD  60        ZIDW2                           S01390
     C***********ZILP1     TAG                             * ZILP1 TAG *  S01390
     C*****IF*THIS*NEXT*29*FEB.*DAYNO*-*ZIBEG*IS*GR.*TH.*OR*EQ.*TO********S01390
     C*****ZIREM*THEN*ADD*1*TO*ZIMAN.*************************************S01390
     C***********ZIDW2     SUB  ZIBEG     ZILPCP  50                      S01390
     C***********ZIREM     COMP ZILPCP               94  94               S01390
     C***94******ZIMAN     ADD  1         ZIMAN                           S01390
     C*****SUBTRACT*ZIMAN*FROM*ZDAYN1*TO*GIVE*VALUE*OF*ZDAYN1*************S01390
     C*****REQUIRED*FOR*THIS*INTEREST*CALCULATION.************************S01390
     C***********ZDAYN1    SUB  ZIMAN     ZDAYN1                          S01390
     C***********          SETOF                     94                   S01390
     C***********ZICAL     TAG                             * ZICAL TAG *  S01390
     C***********                                                         S01390
     C****CALCULATE*INTEREST**********************************************S01390
     C***90******                                                         S01390
     C***OR*91******                                                      S01390
     C***OR*96******ZIAMT     DIV  36000     ZIWRK1 155H                  S01390
     C***92******                                                         S01390
     C***OR*97******ZIAMT     DIV  36500     ZIWRK1    H                  S01390
     C***95******ZIAMT     DIV  36600     ZIWRK1    H                     S01390
     C***********ZIWRK1    MULT ZIRATE    ZIWRK2 155H                     S01390
     C***********ZIWRK2    MULT ZDAYN1    ZINTR  152H      AMT. OF INTRST S01390
     C***********                                                         S01390
     C***********          SETOF                     909192               S01390
     C***********          SETOF                     959697               S01390
     C***********                                                         S01390
     C***********                                                         S01390
     C*****AMENDMENT*FOR*THIS*PROGRAM*ONLY********************************S01390
     C*****ROUND*INTEREST*AMOUNT*TO*ZERO*DEC*PL***************************S01390
     C***********                                                         S01390
     C***********          Z-ADDZINTR     WKINT  130H                     S01390
     C***********                                                         S01390
     C***********          ENDSR                                          S01390
     C***********                                                         S01390
     C********************************************************************S01390
     C***********                                                         S01390
     C*****ZSAVE*SR.*TO*MEMORISE*THE*SETTINGS*AND*TO*SET*OFF*INDICATORS***S01390
     C****************90*-*97*BEFORE*EXECUTION*OF*A*Z-SUBROUTINE.*********S01390
     C***********                                                         S01390
     C*****THIS*SR.*IS*REQUIRED*ONLY*IF*INDICATORS************************S01390
     C*****90*-*97*ARE*USED*ELSEWHERE*IN*A*PROGRAM.***********************S01390
     C***********                                                         S01390
     C***********ZSAVE     BEGSR                           *** ZSAVE ***  S01390
     C***********                                                         S01390
     C***********          BITOF'01234567'ZBITS   1                       S01390
     C***90******          BITON'0'       ZBITS                           S01390
     C***91******          BITON'1'       ZBITS                           S01390
     C***92******          BITON'2'       ZBITS                           S01390
     C***93******          BITON'3'       ZBITS                           S01390
     C***94******          BITON'4'       ZBITS                           S01390
     C***95******          BITON'5'       ZBITS                           S01390
     C***96******          BITON'6'       ZBITS                           S01390
     C***97******          BITON'7'       ZBITS                           S01390
     C***********                                                         S01390
     C***********          SETOF                     909192               S01390
     C***********          SETOF                     939495               S01390
     C***********          SETOF                     9697                 S01390
     C***********                                                         S01390
     C***********          ENDSR                                          S01390
     C***********                                                         S01390
     C********************************************************************S01390
     C***********                                                         S01390
     C*****ZRSTOR*SR.*TO*RESTORE*INDICATORS*90*-*97*TO*THE*SETTINGS*******S01390
     C****************THEY*HAD*BEFORE*THE*EXECUTION*OF*SR.*ZSAVE.*********S01390
     C***********                                                         S01390
     C***********ZRSTOR    BEGSR                           *** ZRSTOR *** S01390
     C***********                                                         S01390
     C***********          TESTB'0'       ZBITS          90               S01390
     C***********          TESTB'1'       ZBITS          91               S01390
     C***********          TESTB'2'       ZBITS          92               S01390
     C***********          TESTB'3'       ZBITS          93               S01390
     C***********          TESTB'4'       ZBITS          94               S01390
     C***********          TESTB'5'       ZBITS          95               S01390
     C***********          TESTB'6'       ZBITS          96               S01390
     C***********          TESTB'7'       ZBITS          97               S01390
     C***********                                                         S01390
     C***********          ENDSR                                          S01390
     C***********                                                         S01390
     C********************************************************************S01390
     C***********                                                         S01390
     C*****ZDATE2*SR.*TO*CONVERT*A*DAY*NUMBER*TO*DATE*FORMATS.************S01390
     C***********                                                         S01390
     C*****THE*YEAR*2000,*BEING*DIVISIBLE*BY*400,*IS*A*LEAP*YEAR.*********S01390
     C***********                                                         S01390
     C***********ZDATE2    BEGSR                           *** ZDATE2 *** S01390
     C***********                                                         S01390
     C*****CLEAR*DATE*FIELDS.*********************************************S01390
     C***********          Z-ADD0         ZDATE   60                      S01390
     C***********          MOVEL'       ' ZADATE  7                       S01390
     C***********                                                         S01390
     C*****CALCULATION*TO*DEFINE*INPUT*DAY*NUMBER.************************S01390
     C***********          Z-ADDZDAYNO    ZDAYNO  50                      S01390
     C***********                                                         S01390
     C*****DETERMINE*YEAR*NUMBER.                                         S01390
     C***********                                                         S01390
     C*****ADJUST*DAY*NUMBER*IN*CASE*LAST*DAY*OF*YEAR.********************S01390
     C***********ZDAYNO    SUB  1         ZDAYN1  50   99                 S01390
     C***99******          GOTO ZDEND2                                    S01390
     C***********                                                         S01390
     C*****CALCULATE*NUMBER*OF*4*YEAR*SPANS*SINCE*31/12/1971.*************S01390
     C***********ZDAYN1    DIV  1461      ZLYR    20                      S01390
     C***********          MVR            ZDAYN1           SAVE REMAINING S01390
     C***********                                          DAYS           S01390
     C*****CALCULATE*NUMBER*OF*REMAINING*YEARS.***************************S01390
     C***********          Z-ADD1         ZWRK2   20                      S01390
     C***********ZDTAG1    TAG                             ** ZDTAG1 TAG *S01390
     C***********ZDAYN1    COMP ZYDY,ZWRK2             90                 S01390
     C**N90******ZWRK2     ADD  1         ZWRK2                           S01390
     C**N90******          GOTO ZDTAG1                                    S01390
     C***********ZWRK2     SUB  1         ZWRK2          91LEAP YR, 91 ON S01390
     C***********                                                         S01390
     C*****DECREMENT*DAY*NO.*BY*DAYS*IN*REMAINING*YEARS.******************S01390
     C**N91******ZDAYN1    SUB  ZYDY,ZWRK2ZDAYN1                          S01390
     C***********                                                         S01390
     C*****CALCULATE*ACTUAL*YEAR*NUMBER.**********************************S01390
     C***********ZLYR      MULT 4         ZWRK3   30                      S01390
     C***********ZWRK3     ADD  72        ZWRK3            BASE IS 1972   S01390
     C***********          Z-ADDZWRK3     ZYEAR   20                      S01390
     C***********ZYEAR     ADD  ZWRK2     ZYEAR            YEAR           S01390
     C***********                                                         S01390
     C*****DETERMINE*MONTH*NUMBER.****************************************S01390
     C***********                                                         S01390
     C*****ADJUST*DAY*NO.*IN*CASE*LAST*DAY*OF*LEAP*YEAR*FEBRUARY.*********S01390
     C***********          SETOF                     9293                 S01390
     C***91******ZDAYN1    COMP 59                     9293               S01390
     C***91N92***ZDAYN1    SUB  1         ZDAYN1                          S01390
     C***********                                                         S01390
     C*****CALCULATE*MONTH*NUMBER.****************************************S01390
     C***********          Z-ADD2         ZWRK2                           S01390
     C***********ZDTAG2    TAG                             ** ZDTAG2 TAG *S01390
     C***********ZDAYN1    COMP ZMDY,ZWRK2             94                 S01390
     C**N94******ZWRK2     ADD  1         ZWRK2                           S01390
     C**N94******          GOTO ZDTAG2                                    S01390
     C***********ZWRK2     SUB  1         ZWRK2                           S01390
     C***********                                                         S01390
     C***********          Z-ADDZWRK2     ZMTH    20       MONTH          S01390
     C***********                                                         S01390
     C*****DETERMINE*DAY*OF*MONTH.****************************************S01390
     C***********                                                         S01390
     C*****ADD*BACK*LAST*DAY*OF*YEAR*ADJUSTMENT.**************************S01390
     C***********ZDAYN1    ADD  1         ZDAYN1                          S01390
     C***********                                                         S01390
     C*****CALCULATE*DAY*OF*MONTH.****************************************S01390
     C***********ZDAYN1    SUB  ZMDY,ZWRK2ZDAY    20       DAY            S01390
     C***********                                                         S01390
     C*****ADD*BACK*LEAP*YEAR*29TH*FEBUARY*ADJUSTMENT,*IF*REQUIRED.*******S01390
     C***93******ZDAY      ADD  1         ZDAY                            S01390
     C***********                                                         S01390
     C*****FORMAT*DATE,*DDMMYY*OR*MMDDYY.*********************************S01390
     C**N98******          MOVELZDAY      ZWRK4   40                      S01390
     C***98******          MOVE ZDAY      ZWRK4                           S01390
     C**N98******          MOVE ZMTH      ZWRK4                           S01390
     C***98******          MOVELZMTH      ZWRK4                           S01390
     C***********          MOVELZWRK4     ZDATE                           S01390
     C***********          MOVE ZYEAR     ZDATE                           S01390
     C***********                                                         S01390
     C*****FORMAT*ALPHA*DATE,*DDMMMYY.************************************S01390
     C***********ZDAY      COMP 10                     95                 S01390
     C***********          MOVELZDAY      ZWRK5   5                       S01390
     C***95******          MOVEL' '       ZWRK5                           S01390
     C***********          MOVE ZMNM,ZMTH ZWRK5                           S01390
     C***********          MOVELZWRK5     ZADATE                          S01390
     C***********          MOVE ZYEAR     ZADATE                          S01390
     C***********                                                         S01390
     C***********ZDEND2    ENDSR                           * ZDEND2 ENDSR*S01390
     C***********                                                         S01390
     C********************************************************************S01390
     C***********                                                         S01390
     C*****ZDATE1*SR.*TO*VALIDATE*DATES*SUBMITTED*AND*********************S01390
     C****************CONVERT*TO*A*NUMBER*OF*DAYS.************************S01390
     C***********                                                         S01390
     C*****THE*YEAR*2000,*BEING*DIVISIBLE*BY*400,*IS*A*LEAP*YEAR.*********S01390
     C***********                                                         S01390
     C***********ZDATE1    BEGSR                           *** ZDATE1 *** S01390
     C***********                                                         S01390
     C*****CLEAR*DAY*NUMBER.**********************************************S01390
     C***********          Z-ADD0         ZDAYNO  50                      S01390
     C***********                                                         S01390
     C*****CALCULATION*TO*DEFINE*INPUT*DATE*FIELD.************************S01390
     C***********          Z-ADDZDATE     ZDATE   60                      S01390
     C***********                                                         S01390
     C*****GET*INDIVIDUAL*DAY,*MONTH*AND*YEAR*FIELDS.*********************S01390
     C***********          MOVE ZDATE     ZYEAR   20                      S01390
     C**N98******          MOVELZDATE     ZDAY    20                      S01390
     C***98******          MOVELZDATE     ZMTH    20                      S01390
     C***********          MOVE ZDATE     ZWRK4   40                      S01390
     C**N98******          MOVELZWRK4     ZMTH                            S01390
     C***98******          MOVELZWRK4     ZDAY                            S01390
     C***********                                                         S01390
     C*****ENSURE*MONTH*IS*VALID.*****************************************S01390
     C***********ZMTH      COMP 0                      9999               S01390
     C**N99******ZMTH      COMP 12                   99                   S01390
     C***99******          GOTO ZDEND1                     BYPASS IF ERRORS01390
     C***********                                                         S01390
     C*****CHECK*FOR*30*DAY*MONTHS.***************************************S01390
     C***********ZMTH      COMP 4                        90IF 90 ON, 30   S01390
     C**N90******ZMTH      COMP 6                        90DAY MONTH.     S01390
     C**N90******ZMTH      COMP 9                        90               S01390
     C**N90******ZMTH      COMP 11                       90               S01390
     C***********                                                         S01390
     C*****ENSURE*DAY*IS*VALID.*******************************************S01390
     C***********ZDAY      COMP 0                      9999               S01390
     C***90N99***ZDAY      COMP 30                   99                   S01390
     C**N90N99***ZDAY      COMP 31                   99                   S01390
     C***99******          GOTO ZDEND1                     BYPASS IF ERRORS01390
     C***********                                                         S01390
     C*****CHECK*FOR*LEAP*YEAR*AND*FEBRUARY.******************************S01390
     C***********ZYEAR     ADD  28        ZYEAR                           S01390
     C***********ZYEAR     DIV  4         ZLYR    20                      S01390
     C***********          MVR            ZLY     10     91LEAP YR, 91 ON S01390
     C***********ZMTH      COMP 2                    93  92FEB., 92 ON    S01390
     C***********                                          PAST FEB, 93 ONS01390
     C*****IF*FEBUARY*FURTHER*VALIDATE*DAY.*******************************S01390
     C**N91*92***ZDAY      COMP 28                   99                   S01390
     C***91*92***ZDAY      COMP 29                   99                   S01390
     C***99******          GOTO ZDEND1                     BYPASS IF ERRORS01390
     C***********                                                         S01390
     C*****DETERMINE*NUMBER*OF*DAYS*FROM*31/12/1971.*****NO.OF*4*YR.*SPANSS01390
     C***********ZLYR      MULT 1461      ZDAYNO           X DAYS IN SPAN.S01390
     C**N91******ZDAYNO    ADD  ZYDY,ZLY  ZDAYNO           SINCE LAST L.YRS01390
     C***91*93***ZDAYNO    ADD  1         ZDAYNO           L.YR.,PAST FEB.S01390
     C***********ZDAYNO    ADD  ZMDY,ZMTH ZDAYNO           DAYS THIS YEAR S01390
     C***********ZDAYNO    ADD  ZDAY      ZDAYNO           DAYS THIS MONTHS01390
     C***********                                                         S01390
     C***********ZDEND1    ENDSR                           * ZDEND1 ENDSR*S01390
     C***********                                                         S01390
     C********************************************************************S01390
     C/EJECT
     O*
     O*
     C/COPY ZSRSRC,GLINTCZ1                                               S01390
     C/SPACE 3                                                            S01390
     C/COPY ZSRSRC,ZDATE1Z2                                               S01390
     C/SPACE 3                                                            S01390
     C/COPY ZSRSRC,ZDATE2Z2                                               S01390
     C/SPACE 3                                                            S01390
     C/COPY ZSRSRC,ZSAVEZ1                                                S01390
     C/SPACE 3                                                            S01390
     C/COPY ZSRSRC,ZRSTORZ1                                               S01390
      /EJECT                                                              066550
     C/COPY ZSRSRC,ZINTDYZ2                                               066550
      /EJECT                                                              066550
     C/COPY ZSRSRC,ZDATE9Z3                                               066550
     C/SPACE 3                                                            S01390
     C/COPY ZSRSRC,ZDAT10Z2                                               126017
     C/EJECT                                                              126017
**   ZYDY - YEARS IN DAYS CUMULATIVE, FOUR YEAR SPAN
0366073110961461
**   ZMDY - MONTHS IN DAYS CUMULATIVE THROUGH YEAR
000031059090120151181212243273304334365
**   ZMNM - MONTHS SHORT NAMES
JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC
** NRTP/NRDS - EVENT TYPES AND DESCRIPTIONS
LDDEPOSIT
IBINTERIM BAL
OBOPENING BAL
PIPRIN INCRSE
PDPART REPAY
IAINT ADJUST
TXWHT CHARGE
FASER CHG ADJ
FDSERVICE CHG
SCRENEG
MAREPAYMENT
IPINT DUE
CBCLOSING BAL
ROROLLOVER
BFB/FWD
** LONT - LOAN TYPES
IPTICLLNDL
** DEPT - DEPOSIT TYPES
ITTDCDCI
** CPY@   **      OBJECT COPYRIGHT                                        S01390
(c) Misys International Banking Systems Ltd. 2001
** @YD  USED BY SR. ZDATE9 - YEARS, IN DAYS, CUMULATIVE IN 4 YEAR SPAN
00366007310109601461
** @MD  USED BY SR. ZDATE9 - MONTHS IN DAYS CUMULATIVE THROUGH YEAR
00000000310005900090001200015100181002120024300273003040033400365
