      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas UT CBF011 Data Area Layout (Source Parser)')     *
      *****************************************************************
      *                                                               *
      *  Midas - Utilities Module                                     *
      *                                                               *
      *  PF/UTSPSTAT - Data Area Layout (Source Parser Batch Monitor) *
      *                                                               *
      *  (c) Finastra International Limited 2011                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CBF011  *CREATE    Date 04Jul11               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CBF011 - BF Infrastructure: Error Message Handling           *
      *                                                               *
      *****************************************************************
      *
     A          R UTSPSTAT                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2011')
      *
     A            SPSTAT        10          TEXT('CBF011 Source Parser +
     A                                      Batch Monitor')
      *
