      *****************************************************************
/*S*D ***DSPF**********************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas GL GCMS activation deactivation function')       *
      *****************************************************************
      *                                                               *
      *  Midas - GL Module                                            *
      *                                                               *
      ***DSPF/GLJ021DF*-*GCMS Activation Deactivation Function*********
      *  DSPF/XX113021Df - GCMS Activation Deactivation Function      *
      *                                                               *
      ***(c)*Misys*International*Banking*Systems*Ltd.*2007*************
      *  (c) Finastra International Limited 2018                      *
      *                                                               *
      *  Last Amend No. JMI113             Date 22May18               *
      *  Prev Amend No. JMI019  *CREATE    Date 16Feb07               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      * JMI113  - Midas GCMS Interface. Upgrade to FBM 2.1            *
      * JMI019  - Midas GCMS Interface                                *
      *                                                               *
      *****************************************************************
      *
      ** Start of JMI113
     A**********                            REF(MFRFL)
      ** End of JMI113
     A                                      CA03
     A                                      INDARA
     A                                      PRINT(MPRINT)
     A                                      MSGLOC(24)
      *
      ** Start of JMI113
     A**********R GLJ021F1                  TEXT('(c) Misys International +
     A**********                            Banking Systems Ltd. +
     A**********                            2007')
     A          R XX113021F1                TEXT('(c) Finastra Internation+
     A                                      al Limited 2018')
      ** End of JMI113
     A                                      CF05(05 'Refresh')
      *
     A                                      PUTOVR
      *
      ** Start of JMI113
     A************SUSER     R        O  1  2REFFLD(USER)
     A**********                        1 13'GLJ021F1'
     A            SUSER         10A  O  1  2
     A                                  1 13'XX1135F1'
      ** End of JMI113
     A                                  1 25'GCMS Activation Deactivation F-
     A                                      unction'
     A                                      DSPATR(UL HI)
     A                                  1 67'DATE '
      ** Start of JMI113
     A************SRUNA     R        O  1 73REFFLD(RUNA)
      *
     A************SWSID     R        O  2  2REFFLD(JOJOB)
     A            SRUNA          7A  O  1 73
      *
     A            SWSID         10A  O  2  2
      ** End of JMI113
     A                                  2 67'TIME '
     A                                  2 73TIME
     A                                  7  2'Action'
     A                                      DSPATR(HI)
     A                                  7 10'Processing'
     A                                      DSPATR(HI)
     A                                  7 23'Background Job'
     A                                      DSPATR(HI)
     A                                  7 52'Status'
     A                                      DSPATR(HI)
     A                                  8 13'Task'
     A                                      DSPATR(HI)
     A            SACTP          1A  B 11  3
     A N50                                  DSPATR(HI)
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A                                      OVRDTA
     A            SPCTP          3A  O 11 13
     A                                      OVRDTA
     A            SBGTP         28A  O 11 22
     A                                      OVRDTA
     A            SSTTP         21A  O 11 51
     A                                      OVRDTA
      *
     A                                 23  2'S=Start Job, T=Terminate Job, F3=-
     A                                      Exit, F5=Refresh'
      *=========================================================================
     A          R #MSGRCD                   TEXT('Program messages')
     A                                      SFL SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            ##PGM                     SFLPGMQ
      *=========================================================================
     A          R #MSGCTL                   TEXT('Program messages')
     A                                      SFLCTL(#MSGRCD)
     A                                      SFLPAG(01) SFLSIZ(03)
     A                                      OVERLAY PUTOVR
     A                                      SFLINZ SFLDSP SFLDSPCTL
     A
     A  25                                  SFLEND
     A            ##PGM                     SFLPGMQ
