      *****************************************************************
/*S*D****DSPF**********************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas SD ICD Account Balance Pooling')                 *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      ***DSPF/SDJ102DF*-*Midas*SD*ICD Account Pooling******************         JMI108
      *  DSPF/XXJ102DF - Midas SD ICD Account Pooling                 *         JMI108
      *                                                               *
      ***(c)*Misys*International*Banking*Systems*Ltd.*2005*************         JMI108
      *  (c) Finastra International Limited 2018                      *         JMI108
      *                                                               *
      *  Last Amend No. JMI108             Date 31May18               *
      *  Last Amend No. TFJ011  *CREATE    Date 22Jan07               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  JMI108 - Account Balance Pooling. Upgrade to FBM 2.1         *
      *  TFJ011 - Account Balance Pooling.                            *
      *                                                               *
      *****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT(*LIBL/MPRINT)
      *=========================================================================
      ** Start of JMI108
     A********* R #RCDKEY                   TEXT('(c) Misys International +
     A*********                             Banking Systems Ltd. +
     A*********                             2005')
     A          R #RCDKEY                   TEXT('(c) Finastra Internation+
     A                                      al Limited 2018')
      ** End of JMI108
     A                                      SETOF(98 'Force input format')
     A                                      BLINK OVERLAY
     A                                      INDTXT(86 'Enable PUTOVR')
     A  86                                  PUTOVR
      * SETOFFS.................................................................
     A                                      SETOF(99 'Global error flag')
      *.........................................................................
     A            ##USR         10      1  2TEXT('*USER')
     A                                      OVRDTA
     A            ##PGM         10   H      TEXT('*PROGRAM')
      ** Start of JMI108
     A**********                        1 13'SDJ102'
     A                                  1 13'XXJ102'
      ** End of JMI108
     A            ##MRDT         7      1 72TEXT('Midas Run Date')
     A                                      OVRDTA
     A            ##JOB         10      2  2TEXT('*JOB')
     A                                      OVRDTA
     A                                  2 23'Account Pooling ICD'
     A                                      DSPATR(HI)
     A                                      OVRATR
     A N87                              2 43'Maintenance'
     A                                      DSPATR(HI)
     A                                      OVRATR
     A  87                              2 43'Enquiry'
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            ##TME          6  0   2 71TEXT('*TIME')
     A                                      EDTWRD('  :  :  ')
     A                                      OVRDTA
     A*=========================================================================
     A          R #RCDDTL1                  TEXT('Details Account Pooling ICD')
     A                                      SETOF(98 'Force input format')
     A                                      BLINK
     A                                      OVERLAY
     A                                      INDTXT(86 'Enable PUTOVR')
     A  86                                  PUTOVR
     A                                      INDTXT(87 'Protect fields')
     A                                      VLDCMDKEY(88 'Valid command key')
     A                                      CA03(03 'Exit.')
     A N87                                  CA05(05 'Refresh.')
     A                                      CA12(12 'Key screen.')
     A                                      SETOF(29 'Invalid: SPDIR')
     A                                      SETOF(31 'Invalid: SPSIP')
     A                                      SETOF(32 'Invalid: SPSUS')
     A                                      SETOF(33 'Invalid: SPSPS')
     A                                      SETOF(34 'Invalid: SIBRCH')
     A                                      SETOF(35 'Invalid: SIFILE')
     A                                      SETOF(36 'Invalid: SPITM1')
     A                                      SETOF(37 'Invalid: SPITM2')
     A                                      SETOF(38 'Invalid: SPITM3')
     A                                      SETOF(39 'Invalid: SPITM4')
     A                                      SETOF(40 'Invalid: SPITM5')
     A                                      SETOF(41 'Invalid: SPITM6')
     A                                      SETOF(42 'Invalid: SPITM7')
     A                                      SETOF(43 'Invalid: SPITM8')
     A                                      SETOF(44 'Invalid: SPITM9')
     A                                      SETOF(45 'Invalid: SPITM10')
     A                                      SETOF(46 'Invalid: SPITM11')
     A                                      SETOF(47 'Invalid: SPITM12')
     A                                      SETOF(48 'Invalid: SPITM13')
     A                                      SETOF(49 'Invalid: SPITM14')
     A                                      SETOF(50 'Invalid: SPITM15')
     A                                      SETOF(51 'Invalid: SPITM16')
     A                                      SETOF(52 'Invalid: SPITM17')
     A                                      SETOF(53 'Invalid: SPITM18')
     A                                      SETOF(54 'Invalid: SPITM19')
     A                                      SETOF(55 'Invalid: SPITM20')
     A                                      SETOF(56 'Invalid: SOIAB')
     A                                      SETOF(57 'Invalid: SOTCAB')
     A                                      SETOF(58 'Invalid: SOTFAB')
     A                                      SETOF(59 'Invalid: SOTREC')
     A                                      SETOF(60 'Invalid: SOPCAB')
     A                                      SETOF(61 'Invalid: SOPFAB')
     A                                      SETOF(62 'Invalid: SOPREC')
     A                                      SETOF(63 'Invalid: SPOTM1')
     A                                      SETOF(64 'Invalid: SPOTM2')
     A                                      SETOF(65 'Invalid: SPOTM3')
     A                                      SETOF(66 'Invalid: SPOTM4')
     A                                      SETOF(67 'Invalid: SPOTM5')
     A                                      SETOF(68 'Invalid: SPOTM6')
     A                                      SETOF(69 'Invalid: SPOTM7')
     A                                      SETOF(70 'Invalid: SPOTM8')
     A                                      SETOF(71 'Invalid: SPOTM9')
     A                                      SETOF(72 'Invalid: SPOTM10')
     A                                      SETOF(73 'Invalid: SPOTM11')
     A                                      SETOF(74 'Invalid: SPOTM12')
     A                                      SETOF(75 'Invalid: SPOTM13')
     A                                      SETOF(76 'Invalid: SPOTM14')
     A                                      SETOF(77 'Invalid: SPOTM15')
     A                                      SETOF(78 'Invalid: SPOTM16')
     A                                      SETOF(79 'Invalid: SPOTM17')
     A                                      SETOF(80 'Invalid: SPOTM18')
     A                                      SETOF(81 'Invalid: SPOTM19')
     A                                      SETOF(82 'Invalid: SPOTM20')
     A                                      SETOF(83 'Invalid: SJTRNC')
     A                                      SETOF(84 'Invalid: SJDEPT')
     A                                      SETOF(85 'Invalid: SJ1BNO')
     A                                      SETOF(86 'Invalid: SJTRND')
     A*-------------------------------------------------------------------------
     A                                  4  5'Pooling server'
     A            SPSIP         15A  B  4 20TEXT('Pooling server IP address')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A N31N87                               DSPATR(UL)
     A N31                                  DSPATR(HI)
     A                                  4 37'Pooling directory'
     A            SPDIR         20A  B  4 55TEXT('Pooling directory')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A N29N87                               DSPATR(UL)
     A N29                                  DSPATR(HI)
     A                                  5  9'User ID'
     A            SPSUS          7   B  5 18TEXT('User ID')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A N32N87                               DSPATR(UL)
     A N32                                  DSPATR(HI)
     A                                  5 29'Password'
     A            SPSPS          8   B  5 40TEXT('Pooling Server Password')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A N33N87                               DSPATR(UL)
     A N33                                  DSPATR(HI)
     A                                  5 51'Own internal branch code'
     A            SIBRCH         3   B  5 77TEXT('Internal Branch Code')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A N34N87                               DSPATR(UL)
     A N34                                  DSPATR(HI)
     A                                  6  5'FTP Incoming'
     A                                      DSPATR(HI)
     A                                  7  9'Default file name'
     A            SIFILE         7   B  7 31TEXT('FTP Incoming File')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A N35N87                               DSPATR(UL)
     A N35                                  DSPATR(HI)
     A                                  8  9'Intra-day FTP time'
     A            SPITM1         4   B  8 31TEXT('FTP Incoming Time 1')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A N36N87                               DSPATR(UL)
     A N36                                  DSPATR(HI)
     A            SPITM2         4   B  8 36TEXT('FTP Incoming Time 2')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A N37N87                               DSPATR(UL)
     A N37                                  DSPATR(HI)
     A            SPITM3         4   B  8 41TEXT('FTP Incoming Time 3')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A N38N87                               DSPATR(UL)
     A N38                                  DSPATR(HI)
     A            SPITM4         4   B  8 46TEXT('FTP Incoming Time 4')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A N39N87                               DSPATR(UL)
     A N39                                  DSPATR(HI)
     A            SPITM5         4   B  8 51TEXT('FTP Incoming Time 5')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A N40N87                               DSPATR(UL)
     A N40                                  DSPATR(HI)
     A            SPITM6         4   B  8 56TEXT('FTP Incoming Time 6')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A N41N87                               DSPATR(UL)
     A N41                                  DSPATR(HI)
     A            SPITM7         4   B  8 61TEXT('FTP Incoming Time 7')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A N42N87                               DSPATR(UL)
     A N42                                  DSPATR(HI)
     A            SPITM8         4   B  8 66TEXT('FTP Incoming Time 8')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A N43N87                               DSPATR(UL)
     A N43                                  DSPATR(HI)
     A            SPITM9         4   B  8 71TEXT('FTP Incoming Time 9')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A N44N87                               DSPATR(UL)
     A N44                                  DSPATR(HI)
     A            SPITM10        4   B  8 76TEXT('FTP Incoming Time 10')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A N45N87                               DSPATR(UL)
     A N45                                  DSPATR(HI)
     A            SPITM11        4   B  9 31TEXT('FTP Incoming Time 11')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A N46N87                               DSPATR(UL)
     A N46                                  DSPATR(HI)
     A            SPITM12        4   B  9 36TEXT('FTP Incoming Time 12')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A N47N87                               DSPATR(UL)
     A N47                                  DSPATR(HI)
     A            SPITM13        4   B  9 41TEXT('FTP Incoming Time 13')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A N48N87                               DSPATR(UL)
     A N48                                  DSPATR(HI)
     A            SPITM14        4   B  9 46TEXT('FTP Incoming Time 14')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A N49N87                               DSPATR(UL)
     A N49                                  DSPATR(HI)
     A            SPITM15        4   B  9 51TEXT('FTP Incoming Time 15')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A N50N87                               DSPATR(UL)
     A N50                                  DSPATR(HI)
     A            SPITM16        4   B  9 56TEXT('FTP Incoming Time 16')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A N51N87                               DSPATR(UL)
     A N51                                  DSPATR(HI)
     A            SPITM17        4   B  9 61TEXT('FTP Incoming Time 17')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A N52N87                               DSPATR(UL)
     A N52                                  DSPATR(HI)
     A            SPITM18        4   B  9 66TEXT('FTP Incoming Time 18')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A N53N87                               DSPATR(UL)
     A N53                                  DSPATR(HI)
     A            SPITM19        4   B  9 71TEXT('FTP Incoming Time 19')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  54                                  DSPATR(RI)
     A  54                                  DSPATR(PC)
     A N54N87                               DSPATR(UL)
     A N54                                  DSPATR(HI)
     A            SPITM20        4   B  9 76TEXT('FTP Incoming Time 20')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A N55N87                               DSPATR(UL)
     A N55                                  DSPATR(HI)
     A                                 10  5'FTP outgoing'
     A                                      DSPATR(HI)
     A                                 11  9'Default file name'
     A                                 12 11'Today'
     A                                      DSPATR(HI)
     A                                 13 13'Intra-day A/C balance'
     A            SOIAB          7   B 13 36TEXT('FTP Outgoing Today intra -
     A                                             day A/C Bal')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  56                                  DSPATR(RI)
     A  56                                  DSPATR(PC)
     A N56N87                               DSPATR(UL)
     A N56                                  DSPATR(HI)
     A                                 13 49'COB A/C balance'
     A            SOTCAB        10   B 13 66TEXT('FTP Outgoing Today COB A/C-
     A                                             Bal')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(PC)
     A N57N87                               DSPATR(UL)
     A N57                                  DSPATR(HI)
     A                                 14 13'Final I-d A/C balance'
     A            SOTFAB        10   B 14 36TEXT('FTP Outgoing Today Final I-
     A                                             ntra day A/C Bal')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  58                                  DSPATR(RI)
     A  58                                  DSPATR(PC)
     A N58N87                               DSPATR(UL)
     A N58                                  DSPATR(HI)
     A                                 14 49'Reconcile data'
     A            SOTREC        10   B 14 66TEXT('FTP Outgoing Today Reconcil-
     A                                             e Data')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  59                                  DSPATR(RI)
     A  59                                  DSPATR(PC)
     A N59N87                               DSPATR(UL)
     A N59                                  DSPATR(HI)
     A                                 15 11'Previous day'
     A                                      DSPATR(HI)
     A                                 16 13'Final I-d A/C balance'
     A            SOPFAB        10   B 16 36TEXT('FTP Outgoing Prev. Day -
     A                                             Final Intra-day A/C Bal')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A N60N87                               DSPATR(UL)
     A N60                                  DSPATR(HI)
     A                                 16 49'COB A/C balance'
     A            SOPCAB        10   B 16 66TEXT('FTP Outgoing Previous Day -
     A                                             COB A/C Bal')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A N61N87                               DSPATR(UL)
     A N61                                  DSPATR(HI)
     A                                 17 49'Reconcile data'
     A            SOPREC        10   B 17 66TEXT('FTP Outgoing Previous Rec -
     A                                             cile Data')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A N62N87                               DSPATR(UL)
     A N62                                  DSPATR(HI)
     A                                 18  9'Intra-day FTP time'
     A            SPOTM1         4   B 18 31TEXT('FTP Outgoing Time 1')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A N63N87                               DSPATR(UL)
     A N63                                  DSPATR(HI)
     A            SPOTM2         4   B 18 36TEXT('FTP Outgoing Time 2')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A N64N87                               DSPATR(UL)
     A N64                                  DSPATR(HI)
     A            SPOTM3         4   B 18 41TEXT('FTP Outgoing Time 3')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A N65N87                               DSPATR(UL)
     A N65                                  DSPATR(HI)
     A            SPOTM4         4   B 18 46TEXT('FTP Outgoing Time 4')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A N66N87                               DSPATR(UL)
     A N66                                  DSPATR(HI)
     A            SPOTM5         4   B 18 51TEXT('FTP Outgoing Time 5')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  67                                  DSPATR(RI)
     A  67                                  DSPATR(PC)
     A N67N87                               DSPATR(UL)
     A N67                                  DSPATR(HI)
     A            SPOTM6         4   B 18 56TEXT('FTP Outgoing Time 6')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  68                                  DSPATR(RI)
     A  68                                  DSPATR(PC)
     A N68N87                               DSPATR(UL)
     A N68                                  DSPATR(HI)
     A            SPOTM7         4   B 18 61TEXT('FTP Outgoing Time 7')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  69                                  DSPATR(RI)
     A  69                                  DSPATR(PC)
     A N69N87                               DSPATR(UL)
     A N69                                  DSPATR(HI)
     A            SPOTM8         4   B 18 66TEXT('FTP Outgoing Time 8')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  70                                  DSPATR(RI)
     A  70                                  DSPATR(PC)
     A N70N87                               DSPATR(UL)
     A N70                                  DSPATR(HI)
     A            SPOTM9         4   B 18 71TEXT('FTP Outgoing Time 9')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  71                                  DSPATR(RI)
     A  71                                  DSPATR(PC)
     A N71N87                               DSPATR(UL)
     A N71                                  DSPATR(HI)
     A            SPOTM10        4   B 18 76TEXT('FTP Outgoing Time 10')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  72                                  DSPATR(RI)
     A  72                                  DSPATR(PC)
     A N72N87                               DSPATR(UL)
     A N72                                  DSPATR(HI)
     A            SPOTM11        4   B 19 31TEXT('FTP Outgoing Time 11')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  73                                  DSPATR(RI)
     A  73                                  DSPATR(PC)
     A N73N87                               DSPATR(UL)
     A N73                                  DSPATR(HI)
     A            SPOTM12        4   B 19 36TEXT('FTP Outgoing Time 12')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  74                                  DSPATR(RI)
     A  74                                  DSPATR(PC)
     A N74N87                               DSPATR(UL)
     A N74                                  DSPATR(HI)
     A            SPOTM13        4   B 19 41TEXT('FTP Outgoing Time 13')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  75                                  DSPATR(RI)
     A  75                                  DSPATR(PC)
     A N75N87                               DSPATR(UL)
     A N75                                  DSPATR(HI)
     A            SPOTM14        4   B 19 46TEXT('FTP Outgoing Time 14')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  76                                  DSPATR(RI)
     A  76                                  DSPATR(PC)
     A N76N87                               DSPATR(UL)
     A N76                                  DSPATR(HI)
     A            SPOTM15        4   B 19 51TEXT('FTP Outgoing Time 15')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  77                                  DSPATR(RI)
     A  77                                  DSPATR(PC)
     A N77N87                               DSPATR(UL)
     A N77                                  DSPATR(HI)
     A            SPOTM16        4   B 19 56TEXT('FTP Outgoing Time 16')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  78                                  DSPATR(RI)
     A  78                                  DSPATR(PC)
     A N78N87                               DSPATR(UL)
     A N78                                  DSPATR(HI)
     A            SPOTM17        4   B 19 61TEXT('FTP Outgoing Time 17')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  79                                  DSPATR(RI)
     A  79                                  DSPATR(PC)
     A N79N87                               DSPATR(UL)
     A N79                                  DSPATR(HI)
     A            SPOTM18        4   B 19 66TEXT('FTP Outgoing Time 18')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  80                                  DSPATR(RI)
     A  80                                  DSPATR(PC)
     A N80N87                               DSPATR(UL)
     A N80                                  DSPATR(HI)
     A            SPOTM19        4   B 19 71TEXT('FTP Outgoing Time 19')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  81                                  DSPATR(RI)
     A  81                                  DSPATR(PC)
     A N81N87                               DSPATR(UL)
     A N81                                  DSPATR(HI)
     A            SPOTM20        4   B 19 76TEXT('FTP Outgoing Time 20')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  82                                  DSPATR(RI)
     A  82                                  DSPATR(PC)
     A N82N87                               DSPATR(UL)
     A N82                                  DSPATR(HI)
     A                                 20  5'Journal Entries Defaults'
     A                                 22  9'Transaction Type Cr'
     A            SJTRNC         5   B 22 29TEXT('Journal Entry Transaction -
     A                                             type')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  83                                  DSPATR(RI)
     A  83                                  DSPATR(PC)
     A N83N87                               DSPATR(UL)
     A N83                                  DSPATR(HI)
     A                                 21  9'Transaction Type Dr'
     A            SJTRND         5   B 21 29TEXT('Journal Entry Transaction -
     A                                             type')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  86                                  DSPATR(RI)
     A  86                                  DSPATR(PC)
     A N86N87                               DSPATR(UL)
     A N86                                  DSPATR(HI)
     A                                 22 36'Department Code'
     A            SJDEPT         3   B 22 52TEXT('Journal Entry Transaction -
     A                                             type')
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  84                                  DSPATR(RI)
     A  84                                  DSPATR(PC)
     A N84N87                               DSPATR(UL)
     A N84                                  DSPATR(HI)
     A                                 22 57'First Batch No.'
     A            SJ1BNO         3   B 22 73
     A                                      OVRDTA
     A  87                                  DSPATR(PR)
     A  85                                  DSPATR(RI)
     A  85                                  DSPATR(PC)
     A N85N87                               DSPATR(UL)
     A N85                                  DSPATR(HI)
      *
      *=========================================================================
     A          R #CMDTXT1                  TEXT('Command keys')
     A                                      OVERLAY PUTOVR
     A                                 24  2'F3=Main Menu'
     A N87                             24 17'F5=Refresh'
     A                                 24 30'F12=Previous'
      *=========================================================================
     A          R #MSGRCD                   TEXT('Program messages')
     A                                      SFL SFLMSGRCD(23)
     A            MSGKEY                    SFLMSGKEY
     A            ##PGM                     SFLPGMQ
      *=========================================================================
     A          R #MSGCTL                   TEXT('Program messages')
     A                                      SFLCTL(#MSGRCD)
     A                                      SFLPAG(01) SFLSIZ(55)
     A  86                                  OVERLAY PUTOVR
     A                                      SFLINZ SFLDSP SFLDSPCTL
     A  25
     AON25                                  SFLEND
     A            ##PGM                     SFLPGMQ
