      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Account Type Table Extract Prompt Screen')             *                       LUC109
     A*****************************************************************
     A*                                                               *
     A*  Midas - Interface to Head Office Reporting                   *
     A*                                                               *
     A********SDM035DF*-*Account*Type*Table*Extract*Prompt*Screen******                       LUC109
      *       XXSD0035DF - Account Type Table Extract Prompt Screen   *                       LUC109
     A*                                                               *
     A***(C)*COPYRIGHT*MKI*LIMITED*1989,*1994**************************                       LUC109
      *  (c) Misys International Banking Systems Ltd. 2016            *                       LUC109
     A*                                                               *
      *  Last Amend No. LUC109             Date 20Sep16               *
      *  Prev Amend No. MMI043 *Create     Date 16Mar99               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  LUC109 - HO Reporting (Upgrade to FB Midas 2.1)              *
     A*  MMI043 - Interface to Head Office Reporting                  *
     A*                                                               *
     A*****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT(MPRINT)
     A*
     A                                      CF03(03)
     A*
      ** Start of LUC109
     A**********R SDM035R                   TEXT('(C) COPYRIGHT +                             LUC109
     A**********                            MKI +                                             LUC109
     A**********                            INTL.LTD 1999')                                   LUC109
     A          R XXSD0035R                 TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2016')
      ** End of LUC109
     A*
     A            USRID         10A  O 01 02
      ** Start of LUC109
     A**********                       01 13'SDCM035'                                         LUC109
     A                                 01 13'XXCSD0035'
      ** End of LUC109
     A            SWSID         10   O 02 02
     A                                  1 25'Account Codes Table Extract'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A            SRUNA          7A  O 01 72
     A                                 02 71TIME
     A*
     A                                 10 27'Press Enter to Continue'
     A*
     A                                 23  2'F3=Exit'
