      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas MS Incoming Swift Messages')
      *****************************************************************
      *                                                               *
      *  Midas - SWIFT II                                             *
      *                                                               *
      *  LF/MSIXI2LH - Incoming Swift Messages                        *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4.01.03 ----------------------------------------*
      *                 213125             Date 07Jan03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *                 CTI003  *CREATE    Date 10Oct00               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *   213125 -  Select all messages in the 400 and 700 series.    *
      *   CTI003 -  Midas/TI Interface Close of Business changes      *
      *                                                               *
      *****************************************************************
     A          R MSIXI2D0                  PFILE(MSIXI2PD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A          K TRNO
     A          S MTPY                      RANGE('400' '499')                              /213125/
     A          S MTPY                      RANGE('700' '799')                              /213125/
     A**********S MTPY                      COMP(EQ '700')                                  /213125/
     A**********S MTPY                      COMP(EQ '701')                                  /213125/
     A**********S MTPY                      COMP(EQ '705')                                  /213125/
     A**********S MTPY                      COMP(EQ '707')                                  /213125/
     A**********S MTPY                      COMP(EQ '710')                                  /213125/
     A**********S MTPY                      COMP(EQ '711')                                  /213125/
     A**********S MTPY                      COMP(EQ '740')                                  /213125/
     A**********S MTPY                      COMP(EQ '742')                                  /213125/
     A**********S MTPY                      COMP(EQ '795')                                  /213125/
     A**********S MTPY                      COMP(EQ '796')                                  /213125/
     A**********S MTPY                      COMP(EQ '799')                                  /213125/
     A**********S MTPY                      COMP(EQ '400')                                  /213125/
