      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas MS Midas MAPID session details')
      *****************************************************************
      *                                                               *
      *  Midas SWIFT Direct Link : Midas/CAS interface                *
      *                                                               *
      *  PF/MSMAPIL0 - Midas MAPID session details                    *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CSW008 *CREATE     Date 22JUL96               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSW008 - Midas/CAS interface                                 *
      *                                                               *
      *****************************************************************
     A          R MSMAPID0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A                                      PFILE(MSMAPIPD)
      *
      ** Key field
     A          K MCMAPI
      *
      ** Exclude deleted records
     A          O MCAACT                    COMP(EQ 'D')
