      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas MS ACKs/NAKs by date,time,MOR')
     A*****************************************************************
     A*                                                               *
     A*  Midas - SWIFT DIRECT LINK
     A*                                                               *
     A*   PF/MSMSI2LH - ACKS/NAKS BY DATE, TIME & MOR                 *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. 124673             Date 04Jun98               *
      *                 S01435             Date 09Sep93               *
     A*                  E29837            DATE 03DEC91               *
     A*                  S01310            DATE 06DEC90               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     A*   124673 - Add Century field to keyed fields list.            *
     A*   S01435 - Incoming Message Management                        *
     A*   E29837 - RECOMPILE FOR CHANGE TO MSMSI2PD                   *
     A*   S01310 - SWIFT RATIONALISATION                              *
     A*                                                               *
     A*****************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A          R MSMSI2D0                  PFILE(MSMSI2PD)
      *                                                                 /S01310/
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *                                                                 /S01310/
      *                                              Begin /124673/
     A          K MODEC
      *                                              End   /124673/
     A          K MODE
     A          K MOTM
     A          K MOR
     A          O ACNK                      COMP(EQ ' ')
     A* S01435 Start
     A          O MSPF                      COMP(EQ 'Y')
     A* S01435 End
