      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas Global Daily Historic Spot Rates')
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing                                    *
      *                                                               *
      *  PRTF/GO002438AU - Midas Global Daily Historic Spot Rates     *
      *                    - file control                             *
      *                                                               *
      *  (c) Finastra International Limited 2005                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CAS014  *CREATE    Date 22Aug05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CAS014 - IAS21 The Effects of Changes in Foreign Exchange    *
      *           Rates                                               *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
      **********************************
      ***  Report Header Record Format *
      **********************************
      *
     A          R HEADAU
     A                                      TEXT('(c) Finastra International -
     A                                      Limited 2005')
      *
     A                                      SKIPB(1)
     A                                      SPACEA(1)
     A                                     6'REFERENCE GO002438AU'
     A            BJURPT    R             37REFFLD(URPT)
     A                                   101'DATE'
     A            BJMRDT    R            106REFFLD(MRDT)
     A                                   119'PAGE'
     A                                   124PAGNBR
     A                                      EDTCDE(Z)
     A                                   101'TIME'
     A                                      SPACEB(1)
     A                                   106TIME
     A                                      EDTWRD('  :  :  ')
     A                                    43'DAILY GLOBAL HISTORIC SPOT RATES --
     A                                       AUDIT'
     A                                      SPACEB(2)
      **********************************
      ***  Report Detail Record Format *
      **********************************
      *
     A          R DTAILA1
     A                                      SPACEB(1)
     A                                      SPACEA(1)
     A                                    69'Calculated'
     A                                    27'Total No. of Records Before Update-
     A                                       :'
     A                                      SPACEB(002)
     A            RRNO           6S 0O    71
     A                                      EDTCDE(4)
     A                                    27'Total No. of Records Written :'
     A                                      SPACEB(2)
     A            RADD           6S 0O    71
     A                                      EDTCDE(4)
     A                                    27'Total No. of Records in File :'
     A                                      SPACEB(2)
     A            RTOT           6S 0O    71
     A                                      EDTCDE(4)
      *
      *******************************
      ***  No Details Record Format *
      *******************************
      *
     A          R DTAILA2
     A                                      SPACEB(1)
     A                                      SPACEA(2)
     A                                    47'*** NO DETAILS TO REPORT ***'
     A                                      SPACEB(3)
      *
      ***********************************
      ***  Database Error Record Format *
      ***********************************
      *
     A          R DTAILA3
     A                                      SPACEB(1)
     A                                    32'**********************************-
     A                                      ***********************************'
     A                                      SPACEB(3)
     A                                    32'*'
     A                                      SPACEB(1)
     A                                   100'*'
     A                                    32'*'
     A                                      SPACEB(1)
     A                                   100'*'
     A                                    32'*    FILE NAME    '''
     A                                      SPACEB(1)
     A            DBFILE         8A       51
     A                                    59''''
     A                                   100'*'
     A                                    32'*    KEY          '''
     A                                      SPACEB(1)
     A            DBKEY         29        51
     A                                    80'''                   *'
     A                                    32'*    PROGRAM NAME '''
     A                                      SPACEB(1)
     A            DBPGM         10A       51
     A                                    61''''
     A                                   100'*'
     A                                    32'*    AT           '''
     A                                      SPACEB(1)
     A            DBASE          3  0     51
     A                                    54
     A                                      ''''
     A                                   100
     A                                      '*'
     A                                    32
     A                                      '*'
     A                                      SPACEB(1)
     A                                   100'*'
     A                                    32'*'
     A                                      SPACEB(1)
     A                                   100'*'
     A                                    32'**********************************-
     A                                      ***********************************'
     A                                      SPACEB(1)
      *
      **********************************
      ***  End Report Record Format *
      **********************************
      *
     A          R ENDREAU
     A                                      SPACEB(1)
     A                                    53'*** END OF REPORT ***'
     A                                      SPACEB(1)
