      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas OF Accounting Rules Submit JRNE - DEBUG')        *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger module                                *
      *                                                               *
      ***GL000587P1*-*Midas*OF*Accounting*Rules*Submit*JRNE*-*HTTP*****                     MD029739
      *  DI000587P1 - Midas OF Accounting Rules Submit JRNE - HTTP    *                     MD029739
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2013            *
      *                                                               *
      *  Last Amend No. MD029739 *RENAMED* Date 15Aug14               *
      *  Prev Amend No. CGL135B  *CREATE   Date 11Oct13               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGL135B - Accounting Rules Process                           *
      *                                                               *
      *****************************************************************
      *
     A          R HEADP1                    TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2013')
      *
     A                                      SKIPB(3)
     A                                     6'Reference GL000587HP1'
     A            RURPT         53        37
     A                                   101'Date'
     A                                   106DATE
     A                                      EDTWRD('  /  /  ')
     A                                   119'Page'
     A                                   124PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(1)
      *
     A                                   101'Time'
     A                                   106TIME
     A                                      EDTWRD('  :  :  ')
     A                                      SPACEA(1)
      *
     A                                    42'Account Rules Posting Details +
     A                                       - Debug Details'
     A                                      SPACEA(1)
      *
     A                                    42'-----------------------------+
     A                                      ----------------'
     A                                      SPACEA(3)
      *
     A          R DETLP1                    TEXT('Debug details')
     A                                      SPACEA(1)
     A            RDETAIL      100A        5
      *
     A          R TRLRP1
     A                                    51'***  End of report  ***'
     A                                      SPACEB(3)
      *
