      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MX Foreign Exchange Forward Rates')
      *****************************************************************
      *                                                               *
      *  Midas - Meridian Export Module                               *
      *                                                               *
      *  PF/MXFXFRPD - Foreign Exchange Forward Rates                 *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *  Prev Amend No. CMX005             Date 15Jan01               *
      *                 CMX004  *CREATE    Date 30Nov00               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CMX005 - Meridian Export Enhancements - Phase 4              *
      *  CMX004 - Meridian Export Enhancements - Phase 3              *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R MXFXFRP0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            FRCCY          3A
     A                                      TEXT('Currency')
                                            COLHDG('Ccy')
     A*                                                           /*Start CMX005*/
     A            FRDDAT         5P 0
     A                                      TEXT('Deal Date')
                                            COLHDG('Deal' 'Date')
     A*                                                           /* End  CMX005*/
     A            FRVDAT         5P 0
     A                                      TEXT('Value Date')
                                            COLHDG('Value' 'Date')
     A            FRAMTC        15S 0
     A                                      TEXT('Amount For Conversion')
                                            COLHDG('Amnt' 'For' 'Conv')
     A            FRMDIN         1A
     A                                      TEXT('Currency Mult/Div Ind')
                                            COLHDG('Ccy' 'M/D' 'Ind')
     A            FRCDP          1S 0
     A                                      TEXT('Currency Dec. Places')
                                            COLHDG('Ccy' 'D.P.')
     A            FRNDAT         5S 0
     A                                      TEXT('Near Date')
                                            COLHDG('Near' 'Date')
     A            FRNRAT        13S 8
     A                                      TEXT('Near Forward Rate')
                                            COLHDG('Near' 'Fwd' 'Rate')
     A            FRFDAT         5S 0
     A                                      TEXT('Far Date')
                                            COLHDG('Far' 'Date')
     A            FRFRAT        13S 8
     A                                      TEXT('Far Forward Rate')
                                            COLHDG('Far' 'Fwd' 'Rate')
     A            FRCRAT        13S 8
     A                                      TEXT('Conversion Rate')
                                            COLHDG('Conv' 'Rate')
     A            FRBCYE        15S 0
     A                                      TEXT('Base Currency Equivalent')
                                            COLHDG('Base' 'Ccy' 'Equiv')
     A*                                                                /*Start CMX005*/
     A            FRFWDD         1A
     A                                      TEXT('Forward Deal -DealCcy Y N')
                                            COLHDG('Fwd' 'Dl' 'Deal')
     A            FRFWDB         1A
     A                                      TEXT('Forward Deal -BaseCcy Y N')
                                            COLHDG('Fwd' 'Dl' 'Base')
     A            FRFWDL         1A
     A                                      TEXT('Forward Deal -LocalCcy Y N')
                                            COLHDG('Fwd' 'Dl' 'Local')
     A*                                                                /* End  CMX005*/
