/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas BoE Loans Extract - Valid Loans Report')         *
      *****************************************************************
      *                                                               *
      *  Midas - Bank of England                                      *
      *                                                               *
      *  BY2030P1 - Loans Extract/Validation - Valid Loans Report     *
      *                                                               *
      *  (C) Copyright Midas Kapiti International Ltd 1997            *
      *                                                               *
      *  Last Amend No. BUG7606            Date 03Jun15               *
      *  Prev Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 LLN012  *CREATE    Date 30Sep99               *
      *                 nnnnnn             Date ddmmmyy               *
      *                                                               *
      *---------------------------------------------------------------*
      *  Amendment Details                                            *
      *                                                               *
      *  BUG7606 - Summary paging incorrect                           *
      *  CLE148 - Alpha Loan Reference                                *
      *  LLN012 - BoE Liquidity Reporting Patch B.                    *
      *                                                               *
      *****************************************************************
      *
     A          R BY2030H1                  TEXT('(C) Copyright +
     A                                      Midas Kapiti International+
     A                                       Limited 1997')
     A                                      SKIPB(03)
     A                                     1'Reference BY2030P1'
     A            BJURPT        53A       44
     A                                   105'Date'
     A            BJMRDT         7A      110
     A                                   121'Page'
     A            PAGE1          4  0    126
     A                                      EDTCDE(Z)
     A                                      SPACEA(2)
      *
     A  21                                44'Loan Extract '
     A N21                                41'Loan Validation '
     A                                    57'As At '
     A            L#RPDA         7A       63
     A                                    70' - Valid Loans Report'
     A                                      SPACEA( 1)
     A  21                                44'-------------'
     A N21                                41'----------------'
     A                                    57'------'
     A                                    63'-------'
     A                                    70'---------------------'
     A                                      SPACEA(2)
      *
     A  20                                 1'Branch:'
     A  20        L#BRCD         3A       10
     A  20        L#BRNM        30A       14
     A  20                                  SPACEA(2)
      *
      ** Start of change for LLN012                                                           LLN012
     A**********                          16'Loan'                                            LLN012
     A**********                          23'Loan'                                            LLN012
     A**********                          32'Value'                                           LLN012
     A**********                          42'Maturity'                                        LLN012
     A**********                          52'Cust'                                            LLN012
     A**********                          57'Risk'                                            LLN012
     A**********                          64'Ind.'                                            LLN012
     A**********                          70'Inst'                                            LLN012
     A**********                         114'Sterling'                                        LLN012
     A**********                         126'Product'                                         LLN012
      **********                                                                              LLN012
     A                                    15'Loan'
     A                                    22'Loan'
     A                                    29'Value'
     A                                    36'Maturity'
     A                                    46'Cust'
     A                                    51'Risk'
     A                                    57'Ind.'
     A                                    62'Inst'
     A                                   102'Sterling'
     A                                   116'Product'
      ** End of change for LLN012
     A                                      SPACEA( 1)
      *
     A                                     1'Customer'
      ** Start of change for LLN012
     A***********                         16'Number'                                          LLN012
     A***********                         23'Type'                                            LLN012
     A***********                         33'Date'                                            LLN012
     A***********                         44'Date'                                            LLN012
     A***********                         52'Cnty'                                            LLN012
     A***********                         57'Cnty'                                            LLN012
     A***********                         64'Code'                                            LLN012
     A***********                         70'Code'                                            LLN012
     A***********                         77'Ccy'                                             LLN012
     A***********                         93'Amount'                                          LLN012
     A***********                        112'Equivalent'                                      LLN012
     A***********                        127'Code'                                            LLN012
     A                                    15'Number'
     A                                    22'Type'
     A                                    30'Date'
     A                                    38'Date'
     A                                    46'Cnty'
     A                                    51'Cnty'
     A                                    57'Code'
     A                                    62'Code'
     A                                    69'Ccy'
     A                                    80'Amount'
     A                                   100'Equivalent'
     A                                   117'Code'
     A                                   124'BT'
     A                                   129'LR'
      ** End of change for LLN012
     A                                      SPACEA(1)
      *
      *
      *  Details
     A          R BY2030D1                  TEXT('(C) Copyright +
     A                                      Midas Kapiti International+
     A                                       Limited 1997')
     A  30        L#CNUM         6A        1SPACEB(1)
     A  30        L#CRNM        20A        8SPACEA(2)
      ** Start of change for LLN012
     A**********  L#LNRF         6S 0     16                                                  LLN012
     A**********  L#LTYP         2A       23                                                  LLN012
     A**********                          25'-'                                               LLN012
     A**********  L#SUTP         2A       26                                                  LLN012
     A**********  L#VDAT         7A       31                                                  LLN012
     A**********  L#MDAT         7A       42                                                  LLN012
     A**********  L#LISO         2A       53                                                  LLN012
     A**********  L#RISO         2A       58                                                  LLN012
     A**********  L#LIND         3A       64                                                  LLN012
     A**********  L#LINS         2A       71                                                  LLN012
     A**********  L#CYCD         3A       77                                                  LLN012
     A**********  L#CUAS        17A       82                                                  LLN012
     A**********  L#SGAM        17A      105                                                  LLN012
     A**********  L#PCOD         4S 0    127SPACEA(1)                                         LLN012
     A**********                                                                              LLN012
      **Start of change CLE148
     A**********  L#LNRF         6S 0     15                                                  CLE148
     A            L#LNRF         6A       15
      **End of change CLE148
     A            L#LTYP         2A       22
     A                                    24'-'
     A            L#SUTP         2A       25
     A            L#VDAT         7A       29
     A            L#MDAT         7A       37
     A            L#LISO         2A       47
     A            L#RISO         2A       52
     A            L#LIND         3A       57
     A            L#LINS         2A       63
     A            L#CYCD         3A       69
     A            L#CUAS        17A       73
     A            L#SGAM        17A       93
     A            L#PCOD         4S 0    117
     A            L#BTEX         1A      125
     A            L#LREX         1A      130
     A                                      SPACEA(1)
      ** End of change for LLN012
     A
      *
      *  Invalid extract details
     A  41                                 2'No Extract Criteria'
     A                                      SPACEA(1)
      *
      *
     A          R BY2030E1                  TEXT('(C) Copyright +
     A                                      Midas Kapiti International+
     A                                       Limited 1997')
     A                                      SPACEB(3)
     A                                    50'***  No Details To Report  ***'
      *
      *
     A          R BY2030R1                  TEXT('(C) Copyright +
     A                                      Midas Kapiti International+
     A                                       Limited 1997')
     A                                      SKIPB(3)
     A                                     6'Reference BY2030P1'
     A            BJURPT        53A       44
     A                                   105'Date'
     A            BJMRDT         7A      110
     A                                   121'Page'
      * Start of change BUG7606
     A**********  PAGE           4  0    126                                                 BUG7606
     A            PAGE1          4  0    126
      * End of change BUG7606
     A                                      EDTCDE(4)
     A                                      SPACEA( 2)
      *
     A                                    44'Loan Extract As At '
     A            L#RPDA         7A       63
     A                                    70' - Currency Summary'
     A                                      SPACEA( 1)
     A                                    44'-------------------'
     A                                    63'-------'
     A                                    70'-------------------'
     A                                      SPACEA( 2)
      *
      *
     A  20                                 1'Branch:'
     A  20        L#BRCD         3A       10
     A  20        L#BRNM        30A       14
     A  20                                  SPACEA(2)
      *
     A                                     2'Currency'
     A                                    14'Currency'
     A                                    31'Total Assets'
     A                                    55'Total Assets'
     A                                    81'Total Liabilities'
     A                                   105'Total Liabilities'
     A                                      SPACEA( 1)
     A                                     4'Code'
     A                                    16'Name'
     A                                    32'(Currency)'
     A                                    52'(Sterling Equivalent)'
     A                                    84'(Currency)'
     A                                   103'(Sterling Equivalent)'
     A                                      SPACEA( 1)
      *
     A          R BY2030S1                  TEXT('(C) Copyright +
     A                                      Midas Kapiti International+
     A                                       Limited 1997')
     A                                      SPACEB( 1)
     A            L#CYCD         3A        4TEXT('Currency')
     A            L#CYNM        14A       12TEXT('Currency Name')
     A            L#TLAC        17A       29TEXT('Total Assets - Currency')
     A            L#TLAS        17A       52TEXT('Total Assets - Sterling')
     A            L#TLLC        17A       80TEXT('Total Liabilities - Currency')
     A            L#TLLS        17A      103TEXT('Total Liabilities - Sterling')
      *
      *
     A          R BY2030T1                  TEXT('(C) Copyright +
     A                                      Midas Kapiti International+
     A                                       Limited 1997')
     A                                      SPACEB(3)
     A                                     3'Total'
     A            L#TOTA        21A       48TEXT('Total Assets - Sterling')
     A            L#TOTL        21A       99TEXT('Total Liabilities - Sterling')
      *
      *
     A          R BY2030Z1                  TEXT('(C) Copyright +
     A                                      Midas Kapiti International+
     A                                       Limited 1997')
     A                                      SPACEB(3)
     A                                    53'***  End of Report  ***'
      *
