/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL Accounts Postings merge physical details')    *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  PF/GLACPDPD - GL Midas Accounts Postings Merge Driver File   *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2012            *
      *                                                               *
      *  Last Amend No. CGL120  *CREATE    Date 06Aug12               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  CGL120 - GL COB Components Task Split                        *
      *                                                               *
      *****************************************************************
     A          R GLACPDPF                  TEXT('(c) Misys Internatio+
     A                                      nal Banking Systems Ltd. +
     A                                      2012')
     A            MBBOF         10
     A            MBBOLF        10
     A            MBBOR         10P 0
