      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL GLACNTQD Extract Index for CER049')           *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  PF/GLACIXPD - GL GLACNTQD Extract Index for CER049           *
      *                                                               *
      *  (c) Finastra International Limited 2016                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. MD040278 *CREATE   Date 18Aug16               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  MD040278 - Stamp Tax A/C Keys (GLC008131) is not task split. *
      *             Complete rework of the component to allow task    *
      *             split.                                            *
      *                                                               *
      *****************************************************************
     A          R GLACIXF                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2016')
     A            GLFRRN        10P 0       TEXT('From RRN Number')
     A                                      COLHDG('From' 'RRN' +
     A                                      'Number')
     A            GLTRRN        10P 0       TEXT('To RRN Number')
     A                                      COLHDG('To' 'RRN' 'Number')
