      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL A/C Historic Posting Purge Master File')      *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger                                       *
      *                                                               *
      *  GLACHMPD - Midas GL A/C Historic Posting Purge Master File   *
      *                                                               *
      *  (c) Finastra International Limited 2012                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CGL127AY *CREATE   Date 06Aug12               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL127AY - COB Restructure - GL COB Optimisation Phase 1     *
      *                                                               *
      *****************************************************************
      *
     A          R GLACHMR0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2012')
      *
     A            ACOD          10S 0       TEXT('Account Code')
     A                                      COLHDG('Account Code')
     A            NOHP          15S 0       TEXT('Number of Historic Postings')
     A                                      COLHDG('Number of Historic ' +
     A                                         'Postings')
