      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL API Account Other Details Definition File')   *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger ILE Module                            *
      *                                                               *
      *  PF/GLAMODPD - API Account Other Details                      *
      *              - Fifth screen                                   *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *  Last Amend No. CER059             Date 19Jul10               *
      *  Prev Amend No. BUG24157           Date 04Jun09               *
      *                 CER047             Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CLE025             Date 20Oct03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CAP035  *CREATE    Date 01Apr99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  BUG24157 - AMAD KWG field does not default to CUAP KWG       *
      *           field when field is set to Y                        *
      *  CER047 - German Features LF037-00 Reporting §24c KWG         *
      *  CLE025 - Credit Lines                                        *
      *  CAP035 - Midas/ToF interface                                 *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R GLAMODD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
      ** Message contents
      *
      ** Minimum Balance
     A            DDMINB        12A         TEXT('Minimum Balance')
      *
      ** BRT Category
     A            DDBRTCA        1A         TEXT('BRT Category')
      *
      ** Facility Type
     A            DDFACT         3A         TEXT('Facility Type')
      *
      ** Facility Number
     A            DDFCNO         2A         TEXT('Facility Number')
      *
      ** Encashment Facility
     A            DDEFAC         2A         TEXT('Encashment Facility')
      *
      ** Inactive Account Y/N
     A            DDINAI         1A         TEXT('Inactive Account Y/N')
      *
      ** Bankrupt/liquidated Y/N
     A            DDBRLI         1A         TEXT('Bankrupt/liquidated Y/N')
      *
      ** Bad Debt Y/N
     A            DDBADI         1A         TEXT('Bad Debt Y/N')
      *
      ** Print Transaction Advice Y/N
     A            DDPTRA         1A         TEXT('Print Trans. Advice Y/N')
      *
      ** Print Rate Change Advice Y/N
     A            DDPRCH         1A         TEXT('Prn Rate Chg Advice Y/N')
      *
      ** Passbooks Used on Savings A/c Y/N
     A            DDPBKU         1A         TEXT('Passbooks Used on A/c Y/N')
      *
      ** Savings A/c Password
     A            DDPSWD        15A         TEXT('Savings A/c Password')
      *
      **Start of change CLE025
     A            DDFCCU        10          TEXT('Facility Customer')
     A                                      COLHDG('Facility Customer')
      **End of change CLE025
      **Start of change BUG24157
      **Start*of change CER047                                                              BUG24157
     A            DDK24C         1A         TEXT('REDUNDANT')                               BUG24157
     A                                      COLHDG('REDUNDANT')                             BUG24157
      **End*of*change CER047                                                                BUG24157
      **End of change BUG24157
