      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL APOUTPUTPD Batch Headers')                    *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  PF/GLBTCHPD - APOUTPUTPD Batch Headers                       *
      *                                                               *
      *  (c) Finastra International Limited 2022                      *
      *                                                               *
      *  Last Amend No. MD059435 *CREATE   Date 16Feb22               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD059435 - STP Batch entered Midas as held with an error     *
      *             in the header record                              *
      *                                                               *
      *****************************************************************
     A          R GLBTCHD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2022')
      *
     A            DDBCDA         3          TEXT('Branch Code')
     A                                      COLHDG('Brch' 'Code')
     A            DDDPCD         3          TEXT('Dept Code')
     A                                      COLHDG('Dept' 'Code')
     A            DDMBRB         1          TEXT('Multiple Branch Batch')
     A                                      COLHDG('Multiple' 'Branch Batch')
     A            DDBDES        30          TEXT('Batch Description')
     A                                      COLHDG('Batch' 'Description')
     A            DDFMAM        23          TEXT('Batch Total')
     A                                      COLHDG('Batch' 'Total')
     A            DDNOIS         3          TEXT('No. of Items')
     A                                      COLHDG('No. Of' 'Items')
     A            DDBHAI         1          TEXT('Batch Held/Accepted Ind.')
     A                                      COLHDG('Batch Held/Acc' 'Ind.')
     A            DDBTNB         3          TEXT('Batch Number')
     A                                      COLHDG('Batch Number')
     A            DDINOV         1          TEXT('Batch In Use Override')
     A                                      COLHDG('Batch' 'in use' 'Ovr')
     A            DDMEAB         1          TEXT('Month end Adj. Batch')
     A                                      COLHDG('Month end Adj. Batch')
     A            DDACTN         1          TEXT('Action Code')
     A                                      COLHDG('Action Code')
     A            DDHICC        23          TEXT('Hash Integer Calc')
     A                                      COLHDG('Hash Integer Calc')
     A            DDHINC         3          TEXT('Hash Item No. Calc')
     A                                      COLHDG('Hash Item No. Calc')
     A            DDFOID        20          TEXT('Front Office ID')
     A                                      COLHDG('Front' 'Office' 'ID')
     A          K DDFOID
