      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL API Error inds for A/C Debit Inter. Dtls')
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger ILE Module                            *
      *                                                               *
      *  PF/GLEAMCOPD - API Error Inds. for Account Debit Interest    *
      *                 Details - Fourth screen                       *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      *  Prev Amend No. CDE002             Date 01Feb00               *
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CAP035  *CREATE    Date 01Apr99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CDE002 - CCRM Revenue Analysis - Addition of Margin Int. Flds*
      *  CAP035 - Midas/ToF Interface                                 *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R GLEAMCOD0                 TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
      ** Highest Overdraft Commission
     A            DDCEXAOK  R               TEXT('Highest OD Commission OK')
                                            REFFLD(OKFLAG)
      *
      ** Turnover Commission
     A            DDCEXBOK  R               TEXT('Turnover Commission OK')
                                            REFFLD(OKFLAG)
      *
      ** Debit interest Commission
     A            DDCEXCOK  R               TEXT('Debit interest Comm. OK')
                                            REFFLD(OKFLAG)
      *
      ** Commission on inactive account
     A            DDCEXDOK  R               TEXT('Comm. on inactive A/C OK')
                                            REFFLD(OKFLAG)
      *
      ** Minimum CR. Balance Commission
     A            DDCEXEOK  R               TEXT('Minimum CR. Bal. Comm. OK')
                                            REFFLD(OKFLAG)
      *
      ** Extra Daily Statement Commission
     A            DDCEXFOK  R               TEXT('Extra Daily S. Comm. OK ')
                                            REFFLD(OKFLAG)
      *
      ** Fixed Commission
     A            DDCEXGOK  R               TEXT('Fixed Commission OK')
                                            REFFLD(OKFLAG)
      *
      ** Number of Copies Chargeable
     A            DDNOCCOK  R               TEXT('No. of Copies Chrg. OK')
                                            REFFLD(OKFLAG)
      *
      **Start of change CDE002
      ** Debit Margin Overriden
     A            DDOVRDOK  R               TEXT('Debit Margin Overridden OK')
                                            REFFLD(OKFLAG)
      *
      ** Debit Margin Rate
     A            DDDRMGOK  R               TEXT('Debit Margin Rate OK')
                                            REFFLD(OKFLAG)
      *
      ** Credit Margin Overriden
     A            DDOVRCOK  R               TEXT('Credit Margin Overridden OK')
                                            REFFLD(OKFLAG)
      *
      ** Credit Margin Rate
     A            DDCRMGOK  R               TEXT('Credit Margin Rate OK')
                                            REFFLD(OKFLAG)
      **End of change CDE002
