      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL Account Extension Error Ind - Italian')       *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  PF/GLEAMIT1PD - Account Extension Error Indicator File -     *
      *                  Italian                                      *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2006            *
      *                                                               *
      *  Last Amend No. LUC139             Date 22Dec20               *
      *  Prev Amend No. CER009  *CREATE    Date 16Aug06               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LUC139 - UCI Italian Returns upgrade to FM2.1                *
      *  CER009 - Puma II Upgrade to MidasPlus                        *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R GLEAMIT1D0                TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2006')
      *
     A            DDTMBCDOK R               TEXT('Collocazione Effetti')
     A                                      COLHDG('Collocazione' 'Effetti')
     A                                      REFFLD(OKFLAG)
     A            DDTUNDTOK R               TEXT('Scaduto Da')
     A                                      COLHDG('Scaduto' 'Da')
     A                                      REFFLD(OKFLAG)
     A            DDTCATCOK R               TEXT('Category Code')
     A                                      COLHDG('Category' 'Code')
     A                                      REFFLD(OKFLAG)
     A            DDTTPACOK R               TEXT('Type of Activity')
     A                                      COLHDG('Type of' 'Activity')
     A                                      REFFLD(OKFLAG)
     A            DDTCLRLOK R               TEXT('Client Role CR')
     A                                      COLHDG('Client' 'Role CR')
     A                                      REFFLD(OKFLAG)
     A            DDTACSTOK R               TEXT('Account Status CR')
     A                                      COLHDG('Account' 'Status CR')
     A                                      REFFLD(OKFLAG)
      ** Start of LUC139
     A            DDTLNITOK R               TEXT('Ln Itm Usura Rpt')
     A                                      COLHDG('Ln Itm' 'Usura Rpt')
     A                                      REFFLD(OKFLAG)
     A            DDTTEGLOK R               TEXT('Global Eff Rate')
     A                                      COLHDG('Glob' 'Eff Rat')
     A                                      REFFLD(OKFLAG)
     A            DDTCMPCOK R               TEXT('Comm Rate Mx UBal')
     A                                      COLHDG('CommRt' 'MxUBal')
     A                                      REFFLD(OKFLAG)
      ** End of LUC139
