      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL Error Inds for JE Items')
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  PF/GLEBITPPD - API Error Definition File for Journal         *
      *                 Batch Entry Items                             *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *  Prev Amend No. CAP032  *CREATE    Date 26Apr99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CAP032 - Conversion of Journal Batch Entry inputs into       *
      *           modular structure to use as APIs.                   *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R GLEBITPD0                 TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A            DDACIDOK  R               REFFLD(OKFLAG)
     A                                      TEXT('Account Identifier Flag')
     A                                      COLHDG('Acct. Id.' 'Flag')
     A            DDCYCDOK  R               REFFLD(OKFLAG)
     A                                      TEXT('Currency Code Flag')
     A                                      COLHDG('Curr. Code' 'Flag')
     A            DDACCDOK  R               REFFLD(OKFLAG)
     A                                      TEXT('Account Code Flag')
     A                                      COLHDG('Acct. Code' 'Flag')
     A            DDACSNOK  R               REFFLD(OKFLAG)
     A                                      TEXT('Account Sequence Flag')
     A                                      COLHDG('Acct. Seq.' 'Flag')
     A            DDIBCAOK  R               REFFLD(OKFLAG)
     A                                      TEXT('Branch Code Flag')
     A                                      COLHDG('Brch Code' 'Flag')
     A            DDPTAMOK  R               REFFLD(OKFLAG)
     A                                      TEXT('Posting Amount Flag')
     A                                      COLHDG('Post. Amt.' 'Flag')
     A            DDDCINOK  R               REFFLD(OKFLAG)
     A                                      TEXT('Debit/Credit Ind. Flag')
     A                                      COLHDG('DR/CR Ind.' 'Flag' )
     A            DDNARROK  R               REFFLD(OKFLAG)
     A                                      TEXT('Narrative Flag')
     A                                      COLHDG('Narr.' 'Flag')
     A            DDTRTYOK  R               REFFLD(OKFLAG)
     A                                      TEXT('Transaction Type Flag')
     A                                      COLHDG('Tran. Type' 'Flag')
     A            DDVLDTOK  R               REFFLD(OKFLAG)
     A                                      TEXT('Value Date Flag')
     A                                      COLHDG('Value Date' 'Flag')
     A            DDCQNBOK  R               REFFLD(OKFLAG)
     A                                      TEXT('Cheque No. Flag')
     A                                      COLHDG('Cheque No.' 'Flag')
     A            DDPRCNOK  R               REFFLD(OKFLAG)
     A                                      TEXT('Profit Centre Flag')
     A                                      COLHDG('Prof. Ctr.' 'Flag')
     A            DDACNBOK  R               REFFLD(OKFLAG)
     A                                      TEXT('Assoc. Cust. No. Flag')
     A                                      COLHDG('Assoc. Cust' 'No. Flag')
     A            DDBKCDOK  R               REFFLD(OKFLAG)
     A                                      TEXT('Book Code Flag')
     A                                      COLHDG('Book Code' 'Flag' )
     A            DDRVDIOK  R               REFFLD(OKFLAG)
     A                                      TEXT('Reverse Void Ind. Flag')
     A                                      COLHDG('Rev. Void' 'Ind. Flag')
     A            DDNITMOK  R               REFFLD(OKFLAG)
     A                                      TEXT('No. of Items Flag')
     A                                      COLHDG('No. of' 'Items Flag')
     A            DDRINOOK  R               REFFLD(OKFLAG)
     A                                      TEXT('Retail Ovr. Ind. Flag')
     A                                      COLHDG('Ret. Ovr.' 'Ind. Flag')
     A            DDRINEOK  R               REFFLD(OKFLAG)
     A                                      TEXT('Retail Err. Ind. Flag')
     A                                      COLHDG('Ret. Err.' 'Ind. Flag')
     A            DDOCCYOK  R               REFFLD(OKFLAG)
     A                                      TEXT('Org. Currency Flag')
     A                                      COLHDG('Org. Ccy' 'Flag')
     A            DDOAMTOK  R               REFFLD(OKFLAG)
     A                                      TEXT('Org. Amount Flag')
     A                                      COLHDG('Org. Amt' 'Flag')
      *
