      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL Incoming Generic Interface Trailer')
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  PF/GLGPIPPA - Incoming Interface Trailer Record              *
      *                                                               *
      *  (c) Misys Banking Systems Ltd. 2006                          *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      *  Last Amend No. CGL047 *Create     Date 30Jun06               *
      *  Prev Amend No. Xnnnnn             Date ddmmmyy               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  CGL047 - Midas Generic Posting Interface                     *
      *                                                               *
      *****************************************************************
     A          R GLGPIPA0                  TEXT('(C) Copyright Misys +
     A                                      Banking Systems 2006')
     A*---------------------------------------------------------------------
     A            BTRECI         1          TEXT('Record Id.')
     A                                      COLHDG('Record' 'Id.')
     A            BTRUNA         7          TEXT('Run Date in DDMMMYY')
     A                                      COLHDG('Run Date' +
     A                                      'in' 'DDMMMYY')
     A            BTNRCA        15          TEXT('No. of Records')
     A                                      COLHDG('No.' 'of' 'Records')
     A            BTCAMA        18          TEXT('Total Credit Amount')
     A                                      COLHDG('Total' 'Credit' +
     A                                      'Amount')
     A            BTDAMA        18          TEXT('Total Debit Amount')
     A                                      COLHDG('Total' 'Debit' +
     A                                      'Amount')
     A*=====================================================================
