/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL Posting Summary File')
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  PF/GLPSUMPD - GL Posting Summary File                        *
      *                                                               *
      *  (c) Finastra International Limited 2006                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      *  Prev Amend No. CGL047 *Create     Date 30Jun06               *
      *                 Xnnnnn             Date ddmmmyy               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL047 - Midas Generic Posting Interface                     *
      *                                                               *
      *****************************************************************
      *
     A                                      REF(MFRFL)
     A          R APOSTPDF                  FORMAT(APOSTPD)
      *
