      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Risk Weighted Assets Balance Report File')
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  PF/GLRWARPD - Risk Weighted Assets Balance Report File       *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGL029             Date 01Sep03               *
      *  Prev Amend No. CGL018  *CREATE    Date 26Sep02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CGL018 - Risk Weighted Assets                                *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R GLRWARP0
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
     A            RWRECI         1A         TEXT('Record ID')
     A            RWMOD          2A         TEXT('Module')
     A            RWSETN         1A         TEXT('Set Number')
     A**Start of change CGL029
     A**********  RWTRAN        18A         TEXT('Transaction Number')                        CGL029
     A            QQTRAN        18A
     A**End of change CGL029
     A            RWAMNT        15P 0       TEXT('Asset Balance')
     A            RWCCY          3A         TEXT('Currency')
     A            RWWSRC        10A         TEXT('Weighting Source')
     A            RWCODE         2A         TEXT('RWA Code')
     A            RWPERC         5S 2       TEXT('Weighting Percentage')
     A            RWIAMT        15P 0       TEXT('RWA Interim Balance')
     A            RWADJA        15P 0       TEXT('RWA Adjusted Amount')
     A            RWABAL        15P 0       TEXT('RWA Balance')
     A            RWCCCY    R               REFFLD(CCY)
     A                                      TEXT('Collateral Ccy')
     A            RWCREF        10A         TEXT('Collateral Ref.')
     A**Start of change CGL029
     A            RWTRAN        24A         TEXT('Transaction Number')
     A**End of change CGL029
