      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL Collateral Narratives Screen Format')
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  PF/GLSCLNPD - Collateral Narratives Screen Format            *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *  Prev Amend No. CGL011  *CREATE    Date 20Sep99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL011 - Collateral Processing for Midas                     *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R GLSCLND0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A            NDSRRN         3S 0       TEXT('Subfile RRN')
     A                                      COLHDG('Subfile RRN')
     A            NDACTN         1          TEXT('Action Code')
     A                                      COLHDG('Action Code')
     A            NDNARR        79          TEXT('Collateral +
     A                                      Narrative')
     A                                      COLHDG('Collateral' +
     A                                             'Narrative')
      *
