      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_NM                                                        *
/*EXI *  TEXT('Midas GL Balance Statements TskSplit Driver file')     *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  PF/GLSTAMPD - GL Balance Statements Task Split               *
      *                Driver file.                                   *
      *                                                               *
      *  (c) Finastra International Limited 2006                      *
      *                                                               *
      *  Last Amend No. CGL188             Date 19Feb18               *      
      *  Prev Amend No. MD046248           Date 27Oct17               *
      *                 CGL061A            Date 06Aug12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      *                 BUG26670           Date 04Nov09               *
      *                 CGL061 *Create     Date 26Jun06               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGL188 - COB Optimisation of GL0420                          *      
      *  MD046248 - Finastra Rebranding                               *
      *  CGL061A - Statements Task Split Processing                   *
      *  BUG26670 - Shared format & REF(MFRFL) error                  *
      *  CGL061 - Multi-streaming GL Statements                       *
      *                                                               *
      *****************************************************************
      *
      ** Start of Change BUG26670
     A**********                            REF(MFRFL)                                      BUG26670
      ** End of Change BUG26670
      *
      **Start of change CGL061A
     A**********R STMTAHF                   FORMAT(STMTAH)                                   CGL061A
     A          R STAMPD0
      *
      **Start of change CGL188
     A            S#RPTY         1A         TEXT('Starting Request Priority')
     A                                      COLHDG('Req' 'Pty')
      **End of change CGL188
     A            S#BRCA         3A         TEXT('Starting Branch')
     A                                      COLHDG('Branch')
     A            S#CNUM         6A         TEXT('Starting Customer Number')
     A                                      COLHDG('Customer ' +
     A                                      'Number/ID')
     A            S#CCY          3A         TEXT('Starting Currency Code')
     A                                      COLHDG('Currency Code')
     A            S#ACOD        10S 0       TEXT('Starting Account Number')
     A                                      COLHDG('Account Number')
     A            S#ACSQ         2S 0       TEXT('Starting Sequence Number')
     A                                      COLHDG('Sequence Number')
      **Start of change CGL188
     A**********  S#ATYP         1A         TEXT('Starting Account Type')                     ERZ219
     A**********                            COLHDG('Account Type')                            ERZ219
     A            E#RPTY         1A         TEXT('End Request Priority')
     A                                      COLHDG('Req' 'Pty')
      **End of change CGL188
     A            E#BRCA         3A         TEXT('End Branch')
     A                                      COLHDG('Branch')
     A            E#CNUM         6A         TEXT('End Customer Number')
     A                                      COLHDG('Customer ' +
     A                                      'Number/ID')
     A            E#CCY          3A         TEXT('End Currency Code')
     A                                      COLHDG('Currency Code')
     A            E#ACOD        10S 0       TEXT('End Account Number')
     A                                      COLHDG('Account Number')
     A            E#ACSQ         2S 0       TEXT('End Sequence Number')
     A                                      COLHDG('Sequence Number')
      **Start of change CGL188
     A**********  E#ATYP         1A         TEXT('End Account Type')                          ERZ219
     A**********                            COLHDG('Account Type')                            ERZ219
      **End of change CGL188
      **End of change CGL061A
