      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL Nostro Events Extract')
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  PF/NOSEXGL - Nostros Events Extract Detail                   *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CDL038             Date 10May05               *
      *                 CSD027             Date 25Nov05               *
      *                 CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CGL010  *CREATE    Date 08Nov99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CDL038 - Extended Deal Sub Type                              *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CGL010 - Future Value Dated Journal Entries for              *
      *           Non-Retail Accounts.                                *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R NOSEXGLF                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *----------------------------------------------------------------
     A            RECI      R
     A            DLNO      R
      * Begin /CSD027/
     A**********  CNUM      R                                                                 CSD027
     A            CNUM           6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            ETYP      R
     A            EDAT      R
     A            EAMT      R
     A            ECCY      R
     A            ECSS      R
     A            DTYP      R
     A            DLST      R
     A            BRCA      R
     A            EXRT      R
     A            NGII      R
     A            NOTD      R
     A            OTHD      R
     A            OTHA      R
     A            OTHC      R
     A            DBCE      R
     A            BCEQ      R
     A            DBCR      R
     A            LCEQ      R
     A            SETP      R
     A            OSAC1     R               REFFLD(OSAC10)
     A**Start of change CGL029
     A**********  OSAC2     R               REFFLD(OSAC20)                                    CGL029
     A            OSACQQ        10A
     A**End of change CGL029
     A            TSEN      R
     A            ZZ001     R
     A            CPCI      R
     A            BRCI      R
     A            FIPI      R
     A            INOI      R
     A            FCTI      R
     A            RLVI      R
      * Begin /CSD027/
     A**********  CPAR      R                                                                 CSD027
     A            CPAR           6A
     A                                      TEXT('Parent Customer Number')
     A                                      COLHDG('Parent              ' +
     A                                      'Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            PARI      R
     A            CRNM      R
     A            CTWN      R
     A            CASK      R
     A            PRNM      R
     A            PTWN      R
     A            PASK      R
     A            CCTZ      R
     A            CLOC      R
     A            REGC      R
     A            DASN      R
     A            FFVD      R
     A            FFIN      R
     A            FACT      R
     A            FCNO      R
     A            FACO      R
     A            SPI       R
      * Begin /CSD027/
     A**********  CPCN      R                                                                 CSD027
     A            CPCN           6A
     A                                      TEXT('Counterparty customer number')
     A                                      COLHDG('Countpty            ' +
     A                                      'Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            FSLI      R
     A            ICIR      R
     A            ICAM      R
     A            RBDA      R
     A            OCFF      R
     A            ZZ023     R
     A            TAXI      R
     A**Start of change CGL029
     A            OSAC2         16A
     A**End of change CGL029
     A*                                              Begin /CDL038/
     A            CLAS           4A         TEXT('Deal Class')
     A                                      COLHDG('Deal' 'Class')
     A*                                              End   /CDL038/
