      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_15                                                        *
/*EXI *  TEXT('Expanded Packed file - call GLC000050')
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  PF/PRONOPNZ   - Projected Nostro Balances - Detail           *
      *                                                               *
      *  USE:  CPYF FROMFILE(PRONOPN) TOFILE(*LIBL/PRONOPNZ)          *
      *             MBROPT(*REPLACE) FMTOPT(*NOCHK)                   *
      *                                                               *
      *  (c) Finastra International Limited 2005                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027A            Date 03May06               *
      *                 238797 *C *CREATE  Date 08Mar06               *
      *                 236189 *CREATE     Date 07Apr05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027A - Conversion Of Customer Number to Alpha             *
      *  238797 - A more readable PF/PRONOPN.  Call GLC000050 or      *
      *            use CPYF with FMTOPT(*NOCHK). Applied fix 236189.  *
      *  236189 - A more readable PF/PRONOPN.  Call GLC000050 or      *
      *            use CPYF with FMTOPT(*NOCHK).                      *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R PRONOPNF                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2005')
     A            RECI      R
     A            CCY       R
     A            NOSN      R
      *
     A            PNB1          15P 0       TEXT('Proj Bal. 1')
     A                                      COLHDG('Projected' 'Nostro' +
     A                                             'Balance 1')
     A            PNB2          15P 0       TEXT('Proj Bal. 2')
     A                                      COLHDG('Projected' 'Nostro' +
     A                                             'Balance 2')
     A            PNB3          15P 0       TEXT('Proj Bal. 3')
     A                                      COLHDG('Projected' 'Nostro' +
     A                                             'Balance 3')
     A            PNB4          15P 0       TEXT('Proj Bal. 4')
     A                                      COLHDG('Projected' 'Nostro' +
     A                                             'Balance 4')
     A            PNB5          15P 0       TEXT('Proj Bal. 5')
     A                                      COLHDG('Projected' 'Nostro' +
     A                                             'Balance 5')
      *
     A            PND1           5P 0       TEXT('Proj Date 1')
     A                                      COLHDG('Projected' 'Nostro' +
     A                                             'Date 1')
     A            PND2           5P 0       TEXT('Proj Date 2')
     A                                      COLHDG('Projected' 'Nostro' +
     A                                             'Date 2')
     A            PND3           5P 0       TEXT('Proj Date 3')
     A                                      COLHDG('Projected' 'Nostro' +
     A                                             'Date 3')
     A            PND4           5P 0       TEXT('Proj Date 4')
     A                                      COLHDG('Projected' 'Nostro' +
     A                                             'Date 4')
     A            PND5           5P 0       TEXT('Proj Date 5')
     A                                      COLHDG('Projected' 'Nostro' +
     A                                             'Date 5')
      *
     A**Start of change CSD027A
     A**********  CNUM      R                                                                CSD027A
     A            CNUM      R    6A
     A**End of change CSD027A
     A            CSNM      R
     A            ZZ048     R
     A            TNLU      R
     A            ZONE          10A         TEXT('Zone')
     A                                      COLHDG('Zone')
