      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_AU60                                                      *
/*EXI *  TEXT('Midas FT INCOMING PAYMENTS BY SENDER AUDIT')
     A*****************************************************************
     A*                                                               *
     F*  Midas - FUNDS TRANSFER MODULE
     A*                                                               *
     A*    PRTF/FT0250AU INCOMING PAYMENTS LISTING - AUDIT REPORT     *
     A*                                                               *
     A*  (c) Finastra International Limited 2001                      *
     A*     COMPANY CONFIDENTIAL.                                     *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*     PREV AMEND  NO. 00         DATE  00/00/00                 *
     A*                                                               *
     A*  MD046248 - Finastra Rebranding                               *
     A*****************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R AUHD                      SKIPB(3)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A
     A                                     6'REFERENCE FT0250AU'
     A            TITL      R             37
     A                                   100'DATE'
     A            RUNA      R            105
     A                                   119'PAGE'
     A            PAGE           5  0    124EDTCDE(4)
     A*
     A                                    43'INCOMING PAYMENTS BY'
     A                                      SPACEB(2)
     A                                   + 1'SENDER - AUDIT REPORT'
     A  40                                95'** ALL **'
     A  41                                95'** AUTHORISED TODAY **'
     A  42                                95'** NOT AUTHORISED **'
     A*
     A                                    43'--------------------------
     A                                      -----------------'
     A                                      SPACEB(1)
     A*
     A  60N62                              3'BOOKING BRANCH'
     A                                      SPACEB(2)
     A  60 62                              3'ORIGINATING BRANCH'
     A                                      SPACEB(2)
     A  60        SBRA      R        O    23REFFLD(BRCA)
     A  60        BRNM      R        O    +2
     A*
     A  10                                 3'SENDER'
     A                                      SPACEB(2)
     A  10        PSND1     R             11REFFLD(SND1)
     A*
     A                                     3'PAYMENT REFERENCE'
     A                                      SPACEB(2)
     A                                    23'SETTLE VALUE DATE'
     A                                    43'BENEFICIARY'
     A                                    82'CURRENCY'
     A                                    96'SETTLE AMOUNT'
     A  40                               113'AUTHORISED'
     A** No details
     A          R AUNODT                    SPACEB(3)
     A                                    54'** NO DETAILS TO REPORT **'
     A*
     A** Data Base error
     A          R AUDBER                    SKIPB(30)
     A                                    21'PROGRAM FT0250 TERMINATED'
     A                                   + 1'AT POINT'
     A            WDBASE         3  0    + 1
     A                                   + 1'- DATABASE IN ERROR -'
     A                                   + 1'FILE'
     A            WDBFIL         8       + 1
     A                                   + 1'KEY'
     A            WDBKEY        29       + 1
     A*
