      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_AU60                                                      *
/*EXI *  TEXT('Midas FT ENTRY GENERATION')
     A*****************************************************************
     A*                                                               *
     F*  Midas - FUNDS TRANSFER MODULE
     A*                                                               *
     A*    PRTF/FT0220AU    MISSING ACCOUNT KEY - AUDIT REPORT        *
     A*                     ==================================        *
     A*                                                               *
     A*  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*    PREV AMEND  NO. 00            DATE  DDMMMYY                *
     A*                                                               *
     A*     MD046248 - Finastra Rebranding                            *
     A*****************************************************************
     A*****************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R AUHEAD
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A
     A                                  3  6'REFERENCE FT0220AU'
     A            TITL      R           3 37
     A                                  3100'DATE'
     A            RUNA      R           3105
     A                                  3119'PAGE'
     A            PPAGE     R           3124EDTCDE(4)  REFFLD(PAGE)
     A*
     A                                  5 43'FUNDS TRANSFER MISSING'
     A                                  5 66'ACCOUNT KEYS - CONT'
     A                                  5 85'ROL REPORT'
     A                                  6 41'------------------------'
     A                                  6 65'--------------------'
     A                                  6 85'----------'
     A*
     A                                 11 63'TRAILER'
     A                                 11 91'CALCULATED'
     A*
     A                                 13  6'FILE'
     A                                 13 53'NUMBER'
     A                                 13 74'VALUE   NUMBER'
     A                                 13103'VALUE'
     A*
     A                                 17  6'PAYMENTS ACCOUNT KEYS'
     A                                 17 28'- PF/FPKEYDD    INPUT'
     A            ITN#01         5  0  17 54EDTCDE(3)
     A            ITI#01        15  0  17 61EDTCDE(4)
     A            ITD#01         3  0  17 76
     A            CTN#01         5  0  17 83EDTCDE(3)
     A            CTI#01        15  0  17 90EDTCDE(4)
     A            CTD#01         3  0  17105
     A            DIFF01        16A    17112
     A*
     A                                 20  6'GENERATED ENTRIES'
     A                                 20 28'- PF/GEFPPD     OUTPUT'
     A            CTN#02         5  0  20 83EDTCDE(3)
     A            CTI#02        15  0  20 90EDTCDE(4)
     A            CTD#02         3  0  20105
     A*
     A                                 43 56'*** END OF REPORT ***'
     A*
     A          R AUDBER
     A                                 46 21'PROGRAM FT0220 TERMINATED'
     A                                   + 1'AT POINT'
     A            AUDBAS         3  0    + 1
     A                                   + 1'- DATABASE IN ERROR -'
     A                                   + 1'FILE'
     A            AUDBFL         8       + 1
     A                                   + 1'KEY'
     A            AUDBKY        29       + 1
     A*
