      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas FT DR/CR advices generation')                    *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Funds Transfer Module                                *
     A*                                                               *
     A*  PRTF/FT0560P1 - Debit/Credit Advices                         *
     A*                        (INPUT CYCLE)                          *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CFT134             Date 06Feb12               *
      *                 AR1080201          Date 23Jan13               *
      *                 257567             Date 23Jan13               *
      *                 AR1079839A         Date 25Jan13               *
      *                 AR1079839          Date 23Jan13               *
      *                 AR1070999          Date 21Dec12               *
      *                 CFT120             Date 28Sep12               *
      *                 CFT121             Date 28Sep12               *
      *                 263327             Date 21Dec09               *
      *                 CER059             Date 19Jul10               *
      *                 BUG24277           Date 18Jun09               *
      *                 CER030             Date 09Jul08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *                 BUG15046           Date 19Oct07               *
      *                 CSW207             Date 17Jun07               *
      * Midas Plus 1.4 Base ------------------------------------------*
      *                 CFT032             Date 11Sep06               *
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CGL029             Date 01Sep03               *
      * Midas Release 4.01.03 ----------------------------------------*
      *                 211243             Date 17Jan03               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 CSW201             Date 02May01               *
      * Midas DBA 3.05 -----------------------------------------------*
      *                 CFT009             Date 13Jun00               *
      * Midas DBA 3.04 -----------------------------------------------*
      *                 CFT014             Date 25May00               *
      * Midas DBA 3.03 -----------------------------------------------*
      *                 CFT006             Date 25OCT99               *
      * Midas DBA 3.02 -----------------------------------------------*
      *       Amend No. CPB001             Date 20Sep99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*                 CFT003             Date 25NOV98               *
     A*                 140650             DATE 19AUG98               *
     A*                 CEU006             DATE 15JUN98               *
     A*                 S01408             DATE 07OCT96               *
     A*                 S01408             DATE 25JUL96               *
     A*                 S01408             DATE 02JUL96               *
     A*                 S01408             DATE 06DEC95               *
     A*                 087373             DATE 29APR95               *
     A*                 S01499             DATE 06JUN94               *
     A*                 S01494             DATE 25MAY94               *
     A*                 S01117             DATE 31JAN91               *
     A*                 E23735             DATE 24SEP90               *
     A*                                                               *
     A*---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CFT134 - IBAN in DR/CR Advices                               *
      *           (Upgrade of ERZ130 to BFM - including SC261061)     *
      *  AR1080201 - DR/CR Advice various errors                      *
      *  257567 - Include Swift Standard Charge on Cr/Dr advice       *
      *           also Miscellaneous Charge 1                         *
      *         - Applied for AR1080201                               *
      *  AR1079839A - DR/CR Advice various errors                     *
      *  AR1079839 - CR and DR Advices errors                         *
      *  AR1070999 - Second Advice Charges to the Debit of Account    *
      *  CFT120 - FT IN/OP - Charges to DR of Account Currency        *
      *           (Recompile)                                         *
      *  CFT121 - FT IN/OP - Separate DR Advice for Charges           *
      *  263327 - Change the length of Ordering Bank from 10 to 11.   *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  BUG24277 - Debit Advice contains Credit narratives.          *
      *  CER030 - Multicash German Feature                            *
      *  BUG15046 - Missing Ordering Customer field in MT103          *
      *  CSW207 - SWIFT 2007 Changes                                  *
      *  CFT032 - Account line in field 50X in MT103                  *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  211243 - Commented out correctly all comments for 'Ordering  *
      *           Customer'                                           *
      *  CSW201 - SWIFT 2001 Standards Update                         *
     A*  CFT009 - Fees and charges development                        *
      *  CFT014 - Straight-through Processing Phase 2 MT103           *
      *           Messages Generation for FT.                         *
     A*  CFT006 - MT101/MT102 enhancements (print Debit and Credit    *
     A*           advices for RFT and CCT)                            *
     A*  CPB001 - 'Private Banking' Module                            *
     A*  CFT003 - Settlement method '14'                              *
     A*  140650 - Add header to page format FT0560F5                  *
     A*  CEU006 - EMU Retail Utilities. Addition of                   *
     A*           format to display Notified delivery                 *
     A*           /Pay amount and Euro charge Details                 *
     A*  S01408 - Addition of Core hook FT0560P108.                   *
     A*         - Addition of Core hook FT0560P107.                   *
     A*  S01408 - Addition of Core hook FT0560P106.                   *
     A*         - Addition of Core hook FT0560P105.                   *
     A*         - Addition of Core hook FT0560P104.                   *
     A*         - Addition of Core hook FT0560P103.                   *
     A*  S01408 - Addition of Core hook FT0560P102.                   *
     A*  S01408 - Addition of Core hook FT0560P101.                   *
     A*  087373 - Overflow error on format FT0560F3                   *
     A*  S01499 - BLI V.A.T. Processing                               *
     A*  S01494 - BLI Funds Transfer Enhancements                     *
     A*  S01117 - RELEASE 10 MULTIBRANCHING CHANGES                   *
     A*  E23735 - CORRECTLY OUTPUTS THE BENEFICIARY                   *
     A*           CUSTOMER  AS  FORMATTED BY FT0560.                  *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A**                                                          */S01408/*
     A*/COPY WNCPYSRC,FT0560P102
     A**                                                          */S01408/*
     A** CREDIT ADVICE - CHEQUES FOR COLLECTION (CQCOA)
     A          R FT0560F1                  SKIPB(5)
     A*
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*
     A                                     5'COLLECTING BANK'
     A            P1COB1        35         5SPACEB(1)
     A            P1COB2        35         5SPACEB(1)
     A            P1COB3        35         5SPACEB(1)
     A            P1COB4        35         5SPACEB(1)
     A                                    42'DATE'
     A            RUNA           7        49
     A            P1CRPY        10         5SPACEB(1)
     A            P1CRP1        35         5SPACEB(1)
     A                                    42'REFERENCE NO.'
     A            PREFCQ        17        57
     A            P1CRP2        35         5SPACEB(1)
     A            P1CRP3        35         5SPACEB(1)
     A                                    42'C R E D I T    A D V I C E'
     A            P1CRP4        35         5SPACEB(1)
     A            P1CRP5        35         5SPACEB(1)
     A  21                                 5'DESCRIPTION'
     A                                      SPACEB(1)
     A N21                                 5'DESCRIPTION'
     A                                      SPACEB(2)
     A            NAR1      R              5SPACEB(1)
     A                                    42'IN RESPECT OF YOUR CHEQUE'
     A            NAR2      R              5SPACEB(1)
     A                                    42'REMITTANCE'
     A            NAR3      R              5SPACEB(1)
     A            NAR4      R              5SPACEB(1)
     A            SMCY      R             50
     A            P1AMNT        17        60
     A            NAR5      R              5SPACEB(1)
     A            NAR6      R              5SPACEB(1)
     A  22                                42'RATE'
     A  22        P1RATE        13S 8     63EDTWRD('   0 .        ')
     A  22                                42'EQUIVALENT'
     A                                      SPACEB(1)
     A  22        CRCY      R             54
     A  22        P1EQVA        17        60
     A  22                                 5'RECEIVER''S CORRESPONDENT'
     A                                      SPACEB(1)
     A N22                                 5'RECEIVER''S CORRESPONDENT'
     A                                      SPACEB(2)
     A            P1REC1        35         5SPACEB(1)
     A*/COPY WNCPYSRC,FT0560P109
     A                                    42'CHARGES'
     A            P1CCY          3        51
     A*********              Start of Change               /CFT009/
     A***         P1REC2        35         5SPACEB(1)
     A**40                                42'TRANSFER COMMISSION'
     A**40        P1TRCM        14        63
     A***         P1REC3        35         5SPACEB(1)
     A**48                                42'COLLECTION CHARGE'
     A**48        P1CLCH        14        63
     A***         P1REC4        35         5SPACEB(1)
     A**46                                42'COSTS ABROAD'
     A**46        P1CSTA        14        63
     A***         P1REC5        35         5SPACEB(1)
     A**41                                42'TELEX CHARGE'
     A**41        P1TXCH        14        63
     A*********              Start of Change               /S01494/
     A**39 52                             42'FX/CHANGE COMMISSION'
     A**39 52                               SPACEB(1)
     A**39 52     P1CHCM        14        63
     A***                    End of Change                 /S01494/
     A*********              Start of Change               /S01499/
     A**49 53                             42'V.A.T.'
     A**49 53                               SPACEB(1)
     A**49 53     P1VATT        14        63
     A***                    End of Change                 /S01499/
      *
     A            P1REC2        35         5SPACEB(1)
     A  40   N84                          42'TRANSFER COMMISSION'
     A  40   N84  P1TRCM        14        63
     A            P1REC3        35         5SPACEB(1)
     A  48   N84                          42'COLLECTION CHARGE'
     A  48   N84  P1CLCH        14        63
     A            P1REC4        35         5SPACEB(1)
     A  46   N84                          42'COSTS ABROAD'
     A  46   N84  P1CSTA        14        63
     A            P1REC5        35         5SPACEB(1)
     A  41   N84                          42'TELEX CHARGE'
     A  41   N84  P1TXCH        14        63
     A  39 52N84                          42'FX/CHANGE COMMISSION'
     A  39 52N84                            SPACEB(1)
     A  39 52N84  P1CHCM        14        63
     A  49 53N84                          42'V.A.T.'
     A  49 53N84                            SPACEB(1)
     A  49 53N84  P1VATT        14        63
     A*********              End of Change                 /CFT009/
     A                                    42'TOTAL CHARGES'
     A                                      SPACEB(2)
     A            P1CCYD    R             57REFFLD(P1CCY *SRC)
     A            P1TOTC        14        63
     A N23                                42'NET AMOUNT'
     A                                      SKIPB(36)
     A N23        CRCYD     R             54REFFLD(CRCY)
     A N23        P1NETA        17        60
     A  23                                42'CHARGES TO THE DEBIT OF'
     A                                      SKIPB(38)
     A  23                                +1'ACCOUNT NO.'
     A**Start of change CGL029
     A**23******  P1CDRO        15        42SPACEB(1)                                         CGL029
     A  23        P1CDRO        21        42SPACEB(1)
     A**End of change CGL029
     A*                                                    /S01117/
     A**Start of change CGL029
     A**23*28***  P1CDBR    R             57REFFLD(CDBRFT)                                    CGL029
     A  23 28     P1CDBR    R             63REFFLD(CDBRFT)
     A**End of change CGL029
     A*                                                    /S01117/
     A  23                                42'VALUE'
     A                                      SPACEB(2)
     A N23                                42'VALUE'
     A                                      SKIPB(41)
     A            P1DATE         7        50
     A*/COPY WNCPYSRC,FT0560P119
     A**************************************************************************
     A** DEBIT ADVICE - CHEQUES TO BE PAID (CQPAA)
     A          R FT0560F2                  SKIPB(5)
     A                                     5'REMITTING BANK'
     A            P1RBK1        35         5SPACEB(1)
     A            P1RBK2        35         5SPACEB(1)
     A            P1RBK3        35         5SPACEB(1)
     A            P1RBK4        35         5SPACEB(1)
     A                                    42'DATE'
     A                                      SKIPB(11)
     A            RUNA           7        49
     A            P1DRPY        10         5SPACEB(1)
     A            P1DRP1        35         5SPACEB(1)
     A                                    42'REFERENCE NO.'
     A            PREFCQ        17        60
     A            P1DRP2        35         5SPACEB(1)
     A            P1DRP3        35         5SPACEB(1)
     A                                    42'D E B I T    A D V I C E'
     A            P1DRP4        35         5SPACEB(1)
     A            P1DRP5        35         5SPACEB(1)
     A                                    42'IN RESPECT OF CHEQUES DRAWN'
     A                                    +1'ON YOU'
     A                                    42'AMOUNT'
     A                                      SPACEB(3)
     A            PCCY      R             50
     A            P1AMNT        17        60
     A  22                                42'RATE'
     A                                      SPACEB(3)
     A  22        P1RATE        13S 8     63EDTWRD('   0 .        ')
     A  22                                42'EQUIVALENT'
     A                                      SPACEB(1)
     A  22        DRCY      R             54
     A  22        P1EQVA        17        60
     A                                    42'CHARGES'
     A                                      SKIPB(26)
     A            P1CCY          3        51
     A                                     5'SENDER''S CORRESPONDENT'
     A                                      SPACEB(1)
      *********              Start of Change               /CFT009/
     A**40                                42'TRANSFER COMMISSION'
     A**40        P1TRCM        14        63
     A***         P1SND1        35         5SPACEB(1)
     A**48                                42'COLLECTION CHARGE'
     A**48        P1CLCH        14        63
     A***         P1SND2        35         5SPACEB(1)
     A**46                                42'COSTS ABROAD'
     A**46        P1CSTA        14        63
     A***         P1SND3        35         5SPACEB(1)
     A*********              Start of Change               /S01494/
     A**39 52                             42'FX/CHANGE COMMISSION'
     A**39 52     P1CHCM        14        63
     A***                    End of Change                 /S01494/
     A***         P1SND4        35         5SPACEB(1)
     A*********              Start of Change               /S01499/
     A**49 53                             42'V.A.T.'
     A**49 53     P1VATT        14        63
     A***                    End of Change                 /S01499/
      *
     A  40   N84                          42'TRANSFER COMMISSION'
     A  40   N84  P1TRCM        14        63
     A            P1SND1        35         5SPACEB(1)
     A  48   N84                          42'COLLECTION CHARGE'
     A  48   N84  P1CLCH        14        63
     A            P1SND2        35         5SPACEB(1)
     A  46   N84                          42'COSTS ABROAD'
     A  46   N84  P1CSTA        14        63
     A            P1SND3        35         5SPACEB(1)
     A  39 52N84                          42'FX/CHANGE COMMISSION'
     A  39 52N84  P1CHCM        14        63
     A            P1SND4        35         5SPACEB(1)
     A  49 53N84                          42'V.A.T.'
     A  49 53N84  P1VATT        14        63
     A*********              End of Change                 /CFT009/
     A            P1SND5        35         5SPACEB(1)
     A                                    42'TOTAL CHARGES'
     A                                      SPACEB(2)
     A            P1CCYD         3        57
     A            P1TOTC        14        63
     A N23                                42'NET AMOUNT'
     A                                      SKIPB(36)
     A N23        DRCYD     R             54REFFLD(DRCY)
     A N23        P1NETA        17        60
     A  23                                42'CHARGES TO THE DEBIT OF'
     A                                      SKIPB(38)
     A  23                                +1'ACCOUNT NO.'
     A**Start of change CGL029
     A**23******  P1CDRO        15        42SPACEB(1)                                         CGL029
     A  23        P1CDRO        21        42SPACEB(1)
     A**End of change CGL029
     A*                                                    /S01117/
     A**Start of change CGL029
     A**23*28***  P1CDBR    R             57REFFLD(CDBRFT)                                    CGL029
     A  23 28     P1CDBR    R             63REFFLD(CDBRFT)
     A**End of change CGL029
     A*                                                    /S01117/
     A  23                                42'VALUE'
     A                                      SPACEB(2)
     A N23                                42'VALUE'
     A                                      SKIPB(41)
     A            P1DATE         7        50
     A*/COPY WNCPYSRC,FT0560P120
     A**************************************************************************
     A** CREDIT ADVICE - INCOMING PAYMENT (INPAA)
     A*                                              Begin 087373
     A**********R FT0560F3                  SKIPB(5)
     A          R FT0560F3
     A*/COPY WNCPYSRC,FT0560P110
     A  24                                  SKIPB(5)
     A*                                              End   087373
     A*/COPY WNCPYSRC,FT0560P122
     A  24                                 5'BENEFICIARY'
     A  24        P1BNC1        35         5SPACEB(1)
     A  24        P1BNC2        35         5SPACEB(1)
     A  24        P1BNC3        35         5SPACEB(1)
     A  24        P1BNC4        35         5SPACEB(1)
     A*/COPY WNCPYSRC,FT0560P123
     A                                    42'DATE'
     A*/COPY WNCPYSRC,FT0560P158
     A N24                                  SKIPB(9)
     A*/COPY WNCPYSRC,FT0560P111
     A            RUNA           7        49
     A*/COPY WNCPYSRC,FT0560P117
     A  24        P1BNC5        35         5SPACEB(1)
     A*                                     Start /CPB001/
     A  67                                42'PORTFOLIO'
     A  67                                  SPACEB(1)
     A  67        P1PTFR         3        52
     A*                                     End   /CPB001/
     A                                    42'REFERENCE NO.'
     A                                      SPACEB(1)
     A            PREF          15        60
     A*/COPY WNCPYSRC,FT0560P124
     A            P1ACBK        10         5SPACEB(1)
     A                                    42'RELATED REF NO.'
     A            RLPR      R             60
      ** Start of change CFT134
      ** Increase field to 47 and use IN86                                                    CFT134
     A  86        P1IBAN        47         5SPACEB(1)
      ** End of change CFT134
     A*/COPY WNCPYSRC,FT0560P125
     A            P1ABC1        35         5SPACEB(1)
     A            P1ABC2        35         5SPACEB(1)
     A                                    42'C R E D I T    A D V I C E'
     A            P1ABC3        35         5SPACEB(1)
     A            P1ABC4        35         5SPACEB(1)
     A*/COPY WNCPYSRC,FT0560P126
     A                                     5'DETAILS OF PAYMENT'
     A                                      SPACEB(2)
     A                                    42'IN RESPECT OF AN INCOMING'
     A                                    +1'PAYMENT FOR:'
     A*/COPY WNCPYSRC,FT0560P127
     A            DTP1      R              5SPACEB(1)
     A            DTP2      R              5SPACEB(1)
     A                                    42'AMOUNT'
     A            SMCY      R             50
     A            P1AMNT        17        60
     A*/COPY WNCPYSRC,FT0560P128
     A            DTP3      R              5SPACEB(1)
     A  25                                42'LESS CHARGES'
     A            DTP4      R              5SPACEB(1)
     A  22                                42'RATE'
     A  22        P1RATE        13S 8     63EDTWRD('   0 .        ')
     A*/COPY WNCPYSRC,FT0560P129
     A  22                                42'EQUIVALENT'
     A                                      SPACEB(1)
     A  22        PCCY      R             54
     A  22        P1EQVA        17        60
     A*/COPY WNCPYSRC,FT0560P130
     A  22                                 5'RECEIVER''S CORRESPONDENT'
     A                                      SPACEB(1)
     A N22                                 5'RECEIVER''S CORRESPONDENT'
     A                                      SPACEB(2)
     A*                                              */Start of fix S01408/*
     A*/COPY WNCPYSRC,FT0560P107
     A*                                              */End of fix S01408/*
     A            P1REC1        35         5SPACEB(1)
     A  25                                42'CHARGES'
     A  25        P1CCY          3        51
     A            P1REC2        35         5SPACEB(1)
     A*********              Start of Change               /CFT009/
     A**40 25                             42'TRANSFER COMMISSION'
     A**40 25     P1TRCM        14        63
     A***         P1REC3        35         5SPACEB(1)
     A***                                            */Start of fix S01408/*
     A*/COPY WNCPYSRC,FT0560P103
     A***                                            */End of fix S01408/*
     A**41 25                             42'TELEX CHARGE'
     A***                                            */Start of fix S01408/*
     A*/COPY WNCPYSRC,FT0560P104
     A***                                            */End of fix S01408/*
     A**41 25     P1TXCH        14        63
     A***         P1REC4        35         5SPACEB(1)
     A**42 25                             42'CHEQUE CHARGE'
     A**42 25     P1CQCH        14        63
     A***         P1REC5        35         5SPACEB(1)
     A**43 25                             42'ADVICE CHARGE'
     A**43 25     P1ADCH        14        63
     A**44 25                             42'TELEPHONE CHARGE'
     A***                                   SPACEB(1)
     A**44 25     P1TLCH        14        63
     A**44 25                              5'ORDERING CUSTOMER'
     A***                                   SPACEB(1)
     A*N44
      **********             Start of Change               /211243/
     A*ON25*****                           5'ORDERING CUSTOMER'
      **********             End of Change                 /211243/
     A***                                   SPACEB(2)
     A**45 25                             42'MISCELLANEOUS CHARGE'
     A**45 25     P1MSCH        14        63
     A***         P1ORC1        35         5SPACEB(1)
     A*********              Start of Change               /S01494/
     A**39 25 52                          42'FX/CHANGE COMMISSION'
     A**39 25 52  P1CHCM        14        63
     A***                    End of Change                 /S01494/
     A***         P1ORC2        35         5SPACEB(1)
     A*********              Start of Change               /S01499/
     A**49 25 53                          42'V.A.T.'
     A**49 25 53  P1VATT        14        63
      *
     A  40 25N84                          42'TRANSFER COMMISSION'
     A  40 25N84  P1TRCM        14        63
     A            P1REC3        35         5SPACEB(1)
     A  41 25N84                          42'TELEX CHARGE'
     A  41 25N84  P1TXCH        14        63
     A            P1REC4        35         5SPACEB(1)
     A  42 25N84                          42'CHEQUE CHARGE'
     A  42 25N84  P1CQCH        14        63
     A            P1REC5        35         5SPACEB(1)
     A  43 25N84                          42'ADVICE CHARGE'
     A  43 25N84  P1ADCH        14        63
     A  44 25N84                          42'TELEPHONE CHARGE'
     A       N84                            SPACEB(1)
     A  44 25N84  P1TLCH        14        63
     A  44 25                              5'ORDERING CUSTOMER'
     A                                      SPACEB(1)
     A N44
     AON25                                 5'ORDERING CUSTOMER'
     A                                      SPACEB(2)
     A  45 25N84                          42'MISCELLANEOUS CHARGE'
     A  45 25N84  P1MSCH        14        63
     A            P1ORC1        35         5SPACEB(1)
     A  39 25 52
     AAN84                                42'FX/CHANGE COMMISSION'
     A  39 25 52
     AAN84        P1CHCM        14        63
     A            P1ORC2        35         5SPACEB(1)
     A  49 25 53
     AAN84                                42'V.A.T.'
     A  49 25 53
     AAN84        P1VATT        14        63
      *
     A*********                End of Change               /CFT009/
     A**25*****                           42'TOTAL CHARGES'
     A**25*****   P1CCYD    R             57REFFLD(P1CCY *SRC)
     A**25*****   P1TOTC        14        63
     A*                      End of Change                 /S01499/
     A            P1ORC3        35         5SPACEB(1)
     A*********              Start of Change               /S01499/
     A  25                                42'TOTAL CHARGES'
     A  25        P1CCYD    R             57REFFLD(P1CCY *SRC)
     A  25        P1TOTC        14        63
     A*                      End of Change                 /S01499/
     A            P1ORC4        35         5SPACEB(1)
     A N23 25                             42'NET AMOUNT'
     A N23 25     PCCYD     R             54REFFLD(PCCY)
     A N23 25     P1NETA        17        60
     A*/COPY WNCPYSRC,FT0560P131
     A            P1ORC5        35         5SPACEB(1)
     A*/COPY WNCPYSRC,FT0560P116
     A  23 25                             42'CHARGES TO THE DEBIT OF'
     A                                      SPACEB(1)
     A  23 25                             +1'ACCOUNT NO.'
     A  23 25                              5'ORDERING BANK'
     A                                      SPACEB(1)
     A N23
     AON25                                 5'ORDERING BANK'
     A                                      SPACEB(2)
     A**Start of change CGL029
     A**23*25***  P1CDRO        15        42                                                  CGL029
     A  23 25     P1CDRO        21        42
     A**End of change CGL029
     A*                                                    /S01117/
     A**Start of change CGL029
     A**23*25*28  P1CDBR    R             57REFFLD(CDBRFT)                                    CGL029
     A  23 25 28  P1CDBR    R             63REFFLD(CDBRFT)
     A**End of change CGL029
     A*                                                    /S01117/
     A            P1ORB1        35         5SPACEB(1)
     A            P1ORB2        35         5SPACEB(1)
     A*/COPY WNCPYSRC,FT0560P132
     A                                    42'VALUE'
     A            P1DATE         7        50
     A*/COPY WNCPYSRC,FT0560P133
     A            P1ORB3        35         5SPACEB(1)
     A            P1ORB4        35         5SPACEB(1)
      *                                              Begin /CFT014/
     A  88                                42'SENDER''S CHARGES:'
      *                                              End   /CFT014/
     A            P1ORB5        35         5SPACEB(1)
     A*/COPY WNCPYSRC,FT0560P134
      *                                              Begin /CFT014/
     A  88        P1SCY1         3        56
     A  88        P1SCH1        14        63
     A  88        P1SCY2         3        56SPACEB(1)
     A  88        P1SCH2        14        63
      *
      * Start of Change               /CFT009/
     A**74********                         5'THIRD REIMBURSEMENT +
     A************                           INSTITUTION'
     A**74********                          SPACEB(1)
     A**8*********P1SCY3         3        56
     A**88N74*****                          SPACEB(1)
     A**88********P1SCH3        14        63
     A**74********P1TRI1        35         5
     A**74********                          SPACEB(1)
     A**88********P1SCY4         3        56
     A**88N74*****                          SPACEB(1)
     A**88********P1SCH4        14        63
     A**74********P1TRI2        35         5
     A**74********                          SPACEB(1)
     A**88********P1SCY5         3        56
     A**88N74*****                          SPACEB(1)
     A**88********P1SCH5        14        63
     A**74********P1TRI3        35         5SPACEB(1)
     A**74********P1TRI4        35         5SPACEB(1)
     A**74********P1TRI5        35         5SPACEB(1)
     A  84                                 5'THIRD REIMBURSEMENT +
     A                                       INSTITUTION'
     A  84                                  SPACEB(1)
     A  88        P1SCY3         3        56
     A  88N84                               SPACEB(1)
     A  88        P1SCH3        14        63
      *
     A  84        P1TRI1        35         5
     A  84                                  SPACEB(1)
     A  88        P1SCY4         3        56
     A  88N84                               SPACEB(1)
     A  88        P1SCH4        14        63
      *
     A  84        P1TRI2        35         5
     A  84                                  SPACEB(1)
     A  88        P1SCY5         3        56
     A  88N84                               SPACEB(1)
     A  88        P1SCH5        14        63
      *
     A  84        P1TRI3        35         5SPACEB(1)
     A  84        P1TRI4        35         5SPACEB(1)
     A  84        P1TRI5        35         5SPACEB(1)
      * End of Change               /CFT009/
      *                                              End   /CFT014/
     A*/COPY WNCPYSRC,FT0560P112
      ** Start of Change CFT121
      *
      ** Credit Advice - Incoming Payment (INPAA) with CFT121 enabled
      *
     A          R FT0560X3
     A  24                                  SKIPB(5)
     A  24                                 5'BENEFICIARY'
     A  24        P1BNC1        35         5SPACEB(1)
     A  24        P1BNC2        35         5SPACEB(1)
     A  24        P1BNC3        35         5SPACEB(1)
     A  24        P1BNC4        35         5SPACEB(1)
     A                                    42'DATE'
     A N24                                  SKIPB(9)
     A            RUNA           7        49
     A  24        P1BNC5        35         5SPACEB(1)
     A  67                                42'PORTFOLIO'
     A  67                                  SPACEB(1)
     A  67        P1PTFR         3        52
     A                                    42'REFERENCE NO.'
     A                                      SPACEB(1)
     A            PREF          15        60
     A            P1ACBK        10         5SPACEB(1)
     A                                    42'RELATED REF NO.'
     A            RLPR      R             60
     A            P1ABC1        35         5SPACEB(1)
     A            P1ABC2        35         5SPACEB(1)
     A                                    42'C R E D I T    A D V I C E'
     A            P1ABC3        35         5SPACEB(1)
     A            P1ABC4        35         5SPACEB(1)
     A                                     5'DETAILS OF PAYMENT'
     A                                      SPACEB(2)
     A                                    42'IN RESPECT OF AN INCOMING'
     A                                    +1'PAYMENT FOR:'
     A            DTP1      R              5SPACEB(1)
     A            DTP2      R              5SPACEB(1)
     A                                    42'AMOUNT'
     A            SMCY      R             50
     A            P1AMNT        17        60
     A            DTP3      R              5SPACEB(1)
     A  25                                42'LESS CHARGES'
     A            DTP4      R              5SPACEB(1)
     A  22                                42'RATE'
     A  22        P1RATE        13S 8     63EDTWRD('   0 .        ')
     A  22                                42'EQUIVALENT'
     A                                      SPACEB(1)
     A  22        PCCY      R             54
     A  22        P1EQVA        17        60
     A  22                                 5'RECEIVER''S CORRESPONDENT'
     A                                      SPACEB(1)
     A N22                                 5'RECEIVER''S CORRESPONDENT'
     A                                      SPACEB(2)
     A            P1REC1        35         5SPACEB(1)
     A  25   N82                          42'CHARGES'
     A  25   N82  P1CCY          3        51
     A            P1REC2        35         5SPACEB(1)
     A N82
     A  40 25N84                          42'TRANSFER COMMISSION'
     A N82
     A  40 25N84  P1TRCM        14        63
     A            P1REC3        35         5SPACEB(1)
     A N82
     A  41 25N84                          42'TELEX CHARGE'
     A N82
     A  41 25N84  P1TXCH        14        63
     A            P1REC4        35         5SPACEB(1)
     A N82
     A  42 25N84                          42'CHEQUE CHARGE'
     A N82
     A  42 25N84  P1CQCH        14        63
     A            P1REC5        35         5SPACEB(1)
     A N82
     A  43 25N84                          42'ADVICE CHARGE'
     A N82
     A  43 25N84  P1ADCH        14        63
     A N82
     A  44 25N84                          42'TELEPHONE CHARGE'
     A                                      SPACEB(1)
     A N82
     A  44 25N84  P1TLCH        14        63
     A  44 25                              5'ORDERING CUSTOMER'
     A                                      SPACEB(1)
     A N44
     AON25                                 5'ORDERING CUSTOMER'
     A                                      SPACEB(2)
     A N82
     A  45 25N84                          42'MISCELLANEOUS CHARGE'
     A N82
     A  45 25N84  P1MSCH        14        63
     A            P1ORC1        35         5SPACEB(1)
     A N82N84
     AA 39 25 52                          42'FX/CHANGE COMMISSION'
     A N82N84
     AA 39 25 52  P1CHCM        14        63
     A            P1ORC2        35         5SPACEB(1)
     A N82N84
     AA 49 25 53                          42'V.A.T.'
     A N82N84
     AA 49 25 53  P1VATT        14        63
     A            P1ORC3        35         5SPACEB(1)
     A  25   N82                          42'TOTAL CHARGES'
     A  25   N82  P1CCYD    R             57REFFLD(P1CCY *SRC)
     A  25   N82  P1TOTC        14        63
     A            P1ORC4        35         5SPACEB(1)
     A N23 25                             42'NET AMOUNT'
     A N23 25     PCCYD     R             54REFFLD(PCCY)
     A N23 25     P1NETA        17        60
     A            P1ORC5        35         5SPACEB(1)
     A  23 25                             42'CHARGES TO THE DEBIT OF'
     A                                      SPACEB(1)
     A  23 25                             +1'ACCOUNT NO.'
     A  23 25                              5'ORDERING BANK'
     A                                      SPACEB(1)
     A N23
     AON25                                 5'ORDERING BANK'
     A                                      SPACEB(2)
     A  23 25 82  UMCDRO        35        42
      *
     A            P1ORB1        35         5SPACEB(1)
     A            P1ORB2        35         5SPACEB(1)
     A                                    42'VALUE'
     A            P1DATE         7        50
     A            P1ORB3        35         5SPACEB(1)
     A            P1ORB4        35         5SPACEB(1)
     A  88                                42'SENDER''S CHARGES:'
     A            P1ORB5        35         5SPACEB(1)
     A N25                                 5'SENDER TO RECEIVER INFORMATION'
     A                                      SPACEB(2)
     A            P1BBI1        35         5SPACEB(1)
     A            P1BBI2        35        42
     A            P1BBI3        35         5SPACEB(1)
     A            P1BBI4        35        42
     A            P1BBI5        35         5SPACEB(1)
     A            P1BBI6        35        42
     A  88        P1SCY1         3        56
     A  88        P1SCH1        14        63
     A  88        P1SCY2         3        56SPACEB(1)
     A  88        P1SCH2        14        63
     A  84                                 5'THIRD REIMBURSEMENT +
     A                                      INSTITUTION'
     A  84                                  SPACEB(1)
     A  88        P1SCY3         3        56
     A  88N84                               SPACEB(1)
     A  88        P1SCH3        14        63
      *
     A  84        P1TRI1        35         5
     A  84                                  SPACEB(1)
     A  88        P1SCY4         3        56
     A  88N84                               SPACEB(1)
     A  88        P1SCH4        14        63
      *
     A  84        P1TRI2        35         5
     A  84                                  SPACEB(1)
     A  88        P1SCY5         3        56
     A  88N84                               SPACEB(1)
     A  88        P1SCH5        14        63
      *
     A  84        P1TRI3        35         5SPACEB(1)
     A  84        P1TRI4        35         5SPACEB(1)
     A  84        P1TRI5        35         5SPACEB(1)
      *
      ** Debit Advice - from an Incoming Payment (INPAA)
      *
     A          R FT0560M3                  SKIPB(5)
      *
     A  24        P1ORC1        35         5SPACEB(1)
     A  24        P1ORC2        35         5SPACEB(1)
     A  24        P1ORC3        35         5SPACEB(1)
     A  24        P1ORC4        35         5SPACEB(1)
     A                                    42'DATE'
     A                                      SKIPB(11)
     A            RUNA           7        49
     A            P1ORBK        11         5SPACEB(1)
     A            P1ABC1        35         5SPACEB(1)
     A                                    42'REFERENCE NO.'
     A            PREF          15        60
     A            P1ABC2        35         5SPACEB(1)
     A  26                                42'RELATED REF NO.'
     A  26        RLPR      R             60
     A            P1ABC3        35         5SPACEB(1)
     A                                    42'D E B I T    A D V I C E'
     A            P1ABC4        35         5SPACEB(1)
     A            P1ABC5        35         5SPACEB(1)
     A                                    42'IN RESPECT OF AN INCOMING'
     A                                    +1'PAYMENT FOR :'
     A                                     5'DETAILS OF PAYMENT'
     A                                      SPACEB(2)
     A            DTP1      R              5SPACEB(1)
     A                                    42'AMOUNT'
     A            PCCY      R             54
     A            P1EQVA        17        60
     A            DTP2      R              5SPACEB(1)
     A  25                                42'LESS CHARGES'
      *
     A            DTP3      R              5SPACEB(1)
      *
     A  22                                42'RATE'
     A  22        P1RATE        13S 8     63EDTWRD('   0 .        ')
      *
     A            DTP4      R              5SPACEB(1)
      *
     A  22                                42'EQUIVALENT'
     A  22        SMCY      R             54
     A  22        P1AMNT        17        60
      *
     A                                     5'RECEIVER''S CORRESPONDENT'
     A                                      SPACEB(2)
     A            P1REC1        35         5SPACEB(1)
      *
     A N25                                42'CHARGES'
     A N25        P1CCY          3        51
     A            P1REC2        35         5SPACEB(1)
     A  40N25                             42'TRANSFER COMMISSION'
     A  40N25     P1TRCM        14        63
     A            P1REC3        35         5SPACEB(1)
     A  41N25                             42'TELEX CHARGE'
     A  41N25     P1TXCH        14        63
     A            P1REC4        35         5SPACEB(1)
     A  42N25                             42'CHEQUE CHARGE'
     A  42N25     P1CQCH        14        63
     A            P1REC5        35         5SPACEB(1)
     A  43N25                             42'ADVICE CHARGE'
     A  43N25     P1ADCH        14        63
     A  44N25                             42'TELEPHONE CHARGE'
     A                                      SPACEB(1)
     A  44N25     P1TLCH        14        63
     A                                     5'BENEFICIARY'
     A                                      SKIPB(32)
     A  45N25                             42'MISCELLANEOUS CHARGE'
     A  45N25     P1MSCH        14        63
      **Start of change AR1070999
     A**********  BNC1          35         5SPACEB(1)                                      AR1070999
     A            P1BFC1        35         5SPACEB(1)
      **End of change AR1070999
      **Start of change AR1079839
     A**39N25***                          42'CHANGE COMMISSION'                            AR1079839
     A**39N25***  P1CHCM        14        63                                               AR1079839
     A  45N25                             42'MISCELLANEOUS CHG1'
     A  45N25     P1M1CH        17        60
      **End of change AR1079839
      **Start of change AR1070999
     A**********  BNC2          35         5SPACEB(1)                                      AR1070999
     A**********  BNC3          35         5SPACEB(1)                                      AR1070999
     A            P1BFC2        35         5SPACEB(1)
      **Start of change AR1079839
     A  45N25                             42'MISCELLANEOUS CHG2'
     A  45N25     P1M2CH        17        60
      **End of change AR1079839
     A            P1BFC3        35         5SPACEB(1)
      **End of change AR1070999
      **Start of change AR1079839
     A  45N25                             42'MISCELLANEOUS CHG3'
     A  45N25     P1M3CH        17        60
     A**49N25***                          42'V.A.T.'                                       AR1079839
     A**49N25***  P1VATT        14        63                                               AR1079839
      **End of change AR1079839
      **Start of change AR1070999
     A**********  BNC4          35         5SPACEB(1)                                      AR1070999
     A            P1BFC4        35         5SPACEB(1)
      **End of change AR1070999
      **Start of change AR1079839
     A  45N25                             42'MISCELLANEOUS CHG4'
     A  45N25     P1M4CH        17        60
     A  45N25                             42'MISCELLANEOUS CHG5'
     A                                      SPACEB(1)
     A  45N25     P1M5CH        17        60
     A*N25******                          42'TOTAL CHARGES'
     A*N25******  P1CCYD    R             57REFFLD(P1CCY *SRC)
     A*N25******  P1TOTC        14        63
     A*N23N25***                          42'NET AMOUNT'
     A*N23N25***  SMCYD     R             54REFFLD(SMCY)
     A*N23N25***  P1NETA        17        60
     A  39N25                             42'CHANGE COMMISSION'
     A                                      SPACEB(1)
     A  39N25     P1CHCM        14        63
     A  49N25                             42'V.A.T.'
     A                                      SPACEB(2)
     A  49N25     P1VATT        14        63
     A N25                                42'TOTAL CHARGES'
     A                                      SPACEB(1)
     A N25        P1CCYD    R             57REFFLD(P1CCY *SRC)
     A N25        P1TOTC        14        63
     A N23N25                             42'NET AMOUNT'
     A N23N25     SMCYD     R             54REFFLD(SMCY)
     A N23N25     P1NETA        17        60
      **End of change AR1079839
     A  23N25 82                          42'CHARGES TO THE DEBIT OF'
      **Start of change AR1070999
     A                                      SPACEB(1)
      **End of change AR1070999
     A                                    +1'ACCOUNT NO.'
      **Start of change AR1070999
     A**********                            SPACEB(1)                                      AR1070999
      **End of change AR1070999
     A                                     5'ACCOUNT WITH BANK'
      **Start of change AR1079839A
     A**********                            SKIPB(41)                                     AR1079839A
     A                                      SKIPB(44)
      **End of change AR1079839A
      **Start of change AR1070999
     A**23N25*82  P1CDRO        21        42                                               AR1070999
     A**23N25*82  P1CDBR    R             63REFFLD(CDBRFT)                                 AR1070999
     A  23N25 82  UMCDRO        35        42
      **End of change AR1070999
     A            P1ACB1        35         5SPACEB(1)
     A            P1ACB2        35         5SPACEB(1)
     A                                    42'VALUE'
     A            P1DATE         7        50
     A            P1ACB3        35         5SPACEB(1)
     A            P1ACB4        35         5SPACEB(1)
     A            P1ACB5        35         5SPACEB(1)
      ** End of change CFT121
     A*****************************************************************
     A** DEBIT ADVICE - OUTGOING PAYMENT (OTPAA)
     A          R FT0560F4                  SKIPB(5)
     A*/COPY WNCPYSRC,FT0560P135
     A  24                                 5'ORDERING CUSTOMER'
     A*/COPY WNCPYSRC,FT0560P113
     A  24        P1ORC1        35         5SPACEB(1)
     A  24        P1ORC2        35         5SPACEB(1)
     A  24        P1ORC3        35         5SPACEB(1)
     A  24        P1ORC4        35         5SPACEB(1)
      ** Start of change CFT032
     A  24        P1ORC5        35         5SPACEB(1)
      ** End of change CFT032
     A*/COPY WNCPYSRC,FT0560P136
     A  24                                42'DATE'
     A                                      SPACEB(2)
     A N24                                42'DATE'
     A                                      SKIPB(11)
     A            RUNA           7        49
     A*/COPY WNCPYSRC,FT0560P137
     A*                                     Start /CPB001/
     A  67                                42'PORTFOLIO'
     A  67                                  SPACEB(1)
     A  67        P1PTFR         3        52
     A*                                     End   /CPB001/
     A*/COPY WNCPYSRC,FT0560P118
      **Start of change 263327
     A**********  P1ORBK        10         5SPACEB(1)                                         263327
     A            P1ORBK        11         5SPACEB(1)
      **End of change 263327
     A*/COPY WNCPYSRC,FT0560P138
      ** Start of change CFT134
      ** Increase field to 47 and use IN86                                                    CFT134
     A  86        P1IBAN        47         5SPACEB(1)
      ** End of change CFT134
     A            P1ABC1        35         5SPACEB(1)
     A*/COPY WNCPYSRC,FT0560P139
     A                                    42'REFERENCE NO.'
     A            PREF          15        60
     A*/COPY WNCPYSRC,FT0560P140
     A            P1ABC2        35         5SPACEB(1)
     A*/COPY WNCPYSRC,FT0560P160
     A            P1ABC3        35         5SPACEB(1)
     A                                    42'D E B I T    A D V I C E'
     A            P1ABC4        35         5SPACEB(1)
     A            P1ABC5        35         5SPACEB(1)
     A*/COPY WNCPYSRC,FT0560P141
     A                                    42'IN RESPECT OF YOUR ORDER TO'
     A*/COPY WNCPYSRC,FT0560P142
     A                                    +1'PAY:'
     A*/COPY WNCPYSRC,FT0560P143
     A                                     5'DETAILS OF PAYMENT'
     A                                      SPACEB(2)
     A*/COPY WNCPYSRC,FT0560P144
     A            DTP1      R              5SPACEB(1)
     A                                    42'AMOUNT'
     A            PCCY      R             50
     A            P1AMNT        17        60
     A*/COPY WNCPYSRC,FT0560P145
     A            DTP2      R              5SPACEB(1)
     A*/COPY WNCPYSRC,FT0560P146
     A  25                                42'LESS CHARGES'
     A*/COPY WNCPYSRC,FT0560P147
     A            DTP3      R              5SPACEB(1)
     A            DTP4      R              5SPACEB(1)
     A  22                                42'RATE'
     A  22        P1RATE        13S 8     63EDTWRD('   0 .        ')
     A*/COPY WNCPYSRC,FT0560P148
     A  22                                42'EQUIVALENT'
     A                                      SPACEB(1)
     A  22        SMCY      R             54
     A  22        P1EQVA        17        60
     A*/COPY WNCPYSRC,FT0560P149
     A  22                                 5'SENDER''S CORRESPONDENT'
     A                                      SPACEB(1)
     A N22                                 5'SENDER''S CORRESPONDENT'
     A                                      SPACEB(2)
     A*                                              */Start of fix S01408/*
     A*/COPY WNCPYSRC,FT0560P108
     A*                                              */End of fix S01408/*
     A            P1SND1        35         5SPACEB(1)
     A N25                                42'CHARGES'
     A N25        P1CCY          3        51
     A            P1SND2        35         5SPACEB(1)
     A*********              Start of Change               /CFT009/
      ***
     A**40N25                             42'TRANSFER COMMISSION'
     A**40N25     P1TRCM        14        63
     A***         P1SND3        35         5SPACEB(1)
     A***                                            */Start of fix S01408/*
     A*/COPY WNCPYSRC,FT0560P105
     A***                                            */End of fix S01408/*
     A**41N25                             42'TELEX CHARGE'
     A***                                            */Start of fix S01408/*
     A*/COPY WNCPYSRC,FT0560P106
     A***                                            */End of fix S01408/*
     A**41N25     P1TXCH        14        63
     A***         P1SND4        35         5SPACEB(1)
     A**42N25                             42'CHEQUE CHARGE'
     A**42N25     P1CQCH        14        63
     A***         P1SND5        35         5SPACEB(1)
     A**46N25                             42'COSTS ABROAD'
     A**46N25     P1CSTA        14        63
     A**47N25                             42'SWIFT PRIORITY CHG'
     A***                                   SPACEB(1)
     A**47N25     P1SPCH        14        63
     A**47N25                              5'BENEFICIARY'
     A***                                   SPACEB(1)
     A*N47
     A*O*25                                 5'BENEFICIARY'
     A***                                   SPACEB(2)
     A**45N25                             42'MISCELLANEOUS CHARGE'
     A**45N25     P1MSCH        14        63
     A********    BNC1      R              5SPACEB(1)      /E23735/
     A********    BNC2      R              5SPACEB(1)      /E23735/
     A***                                                  /E23735/
     A***         P1BEN1        35         5SPACEB(1)
     A*********              Start of Change               /S01494/
     A**39N25 52                          42'FX/CHANGE COMMISSION'
     A**39N25 52  P1CHCM        14        63
     A***                    End of Change                 /S01494/
     A***         P1BEN2        35         5SPACEB(1)
     A*********              Start of Change               /S01499/
     A**49N25 53                          42'V.A.T.'
     A**49N25 53  P1VATT        14        63
     A***                    End of Change                 /S01499/
     A***                                                  /E23735/
      *
             N84
     A  40N25N84                          42'TRANSFER COMMISSION'
     A  40N25N84  P1TRCM        14        63
     A            P1SND3        35         5SPACEB(1)
     A  41N25N84                          42'TELEX CHARGE'
     A  41N25N84  P1TXCH        14        63
     A            P1SND4        35         5SPACEB(1)
     A  42N25N84                          42'CHEQUE CHARGE'
     A  42N25N84  P1CQCH        14        63
     A            P1SND5        35         5SPACEB(1)
     A  46N25N84                          42'COSTS ABROAD'
     A  46N25N84  P1CSTA        14        63
     A  47N25N84                          42'SWIFT PRIORITY CHG'
     A       N84                            SPACEB(1)
     A  47N25N84  P1SPCH        14        63
     A  47N25                              5'BENEFICIARY'
     A                                      SPACEB(1)
     A*/COPY WNCPYSRC,FT0560P150
     A N47
     AO 25                                 5'BENEFICIARY'
     A                                      SPACEB(2)
     A*/COPY WNCPYSRC,FT0560P151
     A  45N25N84                          42'MISCELLANEOUS CHARGE'
     A  45N25N84  P1MSCH        14        63
     A            P1BEN1        35         5SPACEB(1)
     A  39N25 52
     AAN84                                42'FX/CHANGE COMMISSION'
     A  39N25 52
     AAN84        P1CHCM        14        63
     A            P1BEN2        35         5SPACEB(1)
     A  49N25 53
     AAN84                                42'V.A.T.'
     A  49N25 53
     AAN84        P1VATT        14        63
      *
      *********                End of Change               /CFT009/
     A*********              Start of Change               /S01499/
     A*N25*****                           42'TOTAL CHARGES'
     A*N25*****   P1CCYD    R             57REFFLD(P1CCY *SRC)
     A*N25*****   P1TOTC        14        63
     A*                      End of Change                 /S01499/
     A********    BNC3      R              5SPACEB(1)      /E23735/
     A********    BNC4      R              5SPACEB(1)      /E23735/
     A*                                                    /E23735/
     A            P1BEN3        35         5SPACEB(1)
     A*********              Start of Change               /S01499/
     A N25                                42'TOTAL CHARGES'
     A N25        P1CCYD    R             57REFFLD(P1CCY *SRC)
     A N25        P1TOTC        14        63
     A*                      End of Change                 /S01499/
     A            P1BEN4        35         5SPACEB(1)
     A*                                                    /E23735/
     A N23N25                             42'NET AMOUNT'
     A N23N25     SMCYD     R             54REFFLD(SMCY)
     A N23N25     P1NETA        17        60
     A*/COPY WNCPYSRC,FT0560P152
     A********    BNC5      R              5SPACEB(1)      /E23735/
     A*                                                    /E23735/
     A            P1BEN5        35         5SPACEB(1)
     A*                                                    /E23735/
     A*/COPY WNCPYSRC,FT0560P114
     A  23N25                             42'CHARGES TO THE DEBIT OF'
     A                                      SPACEB(1)
     A  23N25                             +1'ACCOUNT NO.'
     A  23N25                              5'ACCOUNT WITH BANK'
     A                                      SPACEB(1)
     A*/COPY WNCPYSRC,FT0560P153
     A N23
     AO 25                                 5'ACCOUNT WITH BANK'
     A                                      SPACEB(2)
     A*/COPY WNCPYSRC,FT0560P154
     A**Start of change CGL029
     A**23N25***  P1CDRO        15        42                                                  CGL029
     A  23N25     P1CDRO        21        42
     A**End of change CGL029
     A*                                                    /S01117/
     A**Start of change CGL029
     A**23N25*28  P1CDBR    R             57REFFLD(CDBRFT)                                    CGL029
     A  23N25 28  P1CDBR    R             63REFFLD(CDBRFT)
     A**End of change CGL029
     A*                                                    /S01117/
     A*/COPY WNCPYSRC,FT0560P115
     A            P1ACB1        35         5SPACEB(1)
     A            P1ACB2        35         5SPACEB(1)
     A*/COPY WNCPYSRC,FT0560P155
     A                                    42'VALUE'
     A            P1DATE         7        50
     A*/COPY WNCPYSRC,FT0560P156
     A            P1ACB3        35         5SPACEB(1)
     A            P1ACB4        35         5SPACEB(1)
     A*/COPY WNCPYSRC,FT0560P121
      *                                              Begin /CFT014/
     A  87                                42'RECEIVER''S CHARGES +
     A                                       REMITTED:'
      *                                              End   /CFT014/
     A            P1ACB5        35         5SPACEB(1)
     A*/COPY WNCPYSRC,FT0560P157
      *                                              Begin /CFT014/
     A  87        P1RCRY         3        56
     A  87        P1RCRM        14        63
      *                                              End   /CFT014/
     A**                                             */Start of fix S01408/*
     A*/COPY WNCPYSRC,FT0560P101
     A**                                             */End of fix S01408/*
     A**                                             */Start of CEU006/*
      *********              Start of Change               /CFT009/
      ** Start of change CFT121
      *
      ** Debit Advice - Outgoing Payment (OTPAA) with CFT121 enabled
      *
     A          R FT0560X4                  SKIPB(5)
     A  24                                 5'ORDERING CUSTOMER'
     A  24        P1ORC1        35         5SPACEB(1)
     A  24        P1ORC2        35         5SPACEB(1)
     A  24        P1ORC3        35         5SPACEB(1)
     A  24        P1ORC4        35         5SPACEB(1)
     A  24                                42'DATE'
     A                                      SPACEB(2)
     A N24                                42'DATE'
     A                                      SKIPB(11)
     A            RUNA           7        49
     A  67                                42'PORTFOLIO'
     A  67                                  SPACEB(1)
     A  67        P1PTFR         3        52
     A            P1ORBK        11         5SPACEB(1)
     A            P1ABC1        35         5SPACEB(1)
     A                                    42'REFERENCE NO.'
     A            PREF          15        60
     A            P1ABC2        35         5SPACEB(1)
     A            P1ABC3        35         5SPACEB(1)
     A                                    42'D E B I T    A D V I C E'
     A            P1ABC4        35         5SPACEB(1)
     A            P1ABC5        35         5SPACEB(1)
     A                                    42'IN RESPECT OF YOUR ORDER TO'
     A                                    +1'PAY:'
     A                                     5'DETAILS OF PAYMENT'
     A                                      SPACEB(2)
     A            DTP1      R              5SPACEB(1)
     A                                    42'AMOUNT'
     A            PCCY      R             50
     A            P1AMNT        17        60
     A            DTP2      R              5SPACEB(1)
     A  25                                42'LESS CHARGES'
     A            DTP3      R              5SPACEB(1)
     A            DTP4      R              5SPACEB(1)
     A  22                                42'RATE'
     A  22        P1RATE        13S 8     63EDTWRD('   0 .        ')
     A  22                                42'EQUIVALENT'
     A                                      SPACEB(1)
     A  22        SMCY      R             54
     A  22        P1EQVA        17        60
     A  22                                 5'SENDER''S CORRESPONDENT'
     A                                      SPACEB(1)
     A N22                                 5'SENDER''S CORRESPONDENT'
     A                                      SPACEB(2)
     A            P1SND1        35         5SPACEB(1)
     A N25N83                             42'CHARGES'
     A N25N83     P1CCY          3        51
     A            P1SND2        35         5SPACEB(1)
     A N83
     A  40N25N84                          42'TRANSFER COMMISSION'
     A N83
     A  40N25N84  P1TRCM        14        63
     A            P1SND3        35         5SPACEB(1)
     A N83
     A  41N25N84                          42'TELEX CHARGE'
     A N83
     A  41N25N84  P1TXCH        14        63
     A            P1SND4        35         5SPACEB(1)
     A N83
     A  42N25N84                          42'CHEQUE CHARGE'
     A N83
     A  42N25N84  P1CQCH        14        63
     A            P1SND5        35         5SPACEB(1)
     A N83
     A  46N25N84                          42'COSTS ABROAD'
     A N83
     A  46N25N84  P1CSTA        14        63
     A N83
     A  47N25N84                          42'SWIFT PRIORITY CHG'
     A                                      SPACEB(1)
     A N83
     A  47N25N84  P1SPCH        14        63
     A  47N25                              5'BENEFICIARY'
     A                                      SPACEB(1)
     A N47
     AO 25                                 5'BENEFICIARY'
     A                                      SPACEB(2)
     A N83
     A  45N25N84                          42'MISCELLANEOUS CHARGE'
     A N83
     A  45N25N84  P1MSCH        14        63
     A            P1BEN1        35         5SPACEB(1)
     A N83N84
     AA 39N25 52                          42'FX/CHANGE COMMISSION'
     A N83N84
     AA 39N25 52  P1CHCM        14        63
     A            P1BEN2        35         5SPACEB(1)
     A N83N84
     AA 49N25 53                          42'V.A.T.'
     A N83N84
     AA 49N25 53  P1VATT        14        63
     A            P1BEN3        35         5SPACEB(1)
     A N25N83                             42'TOTAL CHARGES'
     A N25N83     P1CCYD    R             57REFFLD(P1CCY *SRC)
     A N25N83     P1TOTC        14        63
     A            P1BEN4        35         5SPACEB(1)
     A N23N25                             42'NET AMOUNT'
     A N23N25     SMCYD     R             54REFFLD(SMCY)
     A N23N25     P1NETA        17        60
     A            P1BEN5        35         5SPACEB(1)
     A  23 25                             42'CHARGES TO THE DEBIT OF'
     A                                      SPACEB(1)
     A  23 25                             +1'ACCOUNT NO.'
     A  23 25                              5'ACCOUNT WITH BANK'
     A                                      SPACEB(1)
     A N23
     AON25                                 5'ACCOUNT WITH BANK'
     A                                      SPACEB(2)
     A  23 25 83  UMCDR2        35        42
     A            P1ACB1        35         5SPACEB(1)
     A            P1ACB2        35         5SPACEB(1)
     A                                    42'VALUE'
     A            P1DATE         7        50
     A            P1ACB3        35         5SPACEB(1)
     A            P1ACB4        35         5SPACEB(1)
      *
     A            P1ACB5        35         5SPACEB(1)
      *
     A N25                                 5'SENDER TO RECEIVER INFORMATION'
     A                                      SPACEB(2)
     A            P1BBI1        35         5SPACEB(1)
     A            P1BBI2        35        42
     A            P1BBI3        35         5SPACEB(1)
     A            P1BBI4        35        42
     A            P1BBI5        35         5SPACEB(1)
     A            P1BBI6        35        42
      *
      ** Prevent Charges Remitted from appearing by adding N87
      *
     A  87N87     P1RCRY         3        56
     A  87N87     P1RCRM        14        63
      *
      ** Debit Advice for Charges to DR of A/C Customer - Outgoing Payment (OTPAA)
      *
     A          R FT0560M4                  SKIPB(5)
     A  24        P1ORC1        35         5SPACEB(1)
     A  24        P1ORC2        35         5SPACEB(1)
     A  24        P1ORC3        35         5SPACEB(1)
     A  24        P1ORC4        35         5SPACEB(1)
     A  24                                42'DATE'
     A                                      SPACEB(2)
     A            RUNA           7        49
     A            P1ORBK        11         5SPACEB(1)
     A            P1ABC1        35         5SPACEB(1)
     A                                    42'REFERENCE NO.'
     A            PREF          15        60
     A            P1ABC2        35         5SPACEB(1)
     A            P1ABC3        35         5SPACEB(1)
     A                                    42'D E B I T    A D V I C E'
     A            P1ABC4        35         5SPACEB(1)
     A            P1ABC5        35         5SPACEB(1)
     A                                    42'IN RESPECT OF YOUR ORDER TO'
     A                                    +1'PAY:'
     A                                     5'DETAILS OF PAYMENT'
     A                                      SPACEB(2)
     A            DTP1      R              5SPACEB(1)
     A                                    42'AMOUNT'
     A            PCCY      R             50
     A            P1AMNT        17        60
     A            DTP2      R              5SPACEB(1)
     A  25                                42'LESS CHARGES'
     A            DTP3      R              5SPACEB(1)
     A            DTP4      R              5SPACEB(1)
     A  22                                42'RATE'
     A  22        P1RATE        13S 8     63EDTWRD('   0 .        ')
     A  22                                42'EQUIVALENT'
     A                                      SPACEB(1)
     A  22        SMCY      R             54
     A  22        P1EQVA        17        60
     A  22                                 5'SENDER''S CORRESPONDENT'
     A                                      SPACEB(1)
     A N22                                 5'SENDER''S CORRESPONDENT'
     A                                      SPACEB(2)
     A            P1SND1        35         5SPACEB(1)
     A N25                                42'CHARGES'
     A N25        P1CCY          3        51
     A            P1SND2        35         5SPACEB(1)
     A  40N25                             42'TRANSFER COMMISSION'
     A  40N25     P1TRCM        14        63
     A            P1SND3        35         5SPACEB(1)
     A  41N25                             42'TELEX CHARGE'
     A  41N25     P1TXCH        14        63
     A            P1SND4        35         5SPACEB(1)
     A  42N25                             42'CHEQUE CHARGE'
     A  42N25     P1CQCH        14        63
     A            P1SND5        35         5SPACEB(1)
     A  46N25                             42'COSTS ABROAD'
     A  46N25     P1CSTA        14        63
     A  47N25                             42'SWIFT PRIORITY CHG'
     A                                      SPACEB(1)
     A  47N25     P1SPCH        14        63
      **Start of change 257567
     A    N25                             42'SWIFT STANDARD CHG'
     A                                      SPACEB(1)
     A    N25     P1STCH        17        60
      **End of change 257567
     A  47N25                              5'BENEFICIARY'
     A                                      SPACEB(1)
     A N47
     AO 25                                 5'BENEFICIARY'
     A                                      SPACEB(2)
     A  45N25                             42'MISCELLANEOUS CHARGE'
     A  45N25     P1MSCH        14        63
     A            P1BEN1        35         5SPACEB(1)
      **Start of change 257567
     A    N25                             42'MISCELLANEOUS CHG1'
     A    N25     P1M1CH        17        60
      **End of change 257567
      **Start of change AR1080201
     A**39N25*52                          42'FX/CHANGE COMMISSION'                         AR1080201
     A**39N25*52  P1CHCM        14        63                                               AR1080201
      **End of change AR1080201
     A            P1BEN2        35         5SPACEB(1)
      **Start of change AR1080201
     A    N25                             42'MISCELLANEOUS CHG2'
     A    N25     P1M2CH        17        60
     A**49N25*53                          42'V.A.T.'                                       AR1080201
     A**49N25*53  P1VATT        14        63                                               AR1080201
      **End of change AR1080201
     A            P1BEN3        35         5SPACEB(1)
      **Start of change AR1080201
     A    N25                             42'MISCELLANEOUS CHG3'
     A    N25     P1M3CH        17        60
     A*N25******                          42'TOTAL CHARGES'                                AR1080201
     A*N25******  P1CCYD    R             57REFFLD(P1CCY *SRC)                             AR1080201
     A*N25******  P1TOTC        14        63                                               AR1080201
      **End of change AR1080201
     A            P1BEN4        35         5SPACEB(1)
      **Start of change AR1080201
     A    N25                             42'MISCELLANEOUS CHG4'
     A    N25     P1M4CH        17        60
     A*N23N25***                          42'NET AMOUNT'                                   AR1080201
     A*N23N25***  SMCYD     R             54REFFLD(SMCY)                                   AR1080201
     A*N23N25***  P1NETA        17        60                                               AR1080201
      **End of change AR1080201
     A            P1BEN5        35         5SPACEB(1)
      **Start of change AR1080201
     A    N25                             42'MISCELLANEOUS CHG5'
     A    N25     P1M5CH        17        60
     A**23N25***                          42'CHARGES TO THE DEBIT OF'                      AR1080201
     A**********                            SPACEB(1)                                      AR1080201
     A**23N25***                          +1'ACCOUNT NO.'                                  AR1080201
     A  39N25 52                          42'FX/CHANGE COMMISSION'
     A                                      SPACEB(1)
     A  39N25 52  P1CHCM        14        63
      **End of change AR1080201
     A  23N25                              5'ACCOUNT WITH BANK'
     A                                      SPACEB(1)
     A N23
     AO 25                                 5'ACCOUNT WITH BANK'
     A                                      SPACEB(2)
      **Start of change AR1080201
     A  49N25 53                          42'V.A.T.'
     A  49N25 53  P1VATT        14        63
     A**23N25***  P1CDRO        21        42                                               AR1080201
     A**23N25*28  P1CDBR    R             63REFFLD(CDBRFT)                                 AR1080201
      **End of change AR1080201
     A            P1ACB1        35         5SPACEB(1)
      **Start of change AR1080201
     A N25                                42'TOTAL CHARGES'                                AR1080201
     A N25        P1CCYD    R             57REFFLD(P1CCY *SRC)                             AR1080201
     A N25        P1TOTC        14        63                                               AR1080201
      **End of change AR1080201
     A            P1ACB2        35         5SPACEB(1)
      **Start of change AR1080201
     A N23N25                             42'NET AMOUNT'
     A N23N25     SMCYD     R             54REFFLD(SMCY)
     A N23N25     P1NETA        17        60
     A**********                          42'VALUE'
     A**********  P1DATE         7        50
      **End of change AR1080201
     A            P1ACB3        35         5SPACEB(1)
     A            P1ACB4        35         5SPACEB(1)
      **Start of change AR1080201
     A  23N25                             42'CHARGES TO THE DEBIT OF'                      AR1080201
     A  23N25                             +1'ACCOUNT NO.'                                  AR1080201
      **End of change AR1080201
     A            P1ACB5        35         5SPACEB(1)
      **Start of change AR1080201
     A  23N25     P1CDRO        21        42
     A  23N25 28  P1CDBR    R             63REFFLD(CDBRFT)
     A                                    42'VALUE'
     A                                      SPACEB(1)
     A            P1DATE         7        50
      **End of change AR1080201
      ** End of change CFT121
      ***************************************************************
      **
     A** NOTIFIED DELIVERY/PAY AMOUNT AND EURO CHARGE DETAILS
     A**        R FT0560F5
     A**                                    SKIPB(010)
     A**                                             */Start of 140650/*
     A*Header for record format FT0560F5                               *
     A**                                  42'DATE'
     A**          RUNA           7        49
     A**                                  42'REFERENCE NO.'
     A**                                    SPACEB(002)
     A**Payment reference for Cheques to be Paid and Collected         *
     A**01
     A**O*02        PREFCQ        17        57
     A**Payment reference for Incoming and Outgoing payments           *
     A**03
     A**O*04        PREF          15        60
     A**                                             */End of 140650/*
     A**                                                               *
     A*N54                                 5
     A**                                    'NOTIFIED DELIVERY AMOUNT'
     A**                                             */Start of 140650/*
     A**                                    SPACEB(002)
     A**                                             */End of 140650/*
     A*N54        P1NDCY    R             35
     A**                                    REFFLD(CCY)
     A*N54        P1NDAM    R             39
     A**                                    REFFLD(ZZ013)
     A**                                                               *
     A*N55                                 5
     A**                                    'PAY DELIVERY AMOUNT'
     A**                                    SPACEB(002)
     A*N55        P1PDCY    R             35
     A**                                    REFFLD(CCY)
     A*N55        P1PDAM    R             39
     A**                                    REFFLD(ZZ013)
     A**                                                               *
     A**68                                 5
     A**                                    'CHARGES:'
     A**                                    SPACEB(003)
     A**68                                35
     A**                                    'ENTERED'
     A**                                                               *
     A**68        P1WECY    R             38
     A**                                    REFFLD(CCY)
     A**                                    SPACEB(001)
     A**68        P1ECCY    R             58
     A**                                    REFFLD(CCY)
     A**                                                               *
     A**68                                38
     A**                                    '~~~'
     A**                                    SPACEB(001)
     A**68                                58
     A**                                    '~~~'
     A**                                                               *
     A**56                                 5
     A**                                    'TRANSFER COMMISSION'
     A**                                    SPACEB(002)
     A**56        P1WETC    R             35
     A**                                    REFFLD(ZZ010)
     A**56        P1EUTC    R             55
     A**                                    REFFLD(ZZ010)
     A**                                                               *
     A**57                                 5
     A**                                    'COLLECTION CHARGE'
     A**                                    SPACEB(001)
     A**57        P1WECC    R             35
     A**                                    REFFLD(ZZ010)
     A**57        P1EUCC    R             55
     A**                                    REFFLD(ZZ010)
     A**                                                               *
     A**58                                 5
     A**                                    'COSTS ABROAD'
     A**                                    SPACEB(001)
     A**58        P1WECA    R             35
     A**                                    REFFLD(ZZ010)
     A**58        P1EUCA    R             55
     A**                                    REFFLD(ZZ010)
     A**                                                               *
     A**59                                 5
     A**                                    'TELEX CHARGE'
     A**                                    SPACEB(001)
     A**59        P1WETX    R             35
     A**                                    REFFLD(ZZ010)
     A**59        P1EUTX    R             55
     A**                                    REFFLD(ZZ010)
     A**                                                               *
     A**60                                 5
     A**                                    'CHEQUE CHARGE'
     A**                                    SPACEB(001)
     A**60        P1WECQ    R             35
     A**                                    REFFLD(ZZ010)
     A**60        P1EUCQ    R             55
     A**                                    REFFLD(ZZ010)
     A**                                                               *
     A**61                                 5
     A**                                    'ADVICE CHARGE'
     A**                                    SPACEB(001)
     A**61        P1WEAC    R             35
     A**                                    REFFLD(ZZ010)
     A**61        P1EUAC    R             55
     A**                                    REFFLD(ZZ010)
     A**                                                               *
     A**62                                 5
     A**                                    'TELEPHONE CHARGE'
     A**                                    SPACEB(001)
     A**62        P1WETL    R             35
     A**                                    REFFLD(ZZ010)
     A**62        P1EUTL    R             55
     A**                                    REFFLD(ZZ010)
     A**                                                               *
     A**63                                 5
     A**                                    'MISCELLANEOUS CHARGE'
     A**                                    SPACEB(001)
     A**63        P1WEMC    R             35
     A**                                    REFFLD(ZZ010)
     A**63        P1EUMC    R             55
     A**                                    REFFLD(ZZ010)
     A**                                                               *
     A**64                                 5
     A**                                    'FX/CHANGE COMMISSION'
     A**                                    SPACEB(001)
     A**64        P1WEFX    R             35
     A**                                    REFFLD(ZZ010)
     A**64        P1EUFX    R             55
     A**                                    REFFLD(ZZ010)
     A**                                                               *
     A**65                                 5
     A**                                    'SWIFT PRIORITY CHARGE'
     A**                                    SPACEB(001)
     A**65        P1WESP    R             35
     A**                                    REFFLD(ZZ010)
     A**65        P1EUSP    R             55
     A**                                    REFFLD(ZZ010)
     A**                                                               *
     A**66                                 5
     A**                                    'V.A.T'
     A**                                    SPACEB(001)
     A**66        P1WEVT    R             35
     A**                                    REFFLD(ZZ010)
     A**66        P1EUVT    R             55
     A**                                    REFFLD(ZZ010)
     A**                                                               *
     A**68                                33
     A**                                    '~~~~~~~~~~~~~~'
     A**                                    SPACEB(001)
     A**68                                53
     A**                                    '~~~~~~~~~~~~~~'
     A**                                                               *
     A**68                                 5
     A**                                    'TOTAL'
     A**                                    SPACEB(002)
     A**68        P1WETO    R             35
     A**                                    REFFLD(ZZ010)
     A**68        P1EUTO    R             55
     A**                                    REFFLD(ZZ010)
     A**                                             */End of CEU006/*
      *
      *****************************************************************
      ** NOTIFIED DELIVERY/PAY AMOUNT AND EURO CHARGE DETAILS
      *
      *****************************************************************
     A          R FT0560F5
     A                                      SKIPB(010)
     A**                                             */Start of 140650/*
     A*Header for record format FT0560F5                               *
     A                                    42'DATE'
     A            RUNA           7        49
     A                                    42'REFERENCE NO.'
     A                                      SPACEB(002)
     A* Payment reference for Cheques to be Paid and Collected         *
     A  01
     AO 02        PREFCQ        17        57
     A* Payment reference for Incoming and Outgoing payments           *
     A  03
     AO 04        PREF          15        60
     A**                                             */End of 140650/*
     A*                                                                *
     A N54                                 5
     A                                      'NOTIFIED DELIVERY AMOUNT'
     A**                                             */Start of 140650/*
     A                                      SPACEB(002)
     A**                                             */End of 140650/*
     A N54        P1NDCY    R             35
     A                                      REFFLD(CCY)
     A N54        P1NDAM    R             39
     A                                      REFFLD(ZZ013)
     A*                                                                *
     A N55                                 5
     A                                      'PAY DELIVERY AMOUNT'
     A                                      SPACEB(002)
     A N55        P1PDCY    R             35
     A                                      REFFLD(CCY)
     A N55        P1PDAM    R             39
     A                                      REFFLD(ZZ013)
     A*                                                                *
     A  68                                 5
     A                                      'CHARGES:'
     A                                      SPACEB(003)
     A  68                                35
     A                                      'ENTERED'
     A*                                                                *
     A  68        P1WECY    R             38
     A                                      REFFLD(CCY)
     A                                      SPACEB(001)
     A  68        P1ECCY    R             58
     A                                      REFFLD(CCY)
     A*                                                                *
     A  68                                38
     A                                      '~~~'
     A                                      SPACEB(001)
     A  68                                58
     A                                      '~~~'
     A*                                                                *
     A  56                                 5
     A                                      'TRANSFER COMMISSION'
     A                                      SPACEB(002)
     A  56        P1WETC    R             35
     A                                      REFFLD(ZZ010)
     A  56        P1EUTC    R             55
     A                                      REFFLD(ZZ010)
     A*                                                                *
     A  57                                 5
     A                                      'COLLECTION CHARGE'
     A                                      SPACEB(001)
     A  57        P1WECC    R             35
     A                                      REFFLD(ZZ010)
     A  57        P1EUCC    R             55
     A                                      REFFLD(ZZ010)
     A*                                                                *
     A  58                                 5
     A                                      'COSTS ABROAD'
     A                                      SPACEB(001)
     A  58        P1WECA    R             35
     A                                      REFFLD(ZZ010)
     A  58        P1EUCA    R             55
     A                                      REFFLD(ZZ010)
     A*                                                                *
     A  59                                 5
     A                                      'TELEX CHARGE'
     A                                      SPACEB(001)
     A  59        P1WETX    R             35
     A                                      REFFLD(ZZ010)
     A  59        P1EUTX    R             55
     A                                      REFFLD(ZZ010)
     A*                                                                *
     A  60                                 5
     A                                      'CHEQUE CHARGE'
     A                                      SPACEB(001)
     A  60        P1WECQ    R             35
     A                                      REFFLD(ZZ010)
     A  60        P1EUCQ    R             55
     A                                      REFFLD(ZZ010)
     A*                                                                *
     A  61                                 5
     A                                      'ADVICE CHARGE'
     A                                      SPACEB(001)
     A  61        P1WEAC    R             35
     A                                      REFFLD(ZZ010)
     A  61        P1EUAC    R             55
     A                                      REFFLD(ZZ010)
     A*                                                                *
     A  62                                 5
     A                                      'TELEPHONE CHARGE'
     A                                      SPACEB(001)
     A  62        P1WETL    R             35
     A                                      REFFLD(ZZ010)
     A  62        P1EUTL    R             55
     A                                      REFFLD(ZZ010)
     A*                                                                *
     A  63                                 5
     A                                      'MISCELLANEOUS CHARGE'
     A                                      SPACEB(001)
     A  63        P1WEMC    R             35
     A                                      REFFLD(ZZ010)
     A  63        P1EUMC    R             55
     A                                      REFFLD(ZZ010)
     A*                                                                *
     A  64                                 5
     A                                      'FX/CHANGE COMMISSION'
     A                                      SPACEB(001)
     A  64        P1WEFX    R             35
     A                                      REFFLD(ZZ010)
     A  64        P1EUFX    R             55
     A                                      REFFLD(ZZ010)
     A*                                                                *
     A  65                                 5
     A                                      'SWIFT PRIORITY CHARGE'
     A                                      SPACEB(001)
     A  65        P1WESP    R             35
     A                                      REFFLD(ZZ010)
     A  65        P1EUSP    R             55
     A                                      REFFLD(ZZ010)
     A*                                                                *
     A  66                                 5
     A                                      'V.A.T'
     A                                      SPACEB(001)
     A  66        P1WEVT    R             35
     A                                      REFFLD(ZZ010)
     A  66        P1EUVT    R             55
     A                                      REFFLD(ZZ010)
     A*                                                                *
     A  68                                33
     A                                      '~~~~~~~~~~~~~~'
     A                                      SPACEB(001)
     A  68                                53
     A                                      '~~~~~~~~~~~~~~'
     A*                                                                *
     A  68                                 5
     A                                      'TOTAL'
     A                                      SPACEB(002)
     A  68        P1WETO    R             35
     A                                      REFFLD(ZZ010)
     A  68        P1EUTO    R             55
     A                                      REFFLD(ZZ010)
     A**                                             */End of CEU006/*
      *************************************************************
      *
      ** CHARGES/NOTIFIED DELIVERY/PAY AMOUNT AND EURO CHARGE DETAILS
      *
      *************************************************************
      *
     A          R FT0560G1
     A                                      SKIPB(5)
      ** Header for record format FT0560G1                             *
     A                                     5'DATE'
     A            RUNA           7        10
     A                                    20'REFERENCE NO.'
      ** Payment reference for Cheques to be Paid and Collected        *
     A  01
     AO 02        PREFCQ        17        57
      ** Payment reference for Incoming and Outgoing payments          *
     A  03
     AO 04        PREF          15        60
      ** Payment reference for Incoming and Outgoing 101's/102's       *
     A  05
     AO 06        REFID         18        56
      *                                                                *
     A*N54*****                            5
     A*********                             'NOTIFIED DELIVERY AMOUNT'
     A N54N03                              5'NOTIFIED DELIVERY AMOUNT'
      **Start of change BUG15046
     A N54N03                               SPACEB(002)
      **End of change BUG15046
     A N54 03                              5'INSTRUCTED AMOUNT'
      **Start of change BUG15046
     A**********                            SPACEB(002)                                     BUG15046
     A N54 03                               SPACEB(002)
      **End of change BUG15046
     A N54        P1NDCY    R             35
     A                                      REFFLD(CCY)
     A N54        P1NDAM    R             39
     A                                      REFFLD(ZZ013)
      *                                                                *
     A*N55*****                            5
     A*********                             'PAY DELIVERY AMOUNT'
     A N55N04                              5'PAY DELIVERY AMOUNT'
      **Start of change BUG15046
     A N55N04                               SPACEB(002)
      **End of change BUG15046
     A N55 04                              5'INSTRUCTED AMOUNT'
      **Start of change BUG15046
     A**********                            SPACEB(002)                                     BUG15046
     A N55 04                               SPACEB(002)
     A N55        P1PDCY    R             35
     A                                      REFFLD(CCY)
     A N55        P1PDAM    R             39
     A                                      REFFLD(ZZ013)
      *                                                                *
     A                                     5'CHARGES:'
     A                                      SPACEB(002)
     A*********                           35'CHARGE'
     A  85                                35'VAT?'
     A***********                         50'AMOUNT'
     A                                    55'AMOUNT'
     A**68*******                         62'EQUIV. AMOUNT'
     A  68                                67'EQUIV. AMOUNT'
     A*********                           35'CODE'
     A***********                           SPACEB(1)
     A***********                         50'(CCY)'
     A                                    55'(CCY)'
     A                                      SPACEB(1)
     A**68*******                         62'(EURO)'
     A  68                                67'(EURO)'
      *                                                                *
     A*********** P1CCY     R             50
     A            P1CCY     R             55
     A                                      REFFLD(CCY)
     A                                      SPACEB(001)
     A**68******* P1ECCY    R             62
     A  68        P1ECCY    R             67
     A                                      REFFLD(CCY)
      *                                                                *
     A  40                                 5
     A                                      'TRANSFER COMMISSION'
     A                                      SPACEB(002)
     A  85 40     P1TFVF         1        36
     A  40        P1TRCM        14        46
     A  40 68     P2EUTC        14        64
      *                                                                *
     A  48                                 5
     A                                      'COLLECTION CHARGE'
     A                                      SPACEB(001)
     A  48 40     P1CLVF         1        36
     A  48        P1CLCH        14        46
     A  48 68     P2EUCC        14        64
      *                                                                *
     A  46                                 5
     A                                      'COSTS ABROAD'
     A                                      SPACEB(001)
     A  46 40     P1CAVF         1        36
     A  46        P1CSTA        14        46
     A  46 68     P2EUCA        14        64
      *                                                                *
     A  41                                 5
     A                                      'TELEX CHARGE'
     A                                      SPACEB(001)
     A  41 40     P1TXVF         1        36
     A  41        P1TXCH        14        46
     A  41 68     P2EUTX        14        64
      *                                                                *
     A  42                                 5
     A                                      'CHEQUE CHARGE'
     A                                      SPACEB(001)
     A  42 40     P1CQVF         1        36
     A  42        P1CQCH        14        46
     A  42 68     P2EUCQ        14        64
      *                                                                *
     A  43                                 5
     A                                      'ADVICE CHARGE'
     A                                      SPACEB(001)
     A  43 40     P1ADVF         1        36
     A  43        P1ADCH        14        46
     A  43 68     P2EUAC        14        64
      *                                                                *
     A  44                                 5
     A                                      'TELEPHONE CHARGE'
     A                                      SPACEB(001)
     A  44 40     P1TLVF         1        36
     A  44        P1TLCH        14        46
     A  44 68     P2EUTL        14        64
      *                                                                *
     A  45                                 5
     A                                      'MISCELLANEOUS CHARGE'
     A                                      SPACEB(001)
     A  45 40     P1MSVF         1        36
     A  45        P1MSCH        14        46
     A  45 68     P2EUMC        14        64
      *                                                                *
     A  39                                 5
     A                                      'FX/CHANGE COMMISSION'
     A                                      SPACEB(001)
     A  39 40     P1FXVF         1        36
     A  39        P1CHCM        14        46
     A  39 68     P2EUFX        14        64
      *                                                                *
     A  47                                 5
     A                                      'SWIFT PRIORITY CHARGE'
     A                                      SPACEB(001)
     A  47 40     P1SPVF         1        36
     A  47        P1SPCH        14        46
     A  47 68     P2EUSP        14        64
      *                                                                *
     A  76                                 5
     A                                      'SWIFT STANDARD CHARGE'
     A                                      SPACEB(001)
     A  76 40     P1STVF         1        36
     A  76        P1STCH        17        43
     A  76 68     P1EUST        14        64
      *                                                                *
     A  77                                 5
     A                                      'MISCELLANEOUS CHARGE 1'
     A                                      SPACEB(001)
     A  77 40     P1M1VF         1        36
     A  77        P1M1CH        17        43
     A  77 68     P1EUM1        14        64
      *                                                                *
     A  77                                 5
     A                                      'MISCELLANEOUS CHARGE 2'
     A                                      SPACEB(001)
     A  77 40     P1M2VF         1        36
     A  77        P1M2CH        17        43
     A  77 68     P1EUM2        14        64
      *                                                                *
     A  77                                 5
     A                                      'MISCELLANEOUS CHARGE 3'
     A                                      SPACEB(001)
     A  77 40     P1M3VF         1        36
     A  77        P1M3CH        17        43
     A  77 68     P1EUM3        14        64
      *                                                                *
     A  77                                 5
     A                                      'MISCELLANEOUS CHARGE 4'
     A                                      SPACEB(001)
     A  77 40     P1M4VF         1        36
     A  77        P1M4CH        17        43
     A  77 68     P1EUM4        14        64
      *                                                                *
     A  77                                 5
     A                                      'MISCELLANEOUS CHARGE 5'
     A                                      SPACEB(001)
     A  77 40     P1M5VF         1        36
     A  77        P1M5CH        17        43
     A  77 68     P1EUM5        14        64
      *                                                                *
     A  78                                 5
     A                                      'CORRESPONDENTS CHARGE'
     A                                      SPACEB(001)
     A  78 40     P1CRVF         1        36
     A  78        P1CRCH        17        43
     A  78 68     P1EUCR        14        64
      *                                                                *
     A  79                                 5'DEDUCTIONS CHARGE'
     A                                      SPACEB(001)
     A  79 40     P1DEVF         1        36
     A  79        P1DECH        17        43
     A  79 68     P1EUDE        14        64
      *                                                                *
     A     85                              5'VAT TOTAL'
     A                                      SPACEB(001)
     A     85     P1VATA        15        45
     A     85 68  P1VATE        15        63
      *                                                                *
     A                                     5'TOTAL CHARGES'
     A                                      SPACEB(002)
     A            P1WTOT        17        43
     A  68        P1WEUT        14        64
      *                                              Begin /CFT014/
     A  87                                 5'Receiver''s Charges +
     A                                       Remitted'
     A                                      SPACEB(3)
     A  87        P5RCRY         3        30SPACEB(1)
     A  87        P5RCRM        14        35
     A  87        P1ERCY         3        55
     A  87        P1ERCM        14        60
     A  75                                 5'Sender''s Charges +
     A                                       Deducted'
     A                                      SPACEB(2)
     A  75        P5SCY1         3        30SPACEB(1)
     A  75        P5SCH1        14        35
     A  75        P1ECY1         3        55
     A  75        P1ESC1        14        60
     A  75        P5SCY2         3        30SPACEB(1)
     A  75        P5SCH2        14        35
     A  75        P1ECY2         3        55
     A  75        P1ESC2        14        60
     A  75        P5SCY3         3        30SPACEB(1)
     A  75        P5SCH3        14        35
     A  75        P1ECY3         3        55
     A  75        P1ESC3        14        60
     A  75        P5SCY4         3        30SPACEB(1)
     A  75        P5SCH4        14        35
     A  75        P1ECY4         3        55
     A  75        P1ESC4        14        60
     A  75        P5SCY5         3        30SPACEB(1)
     A  75        P5SCH5        14        35
     A  75        P1ECY5         3        55
     A  75        P1ESC5        14        60
      *                                              End   /CFT014/
      *
      ****************************************************************
      *********              End of Change                 /CFT009/
     A          R FT0560F6                  SKIPB(7)
     A                                    31'C R E D I T    A D V I C E'
     A                                      SPACEA(2)
     A                                     5'BENEFICIARY'
     A            DST1      R              5SPACEB(1)
     A            P1DST1        35         5SPACEB(1)
     A            P1DST2        35         5SPACEB(1)
     A            P1DST3        35         5SPACEB(1)
     A            P1DST4        35         5SPACEB(1)
     A                                    42'DATE'
     A            RUNA           7        49
     A                                    42'REFERENCE NO.'
     A                                      SPACEB(1)
     A            PREF          15        60
     A                                     5'DETAILS OF PAYMENT'
     A                                      SPACEB(2)
     A            DTP1      R              5SPACEB(1)
     A            DTP2      R              5SPACEB(1)
     A                                    42'AMOUNT'
     A            PCCY      R             50
     A            P1AMNT        17        60
     A            DTP3      R              5SPACEB(1)
     A            DTP4      R              5SPACEB(1)
     A  22                                42'RATE'
     A  22        P1RATE        13S 8     63EDTWRD('   0 .        ')
     A  22                                42'EQUIVALENT'
     A                                      SPACEB(1)
     A  22        SMCY      R             54
     A  22        P1EQVA        17        60
     A  25                                42'CHARGES'
     A                                      SPACEB(1)
     A  25        P1CCY          3        51
     A*********              Start of Change               /CFT009/
      ***
     A**40 25                             42'TRANSFER COMMISSION'
     A***                                   SPACEB(1)
     A**40 25     P1TRCM        14        63
     A**41 25                             42'TELEX CHARGE'
     A***                                   SPACEB(1)
     A**41 25     P1TXCH        14        63
     A**42 25                             42'CHEQUE CHARGE'
     A***                                   SPACEB(1)
     A**42 25     P1CQCH        14        63
     A**46 25                             42'COST ABROAD'
     A***                                   SPACEB(1)
     A**46 25     P1CSTA        14        63
     A**47 25                             42'SWIFT PRIORITY CHG'
     A***                                   SPACEB(1)
     A**47 25     P1SPCH        14        63
     A**47 25                              5'ORDERING CUSTOMER'
     A***                                   SPACEB(1)
     A*N44
      **********             Start of Change               /211243/
     A*ON25*****                           5'ORDERING CUSTOMER'
      **********             End of Change                 /211243/
     A***                                   SPACEB(2)
     A**45 25                             42'MISCELLANEOUS CHARGE'
     A**45 25     P1MSCH        14        63
     A***         P1CUS1        35         5SPACEB(1)
     A***         P1CUS2        35         5SPACEB(1)
      *
     A  40   N84                          42'TRANSFER COMMISSION'
     A       N84                            SPACEB(1)
     A  40   N84  P1TRCM        14        63
     A  41   N84                          42'TELEX CHARGE'
     A       N84                            SPACEB(1)
     A  41   N84  P1TXCH        14        63
     A  42   N84                          42'CHEQUE CHARGE'
     A       N84                            SPACEB(1)
     A  42   N84  P1CQCH        14        63
     A  46   N84                          42'COST ABROAD'
     A       N84                            SPACEB(1)
     A  46   N84  P1CSTA        14        63
     A  47   N84                          42'SWIFT PRIORITY CHG'
     A       N84                            SPACEB(1)
     A  47   N84  P1SPCH        14        63
     A  47                                 5'ORDERING CUSTOMER'
     A                                      SPACEB(1)
     A N44
???  AON25                                 5'ORDERING CUSTOMER'
     A                                      SPACEB(2)
     A  45   N84                          42'MISCELLANEOUS CHARGE'
     A  45   N84  P1MSCH        14        63
     A            P1CUS1        35         5SPACEB(1)
     A            P1CUS2        35         5SPACEB(1)
      *
      *********                End of Change               /CFT009/
     A  25                                42'TOTAL CHARGES'
     A  25        P1CCYD    R             57REFFLD(P1CCY *SRC)
     A  25        P1TOTC        14        63
     A            P1CUS3        35         5SPACEB(1)
     A            P1CUS4        35         5SPACEB(1)
     A N23 25                             42'NET AMOUNT'
     A N23 25     PCCYD     R             54REFFLD(PCCY)
     A N23 25     P1NETA        17        60
     A*
     A            P1CUS5        35         5SPACEB(1)
     A  23 25                             42'CHARGES TO THE DEBIT OF'
     A                                      SPACEB(1)
     A  23 25                             +1'ACCOUNT NO.'
     A  23 25                              5'ORDERING BANK'
     A                                      SPACEB(1)
     A N23
     AON25                                 5'ORDERING BANK'
     A                                      SPACEB(2)
     A**Start of change CGL029
     A**23*25***  P1CDRO        15        42                                                  CGL029
     A**23*25*28  P1CDBR    R             57REFFLD(CDBRFT)                                    CGL029
     A  23 25     P1CDRO        21        42
     A  23 25 28  P1CDBR    R             63REFFLD(CDBRFT)
     A**End of change CGL029
     A            P1ORB1        35         5SPACEB(1)
     A            P1ORB2        35         5SPACEB(1)
     A                                    42'VALUE'
     A            P1PDAT         7        50
     A            P1ORB3        35         5SPACEB(1)
     A            P1ORB4        35         5SPACEB(1)
     A*/COPY WNCPYSRC,FT0560P159
     A*                                              */End of fix CFT003/*
      *                                              */Start of CFT006/*
      ****************************************************************
      **  Credit Advice - Incoming payment (FT101HL3)
      ****************************************************************
     A          R FT0560F7                  SKIPB(5)
     A                                    31'C R E D I T    A D V I C E'
     A                                      SPACEA(2)
     A                                     5'BENEFICIARY'
     A            P7TBNA        35         5SPACEB(1)
     A            P7TBNB        35         5SPACEB(1)
     A            P7TBNC        35         5SPACEB(1)
     A                                    42'DATE'
     A            RUNA           7        49
     A            P7TBND        35         5SPACEB(1)
     A            P7TBNE        35         5SPACEB(1)
     A                                    42'REFERENCE NO.'
     A            PRFTID        15        62
     A                                    42'SENDERS REF'
     A                                      SPACEB(1)
     A            PSNDRF        16        62
     A                                    42'TRANSACTION REF NO.'
     A                                      SPACEB(1)
     A            PTRNID        16        62
     A                                     5'DETAILS OF PAYMENT - '
     A                                      SPACEB(1)
     A                                     5'REMITTANCE INFO'
     A                                      SPACEB(1)
     A            P7TRMA        35         5SPACEB(1)
     A                                    42'IN RESPECT OF A REQUEST FOR'
     A                                    +1'TRANSFER FOR:'
     A            P7TRMB        35         5SPACEB(1)
     A                                    42'AMOUNT'
     A            P7PCCY         3        62
     A            P7PAMT        15        67
     A            P7TRMC        35         5SPACEB(1)
     A            P7TRMD        35         5SPACEB(1)
      *
      *********              Start of Change               /CFT009/
      ***
     A***                                 42'LESS CHARGES'
     A***                                 42'CHARGES CCY'
     A***                                   SPACEB(1)
     A***         P7RPCY         3        62
     A***                                  5'INTERMEDIARY'
     A***                                   SPACEB(1)
     A***                                 42'RECIEVERS CHG'
     A***         P7RPCH        14        67
     A***         P7TIN1        35         5SPACEB(1)
     A***         P7TIN2        35         5SPACEB(1)
      *
     A N84                                42'LESS CHARGES'
     A N84                                42'CHARGES CCY'
     A N84                                  SPACEB(1)
     A N84        P7RPCY         3        62
     A                                     5'INTERMEDIARY'
     A                                      SPACEB(1)
     A N84                                42'RECIEVERS CHG'
     A N84        P7RPCH        14        67
     A            P7TIN1        35         5SPACEB(1)
     A            P7TIN2        35         5SPACEB(1)
     A                                    42'TOTAL CHARGES'
     A  84        P1CCY          3        62
     A            P7TOCH        15        67
      *
      *********                End of Change               /CFT009/
      *
     A            P7TIN3        35         5SPACEB(1)
     A            P7TIN4        35         5SPACEB(1)
     A                                    42'TOTAL AMT CREDITED'
     A            P7TOCY         3        62
     A            P7TOAM        15        67
     A            P7TIN5        35         5SPACEB(1)
     A                                    42'~~~~~~~~~~~~~~~~~~'
     A                                     5'ORDERING CUSTOMER'
     A                                      SPACEB(2)
     A            P7HCS1        35         5SPACEB(1)
     A            P7HCS2        35         5SPACEB(1)
     A            P7HCS3        35         5SPACEB(1)
     A            P7HCS4        35         5SPACEB(1)
     A            P7HCS5        35         5SPACEB(1)
     A                                     5'AMOUNT TO BE DEBITED FROM'
     A                                      SPACEB(2)
     A                                    42'EXCH RATE'
     A            P7RATE        13S 8     67EDTWRD('   0 .        ')
     A                                     5'ACCT SERVICING INSTITUTION'
     A                                      SPACEB(1)
     A                                    42'AMT TRANSFERRED'
     A            P7TCCY         3        62
     A            P7TAMT        15        67
     A            P7TASI        35         5SPACEB(1)
     A            P7TACC        11         5SPACEB(1)
     A                                    42'CR VALUE DATE'
     A            P7CRDT         6        58
     A*
      ****************************************************************
      **  Debit Advice - Outgoing payment (FT101HL3)
      ****************************************************************
     A          R FT0560F8                  SKIPB(5)
     A                                    31'D E B I T    A D V I C E'
     A                                      SPACEA(2)
     A                                     5'ORDERING CUSTOMER'
     A            P8HCS1        35         5SPACEB(1)
     A            P8HCS2        35         5SPACEB(1)
     A            P8HCS3        35         5SPACEB(1)
     A                                    42'DATE'
     A            RUNA           7        49
     A            P8HCS4        35         5SPACEB(1)
     A            P8HCS5        35         5SPACEB(1)
     A                                    42'REFERENCE NO.'
     A            PRFTID        15        60
     A                                    42'SENDERS REF'
     A                                      SPACEB(1)
     A            PSNDRF        16        60
     A                                    42'CUSTOMERS REF'
     A                                      SPACEB(1)
     A            PCUSTR        16        60
     A                                    42'TRANSACTION REF'
     A                                      SPACEB(1)
     A            PTRNID        16        60
     A                                     5'DETAILS OF PAYMENT - '
     A                                      SPACEB(1)
     A                                     5'REMITTANCE INFO'
     A                                      SPACEB(1)
     A                                    42'IN RESPECT OF YOUR REQUEST'
     A                                    +1'FOR TRANSFER TO PAY:'
     A            P8TRMA        35         5SPACEB(1)
     A                                    42'AMOUNT'
     A            P8OCCY         3        58
     A            P8OAMT        15        64
     A            P8TRMB        35         5SPACEB(1)
     A            P8TRMC        35         5SPACEB(1)
     A                                    42'AMT TRANSFERRED'
     A            P8TCCY         3        58
     A            P8TAMT        15        64
     A            P8TRMD        35         5SPACEB(1)
      *
      *********              Start of Change               /CFT009/
      ***
     A***                                 42'PLUS CHARGES'
     A***                                 42'CHARGES CCY'
     A***                                   SPACEB(1)
     A***         P8RTCY         3        58
     A***                                 42'RECIEVERS CHARGES'
     A***                                   SPACEB(1)
     A***         P8RTCH        13        64
     A***                                  5'INSTRUCTING PARTY'
     A***                                   SPACEB(2)
     A***                                 42'TOTAL CHARGES'
     A***         P8TOCH        14        64
      *
     A N84                                42'PLUS CHARGES'
     A N84                                42'CHARGES CCY'
     A N84                                  SPACEB(1)
     A N84        P8RTCY         3        58
     A N84                                42'RECIEVERS CHARGES'
     A N84                                  SPACEB(1)
     A N84        P8RTCH        13        64
     A                                     5'INSTRUCTING PARTY'
     A                                      SPACEB(2)
     A                                    42'TOTAL CHARGES'
     A  84        P1CCY          3        58
     A            P8TOCH        14        64
      *
      *********                End of Change               /CFT009/
      *
     A            P8INPY        35         5SPACEB(1)
     A                                    42'TOT AMT DEBITED'
     A                                      SPACEB(1)
     A            P8NCCY         3        58
     A            P8NAMT        17        64
     A                                    42'~~~~~~~~~~~~~~~'
     A                                      SPACEB(1)
     A                                     5'BENEFICIARY'
     A                                      SPACEB(2)
     A            P8TBNA        35         5SPACEB(1)
     A                                    42'EXCH RATE'
     A            P8RATE        13S 8     63EDTWRD('   0 .        ')
     A            P8TBNB        35         5SPACEB(1)
     A                                    42'PAYMENT AMT'
     A            P8PCCY         3        58
     A            P8PAMT        15        64
     A            P8TBNC        35         5SPACEB(1)
     A            P8TBND        35         5SPACEB(1)
     A            P8TBNE        35         5SPACEB(1)
     A                                    42'DB VALUE DATE'
     A            P8DBDT         6        57
      ****************************************************************
      **  Credit Advice - Incoming payment (FT102HL3)
      ****************************************************************
     A          R FT0560F9                  SKIPB(5)
     A                                    31'C R E D I T    A D V I C E'
     A                                      SPACEA(2)
     A                                     5'BENEFICIARY'
     A            P9BEN1        35         5SPACEB(1)
     A            P9BEN2        35         5SPACEB(1)
     A            P9BEN3        35         5SPACEB(1)
     A                                    42'DATE'
     A            RUNA           7        49
     A            P9BEN4        35         5SPACEB(1)
     A            P9BEN5        35         5SPACEB(1)
     A                                    42'REFERENCE NO.'
     A            PCCTID        15        62
     A                                    42'FILE REF'
     A                                      SPACEB(1)
     A            PFILRF        16        62
     A                                    42'TRANSACTION REF NO.'
     A                                      SPACEB(1)
     A            PTRNID        16        62
     A                                     5'DETAILS OF PAYMENT - '
     A                                      SPACEB(1)
     A                                     5'REMITTANCE INFO'
     A                                      SPACEB(1)
     A            P9REM1        35         5SPACEB(1)
     A                                    42'IN RESPECT OF A REQUEST FOR'
     A                                    +1'TRANSFER FOR:'
     A            P9REM2        35         5SPACEB(1)
     A                                    42'AMOUNT'
     A            P9PCCY         3        62
     A            P9PAMT        15        67
     A            P9REM3        35         5SPACEB(1)
     A            P9REM4        35         5SPACEB(1)
      *
      *********              Start of Change               /CFT009/
      ***
     A***                                 42'LESS CHARGES'
     A***                                 42'CHARGES CCY'
     A***                                   SPACEB(1)
     A***         P9CHCY         3        62
     A***                                  5'SENDING INSTITUTION'
     A***                                   SPACEB(1)
     A***                                 42'RECIEVERS CHG'
     A***         P9RPCH        14        67
     A***         P9SINS        35         5SPACEB(1)
     A***                                 42'SENDERS CHG'
     A***                                   SPACEB(1)
     A***         P9SPCH        14        67
     A***                                  5'ORDERING INSTITUTION'
     A***                                   SPACEB(1)
     A***         P9OIN1        35         5
     A***                                   SPACEB(1)
     A***                                 42'TOTAL CHARGES'
     A***         P9TOCH        15        67
      *
     A N84                                42'LESS CHARGES'
     A N84                                42'CHARGES CCY'
     A N84                                  SPACEB(1)
     A N84        P9CHCY         3        62
     A                                     5'SENDING INSTITUTION'
     A                                      SPACEB(1)
     A N84                                42'RECIEVERS CHG'
     A N84        P9RPCH        14        67
     A            P9SINS        35         5SPACEB(1)
     A N84                                42'SENDERS CHG'
     A N84                                  SPACEB(1)
     A N84        P9SPCH        14        67
     A**Start of Change CSW201
     A N84 81 07                          42'SENDERS CHG 2'
     A N84 81 07                            SPACEB(1)
     A N84 81 07  P9SPC2        14        67
     A N84 81 08                          42'SENDERS CHG 3'
     A N84 81 08                            SPACEB(1)
     A N84 81 08  P9SPC3        14        67
     A N84 81 09                          42'SENDERS CHG 4'
     A N84 81 09                            SPACEB(1)
     A N84 81 09  P9SPC4        14        67
     A N84 81 10                          42'SENDERS CHG 5'
     A N84 81 10                            SPACEB(1)
     A N84 81 10  P9SPC5        14        67
     A**End of Change CSW201
     A                                     5'ORDERING INSTITUTION'
     A                                      SPACEB(1)
     A            P9OIN1        35         5
     A                                      SPACEB(1)
     A                                    42'TOTAL CHARGES'
     A  84        P1CCY          3        62
     A            P9TOCH        15        67
      *
      *********                End of Change               /CFT009/
      *
     A            P9OIN2        11         5
     A                                      SPACEB(1)
     A                                    42'TOTAL AMT CREDITED'
     A                                      SPACEB(1)
     A            P9TOCY         3        62
     A            P9TOAM        15        67
     A                                    42'~~~~~~~~~~~~~~~~~~'
     A                                      SPACEB(1)
     A                                     5'SENDERS CORRESPONDENT'
     A                                      SPACEB(1)
     A            P9SCOR        35         5SPACEB(1)
     A                                     5'RECIEVERS CORRESPONDENT'
     A                                      SPACEB(3)
     A            P9RCOR        35         5SPACEB(1)
     A                                     5'ORDERING CUSTOMER'
     A                                      SPACEB(3)
     A            P9OCS1        35         5SPACEB(1)
     A                                    42'EXCH RATE'
     A            P9RATE        13S 8     67EDTWRD('   0 .        ')
     A            P9OCS2        35         5SPACEB(1)
     A                                    42'AMT TRANSFERRED'
     A            P9TCCY         3        62
     A            P9TAMT        15        67
     A            P9OCS3        35         5SPACEB(1)
     A            P9OCS4        35         5SPACEB(1)
     A                                    42'CR VALUE DATE'
     A            P9CRDT         6        58
     A**Start of Change CSW207
     A            P9OCS5        35         5SPACEB(1)
     A**End of Change CSW207
     A*
      ****************************************************************
      **  Debit Advice - Outgoing payment (FT102HL3)
      ****************************************************************
     A          R FT0560F0                  SKIPB(5)
     A                                    31'D E B I T    A D V I C E'
     A                                      SPACEA(2)
     A                                     5'ORDERING CUSTOMER'
     A            P0OCS1        35         5SPACEB(1)
     A            P0OCS2        35         5SPACEB(1)
     A            P0OCS3        35         5SPACEB(1)
     A                                    42'DATE'
     A            RUNA           7        49
     A            P0OCS4        35         5SPACEB(1)
     A                                    42'REFERENCE NO.'
     A            PCCTID        15        60
     A**Start of Change CSW207
     A            P0OCS5        35         5SPACEB(1)
     A**End of Change CSW207
     A                                    42'FILE REF'
     A**Start of Change CSW207
     A**********                            SPACEB(1)                                         CSW207
     A**End of Change CSW207
     A            PFILRF        16        60
     A                                    42'TRANSACTION REF'
     A                                      SPACEB(1)
     A            PTRNID        16        60
     A                                     5'DETAILS OF PAYMENT - '
     A                                      SPACEB(1)
     A                                     5'REMITTANCE INFO'
     A                                      SPACEB(1)
     A                                    42'IN RESPECT OF YOUR REQUEST FOR'
     A                                    42'A CUSTOMER CR TRANSFER:'
     A                                      SPACEB(1)
     A            P0REM1        35         5SPACEB(1)
     A                                    42'AMOUNT'
     A            P0TCCY         3        58
     A            P0TAMT        15        64
     A            P0REM2        35         5SPACEB(1)
     A            P0REM3        35         5SPACEB(1)
      *
      *********              Start of Change               /CFT009/
      *
     A***                                 42'PLUS CHARGES'
     A***         P0REM4        35         5SPACEB(1)
     A***                                 42'CHARGES CCY'
     A***                                   SPACEB(1)
     A***         P0CHCY         3        58
     A***                                 42'RECIEVERS CHARGES'
     A***                                   SPACEB(1)
     A***         P0RTCH        13        64
     A***                                  5'SENDING INSTITUTION'
     A***                                   SPACEB(1)
     A***                                 42'SENDERS CHARGES'
     A***         P0SINS        35         5SPACEB(1)
     A***         P0STCH        13        64
     A***                                   SPACEB(1)
     A***                                 42'TOTAL CHARGES'
     A***         P0TOCH        14        64
      *
     A N84                                42'PLUS CHARGES'
     A            P0REM4        35         5SPACEB(1)
     A N84                                42'CHARGES CCY'
     A N84                                  SPACEB(1)
     A N84        P0CHCY         3        58
     A N84                                42'RECIEVERS CHARGES'
     A N84                                  SPACEB(1)
     A N84        P0RTCH        13        64
     A                                     5'SENDING INSTITUTION'
     A                                      SPACEB(1)
     A N84                                42'SENDERS CHARGES'
     A            P0SINS        35         5SPACEB(1)
     A N84        P0STCH        13        64
     A**Start of Change CSW201
     A N84 81 07                          42'SENDERS CHARGES 2'
     A N84 81 07                            SPACEB(1)
     A N84 81 07  P0STC2        13        64
     A N84 81 08                          42'SENDERS CHARGES 3'
     A N84 81 08                            SPACEB(1)
     A N84 81 08  P0STC3        13        64
     A N84 81 09                          42'SENDERS CHARGES 4'
     A N84 81 09                            SPACEB(1)
     A N84 81 09  P0STC4        13        64
     A N84 81 10                          42'SENDERS CHARGES 5'
     A N84 81 10                            SPACEB(1)
     A N84 81 10  P0STC5        13        64
     A*N84******                            SPACEB(1)                                         CSW201
     A**End of Change CSW201
     A                                    42'TOTAL CHARGES'
     A**Start of Change CSW201
     A                                      SPACEB(1)
     A**End of Change CSW201
     A  84        P1CCY          3        58
     A            P0TOCH        14        64
      *
      *********                End of Change               /CFT009/
      *
     A                                     5'ORDERING INSTITUTION'
     A                                      SPACEB(1)
     A                                    42'TOT AMT DEBITED'
     A            P0NCCY         3        58
     A            P0NAMT        17        64
     A            P0OIN1        35         5
     A                                      SPACEB(1)
     A                                    42'~~~~~~~~~~~~~~~'
     A            P0OIN2        35         5
     A                                      SPACEB(1)
     A                                     5'SENDERS CORRESPONDENT'
     A                                      SPACEB(1)
     A            P0SCOR        35         5SPACEB(1)
     A                                     5'RECIEVERS CORRESPONDENT'
     A                                      SPACEB(2)
     A            P0RCOR        35         5SPACEB(1)
     A                                     5'BENEFICIARY'
     A                                      SPACEB(2)
     A            P0BEN1        35         5SPACEB(1)
     A                                    42'EXCH RATE'
     A            P0RATE        13S 8     63EDTWRD('   0 .        ')
     A            P0BEN2        35         5SPACEB(1)
     A                                    42'PAYMENT AMT'
     A            P0PCCY         3        58
     A            P0PAMT        15        64
     A            P0BEN3        35         5SPACEB(1)
     A            P0BEN4        35         5SPACEB(1)
     A            P0BEN5        35         5SPACEB(1)
     A                                    42'DB VALUE DATE'
     A            P0DBDT         6        57
      *                                              */End of CFT006/  *
      **Start of change CER030
     A          R P1HEDRD                   SPACEB(2)
     A  83                                  SKIPB(5)
      *
     A  83                                42'DATE'
     A  83        RUNA           7        49
     A  83                                42'REFERENCE NO.'
     A  83                                  SPACEB(002)
     A  83        PREF          15        60
     A  83                                  SPACEA(002)
      *
     A  83                                42'D E B I T    A D V I C E'
     A  83                                  SPACEA(002)
      *
     A                                     5'EXTENDED NARRATIVE+
     A                                      (DEBIT):'
      *
     A          R P1EXTNRD                  SPACEB(1)
     A            EXTNRD        70A       10
      *
     A          R P2HEDRC                   SPACEB(2)
     A  82                                  SKIPB(5)
      *
     A  82                                42'DATE'
     A  82        RUNA           7        49
     A  82                                42'REFERENCE NO.'
     A  82                                  SPACEB(002)
     A  82        PREF          15        60
     A  82                                  SPACEA(002)
      *
      **Start of change BUG24277
     A**82*04N03                          42'D E B I T    A D V I C E'                      BUG24277
     A**82*04N03                            SPACEA(002)                                     BUG24277
     A**82*03***                          42'C R E D I T    A D V I C E'                    BUG24277
     A**82*03***                            SPACEA(002)                                     BUG24277
     A  82 04
     AO 82 03                             42'C R E D I T    A D V I C E'
     A  82 04
     AO 82 03                               SPACEA(002)
      **End of change BUG24277
      *
     A                                     5'EXTENDED NARRATIVE+
     A                                      (CREDIT):'
      *
     A          R P2EXTNRC                  SPACEB(1)
     A            EXTNRC        70A       10
      **End of change CER030
