      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD180                                                    *
/*EXI *  TEXT('Midas OF Modelo 193 Report Production')                *
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  PRTF/RE000009P1 - Midas OF Modelo 193 Report Production      *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2015            *
      *                                                               *
      *  Last Amend No. CRE104   *CREATE   Date 08Apr15               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CRE104 - Modelo 123 and 193 Reports                          *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
      *--------------------------------*
      **  Report Header1 Record Format *
      *--------------------------------*
      *
     A          R HEADER1
     A                                      SKIPB(001)
     A                                    11
     A                                      '__________________________________-
     A                                      __________________________________'
     A                                    81
     A                                      '__________________________________-
     A                                      ___________________________________-
     A                                      ___________________'
     A                                   171
     A                                      '__________'
     A                                    11
     A                                      '|'
     A                                      SPACEB(001)
     A                                    13
     A                                      'Delegación de'
     A                                    28
     A                                      '__________________________________-
     A                                      _______________'
     A                                    78
     A                                      '|'
     A                                    81
     A                                      '|'
     A                                    83
     A                                      'Impuesto sobre la Renta de las Per-
     A                                      sonas Físicas'
     A                                   168
     A                                      '|'
     A                                   171
     A                                      '|'
     A                                   173
     A                                      'Modelo'
     A                                   180
     A                                      '|'
     A                                    11
     A                                      '|'
     A                                      SPACEB(001)
     A                                    78
     A                                      '|'
     A                                    81
     A                                      '|'
     A                                    83
     A                                      'Retenciones e ingresos a cuenta so-
     A                                      bre determ. rendimientos del capita-
     A                                      l mobiliario(*)'
     A                                   168
     A                                      '|'
     A                                   171
     A                                      '|'
     A                                   173
     A                                      '193'
     A                                   180
     A                                      '|'
     A                                    11
     A                                      '|'
     A                                      SPACEB(001)
     A                                    13
     A                                      'Administración de'
     A                                    56
     A                                      'Código Administración'
     A                                    78
     A                                      '|'
     A                                    81
     A                                      '|'
     A                                    83
     A                                      'Impuesto  sobre Sociedades e Impue-
     A                                      sto  sobre la Renta de no'
     A                                   168
     A                                      '|'
     A                                   171
     A                                      '|'
     A                                   180
     A                                      '|'
     A                                    11
     A                                      '|'
     A                                      SPACEB(001)
     A                                    +1
     A                                      '__________________________________-
     A                                      _______'
     A                                    56
     A                                      '_____________________'
     A                                    78
     A                                      '|'
     A                                    81
     A                                      '|'
     A                                    83
     A                                      'Residentes  (establecimientos perm-
     A                                      anentes)'
     A                                   168
     A                                      '|'
     A                                   171
     A                                      '|'
     A                                   180
     A                                      '|'
     A                                    11
     A                                      '|'
     A                                      SPACEB(001)
     A                                    78
     A                                      '|'
     A                                    81
     A                                      '|'
     A                                    83
     A                                      'Retenciones e ingresos a cuenta so-
     A                                      bre determinadas rentas (*)        -
     A                                        Resumen Anual'
     A                                   168
     A                                      '|'
     A                                   171
     A                                      '|'
     A                                   180
     A                                      '|'
     A                                    11
     A                                      '|_________________________________-
     A                                      _________________________________|'
     A                                      SPACEB(001)
     A                                    81
     A                                      '|_________________________________-
     A                                      ___________________________________-
     A                                      __________________|'
     A                                   171
     A                                      '|________|'
     A                                     2
     A                                      '_______'
     A                                      SPACEB(001)
     A                                    +2
     A                                      '__________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      __'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     5
     A                                      'D'
     A                                     8
     A                                      '|'
     A                                    11
     A                                      '|'
     A                                   116
     A                                      '|'
     A                                   124
     A                                      'N.I.F.'
     A            PTNIF1         9A  O    +2
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     5
     A                                      'e'
     A                                     8
     A                                      '|'
     A                                    11
     A                                      '|'
     A                                   116
     A                                      '|'
     A                                   122
     A                                      'Teléfono'
     A            PTTEL          9A  O   132
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     5
     A                                      'c'
     A                                     8
     A                                      '|'
     A                                    11
     A                                      '|'
     A                                   116
     A                                      '|'
     A                                   119
     A                                      '__________________________________-
     A                                      ____________________________'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     5
     A                                      'l'
     A                                     8
     A                                      '|'
     A                                    11
     A                                      '|'
     A                                   116
     A                                      '|'
     A                                   119
     A                                      '|'
     A                                   122
     A                                      'Ejercicio .................'
     A            PTYEAR         4A  O   151
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   +25
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     5
     A                                      'a'
     A                                     8
     A                                      '|'
     A                                    11
     A                                      '|'
     A                                   116
     A                                      '|'
     A                                   119
     A                                      '|'
     A                                   122
     A                                      'Modalidad  de presentación:'
     A                                   +31
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     5
     A                                      'r'
     A                                     8
     A                                      '|'
     A                                    11
     A                                      '|'
     A                                   116
     A                                      '|'
     A                                   119
     A                                      '|'
     A                                   122
     A                                      'Impreso .....................'
     A                                   153
     A                                      '__'
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     5
     A                                      'a'
     A                                     8
     A                                      '|'
     A                                    11
     A                                      '|'
     A                                   116
     A                                      '|'
     A                                   119
     A                                      '|'
     A                                   122
     A                                      'Soporte .....................'
     A                                    +2
     A                                      'T'
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     5
     A                                      'n'
     A                                     8
     A                                      '|'
     A                                    11
     A                                      '|'
     A                                    13
     A                                      'N.I.F.'
     A            PTNIF2         9A  O    21
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   116
     A                                      '|'
     A                                    +2
     A                                      '|'
     A                                   +60
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     5
     A                                      't'
     A                                     8
     A                                      '|'
     A                                    11
     A                                      '|'
     A                                    13
     A                                      'APELLIDOS Y NOMBRE(por este orden)-
     A                                      ,  RAZÓN SOCIAL O DENOMINACIÓN'
     A                                   116
     A                                      '|'
     A                                    +2
     A                                      '|_________________________________-
     A                                      ___________________________|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     5
     A                                      'e'
     A                                     8
     A                                      '|'
     A                                    11
     A                                      '|'
     A            PTNAME        40A  O    13
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   116
     A                                      '|'
     A                                    +2
     A                                      '|'
     A                                   122
     A                                      'Nº de justificante:'
     A            PTTAXR        13A  O   143
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|_____|'
     A                                      SPACEB(001)
     A                                    +2
     A                                      '|_________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      _|'
     A                                   119
     A                                      '|_________________________________-
     A                                      ___________________________|'
     A                                     2
     A                                      '__________________________________-
     A                                      _____________________'
     A                                      SPACEB(046)
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Declaración complementaria o susti-
     A                                      tutiva'
     A                                   +12
     A                                      '|'
     A                                     2
     A                                      '|_________________________________-
     A                                      ____________________|______________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      _____'
     A                                      SPACEB(001)
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Si la presentación de esta declara-
     A                                      ción tiene por objeto incluir perce-
     A                                      pciones que, debiendo haber figurad-
     A                                      o en otra declaración del mismo eje-
     A                                      rcicio presentada anteriormente,'
     A                                    +5
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'hubieran sido completamente omitid-
     A                                      as en la misma, marque con una "X" -
     A                                      la casilla "Declaración complementa-
     A                                      ria".'
     A                                   +67
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Cuando la presentación de esta dec-
     A                                      laración tenga por objeto anular y -
     A                                      sustituir completamente a otra decl-
     A                                      aración anterior del mismo ejercici-
     A                                      o en la cual se hubieran consig-'
     A                                    +5
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'nado datos inexactos o erróneos, i-
     A                                      ndique su carácter de declaración s-
     A                                      ustitutiva marcando con una "X" la -
     A                                      casilla correspondiente.'
     A                                   +48
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'En ambos casos, se hará constar a -
     A                                      continuación el número de 13 dígito-
     A                                      s identificativo de la declaración -
     A                                      del mismo ejercicio anteriormente p-
     A                                      resentada o el de la última de'
     A                                    +7
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'ellas, si se hubieran presentado v-
     A                                      arias.'
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Declaración complementaria por inc-
     A                                      lusión de datos ...'
     A                                    59
     A                                      '__'
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Declaración sustitutiva ..........-
     A                                      ...................'
     A            PTSUST         1A  O    59
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                    80
     A                                      'Número identificativo de la declar-
     A                                      ación anterior'
     A            PTTAXP        13A  O    +2
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   +37
     A                                      '|'
     A                                     2
     A                                      '|_________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ____|'
     A                                      SPACEB(001)
     A                                     2
     A                                      '__________________________________-
     A                                      ___________________________'
     A                                      SPACEB(003)
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Resumen de los datos incluidos en -
     A                                      la declaración'
     A                                   +10
     A                                      '|'
     A                                     2
     A                                      '|_________________________________-
     A                                      __________________________|________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      _____'
     A                                      SPACEB(001)
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     6
     A                                      'N.º Total de Perceptores'
     A                                   +13
     A                                      'Base retenciones e ingresos a cuen-
     A                                      ta'
     A                                   +13
     A                                      'Retenciones e ingresos a cuenta'
     A                                   +13
     A                                      'Retenciones e ingresos a cuenta in-
     A                                      gresados'
     A                                    +2
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                    +3
     A                                      '[01]'
     A            PTCOUNT        9S  O    19
     A                                      EDTWRD('   .   .   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                    43
     A                                      '[02]'
     A  53        PTGROSS3      15S  O    60
     A                                      EDTWRD('   .   .   . 0 ,   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  52        PTGROSS2      15S  O    59
     A                                      EDTWRD(' .   .   .   . 0 ,  ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  51        PTGROSS1      15S  O    59
     A                                      EDTWRD('  .   .   .   . 0 , ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  50        PTGROSS0      15S  O    60
     A                                      EDTWRD('   .   .   .   . 0 ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
      *
     A                                    92
     A                                      '[03]'
     A  53        PTWTAX3       15S  O   104
     A                                      EDTWRD('   .   .   . 0 ,   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  52        PTWTAX2       15S  O    99
     A                                      EDTWRD(' .   .   .   . 0 ,  ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  51        PTWTAX1       15S  O   103
     A                                      EDTWRD('  .   .   .   . 0 , ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  50        PTWTAX0       15S  O   104
     A                                      EDTWRD('   .   .   .   . 0 ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   136
      *
     A                                      '[04]'
     A  53        PTHTAX3       15S  O   159
     A                                      EDTWRD('   .   .   . 0 ,   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  52        PTHTAX2       15S  O   158
     A                                      EDTWRD(' .   .   .   . 0 ,  ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  51        PTHTAX1       15S  O   158
     A                                      EDTWRD('  .   .   .   . 0 , ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  50        PTHTAX0       15S  O   159
     A                                      EDTWRD('   .   .   .   . 0 ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                    +0
     A                                      '__________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___'
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                    92
     A                                      'Importe gastos'
     A                                   +74
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                    +3
     A                                      'Gastos art. 26.1.a) Ley del IRPF .-
     A                                      ...................................-
     A                                      ............'
     A                                    +5
     A                                      '[05]'
     A                                    +2
     A                                      '___________________'
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|_________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ____|'
     A                                      SPACEB(001)
     A                                     4
     A                                      '(*)  Los rendimientos del capital -
     A                                      mobiliario y las rentas a que se re-
     A                                      fiere el contenido de este modelo s-
     A                                      e especifican en el apartado "Cuest-
     A                                      iones generales" que aparece en'
     A                                      SPACEB(002)
     A                                     4
     A                                      'las instrucciones para cumplimenta-
     A                                      r el modelo que se acompañan a éste-
     A                                      .'
     A                                      SPACEB(001)
     A                                     7
     A                                      'Agencia  Tributaria'
     A                                      SPACEB(005)
     A                                    51
     A                                      'La autenticidad de este documento -
     A                                      puede ser comprobada mediante el Có-
     A                                      digo Seguro'
     A                                    55
     A                                      'de Verificación MWHJNMDH2YX3N8A4 e-
     A                                      n https://www.agenciatributaria.gob-
     A                                      .es'
     A                                      SPACEB(001)
      *
      *--------------------------------*
      **  Report Detail Record Format *
      *--------------------------------*
      *
     A          R DETAIL
     A                                      SKIPB(001)
     A                                    39
     A                                      '__________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      __________'
     A                                   170
     A                                      '__________'
     A                                     6
     A                                      'Agencia  Tributaria'
     A                                      SPACEB(001)
     A                                    39
     A                                      '|'
     A                                    41
     A                                      'Retenciones e ingresos a cuenta  I-
     A                                      .R.P.F., Impuesto  sobre'
     A                                   111
     A                                      'Relación de perceptores'
     A                                   152
     A                                      '|'
     A                                   170
     A                                      '|'
     A                                   172
     A                                      'Modelo'
     A                                   179
     A                                      '|'
     A                                    39
     A                                      '|'
     A                                      SPACEB(001)
     A                                    41
     A                                      'Sociedades  e Impuesto  sobre la R-
     A                                      enta de no Residentes'
     A                                   152
     A                                      '|'
     A                                   170
     A                                      '|'
     A                                   172
     A                                      '193'
     A                                   179
     A                                      '|'
     A                                    39
     A                                      '|'
     A                                      SPACEB(001)
     A                                    41
     A                                      '(establecimientos permanentes)'
     A                                   152
     A                                      '|'
     A                                   170
     A                                      '|'
     A                                   179
     A                                      '|'
     A                                    39
     A                                      '|_________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      _________|'
     A                                      SPACEB(001)
     A                                   170
     A                                      '|________|'
     A                                     2
     A                                      '__________________________________-
     A                                      ___________________'
     A                                      SPACEB(001)
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Datos identificativos de esta hoja'
     A                                    54
     A                                      '|'
     A                                     2
     A                                      '|_________________________________-
     A                                      __________________|________________-
     A                                      ______________'
     A                                      SPACEB(001)
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                    10
     A                                      'N.I.F. del declarante'
     A                                    42
     A                                      'Ejercicio'
     A                                    62
     A                                      'Hoja nº'
     A                                    84
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A            PTNIFA         9A  O    10
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A            PTYEARA        4A  O    42
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                    62
     A                                      '__ / __'
     A                                    84
     A                                      '|'
     A                                     2
     A                                      '|_________________________________-
     A                                      ___________________________________-
     A                                      _____________|'
     A                                      SPACEB(001)
     A                                   124
     A                                      'Nº de justificante'
     A            PTTAXRA       13A  O   144
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                     2
     A                                      '________________________'
     A                                      SPACEB(001)
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Perceptor'
     A                                    +1
     A                                      '1'
     A                                   +10
     A                                      '|'
     A                                     2
     A                                      '|______________________|__________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      _____'
     A                                      SPACEB(001)
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   162
     A                                      'Provincia'
     A                                    +9
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'N.I.F. perceptor'
     A                                    30
     A                                      'N.I.F. representante'
     A                                   +11
     A                                      'Apellidos y nombre, razón social o-
     A                                       denominación del perceptor'
     A                                   +15
     A                                      'Mediador'
     A                                   163
     A                                      '(Código)'
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A            PTNIFC1        9A  O     4
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   +17
     A                                      '____________________'
     A            PTCUST1       40A  O    61
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   +36
     A                                      '________'
     A            PTZIP1         2A  O   +23
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Clave código'
     A                                    23
     A                                      'Código emisor'
     A                                   +15
     A                                      'Clave perc.'
     A                                   +14
     A                                      'Naturaleza'
     A                                   +14
     A                                      'Pago'
     A                                   +12
     A                                      'Tipo código'
     A                                   +12
     A                                      'Código cuenta valores'
     A                                   +20
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                    +1
     A                                      '__'
     A                                    +0
     A                                      '__________'
     A                                    +7
     A                                      '_____________'
     A            PTCLAVE1       1A  O   +15
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A            PTPERC1        2A  O   +31
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   +15
     A                                      '____'
     A                                   +12
     A                                      '___________'
     A                                   +12
     A                                      '_____________________'
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'PTE.'
     A                                    22
     A                                      'Ejerc. devengo'
     A                                   +11
     A                                      'Tipo perc.'
     A                                   +11
     A                                      'Importe percepciones'
     A                                   +15
     A                                      'Importe reducciones'
     A                                   +58
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                    +1
     A                                      '____'
     A                                   +14
     A                                      '______________'
     A            PTTIPO1        1A  O   +19
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  53N60     PTCGROSS31    13S  O    71
     A                                      EDTWRD(' .   .   . 0 ,   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  52N60     PTCGROSS21    13S  O    71
     A                                      EDTWRD('  .   .   . 0 ,  ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  51N60     PTCGROSS11    13S  O    71
     A                                      EDTWRD('   .   .   . 0 , ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  50N60     PTCGROSS01    13S  O    71
     A                                      EDTWRD(' .   .   .   . 0 ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  60        PTCGROSSAA    13S  O    71
     A                                      EDTWRD(' .   .   .   .   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   103
     A                                      '___________________'
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Base retenciones e ingresos a cuen-
     A                                      ta'
     A                                    64
     A                                      '% retención'
     A                                   +20
     A                                      'Retenciones e ingresos a cuenta'
     A                                   +54
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
      *
     A  53N61     PTDTAX31      13S  O   109
     A                                      EDTWRD(' .   .   . 0 ,   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  52N61     PTDTAX21      13S  O   109
     A                                      EDTWRD('  .   .   . 0 ,  ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  51N61     PTDTAX11      13S  O   109
     A                                      EDTWRD('   .   .   . 0 , ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  50N61     PTDTAX01      13S  O   109
     A                                      EDTWRD(' .   .   .   . 0 ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  61        PTDTAXAA      13S  O   109
     A                                      EDTWRD(' .   .   .   .   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
      *
     A            PTRATE1        4S  O    70
     A                                      EDTWRD('  ,  ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
      *
     A  53N62     PTCTAX31      13S  O    23
     A                                      EDTWRD(' .   .   . 0 ,   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  52N62     PTCTAX21      13S  O    23
     A                                      EDTWRD('  .   .   . 0 ,  ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  51N62     PTCTAX11      13S  O    23
     A                                      EDTWRD('   .   .   . 0 , ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  50N62     PTCTAX01      13S  O    23
     A                                      EDTWRD(' .   .   .   . 0 ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  62        PTCTAXAA      13S  O    23
     A                                      EDTWRD(' .   .   .   .   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|_________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ____|'
     A                                      SPACEB(001)
     A                                     2
     A                                      '________________________'
     A                                      SPACEB(002)
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Perceptor'
     A                                    +1
     A                                      '2'
     A                                   +10
     A                                      '|'
     A                                     2
     A                                      '|______________________|__________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      _____'
     A                                      SPACEB(001)
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   162
     A                                      'Provincia'
     A                                    +9
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'N.I.F. perceptor'
     A                                    30
     A                                      'N.I.F. representante'
     A                                   +11
     A                                      'Apellidos y nombre, razón social o-
     A                                       denominación del perceptor'
     A                                   +15
     A                                      'Mediador'
     A                                   163
     A                                      '(Código)'
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A            PTNIFC2        9A  O     4
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   +17
     A                                      '____________________'
     A            PTCUST2       40A  O    61
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   +36
     A                                      '________'
     A            PTZIP2         2A  O   +23
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Clave código'
     A                                    23
     A                                      'Código emisor'
     A                                   +15
     A                                      'Clave perc.'
     A                                   +14
     A                                      'Naturaleza'
     A                                   +14
     A                                      'Pago'
     A                                   +12
     A                                      'Tipo código'
     A                                   +12
     A                                      'Código cuenta valores'
     A                                   +20
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                    +1
     A                                      '__'
     A                                    +0
     A                                      '__________'
     A                                    +7
     A                                      '_____________'
     A            PTCLAVE2       1A  O   +15
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A            PTPERC2        2A  O   +32
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   +14
     A                                      '____'
     A                                   +12
     A                                      '___________'
     A                                   +12
     A                                      '_____________________'
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'PTE.'
     A                                    22
     A                                      'Ejerc. devengo'
     A                                   +11
     A                                      'Tipo perc.'
     A                                   +11
     A                                      'Importe percepciones'
     A                                   +15
     A                                      'Importe reducciones'
     A                                   +58
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                    +1
     A                                      '____'
     A                                   +14
     A                                      '______________'
     A            PTTIPO2        1A  O   +19
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  53N63     PTCGROSS32    13S  O    71
     A                                      EDTWRD(' .   .   . 0 ,   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  52N63     PTCGROSS22    13S  O    71
     A                                      EDTWRD('  .   .   . 0 ,  ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  51N63     PTCGROSS12    13S  O    71
     A                                      EDTWRD('   .   .   . 0 , ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  50N63     PTCGROSS02    13S  O    71
     A                                      EDTWRD(' .   .   .   . 0 ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  63        PTCGROSSBB    13S  O    71
     A                                      EDTWRD(' .   .   .   .   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   103
     A                                      '___________________'
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Base retenciones e ingresos a cuen-
     A                                      ta'
     A                                    64
     A                                      '% retención'
     A                                   +20
     A                                      'Retenciones e ingresos a cuenta'
     A                                   +54
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
      *
     A  53N64     PTCTAX32      13S  O    23
     A                                      EDTWRD(' .   .   . 0 ,   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  52N64     PTCTAX22      13S  O    23
     A                                      EDTWRD('  .   .   . 0 ,  ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  51N64     PTCTAX12      13S  O    23
     A                                      EDTWRD('   .   .   . 0 , ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  50N64     PTCTAX02      13S  O    23
     A                                      EDTWRD(' .   .   .   . 0 ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  64        PTCTAXBB      13S  O    23
     A                                      EDTWRD(' .   .   .   .   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
      *
     A            PTRATE2        4S  O    70
     A                                      EDTWRD('  ,  ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
      *
     A  53N65     PTDTAX32      13S  O   109
     A                                      EDTWRD(' .   .   . 0 ,   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  52N65     PTDTAX22      13S  O   109
     A                                      EDTWRD('  .   .   . 0 ,  ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  51N65     PTDTAX12      13S  O   109
     A                                      EDTWRD('   .   .   . 0 , ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  50N65     PTDTAX02      13S  O   109
     A                                      EDTWRD(' .   .   .   . 0 ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  65        PTDTAXBB      13S  O   109
     A                                      EDTWRD(' .   .   .   .   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|_________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ____|'
     A                                      SPACEB(001)
     A                                     2
     A                                      '________________________'
     A                                      SPACEB(002)
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Perceptor'
     A                                    +1
     A                                      '3'
     A                                   +10
     A                                      '|'
     A                                     2
     A                                      '|______________________|__________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      _____'
     A                                      SPACEB(001)
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   162
     A                                      'Provincia'
     A                                    +9
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'N.I.F. perceptor'
     A                                    30
     A                                      'N.I.F. representante'
     A                                   +11
     A                                      'Apellidos y nombre, razón social o-
     A                                       denominación del perceptor'
     A                                   +15
     A                                      'Mediador'
     A                                   163
     A                                      '(Código)'
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A            PTNIFC3        9A  O     4
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   +17
     A                                      '____________________'
     A            PTCUST3       40A  O    61
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   +36
     A                                      '________'
     A            PTZIP3         2A  O   +23
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Clave código'
     A                                    23
     A                                      'Código emisor'
     A                                   +15
     A                                      'Clave perc.'
     A                                   +14
     A                                      'Naturaleza'
     A                                   +14
     A                                      'Pago'
     A                                   +12
     A                                      'Tipo código'
     A                                   +12
     A                                      'Código cuenta valores'
     A                                   +20
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                    +1
     A                                      '__'
     A                                    +0
     A                                      '__________'
     A                                    +7
     A                                      '_____________'
     A            PTCLAVE3       1A  O   +15
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A            PTPERC3        2A  O   +32
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   +14
     A                                      '____'
     A                                   +12
     A                                      '___________'
     A                                   +12
     A                                      '_____________________'
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'PTE.'
     A                                    22
     A                                      'Ejerc. devengo'
     A                                   +11
     A                                      'Tipo perc.'
     A                                   +11
     A                                      'Importe percepciones'
     A                                   +15
     A                                      'Importe reducciones'
     A                                   +58
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                    +1
     A                                      '____'
     A                                   +14
     A                                      '______________'
     A            PTTIPO3        1A  O   +19
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  53N66     PTCGROSS33    13S  O    71
     A                                      EDTWRD(' .   .   . 0 ,   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  52N66     PTCGROSS23    13S  O    71
     A                                      EDTWRD('  .   .   . 0 ,  ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  51N66     PTCGROSS13    13S  O    71
     A                                      EDTWRD('   .   .   . 0 , ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  50N66     PTCGROSS03    13S  O    71
     A                                      EDTWRD(' .   .   .   . 0 ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  66        PTCGROSSCC    13S  O    71
     A                                      EDTWRD(' .   .   .   .   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   103
     A                                      '___________________'
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Base retenciones e ingresos a cuen-
     A                                      ta'
     A                                    64
     A                                      '% retención'
     A                                   +20
     A                                      'Retenciones e ingresos a cuenta'
     A                                   +54
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
      *
     A  53N67     PTCTAX33      13S  O    23
     A                                      EDTWRD(' .   .   . 0 ,   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  52N67     PTCTAX23      13S  O    23
     A                                      EDTWRD('  .   .   . 0 ,  ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  51N67     PTCTAX13      13S  O    23
     A                                      EDTWRD('   .   .   . 0 , ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  50N67     PTCTAX03      13S  O    23
     A                                      EDTWRD(' .   .   .   . 0 ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  67        PTCTAXCC      13S  O    23
     A                                      EDTWRD(' .   .   .   .   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
      *
     A            PTRATE3        4S  O    70
     A                                      EDTWRD('  ,  ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
      *
     A  53N68     PTDTAX33      13S  O   109
     A                                      EDTWRD(' .   .   . 0 ,   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  52N68     PTDTAX23      13S  O   109
     A                                      EDTWRD('  .   .   . 0 ,  ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  51N68     PTDTAX13      13S  O   109
     A                                      EDTWRD('   .   .   . 0 , ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  50N68     PTDTAX03      13S  O   109
     A                                      EDTWRD(' .   .   .   . 0 ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  68        PTDTAXCC      13S  O   109
     A                                      EDTWRD(' .   .   .   .   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|_________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ____|'
     A                                      SPACEB(001)
     A                                     2
     A                                      '________________________'
     A                                      SPACEB(002)
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Perceptor'
     A                                    +1
     A                                      '4'
     A                                   +10
     A                                      '|'
     A                                     2
     A                                      '|______________________|__________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      _____'
     A                                      SPACEB(001)
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   162
     A                                      'Provincia'
     A                                    +9
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'N.I.F. perceptor'
     A                                    30
     A                                      'N.I.F. representante'
     A                                   +11
     A                                      'Apellidos y nombre, razón social o-
     A                                       denominación del perceptor'
     A                                   +15
     A                                      'Mediador'
     A                                   163
     A                                      '(Código)'
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A            PTNIFC4        9A  O     4
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   +17
     A                                      '____________________'
     A            PTCUST4       40A  O    61
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   +36
     A                                      '________'
     A            PTZIP4         2A  O   +23
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Clave código'
     A                                    23
     A                                      'Código emisor'
     A                                   +15
     A                                      'Clave perc.'
     A                                   +14
     A                                      'Naturaleza'
     A                                   +14
     A                                      'Pago'
     A                                   +12
     A                                      'Tipo código'
     A                                   +12
     A                                      'Código cuenta valores'
     A                                   +20
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                    +1
     A                                      '__'
     A                                    +0
     A                                      '__________'
     A                                    +7
     A                                      '_____________'
     A            PTCLAVE4       1A  O   +15
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A            PTPERC4        2A  O   +32
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   +14
     A                                      '____'
     A                                   +12
     A                                      '___________'
     A                                   +12
     A                                      '_____________________'
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'PTE.'
     A                                    22
     A                                      'Ejerc. devengo'
     A                                   +11
     A                                      'Tipo perc.'
     A                                   +11
     A                                      'Importe percepciones'
     A                                   +15
     A                                      'Importe reducciones'
     A                                   +58
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                    +1
     A                                      '____'
     A                                   +14
     A                                      '______________'
     A            PTTIPO4        1A  O   +19
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  53N69     PTCGROSS34    13S  O    71
     A                                      EDTWRD(' .   .   . 0 ,   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  52N69     PTCGROSS24    13S  O    71
     A                                      EDTWRD('  .   .   . 0 ,  ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  51N69     PTCGROSS14    13S  O    71
     A                                      EDTWRD('   .   .   . 0 , ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  50N69     PTCGROSS04    13S  O    71
     A                                      EDTWRD(' .   .   .   . 0 ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  69        PTCGROSSDD    13S  O    71
     A                                      EDTWRD(' .   .   .   .   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   103
     A                                      '___________________'
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Base retenciones e ingresos a cuen-
     A                                      ta'
     A                                    64
     A                                      '% retención'
     A                                   +20
     A                                      'Retenciones e ingresos a cuenta'
     A                                   +54
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
      *
     A  53N70     PTCTAX34      13S  O    23
     A                                      EDTWRD(' .   .   . 0 ,   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  52N70     PTCTAX24      13S  O    23
     A                                      EDTWRD('  .   .   . 0 ,  ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  51N70     PTCTAX14      13S  O    23
     A                                      EDTWRD('   .   .   . 0 , ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  50N70     PTCTAX04      13S  O    23
     A                                      EDTWRD(' .   .   .   . 0 ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  70        PTCTAXDD      13S  O    23
     A                                      EDTWRD(' .   .   .   .   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
      *
     A            PTRATE4        4S  O    70
     A                                      EDTWRD('  ,  ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
      *
     A  53N71     PTDTAX34      13S  O   109
     A                                      EDTWRD(' .   .   . 0 ,   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  52N71     PTDTAX24      13S  O   109
     A                                      EDTWRD('  .   .   . 0 ,  ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  51N71     PTDTAX14      13S  O   109
     A                                      EDTWRD('   .   .   . 0 , ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  50N71     PTDTAX04      13S  O   109
     A                                      EDTWRD(' .   .   .   . 0 ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  71        PTDTAXDD      13S  O   109
     A                                      EDTWRD(' .   .   .   .   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|_________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ____|'
     A                                      SPACEB(001)
     A                                     2
     A                                      '________________________'
     A                                      SPACEB(002)
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Perceptor'
     A                                    +1
     A                                      '5'
     A                                   +10
     A                                      '|'
     A                                     2
     A                                      '|______________________|__________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      _____'
     A                                      SPACEB(001)
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   162
     A                                      'Provincia'
     A                                    +9
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'N.I.F. perceptor'
     A                                    30
     A                                      'N.I.F. representante'
     A                                   +11
     A                                      'Apellidos y nombre, razón social o-
     A                                       denominación del perceptor'
     A                                   +15
     A                                      'Mediador'
     A                                   163
     A                                      '(Código)'
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A            PTNIFC5        9A  O     4
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   +17
     A                                      '____________________'
     A            PTCUST5       40A  O    61
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   +36
     A                                      '________'
     A            PTZIP5         2A  O   +23
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Clave código'
     A                                    23
     A                                      'Código emisor'
     A                                   +15
     A                                      'Clave perc.'
     A                                   +14
     A                                      'Naturaleza'
     A                                   +14
     A                                      'Pago'
     A                                   +12
     A                                      'Tipo código'
     A                                   +12
     A                                      'Código cuenta valores'
     A                                   +20
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                    +1
     A                                      '__'
     A                                    +0
     A                                      '__________'
     A                                    +7
     A                                      '_____________'
     A            PTCLAVE5       1A  O   +15
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A            PTPERC5        2A  O   +32
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   +14
     A                                      '____'
     A                                   +12
     A                                      '___________'
     A                                   +12
     A                                      '_____________________'
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'PTE.'
     A                                    22
     A                                      'Ejerc. devengo'
     A                                   +11
     A                                      'Tipo perc.'
     A                                   +11
     A                                      'Importe percepciones'
     A                                   +15
     A                                      'Importe reducciones'
     A                                   +58
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                    +1
     A                                      '____'
     A                                   +14
     A                                      '______________'
     A            PTTIPO5        1A  O   +19
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  53N72     PTCGROSS35    13S  O    71
     A                                      EDTWRD(' .   .   . 0 ,   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  52N72     PTCGROSS25    13S  O    71
     A                                      EDTWRD('  .   .   . 0 ,  ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  51N72     PTCGROSS15    13S  O    71
     A                                      EDTWRD('   .   .   . 0 , ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  50N72     PTCGROSS05    13S  O    71
     A                                      EDTWRD(' .   .   .   . 0 ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  72        PTCGROSSEE    13S  O    71
     A                                      EDTWRD(' .   .   .   .   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   103
     A                                      '___________________'
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Base retenciones e ingresos a cuen-
     A                                      ta'
     A                                    64
     A                                      '% retención'
     A                                   +20
     A                                      'Retenciones e ingresos a cuenta'
     A                                   +54
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
      *
     A  53N73     PTCTAX35      13S  O    23
     A                                      EDTWRD(' .   .   . 0 ,   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  52N73     PTCTAX25      13S  O    23
     A                                      EDTWRD('  .   .   . 0 ,  ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  51N73     PTCTAX15      13S  O    23
     A                                      EDTWRD('   .   .   . 0 , ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  50N73     PTCTAX05      13S  O    23
     A                                      EDTWRD(' .   .   .   . 0 ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  73        PTCTAXEE      13S  O    23
     A                                      EDTWRD(' .   .   .   .   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
      *
     A            PTRATE5        4S  O    70
     A                                      EDTWRD('  ,  ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
      *
     A  53N74     PTDTAX35      13S  O   109
     A                                      EDTWRD(' .   .   . 0 ,   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  52N74     PTDTAX25      13S  O   109
     A                                      EDTWRD('  .   .   . 0 ,  ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  51N74     PTDTAX15      13S  O   109
     A                                      EDTWRD('   .   .   . 0 , ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  50N74     PTDTAX05      13S  O   109
     A                                      EDTWRD(' .   .   .   . 0 ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A  74        PTDTAXEE      13S  O   109
     A                                      EDTWRD(' .   .   .   .   ')
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|_________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ____|'
     A                                      SPACEB(001)
     A                                     2
     A                                      '_____________________________'
     A                                      SPACEB(002)
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Total de la hoja'
     A                                   +10
     A                                      '|'
     A                                     2
     A                                      '|___________________________|_____-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      _____'
     A                                      SPACEB(001)
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     6
     A                                      'Consigne en estas dos casillas la -
     A                                      suma de las bases de las retencione-
     A                                      s e ingresos'
     A                                   +16
     A                                      'Base retenciones e ingresos a cuen-
     A                                      ta'
     A                                    +5
     A                                      'Retenciones e ingresos a cuenta'
     A                                    +5
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     6
     A                                      'a cuenta y retenciones e ingresos -
     A                                      a cuenta relacionados en esta hoja.'
     A                                   +28
     A                                      '__________________________________-
     A                                      __'
     A                                    +5
     A                                      '_______________________________'
      *
     A                                   180
     A                                      '|'
     A                                     2
     A                                      '|_________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ____|'
     A                                      SPACEB(001)
     A                                    51
     A                                      'La autenticidad de este documento -
     A                                      puede ser comprobada mediante el Có-
     A                                      digo Seguro'
     A                                      SPACEB(003)
     A                                    55
     A                                      'de Verificación MWHJNMDH2YX3N8A4 e-
     A                                      n https://www.agenciatributaria.gob-
     A                                      .es'
     A                                      SPACEB(001)
      *
