      *****************************************************************
/*STD *  PRTFP1                                                       *
/*EXI *  TEXT('Printer file for UTLE0493')                            *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PRTF/UTL493P1 - Printer file for UTLE0493                    *
      *                                                               *
      *  (c) Finastra International Limited 2012                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. AR316218 *CREATE   Date 23Jul12               *
      *                 XXXXXXXX           Date DDMmmYY               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  AR316218 - Report file which shows the total number of       *
      *             records in HISTORY files that have invalid data   *
      *             in some fields.                                   *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
      *--------------------------------*
      ***  Report Header Record Format *
      *--------------------------------*
      *
     A          R HEADER1
     A                                      TEXT('(c) Finastra International -
     A                                      Systems 2012')
      *
     A                                      SKIPB(3)
     A                                      SPACEA(1)
     A                                     5'REFERENCE UTL493P1'
     A            BJURPT        53A  O    37
     A                                   101
     A                                      'DATE'
     A            BJMRDT         7A  O   106
     A                                   119
     A                                      'PAGE'
     A                                   124
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A N11                                 5'AUDIT MODE'
     A                                      SPACEB(2)
     A  11                                 5'UPDATE MODE'
     A                                      SPACEB(1)
      *
      ** Header part 2
      *
     A                                    48'LENDING HISTORY FILES -
     A                                      WITH INVALID DATA IN -
     A                                      SOME FIELDS'
     A                                      SPACEB(1)
      *
     A                                    48'-----------------------
     A                                      ----------------------
     A                                      -----------'
     A                                      SPACEB(1)
      *
     A                                    10'FILES'
     A                                      SPACEB(1)
     A                                    36'FIELDS WITH INVALID DATA'
     A N11                                75'NO. OF RECORDS AFFECTED'
     A  11                                75'NO. OF RECORDS UPDATED'
      *
     A                                    08'---------'
     A                                      SPACEB(1)
     A                                    30'--------------------------
     A                                      ------------'
     A N11                                74'-------------------------'
     A  11                                74'------------------------'
      *
     A                                    30'INTN'
     A                                      SPACEB(1)
     A                                    36'AITN'
     A                                    42'AIAN'
     A                                    48'IPRN'
     A                                    54'FSPRAM'
     A                                    62'FSCPAM'
      *
     A                                      SPACEA(2)
      *
      *-------------------------*
      ***  Detail Record Format *
      *-------------------------*
      *
     A          R DETAIL1
      *
     A                                      SPACEA(1)
     A                                    09'HISTSHM'
     A                                      SPACEB(1)
     A                                    37'X'
     A                                    43'X'
     A                                    49'X'
     A                                    57'X'
     A                                    65'X'
     A            HLMRPT        13  0     80
     A                                      EDTCDE(1)
     A                                    09'HISTSHN'
     A                                      SPACEB(1)
     A                                    31'X'
     A                                    57'X'
     A            HLNRPT        13  0     80
     A                                      EDTCDE(1)
     A                                    09'HISTSHP'
     A                                      SPACEB(1)
     A                                    31'X'
     A                                    37'X'
     A                                    43'X'
     A                                    49'X'
     A                                    57'X'
     A                                    65'X'
     A            HLPRPT        13  0     80
     A                                      EDTCDE(1)
     A                                    09'HISTSHQ'
     A                                      SPACEB(1)
     A                                    37'X'
     A                                    43'X'
     A                                    49'X'
     A                                    65'X'
     A            HLQRPT        13  0     80
     A                                      EDTCDE(1)
     A                                    09'MHISTHM'
     A                                      SPACEB(1)
     A                                    37'X'
     A                                    43'X'
     A                                    49'X'
     A                                    57'X'
     A                                    65'X'
     A            HMMRPT        13  0     80
     A                                      EDTCDE(1)
     A                                    09'MHISTHN'
     A                                      SPACEB(1)
     A                                    31'X'
     A                                    57'X'
     A            HMNRPT        13  0     80
     A                                      EDTCDE(1)
     A                                    09'MHISTHP'
     A                                      SPACEB(1)
     A                                    31'X'
     A                                    37'X'
     A                                    43'X'
     A                                    49'X'
     A                                    57'X'
     A                                    65'X'
     A            HMPRPT        13  0     80
     A                                      EDTCDE(1)
     A                                    09'MHISTHQ'
     A                                      SPACEB(1)
     A                                    37'X'
     A                                    43'X'
     A                                    49'X'
     A                                    65'X'
     A            HMQRPT        13  0     80
     A                                      EDTCDE(1)
      *
      *-------------------------*
      ***  Footer Record Format *
      *-------------------------*
      *
     A          R FOOTER1
      *
     A                                      SPACEA(1)
     A                                    25'NOTE: FIELDS WITH NO ''X'' -
     A                                      MARK MEANS THAT IT IS NOT -
     A                                      PRESENT IN THE FILE'
     A                                      SPACEB(1)
      *
