000100191014      *****************************************************************
000200191014/*STD *  PRTFP1                                                       *
000300191014/*EXI *  TEXT('Midas  SD MD-53116 Utility program for T_GZCUSTEX')    *
000400191014      *****************************************************************
000500191014      *                                                               *
000600191014      *  Midas - Standing Data Module                                 *
000700191014      *                                                               *
000800191014      *  PRTF/UTSD0787P1 - SD MD-53116 Utility program for T_GZCUSTEX *
000900191014      *                                                               *
001000191014      *  (c) Finastra International Limited 2016                      *
001100191014      *                                                               *
001200191014      *  Last Amend No. MD053116  *CREATE  Date 08Oct19               *
001300191014      *                                                               *
001400191014      *****************************************************************
001500191014      *                                                               *
001600191014      *  MD053116 - Customer Deactivated but not displayed as         *
001700191014      *             inactive.                                         *
001800191014      *                                                               *
001900191014      *****************************************************************
002000191014     A                                      REF(MFRFL)
002100191014      *
002200191014     A          R UTSD0787H                 TEXT('(c) Finastra International +
002300191014     A                                      Limited +
002400191014     A                                      2016')
002500191014     A                                      SKIPB(1)
002600191014     A                                     6'REFERENCE UTSD0787P1'
002700191014     A N10                                27'- UPDATE'
002800191014     A  10                                27'- AUDIT'
002900191014     A            BJURPT    R   53        38REFFLD(URPT)
003000191014     A                                   101'DATE:'
003100191014     A            BJMRDT    R            106REFFLD(MRDT)
003200191014     A                                   119'PAGE'
003300191014     A                                   124PAGNBR
003400191014     A                                      EDTCDE(Z)
003500191014     A                                    50'Deactivated Customer Details Lists'
003600191014     A                                      SPACEB(1)
003700191014     A                                   101'TIME'
003800191014     A                                   106TIME
003900191014     A                                      EDTWRD('  :  :  ')
004000191014     A                                      SPACEA(1)
004100191014     A                                    40'-----------------------------------
004200191014     A                                      -'
004300191014     A                                      SPACEA(2)
004400191014      *
004500191014     A          R UTSD0787H2
004600191014     A                                    10'CUSTOMER NO'
004700191014     A                                    23'DE-ACTIVATED'
004800191014     A                                    40'STATUS'
004900191014     A                                    50'REMARKS'
005000191014     A                                      SPACEA(1)
005100191014      *
005200191014     A          R UTSD0787D
005300191014     A                                      SPACEB(1)
005400191014     A            WCUST          6A       10
005500191014     A            WDEAC          1A  O    28
005600191014     A            WSTAT          1A  O    42
005700191014     A  10 11                             50'RECORD TO UPDATE'
005800191014     A N10 11                             50'RECORD WAS UPDATED'
005900191014     A                                      SPACEA(1)
006000191014      *
006100191014     A          R UTSD0787T
006200191014     A                                      SPACEB(1)
006300191014     A  10                                10'NUMBER OF RECORDS TO BE UPDATED'
006400191014     A N10                                10'NUMBER OF RECORDS WERE UPDATED'
006500191014     A                                    42
006600191014     A                                      '='
006700191014     A            WCTR           6S 0O    45
006800191014     A                                      EDTCDE(3)
006900191014     A                                      SPACEA(1)
007000191014     A          R UTSD0787E
007100191014     A                                      SPACEB(1)
007200191014     A                                    54'*** END OF REPORT ***'
007300191014
