      ********************************************************************
/*STD *  PRTFBASE                                                        *
/*EXS *  PR_STD60                                                        *
/*EXI *  TEXT('Midas SD MD-39572 Utility program for SDNARRPD')          *
      ********************************************************************
      *                                                                  *
      *  Midas - Standing Data Module                                    *
      *                                                                  *
      *    PRTF/UTSD0816P1 - SD MD-39572 Utility program for SDNARRPD    *
      *                                                                  *
      *  (c) Finastra International Limited 2020                         *
      *                                                                  *
      *     Last Amend No.  MD039572 *CREATE   Date 14Jan20              *
      ********************************************************************
      *                                                                  *
      *  MD039572 - Failed Component during COB - Component DLC0606C     *
      ********************************************************************
     A          R CPY
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2020')
     A                                      SKIPB(3)
     A                                      SPACEA(2)
     A                                     2'Reference UTSD0816P1'
     A            BJURPT        53        35
     A                                    93'DATE'
     A            RDAT           7        98
     A                                   119'PAGE'
     A                                   124PAGNBR EDTCDE(Z)
     A                                      SPACEA(2)
     A          R HEADER
     A                                      SKIPB(2)
     A                                    55'NARRATIVE CODES REPORT'
     A                                    54'------------------------'
     A                                      SPACEB(1)
     A N13                                 4'Narrative Code'
     A                                      SPACEB(1)
     A N13                                25'Posting Narrative'
     A*%%**************************************************************
     A                                     3'----------------'
     A                                      SPACEB(1)
     A                                    24'-------------------'
     A          R DETAIL
     A N13                                  SPACEB(001)
     A N13        NVCD           2   O    10
     A N13        NCDE          30   O    25
      *
     A          R BREAK                     SKIPA(15)
     A*%%**************************************************************
     A          R FOOTER
     A                                      SPACEB(3)
     A N13                                 3'____________________________'
       N13                                   SPACEA(1)
     A N13                                 4
     A                                       'TOTAL RECORDS FOUND = '
     A                                      SPACEB(1)
     A N13        TOTAL          4S 0O    26
     A  13                                36'***No Narrative Codes with leading-
     A                                       or trailing blanks found***'
      ****************** End of data ****************************************
