      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('CG Audit Letters Selection file')                      *
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  LF/CGAUSLL1 - CG Audit Letters Selection file                *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2008            *
      *                                                               *
      *  Last Amend No. CER059             Date 19Jul10               *
      *  Prev Amend No. BUG23250A          Date 27Mar09               *
      *                 CER041  *CREATE    Date 19May08               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  BUG23250A - Show Zero Confirmation on Display in Edit Mode   *
      *              (Recompile)                                      *
      *  CER041 - Audit Letters Correspondence                        *
      *                                                               *
      *****************************************************************
      *                                                               *
     A          R CGAUSLD0                  PFILE(CGAUSLPD)
     A                                      TEXT('(c) Misys +
     A                                      International Banking +
     A                                      Systems Ltd. 2008')
      *
     A          K CNUMFR
     A          K CNUMTO
     A          K MODLE
     A          K MODRE
     A          K MODMM
     A          K MODFX
     A          K MODFR
     A          K MODIR
     A          K MODSE
     A          K MODFF
     A          K MODAL
     A          K BRCHNR
