      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IMIP                                                      *
/*EXI *  TEXT('Midas CG RDE/Format Option Assoc. Update index')
     A*****************************************************************
     A*                                                               *
     A*  Midas - User Defined Correspondence                      *
     A*                                                               *
     A*  LF/CGFASCL0 - RDE/Format Option Assoc.  Update index         *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01522             Date 23Nov94               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     A*  S01522 - User Defined Correspondence                         *
     A*                                                               *
     A*****************************************************************
     A                                      UNIQUE
     A*=====================================================================
     A          R @FASCL0
     A                                      PFILE(CGFASCPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            FARDE                     TEXT('Report Data Element')
     A            FAFOPT                    TEXT('Formatting Options')
     A            FARECI                    TEXT('Record Identifier')
     A            FADESC                    TEXT('Description')
     A            FAAJOB                    TEXT('Job name')
     A            FAAUSR                    TEXT('User name')
     A            FAATIM                    TEXT('Action Time')
     A            FAARDT                    TEXT('Action Date')
     A            FAAACT                    TEXT('Action Type')
     A            FARDNB                    TEXT('Run day number')
     A*.....................................................................
     A* Key fields
     A          K FARDE
     A          K FAFOPT
     A*=====================================================================
