      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IMIP                                                      *
/*EXI *  TEXT('Midas CG Group Set Definition     Update index')
     A*****************************************************************
     A*                                                               *
     A*  Midas - User Defined Correspondence                      *
     A*                                                               *
     A*  LF/CGGSETL0 - Group Set Definition      Update index         *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01522             Date 24Nov94               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     A*  S01522 - User Defined Correspondence                         *
     A*                                                               *
     A*****************************************************************
     A                                      UNIQUE
     A*=====================================================================
     A          R @GSETL0                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A                                      PFILE(CGGSETPD)
     A*---------------------------------------------------------------------
     A            GSGRPS                    TEXT('Group Set Name')
     A            GSRECI                    TEXT('Record Identifier')
     A            GSCSET                    TEXT('Complex Set Indicator')
     A            GSMREC                    TEXT('Multiple Indicator')
     A            GSRSET                    TEXT('Restricted Set Indicator')
     A            GSMMGR                    TEXT('Mail Merge Group')
     A            GSDESC                    TEXT('Description')
     A            GSAJOB                    TEXT('Job name')
     A            GSAUSR                    TEXT('User name')
     A            GSATIM                    TEXT('Action Time')
     A            GSARDT                    TEXT('Action Date')
     A            GSAACT                    TEXT('Action Type')
     A            GSRDNB                    TEXT('Run day number')
     A*.....................................................................
     A* Key fields
     A          K GSGRPS
     A*=====================================================================
