      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IMIP                                                      *
/*EXI *  TEXT('Midas CG Layout Association Table  By Corr.')
     A*****************************************************************
     A*                                                               *
     A*  Midas - User Defined Correspondence                      *
     A*                                                               *
     A*  LF/CGLASCL2 - Layout Association Table  By Correspondent     *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01522             Date 24Nov94               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
     A*  S01522 - User Defined Correspondence                         *
     A*                                                               *
     A*****************************************************************
     A          R @LASCL2                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                      PFILE(CGLASCPD)
     A*---------------------------------------------------------------------
     A            LAASSC                    TEXT('Association Identifier')
     A            LARECI                    TEXT('Record Identifier')
     A            LAPTYP                    TEXT('Print Item Type')
     A            LAPSTP                    TEXT('Print Item Sub-type')
     A            LALGID                    TEXT('Language identifier')
     A            LABRCA                    TEXT('Branch Code')
     A            LAACCD                    TEXT('Account Code')
     A            LACTYP                    TEXT('Correspondent type')
     A            LACORR                    TEXT('Correspondent')
     A            LAMACT                    TEXT('Midas Account Identifier')
     A            LALAYO                    TEXT('Layout Identifier')
     A            LAOPRT                    TEXT('Overriding Prt Profile')
     A            LADESC                    TEXT('Description')
     A            LAAJOB                    TEXT('Job name')
     A            LAAUSR                    TEXT('User name')
     A            LAATIM                    TEXT('Action Time')
     A            LAARDT                    TEXT('Action Date')
     A            LAAACT                    TEXT('Action Type')
     A            LARDNB                    TEXT('Run day number')
     A*.....................................................................
     A* Key fields
     A          K LACORR
     A          K LAASSC
     A*.....................................................................
     A* SELECT: Select only Live Records
     A* Field    : Record Identifier
     A* Condition: Live Record
     A          S LARECI                    COMP(EQ 'D')
     A*=====================================================================
