      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IMIP                                                      *
/*EXI *  TEXT('Midas CG Arc Data Reference Log by Stream+Msg Id')
      *****************************************************************
      *                                                               *
      *  Midas - User Defined Correspondence                          *
      *                                                               *
      *  LF/CGXDCLL2 - Arc Data Reference Log By Stream + Msg Id      *
      *                                                               *
      *  (c) Finastra International Limited 2002                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4.01 -------------------------------------------*
      *  Prev Amend No. CCG015  *CREATE    Date 19Feb02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CCG015 - Correspondence Manager Phase 1                      *
      *                                                               *
      *****************************************************************
     A          R @XDCLL2                   PFILE(CGXDCLPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2002')
      *
     A            DLITEM                    TEXT('Item Identifier')
     A            DLDCOR                    TEXT('Destination Correspondent')
     A            DLDTAC                    TEXT('Date of Action')
     A            DLRECI                    TEXT('Record Identifier')
     A            DLMSID                    TEXT('Action (Msg id.)')
     A            DLMSDT                    TEXT('Action data')
     A            DLCPGM                    TEXT('Calling Process')
     A            DLRPGM                    TEXT('Called Process')
     A            DLSPLF                    TEXT('Spool File Name')
     A            DLSPLN                    TEXT('Spool File Number')
     A            DLSJOB                    TEXT('Spool Job Name')
     A            DLSUSR                    TEXT('Spool Job User')
     A            DLSJNO                    TEXT('Spool Job Number')
     A            DLSPGE                    TEXT('Start Page Number')
     A            DLEPGE                    TEXT('End Page Number')
     A            DLAJOB                    TEXT('Job name')
     A            DLAUSR                    TEXT('User name')
     A            DLATIM                    TEXT('Action Time')
     A            DLARDT                    TEXT('Action Date')
     A            DLAACT                    TEXT('Action Type')
     A            DLRDNB                    TEXT('Run day number')
     A            DLSTFN                    TEXT('Stream File Number')
     A            DLRQNM                    TEXT('Request Name')
     A            DLPROC                    TEXT('Processed by FormsMaster')
     A            DLPDFN                    TEXT('PDF File Name')
     A            DLPDFD                    TEXT('PDF Directory')
     A            DLPRTD                    TEXT('Printing Date')
     A            DLPRTT                    TEXT('Printing Time')
     A            DLDEVN                    TEXT('Device Name')
     A            DLNOPG                    TEXT('No. Of Pages Printed')
     A* Key fields
     A          K DLSTFN
     A          K DLMSID
