      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas List of API Dealing Pop ups')                    *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  PF/T_POPUPAPI - List of Dealing Pop Ups                      *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2013            *
      *                                                               *
      *  Last Amend No. 245692  *CREATE    Date 09Dec13               *
      *  Prev Amend No. xxxxxx             Date ddmmmyy               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  245692 - Incorrect validation of rates when the decimal se-  *
      *           parator in the Dealing ICD was defined as "," ins-  *
      *           tead of ".".                                        *
      *                                                               *
      *****************************************************************
      *
     A          R T_POPUP0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2013')
      *
     A            POPUPCODE     15          TEXT('Dealing Pop Up API Code')
     A                                      COLHDG('Pop up' +
     A                                             'Code' )
      *
     A            POPUPDESC     60          TEXT('Pop Up Description')
     A                                      COLHDG('Description')
