      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas RN - FRS Product Codes')
      *****************************************************************
      *                                                               *
      *  MidasPlus - FRS Regulatory Reporting Interface               *
      *                                                               *
      *  PF/GPFRSPPD - FRS Product Codes                              *
      *                                                               *
      *  (c) Finastra International Limited 2005                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. BUG9794            Date 18Jan06               *
      *                 CRN001             Date 09Nov05               *
      *                 BG7516  *CREATE    Date 09Jun05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  BUG9794 - FPRULESET should be the primary key so you can     *
      *            see the US codes separate to the others.           *
      *  CRN001 - FRS Regulatory Reporting Interface                  *
      *           Add Rule ID.                                        *
      *           Moved from GPDDSSRCGM.                              *
      *           Change field FPPRODID to 10S.                       *
      *  BG7516 - FRS interface                                       *
      *                                                               *
      *****************************************************************
      *
     A          R GPFRSPD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2005')
      *
     A************FPPRODID       6S 0       TEXT('Product Code')                              CRN001
     A            FPPRODID      10S 0       TEXT('Product Code')                              CRN001
     A                                      COLHDG('Product' 'Code')
     A            FPCATG        32          TEXT('Product Category')
     A                                      COLHDG('Product Category')
     A                                      VARLEN
     A            FPCLASS       32          TEXT('Product Class')
     A                                      COLHDG('Product Class')
     A                                      VARLEN
     A            FPTYP         64          TEXT('Product Type')
     A                                      COLHDG('Product Type')
     A                                      VARLEN
     A            FPSTYP       128          TEXT('Product Subtype')
     A                                      COLHDG('Product Subtype')
     A                                      VARLEN
     A            FPDESC       255          TEXT('Product Description')
     A                                      COLHDG('Product Description')
     A                                      VARLEN
     A            FPRULESET      5P 0       TEXT('Product Rule Set')                          CRN001
     A                                      COLHDG('Product Rule Set')                        CRN001
 
     A          K FPRULESET                                                                  BUG9794
     A          K FPPRODID
     A**********K*FPRULESET                                                           CRN001 BUG9794
