      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas CF Feedback file')
     A*****************************************************************
     A*                                                               *
     A*       Midas CONFIRMATION MATCHING                         *
     A*                                                               *
     A*       PF/CFFEEDPD - FEEDBACK FILE FROM TRAM                   *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*       LAST AMEND NO. S01310            DATE 21MAY91           *  *
     A*       PREV AMEND NO. S01184            DATE 15DEC89           *  *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*       S01310 - SWIFT RATIONALISATION                          *
     A*       S01184 - CREATED FOR CONFIRMATION MATCHING              *
     A*                NOTE: THIS FILE ALSO USED TO CREATE PF/CFWFEDPD*
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R CFFEEDD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            DTSC      R        B      TEXT('DATE')
     A            TMSC      R        B      TEXT('TIME')
     A            IMRF      R        B      TEXT('TRN OF CONFIRMATION')
     A            FRF1      R        B
     A            FRF2      R        B
     A            CPRF      R        B      TEXT('COUNTERPARTY REF')
     A            CPSX      R        B      TEXT('COUNTERPARTY STATUS')
     A            BKRF      R        B      TEXT('BROKER REF')
     A            BKSX      R        B      TEXT('BROKER STATUS')
     A            CHSN      R        B      TEXT('CHASER SENT FLAG')
     A            CNRQ      R        B      TEXT('CANCEL REQUEST FLAG')
      *                                                                 /S01310/
     A            BRCA      R
      *                                                                 /S01310/
