      ********************************************************************
/*STD *  PFBASE                                                          *
/*EXS *  PF_STD                                                          *
/*EXI *  TEXT('BV Interbranch Accounts for Remapping')                   *
      ********************************************************************
     A********************************************************************
     A*                                                                  *
     A*  Midas - General Ledger Module                                   *
     A*                                                                  *
     A*  PF/BVINTBR - BV Interbranch Accounts for Remapping              *
     A*                                                                  *
     A*    (C) COPYRIGHT Finastra Ltd 2019                               *
     A*                                                                  *
     A*  Last Amend No. LUC118  *CREATE     DATE 14Feb19                 *
     A*                                                                  *
     A********************************************************************
     A*                                                                  *
     A*  LUC118 - Upgrade of S21045 to FB Midas 2.1                      *
     A*           BV Auto transfer of interbranch account balances       *
     A*           N.B. There is no maintenance program for this          *
     A*           file, it is maintained by the bank outside of Midas    *
     A*                                                                  *
     A********************************************************************
     A*
     A                                      REF(MFRFL)
     A                                      UNIQUE
     A          R BVINTBRF                  TEXT('(c) Copyright +
     A                                      Finastra Ltd 2019')
     A            IBBRC     R               REFFLD(BRCA)
     A*****       IBCNUM    R               REFFLD(CNUM)                        LUC118
     A            IBCNUM         6A                                             LUC118
     A            IBCCY     R               REFFLD(CCY)
     A            IBACOD    R               REFFLD(ACOD)
     A            IBACSQ    R               REFFLD(ACSQ)
     A            NOBRC     R               REFFLD(BRCA)
     A*****       NOCNUM    R               REFFLD(CNUM)                        LUC118
     A            NOCNUM         6A                                             LUC118
     A            NOCCY     R               REFFLD(CCY)
     A            NOACOD    R               REFFLD(ACOD)
     A            NOACSQ    R               REFFLD(ACSQ)
     A          K IBBRC
     A          K IBCNUM
     A          K IBCCY
     A          K IBACOD
     A          K IBACSQ
