      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL Account Posting Next Available Number')
     A********************************************************************
     A*                                                                  *
     A*  Midas - General Ledger Module
     A*                                                                  *
     A*    PF/GLAPNAPD - ACCOUNTS POSTING NEXT AVAILABLE NUMBER          *
     A*                                                                  *
     A*  (c) Finastra International Limited 2001                         *
     A*                                                                  *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  PREV AMEND NO. CEU013 *CREATE     DATE 31MAR98               *  *
     A********************************************************************
     A*                                                                  *
     A*    MD046248 - Finastra Rebranding                                *
     A*    CEU013 - EMU Account Postings Narrative                       *
     A*             Created new file
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R GLAPNAPF                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
 
     A            GLNARI    R               REFFLD(MNTH)
     A                                      TEXT('Next Available Reference ID')
     A                                      COLHDG('Next' +
     A                                             'Available' +
     A                                             'Reference ID')
     A            GLNARN    R               REFFLD(CHRN)
     A                                      TEXT('Next Available Reference No.')
     A                                      COLHDG('Next' +
     A                                             'Available' +
     A                                             'Reference No.')
     A          K GLNARI
