      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL Stamp Tax Accounts being closed')             *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger                                       *
      *                                                               *
      *  PF/GLCLOSPD - Stamp Tax - Accounts being closed              *
      *                                                               *
      *  (C) Misys International Banking Systems Ltd 2010             *
      *                                                               *
      *  Last Amend No. CER049 *Create     Date 06Dec10               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CER049 - Stamp Tax                                           *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R @GLCLP0                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. 2010')
     A*---------------------------------------------------------------------
     A            T3RECI         1          TEXT('Record id')
     A                                      COLHDG('Record id')
     A
      * Account Reference
     A            T3BRCA    R               REFFLD(BRCA)
     A            T3CNUM    R               REFFLD(CNUMA)
     A                                      COLHDG('Account ' +
     A                                             'Customer' )
     A            T3CCY     R               REFFLD(CCY )
     A            T3ACOD    R               REFFLD(ACOD)
     A            T3ACSQ    R               REFFLD(ACSQ)
      *
      * Funds Transfer Payment Reference
     A            T3ACST    R               REFFLD(ACST)
     A            T3DACC    R               REFFLD(DACC)
      *
     A*=====================================================================
