      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL Collateral Account Keys Header')
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  PF/GLCOAHPD - Collateral Account Keys Header                 *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      *  Last Amend No. 244201             Date 06Dec06               *
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CGL014  *CREATE    Date 20Oct03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  244201 - Increase length of Account Key field due to CDL038  *
      *  CGL014 - Collaterals Processing                              *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R GLCOAHD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
      *
     A            CHRECI         1A         TEXT('Record Id')
     A                                      COLHDG('Record Id')
      **Start of change 244201
     A**********  CHAKEY        10A         TEXT('Account key')                               244201
     A**********                            COLHDG('Account key')                             244201
     A            QQAKEY        10A         TEXT('Account key')
      **End of change 244201
     A            CHZZ02         2A         TEXT('Filler')
     A                                      COLHDG('Filler')
     A            CHNREC         4S 0       TEXT('Records at start of i/c')
     A                                      COLHDG('Records at start' +
     A                                             'of i/c')
     A            CHNINS         4S 0       TEXT('No. or records inserted')
     A                                      COLHDG('No. of records' +
     A                                             'inserted')
     A            CHNDEL         4S 0       TEXT('No. of records deleted')
     A                                      COLHDG('No. of records' +
     A                                             'deleted')
     A            CHNAMD         4S 0       TEXT('No. of amendments')
     A                                      COLHDG('No. of amendments')
     A            CHNRC1         5P 0       TEXT('No. of a/c key records')
     A                                      COLHDG('No. of a/c key' +
     A                                             'records')
     A            CHZZ64        64A         TEXT('Filler')
     A                                      COLHDG('Filler')
      **Start of change 244201
     A            CHAKEY        14A         TEXT('Account key')
     A                                      COLHDG('Account key')
      **End of change 244201
