      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL CRS Reports Management File')                 *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  PF/GLCRMGPD - Midas GL CRS Reports Management File           *
      *                                                               *
      *  (c) Finastra International Limited 2016                      *
      *                                                               *
      *  Last Amend No. CGL177  *CREATE    Date 11Jan16               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGL177 - CRS Reporting Phase 2                               *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R GLCRMGD0                  TEXT('(c) Finastra +
     A                                      International Limted +
     A                                      2016')
     A
     A            GGRYER         4A         TEXT('Report Year')
     A                                      COLHDG('Report Year')
     A
     A            GGRBRC         3A         TEXT('Report Branch')
     A                                      COLHDG('Report Branch')
     A
     A            GGRCTR         2A         TEXT('Report Country')
     A                                      COLHDG('Report Country')
     A
     A            GGRVER         5A         TEXT('Report Version No.')
     A                                      COLHDG('Report Version No.')
     A
     A            GGRTYP        18A         TEXT('Report Type')
     A                                      COLHDG('Report Type')
     A
     A            GGSTAT         4A         TEXT('Status')
     A                                      COLHDG('Status')
     A
     A            GGMSID        21A         TEXT('MSG Ref ID')
     A                                      COLHDG('MSG Ref ID')
     A            GGAMID        21A         TEXT('Approved MSG Ref ID')
     A                                      COLHDG('Approved MSG Ref ID')
     A            GGDTTM    R               REFFLD(TIMESTMP)
     A                                      COLHDG('Date/Time')
     A
     A            GGUSER        10A         TEXT('User Name')
     A                                      COLHDG('User Name')
