/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL JE Posting Extension file')                   *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  PF/GLJENPX0 - Posting Extension File                         *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2006            *
      *                                                               *
      *  Last Amend No. EML102  *CREATE    Date 28Nov19               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  EML102 - Upgrade of UNL007 to FB2.1 SP23                     *
      *           UNL007 - Extended Narratives                        *
      *                                                               *
      *****************************************************************
      *
     A          R GLJENPD1                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2006')
     A*---------------------------------------------------------------------
     A            FBTNB          3          TEXT('Batch number')
     A                                      COLHDG('Batch' +
     A                                             'number')
     A            FBINB          3  0       TEXT('Batch item no.')
     A                                      COLHDG('Batch' +
     A                                             'item no.')
     A                                      EDTCDE(4)
     A            FPTDT          5  0       TEXT('Posting date')
     A                                      COLHDG('Posting' +
     A                                             'Date')
      *
     A            FNA02         35          TEXT('Narrative code 2')
     A                                      COLHDG('NAR2')
     A            FNA03         35          TEXT('Narrative code 3')
     A                                      COLHDG('NAR3')
     A            FNA04         35          TEXT('Narrative code 4')
     A                                      COLHDG('NAR4')
     A            FNA05         35          TEXT('Narrative code 5')
     A                                      COLHDG('NAR5')
     A            FNA06         35          TEXT('Narrative code 6')
     A                                      COLHDG('NAR6')
     A            FNA07         35          TEXT('Narrative code 7')
     A                                      COLHDG('NAR7')
     A            FNA08         35          TEXT('Narrative code 8')
     A                                      COLHDG('NAR8')
     A            FNA09         35          TEXT('Narrative code 9')
     A                                      COLHDG('NAR9')
     A            FNA10         35          TEXT('Narrative code 10')
     A                                      COLHDG('NAR10')
     A            FNA11         35          TEXT('Narrative code 11')
     A                                      COLHDG('NAR11')
     A            FNA12         35          TEXT('Narrative code 12')
     A                                      COLHDG('NAR12')
     A            FNA13         35          TEXT('Narrative code 13')
     A                                      COLHDG('NAR13')
     A            FNA14         35          TEXT('Narrative code 14')
     A                                      COLHDG('NAR14')
     A            FNA15         35          TEXT('Narrative code 15')
     A                                      COLHDG('NAR15')
     A            FNA16         35          TEXT('Narrative code 16')
     A                                      COLHDG('NAR16')
     A            FNA17         35          TEXT('Narrative code 17')
     A                                      COLHDG('NAR17')
     A*.....................................................................
     A* Key fields
     A          K FBTNB
     A          K FBINB
     A          K FPTDT
     A*=====================================================================
