      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL JE posting I/Face PF - Extension')            *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  PF/GLJEIPX0 - Journal Entry Posting Interface - Extension    *
      *                                                               *
      *  (c) Finastra Ltd. 2023                                       *
      *                                                               *
      *  Last Amend No. CGL200 *CREATE     Date 17Feb23               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  CGL200 - Timestamp on Batch Items and Related Postings       *
      *                                                               *
      *****************************************************************
      *                                                               *
     A          R GLJEIPD0                  TEXT('(c) Finastra Ltd. 2023')
      *
     A            BTPTDT         5S 0       TEXT('Posting Date')
     A                                      COLHDG('Posting Date')
      *
     A            BTBTNB         3A         TEXT('Batch Number')
     A                                      COLHDG('Batch Number')
      *
     A            BTBINB         3S 0       TEXT('Batch Item no.')
     A                                      COLHDG('Batch Item no.')
      *
     A            BTTMST          Z         TEXT('Transaction Timestamp')
     A                                      COLHDG('Transaction' 'Timestamp')

