      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL Network Accounts - MT94x')                    *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  PF/GLNW94PD - Midas GL Network Accounts - MT94x              *
      *                                                               *
      *  (c) Finastra International Limited 2002                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CER059             Date 19Jul10               *
      *                 CER030             Date 09Jul08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027             Date 25Nov05               *
      *                 CGL029             Date 01Sep03               *
      *                 CGL013  *CREATE    Date 20Mar02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER030 - Multicash German Feature                            *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CGL013 - MT94x Message Generation                            *
      *                                                               *
      *****************************************************************
     A          R GLNW94D0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2002')
      *
     A            N4RECI         1          TEXT('Record Id')
     A                                      COLHDG('Record' 'Id')
     A            N4NWRK         6          TEXT('Network')
     A                                      COLHDG('Network')
     A            N4BRCA         3          TEXT('Account Branch')
     A                                      COLHDG('Branch')
      * Begin /CSD027/
     A**********  N4CNUM         6S 0       TEXT('Account Customer')                          CSD027
     A            N4CNUM         6A         TEXT('Account Customer')
      * End /CSD027/
     A                                      COLHDG('Customer')
     A            N4CCY          3          TEXT('Account Currency')
     A                                      COLHDG('Currency')
     A**Start of change CGL029
     A**********  N4ACCD         4S 0       TEXT('Account Code')                              CGL029
     A**********                            COLHDG('Account')                                 CGL029
     A            QQACCD         4S 0
     A**End of change CGL029
     A            N4ACSQ         2S 0       TEXT('Account Sequence')
     A                                      COLHDG('Sequence')
     A            N4NATY         1          TEXT('Network Account type')
     A                                      COLHDG('Network' 'account' 'type')
     A            N4DSTN        11          TEXT('MT94x Destination')
     A                                      COLHDG('MT94x Destination')
     A            N4DSTD        35          TEXT('MT94x Destination +
     A                                            description')
     A                                      COLHDG('MT94x Destination' +
     A                                             'description')
     A            N4G940         1          TEXT('Generate MT940 flag')
     A                                      COLHDG('Generate' 'MT940')
     A            N4G941         1          TEXT('Generate MT941 flag')
     A                                      COLHDG('Generate' 'MT941')
     A            N4G942         1          TEXT('Generate MT942 flag')
     A                                      COLHDG('Generate' 'MT942')
      *---------------------
     A            N40SFR         1          TEXT('MT940 statement frequency')
     A                                      COLHDG('MT940' 'stmt' 'freq')
     A            N40SDM         2S 0       TEXT('MT940 Statement day +
     A                                            in month')
     A                                      COLHDG('MT940' 'stmt' 'day')
     A            N40NSD         5  0       TEXT('MT940 Next statement date')
     A                                      COLHDG('MT940 next' 'statement' +
     A                                             'date')
     A            N40DSI         1          TEXT('MT940 demand statement ind.')
     A                                      COLHDG('MT940 demand' 'statement' +
     A                                             'ind.')
     A            N40MI1        65          TEXT('Default MT940 message level +
     A                                            information to the account +
     A                                            owner 1')
     A                                      COLHDG('Default MT940 msg' +
     A                                             'level info to' +
     A                                             'account owner 1')
     A            N40MI2        65          TEXT('Default MT940 message level +
     A                                            information to the account +
     A                                            owner 2')
     A                                      COLHDG('Default MT940 msg' +
     A                                             'level info to' +
     A                                             'account owner 2')
     A            N40MI3        65          TEXT('Default MT940 message level +
     A                                            information to the account +
     A                                            owner 3')
     A                                      COLHDG('Default MT940 msg' +
     A                                             'level info to' +
     A                                             'account owner 3')
     A            N40MI4        65          TEXT('Default MT940 message level +
     A                                            information to the account +
     A                                            owner 4')
     A                                      COLHDG('Default MT940 msg' +
     A                                             'level info to' +
     A                                             'account owner 4')
     A            N40MI5        65          TEXT('Default MT940 message level +
     A                                            information to the account +
     A                                            owner 5')
     A                                      COLHDG('Default MT940 msg' +
     A                                             'level info to' +
     A                                             'account owner 5')
     A            N40MI6        65          TEXT('Default MT940 message level +
     A                                            information to the account +
     A                                            owner 6')
     A                                      COLHDG('Default MT940 msg' +
     A                                             'level info to' +
     A                                             'account owner 6')
     A            N40LSD         5  0       TEXT('MT940 Last statement date')
     A                                      COLHDG('MT940 last' +
     A                                             'statement date')
     A            N40LST         6  0       TEXT('MT940 Last statement time')
     A                                      COLHDG('MT940 last' +
     A                                             'statement time')
     A            N40LSN         5S 0       TEXT('MT940 Last statement page')
     A                                      COLHDG('MT940' 'last page' 'number')
     A            N40LCA        15  0       TEXT('MT940 Last closing +
     A                                            available balance')
     A                                      COLHDG('MT940 last' +
     A                                             'closing balance')
      *---------------------
     A            N41DTI         1          TEXT('MT941 Date/Time indicator')
     A                                      COLHDG('MT941' 'Date/Time' +
     A                                             'indicator')
     A            N41OBI         1          TEXT('MT941 Opening balance +
     A                                            information required')
     A                                      COLHDG('MT941' 'Opening balance' +
     A                                            'information required')
     A            N41LSF         1          TEXT('MT941 Number and sum of +
     A                                            fields required')
     A                                      COLHDG('MT941' 'Number and sum' +
     A                                              'of fields required')
     A            N41CAB         1          TEXT('MT941 Closing available +
     A                                            balance required')
     A                                      COLHDG('MT941' 'Closing available' +
     A                                              'balance required')
     A            N41FAB         1          TEXT('MT941 Forward available +
     A                                            balance required')
     A                                      COLHDG('MT941' 'Forward available' +
     A                                              'balance required')
     A            N41MI1        65          TEXT('Default MT941 message level +
     A                                            information to the account +
     A                                            owner 1')
     A                                      COLHDG('Default MT941 msg' +
     A                                             'level info to' +
     A                                             'account owner 1')
     A            N41MI2        65          TEXT('Default MT941 message level +
     A                                            information to the account +
     A                                            owner 2')
     A                                      COLHDG('Default MT941 msg' +
     A                                             'level info to' +
     A                                             'account owner 2')
     A            N41MI3        65          TEXT('Default MT941 message level +
     A                                            information to the account +
     A                                            owner 3')
     A                                      COLHDG('Default MT941 msg' +
     A                                             'level info to' +
     A                                             'account owner 3')
     A            N41MI4        65          TEXT('Default MT941 message level +
     A                                            information to the account +
     A                                            owner 4')
     A                                      COLHDG('Default MT941 msg' +
     A                                             'level info to' +
     A                                             'account owner 4')
     A            N41MI5        65          TEXT('Default MT941 message level +
     A                                            information to the account +
     A                                            owner 5')
     A                                      COLHDG('Default MT941 msg' +
     A                                             'level info to' +
     A                                             'account owner 5')
     A            N41MI6        65          TEXT('Default MT941 message level +
     A                                            information to the account +
     A                                            owner 6')
     A                                      COLHDG('Default MT941 msg' +
     A                                             'level info to' +
     A                                             'account owner 6')
     A            N41RPL         1          TEXT('MT941 Re-extract postings +
     A                                            from last MT940')
     A                                      COLHDG('MT941 re-extract' +
     A                                             'postings from' +
     A                                             'last MT940')
     A            N41RAS         1          TEXT('MT941 Re-extract all shadow +
     A                                            postings')
     A                                      COLHDG('MT941 re-extract' +
     A                                             'shadow posting')
     A            N41GNM         1          TEXT('MT941 generation even +
     A                                            when no movement')
     A                                      COLHDG('Generate MT941' +
     A                                             'even when' +
     A                                             'no movements')
     A            N41AER         1          TEXT('Allow MT941 generation on +
     A                                            external request')
     A                                      COLHDG('Allow MT941' +
     A                                             'generation on' +
     A                                             'external request')
     A            N41AGS         1          TEXT('Allow MT941 generation on +
     A                                            schedule')
     A                                      COLHDG('Allow MT941' +
     A                                             'generation on' +
     A                                             'schedule')
     A            N41AMR         1          TEXT('Allow MT941 generation on +
     A                                            manual request')
     A                                      COLHDG('Allow MT941' +
     A                                             'generation on' +
     A                                             'manual request')
     A            N41LSP         5S 0       TEXT('MT941 Last statement page')
     A                                      COLHDG('MT941' 'last page' 'number')
     A            N41LSD         5  0       TEXT('MT941 Last statement date')
     A                                      COLHDG('MT941 last' +
     A                                             'statement date')
     A            N41LST         6  0       TEXT('MT941 Last statement time')
     A                                      COLHDG('MT941 last' +
     A                                             'statement time')
     A            N41LDN         5S 0       TEXT('MT941 Last sum of debit +
     A                                            number')
     A                                      COLHDG('MT941 Last' 'sum of debit' +
     A                                             'number')
     A            N41LDA        15  0       TEXT('MT941 Last sum of debit +
     A                                            amount')
     A                                      COLHDG('MT941 Last' 'sum of debit' +
     A                                             'amount')
     A            N41LCN         5S 0       TEXT('MT941 Last sum of credit +
     A                                            number')
     A                                      COLHDG('MT941 Last' +
     A                                             'sum of credit' +
     A                                             'number')
     A            N41LCA        15  0       TEXT('MT941 Last sum of credit +
     A                                            amount')
     A                                      COLHDG('MT941 Last' +
     A                                             'sum of credit' +
     A                                             'amount')
     A            N41LCB        15  0       TEXT('MT941 Next Opening balance')
     A                                      COLHDG('MT941 Next' +
     A                                             'Opening balance')
      *---------------------
     A            N42LSF         1          TEXT('MT942 Number and Sum of +
     A                                            Entries (D/C)')
     A                                      COLHDG('MT942 Number' 'and Sum of' +
     A                                             'Entries (D/C)')
     A            N42FLD        15  0       TEXT('MT942 Floor limit debit')
     A                                      COLHDG('MT942 Floor limit' 'debit')
     A            N42FLC        15  0       TEXT('MT942 Floor limit credit')
     A                                      COLHDG('MT942 Floor limit' 'credit')
     A            N42MI1        65          TEXT('Default MT942 message level +
     A                                            information to the account +
     A                                            owner 1')
     A                                      COLHDG('Default MT942 msg' +
     A                                             'level info to' +
     A                                             'account owner 1')
     A            N42MI2        65          TEXT('Default MT942 message level +
     A                                            information to the account +
     A                                            owner 2')
     A                                      COLHDG('Default MT942 msg' +
     A                                             'level info to' +
     A                                             'account owner 2')
     A            N42MI3        65          TEXT('Default MT942 message level +
     A                                            information to the account +
     A                                            owner 3')
     A                                      COLHDG('Default MT942 msg' +
     A                                             'level info to' +
     A                                             'account owner 3')
     A            N42MI4        65          TEXT('Default MT942 message level +
     A                                            information to the account +
     A                                            owner 4')
     A                                      COLHDG('Default MT942 msg' +
     A                                             'level info to' +
     A                                             'account owner 4')
     A            N42MI5        65          TEXT('Default MT942 message level +
     A                                            information to the account +
     A                                            owner 5')
     A                                      COLHDG('Default MT942 msg' +
     A                                             'level info to' +
     A                                             'account owner 5')
     A            N42MI6        65          TEXT('Default MT942 message level +
     A                                            information to the account +
     A                                            owner 6')
     A                                      COLHDG('Default MT942 msg' +
     A                                             'level info to' +
     A                                             'account owner 6')
     A            N42RPL         1          TEXT('MT942 Re-extract postings +
     A                                            from last MT940')
     A                                      COLHDG('MT942 re-extract' +
     A                                             'postings from' +
     A                                             'last MT940')
     A            N42RAS         1          TEXT('MT942 Re-extract all shadow +
     A                                            postings')
     A                                      COLHDG('MT942 re-extract' +
     A                                             'shadow posting')
     A            N42GNM         1          TEXT('MT942 generation even +
     A                                            when no movement')
     A                                      COLHDG('Generate MT942' +
     A                                             'even when' +
     A                                             'no movements')
     A            N42AER         1          TEXT('MT942 generation on +
     A                                            external request')
     A                                      COLHDG('Allow MT942' +
     A                                             'generation on' +
     A                                             'external request')
     A            N42AGS         1          TEXT('MT942 generation on +
     A                                            schedule')
     A                                      COLHDG('Allow MT942' +
     A                                             'generation on' +
     A                                             'schedule')
     A            N42AMR         1          TEXT('MT942 generation on +
     A                                            manual request')
     A                                      COLHDG('Allow MT942' +
     A                                             'generation on' +
     A                                             'manual request')
     A            N42LSP         5S 0       TEXT('MT942 Last statement page')
     A                                      COLHDG('MT942' 'last page' 'number')
     A            N42LSD         5  0       TEXT('MT942 Last statement date')
     A                                      COLHDG('MT942 last' +
     A                                             'statement date')
     A            N42LST         6  0       TEXT('MT942 Last statement time')
     A                                      COLHDG('MT942 last' +
     A                                             'statement time')
     A            N42LDN         5S 0       TEXT('MT942 Last sum of debit +
     A                                            number')
     A                                      COLHDG('MT942 Last' 'sum of debit' +
     A                                             'number')
     A            N42LDA        15  0       TEXT('MT942 Last sum of debit +
     A                                            amount')
     A                                      COLHDG('MT942 Last' 'sum of debit' +
     A                                             'amount')
     A            N42LCN         5S 0       TEXT('MT942 Last sum of credit +
     A                                            number')
     A                                      COLHDG('MT942 Last' +
     A                                             'sum of credit' +
     A                                             'number')
     A            N42LCA        15  0       TEXT('MT942 Last sum of credit +
     A                                            amount')
     A                                      COLHDG('MT942 Last' +
     A                                             'sum of credit' +
     A                                             'amount')
      *---------------------
     A            N4LCDT         5  0       TEXT('Last record change date')
     A                                      COLHDG('Last rcd' 'change' 'date')
     A            N4CHTP         1          TEXT('Type of last change')
     A                                      COLHDG('Last' 'change' 'type')
     A            N4USER        10          TEXT('Last change user')
     A                                      COLHDG('Last change' 'user')
      *---------------------------------------------------------------------
     A**Start of change CGL029
     A            N4ACCD        10S 0
     A                                      TEXT('Account Code')
     A**End of change CGL029
      **Start of change CER030
     A            N4SV86         1A         TEXT('Default for field +
     A                                            86 structure +
     A                                            validation')
     A                                      COLHDG('Default for fld' +
     A                                             '86 Str validation')
      **End of change CER030
