      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL API account maint defn file-valid account')   *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger ILE Module                            *
      *                                                               *
      *  PF/GLVAMADPD - Valid ACCOUNTS                                *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *  Last Amend No. CRE073             Date 06Dec10               *
      *  Prev Amend No. CRE075             Date 06Dec10               *
      *                 CER059             Date 19Jul10               *
      *                 BUG22526           Date 28Jan09               *
      *                 CER047             Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027             Date 25Nov05               *
      *                 CAP086             Date 08Jun05               *
      *                 CLE025             Date 20Oct03               *
      *                 CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CFT004             Date 08Jul99               *
      *                 CPB001             Date 18Nov99               *
      *                 CAP035  *CREATE    Date 13Apr99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CRE073 - Interest Rate Rounding                              *
      *  CRE075 - Effective Date for Retail Accounts                  *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  BUG22526 - Mismatch between Valids and database files        *
      *  CER047 - German Features LF037-00 Reporting §24c KWG         *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CAP086 - Introduce Auto Authorisation to the API's           *
      *           without it.                                         *
      *  CLE025 - Credit Lines                                        *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CFT004 - Straight Through Processing Phase 2                 *
      *         - International Bank Account Numbers                  *
      *  CPB001 - Meridian DBA Middleware Replication Customization.  *
      *  CAP035 - Midas/ToF Interface                                 *
      *                                                               *
      *****************************************************************
      *
     A                                      REF(MFRFL)
     A          R GLVAMADD0                 TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
 
     A            AMRECI    R               REFFLD(RECI)
      * Begin /CSD027/
     A**********  AMCNUM    R               REFFLD(CNUM)                                      CSD027
     A            AMCNUM         6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            AMCCY     R               REFFLD(CCY)
     A**Start of change CGL029
     A**********  AMACOD    R               REFFLD(ACOD)                                      CGL029
     A            QQACOD    R               REFFLD(ACODQQ)
     A**End of change CGL029
     A            AMACSQ    R               REFFLD(ACSQ)
     A            AMZZ006   R               REFFLD(ZZ006)
     A            AMBRCA    R               REFFLD(BRCA)
     A            AMATYP    R               REFFLD(ATYP)
     A            AMSTYP    R               REFFLD(STYP)
     A            AMMFFQ    R               REFFLD(MFFQ)
     A            AMACST    R               REFFLD(ACST)
     A            AMDACO    R               REFFLD(DACO)
     A            AMDACC    R               REFFLD(DACC)
     A            AMANAM    R               REFFLD(ANAM)
     A            AMLDBL    R               REFFLD(LDBL)
     A            AMCLBL    R               REFFLD(CLBL)
     A            AMSTFQ    R               REFFLD(STFQ)
     A            AMSTDY    R               REFFLD(STDY)
     A            AMLSTD    R               REFFLD(LSTD)
     A            AMNSTD    R               REFFLD(NSTD)
     A            AMLSTP    R               REFFLD(LSTP)
     A            AMCFSB    R               REFFLD(CFSB)
     A            AMLMVD    R               REFFLD(LMVD)
     A            AMEPLB    R               REFFLD(EPLB)
     A            AMEPCB    R               REFFLD(EPCB)
     A            AMYTDB    R               REFFLD(YTDB)
     A            AMGLBT    R               REFFLD(GLBT)
     A            AMADREF1  R               REFFLD(ADREF1)
     A            AMPRFC    R               REFFLD(PRFC)
     A            AMZZ004   R               REFFLD(ZZ004)
     A            AMORED    R               REFFLD(ORED)
     A            AMDLIM    R               REFFLD(DLIM)
     A            AMLRCR    R               REFFLD(LRCR)
     A            AMRTCB    R               REFFLD(RTCB)
     A            AMRTLB    R               REFFLD(RTLB)
     A            AMDITM    R               REFFLD(DITM)
     A            AMCITM    R               REFFLD(CITM)
     A            AMADREF2  R               REFFLD(ADREF2)
     A            AMZZ002   R               REFFLD(ZZ002)
     A            AMCDIR    R               REFFLD(CDIR)
     A            AMCCIR    R               REFFLD(CCIR)
     A            AMACNO    R               REFFLD(ACNO)
     A            AMRETB    R               REFFLD(RETB)
     A            AMODSC    R               REFFLD(ODSC)
     A            AMODLN    R               REFFLD(ODLN)
     A            AMODED    R               REFFLD(ODED)
     A            AMDIOD    R               REFFLD(DIOD)
     A            AMFACT    R               REFFLD(FACT)
     A            AMFCNO    R               REFFLD(FCNO)
     A            AMEFAC    R               REFFLD(EFAC)
     A            AMHELD    R               REFFLD(HELD)
     A            AMMINB    R               REFFLD(MINB)
     A            AMLACD    R               REFFLD(LACD)
     A            AMLISP    R               REFFLD(LISP)
     A            AMRRNM    R               REFFLD(RRNM)
     A            AMDRIB    R               REFFLD(DRIB)
     A            AMDRIS    R               REFFLD(DRIS)
     A            AMDRCD    R               REFFLD(DRCD)
     A            AMDRIC    R               REFFLD(DRIC)
     A            AMDRIF    R               REFFLD(DRIF)
     A            AMDRDY    R               REFFLD(DRDY)
     A            AMNDID    R               REFFLD(NDID)
     A            AMLDID    R               REFFLD(LDID)
     A            AMLDIA    R               REFFLD(LDIA)
     A            AMSDAP    R               REFFLD(SDAP)
     A            AMLPAR    R               REFFLD(LPAR)
     A            AMDIIE    R               REFFLD(DIIE)
     A            AMDAIC    R               REFFLD(DAIC)
     A            AMMADI    R               REFFLD(MADI)
     A            AMGADI    R               REFFLD(GADI)
     A            AMDDIS    R               REFFLD(DDIS)
     A            AMDDIA    R               REFFLD(DDIA)
     A            AMOLDR    R               REFFLD(OLDR)
     A            AMOLDB    R               REFFLD(OLDB)
     A            AMOLDS    R               REFFLD(OLDS)
     A            AMCRIB    R               REFFLD(CRIB)
     A            AMCRIS    R               REFFLD(CRIS)
     A            AMCRCD    R               REFFLD(CRCD)
     A            AMCRIC    R               REFFLD(CRIC)
     A            AMCRIF    R               REFFLD(CRIF)
     A            AMCRDY    R               REFFLD(CRDY)
     A            AMNCID    R               REFFLD(NCID)
     A            AMLCID    R               REFFLD(LCID)
     A            AMLCIA    R               REFFLD(LCIA)
     A            AMSCAP    R               REFFLD(SCAP)
     A            AMLPAP    R               REFFLD(LPAP)
     A            AMCIIE    R               REFFLD(CIIE)
     A            AMCAIC    R               REFFLD(CAIC)
     A            AMMACI    R               REFFLD(MACI)
     A            AMGACI    R               REFFLD(GACI)
     A            AMCDIS    R               REFFLD(CDIS)
     A            AMDCIA    R               REFFLD(DCIA)
     A            AMOLCR    R               REFFLD(OLCR)
     A            AMOLCB    R               REFFLD(OLCB)
     A            AMOLCS    R               REFFLD(OLCS)
     A            AMLCD     R               REFFLD(LCD)
     A            AMCHTP    R               REFFLD(CHTP)
     A            AMTNLU    R               REFFLD(TNLU)
     A            AMBRTCA   R               REFFLD(BRTCA)
     A            AMNACSG   R               REFFLD(NACSG)
     A            AMR4ACNT  R               REFFLD(MSTS)
     A                                      TEXT('RCII account - Y/N')
     A                                      COLHDG('RCII a/c')
     A            AMENOC    R               TEXT('Extra number of +
     A                                      copies')
     A                                      REFFLD(ENOC)
     A            AMEPNO    R               TEXT('Extra statement +
     A                                      page number')
     A                                      REFFLD(EPNO)
     A            AMECFB    R               TEXT('Extra carried +
     A                                      forward bal.')
     A                                      REFFLD(ECFB)
     A            AMLTAB    R               REFFLD(BRCA)
     A                                      TEXT('Link to BRCA')
     A**Start of change CGL029
     A**********  AMLTAC    R               REFFLD(ACOD)                                      CGL029
     A**********                            TEXT('Link to ACOD')                              CGL029
     A            QQLTAC    R               REFFLD(ACODQQ)
     A**End of change CGL029
     A            AMLTAS    R               REFFLD(ACSQ)
     A                                      TEXT('Link to ACSQ')
     A            AMHCFB    R               REFFLD(CFCB)
     A                                      TEXT('Hist. Carried Forward bal.')
     A            AMPTFR    R               REFFLD(PTFR)
     A            AMHLEX    R               REFFLD(HLEX)
     A            AMA5TIAC  R               REFFLD(ATYP)
     A                                      TEXT('TI Account')
     A                                      COLHDG('TI Account')
     A            AMA5TIAN  R               REFFLD(ZZ006)
     A                                      TEXT('TI Account Number')
     A                                      COLHDG('TI a/c no.')
     A            AMA5TIAS  R               REFFLD(ZZ003)
     A                                      TEXT('TI Account Suffix')
     A                                      COLHDG('TI a/c suffix')
     A            AMEUSB    R               REFFLD(STFQ)
     A                                      TEXT('Statement Balances in Euros')
     A                                      COLHDG('Statement' +
     A                                             'Balances' +
     A                                             'in Euros')
      *                                              Begin /CFT004/
     A            AMIBAN        34          TEXT('IBAN')
     A                                      COLHDG('IBAN')
     A            AMIBSEQN       3          TEXT('IBAN sequence no')
     A                                      COLHDG('IBAN' 'Seq' 'No')
      *                                              End   /CFT004/
     A*=====================================================================
     A            AMFRNT    R               REFFLD(FOTRNID)
     A            AMAFRT    R               REFFLD(FOTRNID)
     A                                      TEXT('Associated Front +
     A                                            Office Transaction Id')
     A                                      COLHDG('Associated' +
     A                                             'Front Office' +
     A                                             'Transaction Id')
     A            AMREPA    R               REFFLD(RPRLOC)
     A            AMTMST    R               REFFLD(TIMESTMP)
      **                                             Begin /CPB001/
     A            AMREPI         1          TEXT('Replication Indicator')
     A                                      COLHDG('Replication' 'Indicator')
      **                                             End   /CPB001/
     A**Start of change CGL029
     A            AMACOD    R               REFFLD(ACOD)
     A            AMLTAC    R               REFFLD(ACOD)
     A                                      TEXT('Link to ACOD')
     A**End of change CGL029
      **Start of change CLE025
      * Begin /CSD027/
     A**********  AMFCCU         6S 0       TEXT('Facility Customer')                         CSD027
     A            AMFCCU         6A         TEXT('Facility Customer')
      * End /CSD027/
     A                                      COLHDG('Facility Customer')
     A            AMCOLF         1A         TEXT('Collateral Flag')
     A                                      COLHDG('Collateral Flag')
     A            AMBCOA        15P 0       TEXT('Blocked Collateral Amount')
     A                                      COLHDG('Blocked Collateral' +
     A                                             'Amount')
     A            AMWCOA        15P 0       TEXT('Warning Collateral Amount')
     A                                      COLHDG('Warning Collateral' +
     A                                             'Amount')
      * Begin /CSD027/
     A**********  AMPFCU         6S 0       TEXT('Previous Facility Customer')                CSD027
     A            AMPFCU         6A         TEXT('Previous Facility Customer')
      * End /CSD027/
     A                                      COLHDG('Previous Facility' +
     A                                             'Customer')
     A            AMPFTP         3S 0       TEXT('Previous Facility Type')
     A                                      COLHDG('Previous Facility' +
     A                                             'Type')
     A            AMPFSQ         2S 0       TEXT('Previous Facility Sequence')
     A                                      COLHDG('Previous Facility' +
     A                                             'Sequence')
      **End of change CLE025
      **Start of change BUG22526
     A            AMACKY        34A         TEXT('SCOLDA Account Key')
     A                                      COLHDG('SCOLDA Account' 'Key')
     A            AMINTL         1A         TEXT('Internal Flag')
     A                                      COLHDG('Internal' 'Flag')
     A            AMTIAB         4A         TEXT('TI Branch Number')
     A                                      COLHDG('TI Branch' 'Number')
      **End of change BUG22526
     A**Start of change CAP086
     A            AMAUTH         1A         TEXT('Automatic Authorisation')
     A                                      COLHDG('Automatic' 'Authorisation')
     A**End of change CAP086
      **Start of change CER047
     A            AMK24C         1A         TEXT('KWG @24c reporting Indicator')
     A                                      COLHDG('KWG @24c reporting' +
     A                                             'Indicator')
      **End of change CER047
     A**Start of change CRE075
     A            AMEFDT         5P 0       TEXT('Effective Date')
     A                                      COLHDG('Effective' +
     A                                             'Date')
     A**End of change CRE075
      **Start of change CRE073
     A            AMDCSP        11P 7       TEXT('Debit Contractual Spread')
     A                                      COLHDG('DR Contractual' +
     A                                             'Spread')
     A            AMDCSG         1A         TEXT('Debit Contractual Spread +
     A                                             Sign')
     A                                      COLHDG('DR Contractual' +
     A                                             'Spread Sign')
     A            AMDRMT         7A         TEXT('Debit Rounding Method')
     A                                      COLHDG('DR Rounding Method')
     A            AMDRFD         4A         TEXT('Debit Rounding +
     A                                             Fraction/Decimal')
     A                                      COLHDG('DR Rounding' +
     A                                             'Fraction/Decimal')
     A            AMCCSP        11P 7       TEXT('Credit Contractual Spread')
     A                                      COLHDG('CR Contractual' +
     A                                             'Spread')
     A            AMCCSG         1A         TEXT('Credit Contractual Spread +
     A                                             Sign')
     A                                      COLHDG('CR Contractual' +
     A                                             'Spread Sign')
     A            AMCRMT         7A         TEXT('Credit Rounding Method')
     A                                      COLHDG('CR Rounding Method')
     A            AMCRFD         4A         TEXT('Credit Rounding +
     A                                             Fraction/Decimal')
     A                                      COLHDG('CR Rounding' +
     A                                             'Fraction/Decimal')
      **End of change CRE073
