      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL New Amount Accruals Detail')
     A**************************************************************
     A*                                                            *
     A*  Midas - General Ledger Module
     A*                                                            *
     A*   PF/NAMACD     NEW AMOUNT ACCRUALS - DETAIL               *
     A*                                                            *
      *  (c) Finastra International Limited 2001                      *
     A*                                                            *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CGL064             Date 10Jul06               *
      *                 CSD027             Date 25Nov05               *
      *                 CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CGL003             Date 16Dec96               *
     A*                                                            *
     A*****************************************************************
      *  MD046248 - Finastra Rebranding                               *
     A*  CGL064 - Associated Customer / Cost Centre Validation     *
     A*           Changes (Recompile)                              *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
     A*   CGL003  -  Recompiled due to changes to AMACCA              *
     A*                                                               *
     A**************************************************************
     A          R AMACCDF                   FORMAT(AMACCD)
