      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL Postings with new Profit Cent')
     A********************************************************************
     A**                                                                **
     A*  Midas     GENERAL LEDGER MODULE
     A**                                                                **
     A**     PF/PSRPRF3  -  POSTINGS WITH NEW PROFIT CENTRE             **
     A**                                                                **
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A**                                                                **
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 25Nov05               *
      *  Prev Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 075323             Date 13Jan98               *
     A**                                                                **
     A********************************************************************
     A*                                                                  *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits                  *
     A*    075323  -  Posting amount not shown on report as 'CR' if      *
     A*               negative. Add new field DRCR to this file to that  *
     A*               posting amount can be formatted correctly.         *
     A*                                                                  *
     A********************************************************************
     A                                      REF(MFRFL)
     A          R PSTPRF3R                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            BRCA      R
      * Begin /CSD027/
     A**********  CNUM      R                                                                 CSD027
     A            CNUM           6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            CCY       R
     A**Start of change CGL029
     A**********  ACOD      R                                                                 CGL029
     A            ACODQQ    R               REFFLD(ACODQQ)
     A**End of change CGL029
     A            ACSQ      R
     A            FDATEM    R
     A            TDATEM    R
     A            CSNM      R
     A            ACNO      R
     A            PSTA      R
     A            PSTD      R
     A            VALD      R
     A            SPOS      R
     A            TRAT      R
      *                                              Begin /075323/
     A            DRCR      R
      *                                              End   /075323/
     A**Start of change CGL029
     A            ACOD      R               REFFLD(ACOD)
     A**End of change CGL029
