      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas ML Non-core multiple language support msgs')
      *****************************************************************
      *                                                               *
      *  Midas - Multiple Language Support Module                     *
      *                                                               *
      *  LF/ZZGBXLANGO - Midas Non-Core Language Message File         *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CPK018  *MOVED     Date 21Nov03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CUT004  *CREATE    Date 01OCT98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CPK018 - Moved to the global layer.                          *
      *  CUT004 - Allow Core and Non-Core mode of Multilanguage       *
      *           compilation                                         *
      *                                                               *
      *****************************************************************
     A          R MLTLANGR                  PFILE(ZZGBXXLANG)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A          K MSGDNM
     A          K MSGFNM
     A          K DSPFNM
