      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas ML Multiple language support msgs')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Multiple Language Support Module                     *
     A*                                                               *
     A*  PF/ZZGBLANGD - MIDAS LANGUAGE MESSAGE FILE                   *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
     A*  LAST AMEND NO. CPK018  *MOVED         DATE 21Nov03           *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  PREV AMEND NO. S01343                 DATE 15AUG91           *
     A*                 S01253                 DATE 14FEB90           *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
     A*  CPK018 - Moved to the global layer.                          *
     A*  S01343 - SC/RR/SD MODULE RENAME PROJECT.                     *
     A*           - MOVED FROM SOURCE FILE SDDDSSRCDT.                *
     A*  S01253 - CREATED FOR MULTI-LANGUAGE                          *
     A*                                                               *
     A*****************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A          R MLTLANGR                  PFILE(ZZGBLANG)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K DSPFNM
     A          K MSGDNB
     A          K MSGFNM
