      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas Total Commitment Lines Audit List Report')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portflio Lending Module.                         *
     A*                                                               *
     A*  PRTF/LB0505P1 - Total Commitment Lines Audit List Report     *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. S01498             DATE 11JUL94               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
     A*  S01498 - Portfolio Lending Upgrade to Release 10.            *
     A*                                                               *
     A*****************************************************************
     A*
     A* Page Headings
     A* -------------
     A          R HEADER1
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*                                              Begin /S01498/
     A***********                       3  7'REFERENCE LB0505P1'
     A                                  3  6'REFERENCE LB0505P1'
     A*                                              End   /S01498/
     A            BJURPT        53A     3 41
     A                                  3101'DATE'
     A            BJMRDT         7A     3106
     A                                  3119'PAGE'
     A            PAGE           4  0   3124EDTCDE(Z)
     A                                  5 46'TOTAL COMMITMENT LINE+
     A                                       S AUDIT LIST REPORT'
     A*                                              Begin /S01498/
     A***********                           UNDERLINE
     A                                  6 46'---------------------+
     A                                       -------------------'
     A                                  6 89'CONSOLIDATED'
     A*                                              End   /S01498/
     A          R HEADER2
     A                                  7  6'BRANCH :'
     A            RRSPTA         3A     7 15
     A          R HEADER3
     A                                  8  6'ACCOUNT OFFICER :'
     A            RRACOF         2A     8 24
     A            RRAREP        30A     8 28
     A                                 10  7'CUST'
     A                                 10 53'COMMITMENT'
     A                                 10 72'START'
     A                                 10 83'EXPIRY'
     A                                 10 96'REVIEW'
     A                                 10109'DAY'
     A                                 10115'LAST ACTIVITY'
     A                                 11  8'NO'
     A                                 11 16'REPORT NAME'
     A                                 11 39'CCY'
     A                                 11 52'LINE AMOUNT'
     A                                 11 65'AUTH'
     A                                 11 72'DATE'
     A                                 11 83'DATE'
     A                                 11 94'DATE'
     A                                 11102'FREQ'
     A                                 11109'NO'
     A                                 11115'ACTION'
     A                                 11122'USER'
     A          R DETAIL
     A            RRCNUM         6         6
     A                                      SPACEB(2)
     A            RRCRNM        20        16
     A            RRCCY          3        39
     A            RRCMTL        18        46
     A            RRAUTH         1        67
     A            RRSTTD         7        71
     A            RREXPD         7        82
     A            RRREVD         7        93
     A            RRREVF         1       104
     A            RRREVN         2  0    109EDTCDE(4)
     A  35        RRAUCT         4       115
     A N35        RRCHTP         6       115
     A            RRUSR         10       122
     A*
     A N23        RRNOT1        35        39
     A N23                                  SPACEB(1)
     A N23        RRNOT2        35        80
     A*
     A N24        RRNOT3        35        39
     A N24                                  SPACEB(1)
     A N24        RRNOT4        35        80
     A*
     A***********                                    Begin /S01498/
     A**Null*Report****************************************************
     A**-----------****************************************************
     A**********R*NODETLS
     A***********                         51'*** NO DETAILS TO REPORT ***'
     A***********                           SPACEB(4)
     A*
     A* Database Error
     A* --------------
     A          R DBERROR
     A                                    51'*** REFERENCE ******'
     A                                    72'DATABASE ERROR ***'
     A                                      SPACEB(4)
     A***********                                    End   /S01498/
     A*
     A* Trailer
     A* -------
     A          R ENDRPT
     A                                    55'*** END OF REPORT ***'
     A                                      SPACEB(4)
