      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas LB Collateral and Security regeneration')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Lending Module                         *
     A*                                                               *
     A*  PRTF/LB0635P2 - Guarantees, Collateral, Security             *
     A*                  Regeneration Missing Instrument Codes Report *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CDL038             Date 10May05               *
      *  Prev Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 S01498             Date 11Aug94               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  CDL038 - Extended Deal Sub Type (Recompile)                  *
      *  CGL029 - Increase Account Code to 10 digits                  *
     A*  S01498 - Portfolio Lending Upgrade to Release 10             *
     A*           (Previously named LB0635P1)                         *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A*                                              Begin /S01498/
     A                                      REF(MFRFL)
     A*                                              End   /S01498/
     A*
     A**   HEADINGS
     A*
     A          R HEADER1                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*                                              Begin /S01498/
     A***********                       3  7'REFERENCE LB0635P1'
     A                                  3  6'REFERENCE LB0635P2'
     A*                                              End   /S01498/
     A            BJURPT        53A     3 41
     A                                  3101'DATE'
     A            BJMRDT         7A     3106
     A                                  3119'PAGE'
     A            PAGE           4  0   3124EDTCDE(Z)
     A                                  5 30'GUARANTEES, COLLATERAL, SECURITY R-
     A                                      EGENERATION MISSING INSTRUMENT REPO-
     A                                      RT'
     A*                                              Begin /S01498/
     A***********                           UNDERLINE
     A                                  6 30'----------------------------------+
     A                                      -----------------------------------+
     A                                      --'
     A  70                              7 89'CONSOLIDATED'
     A*                                              End   /S01498/
     A*
     A**   DETAILS
     A*
     A          R DETAIL1
     A                                      SKIPB(9)
     A*                                              Begin /S01498/
     A**50*******                         44'GUARANTEES PREDEFINED INSTRUMENT I-
     A***********                           S MISSING'
     A**51*******                         44'COLLATERAL PREDEFINED INSTRUMENT I-
     A***********                           S MISSING'
     A**52*******                         45'SECURITY PREDEFINED INSTRUMENT IS -
     A***********                           MISSING'
     A*                                              End   /S01498/
     A  53                                60'ACCOUNT CODE'
     A  56                                58'DEPOSIT   DEPOSIT'
     A                                      SPACEA(1)
     A  56                                58' TYPE     SUBTYPE'
     A                                      SPACEA(1)
     A  60                                58' DEAL     DEAL   '
     A                                      SPACEA(1)
     A  60                                58' TYPE     SUBTYPE'
     A                                      SPACEA(1)
     A*                                              Begin /S01498/
     A**54*******                         51'*** NO DETAILS TO REPORT ***'
     A*                                              End   /S01498/
     A*
     A*
     A          R DETAIL2
     A                                      SPACEB(1)
     A**Start of change CGL029
     A**********  ACOD           4  0     65                                                  CGL029
     A            ACOD          10  0     61
     A**End of change CGL029
     A*
     A*
     A          R DETAIL3
     A                                      SPACEB(1)
     A            P7DTYP         2        60
     A            P7DLST         2        70
     A*                                              Begin /S01498/
     A*
     A***  Database Error
     A*
     A          R DBERROR2                  SPACEB(3)
     A                                    32'*** REFERENCE LB0635 +
     A                                      DATABASE ERROR ***'
     A*                                              End   /S01498/
     A*
     A**   FOOTING
     A*
     A          R FOOTING1
     A*                                              Begin /S01498/
     A***********                         55'*** END OF REPORT ***'
     A***********                           SPACEB(4)
     A                                    51'*** END OF REPORT ***'
     A                                      SPACEB(3)
     A*                                              End   /S01498/
