      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas LB Pledges regeneration')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Lending Module                         *
     A*                                                               *
     A*  PRTF/LB0680P1 - Pledges Regeneration Details Report          *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 30Nov05               *
      *                 CGL029             Date 03Sep01               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*                 080768             Date 04Jan95               *
     A*                 S01498             Date 11Aug94               *
     A*                 B7995              DATE 21JUN91               *
     A*                 B7845              DATE 24MAY91               *
     A*                 B7836              DATE 23MAY91               *
     A*                 R5599              DATE 06MAR91               *
     A*                 R5593              DATE 05MAR91               *
     A*                 R00308             DATE 15AUG90               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits                  *
     A*  080768 - 'AMOUNT WHICH IS PLEDGED' line badly printed.       *
     A*           Miscellanous bad or non appearance.                 *
     A*  S01498 - Portfolio Lending Upgrade to Release 10.            *
     A*  B7995  - LAYOUT AMENDMENT FOR FIXED PLEDGES (UNMARKED)       *
     A*  B7845  - LAYOUT AMENDMENTS                                   *
     A*  B7836  - PRINT CUSTOMER INSTEAD OF PORTFOLIO FOR THE ASSETS  *
     A*  R5599  - MINUS SIGN NOT CORRECT                              *
     A*  R5593  - PLEDGES CALCULATION REPORT WRONG                    *
     A*  R00308 - OUTPUT NULL REPORT EVEN IF NO RECORDS ARE SELECTED  *
     A*                                                               *
     A*****************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
      *                                              Begin /S01498/
     A                                      REF(MFRFL)
      *                                              End   /S01498/
     A*
     A* Page Headings
     A* -------------
      *                                              Begin /S01498/
     A**********R HEADER0
     A          R HEADER0                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A***********                       3  7'REFERENCE LB0680P0'
     A                                  3  6'REFERENCE LB0680P1'
      *                                              End   /S01498/
     A            BJURPT        53A     3 41
     A                                  3101'DATE'
     A            BJMRDT         7A     3106
     A                                  3119'PAGE'
     A            PAGE2          4  0   3124EDTCDE(Z)
     A                                  5 43'PLEDGES CALCULATIONS DETAILS REPOR-
     A                                      T'
      *                                              Begin /S01498/
     A***********                           UNDERLINE
     A                                  6 43'----------------------------------+
     A                                      -'
     A  46                              6 89'CONSOLIDATED'
      *                                              End   /S01498/
     A*                                                             /* R00308 */
     A* Details
     A* -------
     A          R DETAIL0
     A*                                                             /* R00308 */
     A                                  8  3'BENEFICIARY CUST.'
      * Begin /CSD027/
     A**********  RRCNUM         6  0     +2                                                  CSD027
     A            RRCNUM         6A       +2
      * End /CSD027/
     A                                    +3'GIVEN BY CUST.'
      * Begin /CSD027/
     A**********  RRISSB         6  0     +2                                                  CSD027
     A            RRISSB         6A       +2
      * End /CSD027/
     A                                    +3'COLL/SEQ'
     A            RRBPSN         3  0     +2
     A            RRSEQN         3  0     +1
     A                                    +3'CODE'
     A            RRCODE         3        +2
     A                                    +3'PLEDGE ALLOWED'
     A            RRALLW         1        +2
     A                                 10  3'USED TO SECURE - LOAN'
     A* B7845 START
     A************RRUTSL         6  0     +2
     A            RRUTSL         6        +2
     A* B7845 END
     A                                    +3'FACILITY'
     A            RRUTSF         5        +2
     A                                    +3'PORTFOLIO'
     A            RRUTSP         4        +2
     A**                                  /*080768 BEGIN*/
     A                                    +3'ACCOUNT'
     A**Start of change CGL029
     A**********  RRACCN        18A       +2                                                  CGL029
     A            RRACCN        24A       +2
     A**End of change CGL029
     A**                                  /*080768 END  */
     A                                 14  3'. ISSUER AVAILABLE LENDING'
     A            R01           13  2     +1EDTCDE(J)
     A* R5599 START
     A************                        +1'= LENDING POWER _ TOTAL PLEDGES IS-
     A************                        +1'= LENDING POWER - TOTAL PLEDGES IS-
     A                                    +2'= LENDING POWER - TOTAL PLEDGES IS-
     A* R5599 END
     A                                      SUED/UTILISED'
     A* R5599 START
     A************                     15 48'='
     A************R02           13  2  15 50EDTCDE(J)
     A                                 16 50'='
     A            R02           13  2  16 50EDTCDE(J)
     A************                        +1'_'
     A                                    +1'-'
     A* R5599 END
     A            R03           13  2     +1EDTCDE(J)
     A* R5599 START
     A************                     17 50'= COMMITMENT LINE _ TOTAL PLEDGES -
     A                                 18 50'= COMMITMENT LINE - TOTAL PLEDGES -
     A* R5599 END
     A                                      ISSUED/UTILISED'
     A* R5599 START
     A************                     18 48'='
     A************R04           13  2  18 50EDTCDE(J)
     A                                 20 50'='
     A            R04           13  2  20 50EDTCDE(J)
     A************                        +1'_'
     A                                    +1'-'
     A* R5599 END
     A            R05           13  2     +1EDTCDE(J)
     A* R5599 START
     A************                     20 50'= COMMITMENT LINE _ OWN EXPOSURE _-
     A                                 22 50'= COMMITMENT LINE - OWN EXPOSURE --
     A* R5599 END
     A* B7845 START
     A************                          TOTAL PLEDGES ISSUED/UTILISED'
     A                                       TOTAL PLEDGES ISSUED/UTILISED'
     A* B7845 END
     A* R5599 START
     A************                     21 48'='
     A************R06           13  2  21 50EDTCDE(J)
     A                                 24 50'='
     A            R06           13  2  24 50EDTCDE(J)
     A************                        +1'_'
     A                                    +1'-'
     A* R5599 END
     A            R07           13  2     +1EDTCDE(J)
     A* R5599 START
     A************                        +1'_'
     A                                    +1'-'
     A* R5599 END
     A            R08           13  2     +1EDTCDE(J)
     A* R5599 START
     A************                     23 50'= LENDING POWER + PLEDGES RECEIVED-
     A************                           - TOTAL EXPOSURE'
     A************                     24 48'='
     A                                 26 50'= LENDING POWER + PLEDGES RECEIVED-
     A                                       - TOTAL EXPOSURE'
     A                                 28 50'='
     A* R5599 END
     A            R09           13  2     +1EDTCDE(J)
     A                                    +1'+'
     A            R10           13  2     +1EDTCDE(J)
     A* R5599 START
     A************                        +1'_'
     A                                    +1'-'
     A* R5599 END
     A            R11           13  2     +1EDTCDE(J)
     A* R5599 START
     A************                     26  3'. AMOUNT WHICH IS PLEDGED   "FXD"'
     A**                                       /*080768 BEGIN*/
     A*N77********                     31  3'. AMOUNT WHICH IS PLEDGED        '
     A**77********                     31  3'. AMOUNT WHICH IS PLEDGED   "FXD"'
     A N77                             31  3'. AMOUNT WHICH IS PLEDGED'
     A N77        RRTYP1         5        +2
     A N77                                +1'PLEDGE AMOUNT'
     A N77        R13           13  2     +1EDTCDE(J)
     A N77                                +1'AVAILABLE LENDING'
     A N77        R14           13  2     +1EDTCDE(J)
     A N77                                +1'PLEDGE PERCENTAGE'
     A N77        RRPER1         3  0     +1EDTCDE(J)
     A N77                                +1'%'
     A  77                             31  3'. AMOUNT WHICH IS PLEDGED'
     A  77        RRTYP2         5        +2
     A  77                                +1'PLEDGE AMOUNT'
     A  77        PGCCY          3        +3
     A  77        R12           13  2     +1EDTCDE(J)
     A  77        LBCCY          3        +3
     A  77        R22           13  2     +1EDTCDE(J)
     A  77                                +1'PLEDGE PERCENTAGE'
     A  77        RRPER2         3  0     +1EDTCDE(J)
     A  77                                +1'%'
     A**                                       /*080768 END*/
     A* R5599 END
     A* R5599 START
     A************                     28  3'                            "LMT"'
     A**                                       /*080768 BEGIN*/
     A*N77********                     33  3'                            "LMT"'
     A**                                       /*080768 END  */
     A* R5599 END
     A* R5599 START
     A************                     30  3'                            "GEN"'
     A**                                       /*080768 BEGIN*/
     A*N77********                     35  3'                            "GEN"'
     A**                                       /*080768 END  */
     A* R5599 END
     A**                                  +1'PORTFOLIO'
     A**          RRPORP         4        +1
     A* B7836 START
     A************                        +1'PORTFOLIO ASSETS'
     A* B7845 START
     A************                        +1'CUSTOMER ASSETS'
     A* B7836 END
     A* R5599 START
     A************R15           13  2     +1EDTCDE(J)
     A************R15           13  2     +2EDTCDE(J)
     A************                     32  3'                                 '
     A************                     37  3'                                 '
     A* R5599 END
     A************                        +1'         '
     A************FLD02          4        +1
     A************                        +1'AVAILABLE LENDING'
     A************R16           13  2     +1EDTCDE(J)
     A* B7845 END
     A* R5599 START
     A************                     34  3'. BENEFICIARY EXPOSURE NEEDS ='
     A* B7845 START
     A************                     40  3'. BENEFICIARY EXPOSURE NEEDS ='
     A N77                             40  3'. BENEFICIARY NEEDS  ='
     A* B7845 END
     A* R5599 END
     A N77        R17           13  2     +1EDTCDE(J)
     A**                                  /*080768 BEGIN*/
     A*N77*******                         +1'='
     A N77N79                             +1'='
     A**                                  /*080768 END  */
     A* R5599 START
     A************                        +1'TOTAL EXPOSURE _ TOTAL BORROWING P-
     A**                                  /*080768 BEGIN*/
     A*N77********                        +1'TOTAL EXPOSURE - TOTAL BORROWING P-
     A************                          OWER'
     A*N77********                        +1'='
     A*N77********R18           13  2     +1EDTCDE(J)
     A N77N79                             +1'TOTAL EXPOSURE - TOTAL BORROWING P-
     A                                      OWER'
     A N77N79                             +1'='
     A N77N79     R18           13  2     +1EDTCDE(J)
     A**                                  /*080768 END  */
     A* R5599 START
     A************                        +1'_'
     A**                                  /*080768 BEGIN*/
     A*N77********                        +1'-'
     A N77N79                             +1'-'
     A**                                  /*080768 END  */
     A* R5599 END
     A************R19           13  2     +1EDTCDE(J)
     A**                                  /*080768 BEGIN*/
     A*N77********R19           13  2     +0EDTCDE(J)
     A N77N79     R19           13  2     +0EDTCDE(J)
     A**                                  /*080768 END  */
     A* R5599 START
     A************                     36  3'. EFFECTIVE AMOUNT'
     A N77                             43  3'. EFFECTIVE AMOUNT'
     A* R5599 END
     A* R5593 START
     A************                        +1'='
     A* R5593 END
     A N77                                +3'='
     A N77        R20           13  2     +1EDTCDE(J)
     A* R5593 START
     A************                        +1'= USED TO SECURE'
     A************                     36 60'= AMOUNT WHICH IS PLEDGED * EXPOSU-
     A************                          RE COVERED / TOTAL PLEDGED AMOUNT'
     A************                     38 58'='
     A************R21           13  2  38 60EDTCDE(J)
     A************                        +1'*'
     A************R22           13  2     +1EDTCDE(J)
     A************                        +1'/'
     A************R23           13  2     +1EDTCDE(J)
     A************                     40  3'. AMOUNT USED'
     A************                        +1'='
     A************R24           13  2     +1EDTCDE(J)
     A* R5599 START
     A************                     40  3'. AMOUNT USED ('
     A* B7845 START
     A************                     46  3'. AMOUNT USED ('
     A                                 46  3'. AMOUNT USED        ='
     A* R5599 END
     A************RRPLEP         3  0     +0
     A************                        +0'%) ='
     A            R24           13  2     +1EDTCDE(J)
     A************                        +1'PERCENTAGE ='
     A************                        +1'='
     A************RRPLEP         3  0     +1
     A************                        +0'%'
     A* R5593 END
     A*
      *                                              Begin /S01498/
     A**Null*Report****************************************************
     A**-----------****************************************************
     A**********R NULL0
     A***********                         51'*** NO DETAILS TO REPORT ***'
     A***********                           SPACEB(4)
      *                                              End   /S01498/
     A*
     A* Footing
     A* -------
     A          R FOOTING0
      *                                              Begin /S01498/
     A***********                         55'*** END OF REPORT ***'
     A***********                           SPACEB(4)
     A                                    51'*** END OF REPORT ***'
     A                                      SPACEB(3)
     A*
     A* Dbase Error
     A* -----------
     A          R LB0680E1
     A                                      SPACEB(3)
     A                                    32'*** REFERENCE LB0680'
     A                                    53'DATABASE ERROR ***'
      *                                              End   /S01498/
