      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas LB Accrued Interests regeneration')              *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Lending Module                         *
     A*                                                               *
     A*  PRTF/LB0690P2 - Accrued Interests Regeneration Report        *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CDL038             Date 10May05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 S01498             Date 11Aug94               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CLE148 - Alpha Loan Reference                                *
      *  CDL038 - Extended Deal Sub Type (Recompile)                  *
     A*  S01498 - Portfolio Lending Upgrade to Release 10.            *
     A*                                                               *
     A*****************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
      *                                              Begin /S01498/
     A                                      REF(MFRFL)
      *                                              End   /S01498/
     A*
     A**   HEADINGS
     A*
      *                                              Begin /S01498/
     A**********R HEADER1
     A          R HEADER1                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A***********                       3  7'REFERENCE LB0690P1'
     A                                  3  6'REFERENCE LB0690P2'
      *                                              End   /S01498/
     A            BJURPT        53A     3 41
     A                                  3101'DATE'
     A            BJMRDT         7A     3106
     A                                  3119'PAGE'
     A            PAGE           4  0   3124EDTCDE(Z)
     A                                  5 38'ACCRUED INTERESTS REGENERATION +
     A                                      MISSING INSTRUMENT REPORT'
      *                                              Begin /S01498/
     A***********                           UNDERLINE
     A                                  6 38'-------------------------------+
     A                                      -------------------------'
     A  46                              7 89'CONSOLIDATED'
      *                                              End   /S01498/
     A**
     A          R HEADER2
     A                                     1' '
     A                                      SPACEB(3)
     A                                    45'DEAL NUMBER'
     A                                    63'DEAL TYPE'
     A                                    76'DEAL SUBTYPE'
     A                                     1' '
     A                                      SPACEB(1)
     A*
     A**   DETAILS FOR DEALS
     A*
     A          R DETAIL1
     A                                      SPACEB(1)
     A            RRDLNO         6  0     47
     A            RRDTYP         2A       67
     A            RRDLST         2A       80
     A*
     A**   NULL REPORT
     A*
     A**
     A          R HEADER3
     A                                     1' '
     A                                      SPACEB(3)
     A                                    45'LOAN NUMBER'
     A                                    63'LOAN TYPE'
     A                                    76'LOAN SUBTYPE'
     A                                     1' '
     A                                      SPACEB(1)
     A*
     A**   DETAILS FOR LOANS
     A*
     A          R DETAIL2
     A                                      SPACEB(1)
      **Start of change CLE148
     A**********  RRLNRF         6  0     47                                                  CLE148
     A            RRLNRF         6A       47
      **End of change CLE148
     A            RRLTYP         2A       67
     A            RRLSUT         2A       80
     A**
      *                                              Begin /S01498/
     A**********R HEADER4
     A***********                          1' '
     A***********                           SPACEB(3)
     A***********                         43'DEPOSIT NUMBER'
     A***********                         61'DEPOSIT TYPE'
     A***********                         75'DEPOSIT SUBTYPE'
     A***********                          1' '
     A***********                           SPACEB(1)
     A*****************************************************************
     A*****DETAILS*FOR*FIDUCIARY*DEPOSITS******************************
     A*****************************************************************
     A**********R DETAIL3
     A***********                           SPACEB(1)
     A*********** RRFDDR         6  0     47
     A*********** RRFDTP         2A       67
     A*********** RRCHTP         2A       80
     A*
     A*****NULL*REPORT*************************************************
     A*****************************************************************
     A**********R NULL1
     A**********                          51'*** NO DETAILS TO REPORT ***'
     A**********                            SPACEB(2)
      *                                              End   /S01498/
     A*
     A**   FOOTING
     A*
     A          R FOOTING1
      *                                              Begin /S01498/
     A***********                         55'*** END OF REPORT ***'
     A***********                           SPACEB(4)
     A                                    51'*** END OF REPORT ***'
     A                                      SPACEB(3)
     A*
     A* Dbase Error
     A* -----------
     A          R LB0690E2
     A                                      SPACEB(3)
     A                                    32'*** REFERENCE LB0690'
     A                                    53'DATABASE ERROR ***'
      *                                              End   /S01498/
