      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas LB Accrued Interests regeneration')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Lending Module                         *
     A*                                                               *
     A*  PRTF/LB0690P1 - Accrued Interest Regeneration Report         *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. S01498             DATE 11AUG94               *
     A*  PREV AMEND NO. R5640              DATE 08MAR91               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
     A*  S01498 - Portfolio Lending Upgrade to Release 10.            *
     A*  R5640  - DR/CR ERROR IN DEALING                              *
     A*                                                               *
     A*****************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
      *                                              Begin /S01498/
     A                                      REF(MFRFL)
      *                                              End   /S01498/
     A*
     A* Page Headings
     A* -------------
      *                                              Begin /S01498/
     A**********R HDR0FT1
     A          R HDR0FT1                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A***********                       3  7'REFERENCE LB0690P0'
     A                                  3  6'REFERENCE LB0690P1'
      *                                              End   /S01498/
     A            BJURPT        53A     3 41
     A                                  3101'DATE'
     A            BJMRDT         7A     3106
     A                                  3119'PAGE'
     A            PAGE2          4  0   3124EDTCDE(Z)
     A                                  5 48'ACCRUED INTERESTS REGEN+
     A                                      ERATION - DEALING'
      *                                              Begin /S01498/
     A***********                           UNDERLINE
     A                                  6 48'-----------------------+
     A                                      -----------------'
     A  46                              6 89'CONSOLIDATED'
      *                                              End   /S01498/
     A                                  8  3'CUSTOMER'
     A                                  8 13'DEAL'
     A                                  9 13'TYPE'
     A                                  8 19'DEAL'
     A                                  9 19'SUB'
     A                                 10 19'TYPE'
     A                                  8 25'INST'
     A                                  8 31'CCY'
     A                                  8 37'ACCRUAL'
     A                                  9 38'FROM'
     A                                 10 38'DATE'
     A                                  8 47'ACCRUAL'
     A                                  9 46'CTL DATE'
     A                                  8 58'INTEREST'
     A                                  9 60'RATE'
     A                                  8 73'PRINCIPAL'
     A                                  8 89'ACCRUED INTEREST'
     A                                  9 93'TO DATE'
     A                                  8113'CONVERTED'
     A                                  9109'ACCRUED INTEREST'
     A                                 11  1' '
     A          R HDR0FT2
      *                                              Begin /S01498/
     A***********                       3  7'REFERENCE LB0690P0'
     A                                  3  7'REFERENCE LB0690P1'
      *                                              End   /S01498/
     A            BJURPT        53A     3 41
     A                                  3101'DATE'
     A            BJMRDT         7A     3106
     A                                  3119'PAGE'
     A            PAGE2          4  0   3124EDTCDE(Z)
     A                                  5 48'ACCRUED INTERESTS REGEN+
     A                                      ERATION - LENDING'
      *                                              Begin /S01498/
     A***********                           UNDERLINE
     A                                  6 48'-----------------------+
     A                                      -----------------'
     A  46                              6 89'CONSOLIDATED'
      *                                              End   /S01498/
     A                                  8  3'CUSTOMER'
     A                                  8 13'LOAN'
     A                                  9 13'TYPE'
     A                                  8 19'LOAN'
     A                                  9 19'SUB'
     A                                 10 19'TYPE'
     A                                  8 25'INST'
     A                                  8 31'CCY'
     A                                  8 37'ACCRUAL'
     A                                  9 38'FROM'
     A                                 10 38'DATE'
     A                                  8 47'ACCRUAL'
     A                                  9 46'CTL DATE'
     A                                  8 58'INTEREST'
     A                                  9 60'RATE'
     A                                  8 73'PRINCIPAL'
     A                                  8 89'ACCRUED INTEREST'
     A                                  9 93'TO DATE'
     A                                  8113'CONVERTED'
     A                                  9109'ACCRUED INTEREST'
     A                                 11  1' '
     A          R HDR0FT3
      *                                              Begin /S01498/
     A***********                       3  7'REFERENCE LB0690P0'
     A                                  3  7'REFERENCE LB0690P1'
      *                                              End   /S01498/
     A            BJURPT        53A     3 41
     A                                  3101'DATE'
     A            BJMRDT         7A     3106
     A                                  3119'PAGE'
     A            PAGE2          4  0   3124EDTCDE(Z)
     A                                  5 48'ACCRUED INTERESTS REGEN+
     A                                      ERATION - SECURITIES'
      *                                              Begin /S01498/
     A***********                           UNDERLINE
     A                                  6 48'-----------------------+
     A                                      --------------------'
     A  46                              7 89'CONSOLIDATED'
      *                                              End   /S01498/
     A                                  8  3'CUSTOMER'
     A                                  8 16'SECURITY'
     A                                  8 28'INSTRUMENT'
     A                                  8 41'CCY'
     A                                  8 46'FROM DATE'
     A                                  8 58'TO DATE'
     A                                  8 74'NOMINAL'
     A                                  8 93'INTEREST'
     A                                  9 94'AMOUNT'
     A                                  8113'CONVERTED'
     A                                  9114'INTEREST'
     A                                 11  1' '
      *                                              Begin /S01498/
     A**********R HDR0FT4
     A***********                       3  7'REFERENCE LB0690P0'
     A*********** BJURPT        53A     3 41
     A***********                       3101'DATE'
     A*********** BJMRDT         7A     3106
     A***********                       3119'PAGE'
     A*********** PAGE2          4  0   3124EDTCDE(Z)
     A***********                       5 48'ACCRUED INTERESTS REGENER+
     A***********                           ATION - FIDUCIARY DEPOSITS'
     A***********                           UNDERLINE
     A***********                       8  3'CUSTOMER'
     A***********                       8 13'DEAL'
     A***********                       9 13'TYPE'
     A***********                       8 19'DEAL'
     A***********                       9 19'SUB'
     A***********                      10 19'TYPE'
     A***********                       8 25'INST'
     A***********                       8 31'CCY'
     A***********                       8 37'ACCRUAL'
     A***********                       9 38'FROM'
     A***********                      10 38'DATE'
     A***********                       8 47'ACCRUAL'
     A***********                       9 46'CTL DATE'
     A***********                       8 58'INTEREST'
     A***********                       9 60'RATE'
     A***********                       8 73'PRINCIPAL'
     A***********                       8 89'ACCRUED INTEREST'
     A***********                       9 93'TO DATE'
     A***********                       8113'CONVERTED'
     A***********                       9109'ACCRUED INTEREST'
     A***********                      11  1' '
      *                                              End   /S01498/
     A          R DETLS01
     A            R01CNM         6         4
     A                                      SPACEB(1)
     A            R01DLT         2        14
     A            R01DLS         2        20
     A            R01INS         3        26
     A            R01CCY         3        31
     A            R01AFD         7        36
     A            R01ACD         7        46
     A            R01ITR         9        58
     A            R01PCP        18        68
     A            R01ACI        18        88
     A* R5640 START
     A            R01CR1         2       106
     A************R01CAI        18       108
     A            R01CAI        18       110
     A            R01CR2         2       128
     A* R5640 END
     A*
     A          R DETLS02
     A            R02CNM         6         4
     A                                      SPACEB(1)
     A            R02LNT         2        14
     A            R02LNS         2        20
     A            R02INS         3        26
     A            R02CCY         3        31
     A            R02AFD         7        36
     A            R02ACD         7        46
     A            R02ITR         9        58
     A            R02PCP        18        68
     A            R02ACI        18        88
     A            R02CAI        18       108
     A*
     A          R DETLS03
     A            R03CNM         6         4
     A                                      SPACEB(1)
     A            R03SEC        10        15
     A            R03INS         3        32
     A            R03CCY         3        41
     A            R03FRD         7        47
     A            R03TOD         7        58
     A            R03NOM        18        68
     A            R03INA        18        88
     A            R03CVI        18       108
     A*
      *                                              Begin /S01498/
     A**********R DETLS04
     A*********** R04CNM         6         4
     A***********                           SPACEB(1)
     A*********** R04DLT         2        14
     A*********** R04DLS         2        20
     A*********** R04INS         3        26
     A*********** R04CCY         3        31
     A*********** R04AFD         7        36
     A*********** R04ACD         7        46
     A*********** R04ITR         9        58
     A*********** R04PCP        18        68
     A*********** R04ACI        18        88
     A*********** R04CAI        18       108
      *                                              End   /S01498/
     A*
     A* Null Report
     A* -----------
     A          R NULL0
     A                                    51'*** NO DETAILS TO REPORT ***'
     A                                      SPACEB(4)
     A*
     A* Footing
     A* -------
     A          R FOOTING0
      *                                              Begin /S01498/
     A***********                         55'*** END OF REPORT ***'
     A***********                           SPACEB(4)
     A                                    51'*** END OF REPORT ***'
     A                                      SPACEB(3)
     A*
     A* Dbase Error
     A* -----------
     A          R LB0690E1
     A                                      SPACEB(3)
     A                                    32'*** REFERENCE LB0690'
     A                                    53'DATABASE ERROR ***'
      *                                              End   /S01498/
