      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas LB Dealing Regeneration')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Lending Module                         *
     A*                                                               *
     A*  PRTF/LB0610P2 - Dealing Regeneration Missing Instrument Rep. *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. S01498             DATE 11AUG94               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
     A*  S01498 - Portfolio Lending Upgrade to Release 10             *
     A*           (Previously named LB0610P1)                         *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A*                                              Begin /S01498/
     A                                      REF(MFRFL)
     A*                                              End   /S01498/
     A*
     A**   HEADINGS
     A*
     A          R HEADER1                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*                                              Begin /S01498/
     A***********                       3  1'      REFERENCE LB0610P1    '
     A                                  3  1'     REFERENCE LB0610P2     '
     A*                                              End   /S01498/
     A            BJURPT        53A     3 41
     A                                  3 97'    DATE'
     A            BJMRDT         7A     3106
     A                                  3115'    PAGE'
     A            PAGE           4  0   3124EDTCDE(Z)
     A                                  5 42'DEALING REGENERATION MISSING -
     A                                      INSTRUMENT REPORT'
     A*                                              Begin /S01498/
     A***********                           UNDERLINE
     A                                  6 42'-----------------------------+
     A                                      -----------------'
     A  39                              6 89'CONSOLIDATED'
     A*                                              End   /S01498/
     A**
     A          R HEADER2
     A                                     1' '
     A                                      SPACEB(2)
     A                                    40'    DEAL NUMBER  '
     A                                    58'    DEAL TYPE  '
     A                                    75'DEAL SUBTYPE     '
     A                                     1' '
     A                                      SPACEB(1)
     A*
     A**   DETAILS
     A*
     A          R DETAILF
     A                                      SPACEB(1)
     A            RRNUMB         6  0     46
     A            RRTYPE         2A       66
     A            RRSUBT         2A       79
     A*
     A*                                              Begin /S01498/
     A*****NULL*REPORT
     A***********
     A**********R NULL1
     A***********                         51'*** NO DETAILS TO REPORT ***'
     A***********                           SPACEB(2)
     A*
     A***  Database Error
     A*
     A          R DBERROR2                  SPACEB(3)
     A                                    32'*** REFERENCE LB0610 +
     A                                      DATABASE ERROR ***'
     A*                                              End   /S01498/
     A*
     A**   FOOTING
     A*
     A          R FOOTING1
     A*                                              Begin /S01498/
     A***********                         55'*** END OF REPORT ***'
     A***********                           SPACEB(4)
     A                                    51'*** END OF REPORT ***'
     A                                      SPACEB(3)
     A*                                              End   /S01498/
