      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas UT FNDUPDSRC members containing string')         *
      *****************************************************************
      *                                                               *
      *  Midas - Utilities                                            *
      *                                                               *
      *  UTMBRSPD - Members containing string                         *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2012            *
      *                                                               *
      *  Last Amend No. CUT015   *CREATE   Date 19Apr12               *
      *  Prev Amend No. xxxxxxxx           Date ddMmmyy               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CUT015 - Bring UPDSRC into core.                             *
      *                                                               *
      *****************************************************************
      *
     A          R UTMBRSD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2012')
      *
     A            FUWLIB        10A         TEXT('Library')
     A                                      COLHDG('Library')
     A            FUSRCF        10A         TEXT('Source file')
     A                                      COLHDG('Source' 'File')
     A            FUMBR         10A         TEXT('Member')
     A                                      COLHDG('Member')
     A            FUFSRC         1A         TEXT('Source found')
     A                                      COLHDG('Src.' 'Fnd.')
     A            FUCODE       100A         TEXT('Source code')
     A                                      COLHDG('Source Code')
      *
      *
     A          K FUWLIB
     A          K FUSRCF
     A          K FUMBR
