      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas UT Validation List entries')                     *
      *****************************************************************
      *                                                               *
      *  Midas - Utilities Module                                     *
      *                                                               *
      *  PF/UTVLLEPD - Validation List entries                        *
      *                                                               *
      *  (c) Finastra International Limited 2010                      *
      *                                                               *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CUT007             Date 17Nov14               *
      *                 BUG27989 *CREATE   Date 08Aug10               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CUT007 - Make UTWRKVLDL file driven.                         *
      *  BUG27989 - HATS should run with/without LDAP                 *
      *                                                               *
      *****************************************************************
      *
     A          R UTVLLED0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2010')
      *
     A            LEENTI       100A         TEXT('Entry ID')
     A                                      COLHDG('Entry ID')
     A            LEENTD      1000A         TEXT('Entry data')
     A                                      COLHDG('Entry Data')
      *
     A          K LEENTI
