      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SE Book Positions by Branch')
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *    LF/BKPOSBR  -  BOOK POSITIONS BY BRANCH FIRST              *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Last Amend No. 246619             Date 29Mar07               *
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSE065             Date 08Nov04               *
      *                 CAS006             Date 21Jan03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 S01486             Date 06Jun94               *
      *                   052254             Date 05Jan94             *
      *                   E29170             DATE 30OCT91             *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  246619 - Recompile over changes in PF/BKPOSD.                *
      *  CSE065 - Const. Yld Amort. on Mortgage backed assets         *
      *           (Recompile)                                         *
      *  CAS006 - Hedge Accounting Phase B (Recompile)                *
     A*    S01486 - Portfolio Management Upgrade(RECOMPILE)              *
     A*    052254 - RECOMPILED as CURRENT FACTOR amended from 9,8        *
     A*             to 10,9                                              *
     A*    E29170 - Created for Report Control Facility changes          *
     A*                                                                  *
      *****************************************************************
     A*
     A                                      UNIQUE
     A          R BKPOSDF                   PFILE(BKPOSD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K BPBA
     A          K BPSC
     A          K BPBK
     A          K BPMK
     A          K BPTV
     A          K BPPD
     A          S RECI                      COMP(NE '*')
