      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_DL                                                        *
/*EXI *  TEXT('Midas SE Book positions - BPTV = V')
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *  LF/BKPOSL1 - BOOK POSITIONS (VALUE DATE)                     *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Last Amend No. 246619             Date 29Mar07               *
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSE065             Date 08Nov04               *
      *                 CAS006             Date 21Jan03               *
      *                 CGL018   *CREATE   Date 30Sep02               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  246619 - Recompile over changes in PF/BKPOSD.                *
      *  CSE065 - Const. Yld Amort. on Mortgage backed assets         *
      *           (Recompile)                                         *
      *  CAS006 - Hedge Accounting Phase B (Recompile)                *
      *  CGL018 - Risk Weighted Asset                                 *
      *                                                               *
      *****************************************************************
     A          R BKPOSDF                   PFILE(BKPOSD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
     A          K BPSC
      *
     A          S BPTV                      COMP(EQ 'V')
