      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SE Bulk Trades Extended Settlements')            *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Securities Trading Module
     A*                                                               *
     A*  LF/BULKSDY2 - TRADE DETAILS EXTENDED SETTLEMENTS             *
     A*                NOTE: LF/BULKSDY2 IS A COPY OF PF/TRADSDY2
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CSW210             Date 04May10               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 BUG2606            Date 14May04               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 CSE028             Date 06Jun01               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CSW098             Date 24Mar98               *
      *                 CSW003             Date 12Feb96               *
     A*                 S01401             DATE 15JUN93               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSW210 - SWIFT 2010 Changes (Recompile)                      *
      *  BUG2606 - Extension and Extended Settlements for Bulk Trades *
      *            and SE Trades must have the same format            *
      *            (Recompile).                                       *
      *  CSE028 - Standing Settlement Instructions Enhancement.       *
      *           (Recompiled).                                       *
     A*  CSW098 - Recompiled as new field added to PF/BULKSDX2.       *
     A*  CSW003 - MT5xx Message Generation - Phase 2                  *
     A*  S01401 - MT5xx SWIFT Messages Feature:                       *
     A*          - New File.                                          *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
      *
     A                                      UNIQUE
     A          R TRADSDD2                  PFILE(BULKSDX2)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A          K B2TDRF
     A*****                                          Begin /CSW003/
     A          K B2WHEN
     A*****                                          End   /CSW003/
