      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_DL                                                        *
/*EXI *  TEXT('Midas SE Customer and User Depot Position')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Securities Trading Module                            *
     A*                                                               *
     A*  LF/CUDPA  - CUSTOMER AND USER DEPOT POSITIONS BY BRANCH      *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      *  Prev Amend No. 233566             Date 17May05               *
      * Midas Release 4.04 -------------------------------------------*
      *                 CGL031             Date 05Jul04               *
      *                 CGL035             Date 01Mar05               *
      *                 CGP007             Date 09Nov04               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*                 S01496             Date 06Feb95               *
     A*                 S01514 *CREATE     Date 10Aug94               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  233566 - Add field to CDEPPD (Recompile)                     *
      *  CGL031 - Taxation of Savings Income (Recompile)              *
      *  CGL035 - EUSD Upgrade to Midasplus (Recompile)               *
     A*  CGP007 - Depot Positions Global View (Recompiled)            *
     A*  S01496 - Jyske enhancements (Recompile)                      *
     A*  S01514 - SE Depot Holding Report and Enquiry                 *
     A*                                                               *
     A*****************************************************************
     A*
     A*         /////////////////////////////////////////
     A*        // WARNING: When creating this logical //
     A*       //   file, take option                 //
     A*      //                   MAINTENANCE (*DLY)//
     A*     /////////////////////////////////////////
     A*
     A*****************************************************************
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A          R CDEPPDF                   PFILE(CDEPPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K CDSN
     A          K CDPT
     A          K CDPA
     A          K *NONE
     A          K CDCN
     A          S CDNT                      COMP(NE 0)
     A            RECI                      COMP(EQ 'D')
     A          S CDNV                      COMP(NE 0)
     A            RECI                      COMP(EQ 'D')
     A          S CDNS                      COMP(NE 0)
     A            RECI                      COMP(EQ 'D')
     A          S SNPT                      COMP(NE 0)
     A            RECI                      COMP(EQ 'D')
     A          S CDST                      COMP(NE 0)
     A            RECI                      COMP(EQ 'D')
     A          S CNPV                      COMP(NE 0)
     A            RECI                      COMP(EQ 'D')
     A          S CNSV                      COMP(NE 0)
     A            RECI                      COMP(EQ 'D')
     A*
     A          R UDEPPDF                   PFILE(UDEPPD)
     A          K UDSN
     A          K UDPT
     A          K UDBA
     A          K UDBK
     A          K *NONE
     A          S UDNT                      COMP(NE 0)
     A            RECI                      COMP(EQ 'D')
     A          S UDNV                      COMP(NE 0)
     A            RECI                      COMP(EQ 'D')
     A          S UDNS                      COMP(NE 0)
     A            RECI                      COMP(EQ 'D')
     A          S UDTP                      COMP(NE 0)
     A            RECI                      COMP(EQ 'D')
     A          S UDTS                      COMP(NE 0)
     A            RECI                      COMP(EQ 'D')
     A          S UDPV                      COMP(NE 0)
     A            RECI                      COMP(EQ 'D')
     A          S UDSV                      COMP(NE 0)
     A            RECI                      COMP(EQ 'D')
     A          S UNRT                      COMP(NE 0)
     A            RECI                      COMP(EQ 'D')
     A          S UNRV                      COMP(NE 0)
     A            RECI                      COMP(EQ 'D')
     A          S USNT                      COMP(NE 0)
     A            RECI                      COMP(EQ 'D')
     A          S USNR                      COMP(NE 0)
     A            RECI                      COMP(EQ 'D')
     A          S USNV                      COMP(NE 0)
     A            RECI                      COMP(EQ 'D')
     A          S USRV                      COMP(NE 0)
     A            RECI                      COMP(EQ 'D')
