      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IMSN                                                                              EMFIX7
/*EXI *  TEXT('Midas SE Customer Posns- for EU Saving Tax')
*********LF_IM                                                                                EMFIX7
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *    LF/ETCPOSL0 -  CUSTOMER POSITION-FOR EU SAVING TAX         *
      *                                                               *
      *  (c) Finastra International Limited 2005                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027A            Date 05May06               *
      *                 EMFIX7             Date 29Jun05               *
      *                 234440  *CREATED   Date 20Jun05               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027A - Conversion Of Customer Number to Alpha (recompile) *
      *    EMFIX7 - ETCPOSL0 is read for input and update by modules  *
      *    234440 - Purchase Interest Management                      *
      *                                                               *
     A*****************************************************************
     A          R ETCPOSNDF                 PFILE(ETCPOSND)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2005')
     A          K CSBA
     A          K CSCN
     A          K CSSC
     A          K CSMK
     A          K PTFR
     A          K CSDA
     A          K TMST
     A*
