      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  DTAMBRS((POSETD (POSETD)))                                   *
/*EXI *  TEXT('LF/POSET2 with CSE023 fields')
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *  LF/POSET8 - LF/POSET2 With CSE023 fields                     *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      *  Prev Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      *                 186055  *CREATE    Date 06Nov00               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  186055 - All sort of errors are being encountered in         *
      *           Position Settlement Maintenace                      *
      *                                                               *
      *****************************************************************
     A          R POSETDF                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                      PFILE(POSETD)
      *
      ** Key fields
      *
     A          K PBCA
     A          K PSSH
     A          K PCPY
     A          K PDUD
     A          K PEVT
     A          K PTFR
     A          K TNLU
     A          K TXBS
     A          K BNFO
     A          K EXCD
      *
     A          S RECI                      COMP(EQ 'D')
