      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SE Securities Account Keys by Narrative code')   *
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *    LF/SEACKL1 - SE ACCOUNT KEYS BY NARRATIVE CODE             *
      *                                                               *
      *  (c) Finastra International Limited 2018                      *
      *                                                               *
      *  Last Amend No. MD049636 *CREATE   Date 13Mar18               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD049636 - New Narrative codes in 1-50 interval              *
      *                                                               *
     A*****************************************************************
     A          R SEACKDF                   PFILE(SEACKD)
     A                                      TEXT('(c) Finastra Internatio +
     A                                      nal Limited 2018')
     A            RECI
     A            ACKE
     A            ACD1
     A            ACD2
     A            ACD3
     A            ACD4
     A            ACD5
     A            ACD6
     A            NCDA1
     A            NCDA2
     A            NCDA3
     A            NCDA4
     A            NCDA5
     A            NCDA6
     A            PRF1
     A            PRF2
     A            PRF3
     A            PRF4
     A            PRF5
     A            PRF6
     A            LCD
     A            CHTP
     A            TNLU
     A          K NCDA1
      *
     A          R SEACKF1                   PFILE(SEACKD)
     A            RECI
     A            ACKE
     A            ACD1
     A            ACD2
     A            ACD3
     A            ACD4
     A            ACD5
     A            ACD6
     A            NCDA1
     A            NCDA2
     A            NCDA3
     A            NCDA4
     A            NCDA5
     A            NCDA6
     A            PRF1
     A            PRF2
     A            PRF3
     A            PRF4
     A            PRF5
     A            PRF6
     A            LCD
     A            CHTP
     A            TNLU
     A          K NCDA2
      *
     A          R SEACKF2                   PFILE(SEACKD)
     A            RECI
     A            ACKE
     A            ACD1
     A            ACD2
     A            ACD3
     A            ACD4
     A            ACD5
     A            ACD6
     A            NCDA1
     A            NCDA2
     A            NCDA3
     A            NCDA4
     A            NCDA5
     A            NCDA6
     A            PRF1
     A            PRF2
     A            PRF3
     A            PRF4
     A            PRF5
     A            PRF6
     A            LCD
     A            CHTP
     A            TNLU
     A          K NCDA3
      *
     A          R SEACKF3                   PFILE(SEACKD)
     A            RECI
     A            ACKE
     A            ACD1
     A            ACD2
     A            ACD3
     A            ACD4
     A            ACD5
     A            ACD6
     A            NCDA1
     A            NCDA2
     A            NCDA3
     A            NCDA4
     A            NCDA5
     A            NCDA6
     A            PRF1
     A            PRF2
     A            PRF3
     A            PRF4
     A            PRF5
     A            PRF6
     A            LCD
     A            CHTP
     A            TNLU
     A          K NCDA4
      *
     A          R SEACKF4                   PFILE(SEACKD)
     A            RECI
     A            ACKE
     A            ACD1
     A            ACD2
     A            ACD3
     A            ACD4
     A            ACD5
     A            ACD6
     A            NCDA1
     A            NCDA2
     A            NCDA3
     A            NCDA4
     A            NCDA5
     A            NCDA6
     A            PRF1
     A            PRF2
     A            PRF3
     A            PRF4
     A            PRF5
     A            PRF6
     A            LCD
     A            CHTP
     A            TNLU
     A          K NCDA5
      *
     A          R SEACKF5                   PFILE(SEACKD)
     A            RECI
     A            ACKE
     A            ACD1
     A            ACD2
     A            ACD3
     A            ACD4
     A            ACD5
     A            ACD6
     A            NCDA1
     A            NCDA2
     A            NCDA3
     A            NCDA4
     A            NCDA5
     A            NCDA6
     A            PRF1
     A            PRF2
     A            PRF3
     A            PRF4
     A            PRF5
     A            PRF6
     A            LCD
     A            CHTP
     A            TNLU
     A          K NCDA6
