      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXI *  TEXT('Midas SE Book Position Headers by Book')               *
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *  LF/SEBKHBL0 -  Book Position Headers by Book                 *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2017            *
      *                                                               *
      *  Last Amend No. CSE108 *CREATE     Date 06Oct17               *
      *  Prev Amend No. nnnnnn             Date ddmmmyy               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  CSE108 - Yearly Profitability Report and Enquiry             *
      *                                                               *
      *****************************************************************
     A          R BKPHDDF                   PFILE(BKPHDD)
      *
     A          K BHBA
     A          K BHBK
     A          K BHSC
     A          K BHMK
     A          K BHTV
      *
