      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SE Security Actions by Security')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Securities Trading Module                        *
     A*                                                               *
     A*  LF/SECAC   -   SECURITY ACTIONS BY SECURITY                  *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01510             Date 10Aug94               *
      *                 054257             Date 05Jan94               *
     A*                 052254             DATE 05JAN94               *
     A*                 E16772             DATE 26/05/89              *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     A*  S01510 - Dividend Payments based on ex-date.                 *
     A*           Recompiled over amended PF/SECACD.                  *
     A*  054257 - RECOMPILED AS PREV CURRENT FACTOR AMENDED FROM 9,8  *
     A*           to 10,9                                             *
     A*  052254 - RECOMPILED as CURRENT FACTOR amended from 9,8       *
     A*           to 10,9                                             *
     A*  E16772 - Recompiled to pick up changes made to file SECACD   *
     A*           for Dividend Payment Amounts.                       *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A          R SECACDF                   PFILE(SECACD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A          K SASN
