      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_DL                                                        *
/*EXI *  TEXT('Midas SE Forward Security Events for RM')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Securities Trading Module                        *
     A*                                                               *
     A*  LF/SECEFRM  -  FORWARD SECURITY EVENTS FOR RISK MANAGEMENT   *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGL035             Date 01Mar05               *
      *  Prev Amend No. CSE065             Date 08Nov04               *
      *                 CGP001             Date 23May03               *
      *                 CAS006             Date 21Jan03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *               . CAP140             Date 17Oct00               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 S01510             Date 10Aug94               *
      *                 052254             Date 05Jan94               *
     A*                 S01220             DATE 20JUL90               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  CGL035 - EUSD Upgrade to Midasplus (Recompile)               *
      *  CSE065 - Const. Yld Amort. on Mortgage backed assets         *
      *           (Recompile)                                         *
      *  CGP001 - Global Processing (recompile)                       *
      *  CAS006 - Hedge Accounting Phase B (Recompile)                *
      *  CAP140 - Conversion of SE Security Diary Event inputs into   *
      *           modular structure to use as APIs. Recompile only.   *
     A*  S01510 - Dividend Payments based on ex-date.                 *
     A*           Recompiled over amended PF/SECACD.                  *
     A*  052254 - RECOMPILED as CURRENT FACTOR amended from 9,8       *
     A*           to 10,9                                             *
     A*  S01220 - NEW FILE CREATED FOR STRATEGIC RISK MANAGEMENT      *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*         /////////////////////////////////////////             *
     A*        // WARNING: When creating this logical //              *
     A*       //   file, take option                 //               *
     A*      //                   MAINTENANCE (*DLY)//                *
     A*     /////////////////////////////////////////                 *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A          R SEDEVDF                   PFILE(SEDEVD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K SDSN
     A          K SDED
     A          K SDET
     A*
     A          S RECI                      COMP(EQ 'D')
     A*
     A          R SNDEVDF                   PFILE(SNDEFD)
     A          K SNSN
     A          K SNDT
     A          K SNET
     A*
     A          R SRMNDEF                   PFILE(SRMNDE)
     A          K SNSN
     A          K SNDT
     A          K SNET
