      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SE Secty Events-by Type, desc.Date')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Securities Trading Module                            *
     A*                                                               *
     A*  LF/SECEO4  -   SECURITY EVENTS - BY TYPE, DESC.DATE          *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
     A*  Last Amend No. 230608 *CREATE     Date 11Feb05               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  230608 - SECEO4 is created like SECEO file                   *
     A*****************************************************************
     A*
     A*         /////////////////////////////////////////
     A*        // WARNING: When creating this logical //
     A*       //   file, take option                 //
     A*      //              MAINTENANCE (*REBLD)   //
     A*     /////////////////////////////////////////
     A*
     A*****************************************************************
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A********************************************************************
     A          R SNDEVDF                   PFILE(SNDEVD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K SNSN
     A          K SNET
     A          K SNDT                      DESCEND
     A*
     A          R SEDEVDF                   PFILE(SEDEVD)
     A          K SDSN
     A          K SDET
     A          K SDED                      DESCEND
     A*
      *                                              Begin /E20085/
     A**********O RECI                      COMP(EQ '*')
     A          O RECI                      VALUES('*' 'C')
      *                                              End   /E20085/
