      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SE Corporate Actions - Allocat. Cash')
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *  LF/SECOALL4 - Corporate Actions Allocations - Cash           *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CSE007  *CREATE    Date 1DEc97                *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CSE007 - Corporate Actions                                   *
      *                                                               *
      *****************************************************************
      *
     A          R SECOALD0                  PFILE(SECOALPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *.....................................................................
      * Key fields
     A          K MCCORF
     A          K MCBRCD
     A          K MCDDPT
     A          K MCSESN
     A          K MCCOTP
     A          K MCBOOK
     A          K MCCNUM
     A          K MCPTFR
      *
     A          S MCRECI                    COMP(EQ 'D')
     A            MCSESN                    COMP(EQ '**CASH**')
     A            MCACAA                    COMP(NE 0)
      *
     A          S MCRECI                    COMP(EQ 'D')
     A            MCSESN                    COMP(EQ '**CASH**')
     A            MCACAR                    COMP(NE 0)
      *
     A          S MCRECI                    COMP(EQ 'D')
     A            MCSESN                    COMP(EQ '**CASH**')
     A            MCTOTF                    COMP(NE 0)
