      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SE Corporate actions - depots  live records')
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *  LF/SECODPL5 - Corporate Actions - Depots by Securities       *
      *                                    Live Records               *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 136928             Date 17Jun98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  136928 - New Report created for CEU017, because the existing *
      *           report SE7534P1 and SE7534P2 is too detail to be    *
      *           used as a quick check list.                         *
      *                                                               *
      *****************************************************************
     A*
     A          R SECODPD0                  PFILE(SECODPPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*.....................................................................
     A* Key fields
     A          K MBCORF
     A          K MBOPTN
     A          K MBSESN
     A          K MBBRCD
     A          K MBDDPT
      *
     A          S MBRECI                    COMP(EQ 'D')
