      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SE Corporate Actions Blocks by Security')
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *  LF/SECOBAL4 - Corporate Actions Blocked Positions by Security*
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      *                 CGL014             Date 20Oct03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CPB001             Date 01Jun99               *
      *                 CGL011             Date 20Sep99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CSE007  *CREATE    Date 25Mar98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL014 - Collaterals Processing (Recompile)                  *
      *  CPB001 - Meridian DBA Middleware Replication Customization.  *
      *           Recompiled due to changes in SECOBKPD.              *
      *  CGL011 - Collateral Processing for Midas. Recompile.         *
      *  CSE007 - Corporate Actions                                   *
      *                                                               *
      *****************************************************************
     A*
     A          R SEERALD0                  PFILE(SEERALPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*.....................................................................
     A* Key fields
     A          K VCSESN
     A          K VCBRCD
     A          K VCCNUM
     A          K VCPTFR
     A          K VCERTP
     A*
     A* Select/Omit fields
     A          S VCRECI                    CMP(EQ 'D')
     A            VCERTP                    CMP(EQ 'P')
     A            VCNOMA                    CMP(GT 0)
     A*
     A          R SEBLKPD0                  PFILE(SEBLKPPD)
     A*.....................................................................
     A* Key fields
     A          K VDSESN
     A          K VDBRCD
     A          K VDCNUM
     A          K VDPTFR
     A          K VDBLTY
     A*
     A          R SECOALD0                  PFILE(SECOALPD)
     A*.....................................................................
     A*  Key fields.
     A          K MCBSEC
     A          K MCBRCD
     A          K MCCNUM
     A          K MCPTFR
     A          K MCCOTP
     A*
     A* Select/Omit fields
     A          S MCRECI                    CMP(EQ 'D')
     A            MCCOTP                    CMP(EQ 'C')
     A            MCBEWI                    VALUES('E' 'W')
     A*
     A          R SECOBKD0                  PFILE(SECOBKPD)
     A*.....................................................................
     A*  Key fields.
     A          K MUSESN
     A          K MUBRCD
     A          K MUCNUM
     A          K MUPTFR
     A          K MUBLTY
