      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SE Early Redemptions - Reference Auth/Rv')
     A********************************************************************
     A*                                                                  *
     A*      Midas  SECURITIES TRADING MODULE                            *
     A*                                                                  *
     A*      SEERRFL2  - EARLY REDEMPTIONS REFERENCES - AUTHOR&REVERSED  *
     A*                                                                  *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                                  *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. S01496             DATE 06JUN94                  *
     A*  PREV AMEND NO. S10978     ADS     DATE 23FEB93                  *
     A*                                                                  *
     A********************************************************************
     A*                                                                  *
     A*  S01496  -  Jyske enhancements                                   *
     A*  S10978  -  JYSZUR: EARLY REDEMPTIONS                            *
     A*                                                                  *
     A********************************************************************
     A*
     A          R SEERRFD0                  PFILE(SEERRFPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*.....................................................................
     A* Key fields
     A          K VASESN
     A*
     A          S VAERST                    COMP(EQ 'X')
     A          S VAERST                    COMP(EQ 'R')
