      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SE Allocations by customer/portfolio')
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *  LF/SEERALL8 - Allocations by customer and Portfolio          *
      *                Reference                                      *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *                 114559  *CREATE    Date 10Nov99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  114559 - Select records having transaction reference equal   *
      *           to blank (not complete) in order to allow portfolio *
      *           closure (in PM1010) once only complete early        *
      *           redemption remain in the portfolio.                 *
      *                                                               *
      *****************************************************************
     A          R SEERALD0                  PFILE(SEERALPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
      * KEY FIELDS
     A          K VCCNUM
     A          K VCPTFR
     A          K VCRECI
      *
      * SELECT/OMIT FIELDS
     A          S VCTRRF                    CMP(EQ '      ')
