      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SE Movements Status - Branch')
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *  LF/SEMVTSPD - Movements Status                               *
      *                Main Key by Branch                             *
      *                            Transaction Reference              *
      *                            Transaction Type                   *
      *                            Notification Date (Descending)     *
      *                            Sequence Number   (Descending)     *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSE039  *CREATE    Date 12Feb03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSE039 - Automatic Settlement of Trades                      *
      *                                                               *
      *****************************************************************
      *
     A                                      UNIQUE
      *
     A          R SEMVTSD0                  PFILE(*LIBL/SEMVTSPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
      *
     A          K TMTRBB
     A          K TMTRRF
     A          K TMTRTY
     A          K TMNTDT                    DESCEND
     A          K TMSQNR                    DESCEND
