      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Securities Trading Module                            *
     A*                                                               *
     A*  LF/SEPCALL6 - Securities User Depot Position Calculation     *
     A*                SE Transactions by Value/Settlement Date       *
     A*                                                               *
     A*  (c) Finastra International Limited 2020                      *
     A*                                                               *
     A*  Last Amend No. HUT118A *CREATE    Date 16Dec20               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
     A*  HUT118A - Position Settlements Online Generation (CSE063)    *
     A*                                                               *
     A*****************************************************************
      *
     A          R TRADSDF                   PFILE(TRADSD)
     A                                      TEXT('(c) Finastra Ltd 2020')
     A          K TDBA
     A          K TDSS
     A          K TDVD
     *
     A          R DPTMVDF                   PFILE(DPTMVD)
     A                                      TEXT('(c) Finastra Ltd 2020')
     A          K DPBA
     A          K DPSS
     A          K DPMD
     *
     A          R DPTMVDG                   PFILE(DPTMVD)
     A                                      TEXT('(c) Finastra Ltd 2020')
     A            RECI
     A            DPSS
     A            DPRN
     A            DPMV
     A            DPID
     A            DPMD
     A            DPOD
     A            DPDO
     A            DPBA
     A            ORBR
     A            DPBK
     A            DPMK
     A            DPBN
     A            DPNA
     A            DPNR
     A            MKTP
     A            DPAD
     A            SWRF
     A            SIOI
     A            DPMS
     A            DCFR
     A            TACI
     A            DPR1
     A            DPR2
     A            ORED
     A            LCD
     A            CHTP
     A            TNLU
     A            RPIN
     A            DPPC
     A            DCHC
     A            DCCE
     A            DCHA
     A            DCSE
     A            DCAB
     A            DCAT
     A            DPVD
     A            SPXR
     A            SPMD
     A            PTFR
     A            CYLD
     A            CWDI
     A            COAF
     A            DMFRNT
     A            DMAFRT
     A            DMREPA
     A            DMTMST
     A            MSTP
     A            ACIN
     A            PINT
     A            REPI
     A            DVIN
     A            DMIN
     A            DEXRT
     A            DFROM
     A            DPNR2
     A            DPNR3
     A            DPNR4
     A            DPNR5
     A            DPIN
     A            DPAP
     A            DMTD
     A            CPTY
     A            MRKT
     A          K DPBA
     A          K DPSS
     A          K DPDO
      *
     A          R SETLEDF                   PFILE(SETLED)
     A                                      TEXT('(c) Finastra Ltd 2020')
     A          K SBCA
     A          K SSSN
     A          K SEDE
      *
