      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SE Trade Sett by SSSN, STDR, SCPN and SEDE')
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *  LF/SETLEL9 - Trade Settlements                               *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CAP182  *CREATE    Date 04Mar03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CAP182 - Automatic Settlement of Trades                      *
      *                                                               *
      *****************************************************************
      *
     A          R SETLEDF                   PFILE(SETLED)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
      *
     A          K SSSN
     A          K STDR
     A          K SCPN
     A          K SEDE
      *
     A          O RECI                      COMP(EQ '*')
      *
