      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXI *  TEXT('Midas SE Yearly Profit. Sec.Totals In Inv.Seq.')       *
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *  LF/SEYPDSL3 - Yearly Profitability Sec Totals in Inv Seq.    *
      *                                                               *
      *  (c) Finastra International Limited 2017                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CSE108 *CREATE     Date 06Oct17               *
      *                 nnnnnn             Date ddmmmyy               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSE108 - Yearly Profitability Report and Enquiry             *
      *                                                               *
      *****************************************************************
     A          R SEYPDSD0                  PFILE(SEYPDSPD)
      *
     A          K YECD
     A          K YPBK
     A          K YPBA
     A          K YPNC
     A          K YPIN
     A          K YPSS
     A          S TBYTD                     COMP(NE 0)
      *
