      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SE Customer limits join file')                   *
     A********************************************************************
     A*                                                                  *
     A*  Midas - Securities Trading Module
     A*                                                                  *
     A*    JLF/SLIMHJF  -  CUSTOMER LIMITS JOIN FILE                     *
     A*                                                                  *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                                  *
      *  Last Amend No. CER059             Date 19Jul10               *
      *  Prev Amend No. BUG23967           Date 13May09               *
      *                 CER020             Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*                 S01413             Date 09JUL93               *
     A*                 E18404             Date 16AUG90               *
     A*                   E18217   DATE 01/SEP/89                        *
     A*                                                                  *
     A********************************************************************
     A*                                                                  *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  BUG23967 - Add Local Industry Code Field. (Recompile)        *
      *  CER020 - Enhanced Rollover Window: Upgrade FGE089            *
      *           to Midas Plus (Recompile)                           *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*    S01413  -  RETAIL 3 INCORPORATION. CUSTOMER GROUP ADDED TO    *
     A*               CLINTCB. RECOMPILE.                                *
     A*    E18404  -  RECOMPILED FOR CHANGE TO CLINTCB                   *
     A*    E18217  - TO PREVENT SELECTION OF DELETED RECORDS.            *E18217
     A*                                                                  *
     A********************************************************************
     A*
     A*         /////////////////////////////////////////
     A*        // WARNING: When creating this logical //
     A*       //   file, take option                 //
     A*      //                MAINTENANCE (*IMMED) //
     A*     /////////////////////////////////////////
     A*
     A*****************************************************************
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A********************************************************************
     A                                      DYNSLT
     A          R SLIMHJFF                  JFILE(SLIMH CLINTCB)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*  Join Customer Limits to Customer Master
     A          J                           JOIN(1 2)
     A                                      JFLD(CSTL CNUM)
     A*                                                           /E18217/
     A                                      JFLD(RECI RECI)
     A*                                                           /E18217/
     A*  Customer Limits Fields
     A            RECI                      JREF(1)
     A            CLCU                      RENAME(CSTL)
     A            CLLV                      RENAME(LVLH)
     A            CLEN                      RENAME(ETYH)
     A            CLBK                      RENAME(BOKH)
     A            CLPL                      RENAME(CLMP)
     A            CLSL                      RENAME(CLMS)
     A            CLLE                      RENAME(EXDH)
     A*  Customer Master Fields
     A            CLCM                      RENAME(CMIN)
     A            CLAS                      RENAME(CASK)
     A            CLCR                      RENAME(CRNM)
     A            CLTW                      RENAME(CTWN)
     A*
     A          K CLCU
     A          K CLBK
     A          K CLLV
     A          K CLEN
     A*
     A          S CLPL                      COMP(GT 0)
     A          S CLSL                      COMP(GT 0)
