      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SE STDSED (nostro by currency)')
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *  LF/STDSEDCY - Standard Settlement Instructions               *
      *                Nostro by Currency                             *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2002            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      *  Prev Amend No. CGL029             Date 01Sep03               *
      *                 CSE039             Date 30Jan03               *
      * Midas Release 4.01.02 ----------------------------------------*
      *                 187513  *CREATE    Date 28Apr02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CSE039 - Auto-Settlement of Trade (Recompiled)               *
      *  187513 - Standard Settlement by Currency.  Select all pay    *
      *           and receive settlement method equal to 01, 02, 07,  *
      *           08, and 12.                                         *
      *                                                               *
      *****************************************************************
     A          R STDSEDF                   PFILE(STDSED)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2002')
     A          K CYSI
      *
     A          S SRSM                      COMP(EQ 01)
     A          S SRSM                      COMP(EQ 02)
     A          S SRSM                      COMP(EQ 07)
     A          S SRSM                      COMP(EQ 08)
     A          S SRSM                      COMP(EQ 12)
     A          S SPSM                      COMP(EQ 01)
     A          S SPSM                      COMP(EQ 02)
     A          S SPSM                      COMP(EQ 07)
     A          S SPSM                      COMP(EQ 08)
     A          S SPSM                      COMP(EQ 12)
