000100200318      *****************************************************************
000200200318/*STD *  LFBASE                                                       *
000300200318/*EXS *  LF_IM                                                        *
000400200318/*EXI *  TEXT('Midas SE Deleted Trades')                              *
000500200318      *****************************************************************
000600200318      *                                                               *
000700200318      *  Midas - Securities Trading Module.                           *
000800200318      *                                                               *
000900200318      *  LF/TRADSD10 - Deleted trades.                                *
001000200318      *                                                               *
001100200318      *  (C) Copyright Misys International Banking Systems. 2007      *
001200200318      *                                                               *
001300200604      *  LAST Amend No. 251887 *Create     Date 22MAY20               *
001400200318      *                                                               *
001500200318      *---------------------------------------------------------------*
001600200318      *                                                               *
001700200318      *  251887 - Unable to insert trade due to the trade reference   *
001800200318      *           no. used which is already existing in TRADSDX1.     *
001900200318      *           Applied fix 223696 to drop records in extension     *
002000200318      *           files whenever TRADSD record is deleted.            *
002100200318      *                                                               *
002200200318      *****************************************************************
002300200318     A          R TRADSDF                   PFILE(TRADSD)
002400200318     A                                      TEXT('(C) Misys Internat +
002500200318     A                                      ional Banking Systems. +
002600200318     A                                      2007')
002700200318      *
002800200318     A          K TDRF
002900200318     A          S RECI                      COMP(EQ '*')
003000200318      *
