      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SE Trades by settlement account customer')
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *  LF/TRADCU2 - SECURITIES TRADES, SORTED BY CUSTOMER OF DELIVER*
      *               TO AND DELIVER FROM SETTLEMENT ACCOUNTS.        *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      *                 CGL035             Date 01Mar05               *
      *                 CGL029             Date 01Sep03               *
      *                 CAS006             Date 21Jan03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      *                 CSE023             Date 12Jul00               *
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CAP051             Date 16Nov99               *
      *                 CPB001             Date 01Jun99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CAP003             Date 31Jul98               *
      *                 CSE007             Date 02Feb98               *
      *                 CEU005             DATE 02FEB98               *
      *                 CAC002             Date 15Sep96               *
      *                 091860 *CREATE     Date 27Aug96               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL035 - EUSD Upgrade to Midasplus (Recompile)               *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CAS006 - Hedge Accounting Phase B (Recompile)                *
      *  CSE023 - Treaty Withholding Tax (Recompiled)                 *
      *  CAP051 - Automatic Authorisation (SE Trades Part)            *
      *           Recompile over changes in TRADSD.                   *
      *  CPB001 - Meridian DBA Middleware Replication Customization.  *
      *           Recompile over changes in TRADSD.                   *
      *  CAP003 - Recompiled for conversion of Midas inputs to APIs   *
      *  CSE007 - Corporate Actions - Just Recompile                  *
      * CEU005 - EMU SE Settlement Ccy Conversion (RECOMPILE)         *
      *  CAC002 - Profit Centre Accounting Development Phase 2:       *
      *           Recompiled due to changes in TRADSD                 *
      * 091860 - NEW FILE TO CHECK IF CUSTOMER MAY BE DELETED         *
      *                                                               *
      *****************************************************************
     A          R TRADSD21                  PFILE(TRADSD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            RECI
     A            DFFA
     A            DTFA
     A            DFFA6              I      SST(DFFA 1 6)
     A            DFFA2              I      SST(DFFA 7 2)
     A          K DFFA6
     A          S DFFA                      COMP(NE '      ')
     A            DFFA2                     COMP(NE '  ')
     A            RECI                      COMP(NE '*')
     A
     A          R TRADSD22                  PFILE(TRADSD)
     A            RECI
     A            DFFA
     A            DTFA
     A            DTFA6              I      SST(DTFA 1 6)
     A            DTFA2              I      SST(DTFA 7 2)
     A          K DTFA6
     A          S DTFA                      COMP(NE '        ')
     A            DTFA2                     COMP(NE '  ')
     A            RECI                      COMP(NE '*')
     A
     A*/COPY WNCPYSRC,TRADCU2001
