      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SE Trade Confirmations')
     A********************************************************************
     A*
     A*  Midas - Securities Trading Module
     A*                                                                  *
     A*    JLF/TRDCONF -  TRADE CONFIRMATIONS                            *
     A*                                                                  *
      *  (c) Finastra International Limited 2001                      *
     A*                                                                  *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      *                 CGL035             Date 01Mar05               *
      *                 CGL029             Date 01Sep03               *
      *                 CAS006             Date 21Jan03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      *                 CSE023             Date 12Jul00               *
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CAP051             Date 16Nov99               *
      *                 CPB001             Date 01Jun99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CAP003             Date 31Jul98               *
     A*                 CSE007             Date 02Feb98                  *
     A*                   CEU005           DATE 02FEB98                  *
     A*                   CAC002           Date 15Sep96                  *
     A*                   S01486           Date 06JUN94                  *
     A*                 052254             Date 05JAN94               *
     A*                   S01117           DATE  08NOV90                 *
     A*                   E21096           DATE  26JUL90                 *
     A*                   S01269           DATE  19JUN90                 *S01271
     A*                   S01271           DATE  13JUN90                 *S01271
     A*                                                                  *
     A********************************************************************
     A*                                                                  *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL035 - EUSD Upgrade to Midasplus (Recompile)               *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CAS006 - Hedge Accounting Phase B (Recompile)                *
      *  CSE023 - Treaty Withholding Tax (Recompiled)                 *
     A*  CAP051 - Automatic Authorisation (SE Trades Part)               *
     A*           Recompile over changes in TRADSD.                      *
     A*  CPB001 - Meridian DBA Middleware Replication Customization.     *
     A*           Recompile over changes in TRADSD.                      *
     A*   CEU005 - EMU SE Settlement Ccy Conversion (RECOMPILE)          *
      *  CAP003 - Recompiled for conversion of Midas inputs to APIs   *
     A*   CSE007 - Corporate Actions - Just Recompile                    *
     A*  CAC002 - Profit Centre Accounting Development Phase 2:       *
     A*           Recompiled due to changes in TRADSD                 *
     A*   S01486 - Portfolio Management Upgrade(RECOMPILE)               *
     A*   052254 - RECOMPILED as CURRENT FACTOR amended from 9,8         *
     A*            to 10,9                                               *
     A*   S01117 - MULTIBRANCHING                                        *
     A*   E21096 - RECOMPILED TO INCLUDE ADDITIONAL FIELD ADDED TO       *
     A*            END OF TRADES FILE.  THIS IS THE SWIFT SEQUENCE       *
     A*            NUMBER WHICH IS USED IN SE1810.                       *
     A*   S01269 - TRADE CONFIRMATIONS                                    S01269
     A*   S01271 - RECOMPILED FOR PAY/RECEIVE IN INPUT CYCLE              S01271
     A*                                                                  *
     A********************************************************************
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A********************************************************************
     A          R TRADSDF                   PFILE(TRADSD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*                                              Begin /S01117/
     A********  K TDBR
     A          K TDBA
     A*                                              End   /S01117/
     A          K TDRF
     A*
     A          S TCFR                      COMP(EQ 'Y')
      *                                              Begin /S01269/
     A            RECI                      COMP(NE 'L')
     A            RECI                      COMP(NE 'P')
     A            RECI                      COMP(NE 'R')
      *                                              End   /S01269/
