      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SE User Depot Position Actions')
     A********************************************************************
     A*
     A*  Midas - Securities Trading Module
     A*                                                                  *
     A*    LF/UDPAC  -  USER DEPOT POSITION ACTIONS                      *
     A*                                                                  *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                                  *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      *  Prev Amend No. CGL031             Date 05Jul04               *
      *                 CAS006             Date 21Jan03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CSE007             Date 17Mar98               *
     A*                 S01496             Date 06Jun94               *
     A*                 S01486             DATE 06JUN94               *
     A*                 052254             DATE 12JAN94                  *
     A*                 E32882             DATE 09DEC91                  *
     A*                 S01269             DATE 08NOV90                  *
     A*                 S01117             DATE 31/01/89                 *
     A*                                                                  *
     A********************************************************************
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL031 - Taxation of Savings Income (Recompile)              *
      *  CAS006 - Hedge Accounting Phase B (Recompile)                *
     A*  CSE007 - Corporate Actions - Just Recompile                     *
     A*  S01496 - Jyske enhancements (RECOMPILE)                         *
     A*  S01486 - Portfolio Management Upgrade(RECOMPILE)                *
     A*  052254 - CURRENT FACTOR amended from 9,8 to 10,9                *
     A*  E32882 - REVERSAL OF TRADE AUTHORISATIONS                       *
     A*  S01269 - TRADE AUTHORISATION                                    *
     A*  S01117 - MULTIBRANCHING                                         *
     A********************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A********************************************************************
     A          R UDPMVDF                   PFILE(UDPMVD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*                                                    /S01117/
     A**********K DPBC
     A          K DPBA
     A*                                                    /S01117/
     A          K DPSS
     A          K DPBK
     A          K DMRT
     A          K DDEP
     A***********                                    Begin /E32882/
     A***                                            begin /S01269/
     A**********K *NONE
     A***                                            end   /S01269/
     A***********                                    End   /E32882/
     A          K DADA
     A*
     A          R SETACDF                   PFILE(SETACD)
     A*                                                   /S01117/
     A**********K SBCD
     A          K SBCA
     A*                                                   /S01117/
     A          K SSSN
     A          K SBOC
     A          K SMAR
     A          K SODP
     A***********                                    Begin /E32882/
     A***                                            begin /S01269/
     A**********K *NONE
     A***                                            end   /S01269/
     A***********                                    End   /E32882/
     A          K SEDE
     A*
     A          R TRDACDF                   PFILE(TRDACD)
     A*                                                    /S01117/
     A**********K TDBR
     A          K TDBA
     A*                                                    /S01117/
     A          K TDSS
     A          K TDBK
     A          K TDMI
     A          K OUDP
     A***********                                    Begin /E32882/
     A***                                            begin /S01269/
     A**********K ACTS
     A***                                            end   /S01269/
     A***********                                    End   /E32882/
     A          K EVTD
     A*
      * Begin /CSD027/
     A**********O OUDP                      COMP(EQ 0)                                        CSD027
     A          O OUDP                      COMP(EQ '      ')
      * End /CSD027/
