      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_RB                                                        *
/*EXI *  TEXT('Midas SE Delayed Unrealised P/L Using N-T-P Extrct')
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *  LF/UPLHX - Midas SE Delayed Historic Unrealised P/L Using    *
      *             Net - Treasury - Prices Extract                   *
      *                                                               *
      *  (c) Finastra International Limited 2004                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CAS008  *CREATE    Date 11May04               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CAS008 - Delayed Hedge Assessment                            *
      *                                                               *
      *****************************************************************
     A          R UPLHXDF                   PFILE(UPLHXD)
     A                                      TEXT('(c) Finastra +
     A                                      International Banking +
     A                                      Limited 2004')
     A          K URBA
     A          K URBK
     A          K URCY
     A          K URMK
     A          K URIT
     A          K URSS
