      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FT Layout of DTAQ/FTRETSDTQ')                    *
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTRETSDTQ - FT Status Return Data Queue Layout            *
      *                                                               *
      *  (c) Finastra International Limited 2015                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. MD031644 *CREATE   Date 05Jan15               *
      *                 XNNNNNN            Date DDMmmYY               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  MD031644 - SP7 Build issue (related to CFT158 Return         *
      *             Status of Interfaced FT Payments). Unable         *
      *             to compile GP002900 due to zonal access.          *
      *                                                               *
      *****************************************************************
     A          R FTRETSDTQF                TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2015')
     A            DTQDTA        60          TEXT('Return Status Detail')
