      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FT Outgoing payments dataarea')                  *
     A*
     A********************************************************************
     A***                                                              ***
     F*  Midas - FUNDS TRANSFER MODULE
     A***                                                              ***
     A***            PF/OTPAYDA DATA STRUCTURE                         ***
     A***                                                              ***
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*      COMPANY CONFIDENTIAL                                     *
     A***                                                              ***
      *  Last Amend No. CFT151             DATE 20Mar14                **
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  Prev Amend No. 000000             DATE 00/00/00               ***
     A***                                                              ***
     A********************************************************************
     A*   CFT151 - FT IN/OP ALPHANUMERIC SEQUENCE                        *
     A*                                                                  *
     A********************************************************************
     A          R OTPAYDAF                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*** CFT151 Begin
     A*******     OSQNM          4S 0
     A            OSQNM          4
     A*** CFT151 End
