     H        1   Y
      *****************************************************************
/*OVR *  OVRDBF FILE(GZSDBANK) TOFILE(GZSDBANKL2)                     *                       CSD031
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas SD Facility type maintenance')                   *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  SD0271R - Midas SD Edit facility type (Fr)                   *
      *                                                               *
      *  Function:  This program allows the user to maintain details  *
      *             on facility types(Fr)                             *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *  Last Amend No. CLE164             Date 18Aug14               *
      *  Prev Amend No. MD031074           Date 23Oct14               *
      *                 CLE134             Date 01Aug12               *
      *                 CSC043             Date 18Jun10               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *                 BUG17595           Date 03Apr08               *
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD031             Date 10Apr06               *
      *                 CSD027             Date 09Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *                 CSD003             Date 01Jul99               *
      *                 S01459             Date 01Jul99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
     F*                 031807            DATE 22SEP92                *
     F*                 S01117            DATE 07AUG90                *
     F*                 S01212            DATE 14SEP89                *
      *                                                               *
      *-------------------------------------------------------------- *
      *                                                               *
      *  CLE164 - CLE134 Enhancement F (Repayment Methodology)        *
      *  MD031074 - Make sure that the pre check order will not       *
      *             contain a null value.                             *
      *  CLE134 - Past Due Call Loan processing                       *
      *  CSC043 - MidasPlus IASP Enablement                           *
      *  BUG17595 - CLIP_Message error on Credit lines                *
      *  CSD031 - Enhanced Centralised Static Data                    *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - Program removed from SD model.                    *
      *  S01459 - Addition of Midas Headerbox.                        *
     F*     031807 - The Return Code should be specified in Factor 1  *
     F*              of the parameter field, else the program will not*
     F*              detect an error in the Background Update program.*
     F*     S01117 - RELEASE 10 CHANGES.                              *
     F*     S01212 - LOCAL RETURNS /COPY INCORPORATION                *
      *                                                               *
      *****************************************************************
     F/COPY WNCPYSRC,SD0271RFPG
     FSD0271R#CF  E                    WORKSTN
     F                                              KINFDS INFDS#
      * DSP: Midas SD Fr - Edit Facility Type
      *
     F***SDFACTL1IF  E           K        DISK                                                CSD031
     FSDFACTL1IF  E           K        DISK                           UC                      CSD031
     F                                              KINFDS INFDS1
      * RTV : Facility Types            Retrieval index
      *
     FGPFACTL1IF  E           K        DISK                           UC                      CSD031
     F                                              KINFDS IN0001                             CSD031
     F            SDFACTD0                          KRENAMEGPFACTD1                           CSD031
      * RTV : Facility Types            Retrieval index                                       CSD031
      *                                                                                       CSD031
     FSDMMODL1IF  E           K        DISK
      * RTV : MIDAS Modules             Retrieval index
      *
     FSDFACTL0UF  E           K        DISK                      A    UC
     F                                              KCOMIT
      * UPD : Facility Types            Update index
      *
     FGPFACTL0UF  E           K        DISK                      A    UC                      CSD031
     F                                              KCOMIT                                    CSD031
     F            SDFACTD0                          KRENAMEGPFACTD0                           CSD031
      * UPD : Facility Types            Update index                                          CSD031
      *                                                                                       CSD031
     FSDFCTLL0UF  E           K        DISK                           UC
     F                                              KCOMIT
      * UPD : Standing Data Controls    Update index
      *
     FGPZONEL0IF  E           K        DISK                                                   CSD031
      ** Zone                                                                                 CSD031
     FGZSDBANKIF  E           K        DISK                           UC                      CSD031
     F                                              KINFSR *PSSR                              CSD031
      ** Bank Details ICD Keyed on DNWD                                                       CSD031
     FSDPRGPI0IF  E           K        DISK                                                   CLE164
     E* Description     : Copyright notice for inclusion in all programs
     E*
     E********************************************************************
     E                    CPY@    1   1 80               Copyright     array
     E                    OVRC    1   1 80                                                    CSD031
     E/COPY WNCPYSRC,SD0271REPG
     E/COPY ZSRSRC,ZDATE1Z1                                                                   CSD031
     I*
     I* Description     : Copyright notice for inclusion in all programs
     I*
     I****/COPY QWINDSRC,QFE1DTA                                          S01229
     I/COPY QWINDSRC,SD0270GDTA                                           S01229
     I/COPY WNCPYSRC,SD0271RIPG
      /EJECT
      * Data structures:
     IPGMDS     ESDSY2PGDSP
      * Program data structure
     IJBDTTM      DS
      * Job date/time
     I                                        1   60##JDT
     I                                        1   20##JYY
     I                                        3   40##JMM
     I                                        5   60##JDD
     I                                        7  120##JTM
     I                                        7   80##JHH
     I                                        9  100##JNN
     I                                       11  120##JSS
     IINFDS#    E DSY2I#DSP
      * Display file information data structure
      *
     IINFDS1    E DSY2I1DSP
     IIN0001      DS                            528                                           CSD031
      * File information data structure
      *
     I@1DBRC    E DSSDFACTL0
      * Current/previous master file format fields for change control
      *
     ISDBANK    E DSSDBANKPD                                                                  CSD031
      ** Bank details file                                                                    CSD031
      *                                                                                       CSD031
     ISCSARD    E DSSCSARDPD                                                                  CSD031
      ** Switchable features                                                                  CSD031
      *                                                                                       CSD031
     IDSFDY     E DSDSFDY                                                                     CSD031
      ** Short Data Structure for Access Objects                                              CSD031
      *                                                                                       CSD031
     ILDA       E DSLDA                         256                                           CSD031
     I              SPARE                           SPAREX                                    CSD031
      ** Local data area for database error details                                           CSD031
      *                                                                                       CSD031
     IWDTQ        DS                                                                          CSD031
     I                                        1  10 WPFNAM                                    CSD031
     I                                       11  40 WKEYS                                     CSD031
     I                                       41 296 WDATA                                     CSD031
     IPDQMSG      DS                           4040                                           CSD031
     I***#1DBRC*     DS                             82                                 CSD031 CLE134
     I#1DBRC      DS                             87                                           CLE134
     I***#1DBRC*     DS                             37                                        CSD031
      * Stored master file format fields
     I                                        1   1 #1DB1
      *
     IWUDELR      DS
     I                                        1 250 WUDR01
     I                                      251 500 WUDR02
     I                                      501 750 WUDR03
     I                                      7511000 WUDR04
     I                                     10011250 WUDR05
     I                                     12511500 WUDR06
     I                                     15011750 WUDR07
     I                                     17512000 WUDR08
     I                                     20012250 WUDR09
     I                                     22512500 WUDR00
     I                                     25012750 WUDR11
     I                                     27513000 WUDR12
      * Outward parameters
     IPARC        DS                           3064
      * RCD : Midas SD Deleted records file retrieval
      * I :  File name
     I                                        1  10 PAFNME
      * I :  Long Key
     I                                       11  60 PALKEY
      * I :  Deleted Data Record Pt1
     I                                       61 310 PADR01
      * I :  Deleted Data Record Pt2
     I                                      311 560 PADR02
      * I :  Deleted Data Record Pt3
     I                                      561 810 PADR03
      * I :  Deleted Data Record Pt4
     I                                      8111060 PADR04
      * I :  Deleted Data Record Pt5
     I                                     10611310 PADR05
      * I :  Deleted Data Record Pt6
     I                                     13111560 PADR06
      * I :  Deleted Data Record Pt7
     I                                     15611810 PADR07
      * I :  Deleted Data Record Pt8
     I                                     18112060 PADR08
      * I :  Deleted Data Record Pt9
     I                                     20612310 PADR09
      * I :  Deleted Data Record Pt10
     I                                     23112560 PADR00
      * I :  Deleted Data Record Pt11
     I                                     25612810 PADR11
      * I :  Deleted Data Record Pt12
     I                                     28113060 PADR12
      * I :  Last Change Date
     I                                    P306130630PALCD
      * I :  Type of Last Change
     I                                     30643064 PATYLC
     IWUDSTR      DS
     I                                        1   1 WUPOS1
     I                                        2   2 WUPOS2
     I                                        3   3 WUPOS3
     IRUNDAT      DS
     I                                        1   7 MRDT
     I                                    P   8  100RDNB
     I                                       11  11 SUC
     I                                       12  12 DFF
     I                                       13  13 MBIN
     IA@CPY       DS
     I* Copyright array
     I                                        1  80 CPY@
      /EJECT
      * Parameter declarations
     IP1PARM      DS                              3
      * KEY: Facility Types            Retrieval index
      * I : MAP Facility type
     I                                        1   3 P1FCTY
     IP2PARM      DS
      * I :  Action Code
     I                                        1   1 P2ANCD
     I            DS
     I                                        1 132 ZAMSDA
      * Message data for 'facility type GT 0'
      * Facility type
     I                                        1   3 ZA0001
      * Message data for 'Key Field Invalid Value'
      * If value in key field
     I                                        1   1 ZA0002
      * Key Field
     I                                        2  11 ZA0003
      * Message data for 'Question Mark Invalid'
      * Key Field
     I                                        1  10 ZA0004
      * Message data for 'facility type not blank'
      * Facility type
     I                                        1   3 ZA0005
      * Message data for 'facility type not blank'
      * Facility type
     I                                        1   3 ZA0006
      * Message data for 'facility type not blank'
      * Facility type
     I                                        1   3 ZA0007
      * Message data for 'facility type numeric'
      * Facility type
     I                                        1   3 ZA0008
      * Message data for 'facility name is required'
      * Facility Name
     I                                        1  30 ZA0009
      *                                                                                       CLE134
      ** Message data for 'Pre-Checking Order in error'                                       CLE134
      ** Pre-Checking Order                                                                   CLE134
      *                                                                                       CLE134
     I                                        1  30 ZA0010                                    CLE134
      *                                                                                       CLE134
     I**********    'XLIB/SDCSNDDTQ'      C         PGMB                               CSD031 CSC043
     I              'XPLIB/SDCSNDDTQ'     C         PGMB                                      CSC043
     I              '0123456789ABCDEFGHI- C         ALPHAN                                    CLE164
     I              'JKLMNOPQRSTUVWXYZ*'                                                      CLE164
      /EJECT
      *****************************************************************
      * Entry parameters
     C           *ENTRY    PLIST
     C                     PARM           P0RTN   7
     C                     PARM           P1PARM           KEY: Facility T
     C           P2ANCD    PARM           WP0001  1        Action Code
      *****************************************************************
      * Initialise
     C                     EXSR ZZINIT
      *
      * Check passed parameters
     C                     EXSR FACKPM
      * Perform once if all passed, else repeat
     C           W0RPT     DOUEQ'N'
      * Display and process key screen
     C                     EXSR BADSKY
     C                     END
      * Terminate program
     C                     EXSR ZXEXPG
      *****************************************************************
      /EJECT
     CSR         BADSKY    BEGSR
      *================================================================
      * Display and process key screen
      *================================================================
      * Initialise key screen
     C                     EXSR MDIZ#K
      * Bypass first display of key screen is possible
     C                     MOVEL'Y'       W0BYP   1
      * Signal start of transaction
     C                     MOVEL'Y'       W0TRN   1
     C           W0TRN     DOWEQ'Y'
     C           W0TRN     OREQ 'R'
      * Ensure transaction continues (if reset)
     C                     MOVEL'Y'       W0TRN   1
      * Initialise detail screen
     C                     EXSR MAIZ#1
      * Conduct screen conversation
     C           W0TRN     DOWEQ'Y'
      * Is bypass key screen still viable?
     C           W0BYP     IFEQ 'Y'
     C           #1FCTY    IFEQ *BLANK                     Facility type
      * One or more key fields is blank
     C                     MOVEL'N'       W0BYP
     C                     END
     C                     END
      * Bypass key screen
     C           W0BYP     IFNE 'Y'
      * Display key screen
     C                     EXSR BBEXFM
     C                     END
      * Cancel key screen bypass
     C                     MOVEL'N'       W0BYP
      * Process response to key screen
      * Cancel & exit program
     C   03                CAS            ZXEXPG
      * Switch between *ADD/*CHANGE modes
     C   09                CAS            BCCHMD
      * HOME: Reset screen fields
     C   05                CAS            BDHMKY
      * Process key screen input
     C                     CAS            BEPRKY
     C                     END
      *
     C                     END
     C                     END
      *================================================================
     CSR         BAEXIT    ENDSR
      /EJECT
     CSR         BBEXFM    BEGSR
      *================================================================
      * Display key screen and process HELP requests
      *================================================================
      * Set screen conditioning indicators
     C                     EXSR GADSAK
      * Update screen time
     C                     TIME           ##TME
     C           W0HLP     DOUEQ'N'
      * PUTOVR unless conditioned fields change
     C                     SETON                         86*
     C           *IN89     IFNE BBIN89
     C                     SETOF                         86*
     C                     END
     C                     MOVE *IN89     BBIN89  1
     C                     WRITE#MSGCTL
     C                     WRITE#CMDTXT1
     C                     EXFMT#RCDKEY
     C                     MOVEL'N'       W0HLP   1
      * If help requested, display help text
     C   25                EXSR ZHHPKY
     C                     END
      * Update job time
     C                     TIME           ##JTM
      * Clear messages from program message queue
     C                     CALL 'Y2CLMSC'
     C                     PARM ##PGM     ZAPGM  10
     C                     PARM '*SAME'   ZAPGRL  5
      * Reset first message only flag
     C                     MOVEL'Y'       ZAFSMS  1
      * Reset global error indicator
     C                     SETOF                         99*
      *================================================================
     CSR         BBEXIT    ENDSR
      /EJECT
     CSR         BCCHMD    BEGSR
      *================================================================
      * Switch between *ADD/*CHANGE modes
      *================================================================
     C           W0PMD     IFEQ 'ADD'
     C                     MOVEL'CHG'     W0PMD   3
     C                     ELSE
     C                     MOVEL'ADD'     W0PMD
     C                     END
      *================================================================
     CSR         BCEXIT    ENDSR
      /EJECT
     CSR         BDHMKY    BEGSR
      *================================================================
      * Process HOME key
      *================================================================
     C                     MOVEL'N'       W0TRN
      *================================================================
     CSR         BDEXIT    ENDSR
      /EJECT
     CSR         BEPRKY    BEGSR
      *================================================================
      * Process key screen input
      *================================================================
      * Validate key fields
     C                     EXSR BFVLKY
     C           *IN99     CABEQ'1'       BEEXIT
      * Check for existing record
     C           KRTV      KLIST
     C                     KFLD           AMFCTY           Facility type
      * Setup key
     C                     MOVEL#1FCTY    AMFCTY           Facility type
     C********** KRTV      CHAIN@AMRECU              9091  *                                  CSD031
     C           *INU1     IFEQ *ON                                                           CSD031
     C           KRTV      CHAINGPFACTD1             9091                                     CSD031
     C                     ELSE                                                               CSD031
     C           KRTV      CHAIN@AMRECU              9091                                     CSD031
     C                     ENDIF                                                              CSD031
     C           *IN91     IFEQ '1'
      * Record locked
     C                     SETON                     9931  *
     C                     GOTO BEEXIT
     C                     END                             FI 91
      *
      * Verify record existence against program mode
     C           W0PMD     IFNE 'ADD'
      * If record does not exist, error
     C           *IN90     IFEQ '1'
     C                     SETON                     9931  *
      * Send message 'Facility Types         NF'
     C                     MOVEL'USR0031' ZAMSID
     C                     EXSR ZASNMS
     C                     ELSE
     C                     EXSR MBFL#1
      * CALC: Detail screen function fields
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/COPY member SD0271RSFF - Facility Types  * S01212
     C/COPY WNCPYSRC,SD0271RSFF
     C                     END                             *FI
      * USER: Initialise detail screen (existing record)
      * Set-up DTL Screen Footer - Standard Functions  *
     C*
     C*  DETAIL LINE COMMAND KEY TEXT
     C*
     C                     MOVEL'SDUSRMSG'WUMSGF 10
     C                     MOVE *BLANKS   WUMTXT 80
     C*
     C*  If Action Code is Delete :
     C*
     C           P2ANCD    IFEQ 'D'                                       S01229
     C* Setup footer text:
     C* F3=Main Menu   F10=Delete   F12=Previous
     C                     MOVEL'USR3350' WUMSID  7        Message Identifier
     C                     CALL 'SDRTVTXT'             90  Retrieve MSGF message
     C           WUMSID    PARM WUMSID    KE0286  7        Message Identifier
     C           WUMSGF    PARM WUMSGF    KE0287 10        Message File Name
     C           WUMTXT    PARM WUMTXT    KE0288 80        Message Text
     C                     MOVELWUMTXT    ##CTX1
     C*
     C           *IN90     IFEQ '1'
     C* Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SDRTVTXT'W0CLPG
     C* Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
     C                     END
     C*
     C*  If Action Code is Insert :
     C*
     C           P2ANCD    IFEQ 'I'                                       S01229
     C* Setup footer text:
     C* F3=Exit   F12=Previous
     C                     MOVEL'USR3351' WUMSID           Message Identifier
     C                     CALL 'SDRTVTXT'             90  Retrieve MSGF message
     C           WUMSID    PARM WUMSID    KE0286  7        Message Identifier
     C           WUMSGF    PARM WUMSGF    KE0287 10        Message File Name
     C           WUMTXT    PARM WUMTXT    KE0288 80        Message Text
     C                     MOVELWUMTXT    ##CTX1
     C*
     C           *IN90     IFEQ '1'
     C* Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SDRTVTXT'W0CLPG
     C* Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
     C                     END
     C*
     C*  If Action Code is Amend :
     C*
     C           P2ANCD    IFEQ 'A'                                       S01229
     C* Setup footer text:
     C* F3=Main Menu   F12=Previous
     C                     MOVEL'USR3346' WUMSID           Message Identifier
     C                     CALL 'SDRTVTXT'             90  Retrieve MSGF message
     C           WUMSID    PARM WUMSID    KE0286  7        Message Identifier
     C           WUMSGF    PARM WUMSGF    KE0287 10        Message File Name
     C           WUMTXT    PARM WUMTXT    KE0288 80        Message Text
     C                     MOVELWUMTXT    ##CTX1
     C*
     C           *IN90     IFEQ '1'
     C* Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SDRTVTXT'W0CLPG
     C* Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
     C                     END
     C*
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/COPY member SD0271RISE - Facility Types  * S01212
     C/COPY WNCPYSRC,SD0271RISE
     C                     END                             *FI
     C                     END
      *
     C                     ELSE
      * If record already exists, error
     C           *IN90     IFEQ '0'
     C                     SETON                     9931  *
      * Send message 'Facility Types         EX'
     C                     MOVEL'USR0032' ZAMSID
     C                     EXSR ZASNMS
     C                     ELSE
      * USER: Initialise detail screen (new record)
      * Set-up DTL Screen Footer - Standard Functions  *
     C*
     C*  DETAIL LINE COMMAND KEY TEXT
     C*
     C                     MOVEL'SDUSRMSG'WUMSGF 10
     C                     MOVE *BLANKS   WUMTXT 80
     C*
     C*  If Action Code is Delete :
     C*
     C           P2ANCD    IFEQ 'D'                                       S01229
     C* Setup footer text:
     C* F3=Main Menu   F10=Delete   F12=Previous
     C                     MOVEL'USR3350' WUMSID  7        Message Identifier
     C                     CALL 'SDRTVTXT'             90  Retrieve MSGF message
     C           WUMSID    PARM WUMSID    KE0286  7        Message Identifier
     C           WUMSGF    PARM WUMSGF    KE0287 10        Message File Name
     C           WUMTXT    PARM WUMTXT    KE0288 80        Message Text
     C                     MOVELWUMTXT    ##CTX1
     C*
     C           *IN90     IFEQ '1'
     C* Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SDRTVTXT'W0CLPG
     C* Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
     C                     END
     C*
     C*  If Action Code is Insert :
     C*
     C           P2ANCD    IFEQ 'I'                                       S01229
     C* Setup footer text:
     C* F3=Exit   F12=Previous
     C                     MOVEL'USR3351' WUMSID           Message Identifier
     C                     CALL 'SDRTVTXT'             90  Retrieve MSGF message
     C           WUMSID    PARM WUMSID    KE0286  7        Message Identifier
     C           WUMSGF    PARM WUMSGF    KE0287 10        Message File Name
     C           WUMTXT    PARM WUMTXT    KE0288 80        Message Text
     C                     MOVELWUMTXT    ##CTX1
     C*
     C           *IN90     IFEQ '1'
     C* Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SDRTVTXT'W0CLPG
     C* Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
     C                     END
     C*
     C*  If Action Code is Amend :
     C*
     C           P2ANCD    IFEQ 'A'                                       S01229
     C* Setup footer text:
     C* F3=Main Menu   F12=Previous
     C                     MOVEL'USR3346' WUMSID           Message Identifier
     C                     CALL 'SDRTVTXT'             90  Retrieve MSGF message
     C           WUMSID    PARM WUMSID    KE0286  7        Message Identifier
     C           WUMSGF    PARM WUMSGF    KE0287 10        Message File Name
     C           WUMTXT    PARM WUMTXT    KE0288 80        Message Text
     C                     MOVELWUMTXT    ##CTX1
     C*
     C           *IN90     IFEQ '1'
     C* Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SDRTVTXT'W0CLPG
     C* Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
     C                     END
     C*
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/COPY member SD0271RISN - Facility Types  * S01212
     C/COPY WNCPYSRC,SD0271RISN
     C                     END                             *FI
     C                     END
     C                     END
      *..................................................
     C   99                GOTO BEEXIT
      * No error: Display and process details
     C                     EXSR CADSDA
      *
      *================================================================
     CSR         BEEXIT    ENDSR
      /EJECT
     CSR         BFVLKY    BEGSR
      *================================================================
      * Validate key fields
      *================================================================
     C           W0PMD     IFNE 'ADD'
      * Select existing record
     C                     EXSR VACKRL
     C                     END
      * USER: Validate key screen
      * CASE: PAR.Action Code is Insert
     C           P2ANCD    IFEQ 'I'                        *IF
      * Retrieve Facility Type - Facility Types  *
     C                     EXSR SARVGN
      * CASE: PGM.*Return code is *Record already exists
     C           W0RTN     IFEQ 'Y2U0003'                  *IF
      * Send message '*Record already exists'
     C                     MOVEL'Y2U0003' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     END                             *FI
     C                     END                             *FI
      * Start of Fix S01117
      * CASE: KEY.Facility type is entered
     C           #1FCTY    IFNE *BLANK                     *IF
      * CASE: KEY.Facility type is zero
     C           #1FCTY    IFGE '0'                        *IF
     C           #1FCTY    ANDLE'000'
      * Setup message data for message
     C                     MOVEL#1FCTY    ZA0001           Facility type
      * Send message 'facility type GT 0'
     C                     MOVEL'USR1398' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9931  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL#1FCTY    WUTQKF           Test ? in Key F
     C                     MOVEL#1FCTY    WUIVKF           If value in key
      * CASE: WRK.If value in key field is Asterisk
     C           WUIVKF    IFEQ '*'                        *IF
      * Setup message data for message
     C                     MOVELWUIVKF    ZA0002           If value in key
     C                     MOVEL#1FCTY    ZA0003           Facility type
      * Send message 'Key Field Invalid Value'
     C                     MOVEL'USR0849' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9931  *
      *
     C                     ELSE
      * CASE: WRK.Test ? in Key Field is Question Mark
     C           WUTQKF    IFEQ '?'                        *IF
      * Setup message data for message
     C                     MOVEL#1FCTY    ZA0004           Facility type
      * Send message 'Question Mark Invalid'
     C                     MOVEL'USR0380' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9931  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
      * Check if Facility Type contains any blanks.
     C                     MOVEL#1FCTY    WUDSTR           Data Structure
      * CASE: WRK.Position One is Blank
     C           WUPOS1    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1FCTY    ZA0005           Facility type
      * Send message 'facility type not blank'
     C                     MOVEL'USR1418' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9931  *
      *
     C                     ELSE
      * CASE: WRK.Position Two is Blank
     C           WUPOS2    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1FCTY    ZA0006           Facility type
      * Send message 'facility type not blank'
     C                     MOVEL'USR1418' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9931  *
      *
     C                     ELSE
      * CASE: WRK.Position three is Blank
     C           WUPOS3    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1FCTY    ZA0007           Facility type
      * Send message 'facility type not blank'
     C                     MOVEL'USR1418' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9931  *
      *
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
      * Check if Facility Type is numeric
     C                     MOVEL*BLANK    WUZASF           ZALIGN Screen F
     C                     MOVEL#1FCTY    WUZASF           ZALIGN Screen F
      * ZALIGN Screen Field - Standard Functions  *
     C                     CALL 'ZALIGN'               90  ZALIGN Screen F
     C           W0RTN     PARM W0RTN     WQ0002  7        *Return code
     C           WUZASF    PARM WUZASF    WQ0003 16        ZALIGN Screen F
     C                     PARM *ZERO     WQ0004  10       ZALIGN No Of De
     C                     PARM 3         WQ0005  20       ZALIGN No Of Di
     C           WUZAFF    PARM *BLANK    WQ0006 16        ZALIGN File Fie
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0021' W0RTN   7
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C                     SETON                     99    *
     C                     END
      * CASE: PGM.*Return code is Old Table Error
     C           W0RTN     IFEQ '*ERROR*'                  *IF
      * Setup message data for message
     C                     MOVEL#1FCTY    ZA0008           Facility type
      * Send message 'facility type numeric'
     C                     MOVEL'USR1399' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9931  *
      *
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
      * End of Fix S01117
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/COPY member SD0271RVKS - Facility Types  * S01212
     C/COPY WNCPYSRC,SD0271RVKS
     C                     END                             *FI
      * Facility type required
     C           #1FCTY    IFEQ *BLANK                     IF
     C                     SETON                     9931  *
      * Send message '*Value required'
     C                     MOVEL'Y2U0001' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     END                             FI
      *================================================================
     CSR         BFEXIT    ENDSR
      /EJECT
     CSR         DCVLD2    BEGSR                                                              CLE134
      *================================================================                       CLE134
      * Validate subfile record relations                                                     CLE134
      *================================================================                       CLE134
     C********** #1PCKO    IFNE *BLANKS                                                CLE134 CLE164
     C           #1PGID    IFNE *BLANKS                                                       CLE164
      *****************************************************************                CLE134 CLE164
      ***Call*ZALIGN*&*ZEDIT*******************************************                CLE134 CLE164
      *****************************************************************                CLE134 CLE164
     C**********           MOVEL*BLANK    WUZASF                                       CLE134 CLE164
     C**********           MOVEL#1PCKO    WUZASF                                       CLE134 CLE164
      *****************************************************************                CLE134 CLE164
      ***ZALIGN*Screen*Field*-*Standard*Functions**********************                CLE134 CLE164
      *****************************************************************                CLE134 CLE164
     C**********           CALL 'ZALIGN'               90                              CLE134 CLE164
     C********** W0RTN     PARM W0RTN     WQ0002  7                                    CLE134 CLE164
     C********** WUZASF    PARM WUZASF    WQ0003 16                                    CLE134 CLE164
     C**********           PARM *ZERO     WQ0004  10                                   CLE134 CLE164
     C**********           PARM 5         WQ0005  20                                   CLE134 CLE164
     C********** WUZAFF    PARM *BLANK    WQ0006 16                                    CLE134 CLE164
      *****************************************************************                CLE134 CLE164
     C********** *IN90     IFEQ '1'                                                    CLE134 CLE164
      *****************************************************************                CLE134 CLE164
      ***Call*to*program*ended*in*error********************************                CLE134 CLE164
      *****************************************************************                CLE134 CLE164
     C**********           MOVEL'Y2U0021' W0RTN   7                                    CLE134 CLE164
     C**********           ENDIF                                                       CLE134 CLE164
      *****************************************************************                CLE134 CLE164
      ***Error*detected?***********************************************                CLE134 CLE164
      *****************************************************************                CLE134 CLE164
     C********** W0RTN     IFNE *BLANK                                                 CLE134 CLE164
     C**********           SETON                     98                                CLE134 CLE164
     C**********           ENDIF                                                       CLE134 CLE164
      *****************************************************************                CLE134 CLE164
      ***CASE:*PGM.*Return*code*is*Old*Table*Error*********************                CLE134 CLE164
      *****************************************************************                CLE134 CLE164
     C********** W0RTN     IFEQ '*ERROR*'                                              CLE134 CLE164
     C**********           MOVEL'Y'       WUERCD                                       CLE134 CLE164
      *****************************************************************                CLE134 CLE164
      ***Setup*message*data*for*message********************************                CLE134 CLE164
      *****************************************************************                CLE134 CLE164
     C**********           MOVEL#1PCKO    ZA0010                                       CLE134 CLE164
      *****************************************************************                CLE134 CLE164
      ***Send*message*'Pre-checking*Order*in*error'********************                CLE134 CLE164
      *****************************************************************                CLE134 CLE164
     C**********           MOVEL'USR5400' ZAMSID                                       CLE134 CLE164
     C**********           EXSR ZASNMS                                                 CLE134 CLE164
     C**********           SETON                     9836                              CLE134 CLE164
      *****************************************************************                CLE134 CLE164
     C**********           ELSE                                                        CLE134 CLE164
     C**********           MOVEL'N'       WUERCD                                       CLE134 CLE164
      *****************************************************************                CLE134 CLE164
      ***ZEDIT*Screen*Field*-*Standard*Functions***********************                CLE134 CLE164
      *****************************************************************                CLE134 CLE164
     C**********           CALL 'ZEDIT'                90                              CLE134 CLE164
     C********** WUZASF    PARM WUZASF    WQ0022 16                                    CLE134 CLE164
     C**********           PARM *ZERO     WQ0023  10                                   CLE134 CLE164
      *****************************************************************                CLE134 CLE164
     C********** *IN90     IFEQ '1'                                                    CLE134 CLE164
      *****************************************************************                CLE134 CLE164
      ***Call*to*program*ended*in*error********************************                CLE134 CLE164
      *****************************************************************                CLE134 CLE164
     C**********           MOVEL'Y2U0032' W0RTN                                        CLE134 CLE164
     C**********           MOVEL*BLANKS   W0CLPG 10                                    CLE134 CLE164
     C**********           MOVEL'ZEDIT'   W0CLPG                                       CLE134 CLE164
      *****************************************************************                CLE134 CLE164
      ***Send*message*'*Error*occured*on*CALL...'**********************                CLE134 CLE164
      *****************************************************************                CLE134 CLE164
     C**********           MOVEL'Y2U0032' ZAMSID                                       CLE134 CLE164
     C**********           MOVEL'Y2USRMSG'ZAMSGF                                       CLE134 CLE164
     C**********           MOVELW0CLPG    ZAMSDA                                       CLE134 CLE164
     C**********           EXSR ZASNMS                                                 CLE134 CLE164
     C**********           ENDIF                                                       CLE134 CLE164
     C**********           ENDIF                                                       CLE134 CLE164
      *****************************************************************                CLE134 CLE164
      ***CASE:*WRK.Err*Code*is*Error*Found*****************************                CLE134 CLE164
      *****************************************************************                CLE134 CLE164
     C********** WUERCD    IFEQ 'Y'                                                    CLE134 CLE164
      *****************************************************************                CLE134 CLE164
      ***Setup*message*data*for*message********************************                CLE134 CLE164
      *****************************************************************                CLE134 CLE164
     C**********           MOVEL#1PCKO    ZA0010                                       CLE134 CLE164
      *****************************************************************                CLE134 CLE164
      ***Send*message*'Pre-Checking*Order*in*error'********************                CLE134 CLE164
      *****************************************************************                CLE134 CLE164
     C**********           MOVEL'USR5400' ZAMSID                                       CLE134 CLE164
     C**********           EXSR ZASNMS                                                 CLE134 CLE164
     C**********           SETON                     9936                              CLE134 CLE164
      *****************************************************************                CLE134 CLE164
     C**********           ELSE                                                        CLE134 CLE164
      *****************************************************************                CLE134 CLE164
      ***CASE:**OTHERWISE**********************************************                CLE134 CLE164
      *****************************************************************                CLE134 CLE164
     C**********           MOVE WUZAFF    #1PCKO                                       CLE134 CLE164
     C**********           ENDIF                                                       CLE134 CLE164
     C           #1PGID    IFEQ '?'                                                           CLE164
     C                     EXSR SLPGID                                                        CLE164
     C                     ENDIF                                                              CLE164
     C                     MOVEL*BLANKS   PGERR   1                                           CLE164
     C           ALPHAN    CHECK#1PGID    NUM     10     77                                   CLE164
     C           *IN77     IFEQ '1'                                                           CLE164
     C                     MOVEL'USR5417' ZAMSID                                              CLE164
     C                     MOVEL'Y'       PGERR                                               CLE164
     C                     EXSR ZASNMS                                                        CLE164
     C                     SETON                     9936                                     CLE164
     C                     ENDIF                                                              CLE164
     C           PGERR     IFEQ *BLANKS                                                       CLE164
     C           #1PGID    CHAINSDPRGPI0             77                                       CLE164
     C           *IN77     IFEQ '1'                                                           CLE164
     C                     MOVEL'USR9717' ZAMSID                                              CLE164
     C                     EXSR ZASNMS                                                        CLE164
     C                     SETON                     9936                                     CLE164
     C                     ENDIF                                                              CLE164
     C                     ENDIF                                                              CLE164
     C                     ELSE                                                               CLE134
     C**********           MOVEL'00000'   #1PCKO                                       CLE134 CLE164
     C                     MOVEL*BLANKS   #1PGID                                              CLE164
      *                                                                                       CLE164
     C                     MOVEL'USR9899' ZAMSID                                              CLE164
     C                     MOVEL'Y'       PGERR                                               CLE164
     C                     EXSR ZASNMS                                                        CLE164
     C                     SETON                     9936                                     CLE164
      *                                                                                       CLE164
     C                     ENDIF                                                              CLE134
      *================================================================                       CLE134
     CSR         DCV2EX    ENDSR                                                              CLE134
      *================================================================                       CLE134
     CSR         CADSDA    BEGSR
      *================================================================
      * Display and process detail screen
      *================================================================
      * Conduct detail screen conversation
      * - repeat until screen control flag is reset:
     C           W0TRN     DOWEQ'Y'
      * Display detail screen
     C                     EXSR CBEXFM
      * Process response to detail screen
      * Cancel & exit program
     C   03                CAS            ZXEXPG
      * Redisplay previous screen
     C   12                CAS            CCDSPV
      * Process detail screen input
     C                     CAS            CFPRSC
     C                     END
      *
     C                     END
      *================================================================
     CSR         CAEXIT    ENDSR
      /EJECT
     CSR         CBEXFM    BEGSR
      *================================================================
      * Display screen and process HELP requests
      *================================================================
      * Set screen conditioning indicators
     C                     EXSR GBDSAD
      * Update screen time
     C                     TIME           ##TME
     C           W0HLP     DOUEQ'N'
      * PUTOVR unless conditioned fields change
     C                     SETON                         86*
     C           *IN89     IFNE CBIN89
     C                     SETOF                         86*
     C                     END
     C                     MOVE *IN89     CBIN89  1
     C                     WRITE#MSGCTL
     C                     WRITE#CMDTXT2
     C                     EXFMT#RCDDTL1
     C                     MOVEL'N'       W0HLP   1
      * If help requested, display help text
     C   25                EXSR ZHHPKY
     C                     END
      * Update job time
     C                     TIME           ##JTM
      * Clear messages from program message queue
     C                     CALL 'Y2CLMSC'
     C                     PARM ##PGM     ZAPGM  10
     C                     PARM '*SAME'   ZAPGRL  5
      * Reset first message only flag
     C                     MOVEL'Y'       ZAFSMS  1
      * Reset global error indicator
     C                     SETOF                         99*
      *================================================================
     CSR         CBEXIT    ENDSR
      /EJECT
     CSR         CCDSPV    BEGSR
      *================================================================
      * Redisplay previous screen
      *================================================================
      * USER: Process key screen request
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/COPY member SD0271RPKR - Facility Types  * S01212
     C/COPY WNCPYSRC,SD0271RPKR
     C                     END                             *FI
      * CASE: PAR.Action Code is Insert
     C           P2ANCD    IFEQ 'I'                        *IF
      * Set-up KEY Screen Footer - Standard Functions  *
     C*
     C* KEY LINE COMMAND KEY TEXT
     C*
     C                     MOVEL'SDUSRMSG'WUMSGF 10
     C                     MOVE *BLANKS   WUMTXT 80
     C*
     C* Setup footer text:
     C* F3=Previous
     C                     MOVEL'USR3345' WUMSID  7        Message Identifier
     C                     CALL 'SDRTVTXT'             90  Retrieve MSGF message
     C           WUMSID    PARM WUMSID    KE0286  7        Message Identifier
     C           WUMSGF    PARM WUMSGF    KE0287 10        Message File Name
     C           WUMTXT    PARM WUMTXT    KE0288 80        Message Text
     C                     MOVELWUMTXT    ##CTX1
     C           *IN90     IFEQ '1'
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SDRTVTXT'W0CLPG
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
     C                     ELSE
      * CASE: *OTHERWISE
      * Start of Fix S01117
     C                     MOVEL'USR0790' P0RTN            *Return code
     C                     EXSR ZYEXPG
      * End of Fix S01117
     C                     END                             *FI
     C                     MOVEL'R'       W0TRN
      *================================================================
     CSR         CCEXIT    ENDSR
      /EJECT
     CSR         CFPRSC    BEGSR
      *================================================================
      * Validate record
      *================================================================
      * Confirm/update is not deferred
     C                     MOVEL'N'       W0DCF   1
      * If delete is not pending....
      * Validate details
     C  N10                CAS            DCVLDL
     C                     END
      * QUIT if error:
     C   99                GOTO CFEXIT
      * Defer confirm/update requested
     C           W0DCF     CABEQ'Y'       CFEXIT
      * No error: update record
     C                     EXSR EBPR##
      *================================================================
     CSR         CFEXIT    ENDSR
      /EJECT
     CSR         DCVLDL    BEGSR
      *================================================================
      * Validate details
      *================================================================
      * USER: Validate detail screen fields
      * Start of Fix S01117
      * Facility Name is required
      * CASE: DTL.Facility Name is blank
     C           #1FCNM    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1FCNM    ZA0009           Facility Name
      * Send message 'facility name is required'
     C                     MOVEL'USR1400' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9931  *
      *
     C                     END                             *FI
      * End of Fix S01117
      * CASE: PAR.Action Code is Delete
     C           P2ANCD    IFEQ 'D'                        *IF
      * Start of Fix S01117
      * Send message 'F3/F10/F12 only valid opt'
     C                     MOVEL'USR0536' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
      * End of Fix S01117
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO DCEXIT                     *QUIT
     C                     END                             *FI
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/COPY member SD0271RVSF - Facility Types  * S01212
     C/COPY WNCPYSRC,SD0271RVSF
     C                     END                             *FI
      * CALC: Detail screen function fields
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/COPY member SD0271RSFF - Facility Types  * S01212
     C/COPY WNCPYSRC,SD0271RSFF
     C                     END                             *FI
      * USER: Validate detail screen relations
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/COPY member SD0271RVSR - Facility Types  * S01212
     C/COPY WNCPYSRC,SD0271RVSR
     C                     END                             *FI
      *                                                                                       CSD031
     C                     Z-ADD*ZERO     WEACC   50                                          CSD031
      *                                                                                       CSD031
      ** called from Central level                                                            CSD031
      *                                                                                       CSD031
     C           CSD040    IFEQ 'Y'                                                           CSD031
     C           *INU1     ANDEQ*ON                                                           CSD031
      *                                                                                       CSD031
     C           #1AACC    IFEQ *BLANK                                                        CSD031
     C                     MOVE 'N'       #1AACC                                              CSD031
     C                     ENDIF                                                              CSD031
      *                                                                                       CSD031
      ** 'accept to zone' if entered should be 'Y' or 'N'.                                    CSD031
      *                                                                                       CSD031
     C           #1AACC    IFNE *BLANKS                                                       CSD031
     C           #1AACC    ANDNE'Y'                                                           CSD031
     C           #1AACC    ANDNE'N'                                                           CSD031
     C                     MOVEL'SCC0015' ZAMSID                                              CSD031
     C                     EXSR ZASNMS                                                        CSD031
     C                     MOVE *ON       *IN34                                               CSD031
     C                     MOVE *ON       *IN99                                               CSD031
     C                     ENDIF                                                              CSD031
      *                                                                                       CSD031
      ** effective date may only be entered if 'accept to zone' is 'N'.                       CSD031
      *                                                                                       CSD031
     C           #1AACC    IFNE 'N'                                                           CSD031
     C           #1EACC    ANDNE*BLANK                                                        CSD031
     C                     MOVEL'CSD0001' ZAMSID                                              CSD031
     C                     EXSR ZASNMS                                                        CSD031
     C                     MOVE *ON       *IN35                                               CSD031
     C                     MOVE *ON       *IN99                                               CSD031
     C                     ENDIF                                                              CSD031
      *                                                                                       CSD031
      ** effective date is invalid                                                            CSD031
      *                                                                                       CSD031
     C           #1AACC    IFEQ 'N'                                                           CSD031
     C           #1EACC    ANDNE*BLANK                                                        CSD031
      *                                                                                       CSD031
     C                     TESTN          #1EACC     80                                       CSD031
     C                     MOVE #1EACC    ZDATE                                               CSD031
     C                     EXSR ZDATE1                                                        CSD031
     C           *IN99     IFEQ *ON                                                           CSD031
     C           *IN80     OREQ *OFF                                                          CSD031
     C                     MOVEL'ASM0045' ZAMSID                                              CSD031
     C                     EXSR ZASNMS                                                        CSD031
     C                     MOVE *ON       *IN35                                               CSD031
     C                     MOVE *ON       *IN99                                               CSD031
     C                     ELSE                                                               CSD031
     C                     Z-ADDZDAYNO    WEACC                                               CSD031
     C                     ENDIF                                                              CSD031
     C                     ENDIF                                                              CSD031
      *                                                                                       CSD031
     C                     ENDIF                                                              CSD031
      *                                                                                       CLE134
     C           CLE134    IFEQ 'Y'                                                           CLE164
     C                     EXSR DCVLD2                                                        CLE134
     C                     ENDIF                                                              CLE164
      *                                                                                       CLE134
      *================================================================
     CSR         DCEXIT    ENDSR
      /EJECT
     CSR         EBPR##    BEGSR
      *================================================================
      * Process record:
      *================================================================
      * Process delete request
     C   10                CAS            EDDLRQ
      * Process add request
     C           W0PMD     CASEQ'ADD'     ECADRQ
      * Process update request
     C           W0PMD     CASNE'ADD'     EECHRQ
     C                     END
     C           W0RTN     IFNE *BLANK
      * Error: ROLLBACK any DBF changes
     C                     ROLBK
     C                     GOTO EBEXIT
     C                     ELSE
      * Otherwise COMMIT any DBF changes
     C                     COMIT
     C                     END
     C           W0RTN     IFEQ *BLANK
      * USER: Process command keys
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/COPY member SD0271RPCK - Facility Types  * S01212
     C/COPY WNCPYSRC,SD0271RPCK
     C                     END                             *FI
      * Restart program for next record
     C                     MOVEL'N'       W0TRN
     C                     END
      *================================================================
     CSR         EBEXIT    ENDSR
      /EJECT
     CSR         ECADRQ    BEGSR
      *================================================================
      * Process add request
      *================================================================
      * USER: Create DBF record
      * Fr Create Facility Type - Facility Types  *
     C                     EXSR SBCRRC
     C           W0RTN     IFEQ *BLANK
      * Send message '*Record added'
     C                     MOVEL'Y2U0011' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     END
      *================================================================
     CSR         ECEXIT    ENDSR
      /EJECT
     CSR         EDDLRQ    BEGSR
      *================================================================
      * Process delete request
      *================================================================
      * USER: Delete DBF record
      * Fr Delete Facility Type - Facility Types  *
     C                     EXSR SDDLRC
     C           W0RTN     IFEQ *BLANK
      * Send message '*Record deleted'
     C                     MOVEL'Y2U0013' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     END
      *================================================================
     CSR         EDEXIT    ENDSR
      /EJECT
     CSR         EECHRQ    BEGSR
      *================================================================
      * Process update request
      *================================================================
      * USER: Change DBF record
      * Fr Change Facility Type - Facility Types  *
     C                     EXSR SFCHRC
     C           W0RTN     IFNE *BLANK
      * DBF update error
      * Reset screen fields if changed record
     C           W0RTN     CASEQ'Y2U0007' MBFL#1
     C                     END
     C                     ELSE
      * Send message '*Record changed'
     C                     MOVEL'Y2U0012' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     END
      *================================================================
     CSR         EEEXIT    ENDSR
      /EJECT
     CSR         FACKPM    BEGSR
      *================================================================
      * Check passed parameters
      *================================================================
      * Is full key present?
     C           P1FCTY    IFEQ *BLANK                     Facility type
      * Not every key field passed - loop program
     C                     MOVEL'Y'       W0RPT   1
     C                     ELSE
      * Full key passed, so single shot program
     C                     MOVEL'N'       W0RPT
     C                     END
      *================================================================
     CSR         FAEXIT    ENDSR
      /EJECT
     CSR         GADSAK    BEGSR
      *================================================================
      * Set key screen conditioning indicators
      *================================================================
     C           W0PMD     COMP 'ADD'                    89*
      *================================================================
     CSR         GAEXIT    ENDSR
      /EJECT
     CSR         GBDSAD    BEGSR
      *================================================================
      * Set detail screen conditioning indicators
      *================================================================
     C           W0PMD     COMP 'ADD'                    89*
      * Protect key fields on detail screen
     C                     SETON                     88    *
      * Enable key screen
     C                     SETON                     87    *
      *================================================================
     CSR         GBEXIT    ENDSR
      /EJECT
     CSR         MAIZ#1    BEGSR
      *================================================================
      * Initialise record - except for key fields
      *================================================================
     C                     Z-ADD*ZERO     #1LCD            Last Change Dat
     C                     MOVEL*BLANK    #1TYLC           Type of Last Ch
     C                     MOVEL*BLANK    #1FCNM           Facility Name
     C                     MOVE *BLANK    #1EACC                                              CSD031
     C                     MOVE *BLANK    #1AACC                                              CSD031
      *================================================================
     CSR         MAEXIT    ENDSR
      /EJECT
     CSR         MBFL#1    BEGSR
      *================================================================
      * Move @AMRECU fields to screen
      *================================================================
     C                     Z-ADDAMLCD     #1LCD            Last Change Dat
     C                     MOVELAMTYLC    #1TYLC           Type of Last Ch
     C                     MOVELAMFCTY    #1FCTY           Facility type
     C                     MOVELAMFCNM    #1FCNM           Facility Name
     C           CSD040    IFEQ 'Y'                                                           CSD031
     C                     MOVELAMGPDT    #1GPDT                                              CSD031
     C                     MOVELAMAACC    #1AACC                                              CSD031
     C           AMEACC    IFNE *ZERO                                                         CSD031
     C                     CALL 'ZDATE2'               90                                     CSD031
     C                     PARM AMEACC    PDATE   50                                          CSD031
     C                     PARM BJDFIN    PDTFMT  1                                           CSD031
     C                     PARM *ZEROS    PCVTDT  60                                          CSD031
     C                     PARM *BLANKS   PALPDT  7                                           CSD031
     C                     MOVE PCVTDT    #1EACC                                              CSD031
     C                     ENDIF                                                              CSD031
     C                     ENDIF                                                              CSD031
      *                                                                                       CLE134
     C           CLE134    IFEQ 'Y'                                                           CLE134
     C**********           MOVELAMPCKO    #1PCKO                                       CLE134 CLE164
     C                     MOVELAMPGID    #1PGID                                              CLE164
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
      * Hold existing record image
     C                     MOVEL@1DBRC    #1DBRC
      *================================================================
     CSR         MBEXIT    ENDSR
      /EJECT
     CSR         MDIZ#K    BEGSR
      *================================================================
      * Initialise key screen
      *================================================================
     C                     MOVELP1FCTY    #1FCTY           Facility type
      * USER: Initialise key screen
      * Set-up KEY Screen Footer - Standard Functions  *
     C*
     C* KEY LINE COMMAND KEY TEXT
     C*
     C                     MOVEL'SDUSRMSG'WUMSGF 10
     C                     MOVE *BLANKS   WUMTXT 80
     C*
     C* Setup footer text:
     C* F3=Previous
     C                     MOVEL'USR3345' WUMSID  7        Message Identifier
     C                     CALL 'SDRTVTXT'             90  Retrieve MSGF message
     C           WUMSID    PARM WUMSID    KE0286  7        Message Identifier
     C           WUMSGF    PARM WUMSGF    KE0287 10        Message File Name
     C           WUMTXT    PARM WUMTXT    KE0288 80        Message Text
     C                     MOVELWUMTXT    ##CTX1
     C           *IN90     IFEQ '1'
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SDRTVTXT'W0CLPG
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/COPY member SD0271RIKS - Facility Types  * S01212
     C/COPY WNCPYSRC,SD0271RIKS
     C                     END                             *FI
      *================================================================
     CSR         MDEXIT    ENDSR
      /EJECT
     CSR         SARVGN    BEGSR
      *================================================================
      * Retrieve Facility Type - Facility Types  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSA     KLIST
     C                     KFLD           AMFCTY           Facility type
      * Move fields to key list
     C                     MOVEL#1FCTY    AMFCTY           Facility type
     C********** KRSSA     CHAIN@AMRECU              90    *                                  CSD031
     C           *INU1     IFEQ *ON                                                           CSD031
     C           KRSSA     CHAINGPFACTD1             90                                       CSD031
     C                     ELSE                                                               CSD031
     C           KRSSA     CHAIN@AMRECU              90                                       CSD031
     C                     ENDIF                                                              CSD031
     C           *IN90     IFEQ '1'
      * DBF record not found
     C                     MOVEL'USR0031' W0RTN   7
      * USER: Processing if DBF record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SAEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process DBF record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
     C                     END
      *================================================================
     CSR         SAEXIT    ENDSR
      /EJECT
     CSR         SBCRRC    BEGSR
      *================================================================
      * Fr Create Facility Type - Facility Types  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Move all fields to @AMRECT
     C                     MOVEL#1FCTY    AMFCTY           Facility type
     C                     Z-ADDWURDNB    AMLCD            Last Change Dat
     C                     MOVEL'I'       AMTYLC           Type of Last Ch
     C                     MOVEL#1FCNM    AMFCNM           Facility Name
     C                     MOVEL*ZERO     AMEACC                                            BUG17595
      *                                                                                       CSD031
     C           CSD040    IFEQ 'Y'                                                           CSD031
     C           *INU1     IFEQ *ON                                                           CSD031
     C                     MOVE 'Y'       AMGPDT                                              CSD031
     C                     MOVE #1AACC    AMAACC                                              CSD031
     C                     Z-ADDWEACC     AMEACC                                              CSD031
     C                     ELSE                                                               CSD031
     C                     MOVE *BLANK    AMGPDT                                              CSD031
     C                     ENDIF                                                              CSD031
     C                     ENDIF                                                              CSD031
      *                                                                                       CLE134
     C           CLE134    IFEQ 'Y'                                                           CLE134
     C**********           MOVEL#1PCKO    AMPCKO                                       CLE134 CLE164
     C**********           ELSE                                                      MD031074 CLE164
     C**********           Z-ADD*ZEROS    AMPCKO                                     MD031074 CLE164
     C                     MOVEL#1PGID    AMPGID                                              CLE164
     C                     ENDIF                                                              CLE134
      *
      * USER: Processing before DBF update
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * CASE: WRK.Window processing requir. is Yes
     C           WUWDPR    IFEQ 'Y'                        *IF
      * Start of SAR S01117
      * WM call Window Manager - Window manager  *
     C***********          CALL 'WIND01'                                  S01212
     C                     CALL 'WN0010'                                  S01212
     C*********************PARM           ##PGM            Program        S01212
     C                     PARM ##PGM     UPGM   10        Program        S01212
     C*********************PARM *BLANK    FKEY    2        Function Key   S01212
     C                     PARM *BLANK    UFKEY   2        Function Key   S01212
     C*********************PARM           WUMEST           Action  S01212 S01229
     C*********************PARM           WUWMAC           Action  S01212 S01229
     C                     PARM 'I'       UACTCD  1        Action  S01212 S01229
     C                     PARM           DATA             Trans Data     S01212
     C                     PARM *BLANK    W0RTN            Return Code    S01212
     C                     PARM           SPARE 256        Spare Field    LN0355
      * End of SAR S01117
      * WM Check Return
      * CASE: PAR.*Return code is *User QUIT requested
     C           W0RTN     IFEQ 'Y2U9999'                  *IF
     C                     MOVELW0RTN     P0RTN            *Return code
     C                     EXSR ZYEXPG
     C                     ELSE
      * CASE: PAR.*Return code is WN Window Error
     C           W0RTN     IFEQ 'USR0563'                  *IF
      * Send message 'WN Window Error'
     C                     MOVEL'USR0563' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO SBEXIT                     *QUIT
     C                     ELSE
      * CASE: PAR.*Return code is *DBF update error
     C           W0RTN     IFEQ 'Y2U0004'                  *IF
      * Send message 'WN Database Error'
     C                     MOVEL'USR0567' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO SBEXIT                     *QUIT
     C                     ELSE
      * CASE: PAR.*Return code is *Previous Screen
     C           W0RTN     IFEQ 'USR0790'                  *IF
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO SBEXIT                     *QUIT
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
      * 00/COPY member SD0271RCBW - Facility Types  * S01212
     C/COPY WNCPYSRC,SD0271RCBW
     C                     END                             *FI
     C                     END                             *FI
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/COPY member SD0271RCBU - Facility Types  * S01212
     C/COPY WNCPYSRC,SD0271RCBU
     C                     END                             *FI
     C           KLCRSB    KLIST
     C                     KFLD           AMFCTY           Facility type
      * Check for duplicate primary key
     C********** KLCRSB    SETLL@AMRECT                  90*                                  CSD031
     C           *INU1     IFEQ *ON                                                           CSD031
     C           KLCRSB    SETLLGPFACTD0                 90                                   CSD031
     C                     ELSE                                                               CSD031
     C           KLCRSB    SETLL@AMRECT                  90                                   CSD031
     C                     ENDIF                                                              CSD031
     C           *IN90     IFEQ '1'
     C                     MOVEL'USR0032' W0RTN   7
      * Send message 'Facility Types         EX'
     C                     MOVEL'USR0032' ZAMSID
     C                     EXSR ZASNMS
     C                     GOTO SBEXIT
     C                     END
      *
     C**********           WRITE@AMRECT                91  *                                  CSD031
     C           *INU1     IFEQ *ON                                                           CSD031
     C                     WRITEGPFACTD0               91                                     CSD031
     C                     ELSE                                                               CSD031
     C                     WRITE@AMRECT                91                                     CSD031
     C                     ENDIF                                                              CSD031
      *
     C           *IN91     IFEQ '1'
      * Write error detected
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     ELSE
      * DBF write successful
     C           CSD040    IFEQ 'Y'                                                           CSD031
     C           *INU1     ANDEQ*ON                                                           CSD031
     C                     EXSR SRSEND                                                        CSD031
     C                     ENDIF                                                              CSD031
      * USER: Processing after DBF update
     C                     Z-ADD1         WUNORC           No. of Records
     C                     Z-ADD*ZERO     WUNOAM           No. of Amends
     C                     Z-ADD*ZERO     WUNODL           No. of Deletes
     C                     Z-ADD1         WUNOIN           No. of Inserts
      * Start of SAR S01117
      * Change code to filename FACLTY - SDFACTPD
      * Change Standing Data Cont - Standing Data Controls  *
     C           *INU1     IFEQ *OFF                                                          CSD031
     C                     EXSR SCCHRC
      * End of SAR S01117
      * Update TABLETQ - Facility Types  *
     C                     CALL 'TABLETQ'              90  Update TABLETQ
     C           W0RTN     PARM W0RTN     WQ0007  7        *Return code
     C                     PARM AMFCTY    WQ0008  3        Facility type
     C                     PARM AMFCNM    WQ0009 30        Facility Name
     C                     PARM 'I'       WQ0010  1        Type of Last Ch
     C                     PARM WURDNB    WQ0011  50       Run day number
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0021' W0RTN   7
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C                     SETON                     99    *
     C                     END
      * CASE: PGM.*Return code is Old Table Error
     C           W0RTN     IFEQ '*ERROR*'                  *IF
      * Send message 'Unable to update'
     C                     MOVEL'USR0015' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     END                             *FI
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/COPY member SD0271RCAU - Facility Types  * S01212
     C/COPY WNCPYSRC,SD0271RCAU
     C                     END                             *FI
     C                     ENDIF                                                              CSD031
     C                     END
      *================================================================
     CSR         SBEXIT    ENDSR
      /EJECT
     CSR         SCCHRC    BEGSR
      *================================================================
      * Change Standing Data Cont - Standing Data Controls  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Move key fields to @AHREAU
     C                     MOVE *BLANK    AHFLNM           Filename
     C                     MOVEL'SDFACTPD'AHFLNM           Filename
      *
     C           KLCHSC    KLIST
     C                     KFLD           AHFLNM           Filename
     C           KLCHSC    CHAIN@AHREAU              9091  *
      *
     C           *IN90     IFEQ '1'
      * Record not found
     C                     MOVEL'Y2U0009' W0RTN   7
      * Send message '*Record no longer on file'
     C                     MOVEL'Y2U0009' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     GOTO SCEXIT
     C                     END
      *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     GOTO SCEXIT
     C                     END
      *
      * USER: Processing after DBF read
     C                     ADD  AHNORC    WUNORC           No. of Records
     C                     ADD  AHNOIN    WUNOIN           No. of Inserts
     C                     ADD  AHNOAM    WUNOAM           No. of Amends
     C                     ADD  AHNODL    WUNODL           No. of Deletes
      * Move non-key fields to @AHREAU
     C                     Z-ADDWUNORC    AHNORC           No. of Records
     C                     Z-ADDWUNOIN    AHNOIN           No. of Inserts
     C                     Z-ADDWUNOAM    AHNOAM           No. of Amends
     C                     Z-ADDWUNODL    AHNODL           No. of Deletes
      *
     C                     UPDAT@AHREAU                91  *
     C           *IN91     IFEQ '1'
      * Change error detected
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     ELSE
      * DBF change successful
     C                     END
      *================================================================
     CSR         SCEXIT    ENDSR
      /EJECT
     CSR         SDDLRC    BEGSR
      *================================================================
      * Fr Delete Facility Type - Facility Types  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * USER: Processing before DBF update
      * CASE: PAR.Action Code is Delete
     C           P2ANCD    IFEQ 'D'                        *IF
     C                     ELSE
      * CASE: *OTHERWISE
      * Send message 'Function key not allowed'
     C                     MOVEL'USR0533' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     MOVEL'Y2U0004' W0RTN            *Return code
     C                     GOTO SDEXIT                     *QUIT
     C                     END                             *FI
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * CASE: WRK.Window processing requir. is Yes
     C           WUWDPR    IFEQ 'Y'                        *IF
      * Start of SAR S01117
      * WM call Window Manager - Window manager  *
     C***********          CALL 'WIND01'                                  S01212
     C                     CALL 'WN0010'                                  S01212
     C*********************PARM           ##PGM            Program        S01212
     C                     PARM ##PGM     UPGM   10        Program        S01212
     C*********************PARM *BLANK    FKEY    2        Function Key   S01212
     C                     PARM *BLANK    UFKEY   2        Function Key   S01212
     C*********************PARM           WUMEST           Action  S01212 S01229
     C*********************PARM           WUWMAC           Action  S01212 S01229
     C                     PARM 'D'       UACTCD  1        Action  S01212 S01229
     C                     PARM           DATA             Trans Data     S01212
     C                     PARM *BLANK    W0RTN            Return Code    S01212
     C                     PARM           SPARE 256        Spare Field    LN0355
      * End of SAR S01117
      * WM Check Return
      * CASE: PAR.*Return code is *User QUIT requested
     C           W0RTN     IFEQ 'Y2U9999'                  *IF
     C                     MOVELW0RTN     P0RTN            *Return code
     C                     EXSR ZYEXPG
     C                     ELSE
      * CASE: PAR.*Return code is WN Window Error
     C           W0RTN     IFEQ 'USR0563'                  *IF
      * Send message 'WN Window Error'
     C                     MOVEL'USR0563' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO SDEXIT                     *QUIT
     C                     ELSE
      * CASE: PAR.*Return code is *DBF update error
     C           W0RTN     IFEQ 'Y2U0004'                  *IF
      * Send message 'WN Database Error'
     C                     MOVEL'USR0567' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO SDEXIT                     *QUIT
     C                     ELSE
      * CASE: PAR.*Return code is *Previous Screen
     C           W0RTN     IFEQ 'USR0790'                  *IF
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO SDEXIT                     *QUIT
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
      * 00/COPY member SD0271RDBW - Facility Types  * S01212
     C/COPY WNCPYSRC,SD0271RDBW
     C                     END                             *FI
     C                     END                             *FI
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/Copy member SD0271RDBU - Facility Types  * S01212
     C/COPY WNCPYSRC,SD0271RDBU
     C                     END                             *FI
      * Move key fields to @AMRECT
     C                     MOVEL#1FCTY    AMFCTY           Facility type
      *
     C           KLDLSD    KLIST
     C                     KFLD           AMFCTY           Facility type
     C********** KLDLSD    CHAIN@AMRECT              9091  *                                  CSD031
     C           *INU1     IFEQ *ON                                                           CSD031
     C           KLDLSD    CHAINGPFACTD0             9091                                     CSD031
     C                     ELSE                                                               CSD031
     C           KLDLSD    CHAIN@AMRECT              9091                                     CSD031
     C                     ENDIF                                                              CSD031
     C           *IN90     IFEQ '1'
      * Record already deleted
     C                     MOVEL'Y2U0009' W0RTN   7
      * Send message '*Record no longer on file'
     C                     MOVEL'Y2U0009' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     GOTO SDEXIT
     C                     END
      *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     GOTO SDEXIT
     C                     END
      *
      * Check for changed record
     C           #1DBRC    IFNE @1DBRC                     IF
     C                     MOVEL'Y2U0007' W0RTN   7
      * Send message '*Update not accepted'
     C                     MOVEL'Y2U0007' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
      * Use SETLL to release record lock
     C********** KLDLSD    SETLL@AMRECT              9091  *                                  CSD031
     C           *INU1     IFEQ *ON                                                           CSD031
     C           KLDLSD    SETLLGPFACTD0             9091                                     CSD031
     C                     ELSE                                                               CSD031
     C           KLDLSD    SETLL@AMRECT              9091                                     CSD031
     C                     ENDIF                                                              CSD031
     C                     GOTO SDEXIT
     C                     END                             FI #1DBRC
      *................................................................
     C           CSD040    IFEQ 'Y'                                                           CSD031
     C           *INU1     ANDEQ*ON                                                           CSD031
     C                     MOVE 'D'       AMTYLC                                              CSD031
     C                     EXSR SRSEND                                                        CSD031
     C                     ENDIF                                                              CSD031
      *                                                                                       CSD031
     C**********           DELET@AMRECT                91  *                                  CSD031
     C           *INU1     IFEQ *ON                                                           CSD031
     C                     DELETGPFACTD0               91                                     CSD031
     C                     ELSE                                                               CSD031
     C                     DELET@AMRECT                91                                     CSD031
     C                     ENDIF                                                              CSD031
     C           *IN91     IFEQ '1'
      * Delete error detected
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     ELSE
      * DBF delete successful
      * USER: Processing after DBF update
      * WUDELR Data Structure - SD Deleted Records File  *
     C                     MOVEL@1DBRC    WUDELR
      * Write Deleted Record - SD Deleted Records File  *
     C                     CLEARPARC
     C                     MOVEL'SDFACTPD'PAFNME           File name
     C                     MOVEL#1FCTY    PALKEY           Long Key
     C                     MOVELWUDR01    PADR01           Deleted Data Re
     C                     MOVELWUDR02    PADR02           Deleted Data Re
     C                     MOVELWUDR03    PADR03           Deleted Data Re
     C                     MOVELWUDR04    PADR04           Deleted Data Re
     C                     MOVELWUDR05    PADR05           Deleted Data Re
     C                     MOVELWUDR06    PADR06           Deleted Data Re
     C                     MOVELWUDR07    PADR07           Deleted Data Re
     C                     MOVELWUDR08    PADR08           Deleted Data Re
     C                     MOVELWUDR09    PADR09           Deleted Data Re
     C                     MOVELWUDR00    PADR00           Deleted Data Re
     C                     MOVELWUDR11    PADR11           Deleted Data Re
     C                     MOVELWUDR12    PADR12           Deleted Data Re
     C                     Z-ADDWURDNB    PALCD            Last Change Dat
     C                     MOVEL'D'       PATYLC           Type of Last Ch
      *
     C                     CALL 'SD0520X'              90  Write Deleted R
     C                     PARM *BLANK    W0RTN   7
     C                     PARM           PARC             RCD: SD Deleted
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SD0520X' W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C                     SETON                     99    *
     C                     END
     C                     Z-ADD-1        WUNORC           No. of Records
     C                     Z-ADD1         WUNODL           No. of Deletes
     C                     Z-ADD*ZERO     WUNOIN           No. of Inserts
     C                     Z-ADD*ZERO     WUNOAM           No. of Amends
      * Start of SAR S01117
      * Change code to filename FACLTY - SDFACTPD
      * Change Standing Data Cont - Standing Data Controls  *
     C           *INU1     IFEQ *OFF                                                          CSD031
     C                     EXSR SECHRC
      * End of SAR S01117
     C                     MOVEL'D'       WUTYLC           Type of Last Ch
      * Update TABLETQ - Facility Types  *
     C                     CALL 'TABLETQ'              90  Update TABLETQ
     C           W0RTN     PARM W0RTN     WQ0012  7        *Return code
     C                     PARM AMFCTY    WQ0013  3        Facility type
     C                     PARM AMFCNM    WQ0014 30        Facility Name
     C                     PARM 'D'       WQ0015  1        Type of Last Ch
     C                     PARM WURDNB    WQ0016  50       Run day number
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0021' W0RTN   7
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C                     SETON                     99    *
     C                     END
      * CASE: PGM.*Return code is Old Table Error
     C           W0RTN     IFEQ '*ERROR*'                  *IF
      * Send message 'Unable to update'
     C                     MOVEL'USR0015' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     END                             *FI
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/COPY member SD0271RDAU - Facility Types  * S01212
     C/COPY WNCPYSRC,SD0271RDAU
     C                     END                             *FI
     C                     ENDIF                                                              CSD031
     C                     END
      *================================================================
     CSR         SDEXIT    ENDSR
      /EJECT
     CSR         SECHRC    BEGSR
      *================================================================
      * Change Standing Data Cont - Standing Data Controls  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Move key fields to @AHREAU
     C                     MOVE *BLANK    AHFLNM           Filename
     C                     MOVEL'SDFACTPD'AHFLNM           Filename
      *
     C           KLCHSE    KLIST
     C                     KFLD           AHFLNM           Filename
     C           KLCHSE    CHAIN@AHREAU              9091  *
      *
     C           *IN90     IFEQ '1'
      * Record not found
     C                     MOVEL'Y2U0009' W0RTN   7
      * Send message '*Record no longer on file'
     C                     MOVEL'Y2U0009' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     GOTO SEEXIT
     C                     END
      *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     GOTO SEEXIT
     C                     END
      *
      * USER: Processing after DBF read
     C                     ADD  AHNORC    WUNORC           No. of Records
     C                     ADD  AHNOIN    WUNOIN           No. of Inserts
     C                     ADD  AHNOAM    WUNOAM           No. of Amends
     C                     ADD  AHNODL    WUNODL           No. of Deletes
      * Move non-key fields to @AHREAU
     C                     Z-ADDWUNORC    AHNORC           No. of Records
     C                     Z-ADDWUNOIN    AHNOIN           No. of Inserts
     C                     Z-ADDWUNOAM    AHNOAM           No. of Amends
     C                     Z-ADDWUNODL    AHNODL           No. of Deletes
      *
     C                     UPDAT@AHREAU                91  *
     C           *IN91     IFEQ '1'
      * Change error detected
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     ELSE
      * DBF change successful
     C                     END
      *================================================================
     CSR         SEEXIT    ENDSR
      /EJECT
     CSR         SFCHRC    BEGSR
      *================================================================
      * Fr Change Facility Type - Facility Types  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Move key fields to @AMRECT
     C                     MOVEL#1FCTY    AMFCTY           Facility type
      *
     C           KLCHSF    KLIST
     C                     KFLD           AMFCTY           Facility type
     C********** KLCHSF    CHAIN@AMRECT              9091  *                                  CSD031
     C           *INU1     IFEQ *ON                                                           CSD031
     C           KLCHSF    CHAINGPFACTD0             9091                                     CSD031
     C                     ELSE                                                               CSD031
     C           KLCHSF    CHAIN@AMRECT              9091                                     CSD031
     C                     ENDIF                                                              CSD031
      *
     C           *IN90     IFEQ '1'
      * Record not found
     C                     MOVEL'Y2U0009' W0RTN   7
      * Send message '*Record no longer on file'
     C                     MOVEL'Y2U0009' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     GOTO SFEXIT
     C                     END
      *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     GOTO SFEXIT
     C                     END
      *
      * Check for changed record
     C           #1DBRC    IFNE @1DBRC                     IF
     C                     MOVEL'Y2U0007' W0RTN   7
      * Send message '*Update not accepted'
     C                     MOVEL'Y2U0007' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
      * Use SETLL to release record lock
     C********** KLCHSF    SETLL@AMRECT              9091  *                                  CSD031
     C           *INU1     IFEQ *ON                                                           CSD031
     C           KLCHSF    SETLLGPFACTD0             9091                                     CSD031
     C                     ELSE                                                               CSD031
     C           KLCHSF    SETLL@AMRECT              9091                                     CSD031
     C                     ENDIF                                                              CSD031
     C                     GOTO SFEXIT
     C                     END                             FI #1DBRC
      * Move non-key fields to @AMRECT
     C                     Z-ADDWURDNB    AMLCD            Last Change Dat
     C                     MOVEL'A'       AMTYLC           Type of Last Ch
     C                     MOVEL#1FCNM    AMFCNM           Facility Name
      *                                                                                       CSD031
     C           CSD040    IFEQ 'Y'                                                           CSD031
     C           *INU1     IFEQ *ON                                                           CSD031
     C                     MOVE 'Y'       AMGPDT                                              CSD031
     C                     MOVE #1AACC    AMAACC                                              CSD031
     C                     Z-ADDWEACC     AMEACC                                              CSD031
     C                     ENDIF                                                              CSD031
     C                     ENDIF                                                              CSD031
      *                                                                                       CLE134
     C           CLE134    IFEQ 'Y'                                                           CLE134
     C**********           MOVEL#1PCKO    AMPCKO                                       CLE134 CLE164
     C**********           ELSE                                                      MD031074 CLE164
     C**********           Z-ADD*ZEROS    AMPCKO                                     MD031074 CLE164
     C                     MOVEL#1PGID    AMPGID                                              CLE164
     C                     ENDIF                                                              CLE134
      *
      * USER: Processing before DBF update
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * CASE: WRK.Window processing requir. is Yes
     C           WUWDPR    IFEQ 'Y'                        *IF
      * Start of SAR S01117
      * WM call Window Manager - Window manager  *
     C***********          CALL 'WIND01'                                  S01212
     C                     CALL 'WN0010'                                  S01212
     C*********************PARM           ##PGM            Program        S01212
     C                     PARM ##PGM     UPGM   10        Program        S01212
     C*********************PARM *BLANK    FKEY    2        Function Key   S01212
     C                     PARM *BLANK    UFKEY   2        Function Key   S01212
     C*********************PARM           WUMEST           Action  S01212 S01229
     C*********************PARM           WUWMAC           Action  S01212 S01229
     C                     PARM 'A'       UACTCD  1        Action  S01212 S01229
     C                     PARM           DATA             Trans Data     S01212
     C                     PARM *BLANK    W0RTN            Return Code    S01212
     C                     PARM           SPARE 256        Spare Field    LN0355
      * End of SAR S01117
      * WM Check Return
      * CASE: PAR.*Return code is *User QUIT requested
     C           W0RTN     IFEQ 'Y2U9999'                  *IF
     C                     MOVELW0RTN     P0RTN            *Return code
     C                     EXSR ZYEXPG
     C                     ELSE
      * CASE: PAR.*Return code is WN Window Error
     C           W0RTN     IFEQ 'USR0563'                  *IF
      * Send message 'WN Window Error'
     C                     MOVEL'USR0563' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO SFEXIT                     *QUIT
     C                     ELSE
      * CASE: PAR.*Return code is *DBF update error
     C           W0RTN     IFEQ 'Y2U0004'                  *IF
      * Send message 'WN Database Error'
     C                     MOVEL'USR0567' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO SFEXIT                     *QUIT
     C                     ELSE
      * CASE: PAR.*Return code is *Previous Screen
     C           W0RTN     IFEQ 'USR0790'                  *IF
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO SFEXIT                     *QUIT
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
      * 00/COPY member SD0271RBUW - Facility Types  * S01212
     C/COPY WNCPYSRC,SD0271RBUW
     C                     END                             *FI
     C                     END                             *FI
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/COPY member SD0271RBDU - Facility Types  * S01212
     C/COPY WNCPYSRC,SD0271RBDU
     C                     END                             *FI
     C**********           UPDAT@AMRECT                91  *                                  CSD031
     C           *INU1     IFEQ *ON                                                           CSD031
     C                     UPDATGPFACTD0               91                                     CSD031
     C                     ELSE                                                               CSD031
     C                     UPDAT@AMRECT                91                                     CSD031
     C                     ENDIF                                                              CSD031
     C           *IN91     IFEQ '1'
      * Change error detected
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     ELSE
      * DBF change successful
     C           CSD040    IFEQ 'Y'                                                           CSD031
     C           *INU1     ANDEQ*ON                                                           CSD031
     C                     EXSR SRSEND                                                        CSD031
     C                     ENDIF                                                              CSD031
      * Update saved record image
     C                     MOVEL@1DBRC    #1DBRC
      * USER: Processing after DBF update
     C                     Z-ADD*ZERO     WUNORC           No. of Records
     C                     Z-ADD*ZERO     WUNOIN           No. of Inserts
     C                     Z-ADD*ZERO     WUNODL           No. of Deletes
     C                     Z-ADD1         WUNOAM           No. of Amends
      * Start of SAR S01117
      * Change code to filename FACLTY - SDFACTPD
      * Change Standing Data Cont - Standing Data Controls  *
     C           *INU1     IFEQ *OFF                                                          CSD031
     C                     EXSR SGCHRC
      * End of SAR S01117
      * Update TABLETQ - Facility Types  *
     C                     CALL 'TABLETQ'              90  Update TABLETQ
     C           W0RTN     PARM W0RTN     WQ0017  7        *Return code
     C                     PARM AMFCTY    WQ0018  3        Facility type
     C                     PARM AMFCNM    WQ0019 30        Facility Name
     C                     PARM 'A'       WQ0020  1        Type of Last Ch
     C                     PARM WURDNB    WQ0021  50       Run day number
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0021' W0RTN   7
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C                     SETON                     99    *
     C                     END
      * CASE: PGM.*Return code is Old Table Error
     C           W0RTN     IFEQ '*ERROR*'                  *IF
      * Send message 'Unable to update'
     C                     MOVEL'USR0015' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     END                             *FI
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/COPY member SD0271RADU - Facility Types  * S01212
     C/COPY WNCPYSRC,SD0271RADU
     C                     END                             *FI
     C                     ENDIF                                                              CSD031
     C                     END
      *================================================================
     CSR         SFEXIT    ENDSR
      /EJECT
     CSR         SGCHRC    BEGSR
      *================================================================
      * Change Standing Data Cont - Standing Data Controls  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Move key fields to @AHREAU
     C                     MOVE *BLANK    AHFLNM           Filename
     C                     MOVEL'SDFACTPD'AHFLNM           Filename
      *
     C           KLCHSG    KLIST
     C                     KFLD           AHFLNM           Filename
     C           KLCHSG    CHAIN@AHREAU              9091  *
      *
     C           *IN90     IFEQ '1'
      * Record not found
     C                     MOVEL'Y2U0009' W0RTN   7
      * Send message '*Record no longer on file'
     C                     MOVEL'Y2U0009' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     GOTO SGEXIT
     C                     END
      *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     GOTO SGEXIT
     C                     END
      *
      * USER: Processing after DBF read
     C                     ADD  AHNORC    WUNORC           No. of Records
     C                     ADD  AHNOIN    WUNOIN           No. of Inserts
     C                     ADD  AHNOAM    WUNOAM           No. of Amends
     C                     ADD  AHNODL    WUNODL           No. of Deletes
      * Move non-key fields to @AHREAU
     C                     Z-ADDWUNORC    AHNORC           No. of Records
     C                     Z-ADDWUNOIN    AHNOIN           No. of Inserts
     C                     Z-ADDWUNOAM    AHNOAM           No. of Amends
     C                     Z-ADDWUNODL    AHNODL           No. of Deletes
      *
     C                     UPDAT@AHREAU                91  *
     C           *IN91     IFEQ '1'
      * Change error detected
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     ELSE
      * DBF change successful
     C                     END
      *================================================================
     CSR         SGEXIT    ENDSR
      /EJECT
     CSR         SHRVGN    BEGSR
      *================================================================
      * Get 'Window required' ind - MIDAS Modules  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSH     KLIST
     C                     KFLD           BGMODS           Modules
      * Move fields to key list
     C                     MOVE *BLANK    BGMODS           Modules
     C                     MOVEL'MMOD'    BGMODS           Modules
     C           KRSSH     CHAIN@BGREC8              90    *
      * DBF record not found
     C   90                MOVEL'USR0096' W0RTN   7
     C           *IN90     IFEQ '0'
      * USER: Process DBF record
      * CASE: DB1.Window processing requir. is Yes
     C           BGWDPR    IFEQ 'Y'                        *IF
     C                     MOVEL'Y'       WUWDPR           Window processi
     C                     END                             *FI
     C                     END
      *================================================================
     CSR         SHEXIT    ENDSR
      /EJECT
     CSR         VACKRL    BEGSR
      *================================================================
      * Select existing record
      *================================================================
      * Name search required?
     C                     MOVEL#1FCTY    WK1X01  1        Facility type
     C           WK1X01    IFEQ '?'                        Facility type
     C                     CALL 'SD0270S'              90  *
     C                     PARM           W0RTN   7
     C           #1FCTY    PARM #1FCTY    WQ0001  3        Facility type
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0021' W0RTN   7
     C                     END
      * Defer confirm
     C                     MOVEL'Y'       W0DCF   1
     C                     END
      *================================================================
     CSR         VAEXIT    ENDSR
      /EJECT
     CSR         ZASNMS    BEGSR
      *================================================================
      * Send message to program's message queue
      *================================================================
     C           ZAPGM     IFEQ *BLANK
     C                     MOVEL##PGM     ZAPGM
     C                     END
      * If no message file specified, use default
     C           ZAMSGF    IFEQ *BLANK
     C                     MOVELZADFMF    ZAMSGF
     C                     END
     C                     CALL 'Y2SNMGC'
     C                     PARM           ZAPGM  10        Program queue
     C                     PARM           ZAPGRL  5        Rel queue
     C                     PARM           ZAMSID  7        Message ID
     C                     PARM           ZAMSGF 10        Message file
     C                     PARM           ZAMSDA132        Message data
     C                     PARM           ZAMSTP  7        Message type
      * Clear all fields for default mechanism next time
     C                     MOVEL*BLANK    ZAPGM
     C                     MOVEL*BLANK    ZAPGRL
     C                     MOVEL*BLANK    ZAMSID
     C                     MOVEL*BLANK    ZAMSGF
     C                     MOVEL*BLANK    ZAMSDA
     C                     MOVEL*BLANK    ZAMSTP
      *================================================================
     CSR         ZAEXIT    ENDSR
      /EJECT
     CSR         ZHHPKY    BEGSR
      *================================================================
      * Display HELP text
      *================================================================
      * Signal help request
     C                     MOVEL'Y'       W0HLP   1
     C                     CALL 'YDDSHPR'
     C                     PARM ##PGM     W0HPMB 10        Help text sourc
     C                     PARM *BLANK    YYHPFL 10        Help text file
     C                     PARM *BLANK    YYHPLB 10        Help text libra
     C                     PARM           W0RTN   7
      *================================================================
     CSR         ZHEXIT    ENDSR
      /EJECT
     CSR         ZXEXPG    BEGSR
      *================================================================
      * Cancel and exit from key screen
      *================================================================
      * USER: Exit program processing
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/COPY member SD0271REPP - Facility Types  * S01212
     C/COPY WNCPYSRC,SD0271REPP
     C                     END                             *FI
      * Start of Fix S01117
      * Fast Exit Processing
      * CASE: KEY.*CMD key is *Exit
     C           *IN03     IFEQ '1'                        *IF
     C                     MOVEL'Y2U9999' P0RTN            *Return code
     C                     EXSR ZYEXPG
     C                     END                             *FI
      * End of Fix S01117
     C                     MOVEL*BLANK    P0RTN
     C                     EXSR ZYEXPG
      *================================================================
     CSR         ZXEXIT    ENDSR
      /EJECT
     CSR         ZYEXPG    BEGSR
      *================================================================
      * Exit program: Direct
      *================================================================
      * ROLLBACK any uncommitted DBF changes
     C                     ROLBK                       90
      *
      * Terminate program
     C                     SETON                     LR
      *
      * Exit program
     C                     RETRN
      *
      *================================================================
     CSR         ZYEXIT    ENDSR
      /EJECT
     CSR         ZZINIT    BEGSR
      *================================================================
      * Initialisation
      *================================================================
     C                     MOVE *BLANK    P0RTN
     C                     MOVE *BLANK    W0RTN   7
     C                     MOVEL*BLANK    W0RSL   1
     C                     MOVEL*BLANK    W0RSF   1
      * Setup job date/time
      *
     C                     Z-ADDUDATE     ##JDT
     C                     TIME           ##JTM
      * Update screen time
     C                     TIME           ##TME   60
      * Obtain default message file
     C           *NAMVAR   DEFN Y2MGFLA   ZADFMF 10
     C                     IN   ZADFMF
      * Define work field S01212
     C                     MOVEL*BLANK    WUMFTS  1
      * Define work field Test ? in Key Field
     C                     MOVEL*BLANK    WUTQKF  1
      * Define work field If value in key field
     C                     MOVEL*BLANK    WUIVKF  1
      * Define work field Data Structure
     C                     MOVEL*BLANK    WUDSTR  3
      * Define work field Position One
     C                     MOVEL*BLANK    WUPOS1  1
      * Define work field Position Two
     C                     MOVEL*BLANK    WUPOS2  1
      * Define work field Position three
     C                     MOVEL*BLANK    WUPOS3  1
      * Define work field ZALIGN Screen Fun Field
     C                     MOVEL*BLANK    WUZASF 16
      * Define work field ZALIGN File Field
     C                     MOVEL*BLANK    WUZAFF 16
      *                                                                                       CLE134
      ** Define work field Err Code                                                           CLE134
      *                                                                                       CLE134
     C                     MOVEL*BLANK    WUERCD  1                                           CLE134
      * Define work field Run day number
     C                     Z-ADD*ZERO     WURDNB  50
      * Define work field Window processing requir.
     C                     MOVEL*BLANK    WUWDPR  1
      * Define work field No. of Records
     C                     Z-ADD*ZERO     WUNORC  50
      * Define work field No. of Amends
     C                     Z-ADD*ZERO     WUNOAM  50
      * Define work field No. of Deletes
     C                     Z-ADD*ZERO     WUNODL  50
      * Define work field No. of Inserts
     C                     Z-ADD*ZERO     WUNOIN  50
      * Define work field Deleted Data Record Pt1
     C                     MOVEL*BLANK    WUDR01250
      * Define work field Deleted Data Record Pt2
     C                     MOVEL*BLANK    WUDR02250
      * Define work field Deleted Data Record Pt3
     C                     MOVEL*BLANK    WUDR03250
      * Define work field Deleted Data Record Pt4
     C                     MOVEL*BLANK    WUDR04250
      * Define work field Deleted Data Record Pt5
     C                     MOVEL*BLANK    WUDR05250
      * Define work field Deleted Data Record Pt6
     C                     MOVEL*BLANK    WUDR06250
      * Define work field Deleted Data Record Pt7
     C                     MOVEL*BLANK    WUDR07250
      * Define work field Deleted Data Record Pt8
     C                     MOVEL*BLANK    WUDR08250
      * Define work field Deleted Data Record Pt9
     C                     MOVEL*BLANK    WUDR09250
      * Define work field Deleted Data Record Pt10
     C                     MOVEL*BLANK    WUDR00250
      * Define work field Deleted Data Record Pt11
     C                     MOVEL*BLANK    WUDR11250
      * Define work field Deleted Data Record Pt12
     C                     MOVEL*BLANK    WUDR12250
      * Define work field Type of Last Change
     C                     MOVEL*BLANK    WUTYLC  1
      * Define work field Midas Run Date
     C                     MOVEL*BLANK    WUMRDT  7
      * Define work field Set Up Complete
     C                     MOVEL*BLANK    WUSUC   1
      * Define work field Date format flag
     C                     MOVEL*BLANK    WUDFF   1
      * Define work field Multi-branching Indicator
     C                     MOVEL*BLANK    WUMBIN  1
      * Open files
      * Begin commit control
     C                     CALL 'Y2BGCMC'
     C                     PARM           W0RTN   7
     C           W0RTN     IFNE *BLANK
     C           W0RTN     ANDNE'CPF8351'
     C                     EXSR ZYEXPG
     C                     END
     C**********           OPEN SDFACTL0                                                      CSD031
     C           *INU1     IFEQ *ON                                                           CSD031
     C                     OPEN GPFACTL0                                                      CSD031
     C                     OPEN GPFACTL1                                                      CSD031
     C                     ELSE                                                               CSD031
     C                     OPEN SDFACTL0                                                      CSD031
     C                     OPEN SDFACTL1                                                      CSD031
     C                     ENDIF                                                              CSD031
     C                     OPEN SDFCTLL0
      * Select initial mode
     C           @1NROP    IFEQ *ZERO
      * Add mode
     C                     MOVEL'ADD'     W0PMD   3
     C                     ELSE
      * Change mode
     C                     MOVEL'CHG'     W0PMD
     C                     END
      * USER: Initialise program
      * Standard RPG Creation PAR - Standard Functions  *
      * Start of Fix S01117
      * Last Amend Box SD0271RLAB - Facility Types  *
      * define data structure - Facility Types  *
      * End of Fix S01117
      * Get Rundate - Rundate  *
     C           *NAMVAR   DEFN           RUNDAT
     C                     IN   RUNDAT
     C                     MOVE MRDT      ##MRDT           RUN DATE
     C                     MOVE MRDT      WUMRDT
     C                     MOVE RDNB      WURDNB           RUNDAY NO.
     C                     MOVE SUC       WUSUC            SET UP COMPLT
     C                     MOVE DFF       WUDFF            DTE FMT FLAG
     C                     MOVE MBIN      WUMBIN           MULTI BR. IND
      * Copyright Statement - Standard Functions  * copyright
      * Set-up DTL Screen Footer - Standard Functions  *
     C*
     C*  DETAIL LINE COMMAND KEY TEXT
     C*
     C                     MOVEL'SDUSRMSG'WUMSGF 10
     C                     MOVE *BLANKS   WUMTXT 80
     C*  If Action Code is Delete :
     C*
     C           P2ANCD    IFEQ 'D'                                       S01229
     C* Setup footer text:
     C* F3=Main Menu   F10=Delete   F12=Previous
     C                     MOVEL'USR3350' WUMSID  7        Message Identifier
     C                     CALL 'SDRTVTXT'             90  Retrieve MSGF message
     C           WUMSID    PARM WUMSID    KE0286  7        Message Identifier
     C           WUMSGF    PARM WUMSGF    KE0287 10        Message File Name
     C           WUMTXT    PARM WUMTXT    KE0288 80        Message Text
     C                     MOVELWUMTXT    ##CTX1
     C*
     C           *IN90     IFEQ '1'
     C* Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SDRTVTXT'W0CLPG
     C* Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
     C                     END
     C*
     C*  If Action Code is Insert :
     C*
     C           P2ANCD    IFEQ 'I'                                       S01229
     C* Setup footer text:
     C* F3=Exit   F12=Previous
     C                     MOVEL'USR3351' WUMSID           Message Identifier
     C                     CALL 'SDRTVTXT'             90  Retrieve MSGF message
     C           WUMSID    PARM WUMSID    KE0286  7        Message Identifier
     C           WUMSGF    PARM WUMSGF    KE0287 10        Message File Name
     C           WUMTXT    PARM WUMTXT    KE0288 80        Message Text
     C                     MOVELWUMTXT    ##CTX1
     C*
     C           *IN90     IFEQ '1'
     C* Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SDRTVTXT'W0CLPG
     C* Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
     C                     END
     C*
     C*  If Action Code is Amend :
     C*
     C           P2ANCD    IFEQ 'A'                                       S01229
     C* Setup footer text:
     C* F3=Main Menu   F12=Previous
     C                     MOVEL'USR3346' WUMSID           Message Identifier
     C                     CALL 'SDRTVTXT'             90  Retrieve MSGF message
     C           WUMSID    PARM WUMSID    KE0286  7        Message Identifier
     C           WUMSGF    PARM WUMSGF    KE0287 10        Message File Name
     C           WUMTXT    PARM WUMTXT    KE0288 80        Message Text
     C                     MOVELWUMTXT    ##CTX1
     C*
     C           *IN90     IFEQ '1'
     C* Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SDRTVTXT'W0CLPG
     C* Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
     C                     END
     C*
      * CASE: PAR.Action Code is Insert
     C           P2ANCD    IFEQ 'I'                        *IF
     C                     MOVEL'ADD'     W0PMD            *Program mode
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL'CHG'     W0PMD            *Program mode
     C                     END                             *FI
     C                     MOVEL'Y'       WUMFTS           S01212
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * Get 'Window required' ind - MIDAS Modules  *
     C                     EXSR SHRVGN
      * Data Structure Facilities - Facility Types  *
      * 00/COPY member SD0271RFPG - Facility Types  * S01212
      * 00/COPY member SD0271REPG - Facility Types  * S01212
      * 00/COPY member SD0271RIPG - Facility Types  * S01212
      * 00/COPY member SD0271RCPG - Facility Types  * S01212
     C/COPY WNCPYSRC,SD0271RCPG
      * 00/COPY member SD0271ROPG - Facility Types  * S01212
     C                     END                             *FI
      *                                                                                       CSD031
     C           *NAMVAR   DEFN           LDA                                                 CSD031
      *                                                                                       CSD031
      ** Check if switchable feature CSD040 is on                                             CSD031
      *                                                                                       CSD031
     C                     CALL 'AOSARDR0'                                                    CSD031
     C                     PARM *BLANKS   PRTCD                                               CSD031
     C                     PARM '*VERIFY 'POPTN                                               CSD031
     C                     PARM 'CSD040'  PSARD   6                                           CSD031
     C           SCSARD    PARM SCSARD    DSFDY                                               CSD031
      *                                                                                       CSD031
     C           PRTCD     IFNE *BLANKS                                                       CSD031
     C           PRTCD     ANDNE'*NRF   '                                                     CSD031
     C           *LOCK     IN   LDA                                                           CSD031
     C                     MOVEL'SCSARDPD'DBFILE                                              CSD031
     C                     MOVEL'CSD040  'DBKEY                                               CSD031
     C                     Z-ADD1         DBASE                                               CSD031
     C                     OUT  LDA                                                           CSD031
     C                     EXSR *PSSR                                                         CSD031
     C                     ENDIF                                                              CSD031
      *                                                                                       CSD031
     C           PRTCD     IFEQ *BLANKS                                                       CSD031
     C                     MOVE 'Y'       CSD040  1                                           CSD031
     C                     MOVE *ON       *IN40                                               CSD031
     C                     ELSE                                                               CSD031
     C                     MOVE 'N'       CSD040                                              CSD031
     C                     ENDIF                                                              CSD031
      *                                                                                       CSD031
     C                     MOVE *INU1     *IN41                                               CSD031
      *                                                                                       CSD031
      **  Use access program to read bank details file                                        CSD031
      *                                                                                       CSD031
     C           *INU1     IFEQ *ON                                                           CSD031
      *                                                                                       CSD031
     C                     Z-ADD80        PLEN   155                                          CSD031
     C                     MOVE OVRC,1    PCMD   80                                           CSD031
      *                                                                                       CSD031
     C                     CALL 'QCMDEXC'                                                     CSD031
     C                     PARM           PCMD                                                CSD031
     C                     PARM           PLEN                                                CSD031
      *                                                                                       CSD031
     C                     OPEN GZSDBANK                                                      CSD031
     C                     READ GZSDBANK                 90                                   CSD031
     C           *IN90     IFEQ *ON                                                           CSD031
     C                     MOVEL'GZSDBANK'DBFILE                                              CSD031
     C                     Z-ADD2         DBASE                                               CSD031
     C                     EXSR *PSSR                                                         CSD031
     C                     ENDIF                                                              CSD031
     C                     CLOSEGZSDBANK                                                      CSD031
      *                                                                                       CSD031
     C                     ELSE                                                               CSD031
      *                                                                                       CSD031
     C                     CALL 'AOBANKR0'                                                    CSD031
     C                     PARM '*MSG   ' PRTCD   7                                           CSD031
     C                     PARM '*FIRST ' POPTN   7                                           CSD031
     C           SDBANK    PARM SDBANK    DSFDY                                               CSD031
      *                                                                                       CSD031
     C           PRTCD     IFNE *BLANK                                                        CSD031
     C                     MOVEL'SDBANKPD'DBFILE                                              CSD031
     C                     Z-ADD3         DBASE                                               CSD031
     C                     EXSR *PSSR                                                         CSD031
     C                     ENDIF                                                              CSD031
      *                                                                                       CSD031
     C           BJDFIN    IFEQ 'M'                                                           CSD031
     C                     MOVE *ON       *IN98                                               CSD031
     C                     ENDIF                                                              CSD031
      *                                                                                       CSD031
     C                     ENDIF                                                              CSD031
      *                                                                                       CLE134
      ** Check if enhancement CLE134 (Past Due Processing) is on                              CLE134
      *                                                                                       CLE134
     C                     CALL 'AOSARDR0'                                                    CLE134
     C                     PARM *BLANKS   PRTCD   7                                           CLE134
     C                     PARM '*VERIFY 'POPTN   7                                           CLE134
     C                     PARM 'CLE134'  PSARD   6                                           CLE134
     C           SCSARD    PARM SCSARD    DSFDY                                               CLE134
      *                                                                                       CLE134
     C           PRTCD     IFNE *BLANKS                                                       CLE134
     C           PRTCD     ANDNE'*NRF   '                                                     CLE134
     C           *LOCK     IN   LDA                                                           CLE134
     C                     MOVEL'SCSARDPD'DBFILE                                              CLE134
     C                     MOVEL'CLE134  'DBKEY                                               CLE134
     C                     Z-ADD2         DBASE                                               CLE134
     C                     OUT  LDA                                                           CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C           PRTCD     IFEQ *BLANKS                                                       CLE134
     C                     MOVE 'Y'       CLE134  1                                           CLE134
     C                     MOVE *ON       *IN64                                               CLE134
     C                     ELSE                                                               CLE134
     C                     MOVE 'N'       CLE134                                              CLE134
     C                     MOVE *OFF      *IN64                                               CLE134
     C                     ENDIF                                                              CLE134
      *================================================================
     CSR         ZZEXIT    ENDSR
      /EJECT                                                                                  CSD031
     CSR         *PSSR     BEGSR                                                              CSD031
      *****************************************************************                       CSD031
      *                                                               *                       CSD031
      * *PSSR  - Program exception error routine                      *                       CSD031
      *          Called automatically if a program error occurs,      *                       CSD031
      *          or directly by the program code using EXSR.          *                       CSD031
      *          This subroutine DUMPs the program just once.         *                       CSD031
      *                                                               *                       CSD031
      *****************************************************************                       CSD031
      *                                                                                       CSD031
      * Core function specific processing.                                                    CSD031
      *                                                                                       CSD031
     C/COPY WNCPYSRC,SD0271EPSC                                                               CSD031
      *                                                                                       CSD031
      * Start of PSSR user point.                                                             CSD031
      *                                                                                       CSD031
     C/COPY WNCPYSRC,SD0271EPS1                                                               CSD031
      *                                                                                       CSD031
      * Standard Midas PSSR processing.                                                       CSD031
      *                                                                                       CSD031
     C/COPY SDCPYSRC,SDPSSRINT                                                                CSD031
      *                                                                                       CSD031
      * End of PSSR user point.                                                               CSD031
      *                                                                                       CSD031
     C/COPY WNCPYSRC,SD0271EPS2                                                               CSD031
      *                                                                                       CSD031
      *================================================================                       CSD031
     CSR                   ENDSR                                                              CSD031
      *================================================================                       CSD031
      /EJECT                                                                                  CSD031
     CSR         SRSEND    BEGSR                                                              CSD031
      *================================================================                       CSD031
      * Setup details and send message to data queue                                          CSD031
      *================================================================                       CSD031
     C                     MOVEL'GPFACTPD'WPFNAM                                              CSD031
     C                     MOVEL#1FCTY    WKEYS                                               CSD031
     C                     MOVEL@1DBRC    WDATA                                               CSD031
     C                     MOVELWDTQ      PDQMSG                                              CSD031
     C           'SD'      CAT  'ACCPDTQ' PDQNAM 10                                           CSD031
      *                                                                                       CSD031
     C           *LOVAL    SETLLGPZONEL0                                                      CSD031
     C                     READ GPZONEL0                 90                                   CSD031
     C           *IN90     DOWEQ*OFF                                                          CSD031
     C********** ZOMSYS    CAT  PGMB      PGMNAM 16                                    CSD031 CSC043
     C           ZOMSYS    CAT  PGMB      PGMNAM 17                                           CSC043
     C           ZOMSYS    CAT  'DPLIB'   PDQLIB                                              CSD031
     C                     CALL PGMNAM                                                        CSD031
     C                     PARM           PDQNAM                                              CSD031
     C                     PARM           PDQLIB 10                                           CSD031
     C                     PARM           PDQMSG                                              CSD031
     C                     READ GPZONEL0                 90                                   CSD031
     C                     ENDDO                                                              CSD031
      *================================================================                       CSD031
     CSR                   ENDSR                                                              CSD031
      *================================================================                       CSD031
      *****************************************************************                       CLE164
      *                                                               *                       CLE164
      *  SLPGID - Select Priority Group ID                                                    CLE164
      *                                                               *                       CLE164
      *================================================================                       CLE164
     C           SLPGID    BEGSR                                                              CLE164
      *                                                                                       CLE164
     C                     MOVEL#1PGID    PGIDSL  1                                           CLE164
     C           PGIDSL    IFEQ '?'                                                           CLE164
     C                     CALL 'SD00321S'             90                                     CLE164
     C                     PARM           W0RTN   7                                           CLE164
     C           #1PGID    PARM #1PGID    WVAR01  3                                           CLE164
     C           *IN90     IFEQ '1'                                                           CLE164
      *                                                                                       CLE164
     C                     MOVEL'Y2U0021' W0RTN   7                                           CLE164
     C                     END                                                                CLE164
      * Defer confirm                                                                         CLE164
     C                     MOVEL'Y'       W0DCF   1                                           CLE164
     C                     END                                                                CLE164
     C                     ENDSR                                                              CLE164
     C/COPY ZSRSRC,ZDATE1Z2                                                                   CSD031
     O/COPY WNCPYSRC,SD0271ROPG
** CPY@     : Copyright notice for inclusion in all programs
(c) Misys International Banking Systems Ltd. 2001
** OVRC                                                                                       CSD031
OVRDBF FILE(GZSDBANK) TOFILE(GZSDBANKL2)                                                      CSD031
** ZYDY - YEARS IN DAYS CUMULATIVE, FOUR YEAR SPAN                                            CSD031
0366073110961461                                                                              CSD031
** ZMDY - MONTHS IN DAYS CUMULATIVE THROUGH YEAR                                              CSD031
000031059090120151181212243273304334365                                                       CSD031
