     H        1   Y
      *****************************************************************
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas SD Edit fee codes')                              *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  SD0320M - Fee Codes Maintenance                              *
      *                                                               *
      *  Function:  This program allows the user to maintain fee codes*
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. CSD103             Date 10Aug20               *
      *  Prev Amend No. MD054016           Date 03Sep19               *
      *                 CER050             Date 16Jun19               *
      *                 CLE071             Date 18Jul18               *
      *                 MD046248           Date 27Oct17               *
      *                 CLE164             Date 18Aug14               *
      *                 MD021974A          Date 12Sep13               *
      *                 MD021974           Date 23Aug13               *
      *                 AR1093473          Date 04Mar13               *
      *                 AR1080662          Date 23Jan13               *
      *                 AR826996           Date 09Nov12               *
      *                 AR1022007          Date 23Aug12               *
      *                 AR467422           Date 01Aug12               *
      *                 262672             Date 01Aug12               *
      *                 CLE134             Date 01Aug12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CLE042             Date 06Sep05               *
      *                 CSD027             Date 09Dec05               *
      *                 CAS011             Date 16May05               *
      *                 231568             Date 10Jan05               *
      *                 CAS009             Date 04May04               *
      *                 CAAA03             Date 28Mar04               *
      * Midas Release 4.01 -------------------------------------------*
      *                 CAS001             Date 23Nov01               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.03 -----------------------------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CSD003             Date 06Apr98               *
      *                 S01459             Date 06Apr98               *
      *                 S01117             Date 08AUG90               *
      *                                                               *
      *-------------------------------------------------------------- *
      *                                                               *
      *  CSD103 - LIBOR Deregulation - Common Layer/Standing Data     *
      *             (Recompile)                                       *
      *  MD054016 - Handling of the "Minimum APR Amount" in the Fee   *
      *             Maintenance                                       *
      *  CER050 - Annualised Percentage Rate                          *
      *  CLE071 - Value Dating of Rate Changes to Fees (Recompile)    *
      *  MD046248 - Finastra Rebranding                               *
      *  CLE164 - CLE134 Enhancement F (Repayment Methodology)        *
      *  MD021974A - Wrong additional fields on the Fee Code          *
      *              maintenance screen                               *
      *  MD021974  - Wrong additional fields on the Fee Code          *
      *              maintenance screen                               *
      *  AR1093473 - Unable to attached Past Due Details for FEE Codes*
      *  AR1080662 - Base Rate Field is missing in the Fee Codes      *
      *              Maintenance Additional Details Screen            *
      *  AR826996 - Validate Base Rate Code + Currency in SDBSRTPD    *
      *             (Child: AR826997)                                 *
      *  AR1022007 - [PDP] CC001 - Incorporate SM007 in PDP           *
      *  AR467422 - AUCRIN mandatory if other PDCL fields entered.    *
      *             Also it must be 'A', 'S' or 'P', not 'A' or 'D'.  *
      *  262672 - Modified to default suspense details when           *
      *           Suspense Fee Allowed = 'Y'.                         *
      *  CLE134 - Past Due Call Loan Processing                       *
      *  CLE042 - Extended Loan Sub Type (Recompile)                  *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CAS011 - EIR/AC Accounting Upgrade to MP1                    *
      *  231568 - Additional Validation For ADJY in Fee Codes         *
      *           Maintenance                                         *
      *  CAS009 - Effective Interest Rate/Amortised Cost Accounting   *
      *  CAAA03 - Webfacing Changes (recompile).                      *
      *  CAS001 - Net Present Value (NPV) Accounting                  *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - Program removed from SD model.                    *
      *  S01459 - Addition of Midas Headerbox.                        *
      *  S01117 - Release 10 changes.                                 *
      *                                                               *
      *****************************************************************
     FSD0320M#CF  E                    WORKSTN                        UC
     F                                        ##RR  KSFILE #SFLRCD
     F                                              KINFDS INFDS#
     F                                              KINFSR *PSSR
      * DSP: Midas SD Fee codes maintenance subfile
      *
     FSDFEEL1 IF  E           K        DISK                           UC
     F                                              KINFDS INFDS1
     F                                              KINFSR *PSSR
      * RTV : Midas SD Fee codes retrieval
      *
     FSDFEEL0 UF  E           K        DISK                      A    UC
     F                                              KCOMIT
     F                                              KINFDS ID0001
     F                                              KINFSR *PSSR
      * UPD : Midas SD Fee codes update
      *
     FSDFCTLL0UF  E           K        DISK                           UC
     F                                              KCOMIT
     F                                              KINFDS ID0002
     F                                              KINFSR *PSSR
      * UPD : Midas SD Standing data controls update
      *
      *                                                                                       CAS009
     F/COPY WNCPYSRC,SDH00133
     FDLFEEDL0IF  E           K        DISK                                                   CAS009
      ** Dealing Fees detail file                                                             CAS009
      *                                                                                       CAS009
     F***LEFEEDLAIF  E           K        DISK                                         CAS009 CAS011
     FLEFEEDLBIF  E           K        DISK                                                   CAS011
      ** Lending Fees detail file                                                             CAS009
      *                                                                                       CAS009
     FSCSARPL1IF  E           K        DISK                                                   231568
      ** Midas SC Switchable Feature Initialisation PGM index                                 231568
      *                                                                                       231568
     F***LEFEEDLEIF  E           K        DISK                                         231568 CAS011
     F***LEFEEDLFIF  E           K        DISK                                         CAS011 CLE134
     FLEFEEDLFUF  E           K        DISK                                                   CLE134
     F                                              KCOMIT                                    CLE134
     F                                              KINFSR *PSSR                              CLE134
     F            LEFEEDF                           KRENAMELEFEED                             231568
      ** Lending Live Fees detail file                                                        231568
      *                                                                                       231568
     FDLFEEDLGIF  E           K        DISK                                                   231568
     F            DLFEEDD0                          KRENAMEDLFEED                             231568
      ** Dealing Live Fees detail file                                                        231568
      *                                                                                       231568
     FLEFEEDLWIF  E           K        DISK                                                 AR826996
     F            LEFEEDF                           KRENAMELEFEEDW                          AR826996
     FSDBSRTL2IF  E           K        DISK                                                 AR826996
     FSDPRGPI0IF  E           K        DISK                                                   CLE164
     F/COPY WNCPYSRC,SD0320MF01
     E* Description     : Copyright notice for inclusion in all programs
     E*
     E********************************************************************
     E                    CPY@    1   1 80               Copyright array
     I*
     I* Description     : Copyright notice for inclusion in all programs
     I*
      *                                                                                    AR1022007
      ** Arrays for calls to validation modules                                            AR1022007
      *                                                                                    AR1022007
     E                    AFLDNM     72 10                                                 AR1022007
     E                    AMSGID     72  7                                                 AR1022007
     E                    AMGDTA     72 45                                                 AR1022007
      /EJECT
      * Data structures:
     IPGMDS     ESDSY2PGDSP
      * Program data structure
     IJBDTTM      DS
      * Job date/time
     I                                        1   70##JDT
     I                                        1   10##JCC
     I                                        2   30##JYY
     I                                        4   50##JMM
     I                                        6   70##JDD
     I                                        8  130##JTM
     I                                        8   90##JHH
     I                                       10  110##JNN
     I                                       12  130##JSS
      * ABO DEFINE LARGE STRING FOR CL CMD
     IYARTCM      DS                            512
     I                                        1   1 DUMMY1
     IINFDS#    E DSY2I#DSP
      * Display file information data structure
      *
     IINFDS1    E DSY2I1DSP
      * File information data structure
      *
     ISCSARD    E DSSCSARDPD                                                                  CAS001
      ** External data structures for Switchable Features Details                             CAS001
      *                                                                                       CAS001
     ISDBSRT    E DSSDBSRTPD                                                               AR1022007
      **  External DS for base rate details                                                AR1022007
      *                                                                                    AR1022007
     ISDBANK    E DSSDBANKPD                                                                  CER050
     ISDCURR    E DSSDCURRPD                                                                  CER050
     ISDLOAN    E DSSDLOANPD                                                                  CLE134
     ISDCLND    E DSSDCLNDPD                                                                  CLE134
     IDSSDY     E DSDSSDY                                                                     CLE134
     IDSFDY     E DSDSFDY                                                                     CAS001
      ** First DS for access programs, Short data structure                                   CAS001
      *                                                                                       CAS001
     ILDA       E DSLDA                                                                       CAS001
      ** Local data area for database error details                                           CAS001
      *                                                                                       CAS001
     I@1DBRC    E DSSDFEEL0
      * UPD : Midas SD Fee codes update
      * Current/previous master file format fields for change control
      *
     IQSDFC1    E DSSDFCTLL0
      * UPD : Midas SD Standing data controls update
     IYARDCS      DS                             22
     IWUDELR      DS
     I                                        1 250 WUDR01
     I                                      251 500 WUDR02
     I                                      501 750 WUDR03
     I                                      7511000 WUDR04
     I                                     10011250 WUDR05
     I                                     12511500 WUDR06
     I                                     15011750 WUDR07
     I                                     17512000 WUDR08
     I                                     20012250 WUDR09
     I                                     22512500 WUDR00
     I                                     25012750 WUDR11
     I                                     27513000 WUDR12
      * Outward parameters
     IPARC        DS                           3064
      * RCD : Midas SD Deleted records file retrieval
      * I :  File name
     I                                        1  10 PAFNME
      * I :  Long Key
     I                                       11  60 PALKEY
      * I :  Deleted Data Record Pt1
     I                                       61 310 PADR01
      * I :  Deleted Data Record Pt2
     I                                      311 560 PADR02
      * I :  Deleted Data Record Pt3
     I                                      561 810 PADR03
      * I :  Deleted Data Record Pt4
     I                                      8111060 PADR04
      * I :  Deleted Data Record Pt5
     I                                     10611310 PADR05
      * I :  Deleted Data Record Pt6
     I                                     13111560 PADR06
      * I :  Deleted Data Record Pt7
     I                                     15611810 PADR07
      * I :  Deleted Data Record Pt8
     I                                     18112060 PADR08
      * I :  Deleted Data Record Pt9
     I                                     20612310 PADR09
      * I :  Deleted Data Record Pt10
     I                                     23112560 PADR00
      * I :  Deleted Data Record Pt11
     I                                     25612810 PADR11
      * I :  Deleted Data Record Pt12
     I                                     28113060 PADR12
      * I :  Last Change Date
     I                                    P306130630PALCD
      * I :  Type of Last Change
     I                                     30643064 PATYLC
      *
     IYBRDCS      DS                             22
     IYCRDCS      DS                             26
     IYDRDCS      DS                             22
     IRUNDAT      DS
     I                                        1   7 MRDT
     I                                    P   8  100RDNB
     I                                       11  11 SUC
     I                                       12  12 DFF
     I                                       13  13 MBIN
      *                                                                                       CLE134
     I              '0123456789'          C         DIGITS                                    CLE134
      *                                                                                       CLE134
     IC#LTST      DS                                                                          CLE134
     I                                        1   2 #2CLTY                                    CLE134
     I                                        1   1 #2CLT1                                    CLE134
     I                                        3   4 #2CLST                                    CLE134
     I                                        5   8 #2CLCL                                    CLE134
      *                                                                                       CLE134
     IUPLST       DS                                                                       AR1022007
     I                                        1  11 #UPCSP                                 AR1022007
     I                                       12  12 #UPCSG                                 AR1022007
     I                                       13  19 #UPRMT                                 AR1022007
     I                                       20  23 #UPRFD                                 AR1022007
      *                                                                                    AR1022007
     IA@CPY       DS
     I* Copyright array
     I                                        1  80 CPY@
     IWUDSTT      DS
     I                                        1   1 WUPOS1
     I                                        2   2 WUPOS2
     IID0001      DS                            528
      * File information data structure
      *
     IID0002      DS                            528
      * File information data structure
      *
     I/COPY WNCPYSRC,SDH00134
     I            DS
     I                                        1 132 ZAMSDA
      * Message data for 'Fee Code must be GT 0'
      * Fee Code
     I                                        1   2 ZA0001
      * Message data for 'Question Mark Invalid'
      * Key Field
     I                                        1  10 ZA0002
      * Message data for 'Key Field Invalid Value'
      * If value in key field
     I                                        1   1 ZA0003
      * Key Field
     I                                        2  11 ZA0004
      * Message data for 'No blanks in fee code'
      * Fee Code
     I                                        1   2 ZA0005
      * Message data for 'No blanks in fee code'
      * Fee Code
     I                                        1   2 ZA0006
      * Message data for 'Fee Code must be numeric'
      * Fee Code
     I                                        1   2 ZA0007
      * Message data for 'Fee Narrative is required'
      * Fee Narrative
     I                                        1  20 ZA0008
      * Currency                                                                            AR826996
     I                                        1   3 ZA0009                                  AR826996
      * Base Rate Code                                                                      AR826996
     I                                        4   5 ZA0010                                  AR826996
     I              '0123456789ABCDEFGHI- C         ALPHAN                                    CLE164
     I              'JKLMNOPQRSTUVWXYZ*'                                                      CLE164
     I/COPY WNCPYSRC,SD0320MI01
      /EJECT
      *****************************************************************
      * Entry parameters
     C           *ENTRY    PLIST
     C                     PARM           P0RTN   7
      *****************************************************************
      * Initialize
     C                     EXSR ZZINIT
      *
     C                     DO   *HIVAL
      * Initialise and load subfile page
     C                     EXSR BAIZSF
     C                     MOVEL'N'       W0RSF   1
      * Display screen until reload requested
     C           W0RSF     DOWEQ'N'
      * Display screen
     C                     EXSR CAEXFM
      * Process response
      * Cancel & exit program
     C   03                CAS            ZXEXPG
      * HOME: Request subfile reload
     C   05                CAS            FBRQRL
      * Display next SFL page
     C   27                CAS            BBLDSF
      * Process screen input
     C                     CAS            DAPR##
     C                     END
      *
     C                     END
     C                     END
      *****************************************************************
      /EJECT
     CSR         BAIZSF    BEGSR
      *================================================================
      * Initialise & load subfile page
      *================================================================
      * Clear subfile
     C                     SETON                     80
     C                     WRITE#SFLCTL
     C                     SETOF                     80
      * Reset no of records in subfile
     C                     Z-ADD*ZERO     ##RRMX  50 81     SETOF 81
      * USER: Initialize subfile header
     C                     MOVEL'N'       WUDELA           Deletion Allowe
      * CASE: WRK.Set Up Complete is No
     C           WUSUC     IFEQ 'N'                        *IF
      * CASE: PGM.*Program mode is *CHANGE
     C           W0PMD     IFEQ 'CHG'                      *IF
     C                     MOVEL'Y'       WUDELA           Deletion Allowe
     C                     END                             *FI
     C                     END                             *FI
      * Start of Fix S01117
      * Set up Edit File Footer - Standard Functions  *
     C*****************************************************************
     C*
     C*  Sets up the function key footer text for edit files in which
     C*  records may not be deleted after the system set up flag has
     C*  been set on
     C*
     C*****************************************************************
     C*
     C*  DETAIL LINE COMMAND KEY TEXT
     C*
     C                     MOVEL'SDUSRMSG'WUMSGF 10
     C                     MOVE *BLANKS   WUMTXT 80
     C*
     C*  If program mode is ADD:
     C*
     C           W0PMD     IFEQ 'ADD'
     C* Setup footer text:
     C* F3=Main Menu   F5=Refresh   F9=Go to 'Change' Mode
     C                     MOVEL'USR3349' WUMSID  7        Message Identifier
     C                     CALL 'SDRTVTXT'             90  Retrieve MSGF message
     C           WUMSID    PARM WUMSID    KE0286  7        Message Identifier
     C           WUMSGF    PARM WUMSGF    KE0287 10        Message File Name
     C           WUMTXT    PARM WUMTXT    KE0288 80        Message Text
     C                     MOVELWUMTXT    ##CTX1
     C*
     C           *IN90     IFEQ '1'
     C* Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SDRTVTXT'W0CLPG
     C* Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
     C                     ELSE
     C*
     C*  If set up is not complete:
     C*
     C           WUSUC     IFEQ 'N'
     C* Setup footer text:
     C* D=Delete   F3=Main Menu   F5=Refresh   F9=Go to 'Add' Mode
      *                                                                                       CLE134
     C           CLE134    IFEQ 'Y'                                                           CLE134
     C           CER050    OREQ 'Y'                                                           CER050
     C                     MOVEL'USR5429' WUMSID                                              CLE134
      *                                                                                       CLE134
     C                     ELSE                                                               CLE134
     C                     MOVEL'USR3348' WUMSID           Message Identifier
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C                     CALL 'SDRTVTXT'             90  Retrieve MSGF message
     C           WUMSID    PARM WUMSID    KE0286  7        Message Identifier
     C           WUMSGF    PARM WUMSGF    KE0287 10        Message File Name
     C           WUMTXT    PARM WUMTXT    KE0288 80        Message Text
     C                     MOVELWUMTXT    ##CTX1
     C*
     C           *IN90     IFEQ '1'
     C* Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SDRTVTXT'W0CLPG
     C* Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
     C                     ELSE
     C* Setup footer text:
     C* F3=Main Menu   F5=Refresh   F9=Go to 'Add' Mode
      *                                                                                       CLE134
     C           CLE134    IFEQ 'Y'                                                           CLE134
     C           CER050    OREQ 'Y'                                                           CER050
     C                     MOVEL'USR5430' WUMSID                                              CLE134
      *                                                                                       CLE134
     C                     ELSE                                                               CLE134
     C                     MOVEL'USR3354' WUMSID           Message Identifier
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C                     CALL 'SDRTVTXT'             90  Retrieve MSGF message
     C           WUMSID    PARM WUMSID    KE0286  7        Message Identifier
     C           WUMSGF    PARM WUMSGF    KE0287 10        Message File Name
     C           WUMTXT    PARM WUMTXT    KE0288 80        Message Text
     C                     MOVELWUMTXT    ##CTX1
     C*
     C           *IN90     IFEQ '1'
     C* Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SDRTVTXT'W0CLPG
     C* Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
     C                     END
     C                     END
      * End of Fix S01117
      *................................................................
      * If CHANGE mode, then position file:
     C           W0PMD     IFNE 'ADD'
     C           *LIKE     DEFN #2FECD    WZFECD
     C                     MOVEL#2FECD    WZFECD           Fee Code
     C           KPOS      KLIST
     C                     KFLD           AUFECD           Fee Code
      * Setup key
     C                     MOVEL#2FECD    AUFECD           Fee Code
      * 82=EOF
     C           KPOS      SETLL@AURECR              82    *
      * 82=EOF
     C  N82                READ @AURECR                9182*
     C/COPY WNCPYSRC,SD0320MC01
     C                     ELSE
     C                     SETOF                     82    *
     C                     END
      * Load subfile page
     C                     EXSR BBLDSF
      *................................................................
      * If no records found, display error message
     C   82      ##RR      IFEQ *ZERO                      IF
      * Send message '*No data to display'
     C                     MOVEL'Y2U0008' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     END
      *
      *================================================================
     CSR         BAEXIT    ENDSR
      /EJECT
     CSR         BBLDSF    BEGSR
      *================================================================
      * Load subfile page (write empty page if add mode)
      *================================================================
     C                     SETOF                     84    No SFLNXTCHG
      * Re-establish fields in read-ahead record
     C   27      W0PMD     IFNE 'ADD'
     C  N82                READP@AURECR                  90*
     C  N82                READ @AURECR                  90*
     C/COPY WNCPYSRC,SD0320MC02
     C                     END
      *
      * Setof record error indicators
     C                     MOVE *ALL'0'   WKIND0  3
     C                     MOVE *ALL'1'   WKIND1  3
      * Start at previous highest record in SFL
     C                     Z-ADD##RRMX    ##RR    50
     C                     Z-ADD*ZERO     ##RROK  50
      * Set required pages based on *Set Cursor or *Subfile Pages
     C           W0RR0     IFGT 0
     C           W0RR0     DIV  ##SFPG    ##SPG   30
     C                     MVR            ##SLIN  30
     C           ##SLIN    IFGT 0
     C                     ADD  1         ##SPG
     C                     END
     C           W0SPG     IFGT ##SPG
     C                     Z-ADDW0SPG     ##SPG
     C                     END
     C                     ELSE
     C                     Z-ADDW0SPG     ##SPG
     C                     END
      * Compute lines required based on pages
     C           ##SPG     MULT ##SFPG    ##SFLN  90
     C           ##SFLN    IFGT 999
     C                     Z-ADD999       ##SFLN
     C                     END
      *................................................................
      * Load next subfile page
     C  N82      ##RROK    DOWLT##SFLN                     DO
     C                     ADD  1         ##RR
     C                     MOVEAWKIND0    *IN,32
     C                     MOVE *OFF      *IN35                                               CAS001
     C/COPY WNCPYSRC,SD0320MC03
     C                     SETOF                     87    *
      * Clear subfile fields
     C                     EXSR MAIZ#1
      * If CHANGE mode, load subfile fields
     C           W0PMD     IFNE 'ADD'
     C                     EXSR MBFL#1
      * Validate subfile record and calculate derived fields
     C                     EXSR DFV2RC
     C                     END
      * Output to subfile
     C                     ADD  1         ##RROK     81    *
      * If SFLRCD invalid, note that errors present
     C   98N99             SETON                     99    *
      * Set screen conditioning indicators
     C                     EXSR GADSA1
     C                     WRITE#SFLRCD
     C           W0PMD     IFNE 'ADD'
      * 82=EOF
     C                     READ @AURECR                  82*
     C/COPY WNCPYSRC,SD0320MC04
     C                     END
     C  N82                END
      *................................................................
      * Save highest SFL record load can continue at end point
     C           ##RR      IFGT ##RRMX
      * Calculate top line
     C           ##RROK    DIV  ##SFPG    ##SPG
     C                     MVR            ##SLIN
     C           ##SLIN    IFGT 0
     C           ##RR      SUB  ##SLIN    ##SFRC
     C                     ELSE
     C           ##RR      SUB  ##SFPG    ##SFRC
     C                     END
     C                     ADD  1         ##SFRC
     C                     Z-ADD##RR      ##RRMX
     C                     END
      *================================================================
     CSR         BBEXIT    ENDSR
      /EJECT
     CSR         CAEXFM    BEGSR
      *================================================================
      * Display screen and process HELP requests
      *================================================================
      * Set screen conditioning indicators
     C                     EXSR GBDSA2
      * Update screen time
     C                     TIME           ##TME
     C           W0HLP     DOUEQ'N'
     C                     MOVEL'N'       W0HLP   1
     C                     MOVE *IN25     HELP25  1
     C                     MOVE *ALL'0'   ##OFF  30
     C                     MOVEA##OFF     *IN,1
     C                     MOVE HELP25    *IN25
      * PUTOVR unless conditioned fields change
     C                     SETON                     86
     C           *IN89     IFNE CAIN89
     C           *IN81     ORNE CAIN81
     C                     SETOF                     86
     C                     END
     C                     MOVE *IN89     CAIN89  1
     C                     MOVE *IN81     CAIN81  1
      * Set cursor by *SET CURSOR data
     C           YSETCS    IFEQ 'Y'
     C                     EXSR Y0SET
     C                     END
     C                     WRITE#MSGCTL
     C                     WRITE#CMDTXT1
     C                     EXFMT#SFLCTL
      * Maintain subfile position where possible
     C           @#SFRC    IFGT *ZERO
     C                     Z-ADD@#SFRC    ##SFRC
     C                     END
      * Test cursor
     C                     EXSR Y8TST
      * Clear set cursor DDS indicator
     C           WCSRLC    IFEQ 'OFF'
     C                     SETOF                     94    *
     C                     END
     C                     MOVE *BLANK    WCSRLC
      * If help requested, display help text
     C   25                EXSR ZHHPKY
     C                     END
      * Update job time
     C                     TIME           ##JTM
      * Clear messages from program message queue
     C                     CALL 'Y2CLMSC'
     C                     PARM ##PGM     ZAPGMQ 10
     C                     PARM '*SAME'   ZAPGRL  5
      * Reset first message only flag
     C                     MOVEL'Y'       ZAFSMS  1      99*
     C           YSETCS    IFEQ 'Y'
     C                     EXSR Y9CLR
     C                     END
      *================================================================
     CSR         CAEXIT    ENDSR
      /EJECT
     CSR         DAPR##    BEGSR
      *================================================================
      * Process screen input
      *================================================================
      *
     C           W0PMD     IFNE 'ADD'
      * Change of position specified
     C           WZFECD    CASNE#2FECD    FBRQRL           Fee Code
     C                     END
     C                     END
      * Quit if reload requested
     C           W0RSF     CABEQ'Y'       DAEXIT
      *
     C   81                DO
      * No data entered as yet
     C                     MOVEL'N'       WKIPIN  1
      * Confirm/update is not deferred
     C                     MOVEL'N'       W0DCF   1
      * Process subfile records
     C                     EXSR DBPRSF
      * If error, exit
     C           *IN99     CABEQ'1'       DAEXIT
      * Defer confirm/update requested
     C           W0DCF     CABEQ'Y'       DAEXIT
      * If data entered
     C           WKIPIN    IFEQ 'Y'
      * Update DBF from subfile
     C                     EXSR EAPRSF
      * If error during update, exit:
     C           *IN99     CABEQ'1'       DAEXIT
     C                     END                             WKIPIN
     C                     END
      * Switch between *ADD/*CHANGE modes
     C   09                EXSR FACHMD
      *================================================================
     CSR         DAEXIT    ENDSR
      /EJECT
     CSR         DBPRSF    BEGSR
      *================================================================
      * Process modified subfile record
      *================================================================
     C                     READC#SFLRCD                  92*
     C           *IN92     DOWEQ'0'
     C                     EXSR DCPRSR
     C                     SETOF                     87    *
      * Set screen conditioning indicators
     C                     EXSR GADSA1
     C                     UPDAT#SFLRCD
     C                     READC#SFLRCD                  92*
     C                     END
      *================================================================
     CSR         DBEXIT    ENDSR
      /EJECT
     CSR         DCPRSR    BEGSR
      *================================================================
      * Process subfile record
      *================================================================
      * Set off error indicators
     C                     MOVEAWKIND0    *IN,32
     C                     MOVE *OFF      *IN35                                               CAS001
     C/COPY WNCPYSRC,SD0320MC05
      * No errors
     C                     SETOF                     98
      * No SFLNXTCHG
     C                     SETOF                     84
     C           W0PMD     IFEQ 'ADD'
      * Check for null record
     C                     EXSR DDNLRC
     C           W0NLR     IFEQ 'Y'
     C                     GOTO DCEXIT
     C                     END
      * If not null record, continue
     C                     END
      * Data entered
     C                     MOVEL'Y'       WKIPIN
      * SFLNXTCHG
     C                     SETON                     84
      * If delete request, bypass validation
     C           #1SEL     IFEQ 'D'
     C           WUDELA    ANDEQ'Y'                                                           CLE134
     C                     GOTO DCEXIT
     C                     END
      * Validate subfile record
     C                     EXSR DEV1RC
      * If SFLRCD invalid, note the fact
     C   98N99             Z-ADD##RR      ##SFRC     99    *
      *================================================================
     CSR         DCEXIT    ENDSR
      /EJECT
     CSR         DDNLRC    BEGSR
      *================================================================
      * Check for null record
      *================================================================
     C                     MOVEL'N'       W0NLR   1
     C           #1FECD    CABNE*BLANK    DDEXIT           Fee Code
     C           #1FENV    CABNE*BLANK    DDEXIT           Fee Narrative
     C           #1ADJY    CABNE*BLANK    DDEXIT                                              CAS001
     C/COPY WNCPYSRC,SDH00135
     C                     MOVEL'Y'       W0NLR
      *================================================================
     CSR         DDEXIT    ENDSR
      /EJECT
     CSR         DEV1RC    BEGSR
      *================================================================
      * Validate subfile record
      *================================================================
      * USER: Validate subfile record fields
      * Start of Fix S01117
      * Fee Code validation
      * CASE: PGM.*Program mode is *ADD
     C           W0PMD     IFEQ 'ADD'                      *IF
      * CASE: RCD.Fee Code is entered
     C           #1FECD    IFNE *BLANK                     *IF
      * CASE: RCD.Fee Code is zero
     C           #1FECD    IFGE '0'                        *IF
     C           #1FECD    ANDLE'00'
      * Setup message data for message
     C                     MOVEL#1FECD    ZA0001           Fee Code
      * Send message 'Fee Code must be GT 0'
     C                     MOVEL'USR1401' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9833  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL#1FECD    WUTQKF           Test ? in Key F
     C                     MOVEL#1FECD    WUIVKF           If value in key
      * CASE: WRK.Test ? in Key Field is Question Mark
     C           WUTQKF    IFEQ '?'                        *IF
      * Setup message data for message
     C                     MOVEL#1FECD    ZA0002           Fee Code
      * Send message 'Question Mark Invalid'
     C                     MOVEL'USR0380' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9833  *
      *
     C                     ELSE
      * CASE: WRK.If value in key field is Asterisk
     C           WUIVKF    IFEQ '*'                        *IF
      * Setup message data for message
     C                     MOVELWUIVKF    ZA0003           If value in key
     C                     MOVEL#1FECD    ZA0004           Fee Code
      * Send message 'Key Field Invalid Value'
     C                     MOVEL'USR0849' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9833  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
      * Chek for blanks in the key field
     C                     EXSR UASUBR                     Chek for blanks
     C                     MOVEL*BLANK    WUZASF           ZALIGN Screen F
     C                     MOVEL#1FECD    WUZASF           ZALIGN Screen F
      * ZALIGN Screen Field - Standard Functions  *
     C                     CALL 'ZALIGN'               90  ZALIGN Screen F
     C           W0RTN     PARM W0RTN     WQ0001  7        *Return code
     C           WUZASF    PARM WUZASF    WQ0002 16        ZALIGN Screen F
     C                     PARM *ZERO     WQ0003  10       ZALIGN No Of De
     C                     PARM 2         WQ0004  20       ZALIGN No Of Di
     C           WUZAFF    PARM *BLANK    WQ0005 16        ZALIGN File Fie
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'ZALIGN'  W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C                     SETON                     98    *
     C                     END
      * CASE: PGM.*Return code is Old Table Error
     C           W0RTN     IFEQ '*ERROR*'                  *IF
      * Setup message data for message
     C                     MOVEL#1FECD    ZA0007           Fee Code
      * Send message 'Fee Code must be numeric'
     C                     MOVEL'USR1402' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9833  *
      *
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
      *                                                                                       CLE134
     C           CLE134    IFEQ 'Y'                                                           CLE164
     C           #1SEL     ANDEQ'E'                                                           CLE164
     C           CER050    OREQ 'Y'                                                           CER050
     C           #1SEL     ANDEQ'E'                                                           CER050
     C                     MOVE *ON       *IN19                                               CLE164
     C                     ELSE                                                               CLE164
     C                     MOVE *OFF      *IN19                                               CLE164
     C                     ENDIF                                                              CLE164
     C           #1SEL     IFEQ 'D'                                                           CLE134
     C           WUDELA    ANDEQ'N'                                                           CLE134
     C                     MOVEL'USR5433' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     MOVE *ON       *IN32                                               CLE134
     C                     MOVE *ON       *IN98                                               CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C           CLE134    IFEQ 'N'                                                           CLE134
     C           CER050    ANDEQ'N'                                                           CER050
     C           #1SEL     IFEQ 'A'                                                           CLE134
     C           #1SEL     OREQ 'E'                                                           CLE134
     C                     MOVEL'USR5434' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     MOVE *ON       *IN32                                               CLE134
     C                     MOVE *ON       *IN98                                               CLE134
     C                     ENDIF                                                              CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C           CLE134    IFEQ 'Y'                                                           CLE134
     C           CER050    OREQ 'Y'                                                           CER050
     C           #1SEL     IFEQ 'A'                                                           CLE134
     C           #1SEL     OREQ 'E'                                                           CLE134
     C           CLE036    IFEQ 'Y'                                                        AR1080662
     C                     MOVE *OFF      *IN72                                            AR1080662
     C                     MOVE *OFF      *IN73                                            AR1080662
     C                     ENDIF                                                           AR1080662
     C           CER050    IFEQ 'Y'                                                           CER050
     C                     MOVE *OFF      *IN65                                               CER050
     C                     MOVE *OFF      *IN66                                               CER050
     C                     ENDIF                                                              CER050
     C                     EXSR DTLSCN                                                        CLE134
     C                     ENDIF                                                              CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
      * Fee Narrative is required
      * CASE: RCD.Fee Narrative is blank
     C           #1FENV    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1FENV    ZA0008           Fee Narrative
      * Send message 'Fee Narrative is required'
     C                     MOVEL'USR1403' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9834  *
      *
     C                     END                             *FI
      * End of Fix S01117
     C/COPY WNCPYSRC,SD0320MC06
      *                                                                                       CAS001
      ** If CAS001 is installed, validate Adjustment to Yield entry.                          CAS001
      *                                                                                       CAS001
     C           CAS001    IFEQ 'Y'                                                           CAS001
     C           #1ADJY    IFEQ *BLANK                                                        CAS001
     C           #1ADJY    OREQ 'Y'                                                           CAS001
     C           #1ADJY    OREQ 'N'                                                           CAS001
      *                                                                                       CAS001
     C                     ELSE                                                               CAS001
      *                                                                                       CAS001
      ** Send message if value is other than Y, N and *Blank.                                 CAS001
      *                                                                                       CAS001
     C                     MOVEL'USR9155' ZAMSID                                              CAS001
     C                     MOVEL'SDUSRMSG'ZAMSGF                                              CAS001
     C                     EXSR ZASNMS                                                        CAS001
     C                     MOVE *ON       *IN35                                               CAS001
     C                     MOVE *ON       *IN98                                               CAS001
      *                                                                                       CAS001
     C                     ENDIF                                                              CAS001
     C                     ENDIF                                                              CAS001
      *                                                                                       CAS001
      ** Perform additional validation when CAS009 is on. Retrieve the current                CAS009
      ** Adjustment to Yeild value.                                                           CAS009
      *                                                                                       CAS009
     C           CAS009    IFEQ 'Y'                                                           CAS009
      *                                                                                       CAS009
     C           #1FECD    CHAINSDFEEL1              94                                       CAS009
      *                                                                                       CAS009
      ** Only Validate when the initialisation program has ran                                231568
     C           #1ADJY    IFNE AUADJY                                                        CAS009
     C           WCAS9I    ANDEQ'Y'                                                           231568
      *                                                                                       CAS009
     C                     MOVE #1FECD    WFECD   20                                          CAS009
      *                                                                                       CAS009
      ** If there is a change in the Adjustment to Yield field, check necessary files         CAS009
      ** if the fee has already been used.  Raise and error if fee has been used.             CAS009
      *                                                                                       CAS009
     C********** WFECD     CHAINDLFEEDL0             93                                CAS009 231568
     C           WFECD     CHAINDLFEEDLG             93                                       231568
      *                                                                                       CAS009
     C           *IN93     IFEQ '1'                                                           CAS009
      *                                                                                       CAS009
     C********** WFECD     CHAINLEFEEDLA             93                                CAS009 231568
     C********** WFECD     CHAINLEFEEDLE             93                                231568 CAS011
     C********** WFECD     CHAINLEFEEDLF             93                                CAS011 CLE134
     C           WFECD     CHAINLEFEEDLF            N93                                       CLE134
      *                                                                                       CAS009
     C                     ENDIF                                                              CAS009
      *                                                                                       CAS009
     C           *IN93     IFEQ '0'                                                           CAS009
     C                     MOVEL'USR9425' ZAMSID                                              CAS009
     C                     MOVEL'SDUSRMSG'ZAMSGF                                              CAS009
     C                     EXSR ZASNMS                                                        CAS009
     C                     MOVE *ON       *IN35                                               CAS009
     C                     MOVE *ON       *IN98                                               CAS009
     C                     ENDIF                                                              CAS009
      *                                                                                       CAS009
     C                     ENDIF                                                              CAS009
      *                                                                                       CAS009
     C                     ENDIF                                                              CAS009
      * Validate subfile record relations
     C                     EXSR DFV2RC
      * Fee Code required
     C           #1FECD    IFEQ *BLANK                     IF
     C                     SETON                     9833  *
      * Send message '*Value required'
     C                     MOVEL'Y2U0001' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     END                             FI
      *================================================================
     CSR         DEEXIT    ENDSR
      /EJECT
     CSR         DFV2RC    BEGSR
      *================================================================
      * Validate subfile record relations
      *================================================================
      *================================================================
     CSR         DFEXIT    ENDSR
      /EJECT
     CSR         EAPRSF    BEGSR
      *================================================================
      * Update DBF from subfile
      *================================================================
      * Initialise subfile reload flag
     C           W0PMD     IFEQ 'ADD'
     C                     MOVEL'Y'       W0RSF
     C                     ELSE
     C                     MOVEL'N'       W0RSF
     C                     END
      * Process all modified subfile records
     C                     READC#SFLRCD                  92*
     C           *IN92     DOWEQ'0'
      * Process modified subfile record
     C                     EXSR EBPRSR
     C           W0RTN     IFNE *BLANK
      * Error: ROLLBACK any DBF changes
     C                     ROLBK
     C                     ELSE
      * Otherwise COMMIT any DBF changes
     C                     COMIT
     C                     END
      *                                                                                       CAS009
      ** Do not blank out value of #1SEL on the screen when there is a error.                 CAS009
      *                                                                                       CAS009
     C           *IN32     IFNE '1'                                                           CAS009
     C                     MOVEL*BLANK    #1SEL
     C                     ENDIF                                                              CAS009
      * Set screen conditioning indicators
     C                     EXSR GADSA1
     C                     UPDAT#SFLRCD
     C                     READC#SFLRCD                  92*
     C                     END
      * If any errors, cancel reload
     C           *IN99     IFEQ '1'
     C                     MOVEL'N'       W0RSF   1
     C                     END
      *================================================================
     CSR         EAEXIT    ENDSR
      /EJECT
     CSR         EBPRSR    BEGSR
      *================================================================
      * Process modified subfile record
      *================================================================
      * Set off error indicators
     C                     MOVEAWKIND0    *IN,32
     C/COPY WNCPYSRC,SD0320MC07
     C                     SETOF                     98
      *
     C           W0PMD     IFEQ 'ADD'
      * Process add request
     C           #1SEL     IFNE 'D'
     C                     EXSR DDNLRC
     C           W0NLR     IFNE 'Y'
     C                     EXSR ECADRQ
     C                     END
     C                     END
     C                     ELSE
     C           #1SEL     IFEQ 'D'
      *                                                                                       CAS009
      ** Validate delete option for the fee code.                                             CAS009
      *                                                                                       CAS009
     C           CAS009    IFEQ 'Y'                                                           CAS009
      *                                                                                       CAS009
     C                     MOVE #1FECD    WFECD                                               CAS009
      *                                                                                       CAS009
     C           WFECD     CHAINDLFEEDL0             93                                       CAS009
      *                                                                                       CAS009
     C           *IN93     IFEQ '1'                                                           CAS009
      *                                                                                       CAS009
     C********** WFECD     CHAINLEFEEDLA             93                                CAS009 CAS011
     C           WFECD     CHAINLEFEEDLB             93                                       CAS011
      *                                                                                       CAS009
     C                     ENDIF                                                              CAS009
      *                                                                                       CAS009
     C           *IN93     IFEQ '0'                                                           CAS009
     C                     MOVEL'USR9427' ZAMSID                                              CAS009
     C                     MOVEL'SDUSRMSG'ZAMSGF                                              CAS009
     C                     EXSR ZASNMS                                                        CAS009
     C                     MOVE *ON       *IN32                                               CAS009
     C                     MOVE *ON       *IN98                                               CAS009
     C                     GOTO EBEXIT                                                        CAS009
     C                     ENDIF                                                              CAS009
     C                     ENDIF                                                              CAS009
      * Process delete request
     C                     EXSR EDDLRQ
     C                     ELSE
      * Process change request
     C           #1SEL     IFNE 'E'                                                           CLE134
     C                     EXSR EECHRQ
     C                     ENDIF                                                              CLE134
     C                     END
     C                     END
      * If error occurred on update, note the fact
     C           *IN98     IFEQ '1'
     C           *IN99     IFEQ '0'
     C                     Z-ADD##RR      ##SFRC     99    *
     C                     END
     C                     END
      *================================================================
     CSR         EBEXIT    ENDSR
      /EJECT
     CSR         ECADRQ    BEGSR
      *================================================================
      * Process add request
      *================================================================
      * USER: Create DBF record
      * Create Fee Codes - Fee Codes  *
     C                     EXSR SACRRC
     C           W0RTN     IFNE *BLANK
      * Write error detected
      * Screen errors
     C                     MOVEAWKIND1    *IN,32
      * Format error
     C/COPY WNCPYSRC,SD0320MC08
     C                     SETON                     98    *
      * Enable entry
     C                     SETOF                     87    *
      * SFLNXTCHG
     C                     SETON                     84    *
     C                     ELSE
      * DBF write successful
      * disable entry
     C                     SETON                     87    *
      * No SFLNXTCHG
     C                     SETOF                     84    *
     C                     END
      *================================================================
     CSR         ECEXIT    ENDSR
      /EJECT
     CSR         EDDLRQ    BEGSR
      *================================================================
      * Process delete request
      *================================================================
      * USER: Delete DBF record
      * Delete Fee Codes - Fee Codes  *
     C                     EXSR SCDLRC
     C           W0RTN     IFNE *BLANK
      * Delete unsuccessful
      * Screen errors
     C                     MOVEAWKIND1    *IN,32
     C/COPY WNCPYSRC,SD0320MC09
      * Format error
     C                     SETON                     98    *
      * Enable entry
     C                     SETOF                     87    *
      * SFLNXTCHG
     C                     SETON                     84    *
      * If record altered, reset subfile record
     C           W0RTN     CASEQ'Y2U0007' MBFL#1           IF
     C                     END
     C                     ELSE
      * DBF delete successful
      * Blank out record and protect from entry
     C                     EXSR MAIZ#1
      * disable entry
     C                     SETON                     87    *
      * No SFLNXTCHG
     C                     SETOF                     84    *
      * Reload subfile
     C                     MOVEL'Y'       W0RSF   1
     C                     END
      *================================================================
     CSR         EDEXIT    ENDSR
      /EJECT
     CSR         EECHRQ    BEGSR
      *================================================================
      * Process update request
      *================================================================
      * USER: Change DBF record
      * Change Fee Codes - Fee Codes  *
     C                     EXSR SECHRC
     C           W0RTN     IFNE *BLANK
      * Data update error
      * Screen errors
     C                     MOVEAWKIND1    *IN,32
      * Format error
     C/COPY WNCPYSRC,SD0320MC10
     C                     SETON                     98    *
      * Enable entry
     C                     SETOF                     87    *
      * SFLNXTCHG
     C                     SETON                     84    *
      * Reset subfile record if changed record
     C           W0RTN     CASEQ'Y2U0007' MBFL#1           IF
     C                     END
     C                     ELSE
      * DBF update successful
      * Enable entry
     C                     SETOF                     87    *
      * No SFLNXTCHG
     C                     SETOF                     84    *
     C                     END
      *================================================================
     CSR         EEEXIT    ENDSR
      /EJECT                                                                                  CLE134
     C           DTLSCN    BEGSR                                                              CLE134
      *================================================================                       CLE134
      * DTLSCN: Detail Screen introduced by CLE134                                            CLE134
      *================================================================                       CLE134
      *                                                                                    AR1022007
      ** Initialise SM007/CRE073 Detail Screen                                             AR1022007
      *                                                                                    AR1022007
     C                     CLEARUPLST                                                      AR1022007
     C                     Z-ADD0         N#CSP                                            AR1022007
      *                                                                                       CLE134
      ** Get Fee Code record                                                                  CLE134
      *                                                                                       CLE134
     C           #1FECD    CHAINSDFEEL1              77                                       CLE134
      *                                                                                       CLE134
     C           *IN77     IFEQ *OFF                                                          CLE134
     C           CLE134    IFEQ 'Y'                                                           CER050
     C                     MOVE AUCLTY    #2CLTY                                              CLE134
     C                     MOVE AUCLST    #2CLST                                              CLE134
     C                     MOVE AUCLCL    #2CLCL                                              CLE134
      *                                                                                       CLE134
     C           AUCBSR    IFEQ *ZEROS                                                        CLE134
     C                     MOVE *BLANKS   #2CBSR                                              CLE134
     C                     ELSE                                                               CLE134
     C                     MOVE AUCBSR    #2CBSR                                              CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C           AUCBRT    IFEQ *ZEROS                                                     AR1080662
     C           *IN71     OREQ '0'                                                        AR1080662
     C                     MOVE *BLANKS   #2CBRT                                           AR1080662
     C                     ELSE                                                            AR1080662
     C                     Z-ADD0         W#NUMB                                           AR1080662
     C                     MOVE AUCBRT    W#NUMB                                           AR1080662
     C                     CALL 'ZSEDIT'                                                   AR1080662
     C                     PARM           W#NUMB 150                                       AR1080662
     C                     PARM 7         W#DECS  10                                       AR1080662
     C                     PARM *BLANK    W#EDTC  1                                        AR1080662
     C                     PARM           W#CHAR 21                                        AR1080662
     C                     MOVELW#CHAR    W#CH20 20                                        AR1080662
     C                     MOVE W#CH20    #2CBRT                                           AR1080662
     C                     Z-ADD0         W#NUMB                                           AR1080662
     C                     ENDIF                                                           AR1080662
      *                                                                                    AR1080662
     C           AUCRSP    IFEQ 0                                                             CLE134
     C                     MOVE *BLANKS   #2CRSP                                              CLE134
      *                                                                                       CLE134
     C                     ELSE                                                               CLE134
     C                     MOVE AUCRSP    W#NUMB                                              CLE134
      *                                                                                       CLE134
     C                     CALL 'ZSEDIT'                                                      CLE134
     C                     PARM           W#NUMB 150                                          CLE134
     C                     PARM 7         W#DECS  10                                          CLE134
     C                     PARM *BLANK    W#EDTC  1                                           CLE134
     C                     PARM           W#CHAR 21                                           CLE134
      *                                                                                       CLE134
     C                     MOVELW#CHAR    W#CH20 20                                           CLE134
     C                     MOVE W#CH20    #2CRSP                                              CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C                     MOVE AUCRIN    #2CRIN                                              CLE134
     C                     MOVE AUBSRI    #2BSRI                                              CLE134
      *                                                                                       CLE134
     C           AUICBS    IFEQ *ZERO                                                         CLE134
     C                     MOVE *BLANKS   #2ICBS                                              CLE134
      *                                                                                       CLE134
     C                     ELSE                                                               CLE134
     C                     MOVE AUICBS    #2ICBS                                              CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C                     MOVE AUOVRA    #2OVRA                                              CLE134
     C                     MOVE AUFAMU    #2FAMU                                              CLE134
     C                     MOVE AUFSFA    #2FSFA                                              CLE134
      *                                                                                       CLE134
     C           AUSFAM    IFEQ 0                                                             CLE134
     C                     MOVE *BLANKS   #2SFAM                                              CLE134
      *                                                                                       CLE134
     C                     ELSE                                                               CLE134
     C                     MOVE AUSFAM    W#NUMB                                              CLE134
      *                                                                                       CLE134
     C                     CALL 'ZSEDIT'                                                      CLE134
     C                     PARM           W#NUMB 150                                          CLE134
     C                     PARM 0         W#DECS  10                                          CLE134
     C                     PARM *BLANK    W#EDTC  1                                           CLE134
     C                     PARM           W#CHAR 21                                           CLE134
      *                                                                                       CLE134
     C                     MOVELW#CHAR    W#CH20 20                                           CLE134
     C                     MOVE W#CH20    #2SFAM                                              CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C           AUSFPM    IFEQ 0                                                             CLE134
     C                     MOVE *BLANKS   #2SFPM                                              CLE134
      *                                                                                       CLE134
     C                     ELSE                                                               CLE134
     C                     MOVE AUSFPM    W#NUMB                                              CLE134
      *                                                                                       CLE134
     C                     CALL 'ZSEDIT'                                                      CLE134
     C                     PARM           W#NUMB 150                                          CLE134
     C                     PARM 0         W#DECS  10                                          CLE134
     C                     PARM *BLANK    W#EDTC  1                                           CLE134
     C                     PARM           W#CHAR 21                                           CLE134
      *                                                                                       CLE134
     C                     MOVELW#CHAR    W#CH20 20                                           CLE134
     C                     MOVE W#CH20    #2SFPM                                              CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C                     MOVE AUFPYA    #2FPYA                                              CLE134
     C                     MOVE AUPSIN    #2PSIN                                              CLE134
      *                                                                                       CLE134
     C           AUPSLM    IFEQ 0                                                             CLE134
     C                     MOVE *BLANKS   #2PSLM                                              CLE134
      *                                                                                       CLE134
     C                     ELSE                                                               CLE134
     C                     MOVE AUPSLM    W#NUMB                                              CLE134
      *                                                                                       CLE134
     C                     CALL 'ZSEDIT'                                                      CLE134
     C                     PARM           W#NUMB 150                                          CLE134
     C                     PARM 0         W#DECS  10                                          CLE134
     C                     PARM *BLANK    W#EDTC  1                                           CLE134
     C                     PARM           W#CHAR 21                                           CLE134
      *                                                                                       CLE134
     C                     MOVELW#CHAR    W#CH20 20                                           CLE134
     C                     MOVE W#CH20    #2PSLM                                              CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C                     MOVE AUFEMC    #2FEMC                                              CLE134
     C                     MOVE AUGDPR    #2GDPR                                              CLE134
     C**********           MOVE AUPCKO    #2PCKO                                       CLE134 CLE164
     C                     MOVE AUPGID    #2PGID                                              CLE164
     C           AUPGID    CHAINSDPRGPI0             86                                       CLE164
     C           *IN86     IFEQ '0'                                                           CLE164
     C                     MOVE PGDESC    #2PDES                                              CLE164
     C                     ELSE                                                               CLE164
     C                     MOVE *BLANKS   #2PDES                                              CLE164
     C                     ENDIF                                                              CLE164
     C                     ENDIF                                                              CER050
      *                                                                                       CER050
     C           CER050    IFEQ 'Y'                                                           CER050
     C           AUMINF    IFEQ 0                                                             CER050
     C                     MOVE *BLANKS   #1MINF                                              CER050
     C                     ELSE                                                               CER050
     C                     MOVE AUMINF    W#NUMB                                              CER050
     C                     CALL 'ZSEDIT'                                                      CER050
     C                     PARM           W#NUMB 150                                          CER050
     C                     PARM A6NBDP    W#DECS  10                                          CER050
     C                     PARM *BLANK    W#EDTC  1                                           CER050
     C                     PARM           W#CHAR 21                                           CER050
     C                     MOVELW#CHAR    W#CH20 20                                           CER050
     C                     MOVE W#CH20    #1MINF                                              CER050
     C                     ENDIF                                                              CER050
     C           AUIAPR    IFEQ *BLANKS                                                       CER050
     C                     MOVE 'N'       #1IAPR                                              CER050
     C                     ELSE                                                               CER050
     C                     MOVE AUIAPR    #1IAPR                                              CER050
     C                     ENDIF                                                              CER050
     C                     ENDIF                                                              CER050
      *                                                                                       CER050
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
      ** Set indicators according to action: protect fields                                   CLE134
      *                                                                                       CLE134
     C           #1SEL     IFEQ 'E'                                                           CLE134
     C                     MOVE *ON       *IN77                                               CLE134
     C                     MOVE *ON       *IN72                                            AR1080662
     C                     MOVE *OFF      *IN73                                            AR1080662
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C                     CALL 'Y2CLMSC'                                                     CLE134
     C                     PARM ##PGM     ZAPGMQ                                              CLE134
     C                     PARM '*SAME'   ZAPGRL                                              CLE134
      *                                                                                       CLE134
      ** Set SM007/CRE073 fields on screen                                                 AR1022007
      *                                                                                    AR1022007
     C           CRE073    IFEQ 'Y'                                                        AR1022007
     C           AUPCSP    IFEQ 0                                                          AR1022007
     C                     MOVE *BLANKS   #UPCSP                                           AR1022007
     C                     ELSE                                                            AR1022007
     C                     MOVE AUPCSP    W#NUMB                                           AR1022007
     C                     CALL 'ZSEDIT'                                                   AR1022007
     C                     PARM           W#NUMB 150                                       AR1022007
     C                     PARM 7         W#DECS  10                                       AR1022007
     C                     PARM *BLANK    W#EDTC  1                                        AR1022007
     C                     PARM           W#CHAR 21                                        AR1022007
     C                     MOVELW#CHAR    W#CH20 20                                        AR1022007
     C                     MOVE W#CH20    #UPCSP                                           AR1022007
     C                     ENDIF                                                           AR1022007
      *                                                                                    AR1022007
     C                     MOVE AUPCSG    #UPCSG                                           AR1022007
     C                     MOVE AUPFMT    #UPRMT                                           AR1022007
     C                     MOVE AUPRFD    #UPRFD                                           AR1022007
     C                     ENDIF                                                           AR1022007
      *                                                                                    AR1022007
     C           *INKL     DOUEQ*ON                                                           CLE134
     C           *IN97     OREQ *OFF                                                          CLE134
     C           W0DEF     ANDEQ'N'                                                           CLE164
     C                     WRITE#MSGCTL                                                       CLE134
     C                     EXFMT#RCDDTL                                                       CLE134
      *                                                                                       CLE134
     C                     CALL 'Y2CLMSC'                                                     CLE134
     C                     PARM ##PGM     ZAPGMQ                                              CLE134
     C                     PARM '*SAME'   ZAPGRL                                              CLE134
      *                                                                                       CLE134
     C                     MOVE *INKL     #1F12                                               CLE134
     C                     MOVEL'N'       W0DEF                                               CLE164
      *                                                                                       CLE134
     C           #1SEL     IFEQ 'A'                                                           CLE134
     C           *INKL     ANDEQ*OFF                                                          CLE134
     C                     EXSR VALDTL                                                        CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C                     ENDDO                                                              CLE134
      *================================================================                       CLE134
     C                     ENDSR                                                              CLE134
      /EJECT                                                                                  CLE134
     C           VALDTL    BEGSR                                                              CLE134
      *================================================================                       CLE134
      * VALDTL: Validate Detail Screen introduced by CLE134                                   CLE134
      *================================================================                       CLE134
      *                                                                                       CLE134
      ** Past Due Call Loan Type/Subtype (& Loan Class if feature present)                    CLE134
      *                                                                                       CLE134
     C           CLE134    IFEQ 'Y'                                                           CER050
      *                                                                                       CER050
     C                     SELEC                                                              CLE134
     C           C#LTST    WHEQ *BLANKS                                                       CLE134
      *                                                                                       CLE134
     C           #2CLT1    WHNE 'Z'                                                           CLE134
     C                     MOVE *ON       *IN36                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5431' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
      *                                                                                       CLE134
     C           CLE042    WHEQ 'Y'                                                           CLE134
     C           #2CLCL    ANDEQ*BLANKS                                                       CLE134
     C                     MOVE *ON       *IN50                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5439' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
      *                                                                                       CLE134
     C                     OTHER                                                              CLE134
     C                     CALL 'AOLOANR0'                                                    CLE134
     C                     PARM *BLANKS   PRTCD                                               CLE134
     C                     PARM '*KEY'    POPTN                                               CLE134
     C                     PARM #2CLTY    P@LNTY  2                                           CLE134
     C                     PARM #2CLST    P@LNST  2                                           CLE134
     C                     PARM #2CLCL    P@LNCL  4                                           CLE134
     C           SDLOAN    PARM SDLOAN    DSFDY                                               CLE134
      *                                                                                       CLE134
     C                     SELEC                                                              CLE134
     C           PRTCD     WHEQ '*NRF'                                                        CLE134
     C                     MOVE *ON       *IN36                                               CLE134
     C                     MOVE *ON       *IN37                                               CLE134
      *                                                                                       CLE134
     C           CLE042    IFEQ 'Y'                                                           CLE134
     C                     MOVE *ON       *IN50                                               CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5413' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
      *                                                                                       CLE134
     C           PRTCD     WHNE *BLANKS                                                       CLE134
     C           *LOCK     IN   LDA                                                           CLE134
     C                     MOVEL'SD0320M 'DBPGM                                               CLE134
     C                     MOVEL'SDLOANPD'DBFILE                                              CLE134
     C                     MOVELC#LTST    DBKEY                                               CLE134
     C                     Z-ADD5         DBASE                                               CLE134
     C                     OUT  LDA                                                           CLE134
     C                     EXSR *PSSR                                                         CLE134
     C                     ENDSL                                                              CLE134
      *                                                                                       CLE134
     C                     ENDSL                                                              CLE134
      *                                                                                       CLE134
      ** Past Due Default Base Rate                                                           CLE134
      *                                                                                       CLE134
      ** If no Past Due Loan Type entered;                                                    CLE134
      ** - Input not allowed.                                                                 CLE134
      *                                                                                       CLE134
     C                     Z-ADD0         N#CBRT 117                                       AR1080662
     C                     MOVE *OFF      *IN73                                            AR1080662
     C           C#LTST    IFEQ *BLANKS                                                       CLE134
     C           #2CBSR    IFNE *BLANKS                                                       CLE134
     C           #2CBRT    ORNE *BLANKS                                                    AR1080662
     C**********           MOVE *ON       *IN38                                     CLE134 AR1080662
     C           #2CBSR    COMP *BLANKS              38                                    AR1080662
     C           #2CBRT    COMP *BLANKS              73                                    AR1080662
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5489' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
      ** Else Past Due Loan Type entered;                                                     CLE134
      ** - Input mandatory.                                                                   CLE134
      *                                                                                       CLE134
     C                     ELSE                                                               CLE134
     C           #2CBSR    IFEQ *BLANKS                                                       CLE134
     C           #2CRSP    ANDEQ*BLANKS                                                       CLE134
     C           #2CBRT    ANDEQ*BLANKS                                                    AR1080662
     C           #UPCSP    ANDEQ*BLANKS                                                    AR1080662
      *                                                                                    AR1022007
      ** Rate/Spread only if SM007/CRE073 is off                                           AR1022007
      *                                                                                    AR1022007
     C           CRE073    IFEQ 'N'                                                        AR1022007
     C                     MOVE *ON       *IN38                                               CLE134
     C                     MOVE *ON       *IN39                                               CLE134
     C                     MOVE *ON       *IN73                                            AR1080662
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5488' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                           AR1022007
      *                                                                                    AR1022007
      *                                                                                       CLE134
      ** - Must be a valid value.                                                             CLE134
      *                                                                                       CLE134
     C                     ELSE                                                               CLE134
     C           #2CBSR    IFNE *BLANKS                                                       CLE134
     C           #2CBSR    ANDNE*ZEROS                                                        CLE134
     C           #2CBRT    ANDNE*BLANKS                                                    AR1080662
     C                     MOVE *ON       *IN38                                            AR1080662
     C                     MOVE *ON       *IN73                                            AR1080662
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5498' ZAMSID                                           AR1080662
     C                     EXSR ZASNMS                                                     AR1080662
     C                     ENDIF                                                           AR1080662
      *                                                                                       CLE134
     C           #2CBSR    IFNE *BLANKS                                                    AR1080662
     C           DIGITS    CHECK#2CBSR    WPOS    30                                          CLE134
      *                                                                                       CLE134
     C           WPOS      IFGT 0                                                             CLE134
     C                     MOVE *ON       *IN38                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5419' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ELSE                                                             AR826996
     C                     EXSR SRVBRC                                                      AR826996
     C           *IN64     IFEQ *ON                                                         AR826996
     C                     MOVE *ON       *IN38                                             AR826996
     C                     MOVE *ON       *IN97                                             AR826996
     C                     MOVEL'USR5446' ZAMSID                                            AR826996
     C                     MOVELFEFCCY    ZA0009                                            AR826996
     C                     MOVEL#2CBSR    ZA0010                                            AR826996
     C                     EXSR ZASNMS                                                      AR826996
     C                     ENDIF                                                            AR826996
     C                     ENDIF                                                              CLE134
     C                     ENDIF                                                              CLE134
     C           #2CBRT    IFNE *BLANKS                                                    AR1080662
     C           *IN71     ANDEQ'1'                                                        AR1080662
     C                     CALL 'ZALIGN'                                                   AR1080662
     C           W0RTN     PARM *BLANKS   WQ0001                                           AR1080662
     C                     PARM #2CBRT    WQ0002                                           AR1080662
     C                     PARM 7         WQ0003                                           AR1080662
     C                     PARM 4         WQ0004                                           AR1080662
     C                     PARM *BLANKS   WQ0005                                           AR1080662
      *                                                                                    AR1080662
     C           W0RTN     IFEQ *BLANKS                                                    AR1080662
     C                     MOVE WQ0005    N#CBRT                                           AR1080662
      *                                                                                    AR1080662
     C                     CALL 'ZEDIT'                                                    AR1080662
     C                     PARM WQ0005    WQ0002                                           AR1080662
     C                     PARM 7         WQ0003                                           AR1080662
      *                                                                                    AR1080662
     C                     MOVE WQ0002    #2CBRT                                           AR1080662
      *                                                                                    AR1080662
     C                     ELSE                                                            AR1080662
     C                     MOVE *ON       *IN73                                            AR1080662
     C                     MOVE *ON       *IN97                                            AR1080662
     C                     MOVEL'USR5423' ZAMSID                                           AR1080662
     C                     EXSR ZASNMS                                                     AR1080662
     C                     ENDIF                                                           AR1080662
     C                     ENDIF                                                           AR1080662
     C                     ENDIF                                                              CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
      ** Past Due Default Rate/Spread                                                         CLE134
      *                                                                                       CLE134
     C                     Z-ADD0         N#CRSP                                              CLE134
      *                                                                                    AR1022007
      ** Calculate Rate/Spread and Spread ind only if SM007/CRE073 is off.                 AR1022007
      *                                                                                    AR1022007
     C           CRE073    IFEQ 'N'                                                        AR1022007
      *                                                                                       CLE134
      ** If no Past Due Loan Type entered;                                                    CLE134
      ** - Input not allowed.                                                                 CLE134
      *                                                                                       CLE134
     C           C#LTST    IFEQ *BLANKS                                                       CLE134
     C           #2CRSP    IFNE *BLANKS                                                       CLE134
     C                     MOVE *ON       *IN39                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5494' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
      ** Else Past Due Loan Type entered;                                                     CLE134
      ** - Input mandatory.                                                                   CLE134
      *                                                                                       CLE134
     C                     ELSE                                                               CLE134
     C           #2CRSP    IFEQ *BLANKS                                                       CLE134
     C           #2CBSR    ANDEQ*BLANKS                                                       CLE134
     C           #2CBRT    ANDEQ*BLANKS                                                    AR1080662
     C           #2CRSP    OREQ *BLANKS                                                       CLE134
     C           #2CBSR    ANDEQ*ZEROS                                                        CLE134
     C           #2CBRT    ANDEQ*BLANKS                                                    AR1080662
     C                     MOVE *ON       *IN39                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5424' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C           #2CRSP    IFNE *BLANKS                                                       CLE134
     C                     CALL 'ZALIGN'                                                      CLE134
     C           W0RTN     PARM *BLANKS   WQ0001                                              CLE134
     C                     PARM #2CRSP    WQ0002                                              CLE134
     C                     PARM 7         WQ0003                                              CLE134
     C                     PARM 4         WQ0004                                              CLE134
     C                     PARM *BLANKS   WQ0005                                              CLE134
      *                                                                                       CLE134
     C           W0RTN     IFEQ *BLANKS                                                       CLE134
     C                     MOVE WQ0005    N#CRSP                                              CLE134
      *                                                                                       CLE134
     C                     CALL 'ZEDIT'                                                       CLE134
     C                     PARM           WQ0005                                              CLE134
     C                     PARM           WQ0003                                              CLE134
      *                                                                                       CLE134
     C                     MOVE WQ0005    #2CRSP                                              CLE134
      *                                                                                       CLE134
     C                     ELSE                                                               CLE134
     C                     MOVE *ON       *IN39                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5423' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
     C                     ENDIF                                                              CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
      ** Past Due Default Spread Indicator                                                    CLE134
      *                                                                                       CLE134
      ** If no Past Due Loan Type entered;                                                    CLE134
      ** - Input not allowed.                                                                 CLE134
      *                                                                                       CLE134
     C           C#LTST    IFEQ *BLANKS                                                       CLE134
     C           #2CRIN    IFNE *BLANKS                                                       CLE134
     C                     MOVE *ON       *IN40                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5491' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
      **Else*Past*Due*Loan*Type*entered;*******************************              CLE134 AR467422
      **-*If*Base*Rate*and*Spread/Rate*not*entered;********************              CLE134 AR467422
      ****-*Input*not*allowed.*****************************************              CLE134 AR467422
      **********                                                                     CLE134 AR467422
     C**********           ELSE                                                      CLE134 AR467422
     C********** #2CRIN    IFNE *BLANK                                               CLE134 AR467422
     C********** #2CBSR    ANDEQ*BLANKS                                              CLE134 AR467422
     C********** #2CRIN    ORNE *BLANK                                               CLE134 AR467422
     C********** #2CRSP    ANDEQ*BLANKS                                              CLE134 AR467422
     C**********           MOVE *ON       *IN40                                      CLE134 AR467422
     C**********           MOVE *ON       *IN97                                      CLE134 AR467422
     C**********           MOVEL'USR5420' ZAMSID                                     CLE134 AR467422
     C**********           EXSR ZASNMS                                               CLE134 AR467422
      *                                                                                       CLE134
      ** Else Past Due Loan Type entered;                                                   AR467422
      **-*If*both*Base*Rate*and*Spread/Rate*entered;*******************              CLE134 AR467422
      ** - Input mandatory.                                                                   CLE134
      *                                                                                       CLE134
     C                     ELSE                                                               CLE134
     C           #2CRIN    IFEQ *BLANK                                                        CLE134
     C********** #2PBSR    ANDNE*BLANKS                                              CLE134 AR467422
     C********** #2PRSP    ANDNE*BLANKS                                              CLE134 AR467422
     C                     MOVE *ON       *IN40                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5490' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
      *                                                                                       CLE134
      ** - Must be a valid value.                                                             CLE134
      *                                                                                       CLE134
     C                     ELSE                                                               CLE134
     C********** #2CRIN    IFNE *BLANK                                               CLE134 AR467422
     C           #2CRIN    IFNE 'S'                                                         AR467422
     C           #2CRIN    ANDNE'A'                                                           CLE134
     C********** #2CRIN    ANDNE'D'                                                  CLE134 AR467422
     C           #2CRIN    ANDNE'P'                                                         AR467422
     C                     MOVE *ON       *IN40                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5425' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
     C                     ENDIF                                                              CLE134
     C**********           ENDIF                                                     CLE134 AR467422
     C                     ENDIF                                                              CLE134
      *                                                                                    AR1022007
     C                     ENDIF                                                           AR1022007
      *                                                                                    AR1022007
      ** Validate additional SM007 fields/CRE073 if feature is on                          AR1022007
      *                                                                                    AR1022007
     C           CRE073    IFEQ 'Y'                                                        AR1022007
     C                     EXSR SMVAL                                                      AR1022007
     C                     ENDIF                                                           AR1022007
      *                                                                                       CLE134
      ** Past Due Default Base Rate Change Indicator                                          CLE134
      *                                                                                       CLE134
      ** If no Past Due Loan Type entered;                                                    CLE134
      ** - Input not allowed.                                                                 CLE134
      *                                                                                       CLE134
     C           C#LTST    IFEQ *BLANKS                                                       CLE134
     C           #2BSRI    IFNE *BLANKS                                                       CLE134
     C                     MOVE *ON       *IN41                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5485' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
      ** Else Past Due Loan Type entered;                                                     CLE134
      ** - Input mandatory.                                                                   CLE134
      *                                                                                       CLE134
     C                     ELSE                                                               CLE134
     C           #2BSRI    IFEQ *BLANK                                                        CLE134
     C                     MOVE 'D'       #2BSRI                                              CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C           #2BSRI    IFNE 'D'                                                           CLE134
     C           #2BSRI    ANDNE'R'                                                           CLE134
     C           #2BSRI    ANDNE'N'                                                           CLE134
     C                     MOVE *ON       *IN41                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5435' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
      ** Interest Calculation Basis                                                           CLE134
      *                                                                                       CLE134
      ** If no Past Due Loan Type entered;                                                    CLE134
      ** - Input not allowed.                                                                 CLE134
      *                                                                                       CLE134
     C           C#LTST    IFEQ *BLANKS                                                       CLE134
     C           #2ICBS    IFNE *BLANKS                                                       CLE134
     C                     MOVE *ON       *IN42                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5497' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
      ** Else Past Due Loan Type entered;                                                     CLE134
      ** - Input mandatory.                                                                   CLE134
      *                                                                                       CLE134
     C                     ELSE                                                               CLE134
     C           #2ICBS    IFEQ *BLANKS                                                       CLE134
     C                     MOVE *ON       *IN42                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5426' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
      *                                                                                       CLE134
      ** - Must be a valid value.                                                             CLE134
      *                                                                                       CLE134
     C                     ELSE                                                               CLE134
     C           #2ICBS    IFLT '1'                                                           CLE134
     C           #2ICBS    ORGT '6'                                                           CLE134
     C                     MOVE *ON       *IN42                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5426' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
     C                     ENDIF                                                              CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
      ** Overdraft Repayment Allowed                                                          CLE134
      *                                                                                       CLE134
     C           #2OVRA    IFEQ *BLANK                                                        CLE134
     C                     MOVE 'N'       #2OVRA                                              CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C           #2OVRA    IFNE 'Y'                                                           CLE134
     C           #2OVRA    ANDNE'N'                                                           CLE134
     C                     MOVE *ON       *IN43                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5416' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
      ** Facility Amount Utlisation                                                           CLE134
      *                                                                                       CLE134
     C           #2FAMU    IFEQ *BLANK                                                        CLE134
     C                     MOVE 'N'       #2FAMU                                              CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C           #2FAMU    IFNE 'Y'                                                           CLE134
     C           #2FAMU    ANDNE'N'                                                           CLE134
     C                     MOVE *ON       *IN44                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5416' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                CLE134 262672
      ** Early Maturity Condition                                                      CLE134 262672
      *                                                                                CLE134 262672
     C********** #2FEMC    IFEQ *BLANK                                                 CLE134 262672
     C**********           MOVE 'S'       #2FEMC                                       CLE134 262672
     C**********           ENDIF                                                       CLE134 262672
      *                                                                                CLE134 262672
     C********** #2FEMC    IFNE 'A'                                                    CLE134 262672
     C********** #2FEMC    ANDNE'T'                                                    CLE134 262672
     C********** #2FEMC    ANDNE'S'                                                    CLE134 262672
     C**********           MOVE *ON       *IN46                                        CLE134 262672
     C**********           MOVE *ON       *IN97                                        CLE134 262672
     C**********           MOVEL'USR5465' ZAMSID                                       CLE134 262672
     C**********           EXSR ZASNMS                                                 CLE134 262672
     C**********           ENDIF                                                       CLE134 262672
      *                                                                                       CLE134
      ** Suspend Fee Allowed                                                                  CLE134
      *                                                                                       CLE134
     C           #2FSFA    IFEQ *BLANK                                                        CLE134
     C                     MOVE 'N'       #2FSFA                                              CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C           #2FSFA    IFNE 'Y'                                                           CLE134
     C           #2FSFA    ANDNE'N'                                                           CLE134
     C                     MOVE *ON       *IN45                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5416' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
      ** Changing the value from Y to N is not allowed if fees with                           CLE134
      ** this fee code are present with a non-zero suspended amount.                          CLE134
      *                                                                                       CLE134
     C           W0PMD     IFEQ 'CHG'                                                         CLE134
     C           AUFSFA    ANDEQ'Y'                                                           CLE134
     C           #2FSFA    ANDEQ'N'                                                           CLE134
      *                                                                                       CLE134
     C                     MOVE AUFECD    W#FECD  20                                          CLE134
     C           W#FECD    SETLLLEFEEDLF                                                      CLE134
     C           W#FECD    READELEFEEDLF            N    92                                   CLE134
     C           *IN92     DOWEQ*OFF                                                          CLE134
      *                                                                                       CLE134
     C           FESFA     IFGT 0                                                             CLE134
     C                     LEAVE                                                              CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C           W#FECD    READELEFEEDLF            N    92                                   CLE134
     C                     ENDDO                                                              CLE134
      *                                                                                       CLE134
     C           *IN92     IFEQ *OFF                                                          CLE134
     C                     MOVE *ON       *IN45                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5436' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
      ** Suspended Fee Amount Maximum                                                         CLE134
      *                                                                                       CLE134
     C                     Z-ADD0         N#SFAM                                              CLE134
      *                                                                                       CLE134
     C                     SELEC                                                              CLE134
     C           #2FEMC    WHEQ 'A'                                                           CLE134
     C           #2SFAM    ANDEQ*BLANKS                                                       CLE134
     C                     MOVE *ON       *IN51                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5437' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
      *                                                                                       CLE134
     C           #2SFAM    WHEQ *BLANKS                                                       CLE134
      *                                                                                       CLE134
     C                     OTHER                                                              CLE134
     C                     CALL 'ZALIGN'                                                      CLE134
     C           W0RTN     PARM *BLANKS   WQ0001                                              CLE134
     C                     PARM #2SFAM    WQ0002                                              CLE134
     C                     PARM 0         WQ0003                                              CLE134
     C                     PARM 13        WQ0004                                              CLE134
     C                     PARM *BLANKS   WQ0005                                              CLE134
      *                                                                                       CLE134
     C           W0RTN     IFEQ *BLANKS                                                       CLE134
     C                     MOVE WQ0005    N#SFAM                                              CLE134
      *                                                                                       CLE134
     C                     CALL 'ZEDIT'                                                       CLE134
     C                     PARM           WQ0005                                              CLE134
     C                     PARM           WQ0003                                              CLE134
     C                     MOVE WQ0005    #2SFAM                                              CLE134
      *                                                                                       CLE134
     C                     ELSE                                                               CLE134
     C                     MOVE *ON       *IN51                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5423' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C                     ENDSL                                                              CLE134
      *                                                                                       CLE134
      ** Suspended Fee Payments Maximum                                                       CLE134
      *                                                                                       CLE134
     C                     Z-ADD0         N#SFPM                                              CLE134
     C                     SELEC                                                              CLE134
     C           #2FEMC    WHEQ 'S'                                                           CLE134
     C           #2SFPM    ANDEQ*BLANKS                                                       CLE134
     C           #2FEMC    OREQ 'T'                                                           CLE134
     C           #2SFPM    ANDEQ*BLANKS                                                       CLE134
     C                     MOVE *ON       *IN52                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5438' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
      *                                                                                       CLE134
     C           #2SFPM    WHEQ *BLANKS                                                       CLE134
      *                                                                                       CLE134
     C                     OTHER                                                              CLE134
     C                     CALL 'ZALIGN'                                                      CLE134
     C           W0RTN     PARM *BLANKS   WQ0001                                              CLE134
     C                     PARM #2SFPM    WQ0002                                              CLE134
     C                     PARM 0         WQ0003                                              CLE134
     C                     PARM 3         WQ0004                                              CLE134
     C                     PARM *BLANKS   WQ0005                                              CLE134
      *                                                                                       CLE134
     C           W0RTN     IFEQ *BLANKS                                                       CLE134
     C                     MOVE WQ0005    N#SFPM                                              CLE134
      *                                                                                       CLE134
     C                     CALL 'ZEDIT'                                                       CLE134
     C                     PARM           WQ0005                                              CLE134
     C                     PARM           WQ0003                                              CLE134
     C                     MOVE WQ0005    #2SFPM                                              CLE134
      *                                                                                       CLE134
     C                     ELSE                                                               CLE134
     C                     MOVE *ON       *IN52                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5423' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C                     ENDSL                                                              CLE134
      *                                                                                       CLE134
      ** Partial Payment Allowed                                                              CLE134
      *                                                                                       CLE134
     C           #2FPYA    IFEQ *BLANK                                                        CLE134
     C                     MOVE 'N'       #2FPYA                                              CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C           #2FPYA    IFNE 'Y'                                                           CLE134
     C           #2FPYA    ANDNE'N'                                                           CLE134
     C           #2FPYA    ANDNE'P'                                                           CLE134
     C                     MOVE *ON       *IN47                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5432' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
      ** Partial Indicator                                                                    CLE134
      *                                                                                       CLE134
     C           #2FPYA    IFEQ 'P'                                                           CLE134
     C           #2PSIN    ANDNE'A'                                                           CLE134
     C           #2PSIN    ANDNE'P'                                                           CLE134
     C                     MOVE *ON       *IN53                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5460' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C           #2FPYA    IFNE 'P'                                                           CLE134
     C           #2PSIN    ANDNE*BLANK                                                        CLE134
     C                     MOVE *ON       *IN53                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5461' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
      ** Partial Limit                                                                        CLE134
      *                                                                                       CLE134
     C                     Z-ADD0         N#PSLM                                              CLE134
     C                     SELEC                                                              CLE134
      *                                                                                       CLE134
     C           #2PSIN    WHEQ *BLANK                                                        CLE134
     C           #2PSLM    ANDNE*BLANK                                                        CLE134
     C                     MOVE *ON       *IN54                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5462' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
      *                                                                                       CLE134
     C           #2PSLM    WHEQ *BLANK                                                        CLE134
      *                                                                                       CLE134
     C                     OTHER                                                              CLE134
     C                     CALL 'ZALIGN'                                                      CLE134
     C           W0RTN     PARM *BLANKS   WQ0001                                              CLE134
     C                     PARM #2PSLM    WQ0002                                              CLE134
     C                     PARM 0         WQ0003                                              CLE134
     C                     PARM 13        WQ0004                                              CLE134
     C                     PARM *BLANKS   WQ0005                                              CLE134
      *                                                                                       CLE134
     C           W0RTN     IFEQ *BLANKS                                                       CLE134
     C                     MOVE WQ0005    N#PSLM                                              CLE134
     C                     CALL 'ZEDIT'                                                       CLE134
     C                     PARM           WQ0005                                              CLE134
     C                     PARM           WQ0003                                              CLE134
     C                     MOVE WQ0005    #2PSLM                                              CLE134
      *                                                                                       CLE134
     C                     ELSE                                                               CLE134
     C                     MOVE *ON       *IN54                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5423' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
     C                     ENDSL                                                              CLE134
      *                                                                                       CLE134
      ** Further checks if valid amount/%age entered:                                         CLE134
      *                                                                                       CLE134
     C           *IN54     IFEQ *OFF                                                          CLE134
      *                                                                                       CLE134
     C           #2PSIN    IFEQ 'A'                                                           CLE134
     C           N#PSLM    ANDLE0                                                             CLE134
     C                     MOVE *ON       *IN54                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5463' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C           #2PSIN    IFEQ 'P'                                                           CLE134
     C           N#PSLM    ANDLE0                                                             CLE134
     C           #2PSIN    OREQ 'P'                                                           CLE134
     C           N#PSLM    ANDGT100                                                           CLE134
     C                     MOVE *ON       *IN54                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5464' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       262672
      ** Early Maturity Condition                                                             262672
      *                                                                                       262672
     C           #2FSFA    IFNE 'Y'                                                           262672
     C                     MOVE *BLANKS   #2FEMC                                              262672
      *                                                                                       262672
     C                     ELSE                                                               262672
     C           #2FEMC    IFEQ *BLANK                                                        262672
     C                     MOVE 'S'       #2FEMC                                              262672
     C                     ENDIF                                                              262672
      *                                                                                       262672
     C           #2FEMC    IFNE 'A'                                                           262672
     C           #2FEMC    ANDNE'T'                                                           262672
     C           #2FEMC    ANDNE'S'                                                           262672
     C                     MOVE *ON       *IN46                                               262672
     C                     MOVE *ON       *IN97                                               262672
     C                     MOVEL'USR5465' ZAMSID                                              262672
     C                     EXSR ZASNMS                                                        262672
     C                     ENDIF                                                              262672
     C                     ENDIF                                                              262672
      *                                                                                       CLE134
      ** Grace Period                                                                         CLE134
      *                                                                                       CLE134
     C           #2GDPR    IFEQ *BLANK                                                        CLE134
     C                     MOVE BPGRPR    #2GDPR                                              CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C           DIGITS    CHECK#2GDPR    WPOS    30                                          CLE134
      *                                                                                       CLE134
     C           WPOS      IFGT 0                                                             CLE134
     C                     MOVE *ON       *IN48                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C                     MOVEL'USR5440' ZAMSID                                              CLE134
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
      ** Pre-checking Order                                                                   CLE134
      *                                                                                       CLE134
     C                     MOVEL*BLANKS   PGERR   1                                           CLE164
      *                                                                                       CLE164
     C                     MOVEL#2CLT1    NPDCL   1                                           CLE164
      *                                                                                       CLE164
     C           #2PGID    IFEQ *BLANKS                                                       CLE164
     C           NPDCL     ANDEQ'Z'                                                           CLE164
     C                     MOVE *ON       *IN49                                               CLE164
     C                     MOVE *ON       *IN97                                               CLE164
     C                     MOVE 'Y'       PGERR                                               CLE164
     C                     MOVEL'USR9899' ZAMSID                                              CLE164
     C                     EXSR ZASNMS                                                        CLE164
     C                     ENDIF                                                              CLE164
     C********** #2PCKO    IFNE *BLANKS                                                CLE134 CLE164
     C           #2PGID    IFNE *BLANKS                                                       CLE164
     C********** DIGITS    CHECK#2PCKO    WPOS                                         CLE134 CLE164
     C           #2PGID    IFEQ '?'                                                           CLE164
     C                     EXSR SLPGID                                                        CLE164
     C                     ENDIF                                                              CLE164
     C           ALPHAN    CHECK#2PGID    NUM     10     68                                   CLE164
      *                                                                                       CLE134
     C********** WPOS      IFGT 0                                                      CLE134 CLE164
     C           *IN68     IFEQ '1'                                                           CLE164
     C                     MOVE *ON       *IN49                                               CLE134
     C                     MOVE *ON       *IN97                                               CLE134
     C**********           MOVEL'USR5427' ZAMSID                                       CLE134 CLE164
     C                     MOVEL'USR5417' ZAMSID                                              CLE164
     C                     MOVEL'Y'       PGERR                                               CLE164
     C                     EXSR ZASNMS                                                        CLE134
     C                     ENDIF                                                              CLE134
     C           PGERR     IFEQ *BLANKS                                                       CLE164
     C           #2PGID    CHAINSDPRGPI0             68                                       CLE164
     C           *IN68     IFEQ '1'                                                           CLE164
     C                     MOVEL'USR9717' ZAMSID                                              CLE164
     C                     EXSR ZASNMS                                                        CLE164
     C                     SETON                     9749                                     CLE164
     C                     ENDIF                                                              CLE164
     C                     ENDIF                                                              CLE164
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C                     ENDIF                                                              CER050
      *                                                                                       CER050
     C           CER050    IFEQ 'Y'                                                           CER050
      *                                                                                       CER050
     C           #1IAPR    IFEQ *BLANKS                                                       CER050
     C                     MOVE 'N'       #1IAPR                                              CER050
     C                     ELSE                                                               CER050
     C           #1IAPR    IFNE 'Y'                                                           CER050
     C           #1IAPR    ANDNE'N'                                                           CER050
     C                     MOVE *ON       *IN65                                               CER050
     C                     MOVE *ON       *IN97                                               CER050
     C                     MOVEL'SDX0460' ZAMSID                                              CER050
     C                     EXSR ZASNMS                                                        CER050
     C                     ENDIF                                                              CER050
     C                     ENDIF                                                              CER050
      *                                                                                       CER050
     C           #1MINF    IFNE *BLANKS                                                       CER050
     C           #1IAPR    ANDNE'N'                                                           CER050
     C                     CALL 'ZALIGN'                                                      CER050
     C           W0RTN     PARM *BLANKS   WQ0001                                              CER050
     C                     PARM #1MINF    WQ0002                                              CER050
     C                     PARM A6NBDP    WQ0003                                              CER050
     C                     PARM @@NDEC    WQ0004                                              CER050
     C                     PARM *BLANKS   WQ0005                                              CER050
     C           W0RTN     IFEQ *BLANKS                                                       CER050
     C                     MOVE WQ0005    N#MINF                                              CER050
     C                     CALL 'ZEDIT'                                                       CER050
     C                     PARM WQ0005    WQ0002                                              CER050
     C                     PARM A6NBDP    WQ0003                                              CER050
     C                     MOVE WQ0002    #1MINF                                              CER050
     C                     ELSE                                                               CER050
     C                     MOVE *ON       *IN66                                               CER050
     C                     MOVE *ON       *IN97                                               CER050
     C                     MOVEL'SDX0461' ZAMSID                                              CER050
     C                     EXSR ZASNMS                                                        CER050
     C                     ENDIF                                                              CER050
     C                     ELSE                                                               CER050
     C           #1MINF    IFNE *BLANKS                                                     MD054016
     C                     MOVE *ON       *IN66                                             MD054016
     C                     MOVE *ON       *IN97                                             MD054016
     C                     MOVEL'ER00116' ZAMSID                                            MD054016
     C                     EXSR ZASNMS                                                      MD054016
     C                     ENDIF                                                            MD054016
     C**********           MOVE *BLANKS   #1MINF                                     CER050 MD054016
     C**********           Z-ADD0         N#MINF                                     CER050 MD054016
     C                     ENDIF                                                              CER050
      *                                                                                       CER050
     C                     ENDIF                                                              CER050
      *                                                                                       CER050
     C                     ENDSR                                                              CLE134
      /EJECT                                                                               AR1022007
     CSR         SMVAL     BEGSR                                                           AR1022007
      *================================================================                    AR1022007
      * SMVAL: Vadlidate Additional Details introduced by AR1022007                        AR1022007
      *================================================================                    AR1022007
      ** Validate Interest Past Due SM007/CRE073 fields                                    AR1022007
      *                                                                                    AR1022007
     C           CRE073    IFEQ 'Y'                                                        AR1022007
      *                                                                                    AR1022007
      ** If no Past Due Loan Type entered;                                                 AR1022007
      ** - Input not allowed: Contr. spread                                                AR1022007
      *                                                                                    AR1022007
     C           C#LTST    IFEQ *BLANKS                                                    AR1022007
      *                                                                                    AR1022007
     C           #UPCSP    IFNE *BLANKS                                                    AR1022007
     C                     MOVE *ON       *IN60                                            AR1022007
     C                     MOVE *ON       *IN97                                            AR1022007
     C                     MOVEL'USR5410' ZAMSID                                           AR1022007
     C                     EXSR ZASNMS                                                     AR1022007
     C                     ENDIF                                                           AR1022007
      *                                                                                    AR1022007
      ** - Input not allowed: Contr. spread ind.                                           AR1022007
      *                                                                                    AR1022007
     C           #UPCSG    IFNE *BLANKS                                                    AR1022007
     C                     MOVE *ON       *IN61                                            AR1022007
     C                     MOVE *ON       *IN97                                            AR1022007
     C                     MOVEL'USR5410' ZAMSID                                           AR1022007
     C                     EXSR ZASNMS                                                     AR1022007
     C                     ENDIF                                                           AR1022007
      *                                                                                    AR1022007
      ** - Input not allowed: Rounding method                                              AR1022007
      *                                                                                    AR1022007
     C           #UPRMT    IFNE *BLANKS                                                    AR1022007
     C                     MOVE *ON       *IN62                                            AR1022007
     C                     MOVE *ON       *IN97                                            AR1022007
     C                     MOVEL'USR5410' ZAMSID                                           AR1022007
     C                     EXSR ZASNMS                                                     AR1022007
     C                     ENDIF                                                           AR1022007
      *                                                                                    AR1022007
      ** - Input not allowed: Rounding fraction/decimal                                    AR1022007
      *                                                                                    AR1022007
     C           #UPRFD    IFNE *BLANKS                                                    AR1022007
     C                     MOVE *ON       *IN63                                            AR1022007
     C                     MOVE *ON       *IN97                                            AR1022007
     C                     MOVEL'USR5410' ZAMSID                                           AR1022007
     C                     EXSR ZASNMS                                                     AR1022007
     C                     ENDIF                                                           AR1022007
      *                                                                                    AR1022007
      ** ELSE Past Due Loan Type entered;                                                  AR1022007
      ** - Input mandatory.                                                                AR1022007
      *                                                                                    AR1022007
     C                     ELSE                                                            AR1022007
      *                                                                                    AR1022007
      ** Validate contr. spread/spread ind input                                           AR1022007
      *                                                                                    AR1022007
     C                     CALL 'ZAVCSPSG'                                                 AR1022007
     C                     PARM *BLANKS   PRTCD                                            AR1022007
     C                     PARM *BLANKS   WBSRT  12                                        AR1022007
     C                     PARM           #2CBSR                                           AR1022007
     C                     PARM           #2CBRT                                           AR1080662
     C**********           PARM *BLANKS   VALFRT 12                              AR1022007 AR1093473
     C                     PARM #UPCSP    PRMCSP 12                                        AR1022007
     C                     PARM           #UPCSG                                           AR1022007
     C                     PARM 0         TMCNSP 117                                       AR1022007
     C                     PARM 'LOAN'    PMOD    6                                        AR1022007
     C                     PARM 0         PCUR    20                                       AR1022007
     C                     PARM *BLANKS   AFLDNM                                           AR1022007
     C                     PARM *BLANKS   AMSGID                                           AR1022007
     C                     PARM *BLANKS   AMGDTA                                           AR1022007
     C                     PARM 0         AR1     30                                       AR1022007
     C                     PARM           WCSPOK  1                                        AR1022007
     C                     PARM           WCSGOK  1                                        AR1022007
      *                                                                                    AR1022007
      ** Set indicators of invalid spread rate/ind input                                   AR1022007
      *                                                                                    AR1022007
     C           WCSPOK    IFEQ 'N'                                                        AR1022007
     C                     MOVE *ON       *IN60                                            AR1022007
     C                     MOVE *ON       *IN97                                            AR1022007
     C                     ELSE                                                            AR1022007
      *                                                                                    AR1022007
      ** Prepare spread input as decimal                                                   AR1022007
      *                                                                                    AR1022007
     C           #UPCSP    IFNE *BLANKS                                                    AR1022007
     C                     CALL 'ZALIGN'                                                   AR1022007
     C           W0RTN     PARM *BLANKS   WQ0001  7                                        AR1022007
     C                     PARM #UPCSP    WQ0002 16                                        AR1022007
     C                     PARM 7         WQ0003  10                                       AR1022007
     C                     PARM 4         WQ0004  20                                       AR1022007
     C                     PARM *BLANKS   WQ0005 16                                        AR1022007
     C           W0RTN     IFEQ *BLANKS                                                    AR1022007
     C                     MOVE WQ0005    N#CSP  117                                       AR1022007
     C                     CALL 'ZEDIT'                                                    AR1022007
     C                     PARM           WQ0005 16                                        AR1022007
     C                     PARM 7         WQ0003  10                                       AR1022007
     C                     MOVE WQ0005    #UPCSP                                           AR1022007
     C                     ENDIF                                                           AR1022007
     C                     ENDIF                                                           AR1022007
      *                                                                                    AR1022007
     C                     ENDIF                                                           AR1022007
      *                                                                                    AR1022007
     C           WCSGOK    IFEQ 'N'                                                        AR1022007
     C                     MOVE *ON       *IN61                                            AR1022007
     C                     MOVE *ON       *IN97                                            AR1022007
     C                     ENDIF                                                           AR1022007
      *                                                                                    AR1022007
      ** Rounding method must be of valid value                                            AR1022007
      *                                                                                    AR1022007
     C                     CALL 'ZAVRNDMT'                                                 AR1022007
     C                     PARM *BLANKS   PRTCD                                            AR1022007
     C                     PARM           #UPRMT                                           AR1022007
     C                     PARM #UPCSP    PRMCSP 12                                        AR1022007
     C                     PARM           #UPRFD                                           AR1022007
     C                     PARM *BLANKS   PMOD    6                                        AR1022007
     C                     PARM 0         PCUR    20                                       AR1022007
     C                     PARM           AFLDNM                                           AR1022007
     C                     PARM           AMSGID                                           AR1022007
     C                     PARM           AMGDTA                                           AR1022007
     C                     PARM           AR1                                              AR1022007
     C                     PARM           WDRMOK  1                                        AR1022007
      *                                                                                    AR1022007
      ** Set indicators of invalid rounding method input                                   AR1022007
      *                                                                                    AR1022007
     C           WDRMOK    IFEQ 'N'                                                        AR1022007
     C                     MOVE *ON       *IN62                                            AR1022007
     C                     MOVE *ON       *IN97                                            AR1022007
     C                     ENDIF                                                           AR1022007
      *                                                                                    AR1022007
      ** Rounding fraction/decimal must be of valid value                                  AR1022007
      *                                                                                    AR1022007
     C                     CALL 'ZAVRNDFD'                                                 AR1022007
     C                     PARM *BLANKS   PRTCD                                            AR1022007
     C                     PARM           #UPRFD                                           AR1022007
     C                     PARM #UPCSP    PRMCSP 12                                        AR1022007
     C                     PARM           #UPRMT                                           AR1022007
     C                     PARM *BLANKS   PMOD    6                                        AR1022007
     C                     PARM 0         PCUR    20                                       AR1022007
     C                     PARM           AFLDNM                                           AR1022007
     C                     PARM           AMSGID                                           AR1022007
     C                     PARM           AMGDTA                                           AR1022007
     C                     PARM           AR1     30                                       AR1022007
     C                     PARM           WDRDOK  1                                        AR1022007
      *                                                                                    AR1022007
      ** Set indicators of invalid rounding fraction input                                 AR1022007
      *                                                                                    AR1022007
     C           WDRDOK    IFEQ 'N'                                                        AR1022007
     C                     MOVE *ON       *IN63                                            AR1022007
     C                     MOVE *ON       *IN97                                            AR1022007
     C                     ENDIF                                                           AR1022007
      *                                                                                    AR1022007
      ** Set error messages for invalid CRE073 fields                                      AR1022007
      *                                                                                    AR1022007
     C                     Z-ADD1         AR1                                              AR1022007
     C           AMSGID,AR1DOWNE*BLANKS                                                    AR1022007
     C                     MOVELAMSGID,AR1ZAMSID                                           AR1022007
     C                     ADD  1         AR1                                              AR1022007
      *                                                                                    AR1022007
      ** Set more appropriate error msg for particular SM007/CRE073 error                  AR1022007
      ** - Invalid spread indicator msg                                                    AR1022007
      *                                                                                    AR1022007
     C           ZAMSID    IFEQ 'USR9026'                                                  AR1022007
     C                     MOVEL'USR5425' ZAMSID                                           AR1022007
     C                     ENDIF                                                           AR1022007
      *                                                                                    AR1022007
     C                     EXSR ZASNMS                                                     AR1022007
     C                     ENDDO                                                           AR1022007
      *                                                                                    AR1022007
     C                     ENDIF                                                           AR1022007
      *                                                                                    AR1022007
     C                     ENDIF                                                           AR1022007
      *                                                                                    AR1022007
     C                     ENDSR                                                           AR1022007
      /EJECT
     CSR         FACHMD    BEGSR
      *================================================================
      * Switch between *ADD/*CHANGE modes
      *================================================================
     C           W0PMD     IFNE 'ADD'
     C                     MOVEL'ADD'     W0PMD
     C                     ELSE
     C                     MOVEL'CHG'     W0PMD
     C                     END
     C                     EXSR FBRQRL
      *================================================================
     CSR         FAEXIT    ENDSR
      /EJECT
     CSR         FBRQRL    BEGSR
      *================================================================
      * Request subfile reload
      *================================================================
     C                     MOVEL'Y'       W0RSF
      *================================================================
     CSR         FBEXIT    ENDSR
      /EJECT
     CSR         GADSA1    BEGSR
      *================================================================
      * Set display attributes for Subfile record
      *================================================================
     C           W0PMD     COMP 'ADD'                    89*
      * Protect keys if change mode or updated record
     C                     SETON                     88    *
     C   89N87             SETOF                     88    *
     C                     MOVEL*IN87     *IN79
     C           WUDELA    IFEQ 'N'                        *IF
     C                     MOVEL'1'       *IN79
     C                     END                             *FI
      *                                                                                       CLE134
     C           CLE134    IFEQ 'Y'                                                           CLE134
     C           W0PMD     ANDNE'ADD'                                                         CLE134
     C           CER050    OREQ 'Y'                                                           CER050
     C           W0PMD     ANDNE'ADD'                                                         CER050
     C                     MOVE *OFF      *IN79                                               CLE134
     C                     ENDIF                                                              CLE134
      *================================================================
     CSR         GAEXIT    ENDSR
      /EJECT
     CSR         GBDSA2    BEGSR
      *================================================================
      * Set display attributes for Subfile control
      *================================================================
     C           W0PMD     COMP 'ADD'                    89*
      *================================================================
     CSR         GBEXIT    ENDSR
      /EJECT
     CSR         MAIZ#1    BEGSR
      *================================================================
      * Initialise subfile record
      *================================================================
      * Previous values
     C                     MOVEL*BLANK    #1DBRC
     C                     Z-ADD*ZERO     #1LCD            Last Change Dat
     C                     MOVEL*BLANK    #1TYLC           Type of Last Ch
     C                     MOVEL*BLANK    #1SEL            *SFLSEL
     C                     MOVEL*BLANK    #1FECD           Fee Code
     C                     MOVEL*BLANK    #1FENV           Fee Narrative
     C                     MOVEL*BLANK    #1ADJY                                              CAS001
     C/COPY WNCPYSRC,SD0320MC11
      *================================================================
     CSR         MAEXIT    ENDSR
      /EJECT
     CSR         MBFL#1    BEGSR
      *================================================================
      * Move @AURECR fields to subfile
      *================================================================
     C                     Z-ADDAULCD     #1LCD            Last Change Dat
     C                     MOVELAUTYLC    #1TYLC           Type of Last Ch
     C                     MOVELAUFECD    #1FECD           Fee Code
     C                     MOVELAUFENV    #1FENV           Fee Narrative
     C                     MOVELAUADJY    #1ADJY                                              CAS001
     C/COPY WNCPYSRC,SD0320MC12
      * Hold current record image for change detection
     C                     MOVEL@1DBRC    #1DBRC
      *================================================================
     CSR         MBEXIT    ENDSR
      /EJECT
     CSR         MEIZ#2    BEGSR
      *================================================================
      * Initialise subfile control
      *================================================================
     C                     MOVEL*BLANK    #2FECD           Fee Code
      *================================================================
     CSR         MEEXIT    ENDSR
      /EJECT
     CSR         SACRRC    BEGSR
      *================================================================
      * Create Fee Codes - Fee Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
     C                     CLEAR@AURECQ                                                       CLE134
      * Move all fields to @AURECQ
     C                     MOVEL#1FECD    AUFECD           Fee Code
     C                     Z-ADDWURDNB    AULCD            Last Change Dat
     C                     MOVEL'I'       AUTYLC           Type of Last Ch
     C                     MOVEL#1FENV    AUFENV           Fee Narrative
     C                     MOVEL#1ADJY    AUADJY                                              CAS001
     C                     MOVE 'N'       AUIAPR                                              CER050
     C                     Z-ADD0         AUMINF                                              CER050
      *
     C           KLCRSA    KLIST
     C                     KFLD           AUFECD           Fee Code
      * Check for duplicate primary key
     C           KLCRSA    SETLL@AURECQ                  90*
     C           *IN90     IFEQ '1'
     C                     MOVEL'USR0048' W0RTN   7
      * Send message 'Fee Codes              EX'
     C                     MOVEL'USR0048' ZAMSID
     C                     EXSR ZASNMS
     C                     GOTO SAEXIT
     C/COPY WNCPYSRC,SD0320MC13
     C                     END
      *
     C                     WRITE@AURECQ                91  *
      *
     C           *IN91     IFEQ '1'
      * Write error detected
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     ELSE
     C/COPY WNCPYSRC,SDH00136
      * USER: Processing after Data update
     C                     Z-ADD1         WUNORC           No. of Records
     C                     Z-ADD*ZERO     WUNOAM           No. of Amends
     C                     Z-ADD*ZERO     WUNODL           No. of Deletes
     C                     Z-ADD1         WUNOIN           No. of Inserts
      * Start of SAR S01117
      * Change code to filename FEE - SDFEEPD
      * Change Standing Data Cont - Standing Data Controls  *
     C                     EXSR SBCHRC
      * End of SAR S01117
      * Update TABLEUQ - Fee Codes  *
     C                     CALL 'TABLEUQ'              90  Update TABLEUQ
     C           W0RTN     PARM *BLANK    WQ0006  7        *Return code
     C                     PARM AUFECD    WQ0007  2        Fee Code
     C                     PARM AUFENV    WQ0008 20        Fee Narrative
     C                     PARM AUTYLC    WQ0009  1        Type of Last Ch
     C                     PARM WURDNB    WQ0010  50       Run day number
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'TABLEUQ' W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C                     SETON                     98    *
     C                     END
      * CASE: PGM.*Return code is Old Table Error
     C           W0RTN     IFEQ '*ERROR*'                  *IF
      * Send message 'Unable to update'
     C                     MOVEL'USR0015' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     98    *
      *
     C                     END                             *FI
     C                     END
      *================================================================
     CSR         SAEXIT    ENDSR
      /EJECT
     CSR         SBCHRC    BEGSR
      *================================================================
      * Change Standing Data Cont - Standing Data Controls  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Set PGM.*Record Data Changed flag
     C                     MOVE 'N'       YARDC   1
      *
      * Move key fields to @AHREAU
     C                     MOVE *BLANK    AHFLNM           Filename
     C                     MOVEL'SDFEEPD' AHFLNM           Filename
      *
     C           KLCHSB    KLIST
     C                     KFLD           AHFLNM           Filename
     C           KLCHSB    CHAIN@AHREAU              9091  *
      *
     C           *IN90     IFEQ '1'
      * Record not found
     C                     MOVEL'Y2U0009' W0RTN   7
      * Send message '*Record no longer on file'
     C                     MOVEL'Y2U0009' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     GOTO SBEXIT
     C                     END
      *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     GOTO SBEXIT
     C                     END
      *
      * Store record data for null update check
     C                     MOVE QSDFC1    YARDCS
      * USER: Processing after Data read
     C                     ADD  AHNORC    WUNORC           No. of Records
     C                     ADD  AHNOIN    WUNOIN           No. of Inserts
     C                     ADD  AHNOAM    WUNOAM           No. of Amends
     C                     ADD  AHNODL    WUNODL           No. of Deletes
      * Move non-key fields to @AHREAU
     C                     Z-ADDWUNORC    AHNORC           No. of Records
     C                     Z-ADDWUNOIN    AHNOIN           No. of Inserts
     C                     Z-ADDWUNOAM    AHNOAM           No. of Amends
     C                     Z-ADDWUNODL    AHNODL           No. of Deletes
      *
      * Set PGM.*Record Data Changed flag
     C           QSDFC1    IFNE YARDCS
     C                     MOVE 'Y'       YARDC
     C                     END
      * If changed update record otherwise release record
     C           YARDC     IFEQ 'Y'
     C                     UPDAT@AHREAU                91  *
     C                     ELSE
      * Release record lock
     C                     UNLCKSDFCTLL0               91  *
     C                     END
     C           *IN91     IFEQ '1'
      * Change error detected
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     ELSE
      *
      * DBF change successful
     C                     END
      *================================================================
     CSR         SBEXIT    ENDSR
      /EJECT
     CSR         SCDLRC    BEGSR
      *================================================================
      * Delete Fee Codes - Fee Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Move key fields to @AURECQ
     C                     MOVEL#1FECD    AUFECD           Fee Code
      *
     C           KLDLSC    KLIST
     C                     KFLD           AUFECD           Fee Code
     C           KLDLSC    CHAIN@AURECQ              9091  *
     C           *IN90     IFEQ '1'
      * Record already deleted
     C                     MOVEL'Y2U0009' W0RTN   7
      * Send message '*Record no longer on file'
     C                     MOVEL'Y2U0009' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     GOTO SCEXIT
     C                     END
      *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     MOVEL'Y2U0004' W0RTN   7
      * Send message '*Database operation error'
     C                     MOVEL'Y2U0004' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     GOTO SCEXIT
     C                     END
      *
      * Check for changed record
     C           #1DBRC    IFNE @1DBRC                     IF
     C                     MOVEL'Y2U0007' W0RTN   7
      * Send message '*Update not accepted'
     C                     MOVEL'Y2U0007' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
      * Release record lock
     C           KLDLSC    SETLL@AURECQ              9091  *
     C                     GOTO SCEXIT
     C                     END                             FI #1DBRC
      *................................................................
     C/COPY WNCPYSRC,SD0320MC14
     C                     DELET@AURECQ                91  *
     C           *IN91     IFEQ '1'
      * Delete error detected
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     ELSE
     C/COPY WNCPYSRC,SDH00137
      * DBF delete successful
      * USER: Processing after Data update
      * WUDELR Data Structure - SD Deleted Records File  *
     C                     MOVEL@1DBRC    WUDELR
      * Write Deleted Record - SD Deleted Records File  *
     C                     CLEARPARC
     C                     MOVEL'SDFEEPD' PAFNME           File name
     C                     MOVEL#1FECD    PALKEY           Long Key
     C                     MOVELWUDR01    PADR01           Deleted Data Re
     C                     MOVELWUDR02    PADR02           Deleted Data Re
     C                     MOVELWUDR03    PADR03           Deleted Data Re
     C                     MOVELWUDR04    PADR04           Deleted Data Re
     C                     MOVELWUDR05    PADR05           Deleted Data Re
     C                     MOVELWUDR06    PADR06           Deleted Data Re
     C                     MOVELWUDR07    PADR07           Deleted Data Re
     C                     MOVELWUDR08    PADR08           Deleted Data Re
     C                     MOVELWUDR09    PADR09           Deleted Data Re
     C                     MOVELWUDR00    PADR00           Deleted Data Re
     C                     MOVELWUDR11    PADR11           Deleted Data Re
     C                     MOVELWUDR12    PADR12           Deleted Data Re
     C                     Z-ADDWURDNB    PALCD            Last Change Dat
     C                     MOVEL'D'       PATYLC           Type of Last Ch
      *
     C                     CALL 'SD0520X'              90  Write Deleted R
     C                     PARM *BLANK    W0RTN   7
     C                     PARM           PARC             RCD: SD Deleted
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SD0520X' W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C                     SETON                     9833  *
     C                     END
     C                     Z-ADD-1        WUNORC           No. of Records
     C                     Z-ADD1         WUNODL           No. of Deletes
     C                     Z-ADD*ZERO     WUNOIN           No. of Inserts
     C                     Z-ADD*ZERO     WUNOAM           No. of Amends
      * Start of SAR S01117
      * Change code to filename FEE - SDFEEPD
      * Change Standing Data Cont - Standing Data Controls  *
     C                     EXSR SDCHRC
      * End of SAR S01117
     C                     MOVEL'D'       WUTYLC           Type of Last Ch
      * Update TABLEUQ - Fee Codes  *
     C                     CALL 'TABLEUQ'              90  Update TABLEUQ
     C           W0RTN     PARM *BLANK    WQ0011  7        *Return code
     C                     PARM AUFECD    WQ0012  2        Fee Code
     C                     PARM AUFENV    WQ0013 20        Fee Narrative
     C                     PARM WUTYLC    WQ0014  1        Type of Last Ch
     C                     PARM WURDNB    WQ0015  50       Run day number
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'TABLEUQ' W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C                     SETON                     98    *
     C                     END
      * CASE: PGM.*Return code is Old Table Error
     C           W0RTN     IFEQ '*ERROR*'                  *IF
      * Send message 'Unable to update'
     C                     MOVEL'USR0015' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     98    *
      *
     C                     END                             *FI
     C                     END
      *================================================================
     CSR         SCEXIT    ENDSR
      /EJECT
     CSR         SDCHRC    BEGSR
      *================================================================
      * Change Standing Data Cont - Standing Data Controls  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Set PGM.*Record Data Changed flag
     C                     MOVE 'N'       YBRDC   1
      *
      * Move key fields to @AHREAU
     C                     MOVE *BLANK    AHFLNM           Filename
     C                     MOVEL'SDFEEPD' AHFLNM           Filename
      *
     C           KLCHSD    KLIST
     C                     KFLD           AHFLNM           Filename
     C           KLCHSD    CHAIN@AHREAU              9091  *
      *
     C           *IN90     IFEQ '1'
      * Record not found
     C                     MOVEL'Y2U0009' W0RTN   7
      * Send message '*Record no longer on file'
     C                     MOVEL'Y2U0009' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     GOTO SDEXIT
     C                     END
      *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     GOTO SDEXIT
     C                     END
      *
      * Store record data for null update check
     C                     MOVE QSDFC1    YBRDCS
      * USER: Processing after Data read
     C                     ADD  AHNORC    WUNORC           No. of Records
     C                     ADD  AHNOIN    WUNOIN           No. of Inserts
     C                     ADD  AHNOAM    WUNOAM           No. of Amends
     C                     ADD  AHNODL    WUNODL           No. of Deletes
      * Move non-key fields to @AHREAU
     C                     Z-ADDWUNORC    AHNORC           No. of Records
     C                     Z-ADDWUNOIN    AHNOIN           No. of Inserts
     C                     Z-ADDWUNOAM    AHNOAM           No. of Amends
     C                     Z-ADDWUNODL    AHNODL           No. of Deletes
      *
      * Set PGM.*Record Data Changed flag
     C           QSDFC1    IFNE YBRDCS
     C                     MOVE 'Y'       YBRDC
     C                     END
      * If changed update record otherwise release record
     C           YBRDC     IFEQ 'Y'
     C                     UPDAT@AHREAU                91  *
     C                     ELSE
      * Release record lock
     C                     UNLCKSDFCTLL0               91  *
     C                     END
     C           *IN91     IFEQ '1'
      * Change error detected
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     ELSE
      *
      * DBF change successful
     C                     END
      *================================================================
     CSR         SDEXIT    ENDSR
      /EJECT
     CSR         SECHRC    BEGSR
      *================================================================
      * Change Fee Codes - Fee Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Set PGM.*Record Data Changed flag
     C                     MOVE 'N'       YCRDC   1
      *
      * Move key fields to @AURECQ
     C                     MOVEL#1FECD    AUFECD           Fee Code
      *
     C           KLCHSE    KLIST
     C                     KFLD           AUFECD           Fee Code
     C           KLCHSE    CHAIN@AURECQ              9091  *
      *
     C           *IN90     IFEQ '1'
      * Record not found
     C                     MOVEL'Y2U0009' W0RTN   7
      * Send message '*Record no longer on file'
     C                     MOVEL'Y2U0009' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     GOTO SEEXIT
     C                     END
      *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     GOTO SEEXIT
     C                     END
      *
      * Check for changed record
     C           #1DBRC    IFNE @1DBRC                     IF
     C                     MOVEL'Y2U0007' W0RTN   7
      * Send message '*Update not accepted'
     C                     MOVEL'Y2U0007' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
      * Release record lock
     C                     UNLCKSDFEEL0                91  *
     C                     GOTO SEEXIT
     C                     END                             FI #1DBRC
      * Store record data for null update check
     C                     MOVE @1DBRC    YCRDCS
      * Move non-key fields to @AURECQ
     C                     Z-ADDWURDNB    AULCD            Last Change Dat
     C                     MOVEL'A'       AUTYLC           Type of Last Ch
     C                     MOVEL#1FENV    AUFENV           Fee Narrative
     C                     MOVEL#1ADJY    AUADJY                                              CAS001
      *                                                                                       CLE134
     C           CLE134    IFEQ 'Y'                                                           CLE134
     C           #1F12     ANDEQ*OFF                                                          CLE134
     C                     MOVE #2CLTY    AUCLTY                                              CLE134
     C                     MOVE #2CLST    AUCLST                                              CLE134
     C                     MOVE #2CLCL    AUCLCL                                              CLE134
     C                     MOVE #2CBSR    AUCBSR                                              CLE134
     C           CLE036    IFEQ 'Y'                                                        AR1080662
     C                     MOVE N#CBRT    AUCBRT                                           AR1080662
     C                     ENDIF                                                           AR1080662
     C                     Z-ADDN#CRSP    AUCRSP                                              CLE134
     C                     MOVE #2CRIN    AUCRIN                                              CLE134
     C                     MOVE #2BSRI    AUBSRI                                              CLE134
     C           #2ICBS    IFNE *BLANKS                                                       CLE134
     C                     MOVE #2ICBS    AUICBS                                              CLE134
     C                     ELSE                                                               CLE134
     C                     MOVE *ZEROS    AUICBS                                              CLE134
     C                     END                                                                CLE134
     C                     MOVE #2OVRA    AUOVRA                                              CLE134
     C                     MOVE #2FAMU    AUFAMU                                              CLE134
      *                                                                                       CLE134
      ** Save old value 'Suspend Fee Allowed'                                                 CLE134
      *                                                                                       CLE134
     C                     MOVE AUFSFA    O#FSFA  1                                           CLE134
     C                     MOVE #2FSFA    AUFSFA                                              CLE134
     C                     Z-ADDN#SFAM    AUSFAM                                              CLE134
     C                     Z-ADDN#SFPM    AUSFPM                                              CLE134
     C                     MOVE #2FPYA    AUFPYA                                              CLE134
     C                     MOVE #2PSIN    AUPSIN                                              CLE134
     C                     Z-ADDN#PSLM    AUPSLM                                              CLE134
     C                     MOVE #2FEMC    AUFEMC                                              CLE134
     C                     MOVE #2GDPR    AUGDPR                                              CLE134
     C**********           MOVE #2PCKO    AUPCKO                                       CLE134 CLE164
     C                     MOVE #2PGID    AUPGID                                              CLE164
     C           AUPGID    CHAINSDPRGPI0             86                                       CLE164
     C           *IN86     IFEQ '0'                                                           CLE164
     C                     MOVE PGDESC    #2PDES                                              CLE164
     C                     ELSE                                                               CLE164
     C                     MOVE *BLANKS   #2PDES                                              CLE164
     C                     ENDIF                                                              CLE164
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
      ** Initialize and set if SM007/CRE073 is active.                                     AR1022007
      *                                                                                    AR1022007
     C           CRE073    IFEQ 'Y'                                                        AR1022007
     C           #1F12     ANDEQ*OFF                                                       AR1022007
     C                     Z-ADD0         AUPCSP                                           AR1022007
     C                     MOVE *BLANKS   AUPCSG                                           AR1022007
     C                     MOVE *BLANKS   AUPFMT                                           AR1022007
     C                     MOVE *BLANKS   AUPRFD                                           AR1022007
      *                                                                                    AR1022007
     C           UPLST     IFNE *BLANK                                                     AR1022007
     C                     Z-ADDN#CSP     AUPCSP                                           AR1022007
     C                     MOVE #UPCSG    AUPCSG                                           AR1022007
     C                     MOVE #UPRMT    AUPFMT                                           AR1022007
     C                     MOVE #UPRFD    AUPRFD                                           AR1022007
     C                     ENDIF                                                           AR1022007
      *                                                                                    AR1022007
     C                     ENDIF                                                           AR1022007
      *                                                                                    AR1022007
     C           CER050    IFEQ 'Y'                                                           CER050
     C           #1F12     ANDEQ*OFF                                                          CER050
     C                     MOVE #1IAPR    AUIAPR                                              CER050
     C                     MOVE N#MINF    AUMINF                                              CER050
     C                     ENDIF                                                              CER050
     C/COPY WNCPYSRC,SD0320MC15
      *
      * Set PGM.*Record Data Changed flag
     C           @1DBRC    IFNE YCRDCS
     C                     MOVE 'Y'       YCRDC
     C                     END
      * If changed update record otherwise release record
     C           YCRDC     IFEQ 'Y'
     C                     UPDAT@AURECQ                91  *
      *                                                                                       CLE134
      ** Update live fees                                                                     CLE134
      *                                                                                       CLE134
     C           CLE134    IFEQ 'Y'                                                           CLE134
     C           #1F12     ANDEQ*OFF                                                          CLE134
     C                     EXSR UPDFEE                                                        CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C                     ELSE
      * Release record lock
     C                     UNLCKSDFEEL0                91  *
     C                     END
     C           *IN91     IFEQ '1'
      * Change error detected
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     ELSE
     C/COPY WNCPYSRC,SDH00138
      *
      * Update saved record image
     C                     MOVEL@1DBRC    #1DBRC
      * DBF change successful
      * USER: Processing after Data update
     C                     Z-ADD*ZERO     WUNORC           No. of Records
     C                     Z-ADD*ZERO     WUNOIN           No. of Inserts
     C                     Z-ADD*ZERO     WUNODL           No. of Deletes
     C                     Z-ADD1         WUNOAM           No. of Amends
      * Start of SAR S01117
      * Change code to filename FEE - SDFEEPD
      * Change Standing Data Cont - Standing Data Controls  *
     C                     EXSR SFCHRC
      * End of SAR S01117
      * Update TABLEUQ - Fee Codes  *
     C                     CALL 'TABLEUQ'              90  Update TABLEUQ
     C           W0RTN     PARM *BLANK    WQ0016  7        *Return code
     C                     PARM AUFECD    WQ0017  2        Fee Code
     C                     PARM AUFENV    WQ0018 20        Fee Narrative
     C                     PARM AUTYLC    WQ0019  1        Type of Last Ch
     C                     PARM WURDNB    WQ0020  50       Run day number
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'TABLEUQ' W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C                     SETON                     98    *
     C                     END
      * CASE: PGM.*Return code is Old Table Error
     C           W0RTN     IFEQ '*ERROR*'                  *IF
      * Send message 'Unable to update'
     C                     MOVEL'USR0015' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     98    *
      *
     C                     END                             *FI
     C                     END
      *================================================================
     CSR         SEEXIT    ENDSR
      /EJECT
     CSR         SFCHRC    BEGSR
      *================================================================
      * Change Standing Data Cont - Standing Data Controls  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Set PGM.*Record Data Changed flag
     C                     MOVE 'N'       YDRDC   1
      *
      * Move key fields to @AHREAU
     C                     MOVE *BLANK    AHFLNM           Filename
     C                     MOVEL'SDFEEPD' AHFLNM           Filename
      *
     C           KLCHSF    KLIST
     C                     KFLD           AHFLNM           Filename
     C           KLCHSF    CHAIN@AHREAU              9091  *
      *
     C           *IN90     IFEQ '1'
      * Record not found
     C                     MOVEL'Y2U0009' W0RTN   7
      * Send message '*Record no longer on file'
     C                     MOVEL'Y2U0009' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     GOTO SFEXIT
     C                     END
      *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     GOTO SFEXIT
     C                     END
      *
      * Store record data for null update check
     C                     MOVE QSDFC1    YDRDCS
      * USER: Processing after Data read
     C                     ADD  AHNORC    WUNORC           No. of Records
     C                     ADD  AHNOIN    WUNOIN           No. of Inserts
     C                     ADD  AHNOAM    WUNOAM           No. of Amends
     C                     ADD  AHNODL    WUNODL           No. of Deletes
      * Move non-key fields to @AHREAU
     C                     Z-ADDWUNORC    AHNORC           No. of Records
     C                     Z-ADDWUNOIN    AHNOIN           No. of Inserts
     C                     Z-ADDWUNOAM    AHNOAM           No. of Amends
     C                     Z-ADDWUNODL    AHNODL           No. of Deletes
      *
      * Set PGM.*Record Data Changed flag
     C           QSDFC1    IFNE YDRDCS
     C                     MOVE 'Y'       YDRDC
     C                     END
      * If changed update record otherwise release record
     C           YDRDC     IFEQ 'Y'
     C                     UPDAT@AHREAU                91  *
     C                     ELSE
      * Release record lock
     C                     UNLCKSDFCTLL0               91  *
     C                     END
     C           *IN91     IFEQ '1'
      * Change error detected
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     ELSE
      *
      * DBF change successful
     C                     END
      *================================================================
     CSR         SFEXIT    ENDSR
      /EJECT                                                                                  CLE134
     C           UPDFEE    BEGSR                                                              CLE134
      *================================================================                       CLE134
      * UPDFEE: Update Fee                                                                    CLE134
      *================================================================                       CLE134
      *                                                                                       CLE134
      ** If the value of Suspend Fee Allowed has changed,                                     CLE134
      ** then update the live fees accordingly.                                               CLE134
      *                                                                                       CLE134
     C           AUFSFA    IFNE O#FSFA                                                        CLE134
     C                     MOVE AUFECD    W#FECD  20                                          CLE134
     C           W#FECD    SETLLLEFEEDLF                                                      CLE134
     C           W#FECD    READELEFEEDLF                 92                                   CLE134
      *                                                                                       CLE134
     C           *IN92     DOWEQ*OFF                                                          CLE134
     C           FEFSFA    IFNE AUFSFA                                                        CLE134
     C                     MOVE AUFSFA    FEFSFA                                              CLE134
     C                     UPDATLEFEED                                                        CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C           W#FECD    READELEFEEDLF                 92                                   CLE134
     C                     ENDDO                                                              CLE134
      *                                                                                       CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
     C                     ENDSR                                                              CLE134
      *****************************************************************                     AR826996
      *                                                                                     AR826996
      *  SRVBRC - Validate Base Rate + Currency                                             AR826996
      *                                                                                     AR826996
      *****************************************************************                     AR826996
     C           SRVBRC    BEGSR                                                            AR826996
      *                                                                                     AR826996
     C           KCYBR     KLIST                                                            AR826996
     C                     KFLD           #2CBSR                                            AR826996
     C                     KFLD           FEFCCY                                            AR826996
      *                                                                                     AR826996
     C                     MOVE *OFF      *IN62                                             AR826996
     C                     MOVE *OFF      *IN63                                             AR826996
     C                     MOVE *OFF      *IN64                                             AR826996
     C                     MOVE *BLANKS   @CCY    3                                         AR826996
     C                     MOVE #1FECD    WFECD                                             AR826996
      *                                                                                     AR826996
     C           WFECD     SETLLLEFEEDLW                                                    AR826996
     C           WFECD     READELEFEEDLW                 62                                 AR826996
     C           *IN62     DOWEQ*OFF                                                        AR826996
     C                     MOVE *ON       *IN63                                             AR826996
     C           FEFCCY    IFNE @CCY                                                        AR826996
      *                                                                                     AR826996
      ** Search Base Rate Code + Currency in SDBSRTPD                                       AR826996
      *                                                                                     AR826996
     C           KCYBR     CHAINSDBSRTL2             64                                     AR826996
      *                                                                                     AR826996
     C           *IN64     IFEQ *ON                                                         AR826996
     C                     LEAVE                                                            AR826996
     C                     ENDIF                                                            AR826996
      *                                                                                     AR826996
     C                     MOVELFEFCCY    @CCY                                              AR826996
      *                                                                                     AR826996
     C                     ENDIF                                                            AR826996
     C           WFECD     READELEFEEDLW                 62                                 AR826996
     C                     ENDDO                                                            AR826996
      *                                                                                     AR826996
      ** If Fee Code is not found in LEFEED, just make sure that                            AR826996
      ** Base Rate is exists in SDBSRTPD                                                    AR826996
      *                                                                                     AR826996
     C           *IN63     IFEQ *OFF                                                        AR826996
     C           #2CBSR    CHAINSDBSRTL2             64                                     AR826996
      *                                                                                     AR826996
      ** If Base Rate still not found, prompt error message without CCY                     AR826996
      *                                                                                     AR826996
     C           *IN64     IFEQ *ON                                                         AR826996
     C                     MOVE *BLANK    FEFCCY                                            AR826996
     C                     ENDIF                                                            AR826996
     C                     ENDIF                                                            AR826996
      *                                                                                     AR826996
     C                     ENDSR                                                            AR826996
      *****************************************************************                     AR826996
      /EJECT
     CSR         UASUBR    BEGSR
      *================================================================
      * Chek for blanks in the key field
      *================================================================
     C                     MOVEL#1FECD    WUDSTT           data structure
      * CASE: WRK.Position One is Blank
     C           WUPOS1    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1FECD    ZA0005           Fee Code
      * Send message 'No blanks in fee code'
     C                     MOVEL'USR1414' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9833  *
      *
     C                     ELSE
      * CASE: WRK.Position Two is Blank
     C           WUPOS2    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1FECD    ZA0006           Fee Code
      * Send message 'No blanks in fee code'
     C                     MOVEL'USR1414' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9833  *
      *
     C                     END                             *FI
     C                     END                             *FI
      *================================================================
     CSR         UAEXIT    ENDSR
      /EJECT
     CSR         Y0SET     BEGSR
      *================================================================
      * Set cursor by *SET CURSOR data
      *================================================================
      *================================================================
     CSR         Y0EXIT    ENDSR
      /EJECT
     CSR         Y8TST     BEGSR
      *================================================================
      * Test cursor
      *================================================================
     C                     Z-ADD@#RWCL    ZINPOS  50
     C           ZINPOS    DIV  256       W0CRW
     C                     MVR            W0CCL
      *================================================================
     CSR         Y8EXIT    ENDSR
      /EJECT
     CSR         Y9CLR     BEGSR
      *================================================================
      * Clear *SET CURSOR data
      *================================================================
      *================================================================
     CSR         Y9EXIT    ENDSR
      /EJECT
     CSR         ZASNMS    BEGSR
      *================================================================
      * Send message to program's message queue
      *================================================================
     C           ZAPGMQ    IFEQ *BLANK
     C                     MOVEL##PGM     ZAPGMQ
     C                     END
      * If no message file specified, use default
     C           ZAMSGF    IFEQ *BLANK
     C                     MOVELZADFMF    ZAMSGF
     C                     END
     C                     CALL 'Y2SNMGC'
     C                     PARM           ZAPGMQ 10        Program queue
     C                     PARM           ZAPGRL  5        Rel queue
     C                     PARM           ZAMSID  7        Message ID
     C                     PARM           ZAMSGF 10        Message file
     C                     PARM           ZAMSDA132        Message data
     C                     PARM           ZAMSTP  7        Message type
      * Clear all fields for default mechanism next time
     C                     MOVEL*BLANK    ZAPGMQ
     C                     MOVEL*BLANK    ZAPGRL
     C                     MOVEL*BLANK    ZAMSID
     C                     MOVEL*BLANK    ZAMSGF
     C                     MOVEL*BLANK    ZAMSDA
     C                     MOVEL*BLANK    ZAMSTP
      *================================================================
     CSR         ZAEXIT    ENDSR
      /EJECT
     CSR         ZHHPKY    BEGSR
      *================================================================
      * Display HELP text
      *================================================================
      * Signal help request
     C                     MOVEL'Y'       W0HLP   1
      *
      * Extract cursor row and column
     C           @#RWCL    DIV  256       ZHCSRW  50       Row
     C                     MVR            ZHCSCL  50       Column
      *
      * Save cursor position for redisplay
     C                     Z-ADDZHCSRW    ZZCSRW  30       Row
     C                     Z-ADDZHCSCL    ZZCSCL  30       Column
      *
      *
     C                     CALL 'YDDSHPR'
     C                     PARM ##PGM     W0HPMB 10        Help text sourc
     C                     PARM *BLANK    YYHPFL 10        Help text file
     C                     PARM *BLANK    YYHPLB 10        Help text libra
     C                     PARM           W0RTN   7
     C                     PARM '*START'  YYHLVN 10        Help label
     C                     PARM '*NORMAL' YYUSOP 10        Options
     C                     PARM ZHCSRW    YYRW    50       Row
     C                     PARM ZHCSCL    YYCL    50       Column
     C                     PARM *ZERO     YYLGCT  50       # of grps
     C                     PARM *BLANK    YYLGVN 10        Label grps
      *
      * Clear set cursor DDS indicator
     C  N94                MOVEL'OFF'     WCSRLC
     C  N94                SETON                     94    *
      *================================================================
     CSR         ZHEXIT    ENDSR
      /EJECT
     CSR         ZXEXPG    BEGSR
      *================================================================
      * Exit program: Normal
      *================================================================
     C                     MOVEL*BLANK    P0RTN
     C                     EXSR ZYEXPG
      *================================================================
     CSR         ZXEXIT    ENDSR
      /EJECT
     CSR         ZYEXPG    BEGSR
      *================================================================
      * Exit program: Direct
      *================================================================
      * ROLLBACK any uncommitted DBF changes
     C                     ROLBK                       90
      *
      * Terminate program
     C                     SETON                     LR
      *
      * Exit program
     C                     RETRN
      *
      *================================================================
     CSR         ZYEXIT    ENDSR
      /EJECT
     CSR         ZZINIT    BEGSR
      *================================================================
      * Initialisation
      *================================================================
     C           W0ICL     IFEQ *BLANK
     C                     MOVEL'Y'       W0ICL   1        *Initial call
     C                     ELSE
     C                     MOVEL'N'       W0ICL
     C                     END
     C                     MOVE *BLANK    P0RTN
     C                     MOVE *BLANK    W0RTN   7
     C                     MOVEL*BLANK    W0RSL   1
     C                     MOVEL*BLANK    W0RSF   1
     C                     MOVEL*ZEROS    W0RTW   90
     C                     MOVEL'400'     W0ENV   3
      * Setup job date/time
      *
     C                     Z-ADDUDATE     ##JDT
      * Set century digit (If YY prior to 1940 treat as 20YY)
     C           ##JYY     IFLT 40
     C                     Z-ADD1         ##JCC
     C                     ELSE
     C                     Z-ADD0         ##JCC
     C                     END
     C                     TIME           ##JTM
      * Update screen time
     C                     TIME           ##TME   60
      * Define work field Deletion Allowed
     C                     MOVEL*BLANK    WUDELA  1
      * Define work field Set Up Complete
     C                     MOVEL*BLANK    WUSUC   1
      * Obtain default message file
     C           *NAMVAR   DEFN Y2MGFLA   ZADFMF 10
     C                     IN   ZADFMF
      * Define work field Test ? in Key Field
     C                     MOVEL*BLANK    WUTQKF  1
      * Define work field If value in key field
     C                     MOVEL*BLANK    WUIVKF  1
      * Define work field data structure local Inst
     C                     MOVEL*BLANK    WUDSTT  2
      * Define work field Position One
     C                     MOVEL*BLANK    WUPOS1  1
      * Define work field Position Two
     C                     MOVEL*BLANK    WUPOS2  1
      * Define work field ZALIGN Screen Fun Field
     C                     MOVEL*BLANK    WUZASF 16
      * Define work field ZALIGN File Field
     C                     MOVEL*BLANK    WUZAFF 16
      * Define work field Run day number
     C                     Z-ADD*ZERO     WURDNB  50
      * Define work field No. of Records
     C                     Z-ADD*ZERO     WUNORC  50
      * Define work field No. of Amends
     C                     Z-ADD*ZERO     WUNOAM  50
      * Define work field No. of Deletes
     C                     Z-ADD*ZERO     WUNODL  50
      * Define work field No. of Inserts
     C                     Z-ADD*ZERO     WUNOIN  50
      * Define work field Deleted Data Record Pt1
     C                     MOVEL*BLANK    WUDR01250
      * Define work field Deleted Data Record Pt2
     C                     MOVEL*BLANK    WUDR02250
      * Define work field Deleted Data Record Pt3
     C                     MOVEL*BLANK    WUDR03250
      * Define work field Deleted Data Record Pt4
     C                     MOVEL*BLANK    WUDR04250
      * Define work field Deleted Data Record Pt5
     C                     MOVEL*BLANK    WUDR05250
      * Define work field Deleted Data Record Pt6
     C                     MOVEL*BLANK    WUDR06250
      * Define work field Deleted Data Record Pt7
     C                     MOVEL*BLANK    WUDR07250
      * Define work field Deleted Data Record Pt8
     C                     MOVEL*BLANK    WUDR08250
      * Define work field Deleted Data Record Pt9
     C                     MOVEL*BLANK    WUDR09250
      * Define work field Deleted Data Record Pt10
     C                     MOVEL*BLANK    WUDR00250
      * Define work field Deleted Data Record Pt11
     C                     MOVEL*BLANK    WUDR11250
      * Define work field Deleted Data Record Pt12
     C                     MOVEL*BLANK    WUDR12250
      * Define work field Type of Last Change
     C                     MOVEL*BLANK    WUTYLC  1
      * Define work field Midas Run Date
     C                     MOVEL*BLANK    WUMRDT  7
      * Define work field Date format flag
     C                     MOVEL*BLANK    WUDFF   1
      * Define work field Multi-branching Indicator
     C                     MOVEL*BLANK    WUMBIN  1
      * Flag no *SET CURSOR in the program
     C                     MOVE 'N'       YSETCS  1
     C                     MOVE *BLANK    WCSRLC  3
     C/COPY WNCPYSRC,SD0320MC17
      * Open files
      * Begin commit control
     C                     CALL 'Y2BGCMC'
     C                     PARM           W0RTN   7
     C           W0RTN     IFNE *BLANK
     C           W0RTN     ANDNE'CPF8351'
     C                     EXSR ZYEXPG
     C                     END
      * Define *Synon program work fields
     C                     MOVEL*BLANKS   W0CFL  10        *Cursor field
     C                     Z-ADD*ZEROS    W0CRW   50       *Cursor row
     C                     Z-ADD*ZEROS    W0CCL   50       *Cursor column
      * Move main file information to JOB context
     C                     MOVE @1FFL     ZZFFL  10        Main file name
     C                     MOVE @1FLB     ZZFLB  10        Main file lib
     C                     MOVE @1FMB     ZZFMB  10        Main file mbr
     C                     MOVE ZZFFL     @1FFL  10
     C                     MOVE ZZFLB     @1FLB  10
     C                     MOVE ZZFMB     @1FMB  10
     C                     CALL 'Y2QLVNR'
     C                     PARM           ZZFFL  10
     C                     PARM           ZZFLB  10
     C                     PARM           ZZFQL  21        LIBRARY/FILE
     C                     OPEN SD0320M#
     C                     OPEN SDFEEL1
     C                     OPEN SDFEEL0
     C                     OPEN SDFCTLL0
     C                     MOVEL'N'       W0PMT   1
      *
     C                     Z-ADD15        ##SFPG  30       SFLPAG
     C                     Z-ADD1         ##SFRC
      * Maximum record number
     C                     Z-ADD*ZERO     ##RRMX
      * Scan limit
     C                     Z-ADD500       W0SLM   50
      * Subfile pages
     C                     Z-ADD1         W0SPG   30
      * Processed Subfile record
     C                     Z-ADD0         W0RR0   40
      *................................................................
      * Set to *CHANGE mode
     C                     MOVEL'CHG'     W0PMD   3
     C                     MOVEL*BLANK    W0GRP   1
      * USER: Initialize program
      * SD0320M Precompiler - Fee Codes  *
      * Get Rundate - Rundate  *
     C           *NAMVAR   DEFN           RUNDAT
     C                     IN   RUNDAT
     C                     MOVE MRDT      ##MRDT  7        RUN DATE
     C                     MOVE MRDT      WUMRDT
     C                     MOVE RDNB      WURDNB           RUNDAY NO.
     C                     MOVE SUC       WUSUC            SET UP COMPLT
     C                     MOVE DFF       WUDFF            DTE FMT FLAG
     C                     MOVE MBIN      WUMBIN           MULTI BR. IND
      * Copyright Statement 1988 - Standard Functions  * copyright
      * Start of Fix S01117
      * define data strucrure - Fee Codes  *
      * End of Fix S01117
      *                                                                                       CLE134
      ** Get Customer Lending ICD                                                             CLE134
      *                                                                                       CLE134
     C                     CALL 'AOCLNDR0'                                                    CLE134
     C                     PARM *BLANKS   PRTCD   7                                           CLE134
     C                     PARM '*FIRST'  POPTN   7                                           CLE134
     C           SDCLND    PARM SDCLND    DSSDY                                               CLE134
      *                                                                                       CLE134
     C           PRTCD     IFNE *BLANKS                                                       CLE134
     C           *LOCK     IN   LDA                                                           CLE134
     C                     MOVEL'SD0320M 'DBPGM                                               CLE134
     C                     MOVEL'SDCLNDPD'DBFILE                                              CLE134
     C                     Z-ADD6         DBASE                                               CLE134
     C                     MOVELPOPTN     DBKEY                                               CLE134
     C                     OUT  LDA                                                           CLE134
     C                     EXSR *PSSR                                                         CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CAS001
      ** Determine if CAS001 is installed                                                     CAS001
      *                                                                                       CAS001
     C                     CALL 'AOSARDR0'                                                    CAS001
     C                     PARM *BLANKS   PRTCD   7                                           CAS001
     C                     PARM '*VERIFY 'POPTN   7                                           CAS001
     C                     PARM 'CAS001'  PSARD   6                                           CAS001
     C           SCSARD    PARM SCSARD    DSFDY                                               CAS001
      *                                                                                       CAS001
     C           PRTCD     IFNE *BLANKS                                                       CAS001
     C           PRTCD     ANDNE'*NRF   '                                                     CAS001
     C           *NAMVAR   DEFN           LDA                                                 CAS001
     C           *LOCK     IN   LDA                                                           CAS001
     C                     MOVEL'SD0320M 'DBPGM                                               CAS001
     C                     MOVEL'SCSARDPD'DBFILE                                              CAS001
     C                     Z-ADD1         DBASE                                               CAS001
     C                     MOVEL'CAS001'  DBKEY                                               CAS001
     C                     OUT  LDA                                                           CAS001
     C                     EXSR *PSSR                                                         CAS001
     C                     ENDIF                                                              CAS001
      *                                                                                       CAS001
     C           PRTCD     IFEQ *BLANKS                                                       CAS001
     C                     MOVE 'Y'       CAS001  1                                           CAS001
     C                     MOVE *ON       *IN55                                               CAS001
     C                     ELSE                                                               CAS001
     C                     MOVE 'N'       CAS001                                              CAS001
     C                     MOVE *OFF      *IN55                                               CAS001
     C                     ENDIF                                                              CAS001
     C/COPY WNCPYSRC,SDH00139
      *                                                                                       CAS001
      ** Determine if CAS009 is installed                                                     CAS009
      *                                                                                       CAS009
     C                     CALL 'AOSARDR0'                                                    CAS009
     C                     PARM *BLANKS   PRTCD                                               CAS009
     C                     PARM '*VERIFY 'POPTN                                               CAS009
     C                     PARM 'CAS009'  PSARD                                               CAS009
     C           SCSARD    PARM SCSARD    DSFDY                                               CAS009
      *                                                                                       CAS009
     C           PRTCD     IFNE *BLANKS                                                       CAS009
     C           PRTCD     ANDNE'*NRF   '                                                     CAS009
     C           *LOCK     IN   LDA                                                           CAS009
     C                     MOVEL'SD0320M 'DBPGM                                               CAS009
     C                     MOVEL'SCSARDPD'DBFILE                                              CAS009
     C                     Z-ADD2         DBASE                                               CAS009
     C                     MOVEL'CAS009'  DBKEY                                               CAS009
     C                     OUT  LDA                                                           CAS009
     C                     EXSR *PSSR                                                         CAS009
     C                     ENDIF                                                              CAS009
      *                                                                                       CAS009
     C           PRTCD     IFEQ *BLANKS                                                       CAS009
     C                     MOVE 'Y'       CAS009  1                                           CAS009
      *                                                                                       231568
     C           KSARP     KLIST                                                              231568
     C                     KFLD           KSARN   6                                           231568
     C                     KFLD           KPNAM  10                                           231568
      *                                                                                       231568
     C                     MOVE 'CAS009'  KSARN                                               231568
     C           'LEC'     CAT  '000016'  KPNAM                                               231568
      *                                                                                       231568
     C           KSARP     CHAINSCSARPL1             78                                       231568
      *                                                                                       231568
     C           *IN78     IFEQ *ON                                                           231568
     C           *LOCK     IN   LDA                                                           231568
     C                     MOVEL'SD0320M 'DBPGM                                               231568
     C                     MOVEL'SCSARPPD'DBFILE                                              231568
     C                     Z-ADD3         DBASE                                               231568
     C                     MOVEL'CAS009'  DBKEY                                               231568
     C                     OUT  LDA                                                           231568
     C                     EXSR *PSSR                                                         231568
     C                     ELSE                                                               231568
      *                                                                                       231568
      ** Check if Initialisation Program for CAS009 Fee Codes has run                         231568
      *                                                                                       231568
     C           AKPRVC    IFEQ 'Y'                                                           231568
      *                                                                                       231568
      ** Set CAS009 Initialised Flag to Yes                                                   231568
      *                                                                                       231568
     C                     MOVE 'Y'       WCAS9I  1                                           231568
     C                     ENDIF                                                              231568
     C                     ENDIF                                                              231568
      *                                                                                       231568
     C                     ELSE                                                               CAS009
     C                     MOVE 'N'       CAS009                                              CAS009
     C                     ENDIF                                                              CAS009
      *                                                                                       CAS009
      ** Determine if CLE134 is installed                                                     CLE134
      *                                                                                       CLE134
     C                     CALL 'AOSARDR0'                                                    CLE134
     C                     PARM *BLANKS   PRTCD                                               CLE134
     C                     PARM '*VERIFY 'POPTN                                               CLE134
     C                     PARM 'CLE134'  PSARD                                               CLE134
     C           SCSARD    PARM SCSARD    DSFDY                                               CLE134
      *                                                                                       CLE134
     C                     SELEC                                                              CLE134
     C           PRTCD     WHEQ *BLANKS                                                       CLE134
     C                     MOVE 'Y'       CLE134  1                                           CLE134
     C**********           MOVE *ON       *IN57                                     CLE134 MD021974A
     C                     MOVE *ON       *IN58                                               CLE164
      *                                                                                       CLE134
     C           PRTCD     WHEQ '*NRF'                                                        CLE134
     C                     MOVE 'N'       CLE134                                              CLE134
     C**********           MOVE *OFF      *IN57                                     CLE134 MD021974A
     C                     MOVE *OFF      *IN58                                               CLE164
      *                                                                                       CLE134
     C                     OTHER                                                              CLE134
     C           *LOCK     IN   LDA                                                           CLE134
     C                     MOVEL'SD0320M 'DBPGM                                               CLE134
     C                     MOVEL'SCSARDPD'DBFILE                                              CLE134
     C                     Z-ADD4         DBASE                                               CLE134
     C                     MOVEL'CLE134'  DBKEY                                               CLE134
     C                     OUT  LDA                                                           CLE134
     C                     EXSR *PSSR                                                         CLE134
     C                     ENDSL                                                              CLE134
      *                                                                                       CLE134
      ** Determine if CLE042 is installed                                                     CLE134
      *                                                                                       CLE134
     C                     CALL 'AOSARDR0'                                                    CLE134
     C                     PARM *BLANKS   PRTCD                                               CLE134
     C                     PARM '*VERIFY 'POPTN                                               CLE134
     C                     PARM 'CLE042'  PSARD                                               CLE134
     C           SCSARD    PARM SCSARD    DSFDY                                               CLE134
      *                                                                                       CLE134
     C                     SELEC                                                              CLE134
     C           PRTCD     WHEQ *BLANKS                                                       CLE134
     C                     MOVE 'Y'       CLE042  1                                           CLE134
     C                     MOVE *ON       *IN56                                               CLE134
      *                                                                                       CLE134
     C           PRTCD     WHEQ '*NRF'                                                        CLE134
     C                     MOVE 'N'       CLE042                                              CLE134
     C                     MOVE *OFF      *IN56                                               CLE134
      *                                                                                       CLE134
     C                     OTHER                                                              CLE134
     C           *LOCK     IN   LDA                                                           CLE134
     C                     MOVEL'SD0320M 'DBPGM                                               CLE134
     C                     MOVEL'SCSARDPD'DBFILE                                              CLE134
     C                     Z-ADD7         DBASE                                               CLE134
     C                     MOVEL'CLE042'  DBKEY                                               CLE134
     C                     OUT  LDA                                                           CLE134
     C                     EXSR *PSSR                                                         CLE134
     C                     ENDSL                                                              CLE134
      *                                                                                       CLE134
     C                     CALL 'AOSARDR0'                                                 AR1022007
     C                     PARM *BLANKS   PRTCD                                            AR1022007
     C                     PARM '*VERIFY' POPTN                                            AR1022007
     C                     PARM 'CRE073'  PSARD                                            AR1022007
     C           SCSARD    PARM SCSARD    DSFDY                                            AR1022007
      *                                                                                    AR1022007
     C           PRTCD     IFEQ *BLANK                                                     AR1022007
     C                     MOVE 'Y'       CRE073  1                                        AR1022007
     C                     MOVE *ON       *IN76                                            AR1022007
     C                     ELSE                                                            AR1022007
     C                     MOVE 'N'       CRE073                                           AR1022007
     C                     MOVE *OFF      *IN76                                             MD021974
     C                     ENDIF                                                           AR1022007
      *                                                                                    AR1022007
     C                     CALL 'AOSARDR0'                                                 AR1080662
     C                     PARM *BLANKS   PRTCD                                            AR1080662
     C                     PARM '*VERIFY' POPTN                                            AR1080662
     C                     PARM 'CLE036'  PSARD                                            AR1080662
     C           SCSARD    PARM SCSARD    DSFDY                                            AR1080662
      *                                                                                    AR1080662
     C                     SELEC                                                           AR1080662
     C           PRTCD     WHEQ *BLANKS                                                    AR1080662
     C                     MOVE 'Y'       CLE036  1                                        AR1080662
     C           PRTCD     WHEQ '*NRF'                                                     AR1080662
     C                     MOVE 'N'       CLE036                                           AR1080662
     C                     OTHER                                                           AR1080662
     C                     MOVEL'SCSARDPD'DBFILE                                           AR1080662
     C                     MOVEL'CLE036'  DBKEY                                            AR1080662
     C                     Z-ADD6         DBASE                                            AR1080662
     C                     MOVE *ON       *INU7                                            AR1080662
     C                     MOVE *ON       *INU8                                            AR1080662
     C                     MOVE *ON       *INLR                                            AR1080662
     C                     EXSR *PSSR                                                      AR1080662
     C                     ENDSL                                                           AR1080662
      *                                                                                    AR1080662
     C           CLE036    IFEQ 'Y'                                                        AR1080662
     C           CLE134    ANDEQ'Y'                                                        AR1080662
     C                     MOVE *ON       *IN71                                            AR1080662
     C                     ELSE                                                            AR1080662
     C                     MOVE *OFF      *IN71                                            AR1080662
     C                     MOVE *ON       *IN72                                            AR1080662
     C                     ENDIF                                                           AR1080662
      *                                                                                       CER050
     C                     CALL 'AOSARDR0'                                                    CER050
     C                     PARM *BLANKS   PRTCD                                               CER050
     C                     PARM '*VERIFY' POPTN                                               CER050
     C                     PARM 'CER050'  PSARD                                               CER050
     C           SCSARD    PARM SCSARD    DSFDY                                               CER050
      *                                                                                       CER050
     C           PRTCD     IFEQ *BLANK                                                        CER050
     C                     MOVE 'Y'       CER050  1                                           CER050
     C                     MOVE *ON       *IN75                                               CER050
     C                     ELSE                                                               CER050
     C                     MOVE 'N'       CER050                                              CER050
     C                     MOVE *OFF      *IN75                                               CER050
     C                     ENDIF                                                              CER050
      *                                                                                       CER050
     C           CER050    IFEQ 'Y'                                                           CER050
     C                     CALL 'AOBANKR0'                                                    CER050
     C                     PARM '*MSG   ' @RTCD   7                                           CER050
     C                     PARM '*FIRST ' @OPTN   7                                           CER050
     C           SDBANK    PARM SDBANK    DSFDY                                               CER050
      *                                                                                       CER050
     C           @RTCD     IFNE *BLANK                                                        CER050
     C           *LOCK     IN   LDA                        ***************                    CER050
     C                     Z-ADD8         DBASE            ** DB ERR 08 **                    CER050
     C                     MOVE 'SDBANKPD'DBFILE           ***************                    CER050
     C                     MOVEL@OPTN     DBKEY                                               CER050
     C                     OUT  LDA                                                           CER050
     C                     EXSR *PSSR                                                         CER050
     C                     ENDIF                                                              CER050
      *                                                                                       CER050
      * Access  program to get the number of decimal places using                             CER050
      * the currency code                                                                     CER050
     C                     CALL 'AOCURRR0'                                                    CER050
     C                     PARM *BLANKS   @RTCD                                               CER050
     C                     PARM '*KEY   ' @OPTN                                               CER050
     C                     PARM BJCYCD    ##KEY1 10                                           CER050
     C           SDCURR    PARM SDCURR    DSSDY                                               CER050
      *                                                                                       CER050
      * Database error if the currency code is not found                                      CER050
     C           @RTCD     IFNE *BLANKS                                                       CER050
     C           *LOCK     IN   LDA                        ***************                    CER050
     C                     Z-ADD9         DBASE            ** DB ERR 09 **                    CER050
     C                     MOVE 'SDCURRPD'DBFILE           ***************                    CER050
     C                     MOVELBJCYCD    DBKEY                                               CER050
     C                     OUT  LDA                                                           CER050
     C                     EXSR *PSSR                                                         CER050
     C                     ENDIF                                                              CER050
      *                                                                                       CER050
     C           13        SUB  A6NBDP    @@NDEC  20                                          CER050
      *                                                                                       CER050
     C                     ENDIF                                                              CER050
      *                                                                                       CER050
      * Initialise subfile control
     C                     EXSR MEIZ#2
     C/COPY WNCPYSRC,SD0320MC16
      *================================================================
     CSR         ZZEXIT    ENDSR
     C/COPY WNCPYSRC,SDH00141
      /EJECT
     CSR         *PSSR     BEGSR
      *****************************************************************
      *                                                               *
      * *PSSR  - Program exception error routine                      *
      *          Called automatically if a program error occurs,      *
      *          or directly by the program code using EXSR.          *
      *          This subroutine DUMPs the program just once.         *
      *                                                               *
      *****************************************************************
      *
      * Core function specific processing.
      *
     C/COPY WNCPYSRC,SD0320MPSC
      *
      * Start of PSSR user point.
      *
     C/COPY WNCPYSRC,SD0320MPS1
      *
      * Standard Midas PSSR processing.
      *
     C/COPY SDCPYSRC,SDPSSRINT
      *
      * End of PSSR user point.
      *
     C/COPY WNCPYSRC,SD0320MPS2
      *
      *================================================================
     CSR                   ENDSR
      *================================================================
      *****************************************************************                       CLE164
      *                                                               *                       CLE164
      *  SLPGID - Select Priority Group ID                                                    CLE164
      *                                                               *                       CLE164
      *================================================================                       CLE164
     C           SLPGID    BEGSR                                                              CLE164
      *                                                                                       CLE164
     C                     MOVEL#2PGID    PGIDSL  1                                           CLE164
     C           PGIDSL    IFEQ '?'                                                           CLE164
     C                     CALL 'SD00321S'             90                                     CLE164
     C                     PARM           W0RTN   7                                           CLE164
     C           #2PGID    PARM #2PGID    WVAR01  3                                           CLE164
     C           *IN90     IFEQ '1'                                                           CLE164
      *                                                                                       CLE164
     C                     MOVEL'Y2U0021' W0RTN   7                                           CLE164
     C                     END                                                                CLE164
      * Defer confirm                                                                         CLE164
     C                     MOVEL'Y'       W0DEF   1                                           CLE164
     C                     END                                                                CLE164
     C                     ENDSR                                                              CLE164
** CPY@     : Copyright notice for inclusion in all programs
(c) Finastra International Limited 2001
