     H        1   Y
      *****************************************************************
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas SD Display customer fees')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  SD0361E - Midas SD Display customer fees                     *
      *                                                               *
      *  Function:  This program displays the customer fees details.  *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 09Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 CSD008             Date 05Feb01               *
      * Midas DBA 3.04 -----------------------------------------------*
      *                 CSD003             Date 01Jul99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CAC001             DATE 12Jan96               *
      *                 S01464             DATE 10MAY94               *
      *                 S01459             DATE 10MAY94               *
      *                 S01421 (S01423)    DATE 22JUN93               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CSD008 - Customer Service Fees Enhancement                   *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - Program removed from SD model.                    *
      *  CAC001 - Profit Centre Accounting.                           *
      *           Additional fields- Profit Centres for Numbered A/c  *
      *           Charges & Hold Mail.                                *
      *  S01464 - Safe Custody fees development :-                    *
      *           Do not display Numbered A/C , Hold mail or Profit   *
      *           Centre, if S01464 is present only.                  *
      *  S01459 - Addition of headerbox and PSSR processing.          *
      *  S01421 - BLI Development Phase 1.                            *
      *         - Includes changes for:                               *
      *           S01423 - New program created for the Customer       *
      *                    Service Fees switchable feature.           *
      *                                                               *
      *****************************************************************
     F/COPY WNCPYSRC,SD0361EFPG
     FSD0361E#CF  E                    WORKSTN                        UC
     F                                              KINFDS INFDS#
     F                                              KINFSR *PSSR
      * DSP: Midas SD Display customer fees
      *
     FSDCFCDL1IF  E           K        DISK                           UC
     F                                              KINFDS INFDS1
     F                                              KINFSR *PSSR
      * RTV : Midas SD Customer fees detail retrieval
      *
     FSDMMODL1IF  E           K        DISK                           UC
     F                                              KINFDS ID0001
     F                                              KINFSR *PSSR
      * RTV : Midas SD Midas module flags retrieval
      *
     FSDGELRL1IF  E           K        DISK                           UC
     F                                              KINFDS ID0002
     F                                              KINFSR *PSSR
      * RTV : Midas SD General ledger ICD details retrieval
      *
     E* Description     : Copyright notice for inclusion in all programs
     E*
     E********************************************************************
     E                    CPY@    1   1 80               Copyright array
     E/COPY WNCPYSRC,SD0361EEPG
     I*
     I* Description     : Copyright notice for inclusion in all programs
     I*
     I/COPY QWINDSRC,SD0360GDTA
     I/COPY WNCPYSRC,SD0361EIPG
      /EJECT
      * Data structures:
     IPGMDS     ESDSY2PGDSP
      * Program data structure
     IJBDTTM      DS
      * Job date/time
     I                                        1   70##JDT
     I                                        1   10##JCC
     I                                        2   30##JYY
     I                                        4   50##JMM
     I                                        6   70##JDD
     I                                        8  130##JTM
     I                                        8   90##JHH
     I                                       10  110##JNN
     I                                       12  130##JSS
      * ABO DEFINE LARGE STRING FOR CL CMD
     IYARTCM      DS                            512
     I                                        1   1 DUMMY1
     IINFDS#    E DSY2I#DSP
      * Display file information data structure
      *
     IINFDS1    E DSY2I1DSP
      * File information data structure
      *
     IA@CPY       DS
     I* Copyright array
     I                                        1  80 CPY@
     IRUNDAT      DS
     I                                        1   7 MRDT
     I                                    P   8  100RDNB
     I                                       11  11 SUC
     I                                       12  12 DFF
     I                                       13  13 MBIN
      *                                                                   CSD008
     ILDA       E DSLDA                         256                       CSD008
      *                                                                   CSD008
      ** Local data area for database error details                       CSD008
      ** *LOCK IN LDA immediately before and OUT LDA immediately          CSD008
      ** after each database error handling.                              CSD008
      **                                                                  CSD008
      **                                    134 141 DBFILE                CSD008
      **       Defines:                     142 170 DBKEY                 CSD008
      **                                    171 180 DBPGM                 CSD008
      **                                    181 1830DBASE                 CSD008
      *                                                                   CSD008
     I              SPARE                           SPAREV                CSD008
      *                                                                   CSD008
     IID0001      DS                            528
      * File information data structure
      *
     IID0002      DS                            528
      * File information data structure
      *
      /EJECT
      * Parameter declarations
     IP1PARM      DS                              6
      * KEY: Midas SD Customer fees detail retrieval
      * I : RST Customer Number
     I                                        1   6 P1CUST
     I            DS
     I                                        1 132 ZAMSDA
      * Message data for 'Customer Service Fees hdr'
      /EJECT
      *****************************************************************
      * Entry parameters
     C           *ENTRY    PLIST
     C                     PARM           P0RTN   7
     C                     PARM           P1PARM           KEY: Customer F
      *****************************************************************
      * Initialize
     C                     EXSR ZZINIT
      *
      * Display and process key screen
     C                     EXSR BADSKY
      * Terminate program
     C                     EXSR ZXEXPG
      *****************************************************************
      /EJECT
     CSR         BADSKY    BEGSR
      *================================================================
      * Display and process key screen
      *================================================================
      * Initialize key screen
     C                     EXSR MDIZ#K
      * Bypass first display of key screen is possible
     C                     MOVEL'Y'       W0BYP   1
      * Signal start of transaction
     C                     MOVEL'Y'       W0TRN   1
      *
     C           W0TRN     DOWEQ'Y'
     C           W0TRN     OREQ 'K'
      * Ensure transaction continues (if reset)
     C                     MOVEL'Y'       W0TRN   1
      * Conduct screen conversation
     C           W0TRN     DOWEQ'Y'
      * Is bypass key screen still viable?
     C           W0BYP     IFEQ 'Y'
     C           #1CUST    IFEQ *BLANK                     Customer Number
      * One or more key fields is blank
     C           *IN05     OREQ '1'
      * HOME: Reset screen fields
     C                     MOVEL'N'       W0BYP
     C                     END
     C                     END
      * Bypass key screen
     C           W0BYP     IFNE 'Y'
      * Display key screen
     C                     EXSR BBEXFM
     C                     END
      * Cancel key screen bypass
     C                     MOVEL'N'       W0BYP
      * Process response to key screen
      * Cancel & exit program
     C   03                CAS            ZXEXPG
      * HOME: Reset screen fields
     C   05                CAS            BDHMKY
      * Process key screen input
     C                     CAS            BEPRKY
     C                     END
     C           W0TRN     DOWEQ'R'
     C                     MOVEL'Y'       W0TRN
     C                     EXSR BEPRKY
     C                     END
      *
     C                     END
     C                     END
      *================================================================
     CSR         BAEXIT    ENDSR
      /EJECT
     CSR         BBEXFM    BEGSR
      *================================================================
      * Display key screen and process HELP requests
      *================================================================
      * Set screen conditioning indicators
     C                     EXSR GADSAK
      * Update screen time
     C                     TIME           ##TME
     C           W0HLP     DOUEQ'N'
     C                     MOVEL'N'       W0HLP   1
     C                     MOVE *IN25     HELP25  1
     C                     MOVE *ALL'0'   ##OFF  30
     C                     MOVEA##OFF     *IN,1
     C                     MOVE HELP25    *IN25
      * Set cursor by *SET CURSOR data
     C           YSETCS    IFEQ 'Y'
     C                     EXSR Y0SET
     C                     END
     C                     WRITE#MSGCTL
     C                     WRITE#CMDTXT1
     C                     EXFMT#RCDKEY
      * Enable PUTOVR
     C                     SETON                     86
      * Test cursor
     C                     EXSR Y8TST
      * Clear set cursor DDS indicator
     C           WCSRLC    IFEQ 'OFF'
     C                     SETOF                     94    *
     C                     END
     C                     MOVE *BLANK    WCSRLC
      * If help requested, display help text
     C   25                EXSR ZHHPKY
     C                     END
      * Update job time
     C                     TIME           ##JTM
      * Clear messages from program message queue
     C                     CALL 'Y2CLMSC'
     C                     PARM ##PGM     ZAPGMQ 10
     C                     PARM '*SAME'   ZAPGRL  5
      * Reset first message only flag
     C                     MOVEL'Y'       ZAFSMS  1      99*
     C           YSETCS    IFEQ 'Y'
     C                     EXSR Y9CLR
     C                     END
      *================================================================
     CSR         BBEXIT    ENDSR
      /EJECT
     CSR         BDHMKY    BEGSR
      *================================================================
      * Process HOME key
      *================================================================
     C                     MOVEL'N'       W0TRN
      *================================================================
     CSR         BDEXIT    ENDSR
      /EJECT
     CSR         BEPRKY    BEGSR
      *================================================================
      * Process key screen input
      *================================================================
      * Initialise detail screen
     C                     EXSR MAIZ#1
      * Validate key fields
     C                     EXSR BFVLKY
     C           *IN99     CABEQ'1'       BEEXIT
      * Check for existing record
     C           KRTV      KLIST
     C                     KFLD           E6CUST           Customer Number
      * Setup key
     C                     MOVEL#1CUST    E6CUST           Customer Number
     C           KRTV      CHAIN@CFCDL1              9091  *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     SETON                     99    *
     C                     GOTO BEEXIT
     C                     END                             FI 91
      *
      * If record does not exist, then signal error
     C           *IN90     IFEQ '1'
     C                     SETON                     99    *
      * Send message 'Customer Fees Detail   NF'
     C                     MOVEL'USR1918' ZAMSID
     C                     EXSR ZASNMS
     C                     ELSE
     C                     EXSR MBFL#1
      * CALC: Detail screen function fields
      * 00/Copy member SD0361ESFF - Customer Fees Detail  *
     C/COPY WNCPYSRC,SD0361ESFF
      * USER: Load detail screen from DBF record
      * Set up screen header.
      * Setup message data for message
      * Retrieve message Customer Service Fees hdr
     C                     MOVELZADFMF    ZAMSGF
     C                     CALL 'Y2RVMGC'              90  *
     C                     PARM *BLANK    W0RTN   7        Return code
     C                     PARM 'USR1920' ZAMSID  7        Message ID
     C                     PARM           ZAMSGF 10        Message file
     C                     PARM           ZAMSDA132        Message data
     C           #DCSFH    PARM           W0MTX 132        Returned messag
     C                     MOVEL*BLANK    ZAMSDA
     C                     MOVEL*BLANK    ZAMSGF
      * 00/Copy member SD0361ELDS - Customer Fees Detail  *
     C/COPY WNCPYSRC,SD0361ELDS
     C                     END
      *
     C   99                GOTO BEEXIT
      * No error: Display and process details
     C                     EXSR CADSDA
      *
      *================================================================
     CSR         BEEXIT    ENDSR
      /EJECT
     CSR         BFVLKY    BEGSR
      *================================================================
      * Validate key fields
      *================================================================
      * USER: Validate key screen
      * 00/Copy member SD0361EVKS - Customer Fees Detail  *
     C/COPY WNCPYSRC,SD0361EVKS
      *================================================================
     CSR         BFEXIT    ENDSR
      /EJECT
     CSR         CADSDA    BEGSR
      *================================================================
      * Display and process detail screen
      *================================================================
      * Conduct detail screen conversation
      * - repeat until screen control flag is reset:
     C           W0TRN     DOWEQ'Y'
      * Display detail screen
     C                     EXSR CBEXFM
      * Process response to detail screen
     C   03                CAS            ZXEXPG
      * HOME: Reset screen fields
      * Process detail screen input
      * Redisplay previous screen
     C   12                CAS            CCDSPV
      * HOME: Reset screen fields
     C   05                CAS            CCDSPV
      * Process key screen input
     C                     CAS            CFPRSC
     C                     END
      *
     C                     END
      *================================================================
     CSR         CAEXIT    ENDSR
      /EJECT
     CSR         CBEXFM    BEGSR
      *================================================================
      * Display screen and process HELP requests
      *================================================================
      * Set screen conditioning indicators
     C                     EXSR GBDSAD
      * Update screen time
     C                     TIME           ##TME
     C           W0HLP     DOUEQ'N'
     C                     MOVEL'N'       W0HLP   1
     C                     MOVE *IN25     HELP25  1
     C                     MOVE *ALL'0'   ##OFF  30
     C                     MOVEA##OFF     *IN,1
     C                     MOVE HELP25    *IN25
      * Set cursor by *SET CURSOR data
     C           YSETCS    IFEQ 'Y'
     C                     EXSR Y1SET
     C                     END
     C                     WRITE#MSGCTL
     C                     WRITE#CMDTXT2
     C                     EXFMT#RCDDTL1
      * Enable PUTOVR
     C                     SETON                     86
      * Test cursor
     C                     EXSR Y8TST
      * Clear set cursor DDS indicator
     C           WCSRLC    IFEQ 'OFF'
     C                     SETOF                     94    *
     C                     END
     C                     MOVE *BLANK    WCSRLC
      * If help requested, display help text
     C   25                EXSR ZHHPKY
     C                     END
      * Update job time
     C                     TIME           ##JTM
      * Clear messages from program message queue
     C                     CALL 'Y2CLMSC'
     C                     PARM ##PGM     ZAPGMQ 10
     C                     PARM '*SAME'   ZAPGRL  5
      * Reset first message only flag
     C                     MOVEL'Y'       ZAFSMS  1      99*
     C           YSETCS    IFEQ 'Y'
     C                     EXSR Y9CLR
     C                     END
      *================================================================
     CSR         CBEXIT    ENDSR
      /EJECT
     CSR         CCDSPV    BEGSR
      *================================================================
      * Redisplay previous screen
      *================================================================
      * USER: Process key screen request
      * 00/Copy member SD0361EPKR - Customer Fees Detail  *
     C/COPY WNCPYSRC,SD0361EPKR
     C                     MOVEL'USR0790' P0RTN            *Return code
     C                     EXSR ZYEXPG
     C   05                MOVEL'Y'       W0TRN
     C   12                MOVEL'K'       W0TRN
      *================================================================
     CSR         CCEXIT    ENDSR
      /EJECT
     CSR         CFPRSC    BEGSR
      *================================================================
      * Validate record
      *================================================================
      * Confirm/update is not deferred
     C                     MOVEL'N'       W0DCF   1
     C                     MOVEL'Y'       W0TRN
      * Validate details
     C                     EXSR DCVLDL
      * QUIT if error:
     C   99                GOTO CFEXIT
      * Defer confirm/update requested
     C           W0DCF     CABEQ'Y'       CFEXIT
      * Process record:
     C                     EXSR EBPR##
      *================================================================
     CSR         CFEXIT    ENDSR
      /EJECT
     CSR         DCVLDL    BEGSR
      *================================================================
      * Validate details
      *================================================================
      * CALC: Detail screen function fields
      * 00/Copy member SD0361ESFF - Customer Fees Detail  *
     C/COPY WNCPYSRC,SD0361ESFF
      * USER: Validate detail screen
      * Window processing.
      * CASE: WRK.Window processing requir. is Yes
     C           WUWDPR    IFEQ 'Y'                        *IF
      * WM call Window Manager - Window manager  *
     C/COPY WNCPYSRC,WN0481CCP1                                           S01408
     C***********          CALL 'WIND01'                                  S01212
     C                     CALL 'WN0010'                                  S01212
     C*********************PARM           ##PGM            Program        S01212
     C                     PARM ##PGM     UPGM   10        Program        S01212
     C*********************PARM *BLANK    FKEY    2        Function Key   S01212
     C                     PARM *BLANK    UFKEY   2        Function Key   S01212
     C*********************PARM           WUMEST           Action  S01212 S01229
     C*********************PARM           WUWMAC           Action  S01212 S01229
     C                     PARM 'E'       UACTCD  1        Action  S01212 S01229
     C                     PARM           DATA             Trans Data     S01212
     C                     PARM *BLANK    W0RTN            Return Code    S01212
     C                     PARM           SPARE 256        Spare Field    LN0355
      * WM Check Return
      * CASE: PAR.*Return code is *User QUIT requested
     C           W0RTN     IFEQ 'Y2U9999'                  *IF
     C                     MOVELW0RTN     P0RTN            *Return code
     C                     EXSR ZYEXPG
     C                     ELSE
      * CASE: PAR.*Return code is WN Window Error
     C           W0RTN     IFEQ 'USR0563'                  *IF
      * Send message 'WN Window Error'
     C                     MOVEL'USR0563' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO DCEXIT                     *QUIT
     C                     ELSE
      * CASE: PAR.*Return code is *DBF update error
     C           W0RTN     IFEQ 'Y2U0004'                  *IF
      * Send message 'WN Database Error'
     C                     MOVEL'USR0567' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO DCEXIT                     *QUIT
     C                     ELSE
      * CASE: PAR.*Return code is *Previous Screen
     C           W0RTN     IFEQ 'USR0790'                  *IF
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO DCEXIT                     *QUIT
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
      * 00/Copy member SD0361EVSW - Customer Fees Detail  *
     C/COPY WNCPYSRC,SD0361EVSW
     C                     END                             *FI
      * 00/Copy member SD0361EVDS - Customer Fees Detail  *
     C/COPY WNCPYSRC,SD0361EVDS
      *================================================================
     CSR         DCEXIT    ENDSR
      /EJECT
     CSR         EBPR##    BEGSR
      *================================================================
      * Process record:
      *================================================================
      * USER: Perform confirmed action
      * 00/Copy member SD0361EPCA - Customer Fees Detail  *
     C/COPY WNCPYSRC,SD0361EPCA
      * Quit if error signalled
     C   99                GOTO EBEXIT
      * USER: Process command keys
      * 00/Copy member SD0361EPCK - Customer Fees Detail  *
     C/COPY WNCPYSRC,SD0361EPCK
      * Quit if error signalled
     C   99                GOTO EBEXIT
      * Restart program for next record
     C                     MOVEL'N'       W0TRN
      *================================================================
     CSR         EBEXIT    ENDSR
      /EJECT
     CSR         GADSAK    BEGSR
      *================================================================
      * Set key screen conditioning indicators
      *================================================================
      *================================================================
     CSR         GAEXIT    ENDSR
      /EJECT
     CSR         GBDSAD    BEGSR
      *================================================================
      * Set detail screen conditioning indicators
      *================================================================
      * Protect key fields on detail screen
     C                     SETON                     88    *
     C                     MOVEL'0'       *IN79
     C           WUKKST    IFEQ 'N'                        *IF
     C                     MOVEL'1'       *IN79
     C                     END                             *FI
     C                     MOVEL'0'       *IN78
     C           WUDSAC    IFEQ 'N'                        *IF
     C                     MOVEL'1'       *IN78
     C                     END                             *FI
     C                     MOVEL'0'       *IN77
     C           WUDSCU    IFEQ 'N'                        *IF
     C                     MOVEL'1'       *IN77
     C                     END                             *FI
     C                     MOVEL'0'       *IN76
     C           WUDPCT    IFEQ 'N'                        *IF
     C                     MOVEL'1'       *IN76
     C                     END                             *FI
     C                     MOVEL'0'       *IN75
     C           WUDSSB    IFEQ 'N'                        *IF
     C                     MOVEL'1'       *IN75
     C                     END                             *FI
     C                     MOVEL'0'       *IN74
     C           WUW3ST    IFEQ 'N'                        *IF
     C                     MOVEL'1'       *IN74
     C                     END                             *FI
     C                     MOVEL'0'       *IN73
     C           WUW4ST    IFEQ 'N'                        *IF
     C                     MOVEL'1'       *IN73
     C                     END                             *FI
      * Enable key screen
     C                     SETON                     87    *
      *================================================================
     CSR         GBEXIT    ENDSR
      /EJECT
     CSR         MAIZ#1    BEGSR
      *================================================================
      * Initialise record - except for key fields and "neither" paramete
      *================================================================
     C                     Z-ADD*ZERO     #1LCD            Last Change Dat
     C                     MOVEL*BLANK    #1TYLC           Type of Last Ch
     C                     MOVEL*BLANK    #DCSFH           Customer Servic
     C                     MOVEL*BLANK    #1NAIN           Numbered A/c In
     C                     MOVEL*BLANK    #1SMAC           Settlement Acco
     C                     MOVEL*BLANK    #1HMIN           Hold Mail Indic
     C                     MOVEL*BLANK    #1SCCY           Settlement Curr
     C                     MOVEL*BLANK    #1PFCD           Profit Centre
     C                     MOVEL*BLANK    #1SBCH           Settlement Bran
     C                     MOVEL*BLANK    #1PCAC           Pft Cntr For Nu
     C                     MOVEL*BLANK    #1PCHM           Pft Cntr For Ho
     C                     MOVEL*BLANK    #1VATF                          CSD008
      *================================================================
     CSR         MAEXIT    ENDSR
      /EJECT
     CSR         MBFL#1    BEGSR
      *================================================================
      * Move @CFCDL1 fields to screen
      *================================================================
     C                     Z-ADDE6LCD     #1LCD            Last Change Dat
     C                     MOVELE6TYLC    #1TYLC           Type of Last Ch
     C                     MOVELE6CUST    #1CUST           Customer Number
     C                     MOVELE6NAIN    #1NAIN           Numbered A/c In
     C                     MOVELE6SMAC    #1SMAC           Settlement Acco
     C                     MOVELE6HMIN    #1HMIN           Hold Mail Indic
     C                     MOVELE6SCCY    #1SCCY           Settlement Curr
     C                     MOVELE6PFCD    #1PFCD           Profit Centre
     C                     MOVELE6SBCH    #1SBCH           Settlement Bran
     C                     MOVELE6PCAC    #1PCAC           Pft Cntr For Nu
     C                     MOVELE6PCHM    #1PCHM           Pft Cntr For Ho
     C                     MOVELE6TAIF    #1VATF                          CSD008
      *================================================================
     CSR         MBEXIT    ENDSR
      /EJECT
     CSR         MDIZ#K    BEGSR
      *================================================================
      * Initialize key screen
      *================================================================
     C                     MOVELP1CUST    #1CUST           Customer Number
      * USER: Load key screen
      * 00/Copy member SD0361ELKS - Customer Fees Detail  *
     C/COPY WNCPYSRC,SD0361ELKS
      *================================================================
     CSR         MDEXIT    ENDSR
      /EJECT
     CSR         SARVGN    BEGSR
      *================================================================
      * Get Analytical Accounting - MIDAS Modules  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSA     KLIST
     C                     KFLD           BGMODS           Modules
      * Move fields to key list
     C                     MOVE *BLANK    BGMODS           Modules
     C                     MOVEL'MMOD'    BGMODS           Modules
     C           KRSSA     CHAIN@BGREC8              90    *
      * Data record not found
     C   90                MOVEL'USR0096' W0RTN   7
     C           *IN90     IFEQ '0'
      * USER: Process Data record
      * CASE: DB1.Analytical Accounting is Yes
     C           BGN0ST    IFEQ 'Y'                        *IF
     C                     MOVEL'Y'       WUN0ST           Analytical Acco
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL'N'       WUN0ST           Analytical Acco
     C                     END                             *FI
     C                     END
      *================================================================
     CSR         SAEXIT    ENDSR
      /EJECT
     CSR         SBRVGN    BEGSR
      *================================================================
      * Check Profit Centres Used - General Ledger Details  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSB     KLIST
     C                     KFLD           BKGNLG           General Ledger
      * Move fields to key list
     C                     MOVE *BLANK    BKGNLG           General Ledger
     C                     MOVEL'GELR'    BKGNLG           General Ledger
     C           KRSSB     CHAIN@BKREEC              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR0199' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SBEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELBKPRCU    WUPRCU           Profit Centres
     C                     END
      *================================================================
     CSR         SBEXIT    ENDSR
      /EJECT
     CSR         SCRVGN    BEGSR
      *================================================================
      * Get 'Window required' ind - MIDAS Modules  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSC     KLIST
     C                     KFLD           BGMODS           Modules
      * Move fields to key list
     C                     MOVE *BLANK    BGMODS           Modules
     C                     MOVEL'MMOD'    BGMODS           Modules
     C           KRSSC     CHAIN@BGREC8              90    *
      * Data record not found
     C   90                MOVEL'USR0096' W0RTN   7
     C           *IN90     IFEQ '0'
      * USER: Process Data record
      * CASE: DB1.Window processing requir. is Yes
     C           BGWDPR    IFEQ 'Y'                        *IF
     C                     MOVEL'Y'       WUWDPR           Window processi
     C                     END                             *FI
     C                     END
      *================================================================
     CSR         SCEXIT    ENDSR
      /EJECT
     CSR         Y0SET     BEGSR
      *================================================================
      * Set cursor by *SET CURSOR data
      *================================================================
      *================================================================
     CSR         Y0EXIT    ENDSR
      /EJECT
     CSR         Y1SET     BEGSR
      *================================================================
      * Set cursor by *SET CURSOR data
      *================================================================
      *================================================================
     CSR         Y1EXIT    ENDSR
      /EJECT
     CSR         Y8TST     BEGSR
      *================================================================
      * Test cursor
      *================================================================
     C           @#DFMT    IFEQ '#RCDKEY'
      * KEY Screen
     C                     Z-ADD@#RWCL    ZINPOS  50
     C           ZINPOS    DIV  256       W0CRW
     C                     MVR            W0CCL
     C                     END
     C           @#DFMT    IFEQ '#RCDDTL1'
      * DETAIL Screen
     C                     Z-ADD@#RWCL    ZINPOS  50
     C           ZINPOS    DIV  256       W0CRW
     C                     MVR            W0CCL
     C                     END
      *================================================================
     CSR         Y8EXIT    ENDSR
      /EJECT
     CSR         Y9CLR     BEGSR
      *================================================================
      * Clear *SET CURSOR data
      *================================================================
      *================================================================
     CSR         Y9EXIT    ENDSR
      /EJECT
     CSR         ZASNMS    BEGSR
      *================================================================
      * Send message to program's message queue
      *================================================================
      * Send if first error message or not an error message
     C           ZAMSTP    IFNE *BLANK
     C           ZAFSMS    ORNE 'N'
     C           ZAMSTP    IFEQ *BLANK
      * Signal first error message sent
     C                     MOVEL'N'       ZAFSMS
     C                     END
     C           ZAPGMQ    IFEQ *BLANK
     C                     MOVEL##PGM     ZAPGMQ
     C                     END
      * If no message file specified, use default
     C           ZAMSGF    IFEQ *BLANK
     C                     MOVELZADFMF    ZAMSGF
     C                     END
     C                     CALL 'Y2SNMGC'
     C                     PARM           ZAPGMQ 10        Program queue
     C                     PARM           ZAPGRL  5        Rel queue
     C                     PARM           ZAMSID  7        Message ID
     C                     PARM           ZAMSGF 10        Message file
     C                     PARM           ZAMSDA132        Message data
     C                     PARM           ZAMSTP  7        Message type
     C                     END
      * Clear all fields for default mechanism next time
     C                     MOVEL*BLANK    ZAPGMQ
     C                     MOVEL*BLANK    ZAPGRL
     C                     MOVEL*BLANK    ZAMSID
     C                     MOVEL*BLANK    ZAMSGF
     C                     MOVEL*BLANK    ZAMSDA
     C                     MOVEL*BLANK    ZAMSTP
      *================================================================
     CSR         ZAEXIT    ENDSR
      /EJECT
     CSR         ZHHPKY    BEGSR
      *================================================================
      * Display HELP text
      *================================================================
      * Signal help request
     C                     MOVEL'Y'       W0HLP   1
      *
      * Extract cursor row and column
     C           @#RWCL    DIV  256       ZHCSRW  50       Row
     C                     MVR            ZHCSCL  50       Column
      *
      * Save cursor position for redisplay
     C                     Z-ADDZHCSRW    ZZCSRW  30       Row
     C                     Z-ADDZHCSCL    ZZCSCL  30       Column
      *
      *
     C                     CALL 'YDDSHPR'
     C                     PARM ##PGM     W0HPMB 10        Help text sourc
     C                     PARM *BLANK    YYHPFL 10        Help text file
     C                     PARM *BLANK    YYHPLB 10        Help text libra
     C                     PARM           W0RTN   7
     C                     PARM '*START'  YYHLVN 10        Help label
     C                     PARM '*NORMAL' YYUSOP 10        Options
     C                     PARM ZHCSRW    YYRW    50       Row
     C                     PARM ZHCSCL    YYCL    50       Column
     C                     PARM 1         YYLGCT  50       # of grps
     C                     PARM W0GRP     YYLGVN 10        Label grps
      *
      * Clear set cursor DDS indicator
     C  N94                MOVEL'OFF'     WCSRLC
     C  N94                SETON                     94    *
      *================================================================
     CSR         ZHEXIT    ENDSR
      /EJECT
     CSR         ZXEXPG    BEGSR
      *================================================================
      * Cancel and exit from key screen
      *================================================================
      * USER: Exit program processing
      * 00/Copy member SD0361EEPP - Customer Fees Detail  *
     C/COPY WNCPYSRC,SD0361EEPP
      * F3 processing.
      * CASE: KEY.*CMD key is *Exit
     C           *IN03     IFEQ '1'                        *IF
     C                     MOVEL'Y2U9999' P0RTN            *Return code
     C                     EXSR ZYEXPG
     C                     END                             *FI
     C                     MOVEL*BLANK    P0RTN
     C                     EXSR ZYEXPG
      *================================================================
     CSR         ZXEXIT    ENDSR
      /EJECT
     CSR         ZYEXPG    BEGSR
      *================================================================
      * Exit program: Direct
      *================================================================
      * Terminate program
     C                     SETON                     LR
      *
      * Exit program
     C                     RETRN
      *
      *================================================================
     CSR         ZYEXIT    ENDSR
      /EJECT
     CSR         ZZINIT    BEGSR
      *================================================================
      * Initialisation
      *================================================================
     C           W0ICL     IFEQ *BLANK
     C                     MOVEL'Y'       W0ICL   1        *Initial call
     C                     ELSE
     C                     MOVEL'N'       W0ICL
     C                     END
     C                     MOVE *BLANK    P0RTN
     C                     MOVE *BLANK    W0RTN   7
     C                     MOVEL*BLANK    W0RSL   1
     C                     MOVEL*BLANK    W0RSF   1
     C                     MOVEL*ZEROS    W0RTW   90
     C                     MOVEL'400'     W0ENV   3
      * Setup job date/time
      *
     C                     Z-ADDUDATE     ##JDT
      * Set century digit (If YY prior to 1940 treat as 20YY)
     C           ##JYY     IFLT 40
     C                     Z-ADD1         ##JCC
     C                     ELSE
     C                     Z-ADD0         ##JCC
     C                     END
     C                     TIME           ##JTM
      * Update screen time
     C                     TIME           ##TME   60
      * Obtain default message file
     C           *NAMVAR   DEFN Y2MGFLA   ZADFMF 10
     C                     IN   ZADFMF
      * Define work field Window processing requir.
     C                     MOVEL*BLANK    WUWDPR  1
      * Define work field Customer Service Fees on
     C                     MOVEL*BLANK    WUKKST  1
      * Define work field Display Settlement A/C
     C                     MOVEL*BLANK    WUDSAC  1
      * Define work field Display Settlement Curr
     C                     MOVEL*BLANK    WUDSCU  1
      * Define work field Display Profit Centre
     C                     MOVEL*BLANK    WUDPCT  1
      * Define work field Display Settlement branch
     C                     MOVEL*BLANK    WUDSSB  1
      * Define work field DSP Prft Cntr No A/c Chgs
     C                     MOVEL*BLANK    WUW3ST  1
      * Define work field DSP Prft Cntr - Hold Mail
     C                     MOVEL*BLANK    WUW4ST  1
      * Define work field Midas Run Date
     C                     MOVEL*BLANK    WUMRDT  7
      * Define work field Run day number
     C                     Z-ADD*ZERO     WURDNB  50
      * Define work field Set Up Complete
     C                     MOVEL*BLANK    WUSUC   1
      * Define work field Date format flag
     C                     MOVEL*BLANK    WUDFF   1
      * Define work field Multi-branching Indicator
     C                     MOVEL*BLANK    WUMBIN  1
      * Define work field SAR number field
     C                     MOVEL*BLANK    WUSARN  6
      * Define work field Access Pgm Return Code
     C                     MOVEL*BLANK    WUAPRC  7
      * Define work field Access obj dummy DS (76)
     C                     MOVEL*BLANK    WUFDY  76
      * Define work field SAR S01464
     C                     MOVEL*BLANK    WURTST  1
      * Define work field Analytical Accounting
     C                     MOVEL*BLANK    WUN0ST  1
      * Define work field Profit Centres Used
     C                     MOVEL*BLANK    WUPRCU  1
      * Flag no *SET CURSOR in the program
     C                     MOVE 'N'       YSETCS  1
     C                     MOVE *BLANK    WCSRLC  3
      * Signal first error message outstanding
     C                     MOVEL'Y'       ZAFSMS  1
      * Define *Synon program work fields
     C                     MOVEL*BLANKS   W0CFL  10        *Cursor field
     C                     Z-ADD*ZEROS    W0CRW   50       *Cursor row
     C                     Z-ADD*ZEROS    W0CCL   50       *Cursor column
      * Move main file information to JOB context
     C                     MOVE @1FFL     ZZFFL  10        Main file name
     C                     MOVE @1FLB     ZZFLB  10        Main file lib
     C                     MOVE @1FMB     ZZFMB  10        Main file mbr
     C                     MOVE ZZFFL     @1FFL  10
     C                     MOVE ZZFLB     @1FLB  10
     C                     MOVE ZZFMB     @1FMB  10
     C                     CALL 'Y2QLVNR'
     C                     PARM           ZZFFL  10
     C                     PARM           ZZFLB  10
     C                     PARM           ZZFQL  21        LIBRARY/FILE
      * Open files
     C                     OPEN SD0361E#
     C                     OPEN SDCFCDL1
     C                     OPEN SDMMODL1
     C                     OPEN SDGELRL1
     C                     MOVEL'N'       W0PMT   1
     C                     MOVEL*BLANK    W0GRP   1
      * USER: Initialize program
      * Start of S01459
      * Remove creation parameters function
      * Remove last amend box function
      * SD0361E precompiler - Customer Fees Detail  *
      * End of S01459
      * Copyright Statement - Standard Functions  *
      * Get Rundate - Rundate  *
     C           *NAMVAR   DEFN           RUNDAT
     C                     IN   RUNDAT
     C                     MOVE MRDT      ##MRDT  7        RUN DATE
     C                     MOVE MRDT      WUMRDT
     C                     MOVE RDNB      WURDNB           RUNDAY NO.
     C                     MOVE SUC       WUSUC            SET UP COMPLT
     C                     MOVE DFF       WUDFF            DTE FMT FLAG
     C                     MOVE MBIN      WUMBIN           MULTI BR. IND
      * Start of S01464
     C                     MOVEL'S01464'  WUSARN           SAR number fiel
      * SAR switched on check - Standard Functions  *
     C                     CALL 'AOSARDR0'             90  SAR switched on
     C           WUAPRC    PARM WUAPRC    WQ0001  7        Access Pgm Retu
     C                     PARM '*VERIFY' WQ0002  7        Option for ACCO
     C           WUSARN    PARM WUSARN    WQ0003  6        SAR number fiel
     C                     PARM WUFDY     WQ0004 76        Access obj dumm
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'AOSARDR0'W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Check if S01464 is present.
      * CASE: WRK.Access Pgm Return Code is AP Error
     C           WUAPRC    IFEQ '*EMPTY'                   *IF
     C           WUAPRC    OREQ '*EOF'
     C           WUAPRC    OREQ '*ERROR'
     C           WUAPRC    OREQ '*CLOSE'
     C           WUAPRC    OREQ '*OPEN'
     C           WUAPRC    OREQ '*NRF'
     C                     MOVEL'N'       WURTST           SAR S01464
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL'Y'       WURTST           SAR S01464
     C                     END                             *FI
      * End of S01464
      * Start CAC001
      * Get Analytical Accounting - MIDAS Modules  *
     C                     EXSR SARVGN
      * End CAC001
      * Check Profit Centres Used - General Ledger Details  *
     C                     EXSR SBRVGN
      * 'Profit Centre' will not be displayed, if 'Profit Centre Used'
      * on Generel Ledger ICD is 'N', or Analytical Accounting is 'ON'
      * Disp Profit Centre, or PCA Profit Centre fields ? (Start CAC001)
      * CASE: WRK.Analytical Accounting is Yes
     C           WUN0ST    IFEQ 'Y'                        *IF
     C                     MOVEL'N'       WUDPCT           Display Profit
      * CASE: WRK.Profit Centres Used is Yes
     C           WUPRCU    IFEQ 'Y'                        *IF
     C                     MOVEL'Y'       WUW3ST           DSP Prft Cntr N
     C                     MOVEL'Y'       WUW4ST           DSP Prft Cntr -
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL'N'       WUW3ST           DSP Prft Cntr N
     C                     MOVEL'N'       WUW4ST           DSP Prft Cntr -
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL'N'       WUW3ST           DSP Prft Cntr N
     C                     MOVEL'N'       WUW4ST           DSP Prft Cntr -
      * End CAC001
      * CASE: WRK.Profit Centres Used is Yes
     C           WUPRCU    IFEQ 'Y'                        *IF
     C                     MOVEL'Y'       WUDPCT           Display Profit
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL'N'       WUDPCT           Display Profit
     C                     END                             *FI
     C                     END                             *FI
      * Settlement Branch will not be displayed
      * in single branch environment
      * Display Settlement Branch ?
      * CASE: WRK.Multi-branching Indicator is Multi-branched
     C           WUMBIN    IFEQ 'Y'                        *IF
     C                     MOVEL'Y'       WUDSSB           Display Settlem
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL'N'       WUDSSB           Display Settlem
     C                     END                             *FI
      * Get 'Window required' ind - MIDAS Modules  *
     C                     EXSR SCRVGN
      * Check to see if the Customer Service Fees feature is present.
     C                     MOVEL'S01423'  WUSARN           SAR number fiel
      * SAR switched on check - Standard Functions  *
     C                     CALL 'AOSARDR0'             90  SAR switched on
     C           WUAPRC    PARM WUAPRC    WQ0005  7        Access Pgm Retu
     C                     PARM '*VERIFY' WQ0006  7        Option for ACCO
     C           WUSARN    PARM WUSARN    WQ0007  6        SAR number fiel
     C                     PARM WUFDY     WQ0008 76        Access obj dumm
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'AOSARDR0'W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * If the Customer Service Fees feature is present.
      * CASE: WRK.Access Pgm Return Code is AP Error
     C           WUAPRC    IFEQ '*EMPTY'                   *IF
     C           WUAPRC    OREQ '*EOF'
     C           WUAPRC    OREQ '*ERROR'
     C           WUAPRC    OREQ '*CLOSE'
     C           WUAPRC    OREQ '*OPEN'
     C           WUAPRC    OREQ '*NRF'
     C                     MOVEL'N'       WUKKST           Customer Servic
     C                     MOVEL'N'       WUDPCT           Display Profit
      * Start of S01464
     C                     MOVEL'N'       WUDSAC           Display Settlem
     C                     MOVEL'N'       WUDSCU           Display Settlem
     C                     MOVEL'N'       WUDSSB           Display Settlem
      * End of S01464
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL'Y'       WUKKST           Customer Servic
     C                     END                             *FI
      * Start of S01464
      * CASE:
      *  - c1 AND c2
      *   |- c1    : WRK.SAR S01464 is Present
      *   |- c2    : WRK.Customer Service Fees on is Not Present
      *   '-
     C                     MOVEL'0'       Y0CX01  1
     C           WURTST    IFEQ 'Y'                        *IF
     C           WUKKST    IFEQ 'N'                        *IF
     C                     MOVEL'1'       Y0CX01
     C                     END                             *FI
     C                     END                             *FI
     C           Y0CX01    IFEQ '1'                        *IF
     C                     MOVEL'Y'       WUDSAC           Display Settlem
     C                     MOVEL'Y'       WUDSCU           Display Settlem
      * Display Settlement Branch ?
      * CASE: WRK.Multi-branching Indicator is Multi-branched
     C           WUMBIN    IFEQ 'Y'                        *IF
     C                     MOVEL'Y'       WUDSSB           Display Settlem
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL'N'       WUDSSB           Display Settlem
     C                     END                             *FI
     C                     END                             *FI
      * End of S01464
      * Data struct for Cust Fees - Customer Fees Detail  *
      * 00/Copy member SD0361EFPG - Customer Fees Detail  *
      * 00/Copy member SD0361EEPG - Customer Fees Detail  *
      * 00/Copy member SD0361EIPG - Customer Fees Detail  *
      * 00/Copy member SD0361ECPG - Customer Fees Detail  *
     C/COPY WNCPYSRC,SD0361ECPG
      * 00/Copy member SD0361EOPG - Customer Fees Detail  *
      *                                                                   CSD008
      ** Initialize LDA                                                   CSD008
      *                                                                   CSD008
     C           *NAMVAR   DEFN           LDA                             CSD008
     C           *LOCK     IN   LDA                                       CSD008
     C                     MOVE *BLANKS   DBFILE                          CSD008
     C                     MOVE *BLANKS   DBKEY                           CSD008
     C                     MOVE *BLANKS   DBPGM                           CSD008
     C                     MOVE 'SD0361E' DBPGM                           CSD008
     C                     OUT  LDA                                       CSD008
      *                                                                   CSD008
      ** Call access program AOSARDR0- determine if CSD008 is installed   CSD008
      *                                                                   CSD008
     C                     CALL 'AOSARDR0'             90                 CSD008
     C           WUAPRC    PARM '       ' WQ0001                          CSD008
     C                     PARM '*VERIFY' WQ0002                          CSD008
     C           WUSARN    PARM 'CSD008'  WQ0003                          CSD008
     C                     PARM WUFDY     WQ0004                          CSD008
      *                                                                   CSD008
     C           *IN90     IFEQ '1'                                       CSD008
      *                                                                   CSD008
      ** Call to program ended in error                                   CSD008
      *                                                                   CSD008
     C                     MOVEL'Y2U0032' W0RTN                           CSD008
     C                     MOVEL*BLANKS   W0CLPG 10                       CSD008
     C                     MOVEL'AOSARDR0'W0CLPG                          CSD008
      *                                                                   CSD008
      ** Send message '*Error occured on CALL...'                         CSD008
      *                                                                   CSD008
     C                     MOVEL'Y2U0032' ZAMSID                          CSD008
     C                     MOVEL'Y2USRMSG'ZAMSGF                          CSD008
     C                     MOVELW0CLPG    ZAMSDA                          CSD008
     C                     EXSR ZASNMS                                    CSD008
     C                     ENDIF                                          CSD008
      *                                                                   CSD008
      ** Handle Database Error.                                           CSD008
      *                                                                   CSD008
     C           WUAPRC    IFNE *BLANKS                                   CSD008
     C           WUAPRC    ANDNE'*NRF   '                                 CSD008
     C           *LOCK     IN   LDA                                       CSD008
     C                     MOVE 'SCSARDPD'DBFILE                          CSD008
     C                     MOVEL'CSD008'  DBKEY            *************  CSD008
     C                     Z-ADD001       DBASE            * DBERR 001 *  CSD008
     C                     MOVEL'SD0361E' DBPGM            *************  CSD008
     C                     OUT  LDA                                       CSD008
     C                     EXSR *PSSR                                     CSD008
     C                     ENDIF                                          CSD008
      *                                                                   CSD008
      ** CSD008 is installed                                              CSD008
      *                                                                   CSD008
     C           WUAPRC    IFEQ *BLANKS                                   CSD008
     C                     MOVE 'Y'       CSD008  1                       CSD008
     C                     MOVEL'1'       *IN80                           CSD008
     C                     ELSE                                           CSD008
     C                     MOVEL'0'       *IN80                           CSD008
     C                     MOVE 'N'       CSD008                          CSD008
     C                     ENDIF                                          CSD008
      *================================================================
     CSR         ZZEXIT    ENDSR
      /EJECT
     CSR         *PSSR     BEGSR
      *****************************************************************
      *                                                               *
      * *PSSR  - Program exception error routine                      *
      *          Called automatically if a program error occurs,      *
      *          or directly by the program code using EXSR.          *
      *          This subroutine DUMPs the program just once.         *
      *                                                               *
      *****************************************************************
      *
      * Core function specific processing.
      *
     C/COPY WNCPYSRC,SD0361EPSC
      *
      * Start of PSSR user point.
      *
     C/COPY WNCPYSRC,SD0361EPS1
      *
      * Standard Midas PSSR processing.
      *
     C/COPY SDCPYSRC,SDPSSRINT
      *
      * End of PSSR user point.
      *
     C/COPY WNCPYSRC,SD0361EPS2
      *
      *================================================================
     CSR                   ENDSR
      *================================================================
     O/COPY WNCPYSRC,SD0361EOPG
** CPY@     : Copyright notice for inclusion in all programs
(c) Finastra International Limited 2001
