     H        1   Y
      *****************************************************************
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas SD Region limits enquiry')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  SD0461E - Midas SD Region Limts Dsp Rec                      *
      *                                                               *
      *  Function:  This program allows the user to enquire about     *
      *             Region Limts Dsp Rec details                      *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      *  Last Amend No. CSD003             Date 01Jul99               *
      *  Prev Amend No. S01459             Date 01Jul99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
     F*                BHF718               DATE 01OCT90              *
     F*                LN0554               DATE 03AUG90              *
     F*                S01117               DATE 03AUG90              *
     F*                S01212               DATE 14SEP89              *
      *                                                               *
      *-------------------------------------------------------------- *
      *                                                               *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - Program removed from SD model.                    *
      *  S01459 - Addition of Midas Headerbox.                        *
     F* BHF718 - ADD REGION NAME TO SCREEN                            *
     F* LN0554 - RECOMPILE OVER NEW DISPLAY FILE                      *
     F* S01117 - RELEASE 10 ENHANCEMENTS                              *
     F* S01212 - /COPY AND WINDOW PROCESSING                          *
      *                                                               *
      *****************************************************************
     F/COPY WNCPYSRC,SD0461EFPG
     FSD0461E#CF  E                    WORKSTN                        UC
     F                                              KINFDS INFDS#
     F                                              KINFSR *PSSR
      * DSP: Midas SD Region Limts Dsp Rec
      *
     FSDRGLML1IF  E           K        DISK                           UC
     F                                              KINFDS INFDS1
     F                                              KINFSR *PSSR
      * RTV : Midas SD Region limits retrieval
      *
     FSDREGNL1IF  E           K        DISK                           UC
     F                                              KINFDS ID0001
     F                                              KINFSR *PSSR
      * RTV : Midas SD Region codes retrieval
      *
     FSDMMODL1IF  E           K        DISK                           UC
     F                                              KINFDS ID0002
     F                                              KINFSR *PSSR
      * RTV : Midas SD Midas module flags retrieval
      *
     E* Description     : Copyright notice for inclusion in all programs
     E*
     E********************************************************************
     E                    CPY@    1   1 80               Copyright array
     E/COPY WNCPYSRC,SD0461EEPG
     I*
     I* Description     : Copyright notice for inclusion in all programs
     I*
     I/COPY QWINDSRC,SD0460GDTA
     I*00/Copy Member SD0461E   Initialise Program I-Spec
     I/COPY WNCPYSRC,SD0461EIPG
      /EJECT
      * Data structures:
     IPGMDS     ESDSY2PGDSP
      * Program data structure
     IJBDTTM      DS
      * Job date/time
     I                                        1   70##JDT
     I                                        1   10##JCC
     I                                        2   30##JYY
     I                                        4   50##JMM
     I                                        6   70##JDD
     I                                        8  130##JTM
     I                                        8   90##JHH
     I                                       10  110##JNN
     I                                       12  130##JSS
      * ABO DEFINE LARGE STRING FOR CL CMD
     IYARTCM      DS                            512
     I                                        1   1 DUMMY1
     IINFDS#    E DSY2I#DSP
      * Display file information data structure
      *
     IINFDS1    E DSY2I1DSP
      * File information data structure
      *
     IA@CPY       DS
     I* Copyright array
     I                                        1  80 CPY@
     IRUNDAT      DS
     I                                        1   7 MRDT
     I                                    P   8  100RDNB
     I                                       11  11 SUC
     I                                       12  12 DFF
     I                                       13  13 MBIN
     IID0001      DS                            528
      * File information data structure
      *
     IID0002      DS                            528
      * File information data structure
      *
      /EJECT
      * Parameter declarations
     IP1PARM      DS                              6
      * KEY: Midas SD Region limits retrieval
      * I : MAP Region Code
     I                                        1   2 P1RGCD
      * I : MAP Level
     I                                        3   3 P1LEVL
      * I : MAP Branch/Company Code
     I                                        4   6 P1BCCD
      /EJECT
      *****************************************************************
      * Entry parameters
     C           *ENTRY    PLIST
     C                     PARM           P0RTN   7
     C                     PARM           P1PARM           KEY: Region Lim
      *****************************************************************
      * Initialize
     C                     EXSR ZZINIT
      *
      * Check passed parameters
     C                     EXSR FACKPM
      * Perform once if all passed, else repeat
     C           W0RPT     DOUEQ'N'
      * Display and process key screen
     C                     EXSR BADSKY
     C                     END
      * Terminate program
     C                     EXSR ZXEXPG
      *****************************************************************
      /EJECT
     CSR         BADSKY    BEGSR
      *================================================================
      * Display and process key screen
      *================================================================
      * Initialize key screen
     C                     EXSR MDIZ#K
      * Bypass first display of key screen is possible
     C                     MOVEL'Y'       W0BYP   1
      * Signal start of transaction
     C                     MOVEL'Y'       W0TRN   1
      *
     C           W0TRN     DOWEQ'Y'
     C           W0TRN     OREQ 'K'
      * Ensure transaction continues (if reset)
     C                     MOVEL'Y'       W0TRN   1
      * Conduct screen conversation
     C           W0TRN     DOWEQ'Y'
      * Is bypass key screen still viable?
     C           W0BYP     IFEQ 'Y'
     C           #1RGCD    IFEQ *BLANK                     Region Code
     C           #1LEVL    OREQ *BLANK                     Level
     C           #1BCCD    OREQ *BLANK                     Branch/Company
      * One or more key fields is blank
     C           *IN05     OREQ '1'
      * HOME: Reset screen fields
     C                     MOVEL'N'       W0BYP
     C                     END
     C                     END
      * Bypass key screen
     C           W0BYP     IFNE 'Y'
      * Display key screen
     C                     EXSR BBEXFM
     C                     END
      * Cancel key screen bypass
     C                     MOVEL'N'       W0BYP
      * Process response to key screen
      * Cancel & exit program
     C   03                CAS            ZXEXPG
      * HOME: Reset screen fields
     C   05                CAS            BDHMKY
      * Process key screen input
     C                     CAS            BEPRKY
     C                     END
     C           W0TRN     DOWEQ'R'
     C                     MOVEL'Y'       W0TRN
     C                     EXSR BEPRKY
     C                     END
      *
     C                     END
     C                     END
      *================================================================
     CSR         BAEXIT    ENDSR
      /EJECT
     CSR         BBEXFM    BEGSR
      *================================================================
      * Display key screen and process HELP requests
      *================================================================
      * Set screen conditioning indicators
     C                     EXSR GADSAK
      * Update screen time
     C                     TIME           ##TME
     C           W0HLP     DOUEQ'N'
     C                     MOVEL'N'       W0HLP   1
     C                     MOVE *IN25     HELP25  1
     C                     MOVE *ALL'0'   ##OFF  30
     C                     MOVEA##OFF     *IN,1
     C                     MOVE HELP25    *IN25
      * Set cursor by *SET CURSOR data
     C           YSETCS    IFEQ 'Y'
     C                     EXSR Y0SET
     C                     END
     C                     WRITE#MSGCTL
     C                     WRITE#CMDTXT1
     C                     EXFMT#RCDKEY
      * Enable PUTOVR
     C                     SETON                     86
      * Test cursor
     C                     EXSR Y8TST
      * Clear set cursor DDS indicator
     C           WCSRLC    IFEQ 'OFF'
     C                     SETOF                     94    *
     C                     END
     C                     MOVE *BLANK    WCSRLC
      * If help requested, display help text
     C   25                EXSR ZHHPKY
     C                     END
      * Update job time
     C                     TIME           ##JTM
      * Clear messages from program message queue
     C                     CALL 'Y2CLMSC'
     C                     PARM ##PGM     ZAPGMQ 10
     C                     PARM '*SAME'   ZAPGRL  5
      * Reset first message only flag
     C                     MOVEL'Y'       ZAFSMS  1      99*
     C           YSETCS    IFEQ 'Y'
     C                     EXSR Y9CLR
     C                     END
      *================================================================
     CSR         BBEXIT    ENDSR
      /EJECT
     CSR         BDHMKY    BEGSR
      *================================================================
      * Process HOME key
      *================================================================
     C                     MOVEL'N'       W0TRN
      *================================================================
     CSR         BDEXIT    ENDSR
      /EJECT
     CSR         BEPRKY    BEGSR
      *================================================================
      * Process key screen input
      *================================================================
      * Initialise detail screen
     C                     EXSR MAIZ#1
      * Validate key fields
     C                     EXSR BFVLKY
     C           *IN99     CABEQ'1'       BEEXIT
      * Check for existing record
     C           KRTV      KLIST
     C                     KFLD           DYRGCD           Region Code
     C                     KFLD           DYLEVL           Level
     C                     KFLD           DYBCCD           Branch/Company
      * Setup key
     C                     MOVEL#1RGCD    DYRGCD           Region Code
     C                     MOVEL#1LEVL    DYLEVL           Level
     C                     MOVEL#1BCCD    DYBCCD           Branch/Company
     C           KRTV      CHAIN@DYREHQ              9091  *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     SETON                     993132*
     C                     SETON                     33    *
     C                     GOTO BEEXIT
     C                     END                             FI 91
      *
      * If record does not exist, then signal error
     C           *IN90     IFEQ '1'
     C                     SETON                     993132*
     C                     SETON                     33    *
      * Send message 'Region Limits          NF'
     C                     MOVEL'USR0663' ZAMSID
     C                     EXSR ZASNMS
     C                     ELSE
     C                     EXSR MBFL#1
      * CALC: Detail screen function fields
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/Copy Member SD0461ESFF - Region Limits  *
     C*00/Copy Member SD0461E   Calculate Detail Func Fld
     C/COPY WNCPYSRC,SD0461ESFF
     C                     END                             *FI
      * USER: Load detail screen from DBF record
      * Start of Fix BHF718
      * Get region code name - Region Codes  *
     C                     EXSR SARVGN
     C                     MOVELWURGNM    #DFLDT           Field Text
      * End of Fix BHF718
      * Convert File Dates to Screen Dates
     C                     EXSR UASUBR                     Convert File Da
      * Display Level and Branch/Company Code?
      * CASE: WRK.Multi-branching Indicator is Multi-branched
     C           WUMBIN    IFEQ 'Y'                        *IF
      * Only Display if not at System Level
      * CASE: DB1.Branch/Company Code is Is System
     C           DYBCCD    IFEQ 'SYS'                      *IF
     C                     MOVEL'N'       WUDLBC           Display Level &
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL'Y'       WUDLBC           Display Level &
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL'N'       WUDLBC           Display Level &
     C                     END                             *FI
      * Output *EXPIRED* If Limit is Past it's Expiry Date
     C                     EXSR UBSUBR                     Output *EXPIRED
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/Copy Member SD0461ELDS - Region Limits  *
     C*00/Copy Member SD0461E   Load Detail Screen
     C/COPY WNCPYSRC,SD0461ELDS
     C                     END                             *FI
     C                     END
      *
     C   99                GOTO BEEXIT
      * No error: Display and process details
     C                     EXSR CADSDA
      *
      *================================================================
     CSR         BEEXIT    ENDSR
      /EJECT
     CSR         BFVLKY    BEGSR
      *================================================================
      * Validate key fields
      *================================================================
      * Select existing record
     C                     EXSR VACKRL
      * Check relations
      * Check reference to Region Codes
     C                     EXSR VBCKRL
     C           W0RTN     IFNE *BLANK
     C                     SETON                     99    *
     C                     END
     C           W0RTN     IFNE *BLANK
     C                     MOVEL*BLANK    W0RTN
     C                     SETON                     9931  *
     C                     END
      * USER: Validate key screen
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/Copy Member SD0461EVKS - Region Limits  *
     C*00/Copy Member SD0461E   Validate Key Screen
     C/COPY WNCPYSRC,SD0461EVKS
     C                     END                             *FI
      * Region Code required
     C           #1RGCD    IFEQ *BLANK                     IF
     C                     SETON                     9931  *
      * Send message '*Value required'
     C                     MOVEL'Y2U0001' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     END                             FI
      * Level required
     C           #1LEVL    IFEQ *BLANK                     IF
     C                     SETON                     9932  *
      * Send message '*Value required'
     C                     MOVEL'Y2U0001' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     END                             FI
      * Branch/Company Code required
     C           #1BCCD    IFEQ *BLANK                     IF
     C                     SETON                     9933  *
      * Send message '*Value required'
     C                     MOVEL'Y2U0001' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     END                             FI
      *================================================================
     CSR         BFEXIT    ENDSR
      /EJECT
     CSR         CADSDA    BEGSR
      *================================================================
      * Display and process detail screen
      *================================================================
      * Conduct detail screen conversation
      * - repeat until screen control flag is reset:
     C           W0TRN     DOWEQ'Y'
      * Display detail screen
     C                     EXSR CBEXFM
      * Process response to detail screen
     C   03                CAS            ZXEXPG
      * HOME: Reset screen fields
      * Process detail screen input
      * Redisplay previous screen
     C   12                CAS            CCDSPV
      * HOME: Reset screen fields
     C   05                CAS            CCDSPV
      * Process key screen input
     C                     CAS            CFPRSC
     C                     END
      *
     C                     END
      *================================================================
     CSR         CAEXIT    ENDSR
      /EJECT
     CSR         CBEXFM    BEGSR
      *================================================================
      * Display screen and process HELP requests
      *================================================================
      * Set screen conditioning indicators
     C                     EXSR GBDSAD
      * Update screen time
     C                     TIME           ##TME
     C           W0HLP     DOUEQ'N'
     C                     MOVEL'N'       W0HLP   1
     C                     MOVE *IN25     HELP25  1
     C                     MOVE *ALL'0'   ##OFF  30
     C                     MOVEA##OFF     *IN,1
     C                     MOVE HELP25    *IN25
      * Set cursor by *SET CURSOR data
     C           YSETCS    IFEQ 'Y'
     C                     EXSR Y1SET
     C                     END
     C                     WRITE#MSGCTL
     C                     WRITE#CMDTXT2
     C                     EXFMT#RCDDTL1
      * Enable PUTOVR
     C                     SETON                     86
      * Test cursor
     C                     EXSR Y8TST
      * Clear set cursor DDS indicator
     C           WCSRLC    IFEQ 'OFF'
     C                     SETOF                     94    *
     C                     END
     C                     MOVE *BLANK    WCSRLC
      * If help requested, display help text
     C   25                EXSR ZHHPKY
     C                     END
      * Update job time
     C                     TIME           ##JTM
      * Clear messages from program message queue
     C                     CALL 'Y2CLMSC'
     C                     PARM ##PGM     ZAPGMQ 10
     C                     PARM '*SAME'   ZAPGRL  5
      * Reset first message only flag
     C                     MOVEL'Y'       ZAFSMS  1      99*
     C           YSETCS    IFEQ 'Y'
     C                     EXSR Y9CLR
     C                     END
      *================================================================
     CSR         CBEXIT    ENDSR
      /EJECT
     CSR         CCDSPV    BEGSR
      *================================================================
      * Redisplay previous screen
      *================================================================
      * USER: Process key screen request
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/Copy Member SD0461EPKR - Region Limits  *
     C*00/Copy Member SD0461E   Process Key Screen Rqst
     C/COPY WNCPYSRC,SD0461EPKR
     C                     END                             *FI
     C                     MOVEL'USR0790' P0RTN            *Return code
     C                     EXSR ZYEXPG
     C   05                MOVEL'Y'       W0TRN
     C   12                MOVEL'K'       W0TRN
      *================================================================
     CSR         CCEXIT    ENDSR
      /EJECT
     CSR         CFPRSC    BEGSR
      *================================================================
      * Validate record
      *================================================================
      * Confirm/update is not deferred
     C                     MOVEL'N'       W0DCF   1
     C                     MOVEL'Y'       W0TRN
      * Validate details
     C                     EXSR DCVLDL
      * QUIT if error:
     C   99                GOTO CFEXIT
      * Defer confirm/update requested
     C           W0DCF     CABEQ'Y'       CFEXIT
      * Process record:
     C                     EXSR EBPR##
      *================================================================
     CSR         CFEXIT    ENDSR
      /EJECT
     CSR         DCVLDL    BEGSR
      *================================================================
      * Validate details
      *================================================================
      * CALC: Detail screen function fields
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/Copy Member SD0461ESFF - Region Limits  *
     C*00/Copy Member SD0461E   Calculate Detail Func Fld
     C/COPY WNCPYSRC,SD0461ESFF
     C                     END                             *FI
      * USER: Validate detail screen
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * CASE: WRK.Window processing requir. is Yes
     C           WUWDPR    IFEQ 'Y'                        *IF
      * WM call Window Manager - Window manager  *
     C/COPY WNCPYSRC,WN0481CCP1                                           S01408
     C***********          CALL 'WIND01'                                  S01212
     C                     CALL 'WN0010'                                  S01212
     C*********************PARM           ##PGM            Program        S01212
     C                     PARM ##PGM     UPGM   10        Program        S01212
     C*********************PARM *BLANK    FKEY    2        Function Key   S01212
     C                     PARM *BLANK    UFKEY   2        Function Key   S01212
     C*********************PARM           WUMEST           Action  S01212 S01229
     C*********************PARM           WUWMAC           Action  S01212 S01229
     C                     PARM 'E'       UACTCD  1        Action  S01212 S01229
     C                     PARM           DATA             Trans Data     S01212
     C                     PARM *BLANK    W0RTN            Return Code    S01212
     C                     PARM           SPARE 256        Spare Field    LN0355
      * WM Check Return
      * CASE: PAR.*Return code is *User QUIT requested
     C           W0RTN     IFEQ 'Y2U9999'                  *IF
     C                     MOVELW0RTN     P0RTN            *Return code
     C                     EXSR ZYEXPG
     C                     ELSE
      * CASE: PAR.*Return code is WN Window Error
     C           W0RTN     IFEQ 'USR0563'                  *IF
      * Send message 'WN Window Error'
     C                     MOVEL'USR0563' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO DCEXIT                     *QUIT
     C                     ELSE
      * CASE: PAR.*Return code is *DBF update error
     C           W0RTN     IFEQ 'Y2U0004'                  *IF
      * Send message 'WN Database Error'
     C                     MOVEL'USR0567' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO DCEXIT                     *QUIT
     C                     ELSE
      * CASE: PAR.*Return code is *Previous Screen
     C           W0RTN     IFEQ 'USR0790'                  *IF
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO DCEXIT                     *QUIT
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
      * 00/Copy Member SD0461EVSW - Region Limits  *
     C*00/Copy Member SD0461E   Validate Detail Scrn Wdw
     C/COPY WNCPYSRC,SD0461EVSW
     C                     END                             *FI
      * 00/Copy Member SD0461EVDS - Region Limits  *
     C*00/Copy Member SD0461E   Validate Detail Screen
     C/COPY WNCPYSRC,SD0461EVDS
     C                     END                             *FI
      *================================================================
     CSR         DCEXIT    ENDSR
      /EJECT
     CSR         EBPR##    BEGSR
      *================================================================
      * Process record:
      *================================================================
      * USER: Perform confirmed action
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/Copy Member SD0461EPCA - Region Limits  *
     C*00/Copy Member SD0461E   Perform Confrimed Action
     C/COPY WNCPYSRC,SD0461EPCA
     C                     END                             *FI
      * Quit if error signalled
     C   99                GOTO EBEXIT
      * USER: Process command keys
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/Copy Member SD0461EPCK - Region Limits  *
     C*00/Copy Member SD0461E   Process Command Keys
     C/COPY WNCPYSRC,SD0461EPCK
     C                     END                             *FI
      * Quit if error signalled
     C   99                GOTO EBEXIT
      * Restart program for next record
     C                     MOVEL'N'       W0TRN
      *================================================================
     CSR         EBEXIT    ENDSR
      /EJECT
     CSR         FACKPM    BEGSR
      *================================================================
      * Check passed parameters
      *================================================================
      * Is full key present?
     C           P1RGCD    IFEQ *BLANK                     Region Code
     C           P1LEVL    OREQ *BLANK                     Level
     C           P1BCCD    OREQ *BLANK                     Branch/Company
      * Not every key field passed - loop program
     C                     MOVEL'Y'       W0RPT   1
     C                     ELSE
      * Full key passed, so single shot program
     C                     MOVEL'N'       W0RPT
     C                     END
      *================================================================
     CSR         FAEXIT    ENDSR
      /EJECT
     CSR         GADSAK    BEGSR
      *================================================================
      * Set key screen conditioning indicators
      *================================================================
      *================================================================
     CSR         GAEXIT    ENDSR
      /EJECT
     CSR         GBDSAD    BEGSR
      *================================================================
      * Set detail screen conditioning indicators
      *================================================================
      * Protect key fields on detail screen
     C                     SETON                     88    *
     C                     MOVEL'0'       *IN79
     C           WUDLBC    IFEQ 'N'                        *IF
     C                     MOVEL'1'       *IN79
     C                     END                             *FI
     C                     MOVEL'0'       *IN78
     C           WUEXFX    IFEQ 'N'                        *IF
     C                     MOVEL'1'       *IN78
     C                     END                             *FI
     C                     MOVEL'0'       *IN77
     C           WUU2ST    IFEQ 'N'                        *IF
     C                     MOVEL'1'       *IN77
     C                     END                             *FI
     C                     MOVEL'0'       *IN76
     C           WUU3ST    IFEQ 'N'                        *IF
     C                     MOVEL'1'       *IN76
     C                     END                             *FI
     C                     MOVEL'0'       *IN75
     C           WUU4ST    IFEQ 'N'                        *IF
     C                     MOVEL'1'       *IN75
     C                     END                             *FI
      * Enable key screen
     C                     SETON                     87    *
      *================================================================
     CSR         GBEXIT    ENDSR
      /EJECT
     CSR         MAIZ#1    BEGSR
      *================================================================
      * Initialise record - except for key fields and "neither" paramete
      *================================================================
     C                     Z-ADD*ZERO     #1LCD            Last Change Dat
     C                     MOVEL*BLANK    #1TYLC           Type of Last Ch
     C                     Z-ADD*ZERO     #1FLED           FX Limit Expiry
     C                     Z-ADD*ZERO     #1FLRD           FX Limit Review
     C                     Z-ADD*ZERO     #1LLED           Lending Limit E
     C                     Z-ADD*ZERO     #1LLRD           Lending Limit R
     C                     Z-ADD*ZERO     #1FRED           FRA Expiry Date
     C                     Z-ADD*ZERO     #1FRRD           FRA Review Date
     C                     Z-ADD*ZERO     #1IRED           IRS Expiry Date
     C                     Z-ADD*ZERO     #1IRDT           IRS Review Date
     C                     MOVEL*BLANK    #DFLDT           Field Text
     C                     MOVEL*BLANK    #1FXLT           FX Limit Type
     C                     MOVEL*BLANK    #1LLTY           Lending Limit T
     C                     Z-ADD*ZERO     #1FLAM           FX Limit Amount
     C                     Z-ADD*ZERO     #1LLAM           Lending Limit A
     C                     MOVEL*BLANK    #DAFED           FX Expiry Date
     C                     MOVEL*BLANK    #DALED           LN Expiry Date
     C                     MOVEL*BLANK    #DAFRD           FX Review Date
     C                     MOVEL*BLANK    #DALRD           LN Review Date
     C                     MOVEL*BLANK    #1FLFQ           FX Limit Freque
     C                     MOVEL*BLANK    #1LLFR           Lending Limit F
     C                     Z-ADD*ZERO     #1FFDN           FX Frequency Da
     C                     Z-ADD*ZERO     #1LFDN           Lending Frequen
     C                     Z-ADD*ZERO     #1FRLA           FRA Limit Amoun
     C                     Z-ADD*ZERO     #1IRLM           IRS Limit Amoun
     C                     MOVEL*BLANK    #DARED           FRA Expiry Date
     C                     MOVEL*BLANK    #DAIED           IRS Expiry Date
     C                     MOVEL*BLANK    #DARRD           FRA Review Date
     C                     MOVEL*BLANK    #DAIRD           IRS Review Date
     C                     MOVEL*BLANK    #1FRFQ           FRA Review Freq
     C                     MOVEL*BLANK    #1IRFQ           IRS Review Freq
     C                     Z-ADD*ZERO     #1FRAD           FRA Frequency D
     C                     Z-ADD*ZERO     #1IFDN           IRS Frequency D
      *================================================================
     CSR         MAEXIT    ENDSR
      /EJECT
     CSR         MBFL#1    BEGSR
      *================================================================
      * Move @DYREHQ fields to screen
      *================================================================
     C                     Z-ADDDYLCD     #1LCD            Last Change Dat
     C                     MOVELDYTYLC    #1TYLC           Type of Last Ch
     C                     Z-ADDDYFLED    #1FLED           FX Limit Expiry
     C                     Z-ADDDYFLRD    #1FLRD           FX Limit Review
     C                     Z-ADDDYLLED    #1LLED           Lending Limit E
     C                     Z-ADDDYLLRD    #1LLRD           Lending Limit R
     C                     Z-ADDDYFRED    #1FRED           FRA Expiry Date
     C                     Z-ADDDYFRRD    #1FRRD           FRA Review Date
     C                     Z-ADDDYIRED    #1IRED           IRS Expiry Date
     C                     Z-ADDDYIRDT    #1IRDT           IRS Review Date
     C                     MOVELDYRGCD    #1RGCD           Region Code
     C                     MOVELDYLEVL    #1LEVL           Level
     C                     MOVELDYBCCD    #1BCCD           Branch/Company
     C                     MOVELDYFXLT    #1FXLT           FX Limit Type
     C                     MOVELDYLLTY    #1LLTY           Lending Limit T
     C                     Z-ADDDYFLAM    #1FLAM           FX Limit Amount
     C                     Z-ADDDYLLAM    #1LLAM           Lending Limit A
     C                     MOVELDYFLFQ    #1FLFQ           FX Limit Freque
     C                     MOVELDYLLFR    #1LLFR           Lending Limit F
     C                     Z-ADDDYFFDN    #1FFDN           FX Frequency Da
     C                     Z-ADDDYLFDN    #1LFDN           Lending Frequen
     C                     Z-ADDDYFRLA    #1FRLA           FRA Limit Amoun
     C                     Z-ADDDYIRLM    #1IRLM           IRS Limit Amoun
     C                     MOVELDYFRFQ    #1FRFQ           FRA Review Freq
     C                     MOVELDYIRFQ    #1IRFQ           IRS Review Freq
     C                     Z-ADDDYFRAD    #1FRAD           FRA Frequency D
     C                     Z-ADDDYIFDN    #1IFDN           IRS Frequency D
      *================================================================
     CSR         MBEXIT    ENDSR
      /EJECT
     CSR         MDIZ#K    BEGSR
      *================================================================
      * Initialize key screen
      *================================================================
     C                     MOVELP1RGCD    #1RGCD           Region Code
     C                     MOVELP1LEVL    #1LEVL           Level
     C                     MOVELP1BCCD    #1BCCD           Branch/Company
      * USER: Load key screen
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/Copy Member SD0461ELKS - Region Limits  *
     C*00/Copy Member SD0461E   Load Key Screen
     C/COPY WNCPYSRC,SD0461ELKS
     C                     END                             *FI
      *================================================================
     CSR         MDEXIT    ENDSR
      /EJECT
     CSR         SARVGN    BEGSR
      *================================================================
      * Get region code name - Region Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSA     KLIST
     C                     KFLD           A3RGCD           Region Code
      * Move fields to key list
     C                     MOVELDYRGCD    A3RGCD           Region Code
     C           KRSSA     CHAIN@A3REBX              90    *
      * Data record not found
     C   90                MOVEL'USR0065' W0RTN   7
     C           *IN90     IFEQ '0'
      * USER: Process Data record
      * PAR = DB1 By name
     C                     MOVELA3RGNM    WURGNM           Region Name
     C                     END
      *================================================================
     CSR         SAEXIT    ENDSR
      /EJECT
     CSR         SBRVGN    BEGSR
      *================================================================
      * Get 'Window required' ind - MIDAS Modules  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSB     KLIST
     C                     KFLD           BGMODS           Modules
      * Move fields to key list
     C                     MOVE *BLANK    BGMODS           Modules
     C                     MOVEL'MMOD'    BGMODS           Modules
     C           KRSSB     CHAIN@BGREC8              90    *
      * Data record not found
     C   90                MOVEL'USR0096' W0RTN   7
     C           *IN90     IFEQ '0'
      * USER: Process Data record
      * CASE: DB1.Window processing requir. is Yes
     C           BGWDPR    IFEQ 'Y'                        *IF
     C                     MOVEL'Y'       WUWDPR           Window processi
     C                     END                             *FI
     C                     END
      *================================================================
     CSR         SBEXIT    ENDSR
      /EJECT
     CSR         UASUBR    BEGSR
      *================================================================
      * Convert File Dates to Screen Dates
      *================================================================
      * Check File Date - Rundate  *
     C                     CALL 'ZDATE2'               90  Check File Date
     C                     PARM DYFLED    WQ0001  50       Work Midas Date
     C                     PARM WUDFF     WQ0002  1        Date format fla
     C           WUWCDT    PARM *ZERO     WQ0003  60       Work Converted
     C           #DAFED    PARM *BLANK    WQ0004  7        Work Alpha Date
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'ZDATE2'  W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Check File Date - Rundate  *
     C                     CALL 'ZDATE2'               90  Check File Date
     C                     PARM DYFLRD    WQ0005  50       Work Midas Date
     C                     PARM WUDFF     WQ0006  1        Date format fla
     C           WUWCDT    PARM *ZERO     WQ0007  60       Work Converted
     C           #DAFRD    PARM *BLANK    WQ0008  7        Work Alpha Date
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'ZDATE2'  W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Check File Date - Rundate  *
     C                     CALL 'ZDATE2'               90  Check File Date
     C                     PARM DYLLED    WQ0009  50       Work Midas Date
     C                     PARM WUDFF     WQ0010  1        Date format fla
     C           WUWCDT    PARM *ZERO     WQ0011  60       Work Converted
     C           #DALED    PARM *BLANK    WQ0012  7        Work Alpha Date
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'ZDATE2'  W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Check File Date - Rundate  *
     C                     CALL 'ZDATE2'               90  Check File Date
     C                     PARM DYLLRD    WQ0013  50       Work Midas Date
     C                     PARM WUDFF     WQ0014  1        Date format fla
     C           WUWCDT    PARM *ZERO     WQ0015  60       Work Converted
     C           #DALRD    PARM *BLANK    WQ0016  7        Work Alpha Date
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'ZDATE2'  W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Check File Date - Rundate  *
     C                     CALL 'ZDATE2'               90  Check File Date
     C                     PARM DYFRED    WQ0017  50       Work Midas Date
     C                     PARM WUDFF     WQ0018  1        Date format fla
     C           WUWCDT    PARM *ZERO     WQ0019  60       Work Converted
     C           #DARED    PARM *BLANK    WQ0020  7        Work Alpha Date
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'ZDATE2'  W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Check File Date - Rundate  *
     C                     CALL 'ZDATE2'               90  Check File Date
     C                     PARM DYFRRD    WQ0021  50       Work Midas Date
     C                     PARM WUDFF     WQ0022  1        Date format fla
     C           WUWCDT    PARM *ZERO     WQ0023  60       Work Converted
     C           #DARRD    PARM *BLANK    WQ0024  7        Work Alpha Date
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'ZDATE2'  W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Check File Date - Rundate  *
     C                     CALL 'ZDATE2'               90  Check File Date
     C                     PARM DYIRED    WQ0025  50       Work Midas Date
     C                     PARM WUDFF     WQ0026  1        Date format fla
     C           WUWCDT    PARM *ZERO     WQ0027  60       Work Converted
     C           #DAIED    PARM *BLANK    WQ0028  7        Work Alpha Date
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'ZDATE2'  W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Check File Date - Rundate  *
     C                     CALL 'ZDATE2'               90  Check File Date
     C                     PARM DYIRDT    WQ0029  50       Work Midas Date
     C                     PARM WUDFF     WQ0030  1        Date format fla
     C           WUWCDT    PARM *ZERO     WQ0031  60       Work Converted
     C           #DAIRD    PARM *BLANK    WQ0032  7        Work Alpha Date
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'ZDATE2'  W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      *================================================================
     CSR         UAEXIT    ENDSR
      /EJECT
     CSR         UBSUBR    BEGSR
      *================================================================
      * Output *EXPIRED* If Limit is Past it's Expiry Date
      *================================================================
     C                     MOVEL'N'       WUEXFX           Expired FX Limi
     C                     MOVEL'N'       WUU2ST           Expired LN Limi
     C                     MOVEL'N'       WUU3ST           Expired FRA Lim
     C                     MOVEL'N'       WUU4ST           Expired IRS Lim
      * Is FX Limit Expired?
      * CASE: DTL.FX Limit Expiry Date is not zero
     C           #1FLED    IFNE *ZERO                      *IF
      * CASE: WRK.Run day number GT DTL.FX Limit Expiry Date
     C           WURDNB    IFGT #1FLED                     *IF
     C                     MOVEL'Y'       WUEXFX           Expired FX Limi
     C                     END                             *FI
     C                     END                             *FI
      * Is LN Limit Expired?
      * CASE: DTL.Lending Limit Expiry Date is not zero
     C           #1LLED    IFNE *ZERO                      *IF
      * CASE: WRK.Run day number GT DTL.Lending Limit Expiry Date
     C           WURDNB    IFGT #1LLED                     *IF
     C                     MOVEL'Y'       WUU2ST           Expired LN Limi
     C                     END                             *FI
     C                     END                             *FI
      * Is FRA Limit Expired?
      * CASE: DTL.FRA Expiry Date is not zero
     C           #1FRED    IFNE *ZERO                      *IF
      * CASE: WRK.Run day number GT DTL.FRA Expiry Date
     C           WURDNB    IFGT #1FRED                     *IF
     C                     MOVEL'Y'       WUU3ST           Expired FRA Lim
     C                     END                             *FI
     C                     END                             *FI
      * Is IRS Limit Expired?
      * CASE: DTL.IRS Expiry Date is not zero
     C           #1IRED    IFNE *ZERO                      *IF
      * CASE: WRK.Run day number GT DTL.IRS Expiry Date
     C           WURDNB    IFGT #1IRED                     *IF
     C                     MOVEL'Y'       WUU4ST           Expired IRS Lim
     C                     END                             *FI
     C                     END                             *FI
      *================================================================
     CSR         UBEXIT    ENDSR
      /EJECT
     CSR         VACKRL    BEGSR
      *================================================================
      * Select existing record
      *================================================================
      * Name search required?
     C                     MOVEL#1RGCD    WK1X01  1
     C                     MOVEL#1LEVL    WK1X02  1
     C                     MOVEL#1BCCD    WK1X03  1
     C           WK1X01    IFEQ '?'                        Region Code
     C           WK1X02    OREQ '?'                        Level
     C           WK1X03    OREQ '?'                        Branch/Company
     C                     CALL 'SD0460S'              90  Select Region L
     C                     PARM *BLANK    W0RTN   7
     C           #1RGCD    PARM #1RGCD    WQ0033  2        Region Code
     C           #1LEVL    PARM #1LEVL    WQ0034  1        Level
     C           #1BCCD    PARM #1BCCD    WQ0035  3        Branch/Company
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SD0460S' W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C           W0RTN     ANDNE'Y2U0016'
     C                     SETON                     99    *
     C                     END
      * Defer confirm
     C                     MOVEL'Y'       W0DCF   1
     C                     END
      *================================================================
     CSR         VAEXIT    ENDSR
      /EJECT
     CSR         VBCKRL    BEGSR
      *================================================================
      * Check reference to Region Codes
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Name search required?
     C                     MOVEL#1RGCD    WK1X01  1
     C           WK1X01    IFEQ '?'                        Region Code
     C                     CALL 'SD0190S'              90  Select Region C
     C                     PARM *BLANK    W0RTN   7
     C           #1RGCD    PARM #1RGCD    WQ0036  2        Region Code
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SD0190S' W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C           W0RTN     ANDNE'Y2U0016'
     C                     SETON                     9931  *
     C                     END
      * Defer confirm
     C                     MOVEL'Y'       W0DCF   1
      * No value selected, exit
     C           W0RTN     IFNE *BLANK
     C                     GOTO VBEXIT
     C                     END
     C                     END
      *................................................................
      * If all low order keys not entered, exit
     C           #1RGCD    IFEQ *BLANK                     Region Code
     C                     GOTO VBEXIT
     C                     END
      *
     C           KLVBA3    KLIST
     C                     KFLD           A3RGCD           Region Code
      * Setup key
     C                     MOVEL#1RGCD    A3RGCD           Region Code
     C           KLVBA3    CHAIN@A3REBX              9091  *
     C           *IN90     IFEQ '0'
      * Record found - move back any virtuals
     C                     GOTO VBEXIT
     C                     END
      * Send message 'Region Codes           NF'
     C                     MOVEL'USR0065' ZAMSID
     C                     EXSR ZASNMS
     C                     MOVEL'USR0065' W0RTN
      *================================================================
     CSR         VBEXIT    ENDSR
      /EJECT
     CSR         Y0SET     BEGSR
      *================================================================
      * Set cursor by *SET CURSOR data
      *================================================================
      *================================================================
     CSR         Y0EXIT    ENDSR
      /EJECT
     CSR         Y1SET     BEGSR
      *================================================================
      * Set cursor by *SET CURSOR data
      *================================================================
      *================================================================
     CSR         Y1EXIT    ENDSR
      /EJECT
     CSR         Y8TST     BEGSR
      *================================================================
      * Test cursor
      *================================================================
     C           @#DFMT    IFEQ '#RCDKEY'
      * KEY Screen
     C                     Z-ADD@#RWCL    ZINPOS  50
     C           ZINPOS    DIV  256       W0CRW
     C                     MVR            W0CCL
     C                     END
     C           @#DFMT    IFEQ '#RCDDTL1'
      * DETAIL Screen
     C                     Z-ADD@#RWCL    ZINPOS  50
     C           ZINPOS    DIV  256       W0CRW
     C                     MVR            W0CCL
     C                     END
      *================================================================
     CSR         Y8EXIT    ENDSR
      /EJECT
     CSR         Y9CLR     BEGSR
      *================================================================
      * Clear *SET CURSOR data
      *================================================================
      *================================================================
     CSR         Y9EXIT    ENDSR
      /EJECT
     CSR         ZASNMS    BEGSR
      *================================================================
      * Send message to program's message queue
      *================================================================
     C           ZAPGMQ    IFEQ *BLANK
     C                     MOVEL##PGM     ZAPGMQ
     C                     END
      * If no message file specified, use default
     C           ZAMSGF    IFEQ *BLANK
     C                     MOVELZADFMF    ZAMSGF
     C                     END
     C                     CALL 'Y2SNMGC'
     C                     PARM           ZAPGMQ 10        Program queue
     C                     PARM           ZAPGRL  5        Rel queue
     C                     PARM           ZAMSID  7        Message ID
     C                     PARM           ZAMSGF 10        Message file
     C                     PARM           ZAMSDA132        Message data
     C                     PARM           ZAMSTP  7        Message type
      * Clear all fields for default mechanism next time
     C                     MOVEL*BLANK    ZAPGMQ
     C                     MOVEL*BLANK    ZAPGRL
     C                     MOVEL*BLANK    ZAMSID
     C                     MOVEL*BLANK    ZAMSGF
     C                     MOVEL*BLANK    ZAMSDA
     C                     MOVEL*BLANK    ZAMSTP
      *================================================================
     CSR         ZAEXIT    ENDSR
      /EJECT
     CSR         ZHHPKY    BEGSR
      *================================================================
      * Display HELP text
      *================================================================
      * Signal help request
     C                     MOVEL'Y'       W0HLP   1
      *
      * Extract cursor row and column
     C           @#RWCL    DIV  256       ZHCSRW  50       Row
     C                     MVR            ZHCSCL  50       Column
      *
      * Save cursor position for redisplay
     C                     Z-ADDZHCSRW    ZZCSRW  30       Row
     C                     Z-ADDZHCSCL    ZZCSCL  30       Column
      *
      *
     C                     CALL 'YDDSHPR'
     C                     PARM ##PGM     W0HPMB 10        Help text sourc
     C                     PARM *BLANK    YYHPFL 10        Help text file
     C                     PARM *BLANK    YYHPLB 10        Help text libra
     C                     PARM           W0RTN   7
     C                     PARM '*START'  YYHLVN 10        Help label
     C                     PARM '*NORMAL' YYUSOP 10        Options
     C                     PARM ZHCSRW    YYRW    50       Row
     C                     PARM ZHCSCL    YYCL    50       Column
     C                     PARM 1         YYLGCT  50       # of grps
     C                     PARM W0GRP     YYLGVN 10        Label grps
      *
      * Clear set cursor DDS indicator
     C  N94                MOVEL'OFF'     WCSRLC
     C  N94                SETON                     94    *
      *================================================================
     CSR         ZHEXIT    ENDSR
      /EJECT
     CSR         ZXEXPG    BEGSR
      *================================================================
      * Cancel and exit from key screen
      *================================================================
      * USER: Exit program processing
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/Copy Member SD0461EEPP - Region Limits  *
     C*00/Copy Member SD0461E   Exit Program Processing
     C/COPY WNCPYSRC,SD0461EEPP
     C                     END                             *FI
      * CASE: KEY.*CMD key is *Exit
     C           *IN03     IFEQ '1'                        *IF
     C                     MOVEL'Y2U9999' P0RTN            *Return code
     C                     EXSR ZYEXPG
     C                     END                             *FI
     C                     MOVEL*BLANK    P0RTN
     C                     EXSR ZYEXPG
      *================================================================
     CSR         ZXEXIT    ENDSR
      /EJECT
     CSR         ZYEXPG    BEGSR
      *================================================================
      * Exit program: Direct
      *================================================================
      * Terminate program
     C                     SETON                     LR
      *
      * Exit program
     C                     RETRN
      *
      *================================================================
     CSR         ZYEXIT    ENDSR
      /EJECT
     CSR         ZZINIT    BEGSR
      *================================================================
      * Initialisation
      *================================================================
     C           W0ICL     IFEQ *BLANK
     C                     MOVEL'Y'       W0ICL   1        *Initial call
     C                     ELSE
     C                     MOVEL'N'       W0ICL
     C                     END
     C                     MOVE *BLANK    P0RTN
     C                     MOVE *BLANK    W0RTN   7
     C                     MOVEL*BLANK    W0RSL   1
     C                     MOVEL*BLANK    W0RSF   1
     C                     MOVEL*ZEROS    W0RTW   90
     C                     MOVEL'400'     W0ENV   3
      * Setup job date/time
      *
     C                     Z-ADDUDATE     ##JDT
      * Set century digit (If YY prior to 1940 treat as 20YY)
     C           ##JYY     IFLT 40
     C                     Z-ADD1         ##JCC
     C                     ELSE
     C                     Z-ADD0         ##JCC
     C                     END
     C                     TIME           ##JTM
      * Update screen time
     C                     TIME           ##TME   60
      * Obtain default message file
     C           *NAMVAR   DEFN Y2MGFLA   ZADFMF 10
     C                     IN   ZADFMF
      * Define work field S01212
     C                     MOVEL*BLANK    WUMFTS  1
      * Define work field Region Name
     C                     MOVEL*BLANK    WURGNM 30
      * Define work field Date format flag
     C                     MOVEL*BLANK    WUDFF   1
      * Define work field Work Converted Date
     C                     Z-ADD*ZERO     WUWCDT  60
      * Define work field Multi-branching Indicator
     C                     MOVEL*BLANK    WUMBIN  1
      * Define work field Display Level & Brch/Comp
     C                     MOVEL*BLANK    WUDLBC  1
      * Define work field Expired FX Limit
     C                     MOVEL*BLANK    WUEXFX  1
      * Define work field Expired LN Limit
     C                     MOVEL*BLANK    WUU2ST  1
      * Define work field Expired FRA Limit
     C                     MOVEL*BLANK    WUU3ST  1
      * Define work field Expired IRS Limit
     C                     MOVEL*BLANK    WUU4ST  1
      * Define work field Run day number
     C                     Z-ADD*ZERO     WURDNB  50
      * Define work field Window processing requir.
     C                     MOVEL*BLANK    WUWDPR  1
      * Define work field Midas Run Date
     C                     MOVEL*BLANK    WUMRDT  7
      * Define work field Set Up Complete
     C                     MOVEL*BLANK    WUSUC   1
      * Flag no *SET CURSOR in the program
     C                     MOVE 'N'       YSETCS  1
     C                     MOVE *BLANK    WCSRLC  3
      * Define *Synon program work fields
     C                     MOVEL*BLANKS   W0CFL  10        *Cursor field
     C                     Z-ADD*ZEROS    W0CRW   50       *Cursor row
     C                     Z-ADD*ZEROS    W0CCL   50       *Cursor column
      * Move main file information to JOB context
     C                     MOVE @1FFL     ZZFFL  10        Main file name
     C                     MOVE @1FLB     ZZFLB  10        Main file lib
     C                     MOVE @1FMB     ZZFMB  10        Main file mbr
     C                     MOVE ZZFFL     @1FFL  10
     C                     MOVE ZZFLB     @1FLB  10
     C                     MOVE ZZFMB     @1FMB  10
     C                     CALL 'Y2QLVNR'
     C                     PARM           ZZFFL  10
     C                     PARM           ZZFLB  10
     C                     PARM           ZZFQL  21        LIBRARY/FILE
      * Open files
     C                     OPEN SD0461E#
     C                     OPEN SDRGLML1
     C                     OPEN SDREGNL1
     C                     OPEN SDMMODL1
     C                     MOVEL'N'       W0PMT   1
     C                     MOVEL*BLANK    W0GRP   1
      * USER: Initialize program
      * SD0461E PRECOMPILER - Region Limits  *
      * Copyright Statement 1988 - Standard Functions  *
      * Start of SAR S01117
      * End of SAR S01117
      * Get Rundate - Rundate  *
     C           *NAMVAR   DEFN           RUNDAT
     C                     IN   RUNDAT
     C                     MOVE MRDT      ##MRDT  7        RUN DATE
     C                     MOVE MRDT      WUMRDT
     C                     MOVE RDNB      WURDNB           RUNDAY NO.
     C                     MOVE SUC       WUSUC            SET UP COMPLT
     C                     MOVE DFF       WUDFF            DTE FMT FLAG
     C                     MOVE MBIN      WUMBIN           MULTI BR. IND
     C                     MOVEL'Y'       WUMFTS           S01212
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * Get 'Window required' ind - MIDAS Modules  *
     C                     EXSR SBRVGN
      * DS Region Limits - Region Limits  *
      * 00/Copy Member SD0461EIPG - Region Limits  *
     C/COPY WNCPYSRC,SD0461ECPG
     C                     END                             *FI
      *================================================================
     CSR         ZZEXIT    ENDSR
      /EJECT
     CSR         *PSSR     BEGSR
      *****************************************************************
      *                                                               *
      * *PSSR  - Program exception error routine                      *
      *          Called automatically if a program error occurs,      *
      *          or directly by the program code using EXSR.          *
      *          This subroutine DUMPs the program just once.         *
      *                                                               *
      *****************************************************************
      *
      * Core function specific processing.
      *
     C/COPY WNCPYSRC,SD0461EPSC
      *
      * Start of PSSR user point.
      *
     C/COPY WNCPYSRC,SD0461EPS1
      *
      * Standard Midas PSSR processing.
      *
     C/COPY SDCPYSRC,SDPSSRINT
      *
      * End of PSSR user point.
      *
     C/COPY WNCPYSRC,SD0461EPS2
      *
      *================================================================
     CSR                   ENDSR
      *================================================================
     O/COPY WNCPYSRC,SD0461EOPG
** CPY@     : Copyright notice for inclusion in all programs
(c) Misys International Banking Systems Ltd. 2001
