000100210712     H        1   Y
000200210712      *****************************************************************
000300210712/*STD *  RPGBASE                                                      *
000400210712/*EXI *  TEXT('Midas SD Extended settlements FRA/IRS maintenance')    *
000500210712      *****************************************************************
000600210712      *                                                               *
000700210712      *  Midas - Standing Data Module                                 *
000800210712      *                                                               *
000900210712      ***SD0402R*-*Extended*Settlements*Maintenance*-*FRA/IRS**********                       CSW212
001000210712      *  SD0402R - Extended Settlements Additional Details            *                       CSW212
001100210712      *            Maintenance                                        *                       CSW212
001200210712      *                                                               *
001300210712      ***Function:**This*program*maintains*FRA/IRS*fields*on*the*******                       CSW212
001400210712      **************Extended*Settlements*file.*************************                       CSW212
001500210712      *  Function:  This program maintains additional details fields  *                       CSW212
001600210712      *             on the Extended Settlements file.                 *                       CSW212
001700210712      *  (phase(s))                                                   *
001800210712      *                                                               *
001900210712      *  Called By: SD0401R - Extended Settlements Mnt.               *
002000210712      *                                                               *
002100210712      *  (c) Finastra International Limited 2001                      *
002200210712      *                                                               *
002300210712      *  Last Amend No. CSW221             Date 05Apr21               *
002400210712      *  Prev Amend No. MD046248           Date 27Oct17               *
002500210712      *                 MD030342           Date 25Nov14               *
002600210712      *                 CSW214             Date 25Nov14               *
002700210712      *                 CSD095             Date 10Apr14               *
002800210712      *                 MD022843A          Date 19Mar14               *
002900210712      *                 MD022843           Date 19Mar14               *
003000210712      *                 AR992080           Date 19Jun12               *
003100210712      *                 CSW212             Date 03May12               *
003200210712      *                 CER059             Date 19Jul10               *
003300210712      *                 CER043             Date 19May08               *
003400210712      * Bank Fusion Midas 1.4 Base -----------------------------------*
003500210712      * Midas Plus 1.4 Base 04 ---------------------------------------*
003600210712      * Midas Plus 1.4 Base ------------------------------------------*
003700210712      * Midas Plus 1.3 ----------- Base ------------------------------*
003800210712      *                 CSD027             Date 09Dec05               *
003900210712      *                 CSW037A            Date 02May05               *
004000210712      *                 BUG6198            Date 04Apr05               *
004100210712      *                 BUG6329            Date 25Mar05               *
004200210712      *                 CSD025             Date 11Jan05               *
004300210712      *                 CDL031             Date 05Dec04               *
004400210712      *                 CSW037             Date 15Dec04               *
004500210712      *                 CSW036             Date 15Dec04               *
004600210712      *                 CGL029             Date 01Sep03               *
004700210712      *                 CSD012             Date 15Oct02               *
004800210712      * Midas Release 4 --------------- Base -------------------------*
004900210712      * Midas DBA 3.03 -----------------------------------------------*
005000210712      *                 CSW200             Date 21Aug00               *
005100210712      * Midas DBA 3.02 -----------------------------------------------*
005200210712      *                 173052             Date 06DEC99               *
005300210712      * Midas DBA 3.00 ---------------- Base -------------------------*
005400210712      *                 CSW097             Date 20May99               *
005500210712      *                 CSD003             Date 02JAN98               *
005600210712      *                 CSW005             Date 12NOV96               *
005700210712      *                                                               *
005800210712      *-------------------------------------------------------------- *
005900210712      *                                                               *
006000210712      *  CSW221   - SWIFT Changes 2021                                *
006100210712      *  MD046248 - Finastra Rebranding                               *
006200210712      *  MD030342 - Valid values for Agreement Type for FX and AT     *
006300210712      *             transaction types for MT600                       *
006400210712      *  CSW214 - SWIFT Changes 2014                                  *
006500210712      *  CSD095 - Allow Deal Sub-Type and Branch for MM and FX SSIs   *
006600210712      *  MD022843A - Correct defaulting of ISDA version.              *
006700210712      *            - Applied for MD-25726                             *
006800210712      *  MD022843 - ISDA fields for FRA/IRS transaction type not      *
006900210712      *             defaulted. Default the ISDA fields with ICD values*
007000210712      *             for FRA/IRS transaction type.                     *
007100210712      *           - Applied for MD-25726                              *
007200210712      *  AR992080 - Remove FX from the descriptions of Sender to      *
007300210712      *             Receiver cover and confirmation fields            *
007400210712      *  CSW212 - SWIFT 2012 Changes                                  *
007500210712      *  CER059 - German Feature Upgrade to Delhi                     *
007600210712      *  CER043 - German Features LF041-00 New Fields and Defaulting  *
007700210712      *           (Recompile)                                         *
007800210712      *  CSD027 - Conversion Of Customer Number to Alpha              *
007900210712      *  CSW037A- Additional Field extended to 40 chars (recompile)   *
008000210712      *  BUG6198- Cannot save new Details for CUSD (Recompile)        *
008100210712      *  BUG6329 - 'DV' Trans Types should call SD0402                *
008200210712      *  CSD025 - Customer De-Activation                              *
008300210712      *  CDL031 - Effective Date on Extended SSI (Recompile)          *
008400210712      *  CSW037 - Additional Field Data on MT300/MT320                *
008500210712      *  CSW036 - Dual SWIFT BIC held on Client Details               *
008600210712      *  CGL029 - Increase Account Code to 10 digits                  *
008700210712      *  CSD012 - Standing Data Authorisation                         *
008800210712      *  CSW200 - SWIFT 2000 Changes                                  *
008900210712      *  173052 - CSW005 FIX...disable ISDA fields if CSW005 is off   *
009000210712      *  CSW097 - SWIFT97 Changes for MT34* and MT36*                 *
009100210712      *           Align validation messages with SD2410 err msgs      *
009200210712      *  CSD003 - Synon Closedown Project (SD):                       *
009300210712      *           - Program removed from SD model.                    *
009400210712      *  CSW005 - FRA/IRS MT34*, MT36* Message Generation.            *
009500210712      *           New function.                                       *
009600210712      *                                                               *
009700210712      *****************************************************************
009800210712     F*Ext Stlmnts Mnt(FRA/IRS) Initialise Program F-spec
009900210712     F/COPY WNCPYSRC,SD0402RFPG
010000210712     FSD0402R#CF  E                    WORKSTN                        UC
010100210712     F                                              KINFDS INFDS#
010200210712     F                                              KINFSR *PSSR
010300210712      * DSP: Midas SD Extended settlements FRA/IRS maintenance
010400210712      *
010500210712     FSDEXSTL1IF  E           K        DISK                           UC
010600210712     F                                              KINFDS INFDS1
010700210712     F                                              KINFSR *PSSR
010800210712      * RTV : Midas SD Extended settlements retrieval
010900210712      *
011000210712     FSDEXSTL9IF  E           K        DISK                                                  BUG6329
011100210712     F                                              KINFSR *PSSR                             BUG6329
011200210712      * RTV : Midas SD Extended settlements retrieval (Eff Date)                             BUG6329
011300210712      *
011400210712     F/COPY WNCPYSRC,SDH00312
011500210712     FSDCUSTL1IF  E           K        DISK                           UC
011600210712     F                                              KINFDS ID0001
011700210712     F                                              KINFSR *PSSR
011800210712      * RTV : Midas SD Customer details retrieval
011900210712      *
012000210712     FSDBRCHL1IF  E           K        DISK                           UC
012100210712     F                                              KINFDS ID0002
012200210712     F                                              KINFSR *PSSR
012300210712      * RTV : Midas SD Branch codes retrieval
012400210712      *
012500210712     FSDCURRL1IF  E           K        DISK                           UC
012600210712     F                                              KINFDS ID0003
012700210712     F                                              KINFSR *PSSR
012800210712      * RTV : Midas SD Currency codes retrieval
012900210712      *
013000210712     FSDMMODL1IF  E           K        DISK                           UC
013100210712     F                                              KINFDS ID0004
013200210712     F                                              KINFSR *PSSR
013300210712      * RTV : Midas SD Midas module flags retrieval
013400210712      *
013500210712      * RTV : Midas SD FRA/IrS ICD Data retrieval                                           MD022843
013600210712     FSDFAISL1IF  E           K        DISK         KINFSR *PSSR                            MD022843
013700210712      *                                                                                     MD022843
013800210712     FSDEXSTL0UF  E           K        DISK                      A    UC
013900210712     F                                              KCOMIT
014000210712     F                                              KINFDS ID0005
014100210712     F                                              KINFSR *PSSR
014200210712      * UPD : Midas SD Extended settlements update
014300210712      *
014400210712     E                    UER       150  3
014500210712     E* Description     : Copyright notice for inclusion in all programs
014600210712     E*
014700210712     E********************************************************************
014800210712     E                    CPY@    1   1 80               Copyright array
014900210712     E*Ext Stlmnts Mnt(FRA/IRS) Initialise Program E-spec
015000210712     E/COPY WNCPYSRC,SD0402REPG
015100210712     E                    HDTG    1   3 10                                                    CSW212
015200210712     E                    CONF    1   3 42                                                    CSW212
015300210712     E                    SETN    1   3 42                                                    CSW212
015400210712      *                                                                                       CSW212
015500210712      ** Extended Settlement Addt'l details tags                                              CSW212
015600210712     I*
015700210712     I* Description     : Copyright notice for inclusion in all programs
015800210712     I*
015900210712     I*
016000210712     I/COPY QWINDSRC,SD0400GDTA                                           S01229
016100210712     I*
016200210712     I*Ext Stlmnts Mnt(FRA/IRS) Initialise Program I-spec
016300210712     I/COPY WNCPYSRC,SD0402RIPG
016400210712      /EJECT
016500210712      * Data structures:
016600210712      *                                                                                       CSD012
016700210712     ILDA       E DSLDA                         256                                           CSD012
016800210712     I              SPARE                           SPAREX                                    CSD012
016900210712      ** Local data area for database error details                                           CSD012
017000210712      *                                                                                       CSD012
017100210712     IPGMDS     ESDSY2PGDSP
017200210712      * Program data structure
017300210712     IJBDTTM      DS
017400210712      * Job date/time
017500210712     I                                        1   70##JDT
017600210712     I                                        1   10##JCC
017700210712     I                                        2   30##JYY
017800210712     I                                        4   50##JMM
017900210712     I                                        6   70##JDD
018000210712     I                                        8  130##JTM
018100210712     I                                        8   90##JHH
018200210712     I                                       10  110##JNN
018300210712     I                                       12  130##JSS
018400210712      * ABO DEFINE LARGE STRING FOR CL CMD
018500210712     IYARTCM      DS                            512
018600210712     I                                        1   1 DUMMY1
018700210712     IINFDS#    E DSY2I#DSP
018800210712      * Display file information data structure
018900210712      *
019000210712     IINFDS1    E DSY2I1DSP
019100210712      * File information data structure
019200210712      *
019300210712     I@1DBRC    E DSSDEXSTL0
019400210712      * UPD : Midas SD Extended settlements update
019500210712      * Current/previous master file format fields for change control
019600210712      *
019700210712     I*#1DBRC******DS                           1298                      CSW097
019800210712     I***#1DBRC*     DS                           1304                                 CSW097 CGL029
019900210712     I#1DBRC      DS                           9999                                           CGL029
020000210712      * Stored master file format fields
020100210712     I                                        1   1 #1DB1
020200210712      *
020300210712      * Outward parameters
020400210712     I***PARC***     DS                           1294                                        CGL029
020500210712     IPARC        DS                           1314                                           CGL029
020600210712      * RCD : Midas SD Extended settlements parms to SD2410
020700210712      * B : MAP Receipt - Settlement Type
020800210712     I                                       12  13 PARSTY
020900210712      * B : MAP Receipt - Our Nostro
021000210712     I**********                             14  25 PARONO                                    CGL029
021100210712     I                                       14  25 QQRONO                                    CGL029
021200210712      * B : MAP Rcpt - Ordering Bank No.
021300210712     I                                       26  31 PAROBN
021400210712      * B : MAP Rcpt - Ordering Customer
021500210712     I                                       32  37 PAROCS
021600210712      * B : MAP Rcpt - Intermed Bank No.
021700210712     I                                       38  45 PARIBN
021800210712      * B : MAP Rcpt - I/m Bank A/c Line
021900210712     I                                       46  80 PARIBL
022000210712      * B : MAP Pay - Settlement Type
022100210712     I                                       81  82 PAPSTY
022200210712      * B : MAP Pay - Our Nostro
022300210712     I**********                             83  94 PAPONO                                    CGL029
022400210712     I                                       83  94 QQPONO                                    CGL029
022500210712      * B : MAP Pay - Ordering Bank Numb.
022600210712     I                                       95 100 PAPOBN
022700210712      * B : MAP Pay - Ordering Customer
022800210712     I                                      101 106 PAPOCS
022900210712      * B : MAP Pay - Intermed Bank No.
023000210712     I                                      107 114 PAPIBN
023100210712      * B : MAP Pay - I/m Bank A/c Line
023200210712     I                                      115 149 PAPIBA
023300210712      * B : MAP Receiver Correspondent No
023400210712     I                                      150 157 PARCNO
023500210712      * B : MAP Receiver Corr. A/c Line
023600210712     I                                      158 192 PARCAL
023700210712      * B : MAP Receiver Number
023800210712     I                                      193 200 PARCNB
023900210712      * B : MAP A/c With Bank No.
024000210712     I                                      201 208 PAACBN
024100210712      * B : MAP A/c With Bank Line
024200210712     I                                      209 243 PAACBL
024300210712      * B : MAP Beneficiary Number
024400210712     I                                      244 251 PABYNB
024500210712      * B : MAP Beneficiary A/c Line
024600210712     I                                      252 286 PABACL
024700210712      * B : MAP Details of Payment 1
024800210712     I                                      287 321 PADPY1
024900210712      * B : MAP Details of Payment 2
025000210712     I                                      322 356 PADPY2
025100210712      * B : MAP Details of Payment 3
025200210712     I                                      357 391 PADPY3
025300210712      * B : MAP Details of Payment 4
025400210712     I                                      392 426 PADPY4
025500210712      * B : MAP Details of charges
025600210712     I                                      427 429 PADECG
025700210712      * B : MAP Bank to Bank Info. 1
025800210712     I                                      430 464 PABBI1
025900210712      * B : MAP Bank to Bank Info. 2
026000210712     I                                      465 499 PABBI2
026100210712      * B : MAP Bank to Bank Info. 3
026200210712     I                                      500 534 PABBI3
026300210712      * B : MAP Bank to Bank Info. 4
026400210712     I                                      535 569 PABBI4
026500210712      * B : MAP Bank to Bank Info. 5
026600210712     I                                      570 604 PABBI5
026700210712      * B : MAP Bank to Bank Info. 6
026800210712     I                                      605 639 PABBI6
026900210712      * B : MAP Cover Message Required
027000210712     I                                      640 640 PACVMR
027100210712      * B : MAP Our Receive Branch
027200210712     I                                      641 643 PAORBR
027300210712      * B : MAP Our Payment Branch
027400210712     I                                      644 646 PAOPBR
027500210712     I                                     12951304 PARONO                                    CGL029
027600210712     I                                     13051314 PAPONO                                    CGL029
027700210712      *
027800210712      * Outward parameters
027900210712     I***PBRC***     DS                            351                                        CGL029
028000210712     IPBRC        DS                            361                                           CGL029
028100210712      * RCD : Extended Settlement Parms Retrieval index
028200210712      * B : MAP Action Code
028300210712     I                                        1   1 PBANCD
028400210712      * B : MAP Calling Program Code
028500210712     I                                        2   5 PBCPGC
028600210712      * B : MAP Calling Transaction Type
028700210712     I                                        6   7 PBCTTY
028800210712      * B : MAP customer number/sname
028900210712     I                                        8  17 PBCUNS
029000210712      * B : MAP Date Of Receipt, Our Nost
029100210712     I                                    P  18  200PBDRON
029200210712      * B : MAP Date Of Payment, Our Nost
029300210712     I                                    P  21  230PBDPON
029400210712      * B : MAP Receive Currency Code
029500210712     I                                       24  26 PBRCCD
029600210712      * B : MAP Currency Code
029700210712     I                                       27  29 PBCYCD
029800210712      * B : MAP Federal Funds Indicator
029900210712     I                                       30  30 PBFFIN
030000210712      * B : MAP Branch code
030100210712     I                                       31  33 PBBRCD
030200210712      * B : MAP Protect Receipt Instructs
030300210712     I                                       34  34 PBPRI
030400210712      * B : MAP Protect Payment Instructs
030500210712     I                                       35  35 PBPPI
030600210712      * B : MAP Command Key Entered
030700210712     I                                       36  37 PBCKYE
030800210712      * B : MAP Validation Only
030900210712     I                                       38  38 PBVLON
031000210712      * B : MAP Settlement Details Valid
031100210712     I                                       39  39 PBSDV
031200210712      * B : MAP Termination Parameter
031300210712     I                                       40  40 PBTRPA
031400210712      * B : MAP first call for insert
031500210712     I                                       41  41 PBFCFI
031600210712      * B : MAP Recpt - intermed bank no.
031700210712     I                                       42  51 PBIBNR
031800210712      * B : MAP Rcpt - Ordering bank num
031900210712     I                                       52  61 PBOBNR
032000210712      * B : MAP Rcpt - Ordering cust no.
032100210712     I                                       62  71 PBOCSR
032200210712      * B : MAP Pay - Intermed Bank num
032300210712     I                                       72  81 PBIBNP
032400210712      * B : MAP Pay - Ordering Bank No.
032500210712     I                                       82  91 PBOBNP
032600210712      * B : MAP Pay - Ordering Cust No.
032700210712     I                                       92 101 PBOCSP
032800210712      * B : MAP Receiver Corr. No.
032900210712     I                                      102 111 PBCNOR
033000210712      * B : MAP Recipient of MT100
033100210712     I                                      112 121 PBRMT1
033200210712      * B : MAP A/C with bank number
033300210712     I                                      122 131 PBACWB
033400210712      * B : MAP Beneficiary No.
033500210712     I                                      132 141 PBBYNO
033600210712      * B : MAP Retail Present
033700210712     I                                      142 142 PBREPR
033800210712      * B : MAP Retail A/C Nos. Supported
033900210712     I                                      143 143 PBRANS
034000210712      * B : MAP Account Code
034100210712     I**********                            144 147 PBACCD                                    CGL029
034200210712     I                                      144 147 QQACC1                                    CGL029
034300210712      * B : MAP Chips Module
034400210712     I                                      148 148 PBCHMD
034500210712      * B : VRY Back value period parm
034600210712     I                                      149 1510PBBVPP
034700210712      * B : MAP Run day number
034800210712     I                                    P 152 1540PBRDNB
034900210712      * B : MAP Database error file
035000210712     I                                      155 159 PBDBEF
035100210712      * B : MAP Database error key
035200210712     I                                      160 188 PBDBEK
035300210712      * B : MAP program name
035400210712     I                                      189 196 PBPGNM
035500210712      * B : MAP Database error number
035600210712     I                                      197 198 PBDBEN
035700210712      * B : MAP error codes
035800210712     I                                      199 348 PBERCS
035900210712      * B : MAP Default Fields
036000210712     I                                      349 349 PBDFLD
036100210712      * B : MAP Default Receipt Side
036200210712     I                                      350 350 PBDFRS
036300210712      * B : MAP Defaulting Occurred
036400210712     I                                      351 351 PBDOCC
036500210712     I                                      352 361 PBACCD                                    CGL029
036600210712      *
036700210712      * Outward parameters
036800210712     I*PCRC********DS*****                       648                      CSW097
036900210712     IPCRC        DS                            650                       CSW097
037000210712      * RCD : Extend Sett FRA/IRS Parms Retrieval index
037100210712      * B : MAP Def Conf Snd to Rec Inf 1
037200210712     I                                        1  35 PCDSR1
037300210712      * B : MAP Def Conf Snd to Rec Inf 2
037400210712     I                                       36  70 PCDSR2
037500210712      * B : MAP Def Conf Snd to Rec Inf 3
037600210712     I                                       71 105 PCDSR3
037700210712      * B : MAP Def Conf Snd to Rec Inf 4
037800210712     I                                      106 140 PCDSR4
037900210712      * B : MAP Def Conf Snd to Rec Inf 5
038000210712     I                                      141 175 PCDSR5
038100210712      * B : MAP Def Conf Snd to Rec Inf 6
038200210712     I                                      176 210 PCDSR6
038300210712      * B : MAP Sett Conf Sndr-Rcvr Inf 1
038400210712     I                                      211 245 PCSSR1
038500210712      * B : MAP Sett Conf Sndr-Rcvr Inf 2
038600210712     I                                      246 280 PCSSR2
038700210712      * B : MAP Sett Conf Sndr-Rcvr Inf 3
038800210712     I                                      281 315 PCSSR3
038900210712      * B : MAP Sett Conf Sndr-Rcvr Inf 4
039000210712     I                                      316 350 PCSSR4
039100210712      * B : MAP Sett Conf Sndr-Rcvr Inf 5
039200210712     I                                      351 385 PCSSR5
039300210712      * B : MAP Sett Conf Sndr-Rcvr Inf 6
039400210712     I                                      386 420 PCSSR6
039500210712      * B : MAP FRA/IRS Conf Conditions 1
039600210712     I                                      421 455 PCCND1
039700210712      * B : MAP FRA/IRS Conf Conditions 2
039800210712     I                                      456 490 PCCND2
039900210712      * B : MAP FRA/IRS Conf Conditions 3
040000210712     I                                      491 525 PCCND3
040100210712      * B : MAP FRA/IRS Conf Conditions 4
040200210712     I                                      526 560 PCCND4
040300210712      * B : MAP FRA/IRS Conf Conditions 5
040400210712     I                                      561 595 PCCND5
040500210712      * B : MAP FRA/IRS Conf Conditions 6
040600210712     I                                      596 630 PCCND6
040700210712      * B : MAP Version of ISDA Rules
040800210712     I                                      631 634 PCISDA
040900210712      * B : MAP Type of ISDA agreement
041000210712     I                                      635 640 PCAGTY
041100210712      * B : MAP Date of ISDA Agreement
041200210712     I                                      641 646 PCAGDT
041300210712      * B : MAP Version of ISDA Agreement
041400210712     I**************************************647 648 PCAGVV                CSW097
041500210712     I                                      647 650 PCAGVV                CSW097
041600210712      *
041700210712     I*YARDCS******DS                           1298
041800210712     I***YARDCS*     DS                           1302                                        CGL029
041900210712     IYARDCS      DS                           9999                                           CGL029
042000210712     IA@CPY       DS
042100210712     I* Copyright array
042200210712     I                                        1  80 CPY@
042300210712     IRUNDAT      DS
042400210712     I                                        1   7 MRDT
042500210712     I                                    P   8  100RDNB
042600210712     I                                       11  11 SUC
042700210712     I                                       12  12 DFF
042800210712     I                                       13  13 MBIN
042900210712     IID0001      DS                            528
043000210712      * File information data structure
043100210712      *
043200210712     IID0002      DS                            528
043300210712      * File information data structure
043400210712      *
043500210712     IID0003      DS                            528
043600210712      * File information data structure
043700210712      *
043800210712     IID0004      DS                            528
043900210712      * File information data structure
044000210712      *
044100210712     IID0005      DS                            528
044200210712      * File information data structure
044300210712      *
044400210712      /EJECT
044500210712      * Parameter declarations
044600210712     I***P1PARM******DS                           1338                    CSW097
044700210712     I***P1PARM******DS                           1340                    CSW097             BUG6329
044800210712     IP1PARM      DS                           1343                                          BUG6329
044900210712      * RCD: Midas SD Extended settlements retrieval
045000210712      * I : RST Currency Code
045100210712     I                                        1   3 P1CYCD
045200210712      * I : RST Customer Number
045300210712     I                                        4   9 P1CUST
045400210712     I/COPY WNCPYSRC,SDH00313
045500210712      * I : RST Transaction Type
045600210712     I                                       50  51 P1TRTY
045700210712      * I : RST Sub-Type                                                                      CSD095
045800210712     I                                       52  53 P1STYP                                    CSD095
045900210712      * I : RST Branch                                                                        CSD095
046000210712     I                                       54  56 P1BRCA                                    CSD095
046100210712      * O : MAP Def Conf Snd to Rec Inf 1
046200210712     I                                      691 725 P1DSR1
046300210712      * O : MAP Def Conf Snd to Rec Inf 2
046400210712     I                                      726 760 P1DSR2
046500210712      * O : MAP Def Conf Snd to Rec Inf 3
046600210712     I                                      761 795 P1DSR3
046700210712      * O : MAP Def Conf Snd to Rec Inf 4
046800210712     I                                      796 830 P1DSR4
046900210712      * O : MAP Def Conf Snd to Rec Inf 5
047000210712     I                                      831 865 P1DSR5
047100210712      * O : MAP Def Conf Snd to Rec Inf 6
047200210712     I                                      866 900 P1DSR6
047300210712      * O : MAP Sett Conf Sndr-Rcvr Inf 1
047400210712     I                                      901 935 P1SSR1
047500210712      * O : MAP Sett Conf Sndr-Rcvr Inf 2
047600210712     I                                      936 970 P1SSR2
047700210712      * O : MAP Sett Conf Sndr-Rcvr Inf 3
047800210712     I                                      9711005 P1SSR3
047900210712      * O : MAP Sett Conf Sndr-Rcvr Inf 4
048000210712     I                                     10061040 P1SSR4
048100210712      * O : MAP Sett Conf Sndr-Rcvr Inf 5
048200210712     I                                     10411075 P1SSR5
048300210712      * O : MAP Sett Conf Sndr-Rcvr Inf 6
048400210712     I                                     10761110 P1SSR6
048500210712      * O : MAP FRA/IRS Conf Conditions 1
048600210712     I                                     11111145 P1CND1
048700210712      * O : MAP FRA/IRS Conf Conditions 2
048800210712     I                                     11461180 P1CND2
048900210712      * O : MAP FRA/IRS Conf Conditions 3
049000210712     I                                     11811215 P1CND3
049100210712      * O : MAP FRA/IRS Conf Conditions 4
049200210712     I                                     12161250 P1CND4
049300210712      * O : MAP FRA/IRS Conf Conditions 5
049400210712     I                                     12511285 P1CND5
049500210712      * O : MAP FRA/IRS Conf Conditions 6
049600210712     I                                     12861320 P1CND6
049700210712      * O : MAP Version of ISDA Rules
049800210712     I                                     13211324 P1ISDA
049900210712      * O : MAP Type of ISDA agreement
050000210712     I                                     13251330 P1AGTY
050100210712      * O : MAP Date of ISDA Agreement
050200210712     I                                     13311336 P1AGDT
050300210712      * O : MAP Version of ISDA Agreement
050400210712     I*************************************13371338 P1AGVV                CSW097
050500210712     I                                     13371340 P1AGVV                CSW097
050600210712      * I : MAP Effective Date                                                               BUG6329
050700210712     I                                    P134113430P1EFFD                                   BUG6329
050800210712     IP2PARM      DS
050900210712      * I : MAP Action Code
051000210712     I                                        1   1 P2ANCD
051100210712     IP3PARM      DS
051200210712      * O : MAP Duplicate Return Code
051300210712     I                                        1   7 P3DRTC
051400210712     I***P4PARM*     DS                            351                                        CGL029
051500210712     IP4PARM      DS                            361                                           CGL029
051600210712      * RCD: Extended Settlement Parms Retrieval index
051700210712      * I : MAP Calling Program Code
051800210712     I                                        2   5 P4CPGC
051900210712      * I : MAP Calling Transaction Type
052000210712     I                                        6   7 P4CTTY
052100210712      * I : MAP customer number/sname
052200210712     I                                        8  17 P4CUNS
052300210712      * I : MAP Date Of Receipt, Our Nost
052400210712     I                                    P  18  200P4DRON
052500210712      * I : MAP Date Of Payment, Our Nost
052600210712     I                                    P  21  230P4DPON
052700210712      * I : MAP Receive Currency Code
052800210712     I                                       24  26 P4RCCD
052900210712      * I : MAP Federal Funds Indicator
053000210712     I                                       30  30 P4FFIN
053100210712      * I : MAP Branch code
053200210712     I                                       31  33 P4BRCD
053300210712      * I : MAP Protect Receipt Instructs
053400210712     I                                       34  34 P4PRI
053500210712      * I : MAP Protect Payment Instructs
053600210712     I                                       35  35 P4PPI
053700210712      * I : MAP Command Key Entered
053800210712     I                                       36  37 P4CKYE
053900210712      * I : MAP Validation Only
054000210712     I                                       38  38 P4VLON
054100210712      * I : MAP Settlement Details Valid
054200210712     I                                       39  39 P4SDV
054300210712      * I : MAP Termination Parameter
054400210712     I                                       40  40 P4TRPA
054500210712      * I : MAP first call for insert
054600210712     I                                       41  41 P4FCFI
054700210712      * I : MAP Recpt - intermed bank no.
054800210712     I                                       42  51 P4IBNR
054900210712      * I : MAP Rcpt - Ordering bank num
055000210712     I                                       52  61 P4OBNR
055100210712      * I : MAP Rcpt - Ordering cust no.
055200210712     I                                       62  71 P4OCSR
055300210712      * I : MAP Pay - Intermed Bank num
055400210712     I                                       72  81 P4IBNP
055500210712      * I : MAP Pay - Ordering Bank No.
055600210712     I                                       82  91 P4OBNP
055700210712      * I : MAP Pay - Ordering Cust No.
055800210712     I                                       92 101 P4OCSP
055900210712      * I : MAP Receiver Corr. No.
056000210712     I                                      102 111 P4CNOR
056100210712      * I : MAP Recipient of MT100
056200210712     I                                      112 121 P4RMT1
056300210712      * I : MAP A/C with bank number
056400210712     I                                      122 131 P4ACWB
056500210712      * I : MAP Beneficiary No.
056600210712     I                                      132 141 P4BYNO
056700210712      * I : MAP Retail Present
056800210712     I                                      142 142 P4REPR
056900210712      * I : MAP Retail A/C Nos. Supported
057000210712     I                                      143 143 P4RANS
057100210712      * I : MAP Account Code
057200210712     I**********                            144 147 P4ACCD                                    CGL029
057300210712     I                                      144 147 QQACC2                                    CGL029
057400210712      * I : MAP Chips Module
057500210712     I                                      148 148 P4CHMD
057600210712      * I : MAP Back value period parm
057700210712     I                                      149 1510P4BVPP
057800210712      * I : MAP Run day number
057900210712     I                                    P 152 1540P4RDNB
058000210712      * I : MAP Database error file
058100210712     I                                      155 159 P4DBEF
058200210712      * I : MAP Database error key
058300210712     I                                      160 188 P4DBEK
058400210712      * I : MAP program name
058500210712     I                                      189 196 P4PGNM
058600210712      * I : MAP Database error number
058700210712     I                                      197 198 P4DBEN
058800210712      * I : MAP error codes
058900210712     I                                      199 348 P4ERCS
059000210712      * I : MAP Default Fields
059100210712     I                                      349 349 P4DFLD
059200210712      * I : MAP Default Receipt Side
059300210712     I                                      350 350 P4DFRS
059400210712      * I : MAP Defaulting Occurred
059500210712     I                                      351 351 P4DOCC
059600210712     I                                      352 361 P4ACCD                                    CGL029
059700210712     I            DS
059800210712     I                                        1 132 ZAMSDA
059900210712      * Message data for 'STD FTR:DTLSCR Delete/1'
060000210712      * Message data for 'STD FTR:DTLSCR New Rec/1'
060100210712      * Message data for 'STD FTR:DTLSCR New Rec/1'
060200210712      * Message data for 'Def Conf Snd-Rcv inf  INV'
060300210712      * Def Conf Snd to Rec Inf 1
060400210712     I                                        1  35 ZA0001
060500210712      * Def Conf Snd to Rec Inf 2
060600210712     I                                       36  70 ZA0002
060700210712      * Def Conf Snd to Rec Inf 3
060800210712     I                                       71 105 ZA0003
060900210712      * Def Conf Snd to Rec Inf 4
061000210712     I                                      106 140 ZA0004
061100210712      * Def Conf Snd to Rec Inf 5
061200210712     I                                      141 175 ZA0005
061300210712      * Def Conf Snd to Rec Inf 6
061400210712     I                                      176 210 ZA0006
061500210712      * Message data for 'Sett/rst Conf Snd-Rcv INV'
061600210712      * Sett Conf Sndr-Rcvr Inf 1
061700210712     I                                        1  35 ZA0007
061800210712      * Sett Conf Sndr-Rcvr Inf 2
061900210712     I                                       36  70 ZA0008
062000210712      * Sett Conf Sndr-Rcvr Inf 3
062100210712     I                                       71 105 ZA0009
062200210712      * Sett Conf Sndr-Rcvr Inf 4
062300210712     I                                      106 140 ZA0010
062400210712      * Sett Conf Sndr-Rcvr Inf 5
062500210712     I                                      141 175 ZA0011
062600210712      * Sett Conf Sndr-Rcvr Inf 6
062700210712     I                                      176 210 ZA0012
062800210712      * Message data for 'FRA/IRS Conf. Conds   INV'
062900210712      * FRA/IRS Conf Conditions 1
063000210712     I                                        1  35 ZA0013
063100210712      * FRA/IRS Conf Conditions 2
063200210712     I                                       36  70 ZA0014
063300210712      * FRA/IRS Conf Conditions 3
063400210712     I                                       71 105 ZA0015
063500210712      * FRA/IRS Conf Conditions 4
063600210712     I                                      106 140 ZA0016
063700210712      * FRA/IRS Conf Conditions 5
063800210712     I                                      141 175 ZA0017
063900210712      * FRA/IRS Conf Conditions 6
064000210712     I                                      176 210 ZA0018
064100210712      * Message data for 'FRA/IRS Conf. Cond. 1 INV'
064200210712      * FRA/IRS Conf Conditions 1
064300210712     I                                        1  35 ZA0019
064400210712      * Message data for 'Condition 1 Mandatory'
064500210712      * FRA/IRS Conf Conditions 1
064600210712     I                                        1  35 ZA0020
064700210712      * Message data for 'Type of ISDA Agreemnt INV'
064800210712      * Type of ISDA agreement
064900210712     I                                        1   6 ZA0021
065000210712      * Message data for 'Date of ISDA Agreemnt INV'
065100210712      * Date of ISDA Agreement
065200210712     I                                        1   6 ZA0022
065300210712      * Message data for 'Date of ISDA Agreemnt INV'
065400210712      * Date of ISDA Agreement
065500210712     I                                        1   6 ZA0023
065600210712      * Message data for 'Vers of ISDA Agreemnt INV'
065700210712      * Version of ISDA Agreement
065800210712     I*************                           1   2 ZA0024                CSW097
065900210712     I                                        1   4 ZA0024                CSW097
066000210712      * Message data for 'Version of ISDA Rules INV'
066100210712      * Version of ISDA Rules
066200210712     I                                        1   4 ZA0025
066300210712      * Message data for 'STD FTR:KEYSCR /1'
066400210712      *                                                                                       CSD012
066500210712     ISCSARD    E DSSCSARDPD                                                                  CSD012
066600210712      **  External data structures for Switchable Features Details                            CSD012
066700210712     I              LCD                             LCD1                                      CSD012
066800210712      *                                                                                       CSD012
066900210712      * Data structure for AOSVALR0 string                                                    CSD012
067000210712     I            DS                                                                          CSD012
067100210712     I                                        1 200 SVAL1                                     CSD012
067200210712     I                                        1   1 SVAL11                                    CSD012
067300210712      *                                                                                       CSD012
067400210712      * System Value                                                                          CSD012
067500210712     I            DS                                                                          CSD012
067600210712     I I            'AuthReqExtdSettle   '    1  20 SVALK1                                    CSD012
067700210712      *                                                                                       CSD012
067800210712     I            DS                                                                          CSD012
067900210712     I I            'Extended Settlements'    1  21 FUNCD                                     CSD012
068000210712      ** Declare SWIFTACTV constant                                                           CSW221
068100210712      *                                                                                       CSW221
068200210712     I              'SWIFTACTV'           C         SWIFT                                     CSW221
068300210712      /EJECT
068400210712      *****************************************************************
068500210712      * Entry parameters
068600210712     C           *ENTRY    PLIST
068700210712     C                     PARM           P0RTN   7
068800210712     C                     PARM           P1PARM           RCD: Extended S
068900210712     C           P2ANCD    PARM           WP0001  1        Action Code
069000210712     C           P3DRTC    PARM P3DRTC    WP0002  7        Duplicate Retur
069100210712     C                     PARM           P4PARM           RCD: Extended S
069200210712     C                     PARM           WCOVER  1                                           CSW212
069300210712      *****************************************************************
069400210712      * Initialize
069500210712     C                     EXSR ZZINIT
069600210712      *
069700210712      * Check passed parameters
069800210712     C                     EXSR FACKPM
069900210712      * Perform once if all passed, else repeat
070000210712     C           W0RPT     DOUEQ'N'
070100210712      * Display and process key screen
070200210712     C                     EXSR BADSKY
070300210712     C                     END
070400210712      * Terminate program
070500210712     C                     EXSR ZXEXPG
070600210712      *****************************************************************
070700210712      /EJECT
070800210712     CSR         BADSKY    BEGSR
070900210712      *================================================================
071000210712      * Display and process key screen
071100210712      *================================================================
071200210712      * Initialize key screen
071300210712     C                     EXSR MDIZ#K
071400210712      * Bypass first display of key screen is possible
071500210712     C                     MOVEL'Y'       W0BYP   1
071600210712      * Signal start of transaction
071700210712     C                     MOVEL'Y'       W0TRN   1
071800210712     C           W0TRN     DOWEQ'Y'
071900210712     C           W0TRN     OREQ 'K'
072000210712      * Ensure transaction continues (if reset)
072100210712     C                     MOVEL'Y'       W0TRN   1
072200210712      * Conduct screen conversation
072300210712     C           W0TRN     DOWEQ'Y'
072400210712      * Is bypass key screen still viable?
072500210712     C           W0BYP     IFEQ 'Y'
072600210712     C           #1CYCD    IFEQ *BLANK                     Currency Code
072700210712     C           #1CUST    OREQ *BLANK                     Customer Number
072800210712     C           #1TRTY    OREQ *BLANK                     Transaction Typ
072900210712      * One or more key fields is blank
073000210712     C           *IN05     OREQ '1'
073100210712      * HOME: Reset screen fields
073200210712     C                     MOVEL'N'       W0BYP
073300210712     C                     END
073400210712     C                     END
073500210712      * Bypass key screen
073600210712     C           W0BYP     IFNE 'Y'
073700210712      * Display key screen
073800210712     C                     EXSR BBEXFM
073900210712     C                     END
074000210712      * Cancel key screen bypass
074100210712     C                     MOVEL'N'       W0BYP
074200210712      * Process response to key screen
074300210712      * Cancel & exit program
074400210712     C   03                CAS            ZXEXPG
074500210712      * Switch between *ADD/*CHANGE modes
074600210712     C   09                CAS            BCCHMD
074700210712      * HOME: Reset screen fields
074800210712     C   05                CAS            BDHMKY
074900210712      * Process key screen input
075000210712     C                     CAS            BEPRKY
075100210712     C                     END
075200210712     C           W0TRN     DOWEQ'R'
075300210712     C                     MOVEL'Y'       W0TRN
075400210712     C                     EXSR BEPRKY
075500210712     C                     END
075600210712      *
075700210712     C                     END
075800210712     C                     END
075900210712      *================================================================
076000210712     CSR         BAEXIT    ENDSR
076100210712      /EJECT
076200210712     CSR         BBEXFM    BEGSR
076300210712      *================================================================
076400210712      * Display key screen and process HELP requests
076500210712      *================================================================
076600210712      * Set screen conditioning indicators
076700210712     C                     EXSR GADSAK
076800210712      * Update screen time
076900210712     C                     TIME           ##TME
077000210712     C           W0HLP     DOUEQ'N'
077100210712     C                     MOVEL'N'       W0HLP   1
077200210712     C                     MOVE *IN25     HELP25  1
077300210712     C                     MOVE *ALL'0'   ##OFF  30
077400210712     C                     MOVEA##OFF     *IN,1
077500210712     C                     MOVE HELP25    *IN25
077600210712      * PUTOVR unless conditioned fields change
077700210712     C                     SETON                         86*
077800210712     C           *IN89     IFNE BBIN89
077900210712     C                     SETOF                         86*
078000210712     C                     END
078100210712     C                     MOVE *IN89     BBIN89  1
078200210712      * Set cursor by *SET CURSOR data
078300210712     C           YSETCS    IFEQ 'Y'
078400210712     C                     EXSR Y0SET
078500210712     C                     END
078600210712     C                     WRITE#MSGCTL
078700210712     C                     WRITE#CMDTXT1
078800210712     C                     EXFMT#RCDKEY
078900210712      * Test cursor
079000210712     C                     EXSR Y8TST
079100210712      * Clear set cursor DDS indicator
079200210712     C           WCSRLC    IFEQ 'OFF'
079300210712     C                     SETOF                     94    *
079400210712     C                     END
079500210712     C                     MOVE *BLANK    WCSRLC
079600210712      * If help requested, display help text
079700210712     C   25                EXSR ZHHPKY
079800210712     C                     END
079900210712      * Update job time
080000210712     C                     TIME           ##JTM
080100210712      * Clear messages from program message queue
080200210712     C                     CALL 'Y2CLMSC'
080300210712     C                     PARM ##PGM     ZAPGMQ 10
080400210712     C                     PARM '*SAME'   ZAPGRL  5
080500210712      * Reset first message only flag
080600210712     C                     MOVEL'Y'       ZAFSMS  1
080700210712      * Reset global error indicator
080800210712     C                     SETOF                         99*
080900210712     C           YSETCS    IFEQ 'Y'
081000210712     C                     EXSR Y9CLR
081100210712     C                     END
081200210712      *================================================================
081300210712     CSR         BBEXIT    ENDSR
081400210712      /EJECT
081500210712     CSR         BCCHMD    BEGSR
081600210712      *================================================================
081700210712      * Switch between *ADD/*CHANGE modes
081800210712      *================================================================
081900210712     C           W0PMD     IFEQ 'ADD'
082000210712     C                     MOVEL'CHG'     W0PMD   3
082100210712     C                     ELSE
082200210712     C                     MOVEL'ADD'     W0PMD
082300210712     C                     END
082400210712      *================================================================
082500210712     CSR         BCEXIT    ENDSR
082600210712      /EJECT
082700210712     CSR         BDHMKY    BEGSR
082800210712      *================================================================
082900210712      * Process HOME key
083000210712      *================================================================
083100210712     C                     MOVEL'N'       W0TRN
083200210712      *================================================================
083300210712     CSR         BDEXIT    ENDSR
083400210712      /EJECT
083500210712     CSR         BEPRKY    BEGSR
083600210712      *================================================================
083700210712      * Process key screen input
083800210712      *================================================================
083900210712      * Initialise detail screen
084000210712     C                     EXSR MAIZ#1
084100210712      * Validate key fields
084200210712     C                     EXSR BFVLKY
084300210712     C           *IN99     CABEQ'1'       BEEXIT
084400210712      * Check for existing record
084500210712     C           KRTV      KLIST
084600210712     C                     KFLD           BYCYCD           Currency Code
084700210712     C                     KFLD           BYCUST           Customer Number
084800210712     C                     KFLD           BYTRTY           Transaction Typ
084900210712     C                     KFLD           BYBRCA           Branch                             CSD095
085000210712     C                     KFLD           BYSTYP           Sub-Type                           CSD095
085100210712     C/COPY WNCPYSRC,SDH00314
085200210712      * Define keylist for SDEXSTL9                                                          BUG6329
085300210712     C           KEXTLA    KLIST                                                             BUG6329
085400210712     C                     KFLD           BYCUST           Customer Number                   BUG6329
085500210712     C                     KFLD           BYCYCD           Currency Code                     BUG6329
085600210712     C                     KFLD           BYTRTY           Transaction Typ                   BUG6329
085700210712     C                     KFLD           BYEFFD           Effective Date                    BUG6329
085800210712     C                     KFLD           BYBRCA           Branch                             CSD095
085900210712     C                     KFLD           BYSTYP           Deal Sub-Type                      CSD095
086000210712      * Setup key
086100210712     C/COPY WNCPYSRC,SDH00315
086200210712     C                     MOVEL#1CYCD    BYCYCD           Currency Code
086300210712     C                     MOVEL#1CUST    BYCUST           Customer Number
086400210712     C                     MOVEL#1TRTY    BYTRTY           Transaction Typ
086500210712     C                     MOVEL#1BRCA    BYBRCA           Branch                             CSD095
086600210712     C                     MOVEL#1STYP    BYSTYP           Sub-Type                           CSD095
086700210712     C           CDL031    IFEQ 'Y'                                                          BUG6329
086800210712     C                     Z-ADDP1EFFD    BYEFFD                                             BUG6329
086900210712     C           KEXTLA    CHAINSDEXSTL9            N9091                                    BUG6329
087000210712     C                     ELSE                                                              BUG6329
087100210712     C/COPY WNCPYSRC,SDH00316
087200210712     C           KRTV      CHAIN@BYREFY              9091  *
087300210712     C/COPY WNCPYSRC,SDH00317
087400210712     C                     ENDIF                                                             BUG6329
087500210712     C           *IN91     IFEQ '1'
087600210712      * Record locked
087700210712     C                     SETON                     993132*
087800210712     C                     SETON                     33    *
087900210712     C                     GOTO BEEXIT
088000210712     C                     END                             FI 91
088100210712      *
088200210712      * Verify record existence against program mode
088300210712     C           W0PMD     IFNE 'ADD'
088400210712      * If record does not exist, error
088500210712     C           *IN90     IFEQ '1'
088600210712     C                     SETON                     993132*
088700210712     C                     SETON                     33    *
088800210712      * Send message 'Extended Settlements   NF'
088900210712     C                     MOVEL'USR0361' ZAMSID
089000210712     C                     EXSR ZASNMS
089100210712     C                     ELSE
089200210712     C                     EXSR MBFL#1
089300210712      * CALC: Detail screen function fields
089400210712      * 00/Copy Member SD0402RSFF - Extended Settlements  *
089500210712     C*Ext Stlmnts Mnt(FRA/IRS) Calc Detail Function Flds
089600210712     C/COPY WNCPYSRC,SD0402RSFF
089700210712      * USER: Initialize detail screen (existing record)
089800210712      * Set up Detail Screen Footer
089900210712     C                     EXSR UASUBR                     Set up Detail S
090000210712      * 00/Copy Member SD0402RISE - Extended Settlements  *
090100210712     C*Ext Stlmnts Mnt(FRA/IRS) Initialise Dtl Exist Rcd
090200210712     C/COPY WNCPYSRC,SD0402RISE
090300210712     C                     END
090400210712      *
090500210712     C                     ELSE
090600210712      * If record already exists, error
090700210712     C           *IN90     IFEQ '0'
090800210712     C                     SETON                     993132*
090900210712     C                     SETON                     33    *
091000210712      * Send message 'Extended Settlements   EX'
091100210712     C                     MOVEL'USR0362' ZAMSID
091200210712     C                     EXSR ZASNMS
091300210712     C                     ELSE
091400210712      * USER: Initialize detail screen (new record)
091500210712      * Setup message data for message
091600210712      * Retrieve message STD FTR:DTLSCR New Rec/1
091700210712     C                     MOVELZADFMF    ZAMSGF
091800210712     C                     CALL 'Y2RVMGC'              90  *
091900210712     C                     PARM *BLANK    W0RTN   7        Return code
092000210712     C                     PARM 'USR2919' ZAMSID  7        Message ID
092100210712     C                     PARM           ZAMSGF 10        Message file
092200210712     C                     PARM           ZAMSDA132        Message data
092300210712     C           WUSFT1    PARM           W0MTX 132        Returned messag
092400210712     C                     MOVEL*BLANK    ZAMSDA
092500210712     C                     MOVEL*BLANK    ZAMSGF
092600210712      * Move to Single Footer - Standard Functions  *
092700210712     C                     MOVELWUSFT1    ##CTX1                          S01229
092800210712      * 00/Copy Member SD0402RISN - Extended Settlements  *
092900210712     C*Ext Stlmnts Mnt(FRA/IRS) Initialise Dtl New Rcd
093000210712     C/COPY WNCPYSRC,SD0402RISN
093100210712      *                                                                                     MD022843
093200210712      * Default ISDA fields with value from ICD if FRA/IRS type                             MD022843
093300210712      *                                                                                     MD022843
093400210712     C           #1TRTY    IFEQ 'RS'                                                        MD022843
093500210712     C           #1TRTY    OREQ 'RX'                                                        MD022843
093600210712     C           #1TRTY    OREQ 'DV'                                                        MD022843
093700210712     C           CDL031    ANDEQ'Y'                                                         MD022843
093800210712      *                                                                                     MD022843
093900210712     C           *LOVAL    SETLLSDFAISL1                                                    MD022843
094000210712     C                     READ SDFAISL1            N    60                                 MD022843
094100210712      *                                                                                     MD022843
094200210712     C           *IN60     IFEQ '0'                                                         MD022843
094300210712     C                     MOVELBQISDA    #1ISDA                                            MD022843
094400210712     C                     MOVELBQAGTY    #1AGTY                                            MD022843
094500210712     C                     MOVELBQAGDT    #1AGDT                                            MD022843
094600210712     C**********           MOVELBQAGVV    #1AGVV                                  MD022843 MD022843A
094700210712     C**********           MOVE BQAGVC    #1AGVV                                  MD022843 MD022843A
094800210712     C                     MOVELBQAGVC    #1AGVV                                           MD022843A
094900210712     C                     MOVE BQAGVV    #1AGVV                                           MD022843A
095000210712     C                     ENDIF                                                            MD022843
095100210712      *                                                                                     MD022843
095200210712     C                     ENDIF                                                            MD022843
095300210712      *                                                                                     MD022843
095400210712     C                     END
095500210712     C                     END
095600210712      *..................................................
095700210712     C   99                GOTO BEEXIT
095800210712      * No error: Display and process details
095900210712     C                     EXSR CADSDA
096000210712      *
096100210712      *================================================================
096200210712     CSR         BEEXIT    ENDSR
096300210712      /EJECT
096400210712     CSR         BFVLKY    BEGSR
096500210712      *================================================================
096600210712      * Validate key fields
096700210712      *================================================================
096800210712      * Validate Transaction Type
096900210712     C                     MOVEL*BLANK    W0RTN
097000210712     C                     MOVEL#1TRTY    W0NSRQ  1        Transaction Typ
097100210712      * Name search required?
097200210712     C           W0NSRQ    IFEQ '?'
097300210712     C                     CALL 'Y2VLLSR'              90  *
097400210712     C                     PARM           W0RTN   7
097500210712     C                     PARM 1110281   Y2LSNO  70
097600210712     C           #1TRTY    PARM #1TRTY    W0EXVL 20        Transaction Typ
097700210712      * Defer confirm
097800210712     C                     MOVEL'Y'       W0DCF   1
097900210712     C                     END
098000210712      *
098100210712     C           W0PMD     IFNE 'ADD'
098200210712      * Select existing record
098300210712     C                     EXSR VACKRL
098400210712     C                     END
098500210712      * USER: Validate key screen
098600210712      * 00/Copy Member SD0402RVKS - Extended Settlements  *
098700210712     C*Ext Stlmnts Mnt(FRA/IRS) Validate Key Screen
098800210712     C/COPY WNCPYSRC,SD0402RVKS
098900210712      * Currency Code required
099000210712     C           #1CYCD    IFEQ *BLANK                     IF
099100210712     C                     SETON                     9931  *
099200210712      * Send message '*Value required'
099300210712     C                     MOVEL'Y2U0001' ZAMSID
099400210712     C                     MOVEL'Y2USRMSG'ZAMSGF
099500210712     C                     EXSR ZASNMS
099600210712     C                     END                             FI
099700210712      * Customer Number required
099800210712     C           #1CUST    IFEQ *BLANK                     IF
099900210712     C                     SETON                     9932  *
100000210712      * Send message '*Value required'
100100210712     C                     MOVEL'Y2U0001' ZAMSID
100200210712     C                     MOVEL'Y2USRMSG'ZAMSGF
100300210712     C                     EXSR ZASNMS
100400210712     C                     END                             FI
100500210712      * Transaction Type required
100600210712     C           #1TRTY    IFEQ *BLANK                     IF
100700210712     C                     SETON                     9933  *
100800210712      * Send message '*Value required'
100900210712     C                     MOVEL'Y2U0001' ZAMSID
101000210712     C                     MOVEL'Y2USRMSG'ZAMSGF
101100210712     C                     EXSR ZASNMS
101200210712     C                     END                             FI
101300210712      *================================================================
101400210712     CSR         BFEXIT    ENDSR
101500210712      /EJECT
101600210712     CSR         CADSDA    BEGSR
101700210712      *================================================================
101800210712      * Display and process detail screen
101900210712      *================================================================
102000210712      * Conduct detail screen conversation
102100210712      * - repeat until screen control flag is reset:
102200210712     C           W0TRN     DOWEQ'Y'
102300210712      * Display detail screen
102400210712     C                     EXSR CBEXFM
102500210712      * Process response to detail screen
102600210712      * Cancel & exit program
102700210712     C   03                CAS            ZXEXPG
102800210712      * Redisplay previous screen
102900210712     C   12                CAS            CCDSPV
103000210712      * HOME: Reset screen fields
103100210712     C   05                CAS            CCDSPV
103200210712      * Process detail screen input
103300210712     C                     CAS            CFPRSC
103400210712     C                     END
103500210712     C           W0TRN     IFEQ 'R'
103600210712     C           W0PMD     IFEQ 'ADD'
103700210712     C                     EXSR MAIZ#1
103800210712     C                     END
103900210712     C                     END
104000210712      *
104100210712     C                     END
104200210712      *================================================================
104300210712     CSR         CAEXIT    ENDSR
104400210712      /EJECT
104500210712     CSR         CBEXFM    BEGSR
104600210712      *================================================================
104700210712      * Display screen and process HELP requests
104800210712      *================================================================
104900210712      * Set screen conditioning indicators
105000210712     C                     EXSR GBDSAD
105100210712      * Update screen time
105200210712     C                     TIME           ##TME
105300210712     C           W0HLP     DOUEQ'N'
105400210712     C                     MOVEL'N'       W0HLP   1
105500210712     C                     MOVE *IN25     HELP25  1
105600210712     C                     MOVE *ALL'0'   ##OFF  30
105700210712     C                     MOVEA##OFF     *IN,1
105800210712     C                     MOVE HELP25    *IN25
105900210712      * PUTOVR unless conditioned fields change
106000210712     C                     SETON                         86*
106100210712     C           *IN89     IFNE CBIN89
106200210712     C                     SETOF                         86*
106300210712     C                     END
106400210712     C                     MOVE *IN89     CBIN89  1
106500210712      * Set cursor by *SET CURSOR data
106600210712     C           YSETCS    IFEQ 'Y'
106700210712     C                     EXSR Y1SET
106800210712     C                     END
106900210712     C                     WRITE#MSGCTL
107000210712     C                     WRITE#CMDTXT2
107100210712     C                     EXFMT#RCDDTL1
107200210712      * Test cursor
107300210712     C                     EXSR Y8TST
107400210712      * Clear set cursor DDS indicator
107500210712     C           WCSRLC    IFEQ 'OFF'
107600210712     C                     SETOF                     94    *
107700210712     C                     END
107800210712     C                     MOVE *BLANK    WCSRLC
107900210712      * If help requested, display help text
108000210712     C   25                EXSR ZHHPKY
108100210712     C                     END
108200210712      * Update job time
108300210712     C                     TIME           ##JTM
108400210712      * Clear messages from program message queue
108500210712     C                     CALL 'Y2CLMSC'
108600210712     C                     PARM ##PGM     ZAPGMQ 10
108700210712     C                     PARM '*SAME'   ZAPGRL  5
108800210712      * Reset first message only flag
108900210712     C                     MOVEL'Y'       ZAFSMS  1
109000210712      * Reset global error indicator
109100210712     C                     SETOF                         99*
109200210712     C           YSETCS    IFEQ 'Y'
109300210712     C                     EXSR Y9CLR
109400210712     C                     END
109500210712      *================================================================
109600210712     CSR         CBEXIT    ENDSR
109700210712      /EJECT
109800210712     CSR         CCDSPV    BEGSR
109900210712      *================================================================
110000210712      * Redisplay previous screen
110100210712      *================================================================
110200210712      * USER: Process key screen request
110300210712     C                     MOVEL'USR0790' P3DRTC           Duplicate Retur
110400210712     C                     MOVEL*BLANK    P0RTN            *Return code
110500210712     C                     EXSR ZYEXPG
110600210712      * 00/Copy Member SD0402RPKR - Extended Settlements  *
110700210712     C*Ext Stlmnts Mnt(FRA/IRS) Process Key Screen Rqst
110800210712     C/COPY WNCPYSRC,SD0402RPKR
110900210712     C   05                MOVEL'R'       W0TRN
111000210712     C   12                MOVEL'K'       W0TRN
111100210712      *================================================================
111200210712     CSR         CCEXIT    ENDSR
111300210712      /EJECT
111400210712     CSR         CFPRSC    BEGSR
111500210712      *================================================================
111600210712      * Validate record
111700210712      *================================================================
111800210712      * Confirm/update is not deferred
111900210712     C                     MOVEL'N'       W0DCF   1
112000210712      * Validate details
112100210712     C                     EXSR DCVLDL
112200210712      * QUIT if error:
112300210712     C   99                GOTO CFEXIT
112400210712      * Defer confirm/update requested
112500210712     C           W0DCF     CABEQ'Y'       CFEXIT
112600210712      * No error: update record
112700210712     C                     EXSR EBPR##
112800210712      *================================================================
112900210712     CSR         CFEXIT    ENDSR
113000210712      /EJECT
113100210712     CSR         DCVLDL    BEGSR
113200210712      *================================================================
113300210712      * Validate details
113400210712      *================================================================
113500210712      * Validate Type of ISDA agreement
113600210712     C                     MOVEL*BLANK    W0RTN
113700210712     C                     MOVEL#1AGTY    W0NSRQ  1        Type of ISDA ag
113800210712     C           CSW214    IFEQ 'Y'                                                           CSW214
113900210712     C                     Z-ADD1205534   Y2LSNO                                              CSW214
114000210712     C                     ELSE                                                               CSW214
114100210712     C                     Z-ADD1205532   Y2LSNO                                              CSW214
114200210712     C                     ENDIF                                                              CSW214
114300210712      *                                                                                       CSW221
114400210712     C           CSW221    IFEQ 'Y'                                                           CSW221
114500210712     C           #1TRTY    IFEQ 'AT'                                                          CSW221
114600210712     C           #1TRTY    OREQ 'FX'                                                          CSW221
114700210712     C           #1TRTY    OREQ 'OP'                                                          CSW221
114800210712     C           #1TRTY    OREQ 'FF'                                                          CSW221
114900210712     C           #1TRTY    OREQ 'CL'                                                          CSW221
115000210712     C           CDL008    ANDEQ'Y'                                                           CSW221
115100210712     C                     Z-ADD1205535   Y2LSNO                                              CSW221
115200210712     C                     ENDIF                                                              CSW221
115300210712     C                     ENDIF                                                              CSW221
115400210712      *                                                                                       CSW221
115500210712      * Name search required?
115600210712     C           W0NSRQ    IFEQ '?'
115700210712     C                     CALL 'Y2VLLSR'              90  *
115800210712     C                     PARM           W0RTN   7
115900210712     C**********           PARM 1205532   Y2LSNO  70                                          CSW214
116000210712     C                     PARM           Y2LSNO  70                                          CSW214
116100210712     C           #1AGTY    PARM #1AGTY    W0EXVL 20        Type of ISDA ag
116200210712      * Defer confirm
116300210712     C                     MOVEL'Y'       W0DCF   1
116400210712     C                     END
116500210712      *
116600210712      * USER: Validate detail screen fields
116700210712     C                     MOVEL*BLANK    WUCPGC           Calling Program
116800210712     C                     MOVEL'SSI'     WUCPGC           Calling Program
116900210712     C                     MOVEL'N'       WUSDV            Settlement Deta
117000210712      * Validate Details - Extended Settlements  *
117100210712     C                     CLEARPARC
117200210712     C                     MOVEL#1RSTY    PARSTY           Receipt - Settl
117300210712     C                     MOVEL#1RONO    PARONO           Receipt - Our N
117400210712     C                     MOVEL#1ROBN    PAROBN           Rcpt - Ordering
117500210712     C                     MOVEL#1ROCS    PAROCS           Rcpt - Ordering
117600210712     C                     MOVEL#1RIBN    PARIBN           Rcpt - Intermed
117700210712     C                     MOVEL#1RIBL    PARIBL           Rcpt - I/m Bank
117800210712     C                     MOVEL#1PSTY    PAPSTY           Pay - Settlemen
117900210712     C                     MOVEL#1PONO    PAPONO           Pay - Our Nostr
118000210712     C                     MOVEL#1POBN    PAPOBN           Pay - Ordering
118100210712     C                     MOVEL#1POCS    PAPOCS           Pay - Ordering
118200210712     C                     MOVEL#1PIBN    PAPIBN           Pay - Intermed
118300210712     C                     MOVEL#1PIBA    PAPIBA           Pay - I/m Bank
118400210712     C                     MOVEL#1RCNO    PARCNO           Receiver Corres
118500210712     C                     MOVEL#1RCAL    PARCAL           Receiver Corr.
118600210712     C                     MOVEL#1RCNB    PARCNB           Receiver Number
118700210712     C                     MOVEL#1ACBN    PAACBN           A/c With Bank N
118800210712     C                     MOVEL#1ACBL    PAACBL           A/c With Bank L
118900210712     C                     MOVEL#1BYNB    PABYNB           Beneficiary Num
119000210712     C                     MOVEL#1BACL    PABACL           Beneficiary A/c
119100210712     C                     MOVEL#1DPY1    PADPY1           Details of Paym
119200210712     C                     MOVEL#1DPY2    PADPY2           Details of Paym
119300210712     C                     MOVEL#1DPY3    PADPY3           Details of Paym
119400210712     C                     MOVEL#1DPY4    PADPY4           Details of Paym
119500210712     C                     MOVEL#1DECG    PADECG           Details of char
119600210712     C                     MOVEL#1BBI1    PABBI1           Bank to Bank In
119700210712     C                     MOVEL#1BBI2    PABBI2           Bank to Bank In
119800210712     C                     MOVEL#1BBI3    PABBI3           Bank to Bank In
119900210712     C                     MOVEL#1BBI4    PABBI4           Bank to Bank In
120000210712     C                     MOVEL#1BBI5    PABBI5           Bank to Bank In
120100210712     C                     MOVEL#1BBI6    PABBI6           Bank to Bank In
120200210712     C                     MOVEL#1CVMR    PACVMR           Cover Message R
120300210712     C                     MOVEL#1ORBR    PAORBR           Our Receive Bra
120400210712     C                     MOVEL#1OPBR    PAOPBR           Our Payment Bra
120500210712     C                     CLEARPBRC
120600210712     C                     MOVELWUANCD    PBANCD           Action Code
120700210712     C                     MOVELWUCPGC    PBCPGC           Calling Program
120800210712     C                     MOVEL#1TRTY    PBCTTY           Calling Transac
120900210712     C                     MOVELWUCUNS    PBCUNS           customer number
121000210712     C                     Z-ADDWURDNB    PBDRON           Date Of Receipt
121100210712     C                     Z-ADDWURDNB    PBDPON           Date Of Payment
121200210712     C                     MOVELWURCCD    PBRCCD           Receive Currenc
121300210712     C                     MOVELWUCYCD    PBCYCD           Currency Code
121400210712     C                     MOVELWUFFIN    PBFFIN           Federal Funds I
121500210712     C                     MOVELWUBRCD    PBBRCD           Branch code
121600210712     C                     MOVELWUPRI     PBPRI            Protect Receipt
121700210712     C                     MOVELWUPPI     PBPPI            Protect Payment
121800210712     C                     MOVELWUCKYE    PBCKYE           Command Key Ent
121900210712     C                     MOVELWUVLON    PBVLON           Validation Only
122000210712     C                     MOVELWUSDV     PBSDV            Settlement Deta
122100210712     C                     MOVELWUTRPA    PBTRPA           Termination Par
122200210712     C                     MOVELWUFCFI    PBFCFI           first call for
122300210712     C                     MOVELWUIBNR    PBIBNR           Recpt - interme
122400210712     C                     MOVELWUOBNR    PBOBNR           Rcpt - Ordering
122500210712     C                     MOVELWUOCSR    PBOCSR           Rcpt - Ordering
122600210712     C                     MOVELWUIBNP    PBIBNP           Pay - Intermed
122700210712     C                     MOVELWUOBNP    PBOBNP           Pay - Ordering
122800210712     C                     MOVELWUOCSP    PBOCSP           Pay - Ordering
122900210712     C                     MOVELWUCNOR    PBCNOR           Receiver Corr.
123000210712     C                     MOVELWURMT1    PBRMT1           Recipient of MT
123100210712     C                     MOVELWUACWB    PBACWB           A/C with bank n
123200210712     C                     MOVELWUBYNO    PBBYNO           Beneficiary No.
123300210712     C                     MOVELWUREPR    PBREPR           Retail Present
123400210712     C                     MOVELWURANS    PBRANS           Retail A/C Nos.
123500210712     C                     MOVELWUACCD    PBACCD           Account Code
123600210712     C                     MOVELWUCHMD    PBCHMD           Chips Module
123700210712     C                     Z-ADDWUBVPP    PBBVPP           Back value peri
123800210712     C                     Z-ADDWURDNB    PBRDNB           Run day number
123900210712     C                     MOVELWUDBEF    PBDBEF           Database error
124000210712     C                     MOVELWUDBEK    PBDBEK           Database error
124100210712     C                     MOVELWUPGNM    PBPGNM           program name
124200210712     C                     MOVELWUDBEN    PBDBEN           Database error
124300210712     C                     MOVELWUERCS    PBERCS           error codes
124400210712     C                     MOVELWUDFLD    PBDFLD           Default Fields
124500210712     C                     MOVELWUDFRS    PBDFRS           Default Receipt
124600210712     C                     MOVELWUDOCC    PBDOCC           Defaulting Occu
124700210712     C                     CLEARPCRC
124800210712     C                     MOVEL#1DSR1    PCDSR1           Def Conf Snd to
124900210712     C                     MOVEL#1DSR2    PCDSR2           Def Conf Snd to
125000210712     C                     MOVEL#1DSR3    PCDSR3           Def Conf Snd to
125100210712     C                     MOVEL#1DSR4    PCDSR4           Def Conf Snd to
125200210712     C                     MOVEL#1DSR5    PCDSR5           Def Conf Snd to
125300210712     C                     MOVEL#1DSR6    PCDSR6           Def Conf Snd to
125400210712     C                     MOVEL#1SSR1    PCSSR1           Sett Conf Sndr-
125500210712     C                     MOVEL#1SSR2    PCSSR2           Sett Conf Sndr-
125600210712     C                     MOVEL#1SSR3    PCSSR3           Sett Conf Sndr-
125700210712     C                     MOVEL#1SSR4    PCSSR4           Sett Conf Sndr-
125800210712     C                     MOVEL#1SSR5    PCSSR5           Sett Conf Sndr-
125900210712     C                     MOVEL#1SSR6    PCSSR6           Sett Conf Sndr-
126000210712     C                     MOVEL#1CND1    PCCND1           FRA/IRS Conf Co
126100210712     C                     MOVEL#1CND2    PCCND2           FRA/IRS Conf Co
126200210712     C                     MOVEL#1CND3    PCCND3           FRA/IRS Conf Co
126300210712     C                     MOVEL#1CND4    PCCND4           FRA/IRS Conf Co
126400210712     C                     MOVEL#1CND5    PCCND5           FRA/IRS Conf Co
126500210712     C                     MOVEL#1CND6    PCCND6           FRA/IRS Conf Co
126600210712     C                     MOVEL#1ISDA    PCISDA           Version of ISDA
126700210712     C                     MOVEL#1AGTY    PCAGTY           Type of ISDA ag
126800210712     C                     MOVEL#1AGDT    PCAGDT           Date of ISDA Ag
126900210712     C                     MOVEL#1AGVV    PCAGVV           Version of ISDA
127000210712      *                                                                                       CSW212
127100210712     C           #1TRTY    IFEQ 'AT'                                                          CSW212
127200210712     C           #1TRTY    OREQ 'FX'                                                          CSW212
127300210712     C           #1TRTY    OREQ 'OP'                                                          CSW212
127400210712     C           #1TRTY    OREQ 'FF'                                                          CSW212
127500210712     C           #1TRTY    OREQ 'CL'                                                          CSW212
127600210712     C           CDL008    ANDEQ'Y'                                                           CSW212
127700210712     C                     MOVELWCOVER    PACVMR                                              CSW212
127800210712     C                     ENDIF                                                              CSW212
127900210712      *
128000210712     C                     CALL 'SD2410'               90  Validate Detail
128100210712     C                     PARM           PARC             RCD: Extended S
128200210712     C                     PARM           PBRC             RCD: Extended S
128300210712     C                     PARM           PCRC             RCD: Extend Set
128400210712     C/COPY WNCPYSRC,SD0402RC01
128500210712      *
128600210712     C           *IN90     IFEQ '1'
128700210712      * Call to program ended in error
128800210712     C                     MOVEL'Y2U0032' W0RTN
128900210712     C                     MOVEL*BLANKS   W0CLPG 10
129000210712     C                     MOVEL'SD2410'  W0CLPG
129100210712      * Send message '*Error occured on CALL...'
129200210712     C                     MOVEL'Y2U0032' ZAMSID
129300210712     C                     MOVEL'Y2USRMSG'ZAMSGF
129400210712     C                     MOVELW0CLPG    ZAMSDA           Message data
129500210712     C                     EXSR ZASNMS
129600210712     C                     END
129700210712      *
129800210712     C                     MOVELPARSTY    #1RSTY           Receipt - Settl
129900210712     C                     MOVELPARONO    #1RONO           Receipt - Our N
130000210712     C                     MOVELPAROBN    #1ROBN           Rcpt - Ordering
130100210712     C                     MOVELPAROCS    #1ROCS           Rcpt - Ordering
130200210712     C                     MOVELPARIBN    #1RIBN           Rcpt - Intermed
130300210712     C                     MOVELPARIBL    #1RIBL           Rcpt - I/m Bank
130400210712     C                     MOVELPAPSTY    #1PSTY           Pay - Settlemen
130500210712     C                     MOVELPAPONO    #1PONO           Pay - Our Nostr
130600210712     C                     MOVELPAPOBN    #1POBN           Pay - Ordering
130700210712     C                     MOVELPAPOCS    #1POCS           Pay - Ordering
130800210712     C                     MOVELPAPIBN    #1PIBN           Pay - Intermed
130900210712     C                     MOVELPAPIBA    #1PIBA           Pay - I/m Bank
131000210712     C                     MOVELPARCNO    #1RCNO           Receiver Corres
131100210712     C                     MOVELPARCAL    #1RCAL           Receiver Corr.
131200210712     C                     MOVELPARCNB    #1RCNB           Receiver Number
131300210712     C                     MOVELPAACBN    #1ACBN           A/c With Bank N
131400210712     C                     MOVELPAACBL    #1ACBL           A/c With Bank L
131500210712     C                     MOVELPABYNB    #1BYNB           Beneficiary Num
131600210712     C                     MOVELPABACL    #1BACL           Beneficiary A/c
131700210712     C                     MOVELPADPY1    #1DPY1           Details of Paym
131800210712     C                     MOVELPADPY2    #1DPY2           Details of Paym
131900210712     C                     MOVELPADPY3    #1DPY3           Details of Paym
132000210712     C                     MOVELPADPY4    #1DPY4           Details of Paym
132100210712     C                     MOVELPADECG    #1DECG           Details of char
132200210712     C                     MOVELPABBI1    #1BBI1           Bank to Bank In
132300210712     C                     MOVELPABBI2    #1BBI2           Bank to Bank In
132400210712     C                     MOVELPABBI3    #1BBI3           Bank to Bank In
132500210712     C                     MOVELPABBI4    #1BBI4           Bank to Bank In
132600210712     C                     MOVELPABBI5    #1BBI5           Bank to Bank In
132700210712     C                     MOVELPABBI6    #1BBI6           Bank to Bank In
132800210712     C                     MOVELPACVMR    #1CVMR           Cover Message R
132900210712     C                     MOVELPAORBR    #1ORBR           Our Receive Bra
133000210712     C                     MOVELPAOPBR    #1OPBR           Our Payment Bra
133100210712     C                     MOVELPBANCD    WUANCD           Action Code
133200210712     C                     MOVELPBCPGC    WUCPGC           Calling Program
133300210712     C                     MOVELPBCTTY    #1TRTY           Calling Transac
133400210712     C                     MOVELPBCUNS    WUCUNS           customer number
133500210712     C                     Z-ADDPBDRON    WURDNB           Date Of Receipt
133600210712     C                     Z-ADDPBDPON    WURDNB           Date Of Payment
133700210712     C                     MOVELPBRCCD    WURCCD           Receive Currenc
133800210712     C                     MOVELPBCYCD    WUCYCD           Currency Code
133900210712     C                     MOVELPBFFIN    WUFFIN           Federal Funds I
134000210712     C                     MOVELPBBRCD    WUBRCD           Branch code
134100210712     C                     MOVELPBPRI     WUPRI            Protect Receipt
134200210712     C                     MOVELPBPPI     WUPPI            Protect Payment
134300210712     C                     MOVELPBCKYE    WUCKYE           Command Key Ent
134400210712     C                     MOVELPBVLON    WUVLON           Validation Only
134500210712     C                     MOVELPBSDV     WUSDV            Settlement Deta
134600210712     C                     MOVELPBTRPA    WUTRPA           Termination Par
134700210712     C                     MOVELPBFCFI    WUFCFI           first call for
134800210712     C                     MOVELPBIBNR    WUIBNR           Recpt - interme
134900210712     C                     MOVELPBOBNR    WUOBNR           Rcpt - Ordering
135000210712     C                     MOVELPBOCSR    WUOCSR           Rcpt - Ordering
135100210712     C                     MOVELPBIBNP    WUIBNP           Pay - Intermed
135200210712     C                     MOVELPBOBNP    WUOBNP           Pay - Ordering
135300210712     C                     MOVELPBOCSP    WUOCSP           Pay - Ordering
135400210712     C                     MOVELPBCNOR    WUCNOR           Receiver Corr.
135500210712     C                     MOVELPBRMT1    WURMT1           Recipient of MT
135600210712     C                     MOVELPBACWB    WUACWB           A/C with bank n
135700210712     C                     MOVELPBBYNO    WUBYNO           Beneficiary No.
135800210712     C                     MOVELPBREPR    WUREPR           Retail Present
135900210712     C                     MOVELPBRANS    WURANS           Retail A/C Nos.
136000210712     C                     MOVELPBACCD    WUACCD           Account Code
136100210712     C                     MOVELPBCHMD    WUCHMD           Chips Module
136200210712     C                     Z-ADDPBBVPP    WUBVPP           Back value peri
136300210712     C                     Z-ADDPBRDNB    WURDNB           Run day number
136400210712     C                     MOVELPBDBEF    WUDBEF           Database error
136500210712     C                     MOVELPBDBEK    WUDBEK           Database error
136600210712     C                     MOVELPBPGNM    WUPGNM           program name
136700210712     C                     MOVELPBDBEN    WUDBEN           Database error
136800210712     C                     MOVELPBERCS    WUERCS           error codes
136900210712     C                     MOVELPBDFLD    WUDFLD           Default Fields
137000210712     C                     MOVELPBDFRS    WUDFRS           Default Receipt
137100210712     C                     MOVELPBDOCC    WUDOCC           Defaulting Occu
137200210712     C                     MOVELPCDSR1    #1DSR1           Def Conf Snd to
137300210712     C                     MOVELPCDSR2    #1DSR2           Def Conf Snd to
137400210712     C                     MOVELPCDSR3    #1DSR3           Def Conf Snd to
137500210712     C                     MOVELPCDSR4    #1DSR4           Def Conf Snd to
137600210712     C                     MOVELPCDSR5    #1DSR5           Def Conf Snd to
137700210712     C                     MOVELPCDSR6    #1DSR6           Def Conf Snd to
137800210712     C                     MOVELPCSSR1    #1SSR1           Sett Conf Sndr-
137900210712     C                     MOVELPCSSR2    #1SSR2           Sett Conf Sndr-
138000210712     C                     MOVELPCSSR3    #1SSR3           Sett Conf Sndr-
138100210712     C                     MOVELPCSSR4    #1SSR4           Sett Conf Sndr-
138200210712     C                     MOVELPCSSR5    #1SSR5           Sett Conf Sndr-
138300210712     C                     MOVELPCSSR6    #1SSR6           Sett Conf Sndr-
138400210712     C                     MOVELPCCND1    #1CND1           FRA/IRS Conf Co
138500210712     C                     MOVELPCCND2    #1CND2           FRA/IRS Conf Co
138600210712     C                     MOVELPCCND3    #1CND3           FRA/IRS Conf Co
138700210712     C                     MOVELPCCND4    #1CND4           FRA/IRS Conf Co
138800210712     C                     MOVELPCCND5    #1CND5           FRA/IRS Conf Co
138900210712     C                     MOVELPCCND6    #1CND6           FRA/IRS Conf Co
139000210712     C                     MOVELPCISDA    #1ISDA           Version of ISDA
139100210712     C                     MOVELPCAGTY    #1AGTY           Type of ISDA ag
139200210712     C                     MOVELPCAGDT    #1AGDT           Date of ISDA Ag
139300210712     C                     MOVELPCAGVV    #1AGVV           Version of ISDA
139400210712      *
139500210712      * Redisplay the screen if any defaulting has occurred.
139600210712      * CASE: WRK.Defaulting Occurred is Yes
139700210712     C           WUDOCC    IFEQ 'Y'                        *IF
139800210712     C                     MOVEL'Y'       W0DCF            *Defer confirm
139900210712     C                     END                             *FI
140000210712      * Err Codes => Msgs FRA/IRS
140100210712      * Error code array - Extended Settlements  *
140200210712     C*********************MOVEA#BAYNA    UER                             S01117
140300210712     C                     MOVEAWUERCS    UER                             S01117
140400210712     C                     Z-ADD1         WUERNB           error number
140500210712     C                     MOVEL'N'       WUTMLP           Terminate Loop
140600210712      * When no more error codes to be read, terminate loop is set to Yes
140700210712      * DO WHILE: WRK.Terminate Loop is No
140800210712     C           WUTMLP    DOWEQ'N'                        *DOW
140900210712      * read error codes - Extended Settlements  *
141000210712     C*********************Z-ADD#BM1NB    UNBR    30                      S01229
141100210712     C                     Z-ADDWUERNB    UNBR    30                      S01229
141200210712     C*********************MOVE UER,UNBR  #OENCD                          S01229
141300210712     C                     MOVE UER,UNBR  WUERRC                          S01229
141400210712      * If error code is blank, then no more errors so terminate loop.
141500210712      * CASE: WRK.error code is Blank
141600210712     C           WUERRC    IFEQ *BLANK                     *IF
141700210712     C                     MOVEL'Y'       WUTMLP           Terminate Loop
141800210712     C                     ELSE
141900210712      * CASE: *OTHERWISE
142000210712      * Send error messages for each error code.
142100210712      * Send Error messages
142200210712     C                     EXSR UBSUBR                     Send Error mess
142300210712     C                     ADD  1         WUERNB           error number
142400210712     C                     END                             *FI
142500210712      * If array index exceeds 150, then terminate loop.
142600210712      * CASE: WRK.error number is Greater than/Equal to 151
142700210712     C           WUERNB    IFGE 151                        *IF
142800210712     C                     MOVEL'Y'       WUTMLP           Terminate Loop
142900210712     C                     END                             *FI
143000210712     C                     END                             *ITR
143100210712      * Adjust number of errors to actual number of errors counted.
143200210712     C                     SUB  1         WUERNB           error number
143300210712      *                                                                                       CSW214
143400210712     C           WUERNB    IFGT 1                                                             CSW214
143500210712      * If more than 1 error, do not record that warning message may have                     CSW214
143600210712     C                     MOVEL'N'       WUIMSG                                              CSW214
143700210712     C                     ELSE                                                               CSW214
143800210712      * CASE: *OTHERWISE                                                                      CSW214
143900210712      * Re-access Error Code array for first element.                                         CSW214
144000210712      * Get first error code - Extended Settlements  *                                        CSW214
144100210712     C*  Read Error Code array for first element.                                             CSW214
144200210712     C                     MOVE UER,1     WUERRC                                              CSW214
144300210712      * Only one error has occurred, check if it is warning message.                          CSW214
144400210712      * CASE: WRK.error code is 899                                                           CSW214
144500210712     C           WUERRC    IFEQ '899'                                                         CSW214
144600210712      * If warning message has been sent before, reset flag for next time                     CSW214
144700210712      * CASE: WRK.04 Information Msg Sent ? is Yes                                            CSW214
144800210712     C           WUIMSG    IFEQ 'Y'                                                           CSW214
144900210712     C                     MOVEL'N'       WUIMSG                                              CSW214
145000210712     C                     ELSE                                                               CSW214
145100210712      * CASE: *OTHERWISE                                                                      CSW214
145200210712      * Hold screen and record that warning message sent.                                     CSW214
145300210712     C                     MOVEL'Y'       WUIMSG                                              CSW214
145400210712     C                     MOVEL'Y'       W0DCF                                               CSW214
145500210712     C                     ENDIF                                                              CSW214
145600210712     C                     ELSE                                                               CSW214
145700210712      * CASE: *OTHERWISE                                                                      CSW214
145800210712      * Error code is not for warning message, so reset flag.                                 CSW214
145900210712     C                     MOVEL'N'       WUIMSG                                              CSW214
146000210712     C                     ENDIF                                                              CSW214
146100210712     C                     ENDIF                                                              CSW214
146200210712      *                                                                                       CSW214
146300210712      * 00/Copy Member SD0402RVSF - Extended Settlements  *
146400210712     C*Ext Stlmnts Mnt(FRA/IRS) Validate Detail Screen
146500210712     C/COPY WNCPYSRC,SD0402RVSF
146600210712      * Check relations
146700210712      * Check reference to Client Details
146800210712     C                     EXSR VBCKRL
146900210712     C           W0RTN     IFNE *BLANK
147000210712     C                     SETON                     99    *
147100210712     C                     END
147200210712      * Check reference to Client Details
147300210712     C                     EXSR VCCKRL
147400210712     C           W0RTN     IFNE *BLANK
147500210712     C                     SETON                     99    *
147600210712     C                     END
147700210712      * Check reference to Client Details
147800210712     C                     EXSR VDCKRL
147900210712     C           W0RTN     IFNE *BLANK
148000210712     C                     SETON                     99    *
148100210712     C                     END
148200210712      * Check reference to Client Details
148300210712     C                     EXSR VECKRL
148400210712     C           W0RTN     IFNE *BLANK
148500210712     C                     SETON                     99    *
148600210712     C                     END
148700210712      * Check reference to Branch Codes
148800210712     C                     EXSR VFCKRL
148900210712     C           W0RTN     IFNE *BLANK
149000210712     C                     SETON                     99    *
149100210712     C                     END
149200210712      * Check reference to Branch Codes
149300210712     C                     EXSR VGCKRL
149400210712     C           W0RTN     IFNE *BLANK
149500210712     C                     SETON                     99    *
149600210712     C                     END
149700210712      * CALC: Detail screen function fields
149800210712      * 00/Copy Member SD0402RSFF - Extended Settlements  *
149900210712     C*Ext Stlmnts Mnt(FRA/IRS) Calc Detail Function Flds
150000210712     C/COPY WNCPYSRC,SD0402RSFF
150100210712      * USER: Validate detail screen relations
150200210712      * Move input fields to program parameters for return to calling pro
150300210712      * CASE: PAR.Action Code is Insert or Amend
150400210712     C           P2ANCD    IFEQ 'A'                        *IF
150500210712     C           P2ANCD    OREQ 'I'
150600210712     C                     MOVEL#1DSR1    P1DSR1           Def Conf Snd to
150700210712     C                     MOVEL#1DSR2    P1DSR2           Def Conf Snd to
150800210712     C                     MOVEL#1DSR3    P1DSR3           Def Conf Snd to
150900210712     C                     MOVEL#1DSR4    P1DSR4           Def Conf Snd to
151000210712     C                     MOVEL#1DSR5    P1DSR5           Def Conf Snd to
151100210712     C                     MOVEL#1DSR6    P1DSR6           Def Conf Snd to
151200210712     C                     MOVEL#1SSR1    P1SSR1           Sett Conf Sndr-
151300210712     C                     MOVEL#1SSR2    P1SSR2           Sett Conf Sndr-
151400210712     C                     MOVEL#1SSR3    P1SSR3           Sett Conf Sndr-
151500210712     C                     MOVEL#1SSR4    P1SSR4           Sett Conf Sndr-
151600210712     C                     MOVEL#1SSR5    P1SSR5           Sett Conf Sndr-
151700210712     C                     MOVEL#1SSR6    P1SSR6           Sett Conf Sndr-
151800210712     C                     MOVEL#1CND1    P1CND1           FRA/IRS Conf Co
151900210712     C                     MOVEL#1CND2    P1CND2           FRA/IRS Conf Co
152000210712     C                     MOVEL#1CND3    P1CND3           FRA/IRS Conf Co
152100210712     C                     MOVEL#1CND4    P1CND4           FRA/IRS Conf Co
152200210712     C                     MOVEL#1CND5    P1CND5           FRA/IRS Conf Co
152300210712     C                     MOVEL#1CND6    P1CND6           FRA/IRS Conf Co
152400210712     C                     MOVEL#1ISDA    P1ISDA           Version of ISDA
152500210712     C                     MOVEL#1AGTY    P1AGTY           Type of ISDA ag
152600210712     C                     MOVEL#1AGDT    P1AGDT           Date of ISDA Ag
152700210712     C                     MOVEL#1AGVV    P1AGVV           Version of ISDA
152800210712     C                     END                             *FI
152900210712      * 00/Copy Member SD0402RVSR - Extended Settlements  *
153000210712     C*Ext Stlmnts Mnt(FRA/IRS) Validate Screen Relns
153100210712     C/COPY WNCPYSRC,SD0402RVSR
153200210712      *================================================================
153300210712     CSR         DCEXIT    ENDSR
153400210712      /EJECT
153500210712     CSR         EBPR##    BEGSR
153600210712      *================================================================
153700210712      * Process record:
153800210712      *================================================================
153900210712      * Process add request
154000210712     C           W0PMD     CASEQ'ADD'     ECADRQ
154100210712      * Process update request
154200210712     C           W0PMD     CASNE'ADD'     EECHRQ
154300210712     C                     END
154400210712     C           W0RTN     IFNE *BLANK
154500210712      * Error: ROLLBACK any DBF changes
154600210712     C                     ROLBK
154700210712     C                     GOTO EBEXIT
154800210712     C                     ELSE
154900210712      * Otherwise COMMIT any DBF changes
155000210712     C                     COMIT
155100210712     C                     END
155200210712     C           W0RTN     IFEQ *BLANK
155300210712      * USER: Process command keys
155400210712      * 00/Copy Member SD0402RPCK - Extended Settlements  *
155500210712     C*Ext Stlmnts Mnt(FRA/IRS) Process Command Keys
155600210712     C/COPY WNCPYSRC,SD0402RPCK
155700210712     C           W0PMD     IFEQ 'ADD'
155800210712      * Exit after successful add
155900210712     C                     MOVEL'N'       W0RPT
156000210712     C                     END
156100210712      * Restart program for next record
156200210712     C                     MOVEL'N'       W0TRN
156300210712     C                     END
156400210712      *================================================================
156500210712     CSR         EBEXIT    ENDSR
156600210712      /EJECT
156700210712     CSR         ECADRQ    BEGSR
156800210712      *================================================================
156900210712      * Process add request
157000210712      *================================================================
157100210712      * USER: Create DBF record
157200210712      * Create Ext Sett FRA/IRS - Extended Settlements  *
157300210712     C                     EXSR SACRRC
157400210712     C           W0RTN     IFEQ *BLANK
157500210712      * Send message '*Record added'
157600210712     C                     MOVEL'Y2U0011' ZAMSID
157700210712     C                     MOVEL'Y2USRMSG'ZAMSGF
157800210712     C                     EXSR ZASNMS
157900210712     C                     END
158000210712      *================================================================
158100210712     CSR         ECEXIT    ENDSR
158200210712      /EJECT
158300210712     CSR         EECHRQ    BEGSR
158400210712      *================================================================
158500210712      * Process update request
158600210712      *================================================================
158700210712      * USER: Change DBF record
158800210712      * Change Ext. Sett. FRA/IRS - Extended Settlements  *
158900210712     C                     EXSR SBCHRC
159000210712     C           W0RTN     IFNE *BLANK
159100210712      * Data update error
159200210712      * Reset screen fields if changed record
159300210712     C           W0RTN     CASEQ'Y2U0007' MBFL#1
159400210712     C                     END
159500210712     C                     ELSE
159600210712      * Send message '*Record changed'
159700210712     C                     MOVEL'Y2U0012' ZAMSID
159800210712     C                     MOVEL'Y2USRMSG'ZAMSGF
159900210712     C                     EXSR ZASNMS
160000210712     C                     END
160100210712      *================================================================
160200210712     CSR         EEEXIT    ENDSR
160300210712      /EJECT
160400210712     CSR         FACKPM    BEGSR
160500210712      *================================================================
160600210712      * Check passed parameters
160700210712      *================================================================
160800210712      * Is full key present?
160900210712     C           P1CYCD    IFEQ *BLANK                     Currency Code
161000210712     C           P1CUST    OREQ *BLANK                     Customer Number
161100210712     C           P1TRTY    OREQ *BLANK                     Transaction Typ
161200210712     C/COPY WNCPYSRC,SDH00318
161300210712      * Not every key field passed - loop program
161400210712     C                     MOVEL'Y'       W0RPT   1
161500210712     C                     ELSE
161600210712      * Full key passed, so single shot program
161700210712     C                     MOVEL'N'       W0RPT
161800210712     C                     END
161900210712      *================================================================
162000210712     CSR         FAEXIT    ENDSR
162100210712      /EJECT
162200210712     CSR         GADSAK    BEGSR
162300210712      *================================================================
162400210712      * Set key screen conditioning indicators
162500210712      *================================================================
162600210712     C           W0PMD     COMP 'ADD'                    89*
162700210712      *================================================================
162800210712     CSR         GAEXIT    ENDSR
162900210712      /EJECT
163000210712     CSR         GBDSAD    BEGSR
163100210712      *================================================================
163200210712      * Set detail screen conditioning indicators
163300210712      *================================================================
163400210712     C           W0PMD     COMP 'ADD'                    89*
163500210712      * Protect key fields on detail screen
163600210712     C                     SETON                     88    *
163700210712     C**********           MOVEL'0'       *IN79                                               CSW212
163800210712     C********** CSW005    IFNE 'Y'                        *IF                         173052 CSW212
163900210712     C********** CSW011    ANDNE'Y'                                                    CSW200 CSW212
164000210712     C********** CSW005    ORNE 'Y'                                                    CSW200 CSW212
164100210712     C********** CSW200    ANDNE'Y'                                                    CSW200 CSW212
164200210712     C                     MOVE *ON       *IN79                           173052
164300210712     C           CSW005    IFEQ 'Y'                                                           CSW212
164400210712     C           CSW011    OREQ 'Y'                                                           CSW212
164500210712     C           CSW212    OREQ 'Y'                                                           CSW212
164600210712     C                     MOVE *OFF      *IN79                                               CSW212
164700210712     C                     ENDIF                            FI            173052
164800210712     C***********#1TRTY    IFEQ 'FR'                       *IF            CSW097
164900210712     C***********          MOVEL'1'       *IN79                           CSW097
165000210712     C***********          END                             *FI            CSW097
165100210712      *                                                                                       CSW212
165200210712      ** Set Display Indicators for CSW212 deal types AT and FX                               CSW212
165300210712      *                                                                                       CSW212
165400210712     C                     MOVEL*BLANKS   #WNARR                                              CSW212
165500210712     C                     MOVEL*BLANKS   #WNCON                                              CSW212
165600210712     C                     MOVEL*BLANKS   #WNSET                                              CSW212
165700210712     C                     MOVEL*BLANKS   #WFIND  1                                           CSW212
165800210712      *                                                                                       CSW212
165900210712     C                     SELEC                                                              CSW212
166000210712     C           #1TRTY    WHEQ 'AT'                                                          CSW212
166100210712     C           CSW005    IFEQ 'Y'                                                           CSW212
166200210712     C           CSW011    OREQ 'Y'                                                           CSW212
166300210712     C                     Z-ADD1         #WX     20                                          CSW212
166400210712     C                     MOVEL'Y'       #WFIND                                              CSW212
166500210712     C                     ENDIF                                                              CSW212
166600210712      *                                                                                       CSW212
166700210712     C           CSW212    IFEQ 'Y'                                                           CSW212
166800210712     C           #WFIND    IFEQ 'Y'                                                           CSW212
166900210712     C                     Z-ADD2         #WX                                                 CSW212
167000210712     C                     ELSE                                                               CSW212
167100210712     C                     Z-ADD3         #WX                                                 CSW212
167200210712     C                     ENDIF                                                              CSW212
167300210712     C                     ENDIF                                                              CSW212
167400210712      *                                                                                       CSW212
167500210712     C           #1TRTY    WHEQ 'FX'                                                          CSW212
167600210712     C           #1TRTY    OREQ 'OP'                                                          CSW212
167700210712     C           #1TRTY    OREQ 'FF'                                                          CSW212
167800210712     C           #1TRTY    OREQ 'CL'                                                          CSW212
167900210712     C           CDL008    ANDEQ'Y'                                                           CSW212
168000210712     C                     Z-ADD3         #WX                                                 CSW212
168100210712     C                     OTHER                                                              CSW212
168200210712     C                     Z-ADD1         #WX                                                 CSW212
168300210712     C                     ENDSL                                                              CSW212
168400210712      *                                                                                       CSW212
168500210712     C                     MOVELHDTG,#WX  #WNARR                                              CSW212
168600210712     C                     MOVELCONF,#WX  #WNCON                                              CSW212
168700210712     C                     MOVELSETN,#WX  #WNSET                                              CSW212
168800210712      * Enable key screen
168900210712     C                     SETON                     87    *
169000210712      *================================================================
169100210712     CSR         GBEXIT    ENDSR
169200210712      /EJECT
169300210712     CSR         MAIZ#1    BEGSR
169400210712      *================================================================
169500210712      * Initialise record - except for key fields and "neither" paramete
169600210712      *================================================================
169700210712     C                     MOVEL*BLANK    #PDRTC           Duplicate Retur
169800210712     C                     MOVELP4CPGC    #PCPGC           Calling Program
169900210712     C                     MOVELP4CTTY    #PCTTY           Calling Transac
170000210712     C                     MOVELP4CUNS    #PCUNS           customer number
170100210712     C                     Z-ADDP4DRON    #PDRON           Date Of Receipt
170200210712     C                     Z-ADDP4DPON    #PDPON           Date Of Payment
170300210712     C                     MOVELP4RCCD    #PRCCD           Receive Currenc
170400210712     C                     MOVELP4FFIN    #PFFIN           Federal Funds I
170500210712     C                     MOVELP4BRCD    #PBRCD           Branch code
170600210712     C                     MOVELP4PRI     #PPRI            Protect Receipt
170700210712     C                     MOVELP4PPI     #PPPI            Protect Payment
170800210712     C                     MOVELP4CKYE    #PCKYE           Command Key Ent
170900210712     C                     MOVELP4VLON    #PVLON           Validation Only
171000210712     C                     MOVELP4SDV     #PSDV            Settlement Deta
171100210712     C                     MOVELP4TRPA    #PTRPA           Termination Par
171200210712     C                     MOVELP4FCFI    #PFCFI           first call for
171300210712     C                     MOVELP4IBNR    #PIBNR           Recpt - interme
171400210712     C                     MOVELP4OBNR    #POBNR           Rcpt - Ordering
171500210712     C                     MOVELP4OCSR    #POCSR           Rcpt - Ordering
171600210712     C                     MOVELP4IBNP    #PIBNP           Pay - Intermed
171700210712     C                     MOVELP4OBNP    #POBNP           Pay - Ordering
171800210712     C                     MOVELP4OCSP    #POCSP           Pay - Ordering
171900210712     C                     MOVELP4CNOR    #PCNOR           Receiver Corr.
172000210712     C                     MOVELP4RMT1    #PRMT1           Recipient of MT
172100210712     C                     MOVELP4ACWB    #PACWB           A/C with bank n
172200210712     C                     MOVELP4BYNO    #PBYNO           Beneficiary No.
172300210712     C                     MOVELP4REPR    #PREPR           Retail Present
172400210712     C                     MOVELP4RANS    #PRANS           Retail A/C Nos.
172500210712     C                     MOVELP4ACCD    #PACCD           Account Code
172600210712     C                     MOVELP4CHMD    #PCHMD           Chips Module
172700210712     C                     Z-ADDP4BVPP    #PBVPP           Back value peri
172800210712     C                     Z-ADDP4RDNB    #PRDNB           Run day number
172900210712     C                     MOVELP4DBEF    #PDBEF           Database error
173000210712     C                     MOVELP4DBEK    #PDBEK           Database error
173100210712     C                     MOVELP4PGNM    #PPGNM           program name
173200210712     C                     MOVELP4DBEN    #PDBEN           Database error
173300210712     C                     MOVELP4ERCS    #PERCS           error codes
173400210712     C                     MOVELP4DFLD    #PDFLD           Default Fields
173500210712     C                     MOVELP4DFRS    #PDFRS           Default Receipt
173600210712     C                     MOVELP4DOCC    #PDOCC           Defaulting Occu
173700210712     C                     MOVELP2ANCD    #PANCD           Action Code
173800210712     C                     MOVEL*BLANK    #1RSTY           Receipt - Settl
173900210712     C                     MOVEL*BLANK    #1RONO           Receipt - Our N
174000210712     C                     MOVEL*BLANK    #1ROBN           Rcpt - Ordering
174100210712     C                     MOVEL*BLANK    #1ROCS           Rcpt - Ordering
174200210712     C                     MOVEL*BLANK    #1RIBN           Rcpt - Intermed
174300210712     C                     MOVEL*BLANK    #1RIBL           Rcpt - I/m Bank
174400210712     C                     MOVEL*BLANK    #1PSTY           Pay - Settlemen
174500210712     C                     MOVEL*BLANK    #1PONO           Pay - Our Nostr
174600210712     C                     MOVEL*BLANK    #1POBN           Pay - Ordering
174700210712     C                     MOVEL*BLANK    #1POCS           Pay - Ordering
174800210712     C                     MOVEL*BLANK    #1PIBN           Pay - Intermed
174900210712     C                     MOVEL*BLANK    #1PIBA           Pay - I/m Bank
175000210712     C                     MOVEL*BLANK    #1RCNO           Receiver Corres
175100210712     C                     MOVEL*BLANK    #1RCAL           Receiver Corr.
175200210712     C                     MOVEL*BLANK    #1RCNB           Receiver Number
175300210712     C                     MOVEL*BLANK    #1ACBN           A/c With Bank N
175400210712     C                     MOVEL*BLANK    #1ACBL           A/c With Bank L
175500210712     C                     MOVEL*BLANK    #1BYNB           Beneficiary Num
175600210712     C                     MOVEL*BLANK    #1BACL           Beneficiary A/c
175700210712     C                     MOVEL*BLANK    #1DPY1           Details of Paym
175800210712     C                     MOVEL*BLANK    #1DPY2           Details of Paym
175900210712     C                     MOVEL*BLANK    #1DPY3           Details of Paym
176000210712     C                     MOVEL*BLANK    #1DPY4           Details of Paym
176100210712     C                     MOVEL*BLANK    #1DECG           Details of char
176200210712     C                     MOVEL*BLANK    #1BBI1           Bank to Bank In
176300210712     C                     MOVEL*BLANK    #1BBI2           Bank to Bank In
176400210712     C                     MOVEL*BLANK    #1BBI3           Bank to Bank In
176500210712     C                     MOVEL*BLANK    #1BBI4           Bank to Bank In
176600210712     C                     MOVEL*BLANK    #1BBI5           Bank to Bank In
176700210712     C                     MOVEL*BLANK    #1BBI6           Bank to Bank In
176800210712     C                     Z-ADD*ZERO     #1LCD            Last Change Dat
176900210712     C                     MOVEL*BLANK    #1TYLC           Type of Last Ch
177000210712     C                     MOVEL*BLANK    #1CVMR           Cover Message R
177100210712     C                     MOVEL*BLANK    #1ORBR           Our Receive Bra
177200210712     C                     MOVEL*BLANK    #1OPBR           Our Payment Bra
177300210712     C                     MOVEL*BLANK    #1DSR1           Def Conf Snd to
177400210712     C                     MOVEL*BLANK    #1DSR2           Def Conf Snd to
177500210712     C                     MOVEL*BLANK    #1DSR3           Def Conf Snd to
177600210712     C                     MOVEL*BLANK    #1DSR4           Def Conf Snd to
177700210712     C                     MOVEL*BLANK    #1DSR5           Def Conf Snd to
177800210712     C                     MOVEL*BLANK    #1DSR6           Def Conf Snd to
177900210712     C                     MOVEL*BLANK    #1SSR1           Sett Conf Sndr-
178000210712     C                     MOVEL*BLANK    #1SSR2           Sett Conf Sndr-
178100210712     C                     MOVEL*BLANK    #1SSR3           Sett Conf Sndr-
178200210712     C                     MOVEL*BLANK    #1SSR4           Sett Conf Sndr-
178300210712     C                     MOVEL*BLANK    #1SSR5           Sett Conf Sndr-
178400210712     C                     MOVEL*BLANK    #1SSR6           Sett Conf Sndr-
178500210712     C                     MOVEL*BLANK    #1CND1           FRA/IRS Conf Co
178600210712     C                     MOVEL*BLANK    #1CND2           FRA/IRS Conf Co
178700210712     C                     MOVEL*BLANK    #1CND3           FRA/IRS Conf Co
178800210712     C                     MOVEL*BLANK    #1CND4           FRA/IRS Conf Co
178900210712     C                     MOVEL*BLANK    #1CND5           FRA/IRS Conf Co
179000210712     C                     MOVEL*BLANK    #1CND6           FRA/IRS Conf Co
179100210712     C                     MOVEL*BLANK    #1ISDA           Version of ISDA
179200210712     C                     MOVEL*BLANK    #1AGTY           Type of ISDA ag
179300210712     C                     MOVEL*BLANK    #1AGDT           Date of ISDA Ag
179400210712     C                     MOVEL*BLANK    #1AGVV           Version of ISDA
179500210712      *================================================================
179600210712     CSR         MAEXIT    ENDSR
179700210712      /EJECT
179800210712     CSR         MBFL#1    BEGSR
179900210712      *================================================================
180000210712      * Move @BYREFY fields to screen
180100210712      *================================================================
180200210712     C                     MOVELBYRSTY    #1RSTY           Receipt - Settl
180300210712     C                     MOVELBYRONO    #1RONO           Receipt - Our N
180400210712     C                     MOVELBYROBN    #1ROBN           Rcpt - Ordering
180500210712     C                     MOVELBYROCS    #1ROCS           Rcpt - Ordering
180600210712     C                     MOVELBYRIBN    #1RIBN           Rcpt - Intermed
180700210712     C                     MOVELBYRIBL    #1RIBL           Rcpt - I/m Bank
180800210712     C                     MOVELBYPSTY    #1PSTY           Pay - Settlemen
180900210712     C                     MOVELBYPONO    #1PONO           Pay - Our Nostr
181000210712     C                     MOVELBYPOBN    #1POBN           Pay - Ordering
181100210712     C                     MOVELBYPOCS    #1POCS           Pay - Ordering
181200210712     C                     MOVELBYPIBN    #1PIBN           Pay - Intermed
181300210712     C                     MOVELBYPIBA    #1PIBA           Pay - I/m Bank
181400210712     C                     MOVELBYRCNO    #1RCNO           Receiver Corres
181500210712     C                     MOVELBYRCAL    #1RCAL           Receiver Corr.
181600210712     C                     MOVELBYRCNB    #1RCNB           Receiver Number
181700210712     C                     MOVELBYACBN    #1ACBN           A/c With Bank N
181800210712     C                     MOVELBYACBL    #1ACBL           A/c With Bank L
181900210712     C                     MOVELBYBYNB    #1BYNB           Beneficiary Num
182000210712     C                     MOVELBYBACL    #1BACL           Beneficiary A/c
182100210712     C                     MOVELBYDPY1    #1DPY1           Details of Paym
182200210712     C                     MOVELBYDPY2    #1DPY2           Details of Paym
182300210712     C                     MOVELBYDPY3    #1DPY3           Details of Paym
182400210712     C                     MOVELBYDPY4    #1DPY4           Details of Paym
182500210712     C                     MOVELBYDECG    #1DECG           Details of char
182600210712     C                     MOVELBYBBI1    #1BBI1           Bank to Bank In
182700210712     C                     MOVELBYBBI2    #1BBI2           Bank to Bank In
182800210712     C                     MOVELBYBBI3    #1BBI3           Bank to Bank In
182900210712     C                     MOVELBYBBI4    #1BBI4           Bank to Bank In
183000210712     C                     MOVELBYBBI5    #1BBI5           Bank to Bank In
183100210712     C                     MOVELBYBBI6    #1BBI6           Bank to Bank In
183200210712     C                     Z-ADDBYLCD     #1LCD            Last Change Dat
183300210712     C                     MOVELBYTYLC    #1TYLC           Type of Last Ch
183400210712     C                     MOVELBYCVMR    #1CVMR           Cover Message R
183500210712     C                     MOVELBYORBR    #1ORBR           Our Receive Bra
183600210712     C                     MOVELBYOPBR    #1OPBR           Our Payment Bra
183700210712     C                     MOVELBYCYCD    #1CYCD           Currency Code
183800210712     C                     MOVELBYCUST    #1CUST           Customer Number
183900210712     C                     MOVELBYTRTY    #1TRTY           Transaction Typ
184000210712     C                     MOVELBYDSR1    #1DSR1           Def Conf Snd to
184100210712     C                     MOVELBYDSR2    #1DSR2           Def Conf Snd to
184200210712     C                     MOVELBYDSR3    #1DSR3           Def Conf Snd to
184300210712     C                     MOVELBYDSR4    #1DSR4           Def Conf Snd to
184400210712     C                     MOVELBYDSR5    #1DSR5           Def Conf Snd to
184500210712     C                     MOVELBYDSR6    #1DSR6           Def Conf Snd to
184600210712     C                     MOVELBYSSR1    #1SSR1           Sett Conf Sndr-
184700210712     C                     MOVELBYSSR2    #1SSR2           Sett Conf Sndr-
184800210712     C                     MOVELBYSSR3    #1SSR3           Sett Conf Sndr-
184900210712     C                     MOVELBYSSR4    #1SSR4           Sett Conf Sndr-
185000210712     C                     MOVELBYSSR5    #1SSR5           Sett Conf Sndr-
185100210712     C                     MOVELBYSSR6    #1SSR6           Sett Conf Sndr-
185200210712     C                     MOVELBYCND1    #1CND1           FRA/IRS Conf Co
185300210712     C                     MOVELBYCND2    #1CND2           FRA/IRS Conf Co
185400210712     C                     MOVELBYCND3    #1CND3           FRA/IRS Conf Co
185500210712     C                     MOVELBYCND4    #1CND4           FRA/IRS Conf Co
185600210712     C                     MOVELBYCND5    #1CND5           FRA/IRS Conf Co
185700210712     C                     MOVELBYCND6    #1CND6           FRA/IRS Conf Co
185800210712     C                     MOVELBYISDA    #1ISDA           Version of ISDA
185900210712     C                     MOVELBYAGTY    #1AGTY           Type of ISDA ag
186000210712     C                     MOVELBYAGDT    #1AGDT           Date of ISDA Ag
186100210712     C***********          MOVELBYAGVV    #1AGVV           Version of ISDACSW097
186200210712     C                     MOVE BYAGVV    #1AGVV           Version of ISDACSW097
186300210712     C                     MOVELBYAGVC    #1AGVV           Version of ISDACSW097
186400210712      * Hold existing record image
186500210712     C                     MOVEL@1DBRC    #1DBRC
186600210712      *================================================================
186700210712     CSR         MBEXIT    ENDSR
186800210712      /EJECT
186900210712     CSR         MDIZ#K    BEGSR
187000210712      *================================================================
187100210712      * Initialize key screen
187200210712      *================================================================
187300210712     C                     MOVEL*BLANK    #PDRTC           Duplicate Retur
187400210712     C                     MOVELP4CPGC    #PCPGC           Calling Program
187500210712     C                     MOVELP4CTTY    #PCTTY           Calling Transac
187600210712     C                     MOVELP4CUNS    #PCUNS           customer number
187700210712     C                     Z-ADDP4DRON    #PDRON           Date Of Receipt
187800210712     C                     Z-ADDP4DPON    #PDPON           Date Of Payment
187900210712     C                     MOVELP4RCCD    #PRCCD           Receive Currenc
188000210712     C                     MOVELP4FFIN    #PFFIN           Federal Funds I
188100210712     C                     MOVELP4BRCD    #PBRCD           Branch code
188200210712     C                     MOVELP4PRI     #PPRI            Protect Receipt
188300210712     C                     MOVELP4PPI     #PPPI            Protect Payment
188400210712     C                     MOVELP4CKYE    #PCKYE           Command Key Ent
188500210712     C                     MOVELP4VLON    #PVLON           Validation Only
188600210712     C                     MOVELP4SDV     #PSDV            Settlement Deta
188700210712     C                     MOVELP4TRPA    #PTRPA           Termination Par
188800210712     C                     MOVELP4FCFI    #PFCFI           first call for
188900210712     C                     MOVELP4IBNR    #PIBNR           Recpt - interme
189000210712     C                     MOVELP4OBNR    #POBNR           Rcpt - Ordering
189100210712     C                     MOVELP4OCSR    #POCSR           Rcpt - Ordering
189200210712     C                     MOVELP4IBNP    #PIBNP           Pay - Intermed
189300210712     C                     MOVELP4OBNP    #POBNP           Pay - Ordering
189400210712     C                     MOVELP4OCSP    #POCSP           Pay - Ordering
189500210712     C                     MOVELP4CNOR    #PCNOR           Receiver Corr.
189600210712     C                     MOVELP4RMT1    #PRMT1           Recipient of MT
189700210712     C                     MOVELP4ACWB    #PACWB           A/C with bank n
189800210712     C                     MOVELP4BYNO    #PBYNO           Beneficiary No.
189900210712     C                     MOVELP4REPR    #PREPR           Retail Present
190000210712     C                     MOVELP4RANS    #PRANS           Retail A/C Nos.
190100210712     C                     MOVELP4ACCD    #PACCD           Account Code
190200210712     C                     MOVELP4CHMD    #PCHMD           Chips Module
190300210712     C                     Z-ADDP4BVPP    #PBVPP           Back value peri
190400210712     C                     Z-ADDP4RDNB    #PRDNB           Run day number
190500210712     C                     MOVELP4DBEF    #PDBEF           Database error
190600210712     C                     MOVELP4DBEK    #PDBEK           Database error
190700210712     C                     MOVELP4PGNM    #PPGNM           program name
190800210712     C                     MOVELP4DBEN    #PDBEN           Database error
190900210712     C                     MOVELP4ERCS    #PERCS           error codes
191000210712     C                     MOVELP4DFLD    #PDFLD           Default Fields
191100210712     C                     MOVELP4DFRS    #PDFRS           Default Receipt
191200210712     C                     MOVELP4DOCC    #PDOCC           Defaulting Occu
191300210712     C                     MOVELP2ANCD    #PANCD           Action Code
191400210712     C                     MOVEL*BLANK    #1CSSN           Customer Shortn
191500210712     C                     MOVEL*BLANK    #1CRTN           Customer Report
191600210712     C                     MOVEL*BLANK    #1CRNM           Customer Report
191700210712     C                     MOVELP1CYCD    #1CYCD           Currency Code
191800210712     C                     MOVELP1CUST    #1CUST           Customer Number
191900210712     C                     MOVELP1TRTY    #1TRTY           Transaction Typ
192000210712     C                     MOVELP1BRCA    #1BRCA  3        Branch                             CSD095
192100210712     C                     MOVELP1STYP    #1STYP  2        Sub-Type                           CSD095
192200210712     C/COPY WNCPYSRC,SDH00319
192300210712      * Check reference to Currency Codes
192400210712     C                     EXSR VHCKRL
192500210712     C           W0RTN     IFNE *BLANK
192600210712     C                     SETON                     9931  *
192700210712     C                     END
192800210712      * Check reference to Client Details
192900210712     C                     EXSR VICKRL
193000210712     C           W0RTN     IFNE *BLANK
193100210712     C                     SETON                     9932  *
193200210712     C                     END
193300210712      * USER: Initialize key screen
193400210712      * Set up Detail Screen Footer
193500210712     C                     EXSR UCSUBR                     Set up Detail S
193600210712      * 00/Copy Member SD0402RIKS - Extended Settlements  *
193700210712     C*Ext Stlmnts Mnt(FRA/IRS) Initialise Key Screen
193800210712     C/COPY WNCPYSRC,SD0402RIKS
193900210712      *================================================================
194000210712     CSR         MDEXIT    ENDSR
194100210712      /EJECT
194200210712     CSR         SACRRC    BEGSR
194300210712      *================================================================
194400210712      * Create Ext Sett FRA/IRS - Extended Settlements  *
194500210712      *================================================================
194600210712     C                     MOVEL*BLANK    W0RTN   7
194700210712      * Move all fields to @BYREFX
194800210712     C                     MOVEL#1CYCD    BYCYCD           Currency Code
194900210712     C                     MOVEL#1CUST    BYCUST           Customer Number
195000210712     C                     MOVEL#1TRTY    BYTRTY           Transaction Typ
195100210712     C                     MOVEL#1RSTY    BYRSTY           Receipt - Settl
195200210712     C                     MOVEL#1RONO    BYRONO           Receipt - Our N
195300210712     C                     MOVEL#1ROBN    BYROBN           Rcpt - Ordering
195400210712     C                     MOVEL#1ROCS    BYROCS           Rcpt - Ordering
195500210712     C                     MOVEL#1RIBN    BYRIBN           Rcpt - Intermed
195600210712     C                     MOVEL#1RIBL    BYRIBL           Rcpt - I/m Bank
195700210712     C                     MOVEL#1PSTY    BYPSTY           Pay - Settlemen
195800210712     C                     MOVEL#1PONO    BYPONO           Pay - Our Nostr
195900210712     C                     MOVEL#1POBN    BYPOBN           Pay - Ordering
196000210712     C                     MOVEL#1POCS    BYPOCS           Pay - Ordering
196100210712     C                     MOVEL#1PIBN    BYPIBN           Pay - Intermed
196200210712     C                     MOVEL#1PIBA    BYPIBA           Pay - I/m Bank
196300210712     C                     MOVEL#1RCNO    BYRCNO           Receiver Corres
196400210712     C                     MOVEL#1RCAL    BYRCAL           Receiver Corr.
196500210712     C                     MOVEL#1RCNB    BYRCNB           Receiver Number
196600210712     C                     MOVEL#1ACBN    BYACBN           A/c With Bank N
196700210712     C                     MOVEL#1ACBL    BYACBL           A/c With Bank L
196800210712     C                     MOVEL#1BYNB    BYBYNB           Beneficiary Num
196900210712     C                     MOVEL#1BACL    BYBACL           Beneficiary A/c
197000210712     C                     MOVEL#1DPY1    BYDPY1           Details of Paym
197100210712     C                     MOVEL#1DPY2    BYDPY2           Details of Paym
197200210712     C                     MOVEL#1DPY3    BYDPY3           Details of Paym
197300210712     C                     MOVEL#1DPY4    BYDPY4           Details of Paym
197400210712     C                     MOVEL#1DECG    BYDECG           Details of char
197500210712     C                     MOVEL#1BBI1    BYBBI1           Bank to Bank In
197600210712     C                     MOVEL#1BBI2    BYBBI2           Bank to Bank In
197700210712     C                     MOVEL#1BBI3    BYBBI3           Bank to Bank In
197800210712     C                     MOVEL#1BBI4    BYBBI4           Bank to Bank In
197900210712     C                     MOVEL#1BBI5    BYBBI5           Bank to Bank In
198000210712     C                     MOVEL#1BBI6    BYBBI6           Bank to Bank In
198100210712     C                     Z-ADD#1LCD     BYLCD            Last Change Dat
198200210712     C                     MOVEL#1TYLC    BYTYLC           Type of Last Ch
198300210712     C                     MOVEL#1CVMR    BYCVMR           Cover Message R
198400210712     C                     MOVEL#1ORBR    BYORBR           Our Receive Bra
198500210712     C                     MOVEL#1OPBR    BYOPBR           Our Payment Bra
198600210712     C                     MOVEL#1DSR1    BYDSR1           Def Conf Snd to
198700210712     C                     MOVEL#1DSR2    BYDSR2           Def Conf Snd to
198800210712     C                     MOVEL#1DSR3    BYDSR3           Def Conf Snd to
198900210712     C                     MOVEL#1DSR4    BYDSR4           Def Conf Snd to
199000210712     C                     MOVEL#1DSR5    BYDSR5           Def Conf Snd to
199100210712     C                     MOVEL#1DSR6    BYDSR6           Def Conf Snd to
199200210712     C                     MOVEL#1SSR1    BYSSR1           Sett Conf Sndr-
199300210712     C                     MOVEL#1SSR2    BYSSR2           Sett Conf Sndr-
199400210712     C                     MOVEL#1SSR3    BYSSR3           Sett Conf Sndr-
199500210712     C                     MOVEL#1SSR4    BYSSR4           Sett Conf Sndr-
199600210712     C                     MOVEL#1SSR5    BYSSR5           Sett Conf Sndr-
199700210712     C                     MOVEL#1SSR6    BYSSR6           Sett Conf Sndr-
199800210712     C                     MOVEL#1CND1    BYCND1           FRA/IRS Conf Co
199900210712     C                     MOVEL#1CND2    BYCND2           FRA/IRS Conf Co
200000210712     C                     MOVEL#1CND3    BYCND3           FRA/IRS Conf Co
200100210712     C                     MOVEL#1CND4    BYCND4           FRA/IRS Conf Co
200200210712     C                     MOVEL#1CND5    BYCND5           FRA/IRS Conf Co
200300210712     C                     MOVEL#1CND6    BYCND6           FRA/IRS Conf Co
200400210712     C                     MOVEL#1ISDA    BYISDA           Version of ISDA
200500210712     C                     MOVEL#1AGTY    BYAGTY           Type of ISDA ag
200600210712     C                     MOVEL#1AGDT    BYAGDT           Date of ISDA Ag
200700210712     C***********          MOVEL#1AGVV    BYAGVV           Version of ISDACSW097
200800210712     C                     MOVE #1AGVV    BYAGVV           Version of ISDACSW097
200900210712     C                     MOVEL#1AGVV    BYAGVC           Version of ISDACSW097
201000210712      *
201100210712      * USER: Processing before Data update
201200210712     C                     GOTO SAEXIT                     *QUIT
201300210712     C           KLCRSA    KLIST
201400210712     C                     KFLD           BYCYCD           Currency Code
201500210712     C                     KFLD           BYCUST           Customer Number
201600210712     C                     KFLD           BYTRTY           Transaction Typ
201700210712     C                     KFLD           BYBRCA           Branch                             CSD095
201800210712     C                     KFLD           BYSTYP           Sub-Type                           CSD095
201900210712     C/COPY WNCPYSRC,SDH00320
202000210712      * Check for duplicate primary key
202100210712     C                     MOVEL#1BRCA    BYBRCA           Branch                             CSD095
202200210712     C                     MOVEL#1STYP    BYSTYP           Sub-Type                           CSD095
202300210712     C           KLCRSA    SETLL@BYREFX                  90*
202400210712     C/COPY WNCPYSRC,SDH00321
202500210712     C           *IN90     IFEQ '1'
202600210712     C                     MOVEL'USR0362' W0RTN   7
202700210712      * Send message 'Extended Settlements   EX'
202800210712     C                     MOVEL'USR0362' ZAMSID
202900210712     C                     EXSR ZASNMS
203000210712     C                     GOTO SAEXIT
203100210712     C                     END
203200210712      *
203300210712     C           CSD012    IFEQ 'Y'                                                           CSD012
203400210712     C           SVAL11    ANDEQ'Y'                                                           CSD012
203500210712     C                     ELSE
203600210712     C/COPY WNCPYSRC,SDH00322
203700210712     C                     WRITE@BYREFX                91  *
203800210712     C/COPY WNCPYSRC,SDH00323
203900210712     C                     ENDIF                                                              CSD012
204000210712      *
204100210712     C           *IN91     IFEQ '1'
204200210712      * Write error detected
204300210712     C                     MOVEL'Y2U0004' W0RTN   7
204400210712     C                     ELSE
204500210712     C                     END
204600210712      *================================================================
204700210712     CSR         SAEXIT    ENDSR
204800210712      /EJECT
204900210712     CSR         SBCHRC    BEGSR
205000210712      *================================================================
205100210712      * Change Ext. Sett. FRA/IRS - Extended Settlements  *
205200210712      *================================================================
205300210712     C                     MOVEL*BLANK    W0RTN   7
205400210712      * USER: Processing before Data read
205500210712     C                     GOTO SBEXIT                     *QUIT
205600210712      * Set PGM.*Record Data Changed flag
205700210712     C                     MOVE 'N'       YARDC   1
205800210712      *
205900210712      * Move key fields to @BYREFX
206000210712     C                     MOVEL#1CYCD    BYCYCD           Currency Code
206100210712     C                     MOVEL#1CUST    BYCUST           Customer Number
206200210712     C                     MOVEL#1TRTY    BYTRTY           Transaction Typ
206300210712     C                     MOVEL#1BRCA    BYBRCA           Branch                             CSD095
206400210712     C                     MOVEL#1STYP    BYSTYP           Sub-Type                           CSD095
206500210712      *
206600210712     C           KLCHSB    KLIST
206700210712     C                     KFLD           BYCYCD           Currency Code
206800210712     C                     KFLD           BYCUST           Customer Number
206900210712     C                     KFLD           BYTRTY           Transaction Typ
207000210712     C                     KFLD           BYBRCA           Branch                             CSD095
207100210712     C                     KFLD           BYSTYP           Sub-Type                           CSD095
207200210712     C/COPY WNCPYSRC,SDH00324
207300210712     C           KLCHSB    CHAIN@BYREFX              9091  *
207400210712     C/COPY WNCPYSRC,SDH00325
207500210712      *
207600210712     C           *IN90     IFEQ '1'
207700210712      * Record not found
207800210712     C                     MOVEL'Y2U0009' W0RTN   7
207900210712      * Send message '*Record no longer on file'
208000210712     C                     MOVEL'Y2U0009' ZAMSID
208100210712     C                     MOVEL'Y2USRMSG'ZAMSGF
208200210712     C                     EXSR ZASNMS
208300210712     C                     GOTO SBEXIT
208400210712     C                     END
208500210712      *
208600210712     C           *IN91     IFEQ '1'
208700210712      * Record locked
208800210712     C                     MOVEL'Y2U0004' W0RTN   7
208900210712     C                     GOTO SBEXIT
209000210712     C                     END
209100210712      *
209200210712      * Check for changed record
209300210712     C           #1DBRC    IFNE @1DBRC                     IF
209400210712     C                     MOVEL'Y2U0007' W0RTN   7
209500210712      * Send message '*Update not accepted'
209600210712     C                     MOVEL'Y2U0007' ZAMSID
209700210712     C                     MOVEL'Y2USRMSG'ZAMSGF
209800210712     C                     EXSR ZASNMS
209900210712      * Release record lock
210000210712     C/COPY WNCPYSRC,SDH00326
210100210712     C                     UNLCKSDEXSTL0               91  *
210200210712     C/COPY WNCPYSRC,SDH00327
210300210712     C                     GOTO SBEXIT
210400210712     C                     END                             FI #1DBRC
210500210712      * Store record data for null update check
210600210712     C**********           MOVE @1DBRC    YARDCS                                              CGL029
210700210712     C                     MOVEL@1DBRC    YARDCS                                              CGL029
210800210712      * Move non-key fields to @BYREFX
210900210712     C                     MOVEL#1RSTY    BYRSTY           Receipt - Settl
211000210712     C                     MOVEL#1RONO    BYRONO           Receipt - Our N
211100210712     C                     MOVEL#1ROBN    BYROBN           Rcpt - Ordering
211200210712     C                     MOVEL#1ROCS    BYROCS           Rcpt - Ordering
211300210712     C                     MOVEL#1RIBN    BYRIBN           Rcpt - Intermed
211400210712     C                     MOVEL#1RIBL    BYRIBL           Rcpt - I/m Bank
211500210712     C                     MOVEL#1PSTY    BYPSTY           Pay - Settlemen
211600210712     C                     MOVEL#1PONO    BYPONO           Pay - Our Nostr
211700210712     C                     MOVEL#1POBN    BYPOBN           Pay - Ordering
211800210712     C                     MOVEL#1POCS    BYPOCS           Pay - Ordering
211900210712     C                     MOVEL#1PIBN    BYPIBN           Pay - Intermed
212000210712     C                     MOVEL#1PIBA    BYPIBA           Pay - I/m Bank
212100210712     C                     MOVEL#1RCNO    BYRCNO           Receiver Corres
212200210712     C                     MOVEL#1RCAL    BYRCAL           Receiver Corr.
212300210712     C                     MOVEL#1RCNB    BYRCNB           Receiver Number
212400210712     C                     MOVEL#1ACBN    BYACBN           A/c With Bank N
212500210712     C                     MOVEL#1ACBL    BYACBL           A/c With Bank L
212600210712     C                     MOVEL#1BYNB    BYBYNB           Beneficiary Num
212700210712     C                     MOVEL#1BACL    BYBACL           Beneficiary A/c
212800210712     C                     MOVEL#1DPY1    BYDPY1           Details of Paym
212900210712     C                     MOVEL#1DPY2    BYDPY2           Details of Paym
213000210712     C                     MOVEL#1DPY3    BYDPY3           Details of Paym
213100210712     C                     MOVEL#1DPY4    BYDPY4           Details of Paym
213200210712     C                     MOVEL#1DECG    BYDECG           Details of char
213300210712     C                     MOVEL#1BBI1    BYBBI1           Bank to Bank In
213400210712     C                     MOVEL#1BBI2    BYBBI2           Bank to Bank In
213500210712     C                     MOVEL#1BBI3    BYBBI3           Bank to Bank In
213600210712     C                     MOVEL#1BBI4    BYBBI4           Bank to Bank In
213700210712     C                     MOVEL#1BBI5    BYBBI5           Bank to Bank In
213800210712     C                     MOVEL#1BBI6    BYBBI6           Bank to Bank In
213900210712     C                     Z-ADDWURDNB    BYLCD            Last Change Dat
214000210712     C                     MOVEL'A'       BYTYLC           Type of Last Ch
214100210712     C                     MOVEL#1CVMR    BYCVMR           Cover Message R
214200210712     C                     MOVEL#1ORBR    BYORBR           Our Receive Bra
214300210712     C                     MOVEL#1OPBR    BYOPBR           Our Payment Bra
214400210712     C                     MOVEL#1DSR1    BYDSR1           Def Conf Snd to
214500210712     C                     MOVEL#1DSR2    BYDSR2           Def Conf Snd to
214600210712     C                     MOVEL#1DSR3    BYDSR3           Def Conf Snd to
214700210712     C                     MOVEL#1DSR4    BYDSR4           Def Conf Snd to
214800210712     C                     MOVEL#1DSR5    BYDSR5           Def Conf Snd to
214900210712     C                     MOVEL#1DSR6    BYDSR6           Def Conf Snd to
215000210712     C                     MOVEL#1SSR1    BYSSR1           Sett Conf Sndr-
215100210712     C                     MOVEL#1SSR2    BYSSR2           Sett Conf Sndr-
215200210712     C                     MOVEL#1SSR3    BYSSR3           Sett Conf Sndr-
215300210712     C                     MOVEL#1SSR4    BYSSR4           Sett Conf Sndr-
215400210712     C                     MOVEL#1SSR5    BYSSR5           Sett Conf Sndr-
215500210712     C                     MOVEL#1SSR6    BYSSR6           Sett Conf Sndr-
215600210712     C                     MOVEL#1CND1    BYCND1           FRA/IRS Conf Co
215700210712     C                     MOVEL#1CND2    BYCND2           FRA/IRS Conf Co
215800210712     C                     MOVEL#1CND3    BYCND3           FRA/IRS Conf Co
215900210712     C                     MOVEL#1CND4    BYCND4           FRA/IRS Conf Co
216000210712     C                     MOVEL#1CND5    BYCND5           FRA/IRS Conf Co
216100210712     C                     MOVEL#1CND6    BYCND6           FRA/IRS Conf Co
216200210712     C                     MOVEL#1ISDA    BYISDA           Version of ISDA
216300210712     C                     MOVEL#1AGTY    BYAGTY           Type of ISDA ag
216400210712     C                     MOVEL#1AGDT    BYAGDT           Date of ISDA Ag
216500210712     C***********          MOVEL#1AGVV    BYAGVV           Version of ISDACSW097
216600210712     C                     MOVE #1AGVV    BYAGVV           Version of ISDACSW097
216700210712     C                     MOVEL#1AGVV    BYAGVC           Version of ISDACSW097
216800210712      *
216900210712      * Set PGM.*Record Data Changed flag
217000210712     C           @1DBRC    IFNE YARDCS
217100210712     C                     MOVE 'Y'       YARDC
217200210712     C                     END
217300210712      * If changed update record otherwise release record
217400210712     C           YARDC     IFEQ 'Y'
217500210712     C           CSD012    IFEQ 'Y'                                                           CSD012
217600210712     C           SVAL11    ANDEQ'Y'                                                           CSD012
217700210712     C                     ELSE                                                               CSD012
217800210712     C/COPY WNCPYSRC,SDH00328
217900210712     C                     UPDAT@BYREFX                91  *
218000210712     C/COPY WNCPYSRC,SDH00329
218100210712     C                     ENDIF                                                              CSD012
218200210712     C                     ELSE
218300210712     C/COPY WNCPYSRC,SDH00330
218400210712      * Release record lock
218500210712     C                     UNLCKSDEXSTL0               91  *
218600210712     C/COPY WNCPYSRC,SDH00331
218700210712     C                     END
218800210712     C           *IN91     IFEQ '1'
218900210712      * Change error detected
219000210712     C                     MOVEL'Y2U0004' W0RTN   7
219100210712     C                     ELSE
219200210712      *
219300210712      * Update saved record image
219400210712     C                     MOVEL@1DBRC    #1DBRC
219500210712      * DBF change successful
219600210712     C                     END
219700210712      *================================================================
219800210712     CSR         SBEXIT    ENDSR
219900210712      /EJECT
220000210712     CSR         SCRVGN    BEGSR
220100210712      *================================================================
220200210712      * Get 'Window required' ind - MIDAS Modules  *
220300210712      *================================================================
220400210712     C                     MOVEL*BLANK    W0RTN   7
220500210712      * Define keylist
220600210712     C           KRSSC     KLIST
220700210712     C                     KFLD           BGMODS           Modules
220800210712      * Move fields to key list
220900210712     C                     MOVE *BLANK    BGMODS           Modules
221000210712     C                     MOVEL'MMOD'    BGMODS           Modules
221100210712     C           KRSSC     CHAIN@BGREC8              90    *
221200210712      * Data record not found
221300210712     C   90                MOVEL'USR0096' W0RTN   7
221400210712     C           *IN90     IFEQ '0'
221500210712      * USER: Process Data record
221600210712      * CASE: DB1.Window processing requir. is Yes
221700210712     C           BGWDPR    IFEQ 'Y'                        *IF
221800210712     C                     MOVEL'Y'       WUWDPR           Window processi
221900210712     C                     END                             *FI
222000210712     C                     END
222100210712      *================================================================
222200210712     CSR         SCEXIT    ENDSR
222300210712      /EJECT
222400210712     CSR         UASUBR    BEGSR
222500210712      *================================================================
222600210712      * Set up Detail Screen Footer
222700210712      *================================================================
222800210712      * CASE: PAR.Action Code is Delete
222900210712     C           P2ANCD    IFEQ 'D'                        *IF
223000210712      * Setup message data for message
223100210712      * Retrieve message STD FTR:DTLSCR Delete/1
223200210712     C                     MOVELZADFMF    ZAMSGF
223300210712     C                     CALL 'Y2RVMGC'              90  *
223400210712     C                     PARM *BLANK    W0RTN   7        Return code
223500210712     C                     PARM 'USR2921' ZAMSID  7        Message ID
223600210712     C                     PARM           ZAMSGF 10        Message file
223700210712     C                     PARM           ZAMSDA132        Message data
223800210712     C           WUSFT1    PARM           W0MTX 132        Returned messag
223900210712     C                     MOVEL*BLANK    ZAMSDA
224000210712     C                     MOVEL*BLANK    ZAMSGF
224100210712      * Move to Single Footer - Standard Functions  *
224200210712     C                     MOVELWUSFT1    ##CTX1                          S01229
224300210712     C                     ELSE
224400210712      * CASE: *OTHERWISE
224500210712      * Setup message data for message
224600210712      * Retrieve message STD FTR:DTLSCR New Rec/1
224700210712     C                     MOVELZADFMF    ZAMSGF
224800210712     C                     CALL 'Y2RVMGC'              90  *
224900210712     C                     PARM *BLANK    W0RTN   7        Return code
225000210712     C                     PARM 'USR2919' ZAMSID  7        Message ID
225100210712     C                     PARM           ZAMSGF 10        Message file
225200210712     C                     PARM           ZAMSDA132        Message data
225300210712     C           WUSFT1    PARM           W0MTX 132        Returned messag
225400210712     C                     MOVEL*BLANK    ZAMSDA
225500210712     C                     MOVEL*BLANK    ZAMSGF
225600210712      * Move to Single Footer - Standard Functions  *
225700210712     C                     MOVELWUSFT1    ##CTX1                          S01229
225800210712     C                     END                             *FI
225900210712      *================================================================
226000210712     CSR         UAEXIT    ENDSR
226100210712      /EJECT
226200210712     CSR         UBSUBR    BEGSR
226300210712      *================================================================
226400210712      * Send Error messages
226500210712      *================================================================
226600210712      *                                                                                       CSW212
226700210712      ** Set indicator to skip FRA/IRS specific message if                                    CSW212
226800210712      ** CSW212 is switched ON and transaction types are                                      CSW212
226900210712      ** FX related types                                                                     CSW212
227000210712      *                                                                                       CSW212
227100210712     C                     MOVEL'N'       W@FXTY  1                                           CSW212
227200210712     C           CSW212    IFEQ 'Y'                                                           CSW212
227300210712     C           #1TRTY    IFEQ 'AT'                                                          CSW212
227400210712     C           #1TRTY    OREQ 'FX'                                                          CSW212
227500210712     C           #1TRTY    OREQ 'OP'                                                          CSW212
227600210712     C           #1TRTY    OREQ 'FF'                                                          CSW212
227700210712     C           #1TRTY    OREQ 'CL'                                                          CSW212
227800210712     C                     MOVEL'Y'       W@FXTY                                              CSW212
227900210712     C                     ENDIF                                                              CSW212
228000210712     C                     ENDIF                                                              CSW212
228100210712      * x01
228200210712      * CASE: WRK.error code is X01
228300210712     C           WUERRC    IFEQ 'X01'                      *IF
228400210712     C           W@FXTY    IFEQ 'N'                                                           CSW212
228500210712      * Setup message data for message
228600210712     C                     MOVEL#1DSR1    ZA0001           Def Conf Snd to
228700210712     C                     MOVEL#1DSR2    ZA0002           Def Conf Snd to
228800210712     C                     MOVEL#1DSR3    ZA0003           Def Conf Snd to
228900210712     C                     MOVEL#1DSR4    ZA0004           Def Conf Snd to
229000210712     C                     MOVEL#1DSR5    ZA0005           Def Conf Snd to
229100210712     C                     MOVEL#1DSR6    ZA0006           Def Conf Snd to
229200210712      * Send message 'Def Conf Snd-Rcv inf  INV'
229300210712     C                     MOVEL'USR3126' ZAMSID
229400210712     C                     EXSR ZASNMS
229500210712     C                     ENDIF                                                              CSW212
229600210712     C                     SETON                     993132*
229700210712     C                     SETON                     333435*
229800210712     C                     SETON                     36    *
229900210712      *
230000210712     C                     END                             *FI
230100210712      * X02
230200210712      * CASE: WRK.error code is X02
230300210712     C           WUERRC    IFEQ 'X02'                      *IF
230400210712     C           W@FXTY    IFEQ 'N'                                                           CSW212
230500210712      * Setup message data for message
230600210712     C                     MOVEL#1SSR1    ZA0007           Sett Conf Sndr-
230700210712     C                     MOVEL#1SSR2    ZA0008           Sett Conf Sndr-
230800210712     C                     MOVEL#1SSR3    ZA0009           Sett Conf Sndr-
230900210712     C                     MOVEL#1SSR4    ZA0010           Sett Conf Sndr-
231000210712     C                     MOVEL#1SSR5    ZA0011           Sett Conf Sndr-
231100210712     C                     MOVEL#1SSR6    ZA0012           Sett Conf Sndr-
231200210712      * Send message 'Sett/rst Conf Snd-Rcv INV'
231300210712     C                     MOVEL'USR3127' ZAMSID
231400210712     C                     EXSR ZASNMS
231500210712     C                     ENDIF                                                              CSW212
231600210712     C                     SETON                     993738*
231700210712     C                     SETON                     394041*
231800210712     C                     SETON                     42    *
231900210712      *
232000210712     C                     END                             *FI
232100210712      * X03
232200210712      * CASE: WRK.error code is X03
232300210712     C           WUERRC    IFEQ 'X03'                      *IF
232400210712     C           W@FXTY    IFEQ 'N'                                                           CSW212
232500210712      * Setup message data for message
232600210712     C                     MOVEL#1CND1    ZA0013           FRA/IRS Conf Co
232700210712     C                     MOVEL#1CND2    ZA0014           FRA/IRS Conf Co
232800210712     C                     MOVEL#1CND3    ZA0015           FRA/IRS Conf Co
232900210712     C                     MOVEL#1CND4    ZA0016           FRA/IRS Conf Co
233000210712     C                     MOVEL#1CND5    ZA0017           FRA/IRS Conf Co
233100210712     C                     MOVEL#1CND6    ZA0018           FRA/IRS Conf Co
233200210712      * Send message 'FRA/IRS Conf. Conds   INV'
233300210712     C                     MOVEL'USR3130' ZAMSID
233400210712     C                     EXSR ZASNMS
233500210712     C                     ENDIF                                                              CSW212
233600210712     C                     SETON                     994344*
233700210712     C                     SETON                     454647*
233800210712     C                     SETON                     48    *
233900210712      *
234000210712     C                     END                             *FI
234100210712      * X04
234200210712      * CASE: WRK.error code is X04
234300210712     C           WUERRC    IFEQ 'X04'                      *IF
234400210712     C           W@FXTY    IFEQ 'N'                                                           CSW212
234500210712      * Setup message data for message
234600210712     C                     MOVEL#1CND1    ZA0019           FRA/IRS Conf Co
234700210712      * Send message 'FRA/IRS Conf. Cond. 1 INV'
234800210712     C                     MOVEL'USR3129' ZAMSID
234900210712     C                     EXSR ZASNMS
235000210712     C                     ENDIF                                                              CSW212
235100210712     C                     SETON                     9943  *
235200210712      *
235300210712     C                     END                             *FI
235400210712      * 400
235500210712      * CASE: WRK.error code is 400
235600210712     C           WUERRC    IFEQ '400'                      *IF
235700210712      * Setup message data for message
235800210712     C                     MOVEL#1CND1    ZA0020           FRA/IRS Conf Co
235900210712      * Send message 'Condition 1 Mandatory'
236000210712     C                     MOVEL'USR3125' ZAMSID
236100210712     C                     EXSR ZASNMS
236200210712     C                     SETON                     9943  *
236300210712      *
236400210712     C                     END                             *FI
236500210712      * 401
236600210712      * CASE: WRK.error code is 401
236700210712     C           WUERRC    IFEQ '401'                      *IF
236800210712      * Setup message data for message
236900210712     C                     MOVEL#1AGTY    ZA0021           Type of ISDA ag
237000210712      * Send message 'Type of ISDA Agreemnt INV'
237100210712     C                     MOVEL'USR3116' ZAMSID
237200210712     C                     EXSR ZASNMS
237300210712     C                     SETON                     9950  *
237400210712      *
237500210712     C                     END                             *FI
237600210712      * 402
237700210712      * CASE: WRK.error code is 402
237800210712     C           WUERRC    IFEQ '402'                      *IF
237900210712      * Setup message data for message
238000210712     C                     MOVEL#1AGDT    ZA0022           Date of ISDA Ag
238100210712      * Send message 'Date of ISDA Agreemnt INV'
238200210712     C                     MOVEL'USR3118' ZAMSID
238300210712     C                     EXSR ZASNMS
238400210712     C                     SETON                     9951  *
238500210712      *
238600210712     C                     END                             *FI
238700210712      * 403
238800210712      * CASE: WRK.error code is 403
238900210712     C           WUERRC    IFEQ '403'                      *IF
239000210712      * Setup message data for message
239100210712     C                     MOVEL#1AGDT    ZA0023           Date of ISDA Ag
239200210712      * Send message 'Date of ISDA Agreemnt INV'
239300210712     C*********************MOVEL'USR3118' ZAMSID                          CSW097
239400210712     C                     MOVEL'USR4290' ZAMSID                          CSW097
239500210712     C                     EXSR ZASNMS
239600210712     C                     SETON                     9951  *
239700210712      *
239800210712     C                     END                             *FI
239900210712      **404*or*405*****************************************               CSW097
240000210712      **CASE:**********************************************               CSW097
240100210712      ***-*c1*OR*c2****************************************               CSW097
240200210712      ****|-*c1****:*WRK.error*code*is*404*****************               CSW097
240300210712      ****|-*c2****:*WRK.error*code*is*405*****************               CSW097
240400210712      *   '-
240500210712      * 404                                                               CSW097
240600210712      * CASE: WRK.error code is 404                                       CSW097
240700210712     C           WUERRC    IFEQ '404'                      *IF
240800210712     C***********WUERRC    OREQ '405'                      *OR            CSW097
240900210712      * Setup message data for message
241000210712     C                     MOVEL#1AGVV    ZA0024           Version of ISDA
241100210712      * Send message 'Vers of ISDA Agreemnt INV'
241200210712     C                     MOVEL'USR3117' ZAMSID
241300210712     C                     EXSR ZASNMS
241400210712     C                     SETON                     9952  *
241500210712      *                                                                   CSW097
241600210712     C                     END                             *FI            CSW097
241700210712      *
241800210712      * 405                                                               CSW097
241900210712      * CASE: WRK.error code is 405                                       CSW097
242000210712     C           WUERRC    IFEQ '405'                      *IF            CSW097
242100210712      * Setup message data for message                                    CSW097
242200210712     C                     MOVEL#1AGVV    ZA0024           Version of ISDACSW097
242300210712      * Send message 'Vers of ISDA Agreemnt INV'                          CSW097
242400210712     C                     MOVEL'USR4291' ZAMSID                          CSW097
242500210712     C                     EXSR ZASNMS                                    CSW097
242600210712     C                     SETON                     9952  *              CSW097
242700210712      *                                                                   CSW097
242800210712     C                     END                             *FI
242900210712      * 406
243000210712      * CASE: WRK.error code is 406
243100210712     C           WUERRC    IFEQ '406'                      *IF
243200210712      * Setup message data for message
243300210712     C                     MOVEL#1ISDA    ZA0025           Version of ISDA
243400210712      * Send message 'Version of ISDA Rules INV'
243500210712     C                     MOVEL'USR3115' ZAMSID
243600210712     C                     EXSR ZASNMS
243700210712     C                     SETON                     9949  *
243800210712      *
243900210712     C                     END                             *FI
244000210712      * 407                                                               CSW097
244100210712      * CASE: WRK.error code is 407                                       CSW097
244200210712     C           WUERRC    IFEQ '407'                      *IF            CSW097
244300210712      * Setup message data for message                                    CSW097
244400210712     C                     MOVEL#1ISDA    ZA0025           Version of ISDACSW097
244500210712      * Send message 'Version of ISDA Rules INV'                          CSW097
244600210712     C                     MOVEL'USR4292' ZAMSID                          CSW097
244700210712     C                     EXSR ZASNMS                                    CSW097
244800210712     C                     SETON                     9949  *              CSW097
244900210712      *                                                                   CSW097
245000210712     C                     END                             *FI            CSW097
245100210712      *                                                                   CSW097
245200210712      * 409                                                               CSW097
245300210712      * CASE: WRK.error code is 409                                       CSW097
245400210712     C           WUERRC    IFEQ '409'                      *IF            CSW097
245500210712      * Setup message data for message                                    CSW097
245600210712     C                     MOVEL#1AGTY    ZA0021           Version of ISDACSW097
245700210712      * Send message 'Type of ISDA Agreemnt INV'                          CSW097
245800210712     C                     MOVEL'USR4293' ZAMSID                          CSW097
245900210712     C                     EXSR ZASNMS                                    CSW097
246000210712     C                     SETON                     9950  *              CSW097
246100210712      *                                                                   CSW097
246200210712     C                     END                             *FI            CSW097
246300210712      * 412                                                               CSW097
246400210712      * CASE: WRK.error code is 412                                       CSW097
246500210712     C           WUERRC    IFEQ '412'                      *IF            CSW097
246600210712     C           WUERRC    OREQ '408'                      *IF            173052
246700210712      * Setup message data for message                                    CSW097
246800210712     C                     MOVEL#1ISDA    ZA0025           Version of ISDACSW097
246900210712      * Send message 'Version of ISDA Rules INV'                          CSW097
247000210712     C                     MOVEL'USR4294' ZAMSID                          CSW097
247100210712     C                     EXSR ZASNMS                                    CSW097
247200210712     C                     SETON                     9949  *              CSW097
247300210712      *                                                                   CSW097
247400210712     C                     END                             *FI            CSW097
247500210712      *                                                                   CSW200
247600210712     C           CSW200    IFEQ 'Y'                                       CSW200
247700210712      * 414                                                               CSW200
247800210712      * CASE: WRK.error code is 414                                       CSW200
247900210712     C           WUERRC    IFEQ '414'                                     CSW200
248000210712      * Send message 'ISDA Rules Version must be 91 or 98'                CSW200
248100210712     C                     MOVEL'USR4426' ZAMSID                          CSW200
248200210712     C                     EXSR ZASNMS                                    CSW200
248300210712     C                     SETON                     9949                 CSW200
248400210712      *                                                                   CSW200
248500210712     C                     END                                            CSW200
248600210712      * 415                                                               CSW200
248700210712      * CASE: WRK.error code is 415                                       CSW200
248800210712     C           WUERRC    IFEQ '415'                                     CSW200
248900210712      * Send message 'Agreement Date must be blank for FRABBA'            CSW200
249000210712     C                     MOVEL'USR4427' ZAMSID                          CSW200
249100210712     C                     EXSR ZASNMS                                    CSW200
249200210712     C                     SETON                     9951                 CSW200
249300210712      *                                                                   CSW200
249400210712     C                     END                                            CSW200
249500210712      * 416                                                               CSW200
249600210712      * CASE: WRK.error code is 416                                       CSW200
249700210712     C           WUERRC    IFEQ '416'                                     CSW200
249800210712      * Send message 'Agreement Version must be blank for FRABBA'         CSW200
249900210712     C                     MOVEL'USR4428' ZAMSID                          CSW200
250000210712     C                     EXSR ZASNMS                                    CSW200
250100210712     C                     SETON                     9952                 CSW200
250200210712      *                                                                   CSW200
250300210712     C                     END                                            CSW200
250400210712      *                                                                                       CSW212
250500210712     C           WUERRC    IFEQ '418'                                                         CSW212
250600210712     C                     MOVEL'USR4456' ZAMSID                                              CSW212
250700210712     C                     EXSR ZASNMS                                                        CSW212
250800210712     C                     SETON                     9949                                     CSW212
250900210712     C                     ENDIF                                                              CSW212
251000210712      *                                                                                       CSW212
251100210712     C           WUERRC    IFEQ '419'                                                         CSW212
251200210712     C                     MOVEL'USR4457' ZAMSID                                              CSW212
251300210712     C                     EXSR ZASNMS                                                        CSW212
251400210712     C                     SETON                     9950                                     CSW212
251500210712     C                     ENDIF                                                              CSW212
251600210712      *                                                                                       CSW212
251700210712     C           WUERRC    IFEQ '420'                                                         CSW212
251800210712     C                     MOVEL'USR4458' ZAMSID                                              CSW212
251900210712     C                     EXSR ZASNMS                                                        CSW212
252000210712     C                     SETON                     9950                                     CSW212
252100210712     C                     ENDIF                                                              CSW212
252200210712      *                                                                                       CSW212
252300210712     C           WUERRC    IFEQ '421'                                                         CSW212
252400210712     C                     MOVEL'USR4459' ZAMSID                                              CSW212
252500210712     C                     EXSR ZASNMS                                                        CSW212
252600210712     C                     SETON                     993132                                   CSW212
252700210712     C                     SETON                     333435                                   CSW212
252800210712     C                     SETON                     36                                       CSW212
252900210712     C                     ENDIF                                                              CSW212
253000210712      *                                                                                       CSW214
253100210712     C           WUERRC    IFEQ '899'                                                         CSW214
253200210712      * Send message 'Warning message for invalid ISO Country Code'                           CSW214
253300210712     C                     MOVEL'USR4331' ZAMSID                                              CSW214
253400210712     C                     MOVEL'*INFO  ' ZAMSTP                                              CSW214
253500210712     C                     EXSR ZASNMS                                                        CSW214
253600210712     C           WSENT     IFEQ 'N'                                                           CSW214
253700210712     C                     MOVEL'Y'       WSENT                                               CSW214
253800210712     C                     MOVEL'Y'       W0DCF                                               CSW214
253900210712     C                     ENDIF                                                              CSW214
254000210712      *                                                                                       CSW214
254100210712     C                     ENDIF                                                              CSW214
254200210712      *                                                                                       CSW214
254300210712      ** Send message 'Agreement type is mandatory' for MT600                                 CSW214
254400210712      *                                                                                       CSW214
254500210712     C           WUERRC    IFEQ '422'                                                         CSW214
254600210712     C                     MOVEL'USR9051' ZAMSID                                              CSW214
254700210712     C                     EXSR ZASNMS                                                        CSW214
254800210712     C                     SETON                     9950                                     CSW214
254900210712     C                     ENDIF                                                              CSW214
255000210712      *                                                                                     MD030342
255100210712      ** Send message 'valid values are ISDA and OTHER' for MT600                           MD030342
255200210712      *                                                                                     MD030342
255300210712     C           WUERRC    IFEQ '423'                                                       MD030342
255400210712     C                     MOVEL'USR9052' ZAMSID                                            MD030342
255500210712     C                     EXSR ZASNMS                                                      MD030342
255600210712     C                     SETON                     9950                                   MD030342
255700210712     C                     ENDIF                                                            MD030342
255800210712      *                                                                   CSW200
255900210712     C                     END                                            CSW200
256000210712      *================================================================
256100210712     CSR         UBEXIT    ENDSR
256200210712      /EJECT
256300210712     CSR         UCSUBR    BEGSR
256400210712      *================================================================
256500210712      * Set up Detail Screen Footer
256600210712      *================================================================
256700210712      * Setup message data for message
256800210712      * Retrieve message STD FTR:KEYSCR /1
256900210712     C                     MOVELZADFMF    ZAMSGF
257000210712     C                     CALL 'Y2RVMGC'              90  *
257100210712     C                     PARM *BLANK    W0RTN   7        Return code
257200210712     C                     PARM 'USR2918' ZAMSID  7        Message ID
257300210712     C                     PARM           ZAMSGF 10        Message file
257400210712     C                     PARM           ZAMSDA132        Message data
257500210712     C           WUSFT1    PARM           W0MTX 132        Returned messag
257600210712     C                     MOVEL*BLANK    ZAMSDA
257700210712     C                     MOVEL*BLANK    ZAMSGF
257800210712      * Move to Single Footer - Standard Functions  *
257900210712     C                     MOVELWUSFT1    ##CTX1                          S01229
258000210712      *================================================================
258100210712     CSR         UCEXIT    ENDSR
258200210712      /EJECT
258300210712     CSR         VACKRL    BEGSR
258400210712      *================================================================
258500210712      * Select existing record
258600210712      *================================================================
258700210712      * Name search required?
258800210712     C                     MOVEL#1CYCD    WK1X01  1
258900210712     C                     MOVEL#1CUST    WK1X02  1
259000210712     C                     MOVEL#1TRTY    WK1X03  1
259100210712     C           WK1X01    IFEQ '?'                        Currency Code
259200210712     C           WK1X02    OREQ '?'                        Customer Number
259300210712     C           WK1X03    OREQ '?'                        Transaction Typ
259400210712     C                     CALL 'SD0400S'              90  Select Extended
259500210712     C                     PARM *BLANK    W0RTN   7
259600210712     C           #1CYCD    PARM #1CYCD    WQ0001  3        Currency Code
259700210712     C           #1CUST    PARM #1CUST    WQ0002  6        Customer Number
259800210712     C           #1TRTY    PARM #1TRTY    WQ0003  2        Transaction Typ
259900210712     C                     PARM *BLANKS   WQ0012  2        Deal Sub-Type                      CSD095
260000210712     C                     PARM *BLANKS   WQ0013  3        Branch                             CSD095
260100210712      *
260200210712     C           *IN90     IFEQ '1'
260300210712      * Call to program ended in error
260400210712     C                     MOVEL'Y2U0032' W0RTN
260500210712     C                     MOVEL*BLANKS   W0CLPG 10
260600210712     C                     MOVEL'SD0400S' W0CLPG
260700210712      * Send message '*Error occured on CALL...'
260800210712     C                     MOVEL'Y2U0032' ZAMSID
260900210712     C                     MOVEL'Y2USRMSG'ZAMSGF
261000210712     C                     MOVELW0CLPG    ZAMSDA           Message data
261100210712     C                     EXSR ZASNMS
261200210712     C                     END
261300210712      *
261400210712      * Error detected?
261500210712     C           W0RTN     IFNE *BLANK
261600210712     C           W0RTN     ANDNE'Y2U0016'
261700210712     C                     SETON                     993132*
261800210712     C                     SETON                     33    *
261900210712     C                     END
262000210712      * Defer confirm
262100210712     C                     MOVEL'Y'       W0DCF   1
262200210712     C                     END
262300210712      *================================================================
262400210712     CSR         VAEXIT    ENDSR
262500210712      /EJECT
262600210712     CSR         VBCKRL    BEGSR
262700210712      *================================================================
262800210712      * Check reference to Client Details
262900210712      *================================================================
263000210712     C                     MOVEL*BLANK    W0RTN   7
263100210712      * Name search required?
263200210712     C                     MOVEL#1ROBN    WK1X01  1
263300210712     C           WK1X01    IFEQ '?'                        Customer Number
263400210712     C                     CALL 'SD0010S'              90  Select Client D
263500210712     C                     PARM *BLANK    W0RTN   7
263600210712     C           #1ROBN    PARM #1ROBN    WQ0004  6        Customer Number
263700210712      *
263800210712     C           *IN90     IFEQ '1'
263900210712      * Call to program ended in error
264000210712     C                     MOVEL'Y2U0032' W0RTN
264100210712     C                     MOVEL*BLANKS   W0CLPG 10
264200210712     C                     MOVEL'SD0010S' W0CLPG
264300210712      * Send message '*Error occured on CALL...'
264400210712     C                     MOVEL'Y2U0032' ZAMSID
264500210712     C                     MOVEL'Y2USRMSG'ZAMSGF
264600210712     C                     MOVELW0CLPG    ZAMSDA           Message data
264700210712     C                     EXSR ZASNMS
264800210712     C                     END
264900210712      *
265000210712      * Error detected?
265100210712     C           W0RTN     IFNE *BLANK
265200210712     C           W0RTN     ANDNE'Y2U0016'
265300210712     C                     SETON                     99    *
265400210712     C                     END
265500210712      * Defer confirm
265600210712     C                     MOVEL'Y'       W0DCF   1
265700210712      * No value selected, exit
265800210712     C           W0RTN     IFNE *BLANK
265900210712     C                     GOTO VBEXIT
266000210712     C                     END
266100210712     C                     END
266200210712      *................................................................
266300210712      * If all low order keys not entered, exit
266400210712     C           #1ROBN    IFEQ *BLANK                     Customer Number
266500210712     C                     GOTO VBEXIT
266600210712     C                     END
266700210712      *
266800210712     C           KLVBBB    KLIST
266900210712     C                     KFLD           BBCUST           Customer Number
267000210712      * Setup key
267100210712     C                     MOVEL#1ROBN    BBCUST           Customer Number
267200210712     C           KLVBBB    CHAIN@BBREBF              9091  *
267300210712     C           *IN90     IFEQ '0'
267400210712      * Record found - move back any virtuals
267500210712     C                     GOTO VBEXIT
267600210712     C                     END
267700210712      * Send message 'Client Details         NF'
267800210712     C                     MOVEL'USR0081' ZAMSID
267900210712     C                     EXSR ZASNMS
268000210712     C                     MOVEL'USR0081' W0RTN
268100210712      *================================================================
268200210712     CSR         VBEXIT    ENDSR
268300210712      /EJECT
268400210712     CSR         VCCKRL    BEGSR
268500210712      *================================================================
268600210712      * Check reference to Client Details
268700210712      *================================================================
268800210712     C                     MOVEL*BLANK    W0RTN   7
268900210712      * Name search required?
269000210712     C                     MOVEL#1ROCS    WK1X01  1
269100210712     C           WK1X01    IFEQ '?'                        Customer Number
269200210712     C                     CALL 'SD0010S'              90  Select Client D
269300210712     C                     PARM *BLANK    W0RTN   7
269400210712     C           #1ROCS    PARM #1ROCS    WQ0005  6        Customer Number
269500210712      *
269600210712     C           *IN90     IFEQ '1'
269700210712      * Call to program ended in error
269800210712     C                     MOVEL'Y2U0032' W0RTN
269900210712     C                     MOVEL*BLANKS   W0CLPG 10
270000210712     C                     MOVEL'SD0010S' W0CLPG
270100210712      * Send message '*Error occured on CALL...'
270200210712     C                     MOVEL'Y2U0032' ZAMSID
270300210712     C                     MOVEL'Y2USRMSG'ZAMSGF
270400210712     C                     MOVELW0CLPG    ZAMSDA           Message data
270500210712     C                     EXSR ZASNMS
270600210712     C                     END
270700210712      *
270800210712      * Error detected?
270900210712     C           W0RTN     IFNE *BLANK
271000210712     C           W0RTN     ANDNE'Y2U0016'
271100210712     C                     SETON                     99    *
271200210712     C                     END
271300210712      * Defer confirm
271400210712     C                     MOVEL'Y'       W0DCF   1
271500210712      * No value selected, exit
271600210712     C           W0RTN     IFNE *BLANK
271700210712     C                     GOTO VCEXIT
271800210712     C                     END
271900210712     C                     END
272000210712      *................................................................
272100210712      * If all low order keys not entered, exit
272200210712     C           #1ROCS    IFEQ *BLANK                     Customer Number
272300210712     C                     GOTO VCEXIT
272400210712     C                     END
272500210712      *
272600210712     C           KLVCBB    KLIST
272700210712     C                     KFLD           BBCUST           Customer Number
272800210712      * Setup key
272900210712     C                     MOVEL#1ROCS    BBCUST           Customer Number
273000210712     C           KLVCBB    CHAIN@BBREBF              9091  *
273100210712     C           *IN90     IFEQ '0'
273200210712      * Record found - move back any virtuals
273300210712     C                     GOTO VCEXIT
273400210712     C                     END
273500210712      * Send message 'Client Details         NF'
273600210712     C                     MOVEL'USR0081' ZAMSID
273700210712     C                     EXSR ZASNMS
273800210712     C                     MOVEL'USR0081' W0RTN
273900210712      *================================================================
274000210712     CSR         VCEXIT    ENDSR
274100210712      /EJECT
274200210712     CSR         VDCKRL    BEGSR
274300210712      *================================================================
274400210712      * Check reference to Client Details
274500210712      *================================================================
274600210712     C                     MOVEL*BLANK    W0RTN   7
274700210712      * Name search required?
274800210712     C                     MOVEL#1POBN    WK1X01  1
274900210712     C           WK1X01    IFEQ '?'                        Customer Number
275000210712     C                     CALL 'SD0010S'              90  Select Client D
275100210712     C                     PARM *BLANK    W0RTN   7
275200210712     C           #1POBN    PARM #1POBN    WQ0006  6        Customer Number
275300210712      *
275400210712     C           *IN90     IFEQ '1'
275500210712      * Call to program ended in error
275600210712     C                     MOVEL'Y2U0032' W0RTN
275700210712     C                     MOVEL*BLANKS   W0CLPG 10
275800210712     C                     MOVEL'SD0010S' W0CLPG
275900210712      * Send message '*Error occured on CALL...'
276000210712     C                     MOVEL'Y2U0032' ZAMSID
276100210712     C                     MOVEL'Y2USRMSG'ZAMSGF
276200210712     C                     MOVELW0CLPG    ZAMSDA           Message data
276300210712     C                     EXSR ZASNMS
276400210712     C                     END
276500210712      *
276600210712      * Error detected?
276700210712     C           W0RTN     IFNE *BLANK
276800210712     C           W0RTN     ANDNE'Y2U0016'
276900210712     C                     SETON                     99    *
277000210712     C                     END
277100210712      * Defer confirm
277200210712     C                     MOVEL'Y'       W0DCF   1
277300210712      * No value selected, exit
277400210712     C           W0RTN     IFNE *BLANK
277500210712     C                     GOTO VDEXIT
277600210712     C                     END
277700210712     C                     END
277800210712      *................................................................
277900210712      * If all low order keys not entered, exit
278000210712     C           #1POBN    IFEQ *BLANK                     Customer Number
278100210712     C                     GOTO VDEXIT
278200210712     C                     END
278300210712      *
278400210712     C           KLVDBB    KLIST
278500210712     C                     KFLD           BBCUST           Customer Number
278600210712      * Setup key
278700210712     C                     MOVEL#1POBN    BBCUST           Customer Number
278800210712     C           KLVDBB    CHAIN@BBREBF              9091  *
278900210712     C           *IN90     IFEQ '0'
279000210712      * Record found - move back any virtuals
279100210712     C                     GOTO VDEXIT
279200210712     C                     END
279300210712      * Send message 'Client Details         NF'
279400210712     C                     MOVEL'USR0081' ZAMSID
279500210712     C                     EXSR ZASNMS
279600210712     C                     MOVEL'USR0081' W0RTN
279700210712      *================================================================
279800210712     CSR         VDEXIT    ENDSR
279900210712      /EJECT
280000210712     CSR         VECKRL    BEGSR
280100210712      *================================================================
280200210712      * Check reference to Client Details
280300210712      *================================================================
280400210712     C                     MOVEL*BLANK    W0RTN   7
280500210712      * Name search required?
280600210712     C                     MOVEL#1POCS    WK1X01  1
280700210712     C           WK1X01    IFEQ '?'                        Customer Number
280800210712     C                     CALL 'SD0010S'              90  Select Client D
280900210712     C                     PARM *BLANK    W0RTN   7
281000210712     C           #1POCS    PARM #1POCS    WQ0007  6        Customer Number
281100210712      *
281200210712     C           *IN90     IFEQ '1'
281300210712      * Call to program ended in error
281400210712     C                     MOVEL'Y2U0032' W0RTN
281500210712     C                     MOVEL*BLANKS   W0CLPG 10
281600210712     C                     MOVEL'SD0010S' W0CLPG
281700210712      * Send message '*Error occured on CALL...'
281800210712     C                     MOVEL'Y2U0032' ZAMSID
281900210712     C                     MOVEL'Y2USRMSG'ZAMSGF
282000210712     C                     MOVELW0CLPG    ZAMSDA           Message data
282100210712     C                     EXSR ZASNMS
282200210712     C                     END
282300210712      *
282400210712      * Error detected?
282500210712     C           W0RTN     IFNE *BLANK
282600210712     C           W0RTN     ANDNE'Y2U0016'
282700210712     C                     SETON                     99    *
282800210712     C                     END
282900210712      * Defer confirm
283000210712     C                     MOVEL'Y'       W0DCF   1
283100210712      * No value selected, exit
283200210712     C           W0RTN     IFNE *BLANK
283300210712     C                     GOTO VEEXIT
283400210712     C                     END
283500210712     C                     END
283600210712      *................................................................
283700210712      * If all low order keys not entered, exit
283800210712     C           #1POCS    IFEQ *BLANK                     Customer Number
283900210712     C                     GOTO VEEXIT
284000210712     C                     END
284100210712      *
284200210712     C           KLVEBB    KLIST
284300210712     C                     KFLD           BBCUST           Customer Number
284400210712      * Setup key
284500210712     C                     MOVEL#1POCS    BBCUST           Customer Number
284600210712     C           KLVEBB    CHAIN@BBREBF              9091  *
284700210712     C           *IN90     IFEQ '0'
284800210712      * Record found - move back any virtuals
284900210712     C                     GOTO VEEXIT
285000210712     C                     END
285100210712      * Send message 'Client Details         NF'
285200210712     C                     MOVEL'USR0081' ZAMSID
285300210712     C                     EXSR ZASNMS
285400210712     C                     MOVEL'USR0081' W0RTN
285500210712      *================================================================
285600210712     CSR         VEEXIT    ENDSR
285700210712      /EJECT
285800210712     CSR         VFCKRL    BEGSR
285900210712      *================================================================
286000210712      * Check reference to Branch Codes
286100210712      *================================================================
286200210712     C                     MOVEL*BLANK    W0RTN   7
286300210712      * Name search required?
286400210712     C                     MOVEL#1ORBR    WK1X01  1
286500210712     C           WK1X01    IFEQ '?'                        Branch code
286600210712     C                     CALL 'SD0061S'              90  Select Branch C
286700210712     C                     PARM *BLANK    W0RTN   7
286800210712     C           #1ORBR    PARM #1ORBR    WQ0008  3        Branch code
286900210712      *
287000210712     C           *IN90     IFEQ '1'
287100210712      * Call to program ended in error
287200210712     C                     MOVEL'Y2U0032' W0RTN
287300210712     C                     MOVEL*BLANKS   W0CLPG 10
287400210712     C                     MOVEL'SD0061S' W0CLPG
287500210712      * Send message '*Error occured on CALL...'
287600210712     C                     MOVEL'Y2U0032' ZAMSID
287700210712     C                     MOVEL'Y2USRMSG'ZAMSGF
287800210712     C                     MOVELW0CLPG    ZAMSDA           Message data
287900210712     C                     EXSR ZASNMS
288000210712     C                     END
288100210712      *
288200210712      * Error detected?
288300210712     C           W0RTN     IFNE *BLANK
288400210712     C           W0RTN     ANDNE'Y2U0016'
288500210712     C                     SETON                     99    *
288600210712     C                     END
288700210712      * Defer confirm
288800210712     C                     MOVEL'Y'       W0DCF   1
288900210712      * No value selected, exit
289000210712     C           W0RTN     IFNE *BLANK
289100210712     C                     GOTO VFEXIT
289200210712     C                     END
289300210712     C                     END
289400210712      *................................................................
289500210712      * If all low order keys not entered, exit
289600210712     C           #1ORBR    IFEQ *BLANK                     Branch code
289700210712     C                     GOTO VFEXIT
289800210712     C                     END
289900210712      *
290000210712     C           KLVFA8    KLIST
290100210712     C                     KFLD           A8BRCD           Branch code
290200210712      * Setup key
290300210712     C                     MOVEL#1ORBR    A8BRCD           Branch code
290400210712     C           KLVFA8    CHAIN@A8REB0              9091  *
290500210712     C           *IN90     IFEQ '0'
290600210712      * Record found - move back any virtuals
290700210712     C                     GOTO VFEXIT
290800210712     C                     END
290900210712      * Send message 'Branch code            NF'
291000210712     C                     MOVEL'USR0075' ZAMSID
291100210712     C                     EXSR ZASNMS
291200210712     C                     MOVEL'USR0075' W0RTN
291300210712      *================================================================
291400210712     CSR         VFEXIT    ENDSR
291500210712      /EJECT
291600210712     CSR         VGCKRL    BEGSR
291700210712      *================================================================
291800210712      * Check reference to Branch Codes
291900210712      *================================================================
292000210712     C                     MOVEL*BLANK    W0RTN   7
292100210712      * Name search required?
292200210712     C                     MOVEL#1OPBR    WK1X01  1
292300210712     C           WK1X01    IFEQ '?'                        Branch code
292400210712     C                     CALL 'SD0061S'              90  Select Branch C
292500210712     C                     PARM *BLANK    W0RTN   7
292600210712     C           #1OPBR    PARM #1OPBR    WQ0009  3        Branch code
292700210712      *
292800210712     C           *IN90     IFEQ '1'
292900210712      * Call to program ended in error
293000210712     C                     MOVEL'Y2U0032' W0RTN
293100210712     C                     MOVEL*BLANKS   W0CLPG 10
293200210712     C                     MOVEL'SD0061S' W0CLPG
293300210712      * Send message '*Error occured on CALL...'
293400210712     C                     MOVEL'Y2U0032' ZAMSID
293500210712     C                     MOVEL'Y2USRMSG'ZAMSGF
293600210712     C                     MOVELW0CLPG    ZAMSDA           Message data
293700210712     C                     EXSR ZASNMS
293800210712     C                     END
293900210712      *
294000210712      * Error detected?
294100210712     C           W0RTN     IFNE *BLANK
294200210712     C           W0RTN     ANDNE'Y2U0016'
294300210712     C                     SETON                     99    *
294400210712     C                     END
294500210712      * Defer confirm
294600210712     C                     MOVEL'Y'       W0DCF   1
294700210712      * No value selected, exit
294800210712     C           W0RTN     IFNE *BLANK
294900210712     C                     GOTO VGEXIT
295000210712     C                     END
295100210712     C                     END
295200210712      *................................................................
295300210712      * If all low order keys not entered, exit
295400210712     C           #1OPBR    IFEQ *BLANK                     Branch code
295500210712     C                     GOTO VGEXIT
295600210712     C                     END
295700210712      *
295800210712     C           KLVGA8    KLIST
295900210712     C                     KFLD           A8BRCD           Branch code
296000210712      * Setup key
296100210712     C                     MOVEL#1OPBR    A8BRCD           Branch code
296200210712     C           KLVGA8    CHAIN@A8REB0              9091  *
296300210712     C           *IN90     IFEQ '0'
296400210712      * Record found - move back any virtuals
296500210712     C                     GOTO VGEXIT
296600210712     C                     END
296700210712      * Send message 'Branch code            NF'
296800210712     C                     MOVEL'USR0075' ZAMSID
296900210712     C                     EXSR ZASNMS
297000210712     C                     MOVEL'USR0075' W0RTN
297100210712      *================================================================
297200210712     CSR         VGEXIT    ENDSR
297300210712      /EJECT
297400210712     CSR         VHCKRL    BEGSR
297500210712      *================================================================
297600210712      * Check reference to Currency Codes
297700210712      *================================================================
297800210712     C                     MOVEL*BLANK    W0RTN   7
297900210712      * Name search required?
298000210712     C                     MOVEL#1CYCD    WK1X01  1
298100210712     C           WK1X01    IFEQ '?'                        Currency Code
298200210712     C                     CALL 'SD0020S'              90  Select Currency
298300210712     C                     PARM *BLANK    W0RTN   7
298400210712     C           #1CYCD    PARM #1CYCD    WQ0010  3        Currency Code
298500210712      *
298600210712     C           *IN90     IFEQ '1'
298700210712      * Call to program ended in error
298800210712     C                     MOVEL'Y2U0032' W0RTN
298900210712     C                     MOVEL*BLANKS   W0CLPG 10
299000210712     C                     MOVEL'SD0020S' W0CLPG
299100210712      * Send message '*Error occured on CALL...'
299200210712     C                     MOVEL'Y2U0032' ZAMSID
299300210712     C                     MOVEL'Y2USRMSG'ZAMSGF
299400210712     C                     MOVELW0CLPG    ZAMSDA           Message data
299500210712     C                     EXSR ZASNMS
299600210712     C                     END
299700210712      *
299800210712      * Error detected?
299900210712     C           W0RTN     IFNE *BLANK
300000210712     C           W0RTN     ANDNE'Y2U0016'
300100210712     C                     SETON                     9931  *
300200210712     C                     END
300300210712      * Defer confirm
300400210712     C                     MOVEL'Y'       W0DCF   1
300500210712      * No value selected, exit
300600210712     C           W0RTN     IFNE *BLANK
300700210712     C                     GOTO VHEXIT
300800210712     C                     END
300900210712     C                     END
301000210712      *................................................................
301100210712      * If all low order keys not entered, exit
301200210712     C           #1CYCD    IFEQ *BLANK                     Currency Code
301300210712     C                     GOTO VHEXIT
301400210712     C                     END
301500210712      *
301600210712     C           KLVHA6    KLIST
301700210712     C                     KFLD           A6CYCD           Currency Code
301800210712      * Setup key
301900210712     C                     MOVEL#1CYCD    A6CYCD           Currency Code
302000210712     C           KLVHA6    CHAIN@A6REA3              9091  *
302100210712     C           *IN90     IFEQ '0'
302200210712      * Record found - move back any virtuals
302300210712     C                     GOTO VHEXIT
302400210712     C                     END
302500210712      * Send message 'Currency Codes         NF'
302600210712     C                     MOVEL'USR0071' ZAMSID
302700210712     C                     EXSR ZASNMS
302800210712     C                     MOVEL'USR0071' W0RTN
302900210712      *================================================================
303000210712     CSR         VHEXIT    ENDSR
303100210712      /EJECT
303200210712     CSR         VICKRL    BEGSR
303300210712      *================================================================
303400210712      * Check reference to Client Details
303500210712      *================================================================
303600210712     C                     MOVEL*BLANK    W0RTN   7
303700210712      * Name search required?
303800210712     C                     MOVEL#1CUST    WK1X01  1
303900210712     C           WK1X01    IFEQ '?'                        Customer Number
304000210712     C                     CALL 'SD0010S'              90  Select Client D
304100210712     C                     PARM *BLANK    W0RTN   7
304200210712     C           #1CUST    PARM #1CUST    WQ0011  6        Customer Number
304300210712      *
304400210712     C           *IN90     IFEQ '1'
304500210712      * Call to program ended in error
304600210712     C                     MOVEL'Y2U0032' W0RTN
304700210712     C                     MOVEL*BLANKS   W0CLPG 10
304800210712     C                     MOVEL'SD0010S' W0CLPG
304900210712      * Send message '*Error occured on CALL...'
305000210712     C                     MOVEL'Y2U0032' ZAMSID
305100210712     C                     MOVEL'Y2USRMSG'ZAMSGF
305200210712     C                     MOVELW0CLPG    ZAMSDA           Message data
305300210712     C                     EXSR ZASNMS
305400210712     C                     END
305500210712      *
305600210712      * Error detected?
305700210712     C           W0RTN     IFNE *BLANK
305800210712     C           W0RTN     ANDNE'Y2U0016'
305900210712     C                     SETON                     9932  *
306000210712     C                     END
306100210712      * Defer confirm
306200210712     C                     MOVEL'Y'       W0DCF   1
306300210712      * No value selected, exit
306400210712     C           W0RTN     IFNE *BLANK
306500210712     C                     GOTO VIEXIT
306600210712     C                     END
306700210712     C                     END
306800210712      *................................................................
306900210712      * If all low order keys not entered, exit
307000210712     C           #1CUST    IFEQ *BLANK                     Customer Number
307100210712     C                     GOTO VIEXIT
307200210712     C                     END
307300210712      *
307400210712     C           KLVIBB    KLIST
307500210712     C                     KFLD           BBCUST           Customer Number
307600210712      * Setup key
307700210712     C                     MOVEL#1CUST    BBCUST           Customer Number
307800210712     C           KLVIBB    CHAIN@BBREBF              9091  *
307900210712     C           *IN90     IFEQ '0'
308000210712      * Record found - move back any virtuals
308100210712     C                     MOVELBBCSSN    #1CSSN           Customer Shortn
308200210712     C                     MOVELBBCRTN    #1CRTN           Customer Report
308300210712     C                     MOVELBBCRNM    #1CRNM           Customer Report
308400210712     C                     GOTO VIEXIT
308500210712     C                     END
308600210712      * Send message 'Client Details         NF'
308700210712     C                     MOVEL'USR0081' ZAMSID
308800210712     C                     EXSR ZASNMS
308900210712     C                     MOVEL'USR0081' W0RTN
309000210712      *================================================================
309100210712     CSR         VIEXIT    ENDSR
309200210712      /EJECT
309300210712     CSR         Y0SET     BEGSR
309400210712      *================================================================
309500210712      * Set cursor by *SET CURSOR data
309600210712      *================================================================
309700210712      *================================================================
309800210712     CSR         Y0EXIT    ENDSR
309900210712      /EJECT
310000210712     CSR         Y1SET     BEGSR
310100210712      *================================================================
310200210712      * Set cursor by *SET CURSOR data
310300210712      *================================================================
310400210712      *================================================================
310500210712     CSR         Y1EXIT    ENDSR
310600210712      /EJECT
310700210712     CSR         Y8TST     BEGSR
310800210712      *================================================================
310900210712      * Test cursor
311000210712      *================================================================
311100210712     C           @#DFMT    IFEQ '#RCDKEY'
311200210712      * KEY Screen
311300210712     C                     Z-ADD@#RWCL    ZINPOS  50
311400210712     C           ZINPOS    DIV  256       W0CRW
311500210712     C                     MVR            W0CCL
311600210712     C                     END
311700210712     C           @#DFMT    IFEQ '#RCDDTL1'
311800210712      * DETAIL Screen
311900210712     C                     Z-ADD@#RWCL    ZINPOS  50
312000210712     C           ZINPOS    DIV  256       W0CRW
312100210712     C                     MVR            W0CCL
312200210712     C                     END
312300210712      *================================================================
312400210712     CSR         Y8EXIT    ENDSR
312500210712      /EJECT
312600210712     CSR         Y9CLR     BEGSR
312700210712      *================================================================
312800210712      * Clear *SET CURSOR data
312900210712      *================================================================
313000210712      *================================================================
313100210712     CSR         Y9EXIT    ENDSR
313200210712      /EJECT
313300210712     CSR         ZASNMS    BEGSR
313400210712      *================================================================
313500210712      * Send message to program's message queue
313600210712      *================================================================
313700210712     C           ZAPGMQ    IFEQ *BLANK
313800210712     C                     MOVEL##PGM     ZAPGMQ
313900210712     C                     END
314000210712      * If no message file specified, use default
314100210712     C           ZAMSGF    IFEQ *BLANK
314200210712     C                     MOVELZADFMF    ZAMSGF
314300210712     C                     END
314400210712     C                     CALL 'Y2SNMGC'
314500210712     C                     PARM           ZAPGMQ 10        Program queue
314600210712     C                     PARM           ZAPGRL  5        Rel queue
314700210712     C                     PARM           ZAMSID  7        Message ID
314800210712     C                     PARM           ZAMSGF 10        Message file
314900210712     C                     PARM           ZAMSDA132        Message data
315000210712     C                     PARM           ZAMSTP  7        Message type
315100210712      * Clear all fields for default mechanism next time
315200210712     C                     MOVEL*BLANK    ZAPGMQ
315300210712     C                     MOVEL*BLANK    ZAPGRL
315400210712     C                     MOVEL*BLANK    ZAMSID
315500210712     C                     MOVEL*BLANK    ZAMSGF
315600210712     C                     MOVEL*BLANK    ZAMSDA
315700210712     C                     MOVEL*BLANK    ZAMSTP
315800210712      *================================================================
315900210712     CSR         ZAEXIT    ENDSR
316000210712      /EJECT
316100210712     CSR         ZHHPKY    BEGSR
316200210712      *================================================================
316300210712      * Display HELP text
316400210712      *================================================================
316500210712      * Signal help request
316600210712     C                     MOVEL'Y'       W0HLP   1
316700210712      *
316800210712      * Extract cursor row and column
316900210712     C           @#RWCL    DIV  256       ZHCSRW  50       Row
317000210712     C                     MVR            ZHCSCL  50       Column
317100210712      *
317200210712      * Save cursor position for redisplay
317300210712     C                     Z-ADDZHCSRW    ZZCSRW  30       Row
317400210712     C                     Z-ADDZHCSCL    ZZCSCL  30       Column
317500210712      *
317600210712      *
317700210712     C                     CALL 'YDDSHPR'
317800210712     C                     PARM 'SDBQE1R' W0HPMB 10        Help text sourc
317900210712     C                     PARM *BLANK    YYHPFL 10        Help text file
318000210712     C                     PARM *BLANK    YYHPLB 10        Help text libra
318100210712     C                     PARM           W0RTN   7
318200210712     C                     PARM '*START'  YYHLVN 10        Help label
318300210712     C                     PARM '*NORMAL' YYUSOP 10        Options
318400210712     C                     PARM ZHCSRW    YYRW    50       Row
318500210712     C                     PARM ZHCSCL    YYCL    50       Column
318600210712     C                     PARM 1         YYLGCT  50       # of grps
318700210712     C                     PARM W0GRP     YYLGVN 10        Label grps
318800210712      *
318900210712      * Clear set cursor DDS indicator
319000210712     C  N94                MOVEL'OFF'     WCSRLC
319100210712     C  N94                SETON                     94    *
319200210712      *================================================================
319300210712     CSR         ZHEXIT    ENDSR
319400210712      /EJECT
319500210712     CSR         ZXEXPG    BEGSR
319600210712      *================================================================
319700210712      * Cancel and exit from key screen
319800210712      *================================================================
319900210712      * USER: Exit program processing
320000210712      * 00/Copy Member SD0402REPP - Extended Settlements  *
320100210712     C*Ext Stlmnts Mnt(FRA/IRS) Exit Program Processing
320200210712     C/COPY WNCPYSRC,SD0402REPP
320300210712      * CASE: KEY.*CMD key is *Exit
320400210712     C           *IN03     IFEQ '1'                        *IF
320500210712     C                     MOVEL'Y2U9999' P3DRTC           Duplicate Retur
320600210712     C                     MOVEL*BLANK    P0RTN            *Return code
320700210712     C                     EXSR ZYEXPG
320800210712     C                     END                             *FI
320900210712     C                     MOVEL*BLANK    P0RTN
321000210712     C                     EXSR ZYEXPG
321100210712      *================================================================
321200210712     CSR         ZXEXIT    ENDSR
321300210712      /EJECT
321400210712     CSR         ZYEXPG    BEGSR
321500210712      *================================================================
321600210712      * Exit program: Direct
321700210712      *================================================================
321800210712      * ROLLBACK any uncommitted DBF changes
321900210712     C                     ROLBK                       90
322000210712      *
322100210712      * Terminate program
322200210712     C                     SETON                     LR
322300210712      *
322400210712      * Exit program
322500210712     C                     RETRN
322600210712      *
322700210712      *================================================================
322800210712     CSR         ZYEXIT    ENDSR
322900210712      /EJECT
323000210712     CSR         ZZINIT    BEGSR
323100210712      *================================================================
323200210712      * Initialisation
323300210712      *================================================================
323400210712     C           *NAMVAR   DEFN           LDA                                                 CSD012
323500210712     C           W0ICL     IFEQ *BLANK
323600210712     C                     MOVEL'Y'       W0ICL   1        *Initial call
323700210712     C                     ELSE
323800210712     C                     MOVEL'N'       W0ICL
323900210712     C                     END
324000210712     C                     MOVE *BLANK    P0RTN
324100210712     C                     MOVE *BLANK    W0RTN   7
324200210712     C                     MOVEL*BLANK    W0RSL   1
324300210712     C                     MOVEL*BLANK    W0RSF   1
324400210712     C                     MOVEL*ZEROS    W0RTW   90
324500210712     C                     MOVEL'400'     W0ENV   3
324600210712      * Setup job date/time
324700210712      *
324800210712     C                     Z-ADDUDATE     ##JDT
324900210712      * Set century digit (If YY prior to 1940 treat as 20YY)
325000210712     C           ##JYY     IFLT 40
325100210712     C                     Z-ADD1         ##JCC
325200210712     C                     ELSE
325300210712     C                     Z-ADD0         ##JCC
325400210712     C                     END
325500210712     C                     TIME           ##JTM
325600210712      * Update screen time
325700210712     C                     TIME           ##TME   60
325800210712      * Obtain default message file
325900210712     C           *NAMVAR   DEFN Y2MGFLA   ZADFMF 10
326000210712     C                     IN   ZADFMF
326100210712      * Define work field STD FTR 1
326200210712     C                     MOVEL*BLANK    WUSFT1 78
326300210712      * Define work field Calling Program Code
326400210712     C                     MOVEL*BLANK    WUCPGC  4
326500210712      * Define work field Settlement Details Valid
326600210712     C                     MOVEL*BLANK    WUSDV   1
326700210712      * Define work field Action Code
326800210712     C                     MOVEL*BLANK    WUANCD  1
326900210712      * Define work field customer number/sname
327000210712     C                     MOVEL*BLANK    WUCUNS 10
327100210712      * Define work field Run day number
327200210712     C                     Z-ADD*ZERO     WURDNB  50
327300210712      * Define work field Receive Currency Code
327400210712     C                     MOVEL*BLANK    WURCCD  3
327500210712      * Define work field Currency Code
327600210712     C                     MOVEL*BLANK    WUCYCD  3
327700210712      * Define work field Federal Funds Indicator
327800210712     C                     MOVEL*BLANK    WUFFIN  1
327900210712      * Define work field Branch code
328000210712     C                     MOVEL*BLANK    WUBRCD  3
328100210712      * Define work field Protect Receipt Instructs
328200210712     C                     MOVEL*BLANK    WUPRI   1
328300210712      * Define work field Protect Payment Instructs
328400210712     C                     MOVEL*BLANK    WUPPI   1
328500210712      * Define work field Command Key Entered
328600210712     C                     MOVEL*BLANK    WUCKYE  2
328700210712      * Define work field Validation Only
328800210712     C                     MOVEL*BLANK    WUVLON  1
328900210712      * Define work field Termination Parameter
329000210712     C                     MOVEL*BLANK    WUTRPA  1
329100210712      * Define work field first call for insert
329200210712     C                     MOVEL*BLANK    WUFCFI  1
329300210712      * Define work field Recpt - intermed bank no.
329400210712     C                     MOVEL*BLANK    WUIBNR 10
329500210712      * Define work field Rcpt - Ordering bank num
329600210712     C                     MOVEL*BLANK    WUOBNR 10
329700210712      * Define work field Rcpt - Ordering cust no.
329800210712     C                     MOVEL*BLANK    WUOCSR 10
329900210712      * Define work field Pay - Intermed Bank num
330000210712     C                     MOVEL*BLANK    WUIBNP 10
330100210712      * Define work field Pay - Ordering Bank No.
330200210712     C                     MOVEL*BLANK    WUOBNP 10
330300210712      * Define work field Pay - Ordering Cust No.
330400210712     C                     MOVEL*BLANK    WUOCSP 10
330500210712      * Define work field Receiver Corr. No.
330600210712     C                     MOVEL*BLANK    WUCNOR 10
330700210712      * Define work field Recipient of MT100
330800210712     C                     MOVEL*BLANK    WURMT1 10
330900210712      * Define work field A/C with bank number
331000210712     C                     MOVEL*BLANK    WUACWB 10
331100210712      * Define work field Beneficiary No.
331200210712     C                     MOVEL*BLANK    WUBYNO 10
331300210712      * Define work field Retail Present
331400210712     C                     MOVEL*BLANK    WUREPR  1
331500210712      * Define work field Retail A/C Nos. Supported
331600210712     C                     MOVEL*BLANK    WURANS  1
331700210712      * Define work field Account Code
331800210712     C**********           MOVEL*BLANK    WUACCD  4                                           CGL029
331900210712     C                     MOVEL*BLANK    WUACCD 10                                           CGL029
332000210712      * Define work field Chips Module
332100210712     C                     MOVEL*BLANK    WUCHMD  1
332200210712      * Define work field Back value period parm
332300210712     C                     Z-ADD*ZERO     WUBVPP  30
332400210712      * Define work field Database error file
332500210712     C                     MOVEL*BLANK    WUDBEF  5
332600210712      * Define work field Database error key
332700210712     C                     MOVEL*BLANK    WUDBEK 29
332800210712      * Define work field program name
332900210712     C                     MOVEL*BLANK    WUPGNM  8
333000210712      * Define work field Database error number
333100210712     C                     MOVEL*BLANK    WUDBEN  2
333200210712      * Define work field error codes
333300210712     C                     MOVEL*BLANK    WUERCS150
333400210712      * Define work field Default Fields
333500210712     C                     MOVEL*BLANK    WUDFLD  1
333600210712      * Define work field Default Receipt Side
333700210712     C                     MOVEL*BLANK    WUDFRS  1
333800210712      * Define work field Defaulting Occurred
333900210712     C                     MOVEL*BLANK    WUDOCC  1
334000210712      * Define work field error number
334100210712     C                     Z-ADD*ZERO     WUERNB  30
334200210712      * Define work field Terminate Loop
334300210712     C                     MOVEL*BLANK    WUTMLP  1
334400210712      * Define work field error code
334500210712     C                     MOVEL*BLANK    WUERRC  3
334600210712      * Define work field Midas Run Date
334700210712     C                     MOVEL*BLANK    WUMRDT  7
334800210712      * Define work field Set Up Complete
334900210712     C                     MOVEL*BLANK    WUSUC   1
335000210712      * Define work field Date format flag
335100210712     C                     MOVEL*BLANK    WUDFF   1
335200210712      * Define work field Multi-branching Indicator
335300210712     C                     MOVEL*BLANK    WUMBIN  1
335400210712      * Define work field Window processing requir.
335500210712     C                     MOVEL*BLANK    WUWDPR  1
335600210712      * Define work field Calling Transaction Type
335700210712     C                     MOVEL*BLANK    WUCTTY  2
335800210712      * Define work field Date Of Receipt, Our Nost
335900210712     C                     Z-ADD*ZERO     WUDRON  50
336000210712      * Define work field Date Of Payment, Our Nost
336100210712     C                     Z-ADD*ZERO     WUDPON  50
336200210712      * Flag no *SET CURSOR in the program
336300210712     C                     MOVE 'N'       YSETCS  1
336400210712     C                     MOVE *BLANK    WCSRLC  3
336500210712      * Define work Warning Msg Sent ?                                                        CSW214
336600210712     C                     MOVEL*BLANK    WUIMSG  1                                           CSW214
336700210712     C                     MOVEL'N'       WSENT   1                                           CSW214
336800210712      * Open files
336900210712      * Begin commit control
337000210712     C                     CALL 'Y2BGCMC'
337100210712     C                     PARM           W0RTN   7
337200210712     C           W0RTN     IFNE *BLANK
337300210712     C           W0RTN     ANDNE'CPF8351'
337400210712     C                     EXSR ZYEXPG
337500210712     C                     END
337600210712      * Define *Synon program work fields
337700210712     C                     MOVEL*BLANKS   W0CFL  10        *Cursor field
337800210712     C                     Z-ADD*ZEROS    W0CRW   50       *Cursor row
337900210712     C                     Z-ADD*ZEROS    W0CCL   50       *Cursor column
338000210712      * Move main file information to JOB context
338100210712     C                     MOVE @1FFL     ZZFFL  10        Main file name
338200210712     C                     MOVE @1FLB     ZZFLB  10        Main file lib
338300210712     C                     MOVE @1FMB     ZZFMB  10        Main file mbr
338400210712     C                     MOVE ZZFFL     @1FFL  10
338500210712     C                     MOVE ZZFLB     @1FLB  10
338600210712     C                     MOVE ZZFMB     @1FMB  10
338700210712     C                     CALL 'Y2QLVNR'
338800210712     C                     PARM           ZZFFL  10
338900210712     C                     PARM           ZZFLB  10
339000210712     C                     PARM           ZZFQL  21        LIBRARY/FILE
339100210712     C                     OPEN SD0402R#
339200210712     C/COPY WNCPYSRC,SDH00332
339300210712     C                     OPEN SDEXSTL1
339400210712     C/COPY WNCPYSRC,SDH00333
339500210712     C                     OPEN SDCUSTL1
339600210712     C                     OPEN SDBRCHL1
339700210712     C                     OPEN SDCURRL1
339800210712     C                     OPEN SDMMODL1
339900210712     C                     OPEN SDEXSTL0
340000210712     C                     MOVEL'N'       W0PMT   1
340100210712     C                     MOVEL'CHG'     W0PMD   3
340200210712     C                     MOVEL*BLANK    W0GRP   1
340300210712      * USER: Initialize program
340400210712      * SD0402R Precompiler - Extended Settlements  *
340500210712      * Copyright Statement 1996 - Standard Functions  *
340600210712      * Get Rundate - Rundate  *
340700210712     C           *NAMVAR   DEFN           RUNDAT
340800210712     C                     IN   RUNDAT
340900210712     C                     MOVE MRDT      ##MRDT  7        RUN DATE
341000210712     C                     MOVE MRDT      WUMRDT
341100210712     C                     MOVE RDNB      WURDNB           RUNDAY NO.
341200210712     C                     MOVE SUC       WUSUC            SET UP COMPLT
341300210712     C                     MOVE DFF       WUDFF            DTE FMT FLAG
341400210712     C                     MOVE MBIN      WUMBIN           MULTI BR. IND
341500210712      * Get 'Window required' ind - MIDAS Modules  *
341600210712     C                     EXSR SCRVGN
341700210712      * Data Struct. for Ext Sett - Extended Settlements  *
341800210712      * Program mode.
341900210712      * CASE: PAR.Action Code is Insert
342000210712     C           P2ANCD    IFEQ 'I'                        *IF
342100210712     C                     MOVEL'ADD'     W0PMD            *Program mode
342200210712     C                     ELSE
342300210712     C/COPY WNCPYSRC,SDH00428
342400210712      * CASE: *OTHERWISE
342500210712     C/COPY WNCPYSRC,SDH00429
342600210712     C                     MOVEL'CHG'     W0PMD            *Program mode
342700210712     C                     END                             *FI
342800210712      * Move Validation fields from parameter to work fields.
342900210712      * CASE: PAR.Action Code is Insert or Amend
343000210712     C           P2ANCD    IFEQ 'A'                        *IF
343100210712     C           P2ANCD    OREQ 'I'
343200210712     C                     MOVELP2ANCD    WUANCD           Action Code
343300210712     C                     MOVELP1CYCD    WUCYCD           Currency Code
343400210712     C                     MOVELP4CPGC    WUCPGC           Calling Program
343500210712     C                     MOVELP4CTTY    WUCTTY           Calling Transac
343600210712     C                     MOVELP4CUNS    WUCUNS           customer number
343700210712     C                     Z-ADDP4DRON    WUDRON           Date Of Receipt
343800210712     C                     Z-ADDP4DPON    WUDPON           Date Of Payment
343900210712     C                     MOVELP4RCCD    WURCCD           Receive Currenc
344000210712     C                     MOVELP4FFIN    WUFFIN           Federal Funds I
344100210712     C                     MOVELP4BRCD    WUBRCD           Branch code
344200210712     C                     MOVELP4PRI     WUPRI            Protect Receipt
344300210712     C                     MOVELP4PPI     WUPPI            Protect Payment
344400210712     C                     MOVELP4CKYE    WUCKYE           Command Key Ent
344500210712     C                     MOVELP4VLON    WUVLON           Validation Only
344600210712     C                     MOVELP4SDV     WUSDV            Settlement Deta
344700210712     C                     MOVELP4TRPA    WUTRPA           Termination Par
344800210712     C                     MOVELP4FCFI    WUFCFI           first call for
344900210712     C                     MOVELP4IBNR    WUIBNR           Recpt - interme
345000210712     C                     MOVELP4OBNR    WUOBNR           Rcpt - Ordering
345100210712     C                     MOVELP4OCSR    WUOCSR           Rcpt - Ordering
345200210712     C                     MOVELP4IBNP    WUIBNP           Pay - Intermed
345300210712     C                     MOVELP4OBNP    WUOBNP           Pay - Ordering
345400210712     C                     MOVELP4OCSP    WUOCSP           Pay - Ordering
345500210712     C                     MOVELP4CNOR    WUCNOR           Receiver Corr.
345600210712     C                     MOVELP4RMT1    WURMT1           Recipient of MT
345700210712     C                     MOVELP4ACWB    WUACWB           A/C with bank n
345800210712     C                     MOVELP4BYNO    WUBYNO           Beneficiary No.
345900210712     C                     MOVELP4REPR    WUREPR           Retail Present
346000210712     C                     MOVELP4RANS    WURANS           Retail A/C Nos.
346100210712     C                     MOVELP4ACCD    WUACCD           Account Code
346200210712     C                     MOVELP4CHMD    WUCHMD           Chips Module
346300210712     C                     Z-ADDP4BVPP    WUBVPP           Back value peri
346400210712     C                     Z-ADDP4RDNB    WURDNB           Run day number
346500210712     C                     MOVELP4DBEF    WUDBEF           Database error
346600210712     C                     MOVELP4PGNM    WUPGNM           program name
346700210712     C                     MOVELP4DBEN    WUDBEN           Database error
346800210712     C                     MOVELP4ERCS    WUERCS           error codes
346900210712     C                     MOVELP4DFLD    WUDFLD           Default Fields
347000210712     C                     MOVELP4DFRS    WUDFRS           Default Receipt
347100210712     C                     MOVELP4DOCC    WUDOCC           Defaulting Occu
347200210712     C                     END                             *FI
347300210712     C*                                                                   173052
347400210712     C                     MOVEL*BLANKS   CSW005  1                       173052
347500210712     C*                                                                   173052
347600210712     C** Check if switchable feature CSW005 is switched on.               173052
347700210712     C*                                                                   173052
347800210712     C                     CALL 'AOSARDR0'                                173052
347900210712     C                     PARM *BLANKS   P@RTCD  7                       173052
348000210712     C                     PARM '*VERIFY' P@OPTN  7                       173052
348100210712     C                     PARM 'CSW005'  P@SARD  6                       173052
348200210712     C           P@RTCD    IFEQ *BLANKS                                   173052
348300210712     C                     MOVEL'Y'       CSW005                          173052
348400210712     C                     ENDIF                                          173052
348500210712     C*                                                                   173052
348600210712     C** Check if SWIFT 2000 Changes is on.                               CSW200
348700210712      *                                                                   CSW200
348800210712     C                     CALL 'SWIF2000'                                CSW200
348900210712     C                     PARM *BLANKS   P@RTCD                          CSW200
349000210712      *                                                                   CSW200
349100210712     C           P@RTCD    IFEQ 'CSW200'                                  CSW200
349200210712     C                     MOVEL'Y'       CSW200  1                       CSW200
349300210712     C                     ENDIF                                          CSW200
349400210712      *                                                                   CSW200
349500210712      ** Check if switchable feature CSW011 is switched on.               CSW200
349600210712      *                                                                   CSW200
349700210712     C                     CALL 'AOSARDR0'                                CSW200
349800210712     C                     PARM *BLANKS   P@RTCD                          CSW200
349900210712     C                     PARM '*VERIFY' P@OPTN                          CSW200
350000210712     C                     PARM 'CSW011'  P@SARD                          CSW200
350100210712     C           P@RTCD    IFEQ *BLANKS                                   CSW200
350200210712     C                     MOVEL'Y'       CSW011  1                       CSW200
350300210712     C                     ENDIF                                          CSW200
350400210712      *                                                                   CSW200
350500210712      ** Check if switchable feature CDL031 is switched on.                                  BUG6329
350600210712      *                                                                                      BUG6329
350700210712     C                     CALL 'AOSARDR0'                                                   BUG6329
350800210712     C                     PARM *BLANKS   P@RTCD                                             BUG6329
350900210712     C                     PARM '*VERIFY' P@OPTN                                             BUG6329
351000210712     C                     PARM 'CDL031'  P@SARD                                             BUG6329
351100210712     C           P@RTCD    IFEQ *BLANKS                                                      BUG6329
351200210712     C                     MOVEL'Y'       CDL031  1                                          BUG6329
351300210712     C                     ENDIF                                                             BUG6329
351400210712      *                                                                                      BUG6329
351500210712      * Fetch program name for later use as validation parameter
351600210712      * CASE: PAR.Action Code is Insert or Amend
351700210712     C           P2ANCD    IFEQ 'A'                        *IF
351800210712     C           P2ANCD    OREQ 'I'
351900210712     C                     MOVEL##PGM     WUPGNM           program name
352000210712     C                     END                             *FI
352100210712      *                                                                                       CSD012
352200210712      * Check if CSD012 is switched on                                                        CSD012
352300210712     C                     CALL 'AOSARDR0'                                                    CSD012
352400210712     C                     PARM           PRTCD   7                                           CSD012
352500210712     C                     PARM '*VERIFY' POPTN   7                                           CSD012
352600210712     C                     PARM 'CSD012'  PSARD   6                                           CSD012
352700210712      *                                                                                       CSD012
352800210712     C           PRTCD     IFEQ *BLANKS                                                       CSD012
352900210712     C                     MOVE 'Y'       CSD012  1                                           CSD012
353000210712     C                     ELSE                                                               CSD012
353100210712     C                     MOVE 'N'       CSD012                                              CSD012
353200210712     C                     ENDIF                                                              CSD012
353300210712      *                                                                                       CSD012
353400210712      * Check if Extended Settlement Authorisation is on                                      CSD012
353500210712     C           CSD012    IFEQ 'Y'                                                           CSD012
353600210712      *                                                                                       CSD012
353700210712     C                     CALL 'AOSVALR0'                                                    CSD012
353800210712     C                     PARM *BLANKS   RTNCDE  7                                           CSD012
353900210712     C                     PARM           SVALK1 20                                           CSD012
354000210712     C                     PARM           SVAL1 200                                           CSD012
354100210712     C                     PARM           SVALK2 20                                           CSD012
354200210712     C                     PARM           SVAL2 200                                           CSD012
354300210712     C                     PARM           SVALK3 20                                           CSD012
354400210712     C                     PARM           SVAL3 200                                           CSD012
354500210712     C                     PARM           SVALK4 20                                           CSD012
354600210712     C                     PARM           SVAL4 200                                           CSD012
354700210712     C                     PARM           SVALK5 20                                           CSD012
354800210712     C                     PARM           SVAL5 200                                           CSD012
354900210712     C                     PARM           SVALK6 20                                           CSD012
355000210712     C                     PARM           SVAL6 200                                           CSD012
355100210712     C                     PARM           SVALK7 20                                           CSD012
355200210712     C                     PARM           SVAL7 200                                           CSD012
355300210712     C                     PARM           SVALK8 20                                           CSD012
355400210712     C                     PARM           SVAL8 200                                           CSD012
355500210712     C                     PARM           SVALK9 20                                           CSD012
355600210712     C                     PARM           SVAL9 200                                           CSD012
355700210712     C                     PARM           SVALK0 20                                           CSD012
355800210712     C                     PARM           SVAL10200                                           CSD012
355900210712      *                                                                                       CSD012
356000210712     C           RTNCDE    IFNE *BLANKS                                                       CSD012
356100210712     C           SVAL10    IFEQ '*NRF'                                                        CSD012
356200210712     C                     MOVE SVALK0    DBKEY                                               CSD012
356300210712     C                     ENDIF                                                              CSD012
356400210712     C           SVAL9     IFEQ '*NRF'                                                        CSD012
356500210712     C                     MOVE SVALK9    DBKEY                                               CSD012
356600210712     C                     ENDIF                                                              CSD012
356700210712     C           SVAL8     IFEQ '*NRF'                                                        CSD012
356800210712     C                     MOVE SVALK8    DBKEY                                               CSD012
356900210712     C                     ENDIF                                                              CSD012
357000210712     C           SVAL7     IFEQ '*NRF'                                                        CSD012
357100210712     C                     MOVE SVALK7    DBKEY                                               CSD012
357200210712     C                     ENDIF                                                              CSD012
357300210712     C           SVAL6     IFEQ '*NRF'                                                        CSD012
357400210712     C                     MOVE SVALK6    DBKEY                                               CSD012
357500210712     C                     ENDIF                                                              CSD012
357600210712     C           SVAL5     IFEQ '*NRF'                                                        CSD012
357700210712     C                     MOVE SVALK5    DBKEY                                               CSD012
357800210712     C                     ENDIF                                                              CSD012
357900210712     C           SVAL4     IFEQ '*NRF'                                                        CSD012
358000210712     C                     MOVE SVALK4    DBKEY                                               CSD012
358100210712     C                     ENDIF                                                              CSD012
358200210712     C           SVAL3     IFEQ '*NRF'                                                        CSD012
358300210712     C                     MOVE SVALK3    DBKEY                                               CSD012
358400210712     C                     ENDIF                                                              CSD012
358500210712     C           SVAL2     IFEQ '*NRF'                                                        CSD012
358600210712     C                     MOVE SVALK2    DBKEY                                               CSD012
358700210712     C                     ENDIF                                                              CSD012
358800210712     C           SVAL1     IFEQ '*NRF'                                                        CSD012
358900210712     C                     MOVE SVALK1    DBKEY                                               CSD012
359000210712     C                     ENDIF                                                              CSD012
359100210712     C           *LOCK     IN   LDA                                                           CSD012
359200210712     C                     Z-ADD1         DBASE                                               CSD012
359300210712     C                     MOVE 'SDSVALPD'DBFILE                                              CSD012
359400210712     C                     MOVE 'SD0402R' DBPGM                                               CSD012
359500210712     C                     OUT  LDA                                                           CSD012
359600210712     C                     EXSR *PSSR                                                         CSD012
359700210712     C                     ENDIF                                                              CSD012
359800210712      *                                                                                       CSD012
359900210712     C                     ENDIF                                                              CSD012
360000210712      *                                                                                       CSD012
360100210712      *                                                                                       CSW212
360200210712      ** Check if SWIFT Changes 2012 (CSW212) is installed                                    CSW212
360300210712      *                                                                                       CSW212
360400210712     C                     CALL 'SWIF2012'                                                    CSW212
360500210712     C                     PARM *BLANKS   P@RTCD                                              CSW212
360600210712      *                                                                                       CSW212
360700210712     C           P@RTCD    IFEQ 'CSW2012'                                                     CSW212
360800210712     C                     MOVE 'Y'       CSW212  1                                           CSW212
360900210712     C                     ELSE                                                               CSW212
361000210712     C                     MOVE 'N'       CSW212                                              CSW212
361100210712     C                     ENDIF                                                              CSW212
361200210712      *                                                                                       CSW212
361300210712      ** Check if switchable feature CDL008 is switched on.                                   CSW212
361400210712      *                                                                                       CSW212
361500210712     C                     CALL 'AOSARDR0'                                                    CSW212
361600210712     C                     PARM *BLANKS   P@RTCD                                              CSW212
361700210712     C                     PARM '*VERIFY' P@OPTN                                              CSW212
361800210712     C                     PARM 'CDL008'  P@SARD                                              CSW212
361900210712     C           P@RTCD    IFEQ *BLANKS                                                       CSW212
362000210712     C                     MOVEL'Y'       CDL008  1                                           CSW212
362100210712     C                     ELSE                                                               CSW212
362200210712     C                     MOVEL'N'       CDL008                                              CSW212
362300210712     C                     ENDIF                                                              CSW212
362400210712      *                                                                                       CSW212
362500210712     C                     CALL 'SWIF2014'                                                    CSW214
362600210712     C                     PARM *BLANKS   PRTCD                                               CSW214
362700210712      *                                                                                       CSW214
362800210712     C           PRTCD     IFEQ 'CSW2014'                                                     CSW214
362900210712     C                     MOVE 'Y'       CSW214  1                                           CSW214
363000210712     C                     ELSE                                                               CSW214
363100210712     C                     MOVE 'N'       CSW214                                              CSW214
363200210712     C                     ENDIF                                                              CSW214
363300210712      *                                                                                       CSW214
363400210712      ** Check if SWIFT Changes 2021 (CSW221) is installed                                    CSW221
363500210712      *                                                                                       CSW221
363600210712     C                     CALL SWIFT                                                         CSW221
363700210712     C                     PARM 'CSW221'  PSWIFT  6                                           CSW221
363800210712     C                     PARM *BLANKS   PRTCD   7                                           CSW221
363900210712      *                                                                                       CSW221
364000210712     C           PRTCD     IFEQ 'CSWACTV'                                                     CSW221
364100210712     C                     MOVE 'Y'       CSW221  1                                           CSW221
364200210712     C                     ELSE                                                               CSW221
364300210712     C                     MOVE 'N'       CSW221                                              CSW221
364400210712     C                     ENDIF                                                              CSW221
364500210712      *                                                                                       CSW221
364600210712      * 00/Copy Member SD0402RFPG - Extended Settlements  *
364700210712      * 00/Copy Member SD0402REPG - Extended Settlements  *
364800210712      * 00/Copy Member SD0402RIPG - Extended Settlements  *
364900210712      * 00/Copy Member SD0402RCPG - Extended Settlements  *
365000210712     C*Ext Stlmnts Mnt(FRA/IRS) Initialise Program C-spec
365100210712     C/COPY WNCPYSRC,SD0402RCPG
365200210712      * 00/Copy Member SD0402ROPG - Extended Settlements  *
365300210712      *================================================================
365400210712     CSR         ZZEXIT    ENDSR
365500210712      /EJECT
365600210712     CSR         *PSSR     BEGSR
365700210712      *****************************************************************
365800210712      *                                                               *
365900210712      * *PSSR  - Program exception error routine                      *
366000210712      *          Called automatically if a program error occurs,      *
366100210712      *          or directly by the program code using EXSR.          *
366200210712      *          This subroutine DUMPs the program just once.         *
366300210712      *                                                               *
366400210712      *****************************************************************
366500210712      *
366600210712      * Core function specific processing.
366700210712      *
366800210712     C/COPY WNCPYSRC,SD0402RPSC
366900210712      *
367000210712      * Start of PSSR user point.
367100210712      *
367200210712     C/COPY WNCPYSRC,SD0402RPS1
367300210712      *
367400210712      * Standard Midas PSSR processing.
367500210712      *
367600210712     C/COPY SDCPYSRC,SDPSSRINT
367700210712      *
367800210712      * End of PSSR user point.
367900210712      *
368000210712     C/COPY WNCPYSRC,SD0402RPS2
368100210712      *
368200210712      *================================================================
368300210712     CSR                   ENDSR
368400210712      *================================================================
368500210712     O*Ext Stlmnts Mnt(FRA/IRS) Initialise Program O-spec
368600210712     O/COPY WNCPYSRC,SD0402ROPG
368700210712      *                                                                                     AR992080
368800210712      ** Remove 'FX' in CONF and SETN elements 2-3                                          AR992080
368900210712      *                                                                                     AR992080
369000210712** CPY@     : Copyright notice for inclusion in all programs
369100210712(c) Finastra International Limited 2001
369200210712** HDTG                                                                                       CSW212
369300210712FRA/IRS                                                                                       CSW212
369400210712FRAIRS/FX                                                                                     CSW212
369500210712FX                                                                                            CSW212
369600210712** CONF                                                                                       CSW212
369700210712(Definition Confirmation)                                                                     CSW212
369800210712(Definition Confirmation/Cover Message)                                              CSW212 AR992080
369900210712(Cover Message)                                                                      CSW212 AR992080
370000210712** SETN                                                                                       CSW212
370100210712(Settlement/reset Confirmation)                                                               CSW212
370200210712(Settlement/reset Confirmation/Conf.)                                                CSW212 AR992080
370300210712(Confirmation)                                                                       CSW212 AR992080
