     H        1   Y
      *****************************************************************
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas SD Customer marketing group maintenance')        *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  SD1421R - Midas SD Edit customer marketing groups.           *
      *                                                               *
      *  Function:  This program allows the user to maintain details  *
      *             on the marketing details for a customer           *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CSD090             Date 06Dec10               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSW037A            Date 02May05               *
      *                 BUG6198            Date 04Apr05               *
      *                 BUG5139            Date 10Mar05               *
      *                 CSD025             Date 11Jan05               *
      *                 CSW037             Date 15Dec04               *
      *                 CSW036             Date 15Dec04               *
      *                 CSC022             Date 24Feb04               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      *                 CSD003             Date 01Jul99               *
      * Midas DBA 3.02 -----------------------------------------------*
      *                 165828             DATE 21Oct99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 088433             DATE 01AUG96               *
      *                 067989             DATE 23SEP94               *
      *                 S01459             DATE 23SEP94               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD090 - Customer Segmentation (Recompile)                   *
      *  CSW037A- Additional Field extended to 40 chars (recompile)   *
      *  BUG6198- Cannot save new Details for CUSD (Recompile)        *
      *  BUG5139 - Unable to process additional customer during       *
      *            insert                                             *
      *  CSD025 - Customer De-Activation                              *
      *  CSW037 - Additional Field Data on MT300/MT320                *
      *  CSW036 - Dual SWIFT BIC held on Client Details               *
      *  CSC022 - Commitment Control Changes for MidasPlus            *
      *  165828 - Incorrect error messages regarding Group codes.     *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - Program removed from SD model.                    *
      *  088433 - Replace the existing specific mode flag setup with  *
      *           general mode setup initiation processing.           *
      *  067989 - Removed F6 processing.                              *
      *  S01459 - Addition of headerbox and PSSR processing.          *
      *                                                               *
      *****************************************************************
     FSD1421R#CF  E                    WORKSTN                        UC
     F                                              KINFDS INFDS#
     F                                              KINFSR *PSSR
      * DSP: Midas SD Customer marketing group maintenance
      *
     FSDCMRKL1IF  E           K        DISK                           UC
     F                                              KINFDS INFDS1
     F                                              KINFSR *PSSR
      * RTV : Midas SD Customer marketing groups retrieval
      *
     FSDCGRPL1IF  E           K        DISK                           UC
     F                                              KINFDS ID0001
     F                                              KINFSR *PSSR
      * RTV : Midas SD Customer grouping codes retrieval
      *
     FSDCUSTL1IF  E           K        DISK                           UC
     F                                              KINFDS ID0002
     F                                              KINFSR *PSSR
      * RTV : Midas SD Customer details retrieval
      *
     FSDMMODL1IF  E           K        DISK                           UC
     F                                              KINFDS ID0003
     F                                              KINFSR *PSSR
      * RTV : Midas SD Midas module flags retrieval
      *
     FSDCDSHL1IF  E           K        DISK                           UC                     BUG5139
     F            @BBREBF                           KRENAME@BBREBFZ                          BUG5139
     F                                              KINFSR *PSSR                             BUG5139
      ** RTV : Customer Details Shadow file by key                                           BUG5139
      *                                                                                      BUG5139
     FSDCMRKL0UF  E           K        DISK                      A    UC
     F                                              KCOMIT
     F                                              KINFDS ID0004
     F                                              KINFSR *PSSR
      * UPD : Midas SD Customer marketing groups update
      *
     FSDFCTLL0UF  E           K        DISK                           UC
     F                                              KCOMIT
     F                                              KINFDS ID0005
     F                                              KINFSR *PSSR
      * UPD : Midas SD Standing data controls update
      *
     E* Description     : Copyright notice for inclusion in all programs
     E*
     E********************************************************************
     E                    CPY@    1   1 80               Copyright array
      *                                                                                       CSC022
      ** Commitment Control Array                                                             CSC022
     E                    WCMTAR     10 10                                                    CSC022
     I*
     I* Description     : Copyright notice for inclusion in all programs
     I*
     I/COPY QWINDSRC,SD1420GDTA
     I*Edit Cust Marketing GroupInitialise Program I-spec
     I/COPY WNCPYSRC,SD1421RIPG
      /EJECT
      * Data structures:
     IPGMDS     ESDSY2PGDSP
      * Program data structure
     IJBDTTM      DS
      * Job date/time
     I                                        1   70##JDT
     I                                        1   10##JCC
     I                                        2   30##JYY
     I                                        4   50##JMM
     I                                        6   70##JDD
     I                                        8  130##JTM
     I                                        8   90##JHH
     I                                       10  110##JNN
     I                                       12  130##JSS
      * ABO DEFINE LARGE STRING FOR CL CMD
     IYARTCM      DS                            512
     I                                        1   1 DUMMY1
     IINFDS#    E DSY2I#DSP
      * Display file information data structure
      *
     IINFDS1    E DSY2I1DSP
      * File information data structure
      *
     I@1DBRC    E DSSDCMRKL0
      * UPD : Midas SD Customer marketing groups update
      * Current/previous master file format fields for change control
      *
     I#1DBRC      DS                             30
      * Stored master file format fields
     I                                        1   1 #1DB1
      *
     IQSDFC1    E DSSDFCTLL0
      * UPD : Midas SD Standing data controls update
     IYARDCS      DS                             22
     IWUDELR      DS
     I                                        1 250 WUDR01
     I                                      251 500 WUDR02
     I                                      501 750 WUDR03
     I                                      7511000 WUDR04
     I                                     10011250 WUDR05
     I                                     12511500 WUDR06
     I                                     15011750 WUDR07
     I                                     17512000 WUDR08
     I                                     20012250 WUDR09
     I                                     22512500 WUDR00
     I                                     25012750 WUDR11
     I                                     27513000 WUDR12
      * Outward parameters
     IPARC        DS                           3064
      * RCD : Midas SD Deleted records file retrieval
      * I :  File name
     I                                        1  10 PAFNME
      * I :  Long Key
     I                                       11  60 PALKEY
      * I :  Deleted Data Record Pt1
     I                                       61 310 PADR01
      * I :  Deleted Data Record Pt2
     I                                      311 560 PADR02
      * I :  Deleted Data Record Pt3
     I                                      561 810 PADR03
      * I :  Deleted Data Record Pt4
     I                                      8111060 PADR04
      * I :  Deleted Data Record Pt5
     I                                     10611310 PADR05
      * I :  Deleted Data Record Pt6
     I                                     13111560 PADR06
      * I :  Deleted Data Record Pt7
     I                                     15611810 PADR07
      * I :  Deleted Data Record Pt8
     I                                     18112060 PADR08
      * I :  Deleted Data Record Pt9
     I                                     20612310 PADR09
      * I :  Deleted Data Record Pt10
     I                                     23112560 PADR00
      * I :  Deleted Data Record Pt11
     I                                     25612810 PADR11
      * I :  Deleted Data Record Pt12
     I                                     28113060 PADR12
      * I :  Last Change Date
     I                                    P306130630PALCD
      * I :  Type of Last Change
     I                                     30643064 PATYLC
      *
     IYBRDCS      DS                             22
     IYCRDCS      DS                             30
     IYDRDCS      DS                             22
     IA@CPY       DS
     I* Copyright array
     I                                        1  80 CPY@
     IRUNDAT      DS
     I                                        1   7 MRDT
     I                                    P   8  100RDNB
     I                                       11  11 SUC
     I                                       12  12 DFF
     I                                       13  13 MBIN
     IID0001      DS                            528
      * File information data structure
      *
     IID0002      DS                            528
      * File information data structure
      *
     IID0003      DS                            528
      * File information data structure
      *
     IID0004      DS                            528
      * File information data structure
      *
     IID0005      DS                            528
      * File information data structure
      *
      /EJECT
      * Parameter declarations
     IP1PARM      DS                              6
      * KEY: Midas SD Customer marketing groups retrieval
      * I : MAP Customer Number
     I                                        1   6 P1CUST
     IP2PARM      DS
      * I :  Action Code
     I                                        1   1 P2ANCD
     I            DS
     I                                        1 132 ZAMSDA
      * Message data for 'Group 1 not found'
      * Group 1
     I                                        1   4 ZA0001
      * Message data for 'Group 2 not found'
      * Group 2
     I                                        1   4 ZA0002
      * Message data for 'Group 3 not found'
      * Group 3
     I                                        1   4 ZA0003
      * Message data for 'Group 4 not found'
      * Group 4
     I                                        1   4 ZA0004
      * Message data for 'Group 5 not found'
      * Group 5
     I                                        1   4 ZA0005
      * Message data for 'Group 1 not found'
      * Group 1
     I                                        1   4 ZA0006
      * Message data for 'Group 2 not found'
      * Group 2
     I                                        1   4 ZA0007
      * Message data for 'Group 3 not found'
      * Group 3
     I                                        1   4 ZA0008
      * Message data for 'Group 4 not found'
      * Group 4
     I                                        1   4 ZA0009
      * Message data for 'Group 5 not found'
      * Group 5
     I                                        1   4 ZA0010
      *                                                                                       CSC022
      ** Dummy Data Structures used by Access Programs.                                       CSC022
     IDSFDY     E DSDSFDY                                                                     CSC022
      *                                                                                       CSC022
      ** Switchable Features File                                                             CSC022
     ISCSARD    E DSSCSARDPD                                                                  CSC022
      *                                                                                       CSC022
      ** Commitment Control dataarea                                                          CSC022
     ISCCMT       DS                            256                                           CSC022
     I                                        1   30WCMTNO                                    CSC022
     I                                        4 103 WCMTJB                                    CSC022
      *                                                                                       CSC022
      ** Local data area for database error details                                           CSC022
     ILDA       E DSLDA                         256                                           CSC022
     I              SPARE                           WSPARE                                    CSC022
      /EJECT
      *****************************************************************
      * Entry parameters
     C           *ENTRY    PLIST
     C                     PARM           P0RTN   7
     C                     PARM           P1PARM           KEY: Customer M
     C           P2ANCD    PARM           WP0001  1        Action Code
      *****************************************************************
      * Initialize
     C                     EXSR ZZINIT
      *
      * Check passed parameters
     C                     EXSR FACKPM
      * Perform once if all passed, else repeat
     C           W0RPT     DOUEQ'N'
      * Display and process key screen
     C                     EXSR BADSKY
     C                     END
      * Terminate program
     C                     EXSR ZXEXPG
      *****************************************************************
      /EJECT
     CSR         BADSKY    BEGSR
      *================================================================
      * Display and process key screen
      *================================================================
      * Initialize key screen
     C                     EXSR MDIZ#K
      * Bypass first display of key screen is possible
     C                     MOVEL'Y'       W0BYP   1
      * Signal start of transaction
     C                     MOVEL'Y'       W0TRN   1
     C           W0TRN     DOWEQ'Y'
     C           W0TRN     OREQ 'K'
      * Ensure transaction continues (if reset)
     C                     MOVEL'Y'       W0TRN   1
      * Conduct screen conversation
     C           W0TRN     DOWEQ'Y'
      * Is bypass key screen still viable?
     C           W0BYP     IFEQ 'Y'
     C           #1CUST    IFEQ *BLANK                     Customer Number
      * One or more key fields is blank
     C           *IN05     OREQ '1'
      * HOME: Reset screen fields
     C                     MOVEL'N'       W0BYP
     C                     END
     C                     END
      * Bypass key screen
     C           W0BYP     IFNE 'Y'
      * Display key screen
     C                     EXSR BBEXFM
     C                     END
      * Cancel key screen bypass
     C                     MOVEL'N'       W0BYP
      * Process response to key screen
      * Cancel & exit program
     C   03                CAS            ZXEXPG
      * Switch between *ADD/*CHANGE modes
     C   09                CAS            BCCHMD
      * HOME: Reset screen fields
     C   05                CAS            BDHMKY
      * Process key screen input
     C                     CAS            BEPRKY
     C                     END
     C           W0TRN     DOWEQ'R'
     C                     MOVEL'Y'       W0TRN
     C                     EXSR BEPRKY
     C                     END
      *
     C                     END
     C                     END
      *================================================================
     CSR         BAEXIT    ENDSR
      /EJECT
     CSR         BBEXFM    BEGSR
      *================================================================
      * Display key screen and process HELP requests
      *================================================================
      * Set screen conditioning indicators
     C                     EXSR GADSAK
      * Update screen time
     C                     TIME           ##TME
     C           W0HLP     DOUEQ'N'
     C                     MOVEL'N'       W0HLP   1
     C                     MOVE *IN25     HELP25  1
     C                     MOVE *ALL'0'   ##OFF  30
     C                     MOVEA##OFF     *IN,1
     C                     MOVE HELP25    *IN25
      * PUTOVR unless conditioned fields change
     C                     SETON                         86*
     C           *IN89     IFNE BBIN89
     C                     SETOF                         86*
     C                     END
     C                     MOVE *IN89     BBIN89  1
      * Set cursor by *SET CURSOR data
     C           YSETCS    IFEQ 'Y'
     C                     EXSR Y0SET
     C                     END
     C                     WRITE#MSGCTL
     C                     WRITE#CMDTXT1
     C                     EXFMT#RCDKEY
      * Test cursor
     C                     EXSR Y8TST
      * Clear set cursor DDS indicator
     C           WCSRLC    IFEQ 'OFF'
     C                     SETOF                     94    *
     C                     END
     C                     MOVE *BLANK    WCSRLC
      * If help requested, display help text
     C   25                EXSR ZHHPKY
     C                     END
      * Update job time
     C                     TIME           ##JTM
      * Clear messages from program message queue
     C                     CALL 'Y2CLMSC'
     C                     PARM ##PGM     ZAPGMQ 10
     C                     PARM '*SAME'   ZAPGRL  5
      * Reset first message only flag
     C                     MOVEL'Y'       ZAFSMS  1
      * Reset global error indicator
     C                     SETOF                         99*
     C           YSETCS    IFEQ 'Y'
     C                     EXSR Y9CLR
     C                     END
      *================================================================
     CSR         BBEXIT    ENDSR
      /EJECT
     CSR         BCCHMD    BEGSR
      *================================================================
      * Switch between *ADD/*CHANGE modes
      *================================================================
     C           W0PMD     IFEQ 'ADD'
     C                     MOVEL'CHG'     W0PMD   3
     C                     ELSE
     C                     MOVEL'ADD'     W0PMD
     C                     END
      *================================================================
     CSR         BCEXIT    ENDSR
      /EJECT
     CSR         BDHMKY    BEGSR
      *================================================================
      * Process HOME key
      *================================================================
     C                     MOVEL'N'       W0TRN
      *================================================================
     CSR         BDEXIT    ENDSR
      /EJECT
     CSR         BEPRKY    BEGSR
      *================================================================
      * Process key screen input
      *================================================================
      * Initialise detail screen
     C                     EXSR MAIZ#1
      * Validate key fields
     C                     EXSR BFVLKY
     C           *IN99     CABEQ'1'       BEEXIT
      * Check for existing record
     C           KRTV      KLIST
     C                     KFLD           D7CUST           Customer Number
      * Setup key
     C                     MOVEL#1CUST    D7CUST           Customer Number
     C           KRTV      CHAIN@D7REJB              9091  *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     SETON                     9931  *
     C                     GOTO BEEXIT
     C                     END                             FI 91
      *
      * Verify record existence against program mode
     C           W0PMD     IFNE 'ADD'
      * If record does not exist, error
     C           *IN90     IFEQ '1'
     C                     SETON                     9931  *
      * Send message 'Customer Marketing Gro NF'
     C                     MOVEL'USR1478' ZAMSID
     C                     EXSR ZASNMS
     C                     ELSE
     C                     EXSR MBFL#1
      * CALC: Detail screen function fields
      * 00/Copy Member SD1421RSFF - Customer Marketing Groups  *
     C*Edit Cust Marketing GroupCalc Detail Function Flds
     C/COPY WNCPYSRC,SD1421RSFF
      * USER: Initialize detail screen (existing record)
      * Start of fix 067989
      * Group 1
      * CASE: DB1.Group 1 is Not blank
     C           D7GPC1    IFNE *BLANK                     *IF
     C                     MOVELD7GPC1    WUGPCD           Group Code
     C                     MOVELD7GPC1    WUSGP1           Saved group 1
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SARVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SBRVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Setup message data for message
     C                     MOVELD7GPC1    ZA0001           Group 1
      * Send message 'Group 1 not found'
     C                     MOVEL'USR1480' ZAMSID
     C                     EXSR ZASNMS
     C***********          SETON                     99    *              165828
     C                     SETON                     31    *              165828
      *
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVELWUGPDS    #DGDS1           Group Descripti
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVELWUGPDS    #DGDS1           Group Descripti
     C                     END                             *FI
     C                     END                             *FI
      * Group 2
      * CASE: DB1.Group 2 is entered
     C           D7GPC2    IFNE *BLANK                     *IF
     C                     MOVELD7GPC2    WUGPCD           Group Code
     C                     MOVELD7GPC2    WUSGP2           Saved group 2
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SCRVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SDRVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Setup message data for message
     C                     MOVEL#1GPC2    ZA0002           Group 2
      * Send message 'Group 2 not found'
     C                     MOVEL'USR1481' ZAMSID
     C                     EXSR ZASNMS
     C***********          SETON                     9932  *              165828
     C                     SETON                       32  *              165828
      *
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVELWUGPDS    #DGDS2           Group Descripti
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVELWUGPDS    #DGDS2           Group Descripti
     C                     END                             *FI
     C                     END                             *FI
      * Group 3
      * CASE: DB1.Group 3 is entered
     C           D7GPC3    IFNE *BLANK                     *IF
     C                     MOVELD7GPC3    WUGPCD           Group Code
     C                     MOVELD7GPC3    WUSGP3           Saved group 3
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SERVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SFRVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Setup message data for message
     C                     MOVEL#1GPC3    ZA0003           Group 3
      * Send message 'Group 3 not found'
     C                     MOVEL'USR1482' ZAMSID
     C                     EXSR ZASNMS
     C***********          SETON                     9933  *              165828
     C                     SETON                       33  *              165828
      *
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVELWUGPDS    #DGDS3           Group Descripti
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVELWUGPDS    #DGDS3           Group Descripti
     C                     END                             *FI
     C/COPY WNCPYSRC,SD1421RC01
     C                     END                             *FI
      * Group 4
      * CASE: DB1.Group 4 is entered
     C           D7GPC4    IFNE *BLANK                     *IF
     C                     MOVELD7GPC4    WUGPCD           Group Code
     C                     MOVELD7GPC4    WUSGP4           Saved group 4
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SGRVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SHRVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Setup message data for message
     C                     MOVEL#1GPC4    ZA0004           Group 4
      * Send message 'Group 4 not found'
     C                     MOVEL'USR1483' ZAMSID
     C                     EXSR ZASNMS
     C***********          SETON                     9934  *              165828
     C                     SETON                       34  *              165828
      *
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVELWUGPDS    #DGDS4           Group Descripti
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVELWUGPDS    #DGDS4           Group Descripti
     C                     END                             *FI
     C/COPY WNCPYSRC,SD1421RC02
     C                     END                             *FI
      * Group 5
      * CASE: DB1.Group 5 is entered
     C           D7GPC5    IFNE *BLANK                     *IF
     C                     MOVELD7GPC5    WUGPCD           Group Code
     C                     MOVELD7GPC5    WUSGP5           Saved group 5
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SIRVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SJRVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Setup message data for message
     C                     MOVEL#1GPC5    ZA0005           Group 5
      * Send message 'Group 5 not found'
     C                     MOVEL'USR1484' ZAMSID
     C                     EXSR ZASNMS
     C***********          SETON                     9935  *              165828
     C                     SETON                       35  *              165828
      *
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVELWUGPDS    #DGDS5           Group Descripti
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVELWUGPDS    #DGDS5           Group Descripti
     C                     END                             *FI
     C                     END                             *FI
      * End of fix 067989
      * Set up DTL Cust Mrkt - F6 - Customer Marketing Groups  *
     C*****************************************************************
     C*
     C*  Set up Command Key text for Customer Marketing Information
     C*
     C*****************************************************************
     C*
     C*  DETAIL LINE COMMAND KEY TEXT
     C*
     C                     MOVEL'SDUSRMSG'WUMSGF 10
     C                     MOVE *BLANKS   WUMTXT 80
     C*
     C*  If Action Code is Delete :
     C*
     C           P2ANCD    IFEQ 'D'
     C* Setup footer text:
     C* F3=Client Details   F10=Delete   F12=Previous
     C                     MOVEL'USR3339' WUMSID  7        Message Identifier
     C                     CALL 'SDRTVTXT'             90  Retrieve MSGF message
     C           WUMSID    PARM WUMSID    WQ0286  7        Message Identifier
     C           WUMSGF    PARM WUMSGF    WQ0287 10        Message File Name
     C           WUMTXT    PARM WUMTXT    WQ0288 80        Message Text
     C                     MOVELWUMTXT    ##CTX1
     C*
     C           *IN90     IFEQ '1'
     C* Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SDRTVTXT'W0CLPG
     C* Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
     C                     ELSE
     C*
     C*  If Action Code is Insert or Amend:
     C*
     C* Setup footer text:
     C* F3=Client Details   F12=Previous
     C                     MOVEL'USR3340' WUMSID           Message Identifier
     C                     CALL 'SDRTVTXT'             90  Retrieve MSGF message
     C           WUMSID    PARM WUMSID    WQ0286  7        Message Identifier
     C           WUMSGF    PARM WUMSGF    WQ0287 10        Message File Name
     C           WUMTXT    PARM WUMTXT    WQ0288 80        Message Text
     C                     MOVELWUMTXT    ##CTX1
     C*
     C           *IN90     IFEQ '1'
     C* Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SDRTVTXT'W0CLPG
     C* Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
     C                     END
     C*
      * 00/Copy Member SD1421RISE - Customer Marketing Groups  *
     C*Edit Cust Marketing GroupInitialise Dtl Exist Rcd
     C/COPY WNCPYSRC,SD1421RISE
     C                     END
      *
     C                     ELSE
      * If record already exists, error
     C           *IN90     IFEQ '0'
     C                     SETON                     9931  *
      * Send message 'Customer Marketing Gro EX'
     C                     MOVEL'USR1479' ZAMSID
     C                     EXSR ZASNMS
     C                     ELSE
      * USER: Initialize detail screen (new record)
      * Set up DTL Cust Mrkt - F6 - Customer Marketing Groups  *
     C*****************************************************************
     C*
     C*  Set up Command Key text for Customer Marketing Information
     C*
     C*****************************************************************
     C*
     C*  DETAIL LINE COMMAND KEY TEXT
     C*
     C                     MOVEL'SDUSRMSG'WUMSGF 10
     C                     MOVE *BLANKS   WUMTXT 80
     C*
     C*  If Action Code is Delete :
     C*
     C           P2ANCD    IFEQ 'D'
     C* Setup footer text:
     C* F3=Client Details   F10=Delete   F12=Previous
     C                     MOVEL'USR3339' WUMSID  7        Message Identifier
     C                     CALL 'SDRTVTXT'             90  Retrieve MSGF message
     C           WUMSID    PARM WUMSID    WQ0286  7        Message Identifier
     C           WUMSGF    PARM WUMSGF    WQ0287 10        Message File Name
     C           WUMTXT    PARM WUMTXT    WQ0288 80        Message Text
     C                     MOVELWUMTXT    ##CTX1
     C*
     C           *IN90     IFEQ '1'
     C* Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SDRTVTXT'W0CLPG
     C* Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
     C                     ELSE
     C*
     C*  If Action Code is Insert or Amend:
     C*
     C* Setup footer text:
     C* F3=Client Details   F12=Previous
     C                     MOVEL'USR3340' WUMSID           Message Identifier
     C                     CALL 'SDRTVTXT'             90  Retrieve MSGF message
     C           WUMSID    PARM WUMSID    WQ0286  7        Message Identifier
     C           WUMSGF    PARM WUMSGF    WQ0287 10        Message File Name
     C           WUMTXT    PARM WUMTXT    WQ0288 80        Message Text
     C                     MOVELWUMTXT    ##CTX1
     C*
     C           *IN90     IFEQ '1'
     C* Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SDRTVTXT'W0CLPG
     C* Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
     C                     END
     C*
      * 00/Copy Member SD1421RISN - Customer Marketing Groups  *
     C*Edit Cust Marketing GroupInitialise Dtl New Rcd
     C/COPY WNCPYSRC,SD1421RISN
     C                     END
     C                     END
      *..................................................
     C   99                GOTO BEEXIT
      * No error: Display and process details
     C                     EXSR CADSDA
      *
      *================================================================
     CSR         BEEXIT    ENDSR
      /EJECT
     CSR         BFVLKY    BEGSR
      *================================================================
      * Validate key fields
      *================================================================
     C           W0PMD     IFNE 'ADD'
      * Select existing record
     C                     EXSR VACKRL
     C                     END
      * Check relations
      * Check reference to Client Details
     C                     EXSR VBCKRL
     C           W0RTN     IFNE *BLANK
     C                     SETON                     9931  *
     C                     END
      * USER: Validate key screen
      * 00/Copy Member SD1421RVKS - Customer Marketing Groups  *
     C*Edit Cust Marketing GroupValidate Key Screen
     C/COPY WNCPYSRC,SD1421RVKS
      * Customer Number required
     C           #1CUST    IFEQ *BLANK                     IF
     C                     SETON                     9931  *
      * Send message '*Value required'
     C                     MOVEL'Y2U0001' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     END                             FI
      *================================================================
     CSR         BFEXIT    ENDSR
      /EJECT
     CSR         CADSDA    BEGSR
      *================================================================
      * Display and process detail screen
      *================================================================
      * Conduct detail screen conversation
      * - repeat until screen control flag is reset:
     C           W0TRN     DOWEQ'Y'
      * Display detail screen
     C                     EXSR CBEXFM
      * Process response to detail screen
      * Cancel & exit program
     C   03                CAS            ZXEXPG
      * Redisplay previous screen
     C   12                CAS            CCDSPV
      * HOME: Reset screen fields
     C   05                CAS            CCDSPV
      * Process detail screen input
     C                     CAS            CFPRSC
     C                     END
     C           W0TRN     IFEQ 'R'
     C           W0PMD     IFEQ 'ADD'
     C                     EXSR MAIZ#1
     C                     END
     C                     END
      *
     C                     END
      *================================================================
     CSR         CAEXIT    ENDSR
      /EJECT
     CSR         CBEXFM    BEGSR
      *================================================================
      * Display screen and process HELP requests
      *================================================================
      * Set screen conditioning indicators
     C                     EXSR GBDSAD
      * Update screen time
     C                     TIME           ##TME
     C           W0HLP     DOUEQ'N'
     C                     MOVEL'N'       W0HLP   1
     C                     MOVE *IN25     HELP25  1
     C                     MOVE *ALL'0'   ##OFF  30
     C                     MOVEA##OFF     *IN,1
     C                     MOVE HELP25    *IN25
      * PUTOVR unless conditioned fields change
     C                     SETON                         86*
     C           *IN89     IFNE CBIN89
     C                     SETOF                         86*
     C                     END
     C                     MOVE *IN89     CBIN89  1
      * Set cursor by *SET CURSOR data
     C           YSETCS    IFEQ 'Y'
     C                     EXSR Y1SET
     C                     END
     C                     WRITE#MSGCTL
     C                     WRITE#CMDTXT2
     C                     EXFMT#RCDDTL1
      * Test cursor
     C                     EXSR Y8TST
      * Clear set cursor DDS indicator
     C           WCSRLC    IFEQ 'OFF'
     C                     SETOF                     94    *
     C                     END
     C                     MOVE *BLANK    WCSRLC
      * If help requested, display help text
     C   25                EXSR ZHHPKY
     C                     END
      * Update job time
     C                     TIME           ##JTM
      * Clear messages from program message queue
     C                     CALL 'Y2CLMSC'
     C                     PARM ##PGM     ZAPGMQ 10
     C                     PARM '*SAME'   ZAPGRL  5
      * Reset first message only flag
     C                     MOVEL'Y'       ZAFSMS  1
      * Reset global error indicator
     C                     SETOF                         99*
     C           YSETCS    IFEQ 'Y'
     C                     EXSR Y9CLR
     C                     END
      *================================================================
     CSR         CBEXIT    ENDSR
      /EJECT
     CSR         CCDSPV    BEGSR
      *================================================================
      * Redisplay previous screen
      *================================================================
      * USER: Process key screen request
      * 00/Copy Member SD1421RPKR - Customer Marketing Groups  *
     C*Edit Cust Marketing GroupProcess Key Screen Rqst
     C/COPY WNCPYSRC,SD1421RPKR
     C                     MOVEL'USR0790' P0RTN            *Return code
     C                     EXSR ZYEXPG
     C   05                MOVEL'R'       W0TRN
     C   12                MOVEL'K'       W0TRN
      *================================================================
     CSR         CCEXIT    ENDSR
      /EJECT
     CSR         CFPRSC    BEGSR
      *================================================================
      * Validate record
      *================================================================
      * Confirm/update is not deferred
     C                     MOVEL'N'       W0DCF   1
      * If delete is not pending....
      * Validate details
     C  N10                CAS            DCVLDL
     C                     END
      * QUIT if error:
     C   99                GOTO CFEXIT
      * Defer confirm/update requested
     C           W0DCF     CABEQ'Y'       CFEXIT
      * No error: update record
     C                     EXSR EBPR##
      *================================================================
     CSR         CFEXIT    ENDSR
      /EJECT
     CSR         DCVLDL    BEGSR
      *================================================================
      * Validate details
      *================================================================
      * USER: Validate detail screen fields
      * Start of fix 067989
      * Disable 'ENTER' in delete mode
      * CASE: PAR.Action Code is Delete
     C           P2ANCD    IFEQ 'D'                        *IF
      * Send message 'F3/F10/F12 valid Cst Mrkt'
     C                     MOVEL'USR1564' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO DCEXIT                     *QUIT
     C                     END                             *FI
      * End of fix 067989
      * Validate screen fields.
      * Group Code 1
      * CASE: DTL.Group 1 is blank
     C           #1GPC1    IFEQ *BLANK                     *IF
     C                     MOVEL*BLANK    #DGDS1           Group Descripti
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL#1GPC1    WUTQKF           Test ? in Key F
      * CASE: WRK.Test ? in Key Field is Question Mark
     C           WUTQKF    IFEQ '?'                        *IF
     C                     MOVEL*BLANK    WUGPCD           Group Code
     C                     MOVEL'1'       WUSNBR           Set Number
      * Select for Market Info - Customer Grouping Codes  *
     C                     CALL 'SD1411S'              90  Select for Mark
     C                     PARM *BLANK    W0RTN   7
     C           WUSNBR    PARM WUSNBR    WQ0003  1        Set Number
     C           WUGPCD    PARM WUGPCD    WQ0004  4        Group Code
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SD1411S' W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C                     SETON                     99    *
     C                     END
     C                     MOVELWUGPCD    #1GPC1           Group 1
     C                     MOVEL#1GPC1    WUSGP1           Saved group 1
      * Start of 067989
      * Display the 'Group Description' without the need to press ENTER.
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SKRVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SLRVGN
     C                     MOVELWUGPDS    #DGDS1           Group Descripti
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
      * Get the description only if the group code has changed, and
      * then save the new group code.
      * Has the Group Code changed ?
      * CASE: WRK.Saved group 1 NE DTL.Group 1
     C***********WUSGP1    IFNE #1GPC1                     *IF            165828
     C                     MOVEL#1GPC1    WUGPCD           Group Code
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SMRVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SNRVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Setup message data for message
     C                     MOVEL#1GPC1    ZA0006           Group 1
      * Send message 'Group 1 not found'
     C                     MOVEL'USR1480' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9931  *
      *
     C                     MOVEL*BLANK    #DGDS1           Group Descripti
     C                     ELSE
      * CASE: *OTHERWISE
     C           WUSGP1    IFNE #1GPC1                     *IF            165828
     C                     MOVELWUGPDS    #DGDS1           Group Descripti
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     END                             *FI            165828
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
     C           WUSGP1    IFNE #1GPC1                     *IF            165828
     C                     MOVELWUGPDS    #DGDS1           Group Descripti
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     END                             *FI            165828
     C                     END                             *FI
     C                     MOVEL#1GPC1    WUSGP1           Saved group 1
     C************         END                             *FI            165828
      * End of fix 067989
     C                     END                             *FI
     C                     END                             *FI
      * Group Code 2
      * CASE: DTL.Group 2 is blank
     C           #1GPC2    IFEQ *BLANK                     *IF
     C                     MOVEL*BLANK    #DGDS2           Group Descripti
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL#1GPC2    WUTQKF           Test ? in Key F
      * CASE: WRK.Test ? in Key Field is Question Mark
     C           WUTQKF    IFEQ '?'                        *IF
     C                     MOVEL*BLANK    WUGPCD           Group Code
     C                     MOVEL'2'       WUSNBR           Set Number
      * Select for Market Info - Customer Grouping Codes  *
     C                     CALL 'SD1411S'              90  Select for Mark
     C                     PARM *BLANK    W0RTN   7
     C           WUSNBR    PARM WUSNBR    WQ0005  1        Set Number
     C           WUGPCD    PARM WUGPCD    WQ0006  4        Group Code
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SD1411S' W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C                     SETON                     99    *
     C                     END
     C                     MOVELWUGPCD    #1GPC2           Group 2
     C                     MOVEL#1GPC2    WUSGP2           Saved group 2
      * Start of 067989
      * Display the 'Group Description' without the need to press ENTER.
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SORVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SPRVGN
     C                     MOVELWUGPDS    #DGDS2           Group Descripti
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
      * Get the description only if the group code has changed, and
      * then save the new group code.
      * Has the group code changed ?
      * CASE: WRK.Saved group 2 NE DTL.Group 2
     C***********WUSGP2    IFNE #1GPC2                     *IF            165828
     C                     MOVEL#1GPC2    WUGPCD           Group Code
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SQRVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SRRVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Setup message data for message
     C                     MOVEL#1GPC2    ZA0007           Group 2
      * Send message 'Group 2 not found'
     C                     MOVEL'USR1481' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9932  *
      *
     C                     MOVEL*BLANK    #DGDS2           Group Descripti
     C                     ELSE
      * CASE: *OTHERWISE
     C           WUSGP2    IFNE #1GPC2                     *IF            165828
     C                     MOVELWUGPDS    #DGDS2           Group Descripti
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     END                             *FI            165828
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
     C           WUSGP2    IFNE #1GPC2                     *IF            165828
     C                     MOVELWUGPDS    #DGDS2           Group Descripti
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     END                             *FI            165828
     C                     END                             *FI
     C                     MOVEL#1GPC2    WUSGP2           Saved group 2
     C************         END                             *FI            165828
      * End of fix 067989
     C                     END                             *FI
     C                     END                             *FI
      * Group Code 3
      * CASE: DTL.Group 3 is blank
     C           #1GPC3    IFEQ *BLANK                     *IF
     C                     MOVEL*BLANK    #DGDS3           Group Descripti
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL#1GPC3    WUTQKF           Test ? in Key F
      * CASE: WRK.Test ? in Key Field is Question Mark
     C           WUTQKF    IFEQ '?'                        *IF
     C                     MOVEL*BLANK    WUGPCD           Group Code
     C                     MOVEL'3'       WUSNBR           Set Number
      * Select for Market Info - Customer Grouping Codes  *
     C                     CALL 'SD1411S'              90  Select for Mark
     C                     PARM *BLANK    W0RTN   7
     C           WUSNBR    PARM WUSNBR    WQ0007  1        Set Number
     C           WUGPCD    PARM WUGPCD    WQ0008  4        Group Code
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SD1411S' W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C                     SETON                     99    *
     C                     END
     C                     MOVELWUGPCD    #1GPC3           Group 3
     C                     MOVEL#1GPC3    WUSGP3           Saved group 3
      * Start of 067989
      * Display the 'Group Description' without the need to press ENTER.
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SSRVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR STRVGN
     C                     MOVELWUGPDS    #DGDS3           Group Descripti
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
      * Get the description only if the group code has changed, and
      * then save the new group code.
      * CASE: WRK.Saved group 3 NE DTL.Group 3
     C***********WUSGP3    IFNE #1GPC3                     *IF            165828
     C                     MOVEL#1GPC3    WUGPCD           Group Code
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SURVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SVRVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Setup message data for message
     C                     MOVEL#1GPC3    ZA0008           Group 3
      * Send message 'Group 3 not found'
     C                     MOVEL'USR1482' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9933  *
      *
     C                     MOVEL*BLANK    #DGDS3           Group Descripti
     C                     ELSE
      * CASE: *OTHERWISE
     C           WUSGP3    IFNE #1GPC3                     *IF            165828
     C                     MOVELWUGPDS    #DGDS3           Group Descripti
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     END                             *FI            165828
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
     C           WUSGP3    IFNE #1GPC3                     *IF            165828
     C                     MOVELWUGPDS    #DGDS3           Group Descripti
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     END                             *FI            165828
     C                     END                             *FI
     C                     MOVEL#1GPC3    WUSGP3           Saved group 3
     C***********          END                             *FI            165828
      * End of fix 067989
     C                     END                             *FI
     C                     END                             *FI
      * Group Code 4
      * CASE: DTL.Group 4 is blank
     C           #1GPC4    IFEQ *BLANK                     *IF
     C                     MOVEL*BLANK    #DGDS4           Group Descripti
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL#1GPC4    WUTQKF           Test ? in Key F
      * CASE: WRK.Test ? in Key Field is Question Mark
     C           WUTQKF    IFEQ '?'                        *IF
     C                     MOVEL*BLANK    WUGPCD           Group Code
     C                     MOVEL'4'       WUSNBR           Set Number
      * Select for Market Info - Customer Grouping Codes  *
     C                     CALL 'SD1411S'              90  Select for Mark
     C                     PARM *BLANK    W0RTN   7
     C           WUSNBR    PARM WUSNBR    WQ0009  1        Set Number
     C           WUGPCD    PARM WUGPCD    WQ0010  4        Group Code
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SD1411S' W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C                     SETON                     99    *
     C                     END
     C                     MOVELWUGPCD    #1GPC4           Group 4
     C                     MOVEL#1GPC4    WUSGP4           Saved group 4
      * Start of 067989
      * Display the 'Group Description' without the need to press ENTER.
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SWRVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SXRVGN
     C                     MOVELWUGPDS    #DGDS4           Group Descripti
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
      * Get the description only if the group code has changed, and
      * then save the new group code.
      * Has the Group Code changed ?
      * CASE: WRK.Saved group 4 NE DTL.Group 4
     C***********WUSGP4    IFNE #1GPC4                     *IF            165828
     C                     MOVEL#1GPC4    WUGPCD           Group Code
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SYRVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR SZRVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Setup message data for message
     C                     MOVEL#1GPC4    ZA0009           Group 4
      * Send message 'Group 4 not found'
     C                     MOVEL'USR1483' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9934  *
      *
     C                     MOVEL*BLANK    #DGDS4           Group Descripti
     C                     ELSE
      * CASE: *OTHERWISE
     C           WUSGP4    IFNE #1GPC4                     *IF            165828
     C                     MOVELWUGPDS    #DGDS4           Group Descripti
     C                     MOVEL'Y'       W0DCF            *Defer confirm
      * Start of fix 067989
     C                     END                             *FI            165828
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
     C           WUSGP4    IFNE #1GPC4                     *IF            165828
     C                     MOVELWUGPDS    #DGDS4           Group Descripti
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     END                             *FI            165828
     C                     END                             *FI
     C                     MOVEL#1GPC4    WUSGP4           Saved group 4
     C***********          END                             *FI            165828
      * End of fix 067989
     C                     END                             *FI
     C                     END                             *FI
      * Group Code 5
      * CASE: DTL.Group 5 is blank
     C           #1GPC5    IFEQ *BLANK                     *IF
     C                     MOVEL*BLANK    #DGDS5           Group Descripti
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL#1GPC5    WUTQKF           Test ? in Key F
      * CASE: WRK.Test ? in Key Field is Question Mark
     C           WUTQKF    IFEQ '?'                        *IF
     C                     MOVEL*BLANK    WUGPCD           Group Code
     C                     MOVEL'5'       WUSNBR           Set Number
      * Select for Market Info - Customer Grouping Codes  *
     C                     CALL 'SD1411S'              90  Select for Mark
     C                     PARM *BLANK    W0RTN   7
     C           WUSNBR    PARM WUSNBR    WQ0011  1        Set Number
     C           WUGPCD    PARM WUGPCD    WQ0012  4        Group Code
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SD1411S' W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C                     SETON                     99    *
     C                     END
     C                     MOVELWUGPCD    #1GPC5           Group 5
     C                     MOVEL#1GPC5    WUSGP5           Saved group 5
      * Start of 067989
      * Display the 'Group Description' without the need to press ENTER.
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR TARVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR TBRVGN
     C                     MOVELWUGPDS    #DGDS5           Group Descripti
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
      * Get the description only if the group code has changed, and
      * then save the new group code.
      * Has the Group Code changed ?
      * CASE: WRK.Saved group 5 NE DTL.Group 5
     C***********WUSGP5    IFNE #1GPC5                     *IF            165828
     C                     MOVEL#1GPC5    WUGPCD           Group Code
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR TCRVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Retrieve Group Descrption - Customer Grouping Codes  *
     C                     EXSR TDRVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Setup message data for message
     C                     MOVEL#1GPC5    ZA0010           Group 5
      * Send message 'Group 5 not found'
     C                     MOVEL'USR1484' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9935  *
      *
     C                     MOVEL*BLANK    #DGDS5           Group Descripti
     C                     ELSE
      * CASE: *OTHERWISE
     C           WUSGP5    IFNE #1GPC5                     *IF            165828
     C                     MOVELWUGPDS    #DGDS5           Group Descripti
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     END                             *FI            165828
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
     C           WUSGP5    IFNE #1GPC5                     *IF            165828
     C                     MOVELWUGPDS    #DGDS5           Group Descripti
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     END                             *FI            165828
     C                     END                             *FI
     C                     MOVEL#1GPC5    WUSGP5           Saved group 5
     C***********          END                             *FI            165828
      * End of fix 067989
     C                     END                             *FI
     C                     END                             *FI
      * 00/Copy Member SD1421RVSF - Customer Marketing Groups  *
     C*Edit Cust Marketing GroupValidate Detail Screen
     C/COPY WNCPYSRC,SD1421RVSF
      * CALC: Detail screen function fields
      * 00/Copy Member SD1421RSFF - Customer Marketing Groups  *
     C*Edit Cust Marketing GroupCalc Detail Function Flds
     C/COPY WNCPYSRC,SD1421RSFF
      * USER: Validate detail screen relations
      * Start of fix 067989
      * Removed F6 processing.
      * End of fix 067989
      * 00/Copy Member SD1421RVSR - Customer Marketing Groups  *
     C*Edit Cust Marketing GroupValidate Screen Relns
     C/COPY WNCPYSRC,SD1421RVSR
      *================================================================
     CSR         DCEXIT    ENDSR
      /EJECT
     CSR         EBPR##    BEGSR
      *================================================================
      * Process record:
      *================================================================
      * Process delete request
     C   10                CAS            EDDLRQ
      * Process add request
     C           W0PMD     CASEQ'ADD'     ECADRQ
      * Process update request
     C           W0PMD     CASNE'ADD'     EECHRQ
     C                     END
     C           W0RTN     IFNE *BLANK
      * Error: ROLLBACK any DBF changes
     C           CSC022    IFEQ 'N'                                                           CSC022
     C                     ROLBK
     C                     ELSE                                                               CSC022
     C           WSKIP     IFNE 'Y'                                                           CSC022
     C                     ROLBK                                                              CSC022
     C                     ELSE                                                               CSC022
     C                     SETON                     U7U8                                     CSC022
     C                     ENDIF                                                              CSC022
     C                     ENDIF                                                              CSC022
     C                     GOTO EBEXIT
     C                     ELSE
      * Otherwise COMMIT any DBF changes
     C           CSC022    IFEQ 'N'                                                           CSC022
     C           WSKIP     OREQ 'N'                                                           CSC022
     C           CSC022    ANDEQ'Y'                                                           CSC022
     C                     COMIT
     C                     ENDIF                                                              CSC022
     C                     END
     C           W0RTN     IFEQ *BLANK
      * USER: Process command keys
      * 00/Copy Member SD1421RPCK - Customer Marketing Groups  *
     C*Edit Cust Marketing GroupProcess Command Keys
     C/COPY WNCPYSRC,SD1421RPCK
      * CASE: DTL.*CMD key is *Exit
     C           *IN03     IFEQ '1'                        *IF
     C                     MOVEL'Y2U9999' P0RTN            *Return code
     C                     EXSR ZYEXPG
     C                     END                             *FI
     C           W0PMD     IFEQ 'ADD'
      * Exit after successful add
     C                     MOVEL'N'       W0RPT
     C                     END
      * Restart program for next record
     C                     MOVEL'N'       W0TRN
     C                     END
      *================================================================
     CSR         EBEXIT    ENDSR
      /EJECT
     CSR         ECADRQ    BEGSR
      *================================================================
      * Process add request
      *================================================================
      * USER: Create DBF record
      * Create Customer Marketing - Customer Marketing Groups  *
     C                     EXSR TECRRC
     C           W0RTN     IFEQ *BLANK
      * Send message '*Record added'
     C                     MOVEL'Y2U0011' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     END
      *================================================================
     CSR         ECEXIT    ENDSR
      /EJECT
     CSR         EDDLRQ    BEGSR
      *================================================================
      * Process delete request
      *================================================================
      * USER: Delete DBF record
      * Delete Customer Marketing - Customer Marketing Groups  *
     C                     EXSR TGDLRC
     C           W0RTN     IFEQ *BLANK
      * Send message '*Record deleted'
     C                     MOVEL'Y2U0013' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     END
      *================================================================
     CSR         EDEXIT    ENDSR
      /EJECT
     CSR         EECHRQ    BEGSR
      *================================================================
      * Process update request
      *================================================================
      * USER: Change DBF record
      * Change Customer Marketing - Customer Marketing Groups  *
     C                     EXSR TICHRC
     C           W0RTN     IFNE *BLANK
      * Data update error
      * Reset screen fields if changed record
     C           W0RTN     CASEQ'Y2U0007' MBFL#1
     C                     END
     C                     ELSE
      * Send message '*Record changed'
     C                     MOVEL'Y2U0012' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     END
      *================================================================
     CSR         EEEXIT    ENDSR
      /EJECT
     CSR         FACKPM    BEGSR
      *================================================================
      * Check passed parameters
      *================================================================
      * Is full key present?
     C           P1CUST    IFEQ *BLANK                     Customer Number
      * Not every key field passed - loop program
     C                     MOVEL'Y'       W0RPT   1
     C                     ELSE
      * Full key passed, so single shot program
     C                     MOVEL'N'       W0RPT
     C                     END
      *================================================================
     CSR         FAEXIT    ENDSR
      /EJECT
     CSR         GADSAK    BEGSR
      *================================================================
      * Set key screen conditioning indicators
      *================================================================
     C           W0PMD     COMP 'ADD'                    89*
      *================================================================
     CSR         GAEXIT    ENDSR
      /EJECT
     CSR         GBDSAD    BEGSR
      *================================================================
      * Set detail screen conditioning indicators
      *================================================================
     C           W0PMD     COMP 'ADD'                    89*
      * Protect key fields on detail screen
     C                     SETON                     88    *
      * Enable key screen
     C                     SETON                     87    *
      *================================================================
     CSR         GBEXIT    ENDSR
      /EJECT
     CSR         MAIZ#1    BEGSR
      *================================================================
      * Initialise record - except for key fields and "neither" paramete
      *================================================================
     C                     Z-ADD*ZERO     #1LCD            Last Change Dat
     C                     MOVEL*BLANK    #1TYLC           Type of Last Ch
     C                     MOVEL*BLANK    #1GPC1           Group 1
     C                     MOVEL*BLANK    #DGDS1           Group Descripti
     C                     MOVEL*BLANK    #1GPC2           Group 2
     C                     MOVEL*BLANK    #DGDS2           Group Descripti
     C                     MOVEL*BLANK    #1GPC3           Group 3
     C                     MOVEL*BLANK    #DGDS3           Group Descripti
     C                     MOVEL*BLANK    #1GPC4           Group 4
     C                     MOVEL*BLANK    #DGDS4           Group Descripti
     C                     MOVEL*BLANK    #1GPC5           Group 5
     C                     MOVEL*BLANK    #DGDS5           Group Descripti
      *================================================================
     CSR         MAEXIT    ENDSR
      /EJECT
     CSR         MBFL#1    BEGSR
      *================================================================
      * Move @D7REJB fields to screen
      *================================================================
     C                     Z-ADDD7LCD     #1LCD            Last Change Dat
     C                     MOVELD7TYLC    #1TYLC           Type of Last Ch
     C                     MOVELD7CUST    #1CUST           Customer Number
     C                     MOVELD7GPC1    #1GPC1           Group 1
     C                     MOVELD7GPC2    #1GPC2           Group 2
     C                     MOVELD7GPC3    #1GPC3           Group 3
     C                     MOVELD7GPC4    #1GPC4           Group 4
     C                     MOVELD7GPC5    #1GPC5           Group 5
      * Hold existing record image
     C                     MOVEL@1DBRC    #1DBRC
      *================================================================
     CSR         MBEXIT    ENDSR
      /EJECT
     CSR         MDIZ#K    BEGSR
      *================================================================
      * Initialize key screen
      *================================================================
     C                     MOVELP1CUST    #1CUST           Customer Number
      * USER: Initialize key screen
      * Set-up KEY Screen Footer - Standard Functions  *
     C*
     C* KEY LINE COMMAND KEY TEXT
     C*
     C                     MOVEL'SDUSRMSG'WUMSGF 10
     C                     MOVE *BLANKS   WUMTXT 80
     C*
     C* Setup footer text:
     C* F3=Previous
     C                     MOVEL'USR3345' WUMSID  7        Message Identifier
     C                     CALL 'SDRTVTXT'             90  Retrieve MSGF message
     C           WUMSID    PARM WUMSID    KE0286  7        Message Identifier
     C           WUMSGF    PARM WUMSGF    KE0287 10        Message File Name
     C           WUMTXT    PARM WUMTXT    KE0288 80        Message Text
     C                     MOVELWUMTXT    ##CTX1
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SDRTVTXT'W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
     C*
      * 00/Copy Member SD1421RIKS - Customer Marketing Groups  *
     C*Edit Cust Marketing GroupInitialise Key Screen
     C/COPY WNCPYSRC,SD1421RIKS
      *================================================================
     CSR         MDEXIT    ENDSR
      /EJECT
     CSR         SARVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSA     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'1'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSA     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SAEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SAEXIT    ENDSR
      /EJECT
     CSR         SBRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSB     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'*'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSB     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SBEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SBEXIT    ENDSR
      /EJECT
     CSR         SCRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSC     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'2'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSC     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SCEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SCEXIT    ENDSR
      /EJECT
     CSR         SDRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSD     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'*'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSD     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SDEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SDEXIT    ENDSR
      /EJECT
     CSR         SERVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSE     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'3'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSE     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SEEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SEEXIT    ENDSR
      /EJECT
     CSR         SFRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSF     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'*'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSF     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SFEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SFEXIT    ENDSR
      /EJECT
     CSR         SGRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSG     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'4'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSG     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SGEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SGEXIT    ENDSR
      /EJECT
     CSR         SHRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSH     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'*'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSH     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SHEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SHEXIT    ENDSR
      /EJECT
     CSR         SIRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSI     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'5'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSI     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SIEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SIEXIT    ENDSR
      /EJECT
     CSR         SJRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSJ     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'*'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSJ     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SJEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SJEXIT    ENDSR
      /EJECT
     CSR         SKRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSK     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'1'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSK     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SKEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SKEXIT    ENDSR
      /EJECT
     CSR         SLRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSL     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'*'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSL     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SLEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SLEXIT    ENDSR
      /EJECT
     CSR         SMRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSM     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'1'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSM     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SMEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SMEXIT    ENDSR
      /EJECT
     CSR         SNRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSN     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'*'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSN     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SNEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SNEXIT    ENDSR
      /EJECT
     CSR         SORVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSO     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'2'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSO     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SOEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SOEXIT    ENDSR
      /EJECT
     CSR         SPRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSP     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'*'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSP     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SPEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SPEXIT    ENDSR
      /EJECT
     CSR         SQRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSQ     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'2'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSQ     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SQEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SQEXIT    ENDSR
      /EJECT
     CSR         SRRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSR     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'*'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSR     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SREXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SREXIT    ENDSR
      /EJECT
     CSR         SSRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSS     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'3'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSS     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SSEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SSEXIT    ENDSR
      /EJECT
     CSR         STRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSST     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'*'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSST     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO STEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         STEXIT    ENDSR
      /EJECT
     CSR         SURVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSU     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'3'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSU     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SUEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SUEXIT    ENDSR
      /EJECT
     CSR         SVRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSV     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'*'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSV     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SVEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SVEXIT    ENDSR
      /EJECT
     CSR         SWRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSW     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'4'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSW     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SWEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SWEXIT    ENDSR
      /EJECT
     CSR         SXRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSX     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'*'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSX     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SXEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SXEXIT    ENDSR
      /EJECT
     CSR         SYRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSY     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'4'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSY     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SYEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SYEXIT    ENDSR
      /EJECT
     CSR         SZRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSZ     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'*'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSSZ     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SZEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         SZEXIT    ENDSR
      /EJECT
     CSR         TARVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSTA     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'5'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSTA     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO TAEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         TAEXIT    ENDSR
      /EJECT
     CSR         TBRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSTB     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'*'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSTB     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO TBEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         TBEXIT    ENDSR
      /EJECT
     CSR         TCRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSTC     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'5'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSTC     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO TCEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         TCEXIT    ENDSR
      /EJECT
     CSR         TDRVGN    BEGSR
      *================================================================
      * Retrieve Group Descrption - Customer Grouping Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSTD     KLIST
     C                     KFLD           D6SNBR           Set Number
     C                     KFLD           D6GPCD           Group Code
      * Move fields to key list
     C                     MOVEL'*'       D6SNBR           Set Number
     C                     MOVELWUGPCD    D6GPCD           Group Code
     C           KRSTD     CHAIN@D6REI8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1462' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO TDEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     MOVELD6GPDS    WUGPDS           Group Descripti
     C                     END
      *================================================================
     CSR         TDEXIT    ENDSR
      /EJECT
     CSR         TECRRC    BEGSR
      *================================================================
      * Create Customer Marketing - Customer Marketing Groups  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Move all fields to @D7REJA
     C                     MOVEL#1CUST    D7CUST           Customer Number
     C                     MOVEL#1GPC1    D7GPC1           Group 1
     C                     MOVEL#1GPC2    D7GPC2           Group 2
     C                     MOVEL#1GPC3    D7GPC3           Group 3
     C                     MOVEL#1GPC4    D7GPC4           Group 4
     C                     MOVEL#1GPC5    D7GPC5           Group 5
     C                     Z-ADDWURDNB    D7LCD            Last Change Dat
     C                     MOVEL'I'       D7TYLC           Type of Last Ch
      *
      * USER: Processing before Data update
      * Window Processing
      * CASE: WRK.Window processing requir. is Yes
     C           WUWDPR    IFEQ 'Y'                        *IF
      * WM call Window Manager - Window manager  *
     C/COPY WNCPYSRC,WN0481CCP1                                           S01408
     C***********          CALL 'WIND01'                                  S01212
     C                     CALL 'WN0010'                                  S01212
     C*********************PARM           ##PGM            Program        S01212
     C                     PARM ##PGM     UPGM   10        Program        S01212
     C*********************PARM *BLANK    FKEY    2        Function Key   S01212
     C                     PARM *BLANK    UFKEY   2        Function Key   S01212
     C*********************PARM           WUMEST           Action  S01212 S01229
     C*********************PARM           WUWMAC           Action  S01212 S01229
     C                     PARM 'I'       UACTCD  1        Action  S01212 S01229
     C                     PARM           DATA             Trans Data     S01212
     C                     PARM *BLANK    W0RTN            Return Code    S01212
     C                     PARM           SPARE 256        Spare Field    LN0355
      * WM Check Return
      * CASE: PAR.*Return code is *User QUIT requested
     C           W0RTN     IFEQ 'Y2U9999'                  *IF
     C                     MOVELW0RTN     P0RTN            *Return code
     C                     EXSR ZYEXPG
     C                     ELSE
      * CASE: PAR.*Return code is WN Window Error
     C           W0RTN     IFEQ 'USR0563'                  *IF
      * Send message 'WN Window Error'
     C                     MOVEL'USR0563' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO TEEXIT                     *QUIT
     C                     ELSE
      * CASE: PAR.*Return code is *DBF update error
     C           W0RTN     IFEQ 'Y2U0004'                  *IF
      * Send message 'WN Database Error'
     C                     MOVEL'USR0567' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO TEEXIT                     *QUIT
     C                     ELSE
      * CASE: PAR.*Return code is *Previous Screen
     C           W0RTN     IFEQ 'USR0790'                  *IF
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO TEEXIT                     *QUIT
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
      * 00/Copy Member SD1421RCBW - Customer Marketing Groups  *
     C*Edit Cust Marketing GroupProc Before Create - WN
     C/COPY WNCPYSRC,SD1421RCBW
     C                     END                             *FI
      * 00/Copy Member SD1421RCBU - Customer Marketing Groups  *
     C*Edit Cust Marketing GroupProcessing Before Create
     C/COPY WNCPYSRC,SD1421RCBU
     C           KLCRTE    KLIST
     C                     KFLD           D7CUST           Customer Number
      * Check for duplicate primary key
     C           KLCRTE    SETLL@D7REJA                  90*
     C           *IN90     IFEQ '1'
     C                     MOVEL'USR1479' W0RTN   7
      * Send message 'Customer Marketing Gro EX'
     C                     MOVEL'USR1479' ZAMSID
     C                     EXSR ZASNMS
     C                     GOTO TEEXIT
     C                     END
      *
     C                     WRITE@D7REJA                91  *
      *
     C           *IN91     IFEQ '1'
      * Write error detected
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     ELSE
      * USER: Processing after Data update
     C                     Z-ADD1         WUNORC           No. of Records
     C                     Z-ADD*ZERO     WUNOAM           No. of Amends
     C                     Z-ADD*ZERO     WUNODL           No. of Deletes
     C                     Z-ADD1         WUNOIN           No. of Inserts
      * Change Standing Data Cont - Standing Data Controls  *
     C                     EXSR TFCHRC
      * 00/Copy Member SD1421RCAU - Customer Marketing Groups  *
     C*Edit Cust Marketing GroupProcessing After Create
     C/COPY WNCPYSRC,SD1421RCAU
     C                     END
      *================================================================
     CSR         TEEXIT    ENDSR
      /EJECT
     CSR         TFCHRC    BEGSR
      *================================================================
      * Change Standing Data Cont - Standing Data Controls  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Set PGM.*Record Data Changed flag
     C                     MOVE 'N'       YARDC   1
      *
      * Move key fields to @AHREAU
     C                     MOVE *BLANK    AHFLNM           Filename
     C                     MOVEL'SDCMRKPD'AHFLNM           Filename
      *
     C           KLCHTF    KLIST
     C                     KFLD           AHFLNM           Filename
     C           KLCHTF    CHAIN@AHREAU              9091  *
      *
     C           *IN90     IFEQ '1'
      * Record not found
     C                     MOVEL'Y2U0009' W0RTN   7
      * Send message '*Record no longer on file'
     C                     MOVEL'Y2U0009' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     GOTO TFEXIT
     C                     END
      *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     GOTO TFEXIT
     C                     END
      *
      * Store record data for null update check
     C                     MOVE QSDFC1    YARDCS
      * USER: Processing after Data read
     C                     ADD  AHNORC    WUNORC           No. of Records
     C                     ADD  AHNOIN    WUNOIN           No. of Inserts
     C                     ADD  AHNOAM    WUNOAM           No. of Amends
     C                     ADD  AHNODL    WUNODL           No. of Deletes
      * Move non-key fields to @AHREAU
     C                     Z-ADDWUNORC    AHNORC           No. of Records
     C                     Z-ADDWUNOIN    AHNOIN           No. of Inserts
     C                     Z-ADDWUNOAM    AHNOAM           No. of Amends
     C                     Z-ADDWUNODL    AHNODL           No. of Deletes
      *
      * Set PGM.*Record Data Changed flag
     C           QSDFC1    IFNE YARDCS
     C                     MOVE 'Y'       YARDC
     C                     END
      * If changed update record otherwise release record
     C           YARDC     IFEQ 'Y'
     C                     UPDAT@AHREAU                91  *
     C                     ELSE
      * Release record lock
     C                     UNLCKSDFCTLL0               91  *
     C                     END
     C           *IN91     IFEQ '1'
      * Change error detected
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     ELSE
      *
      * DBF change successful
     C                     END
      *================================================================
     CSR         TFEXIT    ENDSR
      /EJECT
     CSR         TGDLRC    BEGSR
      *================================================================
      * Delete Customer Marketing - Customer Marketing Groups  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * USER: Processing before Data update
      * CASE: PAR.Action Code is Delete
     C           P2ANCD    IFEQ 'D'                        *IF
      * Call Window Manager
      * CASE: WRK.Window processing requir. is Yes
     C           WUWDPR    IFEQ 'Y'                        *IF
      * WM call Window Manager - Window manager  *
     C/COPY WNCPYSRC,WN0481CCP1                                           S01408
     C***********          CALL 'WIND01'                                  S01212
     C                     CALL 'WN0010'                                  S01212
     C*********************PARM           ##PGM            Program        S01212
     C                     PARM ##PGM     UPGM   10        Program        S01212
     C*********************PARM *BLANK    FKEY    2        Function Key   S01212
     C                     PARM *BLANK    UFKEY   2        Function Key   S01212
     C*********************PARM           WUMEST           Action  S01212 S01229
     C*********************PARM           WUWMAC           Action  S01212 S01229
     C                     PARM 'D'       UACTCD  1        Action  S01212 S01229
     C                     PARM           DATA             Trans Data     S01212
     C                     PARM *BLANK    W0RTN            Return Code    S01212
     C                     PARM           SPARE 256        Spare Field    LN0355
      * WM Check Return
      * CASE: PAR.*Return code is *User QUIT requested
     C           W0RTN     IFEQ 'Y2U9999'                  *IF
     C                     MOVELW0RTN     P0RTN            *Return code
     C                     EXSR ZYEXPG
     C                     ELSE
      * CASE: PAR.*Return code is WN Window Error
     C           W0RTN     IFEQ 'USR0563'                  *IF
      * Send message 'WN Window Error'
     C                     MOVEL'USR0563' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO TGEXIT                     *QUIT
     C                     ELSE
      * CASE: PAR.*Return code is *DBF update error
     C           W0RTN     IFEQ 'Y2U0004'                  *IF
      * Send message 'WN Database Error'
     C                     MOVEL'USR0567' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO TGEXIT                     *QUIT
     C                     ELSE
      * CASE: PAR.*Return code is *Previous Screen
     C           W0RTN     IFEQ 'USR0790'                  *IF
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO TGEXIT                     *QUIT
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
      * 00/Copy Member SD1421RDBW - Customer Marketing Groups  *
     C*Edit Cust Marketing GroupProc Before Delete - WN
     C/COPY WNCPYSRC,SD1421RDBW
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
      * Send message 'Function key not allowed'
     C                     MOVEL'USR0533' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     MOVEL'Y2U0004' W0RTN            *Return code
     C                     GOTO TGEXIT                     *QUIT
     C                     END                             *FI
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/Copy Member SD1421RDBU - Customer Marketing Groups  *
     C*Edit Cust Marketing GroupProcessing Before Delete
     C/COPY WNCPYSRC,SD1421RDBU
     C                     END                             *FI
      * Move key fields to @D7REJA
     C                     MOVEL#1CUST    D7CUST           Customer Number
      *
     C           KLDLTG    KLIST
     C                     KFLD           D7CUST           Customer Number
     C           KLDLTG    CHAIN@D7REJA              9091  *
     C           *IN90     IFEQ '1'
      * Record already deleted
     C                     MOVEL'Y2U0009' W0RTN   7
      * Send message '*Record no longer on file'
     C                     MOVEL'Y2U0009' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     GOTO TGEXIT
     C                     END
      *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     MOVEL'Y2U0004' W0RTN   7
      * Send message '*Database operation error'
     C                     MOVEL'Y2U0004' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     GOTO TGEXIT
     C                     END
      *
      * Check for changed record
     C           #1DBRC    IFNE @1DBRC                     IF
     C                     MOVEL'Y2U0007' W0RTN   7
      * Send message '*Update not accepted'
     C                     MOVEL'Y2U0007' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
      * Release record lock
     C           KLDLTG    SETLL@D7REJA              9091  *
     C                     GOTO TGEXIT
     C                     END                             FI #1DBRC
      *................................................................
     C                     DELET@D7REJA                91  *
     C           *IN91     IFEQ '1'
      * Delete error detected
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     ELSE
      * DBF delete successful
      * USER: Processing after Data update
      * WUDELR Data Structure - SD Deleted Records File  *
     C                     MOVEL@1DBRC    WUDELR
      * Write Deleted Record - SD Deleted Records File  *
     C                     CLEARPARC
     C                     MOVEL'SDCMRKPD'PAFNME           File name
     C                     MOVEL#1CUST    PALKEY           Long Key
     C                     MOVELWUDR01    PADR01           Deleted Data Re
     C                     MOVELWUDR02    PADR02           Deleted Data Re
     C                     MOVELWUDR03    PADR03           Deleted Data Re
     C                     MOVELWUDR04    PADR04           Deleted Data Re
     C                     MOVELWUDR05    PADR05           Deleted Data Re
     C                     MOVELWUDR06    PADR06           Deleted Data Re
     C                     MOVELWUDR07    PADR07           Deleted Data Re
     C                     MOVELWUDR08    PADR08           Deleted Data Re
     C                     MOVELWUDR09    PADR09           Deleted Data Re
     C                     MOVELWUDR00    PADR00           Deleted Data Re
     C                     MOVELWUDR11    PADR11           Deleted Data Re
     C                     MOVELWUDR12    PADR12           Deleted Data Re
     C                     Z-ADDWURDNB    PALCD            Last Change Dat
     C                     MOVEL'D'       PATYLC           Type of Last Ch
      *
     C                     CALL 'SD0520X'              90  Write Deleted R
     C                     PARM *BLANK    W0RTN   7
     C                     PARM           PARC             RCD: SD Deleted
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SD0520X' W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C                     SETON                     99    *
     C                     END
     C                     Z-ADD-1        WUNORC           No. of Records
     C                     Z-ADD1         WUNODL           No. of Deletes
     C                     Z-ADD*ZERO     WUNOIN           No. of Inserts
     C                     Z-ADD*ZERO     WUNOAM           No. of Amends
      * Change Standing Data Cont - Standing Data Controls  *
     C                     EXSR THCHRC
      * CASE: WRK.S01212 is Fix installed
     C           WUMFTS    IFEQ 'Y'                        *IF
      * 00/Copy Member SD1421RDAU - Customer Marketing Groups  *
     C*Edit Cust Marketing GroupProcessing After Delete
     C/COPY WNCPYSRC,SD1421RDAU
     C                     END                             *FI
     C                     END
      *================================================================
     CSR         TGEXIT    ENDSR
      /EJECT
     CSR         THCHRC    BEGSR
      *================================================================
      * Change Standing Data Cont - Standing Data Controls  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Set PGM.*Record Data Changed flag
     C                     MOVE 'N'       YBRDC   1
      *
      * Move key fields to @AHREAU
     C                     MOVE *BLANK    AHFLNM           Filename
     C                     MOVEL'SDCMRKPD'AHFLNM           Filename
      *
     C           KLCHTH    KLIST
     C                     KFLD           AHFLNM           Filename
     C           KLCHTH    CHAIN@AHREAU              9091  *
      *
     C           *IN90     IFEQ '1'
      * Record not found
     C                     MOVEL'Y2U0009' W0RTN   7
      * Send message '*Record no longer on file'
     C                     MOVEL'Y2U0009' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     GOTO THEXIT
     C                     END
      *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     GOTO THEXIT
     C                     END
      *
      * Store record data for null update check
     C                     MOVE QSDFC1    YBRDCS
      * USER: Processing after Data read
     C                     ADD  AHNORC    WUNORC           No. of Records
     C                     ADD  AHNOIN    WUNOIN           No. of Inserts
     C                     ADD  AHNOAM    WUNOAM           No. of Amends
     C                     ADD  AHNODL    WUNODL           No. of Deletes
      * Move non-key fields to @AHREAU
     C                     Z-ADDWUNORC    AHNORC           No. of Records
     C                     Z-ADDWUNOIN    AHNOIN           No. of Inserts
     C                     Z-ADDWUNOAM    AHNOAM           No. of Amends
     C                     Z-ADDWUNODL    AHNODL           No. of Deletes
      *
      * Set PGM.*Record Data Changed flag
     C           QSDFC1    IFNE YBRDCS
     C                     MOVE 'Y'       YBRDC
     C                     END
      * If changed update record otherwise release record
     C           YBRDC     IFEQ 'Y'
     C                     UPDAT@AHREAU                91  *
     C                     ELSE
      * Release record lock
     C                     UNLCKSDFCTLL0               91  *
     C                     END
     C           *IN91     IFEQ '1'
      * Change error detected
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     ELSE
      *
      * DBF change successful
     C                     END
      *================================================================
     CSR         THEXIT    ENDSR
      /EJECT
     CSR         TICHRC    BEGSR
      *================================================================
      * Change Customer Marketing - Customer Marketing Groups  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Set PGM.*Record Data Changed flag
     C                     MOVE 'N'       YCRDC   1
      *
      * Move key fields to @D7REJA
     C                     MOVEL#1CUST    D7CUST           Customer Number
      *
     C           KLCHTI    KLIST
     C                     KFLD           D7CUST           Customer Number
     C           KLCHTI    CHAIN@D7REJA              9091  *
      *
     C           *IN90     IFEQ '1'
      * Record not found
     C                     MOVEL'Y2U0009' W0RTN   7
      * Send message '*Record no longer on file'
     C                     MOVEL'Y2U0009' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     GOTO TIEXIT
     C                     END
      *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     GOTO TIEXIT
     C                     END
      *
      * Check for changed record
     C           #1DBRC    IFNE @1DBRC                     IF
     C                     MOVEL'Y2U0007' W0RTN   7
      * Send message '*Update not accepted'
     C                     MOVEL'Y2U0007' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
      * Release record lock
     C                     UNLCKSDCMRKL0               91  *
     C                     GOTO TIEXIT
     C                     END                             FI #1DBRC
      * Store record data for null update check
     C                     MOVE @1DBRC    YCRDCS
      * Move non-key fields to @D7REJA
     C                     MOVEL#1GPC1    D7GPC1           Group 1
     C                     MOVEL#1GPC2    D7GPC2           Group 2
     C                     MOVEL#1GPC3    D7GPC3           Group 3
     C                     MOVEL#1GPC4    D7GPC4           Group 4
     C                     MOVEL#1GPC5    D7GPC5           Group 5
     C                     Z-ADDWURDNB    D7LCD            Last Change Dat
     C                     MOVEL'A'       D7TYLC           Type of Last Ch
      *
      * Set PGM.*Record Data Changed flag
     C           @1DBRC    IFNE YCRDCS
     C                     MOVE 'Y'       YCRDC
     C                     END
      * USER: Processing before Data update
      * Window Processing
      * CASE: WRK.Window processing requir. is Yes
     C           WUWDPR    IFEQ 'Y'                        *IF
      * WM call Window Manager - Window manager  *
     C/COPY WNCPYSRC,WN0481CCP1                                           S01408
     C***********          CALL 'WIND01'                                  S01212
     C                     CALL 'WN0010'                                  S01212
     C*********************PARM           ##PGM            Program        S01212
     C                     PARM ##PGM     UPGM   10        Program        S01212
     C*********************PARM *BLANK    FKEY    2        Function Key   S01212
     C                     PARM *BLANK    UFKEY   2        Function Key   S01212
     C*********************PARM           WUMEST           Action  S01212 S01229
     C*********************PARM           WUWMAC           Action  S01212 S01229
     C                     PARM 'A'       UACTCD  1        Action  S01212 S01229
     C                     PARM           DATA             Trans Data     S01212
     C                     PARM *BLANK    W0RTN            Return Code    S01212
     C                     PARM           SPARE 256        Spare Field    LN0355
      * WM Check Return
      * CASE: PAR.*Return code is *User QUIT requested
     C           W0RTN     IFEQ 'Y2U9999'                  *IF
     C                     MOVELW0RTN     P0RTN            *Return code
     C                     EXSR ZYEXPG
     C                     ELSE
      * CASE: PAR.*Return code is WN Window Error
     C           W0RTN     IFEQ 'USR0563'                  *IF
      * Send message 'WN Window Error'
     C                     MOVEL'USR0563' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO TIEXIT                     *QUIT
     C                     ELSE
      * CASE: PAR.*Return code is *DBF update error
     C           W0RTN     IFEQ 'Y2U0004'                  *IF
      * Send message 'WN Database Error'
     C                     MOVEL'USR0567' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO TIEXIT                     *QUIT
     C                     ELSE
      * CASE: PAR.*Return code is *Previous Screen
     C           W0RTN     IFEQ 'USR0790'                  *IF
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO TIEXIT                     *QUIT
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
      * 00/Copy Member SD1421RBUW - Customer Marketing Groups  *
     C*Edit Cust Marketing GroupBefore Update, Window on
     C/COPY WNCPYSRC,SD1421RBUW
     C                     END                             *FI
      * 00/Copy Member SD1421RBDU - Customer Marketing Groups  *
     C*Edit Cust Marketing GroupProcessing Before Update
     C/COPY WNCPYSRC,SD1421RBDU
      * Set PGM.*Record Data Changed flag
     C           @1DBRC    IFNE YCRDCS
     C                     MOVE 'Y'       YCRDC
     C                     END
      * If changed update record otherwise release record
     C           YCRDC     IFEQ 'Y'
     C                     UPDAT@D7REJA                91  *
     C                     ELSE
      * Release record lock
     C                     UNLCKSDCMRKL0               91  *
     C                     END
     C           *IN91     IFEQ '1'
      * Change error detected
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     ELSE
      *
      * Update saved record image
     C                     MOVEL@1DBRC    #1DBRC
      * DBF change successful
      * USER: Processing after Data update
     C                     Z-ADD*ZERO     WUNORC           No. of Records
     C                     Z-ADD*ZERO     WUNOIN           No. of Inserts
     C                     Z-ADD*ZERO     WUNODL           No. of Deletes
     C                     Z-ADD1         WUNOAM           No. of Amends
      * Change Standing Data Cont - Standing Data Controls  *
     C                     EXSR TJCHRC
      * 00/Copy Member SD1421RADU - Customer Marketing Groups  *
     C*Edit Cust Marketing GroupProcessing After Update
     C/COPY WNCPYSRC,SD1421RADU
     C                     END
      *================================================================
     CSR         TIEXIT    ENDSR
      /EJECT
     CSR         TJCHRC    BEGSR
      *================================================================
      * Change Standing Data Cont - Standing Data Controls  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Set PGM.*Record Data Changed flag
     C                     MOVE 'N'       YDRDC   1
      *
      * Move key fields to @AHREAU
     C                     MOVE *BLANK    AHFLNM           Filename
     C                     MOVEL'SDCMRKPD'AHFLNM           Filename
      *
     C           KLCHTJ    KLIST
     C                     KFLD           AHFLNM           Filename
     C           KLCHTJ    CHAIN@AHREAU              9091  *
      *
     C           *IN90     IFEQ '1'
      * Record not found
     C                     MOVEL'Y2U0009' W0RTN   7
      * Send message '*Record no longer on file'
     C                     MOVEL'Y2U0009' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     GOTO TJEXIT
     C                     END
      *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     GOTO TJEXIT
     C                     END
      *
      * Store record data for null update check
     C                     MOVE QSDFC1    YDRDCS
      * USER: Processing after Data read
     C                     ADD  AHNORC    WUNORC           No. of Records
     C                     ADD  AHNOIN    WUNOIN           No. of Inserts
     C                     ADD  AHNOAM    WUNOAM           No. of Amends
     C                     ADD  AHNODL    WUNODL           No. of Deletes
      * Move non-key fields to @AHREAU
     C                     Z-ADDWUNORC    AHNORC           No. of Records
     C                     Z-ADDWUNOIN    AHNOIN           No. of Inserts
     C                     Z-ADDWUNOAM    AHNOAM           No. of Amends
     C                     Z-ADDWUNODL    AHNODL           No. of Deletes
      *
      * Set PGM.*Record Data Changed flag
     C           QSDFC1    IFNE YDRDCS
     C                     MOVE 'Y'       YDRDC
     C                     END
      * If changed update record otherwise release record
     C           YDRDC     IFEQ 'Y'
     C                     UPDAT@AHREAU                91  *
     C                     ELSE
      * Release record lock
     C                     UNLCKSDFCTLL0               91  *
     C                     END
     C           *IN91     IFEQ '1'
      * Change error detected
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     ELSE
      *
      * DBF change successful
     C                     END
      *================================================================
     CSR         TJEXIT    ENDSR
      /EJECT
     CSR         TKRVGN    BEGSR
      *================================================================
      * Get 'Window required' ind - MIDAS Modules  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSTK     KLIST
     C                     KFLD           BGMODS           Modules
      * Move fields to key list
     C                     MOVE *BLANK    BGMODS           Modules
     C                     MOVEL'MMOD'    BGMODS           Modules
     C           KRSTK     CHAIN@BGREC8              90    *
      * Data record not found
     C   90                MOVEL'USR0096' W0RTN   7
     C           *IN90     IFEQ '0'
      * USER: Process Data record
      * CASE: DB1.Window processing requir. is Yes
     C           BGWDPR    IFEQ 'Y'                        *IF
     C                     MOVEL'Y'       WUWDPR           Window processi
     C                     END                             *FI
     C                     END
      *================================================================
     CSR         TKEXIT    ENDSR
      /EJECT
     CSR         TLRVGN    BEGSR
      *================================================================
      * Retrieve Client Marketing - Customer Marketing Groups  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSTL     KLIST
     C                     KFLD           D7CUST           Customer Number
      * Move fields to key list
     C                     MOVELP1CUST    D7CUST           Customer Number
     C           KRSTL     CHAIN@D7REJB              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR1478' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO TLEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     END
      *================================================================
     CSR         TLEXIT    ENDSR
      /EJECT
     CSR         VACKRL    BEGSR
      *================================================================
      * Select existing record
      *================================================================
      * Name search required?
     C                     MOVEL#1CUST    WK1X01  1
     C           WK1X01    IFEQ '?'                        Customer Number
      * Field '(KEY) #1CUST' defaulted for 'Customer Number'.
     C                     CALL 'SD1420S'              90  Select Customer
     C                     PARM *BLANK    W0RTN   7
     C           #1CUST    PARM #1CUST    WQ0001  6        Customer Number
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SD1420S' W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C           W0RTN     ANDNE'Y2U0016'
     C                     SETON                     9931  *
     C                     END
      * Defer confirm
     C                     MOVEL'Y'       W0DCF   1
     C                     END
      *================================================================
     CSR         VAEXIT    ENDSR
      /EJECT
     CSR         VBCKRL    BEGSR
      *================================================================
      * Check reference to Client Details
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Name search required?
     C                     MOVEL#1CUST    WK1X01  1
     C           WK1X01    IFEQ '?'                        Customer Number
      * Field '(KEY) #1CUST' defaulted for 'Customer Number'.
     C                     CALL 'SD0010S'              90  Select Client D
     C                     PARM *BLANK    W0RTN   7
     C           #1CUST    PARM #1CUST    WQ0002  6        Customer Number
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SD0010S' W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C           W0RTN     ANDNE'Y2U0016'
     C                     SETON                     9931  *
     C                     END
      * Defer confirm
     C                     MOVEL'Y'       W0DCF   1
      * No value selected, exit
     C           W0RTN     IFNE *BLANK
     C                     GOTO VBEXIT
     C                     END
     C                     END
      *................................................................
      * If all low order keys not entered, exit
     C           #1CUST    IFEQ *BLANK                     Customer Number
     C                     GOTO VBEXIT
     C                     END
      *
     C           KLVBBB    KLIST
     C                     KFLD           BBCUST           Customer Number
      * Setup key
     C                     MOVEL#1CUST    BBCUST           Customer Number
     C           KLVBBB    CHAIN@BBREBF              9091  *
     C           *IN90     IFEQ '0'
      * Record found - move back any virtuals
     C                     GOTO VBEXIT
     C                     END
      *                                                                                      BUG5139
      ** If not found in SDCUSTPD then check if it is in the                                 BUG5139
      ** shadow file SDCDSHPD                                                                BUG5139
      *                                                                                      BUG5139
     C           *IN90     IFEQ *ON                                                          BUG5139
     C           KLVBBB    CHAIN@BBREBFZ             9091                                    BUG5139
     C           *IN90     IFEQ *OFF                                                         BUG5139
      *                                                                                      BUG5139
      ** Record found - move back any virtuals                                               BUG5139
      *                                                                                      BUG5139
     C                     GOTO VBEXIT                                                       BUG5139
     C                     ENDIF                                                             BUG5139
     C                     ENDIF                                                             BUG5139
      *                                                                                      BUG5139
      * Send message 'Client Details         NF'
     C                     MOVEL'USR0081' ZAMSID
     C                     EXSR ZASNMS
     C                     MOVEL'USR0081' W0RTN
      *================================================================
     CSR         VBEXIT    ENDSR
      /EJECT
     CSR         Y0SET     BEGSR
      *================================================================
      * Set cursor by *SET CURSOR data
      *================================================================
      *================================================================
     CSR         Y0EXIT    ENDSR
      /EJECT
     CSR         Y1SET     BEGSR
      *================================================================
      * Set cursor by *SET CURSOR data
      *================================================================
      *================================================================
     CSR         Y1EXIT    ENDSR
      /EJECT
     CSR         Y8TST     BEGSR
      *================================================================
      * Test cursor
      *================================================================
     C           @#DFMT    IFEQ '#RCDKEY'
      * KEY Screen
     C                     Z-ADD@#RWCL    ZINPOS  50
     C           ZINPOS    DIV  256       W0CRW
     C                     MVR            W0CCL
     C                     END
     C           @#DFMT    IFEQ '#RCDDTL1'
      * DETAIL Screen
     C                     Z-ADD@#RWCL    ZINPOS  50
     C           ZINPOS    DIV  256       W0CRW
     C                     MVR            W0CCL
     C                     END
      *================================================================
     CSR         Y8EXIT    ENDSR
      /EJECT
     CSR         Y9CLR     BEGSR
      *================================================================
      * Clear *SET CURSOR data
      *================================================================
      *================================================================
     CSR         Y9EXIT    ENDSR
      /EJECT
     CSR         ZASNMS    BEGSR
      *================================================================
      * Send message to program's message queue
      *================================================================
     C           ZAPGMQ    IFEQ *BLANK
     C                     MOVEL##PGM     ZAPGMQ
     C                     END
      * If no message file specified, use default
     C           ZAMSGF    IFEQ *BLANK
     C                     MOVELZADFMF    ZAMSGF
     C                     END
     C                     CALL 'Y2SNMGC'
     C                     PARM           ZAPGMQ 10        Program queue
     C                     PARM           ZAPGRL  5        Rel queue
     C                     PARM           ZAMSID  7        Message ID
     C                     PARM           ZAMSGF 10        Message file
     C                     PARM           ZAMSDA132        Message data
     C                     PARM           ZAMSTP  7        Message type
      * Clear all fields for default mechanism next time
     C                     MOVEL*BLANK    ZAPGMQ
     C                     MOVEL*BLANK    ZAPGRL
     C                     MOVEL*BLANK    ZAMSID
     C                     MOVEL*BLANK    ZAMSGF
     C                     MOVEL*BLANK    ZAMSDA
     C                     MOVEL*BLANK    ZAMSTP
      *================================================================
     CSR         ZAEXIT    ENDSR
      /EJECT
     CSR         ZHHPKY    BEGSR
      *================================================================
      * Display HELP text
      *================================================================
      * Signal help request
     C                     MOVEL'Y'       W0HLP   1
      *
      * Extract cursor row and column
     C           @#RWCL    DIV  256       ZHCSRW  50       Row
     C                     MVR            ZHCSCL  50       Column
      *
      * Save cursor position for redisplay
     C                     Z-ADDZHCSRW    ZZCSRW  30       Row
     C                     Z-ADDZHCSCL    ZZCSCL  30       Column
      *
      *
     C                     CALL 'YDDSHPR'
     C                     PARM ##PGM     W0HPMB 10        Help text sourc
     C                     PARM *BLANK    YYHPFL 10        Help text file
     C                     PARM *BLANK    YYHPLB 10        Help text libra
     C                     PARM           W0RTN   7
     C                     PARM '*START'  YYHLVN 10        Help label
     C                     PARM '*NORMAL' YYUSOP 10        Options
     C                     PARM ZHCSRW    YYRW    50       Row
     C                     PARM ZHCSCL    YYCL    50       Column
     C                     PARM 1         YYLGCT  50       # of grps
     C                     PARM W0GRP     YYLGVN 10        Label grps
      *
      * Clear set cursor DDS indicator
     C  N94                MOVEL'OFF'     WCSRLC
     C  N94                SETON                     94    *
      *================================================================
     CSR         ZHEXIT    ENDSR
      /EJECT
     CSR         ZXEXPG    BEGSR
      *================================================================
      * Cancel and exit from key screen
      *================================================================
      * USER: Exit program processing
      * 00/Copy Member SD1421REPP - Customer Marketing Groups  *
     C*Edit Cust Marketing GroupExit Program Processing
     C/COPY WNCPYSRC,SD1421REPP
      * CASE: KEY.*CMD key is *Exit
     C           *IN03     IFEQ '1'                        *IF
     C                     MOVEL'Y2U9999' P0RTN            *Return code
     C                     EXSR ZYEXPG
     C                     END                             *FI
     C                     MOVEL*BLANK    P0RTN
     C                     EXSR ZYEXPG
      *================================================================
     CSR         ZXEXIT    ENDSR
      /EJECT
     CSR         ZYEXPG    BEGSR
      *================================================================
      * Exit program: Direct
      *================================================================
      * ROLLBACK any uncommitted DBF changes
     C           CSC022    IFEQ 'N'                                                           CSC022
     C                     ROLBK                       90
     C                     ELSE                                                               CSC022
     C           WSKIP     IFNE 'Y'                                                           CSC022
     C                     ROLBK                       90                                     CSC022
     C                     ELSE                                                               CSC022
     C                     SETON                     U7U8                                     CSC022
     C                     ENDIF                                                              CSC022
     C                     ENDIF                                                              CSC022
      *
      * Terminate program
     C                     SETON                     LR
      *
      * Exit program
     C                     RETRN
      *
      *================================================================
     CSR         ZYEXIT    ENDSR
      /EJECT
     CSR         ZZINIT    BEGSR
      *================================================================
      * Initialisation
      *================================================================
      *                                                                                       CSC022
      ** Access SAR details file to determine if CSC022 is on.                                CSC022
      *                                                                                       CSC022
     C                     MOVE 'N'       CSC022  1                                           CSC022
     C                     MOVE 'N'       WSKIP   1                                           CSC022
      *                                                                                       CSC022
     C                     CALL 'AOSARDR0'                                                    CSC022
     C                     PARM *BLANKS   @RTCD   7                                           CSC022
     C                     PARM '*VERIFY' @OPTN   7                                           CSC022
     C                     PARM 'CSC022'  @SARD   6                                           CSC022
     C           SCSARD    PARM SCSARD    DSFDY                                               CSC022
      *                                                                                       CSC022
     C           @RTCD     IFNE *BLANKS                                                       CSC022
     C           @RTCD     ANDNE'*NRF   '                                                     CSC022
     C                     MOVEL'SCSARDPD'DBFILE                                              CSC022
     C                     Z-ADD1         DBASE                                               CSC022
     C                     MOVEL'CSC022'  DBKEY                                               CSC022
     C                     EXSR *PSSR                                                         CSC022
     C                     ENDIF                                                              CSC022
      *                                                                                       CSC022
     C           @RTCD     IFEQ *BLANKS                                                       CSC022
     C                     MOVE 'Y'       CSC022                                              CSC022
     C           *NAMVAR   DEFN SCCMTJOB  SCCMT                                               CSC022
     C                     IN   SCCMT                                                         CSC022
      *                                                                                       CSC022
     C           WCMTNO    IFGT 0                                                             CSC022
     C                     MOVEAWCMTJB    WCMTAR                                              CSC022
     C           ##JOB     LOKUPWCMTAR                   10                                   CSC022
     C           *IN10     IFEQ *ON                                                           CSC022
     C                     MOVE 'Y'       WSKIP                                               CSC022
     C                     ENDIF                                                              CSC022
     C                     ENDIF                                                              CSC022
     C                     ENDIF                                                              CSC022
      *                                                                                       CSC022
     C           W0ICL     IFEQ *BLANK
     C                     MOVEL'Y'       W0ICL   1        *Initial call
     C                     ELSE
     C                     MOVEL'N'       W0ICL
     C                     END
     C                     MOVE *BLANK    P0RTN
     C                     MOVE *BLANK    W0RTN   7
     C                     MOVEL*BLANK    W0RSL   1
     C                     MOVEL*BLANK    W0RSF   1
     C                     MOVEL*ZEROS    W0RTW   90
     C                     MOVEL'400'     W0ENV   3
      * Setup job date/time
      *
     C                     Z-ADDUDATE     ##JDT
      * Set century digit (If YY prior to 1940 treat as 20YY)
     C           ##JYY     IFLT 40
     C                     Z-ADD1         ##JCC
     C                     ELSE
     C                     Z-ADD0         ##JCC
     C                     END
     C                     TIME           ##JTM
      * Update screen time
     C                     TIME           ##TME   60
      * Obtain default message file
     C           *NAMVAR   DEFN Y2MGFLA   ZADFMF 10
     C                     IN   ZADFMF
      * Define work field Group Code
     C                     MOVEL*BLANK    WUGPCD  4
      * Define work field Saved group 1
     C                     MOVEL*BLANK    WUSGP1  4
      * Define work field Group Description
     C                     MOVEL*BLANK    WUGPDS 30
      * Define work field Saved group 2
     C                     MOVEL*BLANK    WUSGP2  4
      * Define work field Saved group 3
     C                     MOVEL*BLANK    WUSGP3  4
      * Define work field Saved group 4
     C                     MOVEL*BLANK    WUSGP4  4
      * Define work field Saved group 5
     C                     MOVEL*BLANK    WUSGP5  4
      * Define work field Test ? in Key Field
     C                     MOVEL*BLANK    WUTQKF  1
      * Define work field Set Number
     C                     MOVEL*BLANK    WUSNBR  1
      * Define work field Run day number
     C                     Z-ADD*ZERO     WURDNB  50
      * Define work field Window processing requir.
     C                     MOVEL*BLANK    WUWDPR  1
      * Define work field No. of Records
     C                     Z-ADD*ZERO     WUNORC  50
      * Define work field No. of Amends
     C                     Z-ADD*ZERO     WUNOAM  50
      * Define work field No. of Deletes
     C                     Z-ADD*ZERO     WUNODL  50
      * Define work field No. of Inserts
     C                     Z-ADD*ZERO     WUNOIN  50
      * Define work field S01212
     C                     MOVEL*BLANK    WUMFTS  1
      * Define work field Deleted Data Record Pt1
     C                     MOVEL*BLANK    WUDR01250
      * Define work field Deleted Data Record Pt2
     C                     MOVEL*BLANK    WUDR02250
      * Define work field Deleted Data Record Pt3
     C                     MOVEL*BLANK    WUDR03250
      * Define work field Deleted Data Record Pt4
     C                     MOVEL*BLANK    WUDR04250
      * Define work field Deleted Data Record Pt5
     C                     MOVEL*BLANK    WUDR05250
      * Define work field Deleted Data Record Pt6
     C                     MOVEL*BLANK    WUDR06250
      * Define work field Deleted Data Record Pt7
     C                     MOVEL*BLANK    WUDR07250
      * Define work field Deleted Data Record Pt8
     C                     MOVEL*BLANK    WUDR08250
      * Define work field Deleted Data Record Pt9
     C                     MOVEL*BLANK    WUDR09250
      * Define work field Deleted Data Record Pt10
     C                     MOVEL*BLANK    WUDR00250
      * Define work field Deleted Data Record Pt11
     C                     MOVEL*BLANK    WUDR11250
      * Define work field Deleted Data Record Pt12
     C                     MOVEL*BLANK    WUDR12250
      * Define work field Midas Run Date
     C                     MOVEL*BLANK    WUMRDT  7
      * Define work field Set Up Complete
     C                     MOVEL*BLANK    WUSUC   1
      * Define work field Date format flag
     C                     MOVEL*BLANK    WUDFF   1
      * Define work field Multi-branching Indicator
     C                     MOVEL*BLANK    WUMBIN  1
      * Flag no *SET CURSOR in the program
     C                     MOVE 'N'       YSETCS  1
     C                     MOVE *BLANK    WCSRLC  3
      * Open files
      * Begin commit control
     C                     CALL 'Y2BGCMC'
     C                     PARM           W0RTN   7
     C           W0RTN     IFNE *BLANK
     C           W0RTN     ANDNE'CPF8351'
     C                     EXSR ZYEXPG
     C                     END
      * Define *Synon program work fields
     C                     MOVEL*BLANKS   W0CFL  10        *Cursor field
     C                     Z-ADD*ZEROS    W0CRW   50       *Cursor row
     C                     Z-ADD*ZEROS    W0CCL   50       *Cursor column
      * Move main file information to JOB context
     C                     MOVE @1FFL     ZZFFL  10        Main file name
     C                     MOVE @1FLB     ZZFLB  10        Main file lib
     C                     MOVE @1FMB     ZZFMB  10        Main file mbr
     C                     MOVE ZZFFL     @1FFL  10
     C                     MOVE ZZFLB     @1FLB  10
     C                     MOVE ZZFMB     @1FMB  10
     C                     CALL 'Y2QLVNR'
     C                     PARM           ZZFFL  10
     C                     PARM           ZZFLB  10
     C                     PARM           ZZFQL  21        LIBRARY/FILE
     C                     OPEN SD1421R#
     C                     OPEN SDCMRKL1
     C                     OPEN SDCGRPL1
     C                     OPEN SDCUSTL1
     C                     OPEN SDMMODL1
     C                     OPEN SDCDSHL1                                                     BUG5139
     C                     OPEN SDCMRKL0
     C                     OPEN SDFCTLL0
     C                     MOVEL'N'       W0PMT   1
     C                     MOVEL'CHG'     W0PMD   3
     C                     MOVEL*BLANK    W0GRP   1
      * USER: Initialize program
      * Start of S01459
      * Remove the last amend box and creation parameters functions
      * SD1421R precompiler - Customer Marketing Groups  *
      * End of S01459
      * Copyright Statement 1988 - Standard Functions  *
      * Get Rundate - Rundate  *
     C           *NAMVAR   DEFN           RUNDAT
     C                     IN   RUNDAT
     C                     MOVE MRDT      ##MRDT  7        RUN DATE
     C                     MOVE MRDT      WUMRDT
     C                     MOVE RDNB      WURDNB           RUNDAY NO.
     C                     MOVE SUC       WUSUC            SET UP COMPLT
     C                     MOVE DFF       WUDFF            DTE FMT FLAG
     C                     MOVE MBIN      WUMBIN           MULTI BR. IND
      * Get 'Window required' ind - MIDAS Modules  *
     C                     EXSR TKRVGN
      * Data Strct. Market. Group - Customer Marketing Groups  *
      * Start of change 088433
      * Retrieve Client Marketing - Customer Marketing Groups  *
     C                     EXSR TLRVGN
      * Setup program mode value
      * CASE: PGM.*Return code is *Record already exists
     C           W0RTN     IFEQ 'Y2U0003'                  *IF
     C                     MOVEL'CHG'     W0PMD            *Program mode
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL'ADD'     W0PMD            *Program mode
     C                     END                             *FI
      * End of change 088433
      * 00/Copy Member SD1421RIPG - Customer Marketing Groups  *
     C/COPY WNCPYSRC,SD1421RC03
      *================================================================
     CSR         ZZEXIT    ENDSR
      /EJECT
     CSR         *PSSR     BEGSR
      *****************************************************************
      *                                                               *
      * *PSSR  - Program exception error routine                      *
      *          Called automatically if a program error occurs,      *
      *          or directly by the program code using EXSR.          *
      *          This subroutine DUMPs the program just once.         *
      *                                                               *
      *****************************************************************
      *
      * Core function specific processing.
      *
     C/COPY WNCPYSRC,SD1421RPSC
      *
      * Start of PSSR user point.
      *
     C/COPY WNCPYSRC,SD1421RPS1
      *
      * Standard Midas PSSR processing.
      *
     C/COPY SDCPYSRC,SDPSSRINT
      *
      * End of PSSR user point.
      *
     C/COPY WNCPYSRC,SD1421RPS2
      *
      *================================================================
     CSR                   ENDSR
      *================================================================
** CPY@     : Copyright notice for inclusion in all programs
(c) Finastra International Limited 2001
