     H        1
      *****************************************************************
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas Reset Audit Control TABLETX')
     F*****************************************************************
     F*                                                               *
     F*  Midas - STANDING DATA MODULE
     F*                                                               *
     F*  SD2430 - RESET  TABLETX AUDIT CONTROL                        *
     F******TABLETX*-*RESET**TABLETX*AUDIT*CONTROL*********************
     F*                                                               *
      *  (c) Finastra International Limited 2001                      *
     F*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. E22137             Date 18/05/90              *
      *                                    Date                       *
     F*                                                               *
     F*****************************************************************
     F*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     F*  E22137 - SD2430 REMAMED FROM TABLETX.                        *
     F*                                                               *
     F*****************************************************************
     F*  C R E A T I O N     P A R A M E T E R S                      *
     F*                                                               *
     F*                                                               *
     F*****************************************************************
     FTABLETXLUF  E                    DISK
      *
     E                    CPY@    1   1 80
      *
     C                     MOVEACPY@      BIS@   80
      *
     C                     READ TABLETXL                 30
     C           *IN30     DOWEQ'0'
     C                     ADD  NINS      NREC
     C                     SUB  NDEL      NREC
     C                     Z-ADD*ZEROS    NINS
     C                     Z-ADD*ZEROS    NAMD
     C                     Z-ADD*ZEROS    NDEL
     C                     Z-ADD*ZEROS    LRNO
     C                     UPDATTABLETXF
     C                     READ TABLETXL                 30
     C                     END
     C                     SETON                     LR
     C                     RETRN
**  CPY@
(c) Finastra International Limited 2001
