     H        1   Y
      *****************************************************************
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas SD Portfolio management ICD maintenance')        *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  SD9381R - Portfolio Management ICD Maintenance               *
      *                                                               *
      *  Function:  This program maintaines the portfolio management  *
      *             ICD record.                                       *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *  Last Amend No. CER059             Date 19Jul10               *
      *  Prev Amend No. CER045             Date 20Jul09               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027             Date 09Dec05               *
      *                 CLE025             Date 20Oct03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CPB001             Date 06Jul99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CSD003             Date 27Oct97               *
      *                 CPM005             DATE 06JUN96               *
      *                 CPM004             DATE 15FEB96               *
      *                 S01486 (2)         DATE 21OCT94               *
      *                 S01486             DATE 14JUL94               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER045 - German Features - Reporting Bundesbank (Recompile)  *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CLE025 - Credit Lines (Recompile)                            *
      *  CPB001 - 'Private Banking' Module                            *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - Program removed from SD model.                    *
      *  CPM005 - PM Focus Group R10 Enhancement                      *
      *           New fields - Save Notional FX Deals Ind.            *
      *                      - Notional FX deals Instrument           *
      *                      - Percentage calculation Method          *
      *                      - Display Customer/Portfolio             *
      *  CPM004 - PM Bank Portfolios:                                 *
      *           New field - Portfolios Supported                    *
      *  S01486 - (2) Change control.                                 *
      *           - Add/delete CQQ001 feature when Pool Portfolio     *
      *             flag is amended.                                  *
      *  S01486 - Private Banking development: New program.           *
      *                                                               *
      *****************************************************************
     F*Edit portfolio managementInitialise Program F-spec
     F/COPY WNCPYSRC,SD9381RFPG
     FSD9381R#CF  E                    WORKSTN                        UC
     F                                              KINFDS INFDS#
     F                                              KINFSR *PSSR
      * DSP: Midas SD Portfolio management ICD maintenance
      *
     FSDPORTL1IF  E           K        DISK                           UC
     F                                              KINFDS INFDS1
     F                                              KINFSR *PSSR
      * RTV : Midas SD Portfolio management ICD retrieval
      *
     FSDINDSL1IF  E           K        DISK                           UC
     F                                              KINFDS ID0001
     F                                              KINFSR *PSSR
      * RTV : Local Industry Codes      Retrieval index
      *
     FSDCTRYL1IF  E           K        DISK                           UC
     F                                              KINFDS ID0002
     F                                              KINFSR *PSSR
      * RTV : Country Codes             Retrieval index
      *
     FSDMMODL1IF  E           K        DISK                           UC
     F                                              KINFDS ID0003
     F                                              KINFSR *PSSR
      * RTV : Midas SD Midas module flags retrieval
      *
     FSDPORTL0UF  E           K        DISK                           UC
     F                                              KCOMIT
     F                                              KINFDS ID0004
     F                                              KINFSR *PSSR
      * UPD : Midas SD Portfolio management ICD update
      *
     FSDFCTLL0UF  E           K        DISK                           UC
     F                                              KCOMIT
     F                                              KINFDS ID0005
     F                                              KINFSR *PSSR
      * UPD : Midas SD Standing data controls update
      *
     E* Description     : Copyright notice for inclusion in all programs
     E*
     E********************************************************************
     E                    CPY@    1   1 80               Copyright array
     E*Edit portfolio managementInitialise Program E-spec
     E/COPY WNCPYSRC,SD9381REPG
     I*
     I*
     I* Description     : Copyright notice for inclusion in all programs
     I*
     I*                                                                   S01229
     I/COPY QWINDSRC,SD9380GDTA                                           S01229
     I*                                                                   S01229
     I*Edit portfolio managementInitialise Program I-spec
     I/COPY WNCPYSRC,SD9381RIPG
      /EJECT
      * Data structures:
     IPGMDS     ESDSY2PGDSP
      * Program data structure
     IJBDTTM      DS
      * Job date/time
     I                                        1   70##JDT
     I                                        1   10##JCC
     I                                        2   30##JYY
     I                                        4   50##JMM
     I                                        6   70##JDD
     I                                        8  130##JTM
     I                                        8   90##JHH
     I                                       10  110##JNN
     I                                       12  130##JSS
      * ABO DEFINE LARGE STRING FOR CL CMD
     IYARTCM      DS                            512
     I                                        1   1 DUMMY1
     IINFDS#    E DSY2I#DSP
      * Display file information data structure
      *
     IINFDS1    E DSY2I1DSP
      * File information data structure
      *
     I@1DBRC    E DSSDPORTL0
      * UPD : Midas SD Portfolio management ICD update
      * Current/previous master file format fields for change control
      *
     I#1DBRC      DS                            118
      * Stored master file format fields
     I                                        1   1 #1DB1
      *
     IUUSDY     E DSDSSDY
     I*
     I* 800 byte DS for incoming data from Access Program
     I*
     ID@PLIN    E DSSDPLINPD
     I*
     I* DS TO HOLD DATA READ FROM FILE TO BE USED WITHIN THE PROGRAM
     I*
     IYARDCS      DS                            118
     IQSDFC1    E DSSDFCTLL0
      * UPD : Midas SD Standing data controls update
     IYBRDCS      DS                             22
     IA@CPY       DS
     I* Copyright array
     I                                        1  80 CPY@
     IRUNDAT      DS
     I                                        1   7 MRDT
     I                                    P   8  100RDNB
     I                                       11  11 SUC
     I                                       12  12 DFF
     I                                       13  13 MBIN
     IID0001      DS                            528
      * File information data structure
      *
     IID0002      DS                            528
      * File information data structure
      *
     IID0003      DS                            528
      * File information data structure
      *
     IID0004      DS                            528
      * File information data structure
      *
     IID0005      DS                            528
      * File information data structure
      *
      /EJECT
      * Parameter declarations
     IP1PARM      DS                             10
      * KEY: Midas SD Portfolio management ICD retrieval
      * I : RST Portfolio Manage ICD Key
     I                                        1  10 P1PORT
     IP2PARM      DS
      * O :  *Return code
     I                                        1   7 P2RTN
     IP3PARM      DS
      * B : MAP Work Return code
     I                                        1   5 P3WRTC
     I            DS
     I                                        1 132 ZAMSDA
      * Message data for 'Liabilities incl reqd'
      * Liabilities Included
     I                                        1   1 ZA0001
      * Message data for 'Liabilities is invalid'
      * Liabilities Included
     I                                        1   1 ZA0002
      * Message data for 'High level secur is reqd'
      * High Level Security
     I                                        1   1 ZA0003
      * Message data for 'High level sec invalid'
      * High Level Security
     I                                        1   1 ZA0004
      * Message data for 'Trade/Value Date is reqd'
      * Trade/Value Date Position
     I                                        1   1 ZA0005
      * Message data for 'Trade/Value date invalid'
      * Trade/Value Date Position
     I                                        1   1 ZA0006
      * Message data for 'Portfolios Supported INV'
      * Portfolios Supported
     I                                        1   1 ZA0007
      * Message data for 'Charges Day Basis is reqd'
      * Charges Day Basis SCR
     I                                        1   1 ZA0008
      * Message data for 'Charges day basis invalid'
      * Charges Day Basis SCR
     I                                        1   1 ZA0009
      * Message data for 'Charges Divisor Bas reqd'
      * Charges Divisor Basis SCR
     I                                        1   1 ZA0010
      * Message data for 'Charges divisor is invald'
      * Charges Divisor Basis SCR
     I                                        1   1 ZA0011
      * Message data for 'Display non-portf is reqd'
      * Dsp Non-Portfolio Picture
     I                                        1   1 ZA0012
      * Message data for 'Display non-port is invld'
      * Dsp Non-Portfolio Picture
     I                                        1   1 ZA0013
      * Message data for 'Assign Ref must be blank'
      * Ref Attached to 9997
     I                                        1   4 ZA0014
      * Message data for 'Assign Ref is required'
      * Ref Attached to 9997
     I                                        1   4 ZA0015
      * Message data for 'Narrative must be blank'
      * Narr Attached to 9997
     I                                        1  20 ZA0016
      * Message data for 'Narrative is required'
      * Narr Attached to 9997
     I                                        1  20 ZA0017
      * Message data for 'Display comb portf reqd'
      * Dsp Consolidated P/folio
     I                                        1   1 ZA0018
      * Message data for 'Dsp combined portf invald'
      * Dsp Consolidated P/folio
     I                                        1   1 ZA0019
      * Message data for 'Assign ref R998 not reqd'
      * Ref Attached to 9998
     I                                        1   4 ZA0020
      * Message data for 'Assigned Reference reqd'
      * Ref Attached to 9998
     I                                        1   4 ZA0021
      * Message data for 'Narrative is not required'
      * Narr Attached to 9998
     I                                        1  20 ZA0022
      * Message data for 'Narrative 998 is required'
      * Narr Attached to 9998
     I                                        1  20 ZA0023
      * Message data for 'Ref 9999 must be entered'
      * Ref Attached to 9999
     I                                        1   4 ZA0024
      * Message data for 'Narrative 9999 is requird'
      * Narr Attached to 9999
     I                                        1  20 ZA0025
      * Message data for 'Default Ins Code is reqd'
      * Default Instrument Type
     I                                        1   3 ZA0026
      * Message data for 'Dft Ins Code invalid'
      * Default Instrument Type
     I                                        1   3 ZA0027
      * Message data for 'Show Fees & Charges reqd'
      * Show Fees and Charges
     I                                        1   1 ZA0028
      * Message data for 'Show fees/charges invalid'
      * Show Fees and Charges
     I                                        1   1 ZA0029
      * Message data for 'Dft Industry Code is reqd'
      * Local Industry Code
     I                                        1   3 ZA0030
      * Message data for 'Dft Industry code invalid'
      * Local Industry Code
     I                                        1   3 ZA0031
      * Message data for 'Show depot m is required'
      * Show Capital Chg Charges
     I                                        1   1 ZA0032
      * Message data for 'Show DM charges invalid'
      * Show Capital Chg Charges
     I                                        1   1 ZA0033
      * Message data for 'Dft Country code is reqd'
      * Country Code
     I                                        1   2 ZA0034
      * Message data for 'Dft Country code invalid'
      * Country Code
     I                                        1   2 ZA0035
      * Message data for 'Unearened Int is required'
      * Unearned Int in Capital
     I                                        1   1 ZA0036
      * Message data for 'Unearened Int invalid'
      * Unearned Int in Capital
     I                                        1   1 ZA0037
      * Message data for 'Retention of Dlt cust req'
      * Retain Deleted Cust Info
     I                                        1   2 ZA0038
      * Message data for 'Retain deleted cust numbr'
      * Retain Deleted Cust Info
     I                                        1   2 ZA0039
      * Message data for 'Retn dltd cust info GT 0'
      * Retain Deleted Cust Info
     I                                        1   2 ZA0040
      * Message data for 'Pool Portfolios is reqd'
      * Pool Portfolio Processing
     I                                        1   1 ZA0041
      * Message data for 'Pool portfolios invalid'
      * Pool Portfolio Processing
     I                                        1   1 ZA0042
      * Message data for 'CQQ001 Text'
      * Message data for 'Pool p/folio update fail'
      * Pool Portfolio Processing
     I                                        1   1 ZA0043
      * Message data for 'Report Cap Charge requird'
      * Report Cap Chgs Separate
     I                                        1   1 ZA0044
      * Message data for 'Report Cap Separate invld'
      * Report Cap Chgs Separate
     I                                        1   1 ZA0045
      * Message data for 'Accptbl diff. must be Num'
      * Acceptable Difference SCR
     I                                        1   3 ZA0046
      * Message data for 'Save Notnal FX Deals REQ'
      * Save Notional FX Deals
     I                                        1   1 ZA0047
      * Message data for 'Save Notionl FX DealsINV'
      * Save Notional FX Deals
     I                                        1   1 ZA0048
      * Message data for 'Notionl FX Deal Inst REQ'
      * Notional FX Deals Instrmt
     I                                        1   3 ZA0049
      * Message data for 'Notionl FX Deal Inst INV'
      * Notional FX Deals Instrmt
     I                                        1   3 ZA0050
      * Message data for 'Notionl FX Deal Inst NRQ'
      * Notional FX Deals Instrmt
     I                                        1   3 ZA0051
      * Message data for 'Percentge Calc. Meth. REQ'
      * Percentage Calc. Method
     I                                        1   1 ZA0052
      * Message data for 'Percentge Calc. Meth. INV'
      * Percentage Calc. Method
     I                                        1   1 ZA0053
      * Message data for 'Disp Cust/Portfolio REQ'
      * Display Customer/Portflio
     I                                        1   1 ZA0054
      * Message data for 'Disp Cust/Portfolio  INV'
      * Display Customer/Portflio
     I                                        1   1 ZA0055
      * Message data for 'Database Error (ICD)'
      * Filename
     I                                        1  10 ZA0056
      /EJECT
      *****************************************************************
      * Entry parameters
     C           *ENTRY    PLIST
     C                     PARM           P0RTN   7
     C                     PARM           P1PARM           KEY: Portfolio
     C           P2RTN     PARM P2RTN     WP0001  7        *Return code
     C           P3WRTC    PARM P3WRTC    WP0002  5        Work Return cod
      *****************************************************************
      * Initialize
     C                     EXSR ZZINIT
      *
      * Display and process key screen
     C                     EXSR BADSKY
      * Terminate program
     C                     EXSR ZXEXPG
      *****************************************************************
      /EJECT
     CSR         BADSKY    BEGSR
      *================================================================
      * Display and process key screen
      *================================================================
      * Initialize key screen
     C                     EXSR MDIZ#K
      * Bypass first display of key screen is possible
     C                     MOVEL'Y'       W0BYP   1
      * Signal start of transaction
     C                     MOVEL'Y'       W0TRN   1
     C           W0TRN     DOWEQ'Y'
     C           W0TRN     OREQ 'K'
      * Ensure transaction continues (if reset)
     C                     MOVEL'Y'       W0TRN   1
      * Conduct screen conversation
     C           W0TRN     DOWEQ'Y'
      * Is bypass key screen still viable?
     C           W0BYP     IFEQ 'Y'
     C           #1PORT    IFEQ *BLANK                     Portfolio Manag
      * One or more key fields is blank
     C           *IN05     OREQ '1'
      * HOME: Reset screen fields
     C                     MOVEL'N'       W0BYP
     C                     END
     C                     END
      * Bypass key screen
     C           W0BYP     IFNE 'Y'
      * Display key screen
     C                     EXSR BBEXFM
     C                     END
      * Cancel key screen bypass
     C                     MOVEL'N'       W0BYP
      * Process response to key screen
      * Cancel & exit program
     C   03                CAS            ZXEXPG
      * HOME: Reset screen fields
     C   05                CAS            BDHMKY
      * Process key screen input
     C                     CAS            BEPRKY
     C                     END
     C           W0TRN     DOWEQ'R'
     C                     MOVEL'Y'       W0TRN
     C                     EXSR BEPRKY
     C                     END
      *
     C                     END
     C                     END
      *================================================================
     CSR         BAEXIT    ENDSR
      /EJECT
     CSR         BBEXFM    BEGSR
      *================================================================
      * Display key screen and process HELP requests
      *================================================================
      * Set screen conditioning indicators
     C                     EXSR GADSAK
      * Update screen time
     C                     TIME           ##TME
     C           W0HLP     DOUEQ'N'
     C                     MOVEL'N'       W0HLP   1
     C                     MOVE *IN25     HELP25  1
     C                     MOVE *ALL'0'   ##OFF  30
     C                     MOVEA##OFF     *IN,1
     C                     MOVE HELP25    *IN25
      * PUTOVR unless conditioned fields change
     C                     SETON                         86*
     C           *IN89     IFNE BBIN89
     C                     SETOF                         86*
     C                     END
     C                     MOVE *IN89     BBIN89  1
      * Set cursor by *SET CURSOR data
     C           YSETCS    IFEQ 'Y'
     C                     EXSR Y0SET
     C                     END
     C                     WRITE#MSGCTL
     C                     WRITE#CMDTXT1
     C                     EXFMT#RCDKEY
      * Test cursor
     C                     EXSR Y8TST
      * Clear set cursor DDS indicator
     C           WCSRLC    IFEQ 'OFF'
     C                     SETOF                     94    *
     C                     END
     C                     MOVE *BLANK    WCSRLC
      * If help requested, display help text
     C   25                EXSR ZHHPKY
     C                     END
      * Update job time
     C                     TIME           ##JTM
      * Clear messages from program message queue
     C                     CALL 'Y2CLMSC'
     C                     PARM ##PGM     ZAPGMQ 10
     C                     PARM '*SAME'   ZAPGRL  5
      * Reset first message only flag
     C                     MOVEL'Y'       ZAFSMS  1
      * Reset global error indicator
     C                     SETOF                         99*
     C           YSETCS    IFEQ 'Y'
     C                     EXSR Y9CLR
     C                     END
      *================================================================
     CSR         BBEXIT    ENDSR
      /EJECT
     CSR         BDHMKY    BEGSR
      *================================================================
      * Process HOME key
      *================================================================
     C                     MOVEL'N'       W0TRN
      *================================================================
     CSR         BDEXIT    ENDSR
      /EJECT
     CSR         BEPRKY    BEGSR
      *================================================================
      * Process key screen input
      *================================================================
      * Initialise detail screen
     C                     EXSR MAIZ#1
      * Validate key fields
     C                     EXSR BFVLKY
     C           *IN99     CABEQ'1'       BEEXIT
      * Check for existing record
     C           KRTV      KLIST
     C                     KFLD           FCPORT           Portfolio Manag
      * Setup key
     C                     MOVEL#1PORT    FCPORT           Portfolio Manag
     C           KRTV      CHAIN@PORTL1              9091  *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     SETON                     99    *
     C                     GOTO BEEXIT
     C                     END                             FI 91
      *
      * If record does not exist, error
     C           *IN90     IFEQ '1'
     C                     SETON                     99    *
      * Send message 'Portfolio Management I NF'
     C                     MOVEL'USR2284' ZAMSID
     C                     EXSR ZASNMS
     C                     ELSE
     C                     EXSR MBFL#1
      * CALC: Detail screen function fields
      * 00/Copy member SD9381RSFF - Portfolio Management ICD  *
     C*Edit portfolio managementCalc Detail Function Flds
     C/COPY WNCPYSRC,SD9381RSFF
      * USER: Initialize detail screen (existing record)
      * 00/Copy member SD9381RISE - Portfolio Management ICD  *
     C*Edit portfolio managementInitialise Dtl Exist Rcd
     C/COPY WNCPYSRC,SD9381RISE
      * Start CPM004
      * Portfolios Supported
      * CASE: DTL.Portfolios Supported is Blank
     C           #1PORS    IFEQ *BLANK                     *IF
     C                     MOVEL'C'       #1PORS           Portfolios Supp
     C                     END                             *FI
      * End CPM004
      * Day basis
      * CASE: DB1.Charging Day Basis is Zero
     C           FCCDYB    IFEQ *ZERO                      *IF
     C                     MOVEL*BLANK    #DCDBS           Charges Day Bas
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVELFCCDYB    #DCDBS           Charges Day Bas
     C                     END                             *FI
      * Divisor basis
      * CASE: DB1.Charging Divisor Basis is Zero
     C           FCCDVB    IFEQ *ZERO                      *IF
     C                     MOVEL*BLANK    #DCHDB           Charges Divisor
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVELFCCDVB    #DCHDB           Charges Divisor
     C                     END                             *FI
      * Acceptable difference
      * CASE: DB1.Acceptable Difference is Zero
     C           FCADIF    IFEQ *ZERO                      *IF
     C                     MOVEL*BLANK    #DACPD           Acceptable Diff
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL*BLANK    WUZASF           ZALIGN Screen F
     C                     MOVELFCADIF    WUZASF           ZALIGN Screen F
      * Call ZALIGN & ZEDIT
      * ZALIGN Screen Field - Standard Functions  *
     C                     CALL 'ZALIGN'               90  ZALIGN Screen F
     C           W0RTN     PARM W0RTN     WQ0001  7        *Return code
     C           WUZASF    PARM WUZASF    WQ0002 16        ZALIGN Screen F
     C                     PARM *ZERO     WQ0003  10       ZALIGN No Of De
     C                     PARM 3         WQ0004  20       ZALIGN No Of Di
     C           WUZAFF    PARM *BLANK    WQ0005 16        ZALIGN File Fie
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'ZALIGN'  W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C                     SETON                     99    *
     C                     END
      * CASE: PGM.*Return code is Old Table Error
     C           W0RTN     IFEQ '*ERROR*'                  *IF
     C                     MOVEL'Y'       WUERCD           Err Code
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL'N'       WUERCD           Err Code
      * ZEDIT Screen Field - Standard Functions  *
     C                     CALL 'ZEDIT'                90  ZEDIT Screen Fi
     C           WUZASF    PARM WUZASF    WQ0006 16        ZALIGN Screen F
     C                     PARM *ZERO     WQ0007  10       ZALIGN No Of De
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'ZEDIT'   W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
     C                     END                             *FI
      * Zalign acceptable differe - Portfolio Management ICD  *
     C*
     C                     MOVE WUZASF    #DACPD
     C*
     C                     END                             *FI
      * Start CPM005
      * When PM Focus Group enhancement is switched on
      * CASE: WRK.CPM005 is Present
     C           WUXUST    IFEQ 'Y'                        *IF
      * Save Notional FX Deals Indicator - if Blank set to default value
      * CASE: DTL.Save Notional FX Deals is Blank
     C           #1SAVI    IFEQ *BLANK                     *IF
     C                     MOVEL'N'       #1SAVI           Save Notional F
     C                     END                             *FI
      * Percentage Calculation Method - if Blank set to default value
      * CASE: DTL.Percentage Calc. Method is Blank
     C           #1PCAM    IFEQ *BLANK                     *IF
     C                     MOVEL'N'       #1PCAM           Percentage Calc
     C                     END                             *FI
      * Display Customer/Portfolio - if Blank set to default value
      * CASE: DTL.Display Customer/Portflio is Blank
     C           #1DCPD    IFEQ *BLANK                     *IF
     C                     MOVEL'P'       #1DCPD           Display Custome
     C                     END                             *FI
     C                     END                             *FI
      * End CPM005
     C                     END
      *
      *..................................................
     C   99                GOTO BEEXIT
      * No error: Display and process details
     C                     EXSR CADSDA
      *
      *================================================================
     CSR         BEEXIT    ENDSR
      /EJECT
     CSR         BFVLKY    BEGSR
      *================================================================
      * Validate key fields
      *================================================================
      * USER: Validate key screen
      * 00/Copy member SD9381RVKS - Portfolio Management ICD  *
     C*Edit portfolio managementValidate Key Screen
     C/COPY WNCPYSRC,SD9381RVKS
      *================================================================
     CSR         BFEXIT    ENDSR
      /EJECT
     CSR         CADSDA    BEGSR
      *================================================================
      * Display and process detail screen
      *================================================================
      * Conduct detail screen conversation
      * - repeat until screen control flag is reset:
     C           W0TRN     DOWEQ'Y'
      * Display detail screen
     C                     EXSR CBEXFM
      * Process response to detail screen
      * Cancel & exit program
     C   03                CAS            ZXEXPG
      * Redisplay previous screen
     C   12                CAS            CCDSPV
      * HOME: Reset screen fields
     C   05                CAS            CCDSPV
      * Process detail screen input
     C                     CAS            CFPRSC
     C                     END
     C           W0TRN     IFEQ 'R'
     C           W0PMD     IFEQ 'ADD'
     C                     EXSR MAIZ#1
     C                     END
     C                     END
      *
     C                     END
      *================================================================
     CSR         CAEXIT    ENDSR
      /EJECT
     CSR         CBEXFM    BEGSR
      *================================================================
      * Display screen and process HELP requests
      *================================================================
      * Set screen conditioning indicators
     C                     EXSR GBDSAD
      * Update screen time
     C                     TIME           ##TME
     C           W0HLP     DOUEQ'N'
     C                     MOVEL'N'       W0HLP   1
     C                     MOVE *IN25     HELP25  1
     C                     MOVE *ALL'0'   ##OFF  30
     C                     MOVEA##OFF     *IN,1
     C                     MOVE HELP25    *IN25
      * PUTOVR unless conditioned fields change
     C                     SETON                         86*
     C           *IN89     IFNE CBIN89
     C                     SETOF                         86*
     C                     END
     C                     MOVE *IN89     CBIN89  1
      * Set cursor by *SET CURSOR data
     C           YSETCS    IFEQ 'Y'
     C                     EXSR Y1SET
     C                     END
     C                     WRITE#MSGCTL
     C                     WRITE#CMDTXT2
     C                     EXFMT#RCDDTL1
      * Test cursor
     C                     EXSR Y8TST
      * Clear set cursor DDS indicator
     C           WCSRLC    IFEQ 'OFF'
     C                     SETOF                     94    *
     C                     END
     C                     MOVE *BLANK    WCSRLC
      * If help requested, display help text
     C   25                EXSR ZHHPKY
     C                     END
      * Update job time
     C                     TIME           ##JTM
      * Clear messages from program message queue
     C                     CALL 'Y2CLMSC'
     C                     PARM ##PGM     ZAPGMQ 10
     C                     PARM '*SAME'   ZAPGRL  5
      * Reset first message only flag
     C                     MOVEL'Y'       ZAFSMS  1
      * Reset global error indicator
     C                     SETOF                         99*
     C           YSETCS    IFEQ 'Y'
     C                     EXSR Y9CLR
     C                     END
      *================================================================
     CSR         CBEXIT    ENDSR
      /EJECT
     CSR         CCDSPV    BEGSR
      *================================================================
      * Redisplay previous screen
      *================================================================
      * USER: Process key screen request
      * 00/Copy member SD9381RPKR - Portfolio Management ICD  *
     C*Edit portfolio managementProcess Key Screen Rqst
     C/COPY WNCPYSRC,SD9381RPKR
      * Bypass KEY screen if F12 is pressed on detail screen
     C                     MOVEL'PREV'    P0RTN            *Return code
     C                     EXSR ZYEXPG
     C   05                MOVEL'R'       W0TRN
     C   12                MOVEL'K'       W0TRN
      *================================================================
     CSR         CCEXIT    ENDSR
      /EJECT
     CSR         CFPRSC    BEGSR
      *================================================================
      * Validate record
      *================================================================
      * Confirm/update is not deferred
     C                     MOVEL'N'       W0DCF   1
      * Validate details
     C                     EXSR DCVLDL
      * QUIT if error:
     C   99                GOTO CFEXIT
      * Defer confirm/update requested
     C           W0DCF     CABEQ'Y'       CFEXIT
      * No error: update record
     C                     EXSR EBPR##
      *================================================================
     CSR         CFEXIT    ENDSR
      /EJECT
     CSR         DCVLDL    BEGSR
      *================================================================
      * Validate details
      *================================================================
      * Validate Liabilities Included
     C                     MOVEL*BLANK    W0RTN
     C                     MOVEL#1LIAB    W0NSRQ  1        Liabilities Inc
      * Name search required?
     C           W0NSRQ    IFEQ '?'
     C                     CALL 'Y2VLLSR'              90  *
     C                     PARM           W0RTN   7
     C                     PARM 1184038   Y2LSNO  70
     C           #1LIAB    PARM #1LIAB    W0EXVL 20        Liabilities Inc
      * Defer confirm
     C                     MOVEL'Y'       W0DCF   1
     C                     END
      *
      * Validate High Level Security
     C                     MOVEL*BLANK    W0RTN
     C                     MOVEL#1HLVS    W0NSRQ  1        High Level Secu
      * Name search required?
     C           W0NSRQ    IFEQ '?'
     C                     CALL 'Y2VLLSR'              90  *
     C                     PARM           W0RTN   7
     C                     PARM 1184043   Y2LSNO  70
     C           #1HLVS    PARM #1HLVS    W0EXVL 20        High Level Secu
      * Defer confirm
     C                     MOVEL'Y'       W0DCF   1
     C                     END
      *
      * Validate Trade/Value Date Position
     C                     MOVEL*BLANK    W0RTN
     C                     MOVEL#1TVPS    W0NSRQ  1        Trade/Value Dat
      * Name search required?
     C           W0NSRQ    IFEQ '?'
     C                     CALL 'Y2VLLSR'              90  *
     C                     PARM           W0RTN   7
     C                     PARM 1184048   Y2LSNO  70
     C           #1TVPS    PARM #1TVPS    W0EXVL 20        Trade/Value Dat
      * Defer confirm
     C                     MOVEL'Y'       W0DCF   1
     C                     END
      *
      * Validate Portfolios Supported
     C                     MOVEL*BLANK    W0RTN
     C                     MOVEL#1PORS    W0NSRQ  1        Portfolios Supp
      * Name search required?
     C           W0NSRQ    IFEQ '?'
     C                     CALL 'Y2VLLSR'              90  *
     C                     PARM           W0RTN   7
     C                     PARM 1197486   Y2LSNO  70
     C           #1PORS    PARM #1PORS    W0EXVL 20        Portfolios Supp
      * Defer confirm
     C                     MOVEL'Y'       W0DCF   1
     C                     END
      *
      * Validate Charges Day Basis SCR
     C                     MOVEL*BLANK    W0RTN
     C                     MOVEL#DCDBS    W0NSRQ  1        Charges Day Bas
      * Name search required?
     C           W0NSRQ    IFEQ '?'
     C                     CALL 'Y2VLLSR'              90  *
     C                     PARM           W0RTN   7
     C                     PARM 1184056   Y2LSNO  70
     C           #DCDBS    PARM #DCDBS    W0EXVL 20        Charges Day Bas
      * Defer confirm
     C                     MOVEL'Y'       W0DCF   1
     C                     END
      *
      * Validate Charges Divisor Basis SCR
     C                     MOVEL*BLANK    W0RTN
     C                     MOVEL#DCHDB    W0NSRQ  1        Charges Divisor
      * Name search required?
     C           W0NSRQ    IFEQ '?'
     C                     CALL 'Y2VLLSR'              90  *
     C                     PARM           W0RTN   7
     C                     PARM 1184066   Y2LSNO  70
     C           #DCHDB    PARM #DCHDB    W0EXVL 20        Charges Divisor
      * Defer confirm
     C                     MOVEL'Y'       W0DCF   1
     C                     END
      *
      * Validate Dsp Non-Portfolio Picture
     C                     MOVEL*BLANK    W0RTN
     C                     MOVEL#1DP97    W0NSRQ  1        Dsp Non-Portfol
      * Name search required?
     C           W0NSRQ    IFEQ '?'
     C                     CALL 'Y2VLLSR'              90  *
     C                     PARM           W0RTN   7
     C                     PARM 1184071   Y2LSNO  70
     C           #1DP97    PARM #1DP97    W0EXVL 20        Dsp Non-Portfol
      * Defer confirm
     C                     MOVEL'Y'       W0DCF   1
     C                     END
      *
      * Validate Dsp Consolidated P/folio
     C                     MOVEL*BLANK    W0RTN
     C                     MOVEL#1DP98    W0NSRQ  1        Dsp Consolidate
      * Name search required?
     C           W0NSRQ    IFEQ '?'
     C                     CALL 'Y2VLLSR'              90  *
     C                     PARM           W0RTN   7
     C                     PARM 1184089   Y2LSNO  70
     C           #1DP98    PARM #1DP98    W0EXVL 20        Dsp Consolidate
      * Defer confirm
     C                     MOVEL'Y'       W0DCF   1
     C                     END
      *
      * Validate Show Fees and Charges
     C                     MOVEL*BLANK    W0RTN
     C                     MOVEL#1SHFC    W0NSRQ  1        Show Fees and C
      * Name search required?
     C           W0NSRQ    IFEQ '?'
     C                     CALL 'Y2VLLSR'              90  *
     C                     PARM           W0RTN   7
     C                     PARM 1184120   Y2LSNO  70
     C           #1SHFC    PARM #1SHFC    W0EXVL 20        Show Fees and C
      * Defer confirm
     C                     MOVEL'Y'       W0DCF   1
     C                     END
      *
      * Validate Show Capital Chg Charges
     C                     MOVEL*BLANK    W0RTN
     C                     MOVEL#1SHCC    W0NSRQ  1        Show Capital Ch
      * Name search required?
     C           W0NSRQ    IFEQ '?'
     C                     CALL 'Y2VLLSR'              90  *
     C                     PARM           W0RTN   7
     C                     PARM 1184125   Y2LSNO  70
     C           #1SHCC    PARM #1SHCC    W0EXVL 20        Show Capital Ch
      * Defer confirm
     C                     MOVEL'Y'       W0DCF   1
     C                     END
      *
      * Validate Unearned Int in Capital
     C                     MOVEL*BLANK    W0RTN
     C                     MOVEL#1UIIC    W0NSRQ  1        Unearned Int in
      * Name search required?
     C           W0NSRQ    IFEQ '?'
     C                     CALL 'Y2VLLSR'              90  *
     C                     PARM           W0RTN   7
     C                     PARM 1184135   Y2LSNO  70
     C           #1UIIC    PARM #1UIIC    W0EXVL 20        Unearned Int in
      * Defer confirm
     C                     MOVEL'Y'       W0DCF   1
     C                     END
      *
      * Validate Pool Portfolio Processing
     C                     MOVEL*BLANK    W0RTN
     C                     MOVEL#1PPPR    W0NSRQ  1        Pool Portfolio
      * Name search required?
     C           W0NSRQ    IFEQ '?'
     C                     CALL 'Y2VLLSR'              90  *
     C                     PARM           W0RTN   7
     C                     PARM 1184190   Y2LSNO  70
     C           #1PPPR    PARM #1PPPR    W0EXVL 20        Pool Portfolio
      * Defer confirm
     C                     MOVEL'Y'       W0DCF   1
     C                     END
      *
      * Validate Report Cap Chgs Separate
     C                     MOVEL*BLANK    W0RTN
     C                     MOVEL#1RCCS    W0NSRQ  1        Report Cap Chgs
      * Name search required?
     C           W0NSRQ    IFEQ '?'
     C                     CALL 'Y2VLLSR'              90  *
     C                     PARM           W0RTN   7
     C                     PARM 1184195   Y2LSNO  70
     C           #1RCCS    PARM #1RCCS    W0EXVL 20        Report Cap Chgs
      * Defer confirm
     C                     MOVEL'Y'       W0DCF   1
     C                     END
      *
      * Validate Save Notional FX Deals
     C                     MOVEL*BLANK    W0RTN
     C                     MOVEL#1SAVI    W0NSRQ  1        Save Notional F
      * Name search required?
     C           W0NSRQ    IFEQ '?'
     C                     CALL 'Y2VLLSR'              90  *
     C                     PARM           W0RTN   7
     C                     PARM 1199629   Y2LSNO  70
     C           #1SAVI    PARM #1SAVI    W0EXVL 20        Save Notional F
      * Defer confirm
     C                     MOVEL'Y'       W0DCF   1
     C                     END
      *
      * Validate Percentage Calc. Method
     C                     MOVEL*BLANK    W0RTN
     C                     MOVEL#1PCAM    W0NSRQ  1        Percentage Calc
      * Name search required?
     C           W0NSRQ    IFEQ '?'
     C                     CALL 'Y2VLLSR'              90  *
     C                     PARM           W0RTN   7
     C                     PARM 1199634   Y2LSNO  70
     C           #1PCAM    PARM #1PCAM    W0EXVL 20        Percentage Calc
      * Defer confirm
     C                     MOVEL'Y'       W0DCF   1
     C                     END
      *
      * Validate Display Customer/Portflio
     C                     MOVEL*BLANK    W0RTN
     C                     MOVEL#1DCPD    W0NSRQ  1        Display Custome
      * Name search required?
     C           W0NSRQ    IFEQ '?'
     C                     CALL 'Y2VLLSR'              90  *
     C                     PARM           W0RTN   7
     C                     PARM 1199639   Y2LSNO  70
     C           #1DCPD    PARM #1DCPD    W0EXVL 20        Display Custome
      * Defer confirm
     C                     MOVEL'Y'       W0DCF   1
     C                     END
      *
      * USER: Validate detail screen fields
      * 00/Copy member SD9381RVSF - Portfolio Management ICD  *
     C*Edit portfolio managementValidate Detail Screen
     C/COPY WNCPYSRC,SD9381RVSF
      * Liabilities Included
      * CASE: DTL.Liabilities Included is Blank
     C           #1LIAB    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1LIAB    ZA0001           Liabilities Inc
      * Send message 'Liabilities incl reqd'
     C                     MOVEL'USR2418' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9931  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
      * CASE: DTL.Liabilities Included is Valid values
     C           #1LIAB    IFEQ 'Y'                        *IF
     C           #1LIAB    OREQ 'N'
     C                     ELSE
      * CASE: *OTHERWISE
      * Setup message data for message
     C                     MOVEL#1LIAB    ZA0002           Liabilities Inc
      * Send message 'Liabilities is invalid'
     C                     MOVEL'USR2419' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9931  *
      *
     C                     END                             *FI
     C                     END                             *FI
      * High level security required
      * CASE: DTL.High Level Security is Blank
     C           #1HLVS    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1HLVS    ZA0003           High Level Secu
      * Send message 'High level secur is reqd'
     C                     MOVEL'USR2420' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9932  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
      * CASE: DTL.High Level Security is Valid values
     C           #1HLVS    IFEQ 'N'                        *IF
     C           #1HLVS    OREQ 'Y'
     C                     ELSE
      * CASE: *OTHERWISE
      * Setup message data for message
     C                     MOVEL#1HLVS    ZA0004           High Level Secu
      * Send message 'High level sec invalid'
     C                     MOVEL'USR2421' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9932  *
      *
     C                     END                             *FI
     C                     END                             *FI
      * Trade/Value Date Positions
      * CASE: DTL.Trade/Value Date Position is Blank
     C           #1TVPS    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1TVPS    ZA0005           Trade/Value Dat
      * Send message 'Trade/Value Date is reqd'
     C                     MOVEL'USR2422' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9933  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
      * CASE: DTL.Trade/Value Date Position is Valid values
     C           #1TVPS    IFEQ 'T'                        *IF
     C           #1TVPS    OREQ 'V'
     C                     ELSE
      * CASE: *OTHERWISE
      * Setup message data for message
     C                     MOVEL#1TVPS    ZA0006           Trade/Value Dat
      * Send message 'Trade/Value date invalid'
     C                     MOVEL'USR2423' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9933  *
      *
     C                     END                             *FI
     C                     END                             *FI
      * Start CPM004
      * Portfolios Supported
      * CASE: DTL.Portfolios Supported is Valid Values
     C           #1PORS    IFEQ 'B'                        *IF
     C           #1PORS    OREQ 'C'
     C                     ELSE
      * CASE: *OTHERWISE
      * Setup message data for message
     C                     MOVEL#1PORS    ZA0007           Portfolios Supp
      * Send message 'Portfolios Supported INV'
     C                     MOVEL'USR2886' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9934  *
      *
     C                     END                             *FI
      * End CPM004
      * Charges day Basis
      * CASE: DTL.Charges Day Basis SCR is Blank
     C           #DCDBS    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#DCDBS    ZA0008           Charges Day Bas
      * Send message 'Charges Day Basis is reqd'
     C                     MOVEL'USR2424' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9935  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
      * CASE: DTL.Charges Day Basis SCR is Valid values
     C           #DCDBS    IFEQ '1'                        *IF
     C           #DCDBS    OREQ '2'
     C           #DCDBS    OREQ '3'
     C                     MOVE #DCDBS    #1CDYB           Charging Day Ba
     C                     ELSE
      * CASE: *OTHERWISE
      * Setup message data for message
     C                     MOVEL#DCDBS    ZA0009           Charges Day Bas
      * Send message 'Charges day basis invalid'
     C                     MOVEL'USR2425' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9935  *
      *
     C                     END                             *FI
     C                     END                             *FI
      * Charges divisor Basis
      * CASE: DTL.Charges Divisor Basis SCR is Blank
     C           #DCHDB    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#DCHDB    ZA0010           Charges Divisor
      * Send message 'Charges Divisor Bas reqd'
     C                     MOVEL'USR2426' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9936  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
      * CASE: DTL.Charges Divisor Basis SCR is Valid values
     C           #DCHDB    IFEQ '1'                        *IF
     C           #DCHDB    OREQ '2'
     C           #DCHDB    OREQ '3'
     C                     MOVE #DCHDB    #1CDVB           Charging Diviso
     C                     ELSE
      * CASE: *OTHERWISE
      * Setup message data for message
     C                     MOVEL#DCHDB    ZA0011           Charges Divisor
      * Send message 'Charges divisor is invald'
     C                     MOVEL'USR2427' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9936  *
      *
     C                     END                             *FI
     C                     END                             *FI
      *                                                                   CPB001
     C           WUN4ST    IFNE 'Y'                        *FI            CPB001
      * Display Non-Portfolio
      * CASE: DTL.Dsp Non-Portfolio Picture is Blank
     C           #1DP97    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1DP97    ZA0012           Dsp Non-Portfol
      * Send message 'Display non-portf is reqd'
     C                     MOVEL'USR2428' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9937  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
      * CASE: DTL.Dsp Non-Portfolio Picture is Valid values
     C           #1DP97    IFEQ 'Y'                        *IF
     C           #1DP97    OREQ 'N'
     C/COPY WNCPYSRC,SD9381RC01
     C                     ELSE
      * CASE: *OTHERWISE
      * Setup message data for message
     C                     MOVEL#1DP97    ZA0013           Dsp Non-Portfol
      * Send message 'Display non-port is invld'
     C                     MOVEL'USR2429' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9937  *
      *
     C                     END                             *FI
     C                     END                             *FI
      * Assign Reference
      * CASE: DTL.Dsp Non-Portfolio Picture is Do not display 9997
     C           #1DP97    IFEQ 'N'                        *IF
      * Must be blank
      * CASE: DTL.Ref Attached to 9997 is Entered
     C           #1R997    IFNE *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1R997    ZA0014           Ref Attached to
      * Send message 'Assign Ref must be blank'
     C                     MOVEL'USR2430' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9938  *
      *
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
      * CASE: DTL.Dsp Non-Portfolio Picture is Display 9997
     C           #1DP97    IFEQ 'Y'                        *IF
     C/COPY WNCPYSRC,SD9381RC02
      * Must be entered
      * CASE: DTL.Ref Attached to 9997 is Blank
     C           #1R997    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1R997    ZA0015           Ref Attached to
      * Send message 'Assign Ref is required'
     C                     MOVEL'USR2431' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9938  *
      *
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
      * Assign Narrative
      * CASE: DTL.Dsp Non-Portfolio Picture is Do not display 9997
     C           #1DP97    IFEQ 'N'                        *IF
      * Must be blank
      * CASE: DTL.Narr Attached to 9997 is Entered
     C           #1N997    IFNE *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1N997    ZA0016           Narr Attached t
      * Send message 'Narrative must be blank'
     C                     MOVEL'USR2432' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9939  *
      *
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
      * CASE: DTL.Dsp Non-Portfolio Picture is Display 9997
     C           #1DP97    IFEQ 'Y'                        *IF
     C/COPY WNCPYSRC,SD9381RC03
      * Must be entered
      * CASE: DTL.Narr Attached to 9997 is Blank
     C           #1N997    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1N997    ZA0017           Narr Attached t
      * Send message 'Narrative is required'
     C                     MOVEL'USR2433' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9939  *
      *
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI            CPB001
      * Display combined portfolio
      * CASE: DTL.Dsp Consolidated P/folio is Blank
     C           #1DP98    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1DP98    ZA0018           Dsp Consolidate
      * Send message 'Display comb portf reqd'
     C                     MOVEL'USR2434' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9940  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
      * CASE: DTL.Dsp Consolidated P/folio is Valid values
     C           #1DP98    IFEQ 'Y'                        *IF
     C           #1DP98    OREQ 'N'
     C/COPY WNCPYSRC,SD9381RC04
     C                     ELSE
      * CASE: *OTHERWISE
      * Setup message data for message
     C                     MOVEL#1DP98    ZA0019           Dsp Consolidate
      * Send message 'Dsp combined portf invald'
     C                     MOVEL'USR2435' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9940  *
      *
     C                     END                             *FI
     C                     END                             *FI
      * Assign Reference (Combined Portfolio)
      * CASE: DTL.Dsp Consolidated P/folio is Do not Display 9998
     C           #1DP98    IFEQ 'N'                        *IF
      * Must be blank
      * CASE: DTL.Ref Attached to 9998 is Entered
     C           #1R998    IFNE *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1R998    ZA0020           Ref Attached to
      * Send message 'Assign ref R998 not reqd'
     C                     MOVEL'USR2436' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9941  *
      *
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
      * CASE: DTL.Dsp Consolidated P/folio is Display 9998
     C           #1DP98    IFEQ 'Y'                        *IF
     C/COPY WNCPYSRC,SD9381RC05
      * Must be entered
      * CASE: DTL.Ref Attached to 9998 is Blank
     C           #1R998    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1R998    ZA0021           Ref Attached to
      * Send message 'Assigned Reference reqd'
     C                     MOVEL'USR2437' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9941  *
      *
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
      * Assign Narrative (Combined Portfolio)
      * CASE: DTL.Dsp Consolidated P/folio is Do not Display 9998
     C           #1DP98    IFEQ 'N'                        *IF
      * Must be blank
      * CASE: DTL.Narr Attached to 9998 is Entered
     C           #1N998    IFNE *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1N998    ZA0022           Narr Attached t
      * Send message 'Narrative is not required'
     C                     MOVEL'USR2438' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9942  *
      *
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
      * CASE: DTL.Dsp Consolidated P/folio is Display 9998
     C           #1DP98    IFEQ 'Y'                        *IF
     C/COPY WNCPYSRC,SD9381RC06
      * Must be entered
      * CASE: DTL.Narr Attached to 9998 is Blank
     C           #1N998    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1N998    ZA0023           Narr Attached t
      * Send message 'Narrative 998 is required'
     C                     MOVEL'USR2439' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9942  *
      *
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
      *                                                                   CPB001
     C           WUN4ST    IFNE 'Y'                        *FI            CPB001
      * Assign Reference  9999
      * CASE: DTL.Ref Attached to 9999 is Blank
     C           #1R999    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1R999    ZA0024           Ref Attached to
      * Send message 'Ref 9999 must be entered'
     C                     MOVEL'USR2440' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9943  *
      *
     C                     END                             *FI
      * Assign Narrative  9999
      * CASE: DTL.Narr Attached to 9999 is Blank
     C           #1N999    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1N999    ZA0025           Narr Attached t
      * Send message 'Narrative 9999 is requird'
     C                     MOVEL'USR2441' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9944  *
      *
     C                     END                             *FI
     C                     END                             *FI            CPB001
      * Default Instrument Code
      * CASE: DTL.Default Instrument Type is Blank
     C           #1DINR    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1DINR    ZA0026           Default Instrum
      * Send message 'Default Ins Code is reqd'
     C                     MOVEL'USR2442' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9945  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL#1DINR    WUTQKF           Test ? in Key F
      * CASE: WRK.Test ? in Key Field is Question Mark
     C           WUTQKF    IFEQ '?'                        *IF
     C                     MOVEL#1DINR    WUINNR           PM Instrument C
     C                     MOVEL*BLANK    WUAPOP           Access Pgm Opti
     C                     MOVEL'*KEY'    WUAPOP           Access Pgm Opti
      * Access SDPLINPD (INNR) - Standard Functions  *     *KEY
     C*
     C                     CALL 'AOPLINR0'
     C           WUAPRC    PARM WUAPRC    UUAPRC  7        RETURN CDE
     C                     PARM WUAPOP    UUAPOP  7        OPTION
     C                     PARM WUINNR    UUINNR  3        INS TYPE
     C           D@PLIN    PARM *BLANK    UUSDY            FORMAT
     C*
      * No selection was made, send an information message.
      * CASE: WRK.Access Pgm Return Code is No selection
     C           WUAPRC    IFEQ '*NOSEL'                   *IF
      * Send message 'Dft Ins Code not selected'
     C                     MOVEL'USR2443' ZAMSID
     C                     MOVEL'*INFO  ' ZAMSTP           Message type
     C                     EXSR ZASNMS
      *
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     END                             *FI
      * Move Ins code to Scr - Portfolio Management ICD  *
     C*
     C                     MOVE PDINNR    #1DINR
     C*
     C                     MOVEL*BLANK    WUAPOP           Access Pgm Opti
     C                     MOVEL'*FREE'   WUAPOP           Access Pgm Opti
      * Access SDPLINPD (INNR) - Standard Functions  *     *FREE
     C*
     C                     CALL 'AOPLINR0'
     C           WUAPRC    PARM WUAPRC    UUAPRC  7        RETURN CDE
     C                     PARM WUAPOP    UUAPOP  7        OPTION
     C                     PARM WUINNR    UUINNR  3        INS TYPE
     C           D@PLIN    PARM *BLANK    UUSDY            FORMAT
     C*
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL#1DINR    WUINNR           PM Instrument C
     C                     MOVEL'*VERIFY' WUAPOP           Access Pgm Opti
      * Access SDPLINPD (INNR) - Standard Functions  *     *VERIFY
     C*
     C                     CALL 'AOPLINR0'
     C           WUAPRC    PARM WUAPRC    UUAPRC  7        RETURN CDE
     C                     PARM WUAPOP    UUAPOP  7        OPTION
     C                     PARM WUINNR    UUINNR  3        INS TYPE
     C           D@PLIN    PARM *BLANK    UUSDY            FORMAT
     C*
      * Check access object return code
      * CASE: WRK.Access Pgm Return Code is *Normal
     C           WUAPRC    IFEQ *BLANK                     *IF
     C                     ELSE
      * CASE: *OTHERWISE
      * Setup message data for message
     C                     MOVEL#1DINR    ZA0027           Default Instrum
      * Send message 'Dft Ins Code invalid'
     C                     MOVEL'USR2444' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9945  *
      *
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
      * Show Fees and Charges
      * CASE: DTL.Show Fees and Charges is Blank
     C           #1SHFC    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1SHFC    ZA0028           Show Fees and C
      * Send message 'Show Fees & Charges reqd'
     C                     MOVEL'USR2449' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9946  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
      * CASE: DTL.Show Fees and Charges is Valid values
     C           #1SHFC    IFEQ 'N'                        *IF
     C           #1SHFC    OREQ 'Y'
     C                     ELSE
      * CASE: *OTHERWISE
      * Setup message data for message
     C                     MOVEL#1SHFC    ZA0029           Show Fees and C
      * Send message 'Show fees/charges invalid'
     C                     MOVEL'USR2450' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9946  *
      *
     C                     END                             *FI
     C                     END                             *FI
      * Default Industry Code
      * CASE: DTL.Local Industry Code is Blank
     C           #1LICD    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1LICD    ZA0030           Local Industry
      * Send message 'Dft Industry Code is reqd'
     C                     MOVEL'USR2445' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9947  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL#1LICD    WUTQKF           Test ? in Key F
      * CASE: WRK.Test ? in Key Field is Question Mark
     C           WUTQKF    IFEQ '?'                        *IF
     C                     MOVEL*BLANK    WULICD           Local Industry
      * Select Local Industry Cod - Local Industry Codes  *
     C                     CALL 'SD0100S'              90  Select Local In
     C                     PARM *BLANK    W0RTN   7
     C           WULICD    PARM WULICD    WQ0008  3        Local Industry
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SD0100S' W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C                     SETON                     99    *
     C                     END
     C                     MOVELWULICD    #1LICD           Local Industry
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL#1LICD    WULICD           Local Industry
      * Retrieve Local Ind Code - Local Industry Codes  *
     C                     EXSR SARVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Setup message data for message
     C                     MOVEL#1LICD    ZA0031           Local Industry
      * Send message 'Dft Industry code invalid'
     C                     MOVEL'USR2446' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9947  *
      *
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
      * Show Depot movement charges
      * CASE: DTL.Show Capital Chg Charges is Blank
     C           #1SHCC    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1SHCC    ZA0032           Show Capital Ch
      * Send message 'Show depot m is required'
     C                     MOVEL'USR2451' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9948  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
      * CASE: DTL.Show Capital Chg Charges is Valid values
     C           #1SHCC    IFEQ 'N'                        *IF
     C           #1SHCC    OREQ 'Y'
     C/COPY WNCPYSRC,SD9381RC07
     C                     ELSE
      * CASE: *OTHERWISE
      * Setup message data for message
     C                     MOVEL#1SHCC    ZA0033           Show Capital Ch
      * Send message 'Show DM charges invalid'
     C                     MOVEL'USR2452' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9948  *
      *
     C                     END                             *FI
     C                     END                             *FI
      * Default Country Code
      * CASE: DTL.Country Code is equal to blank
     C           #1CNCD    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1CNCD    ZA0034           Country Code
      * Send message 'Dft Country code is reqd'
     C                     MOVEL'USR2447' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9949  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL#1CNCD    WUTQKF           Test ? in Key F
      * CASE: WRK.Test ? in Key Field is Question Mark
     C           WUTQKF    IFEQ '?'                        *IF
     C                     MOVEL*BLANK    WUCNCD           Country Code
      * Select Country Codes - Country Codes  *
     C                     CALL 'SD0180S'              90  Select Country
     C                     PARM *BLANK    W0RTN   7
     C           WUCNCD    PARM WUCNCD    WQ0009  2        Country Code
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SD0180S' W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C                     SETON                     99    *
     C                     END
     C                     MOVELWUCNCD    #1CNCD           Country Code
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL#1CNCD    WUCNCD           Country Code
      * get country codes - Country Codes  *
     C                     EXSR SBRVGN
      * CASE: PGM.*Return code is *Record does not exist
     C           W0RTN     IFEQ 'Y2U0005'                  *IF
      * Setup message data for message
     C                     MOVEL#1CNCD    ZA0035           Country Code
      * Send message 'Dft Country code invalid'
     C                     MOVEL'USR2448' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9949  *
      *
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
      * Unearened Interest in Capital
      * CASE: DTL.Unearned Int in Capital is Blank
     C           #1UIIC    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1UIIC    ZA0036           Unearned Int in
      * Send message 'Unearened Int is required'
     C                     MOVEL'USR2454' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9950  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
      * CASE: DTL.Unearned Int in Capital is Valid values
     C           #1UIIC    IFEQ 'N'                        *IF
     C           #1UIIC    OREQ 'Y'
     C/COPY WNCPYSRC,SD9381RC08
     C                     ELSE
      * CASE: *OTHERWISE
      * Setup message data for message
     C                     MOVEL#1UIIC    ZA0037           Unearned Int in
      * Send message 'Unearened Int invalid'
     C                     MOVEL'USR2455' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9950  *
      *
     C                     END                             *FI
     C                     END                             *FI
      * Retention of deleted customer information
      * CASE: DTL.Retain Deleted Cust Info is Blank
     C           #1RDCI    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1RDCI    ZA0038           Retain Deleted
      * Send message 'Retention of Dlt cust req'
     C                     MOVEL'USR2453' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9951  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL*BLANK    WUZASF           ZALIGN Screen F
     C                     MOVEL#1RDCI    WUZASF           ZALIGN Screen F
      * Call ZALIGN & ZEDIT
      * ZALIGN Screen Field - Standard Functions  *
     C                     CALL 'ZALIGN'               90  ZALIGN Screen F
     C           W0RTN     PARM W0RTN     WQ0010  7        *Return code
     C           WUZASF    PARM WUZASF    WQ0011 16        ZALIGN Screen F
     C                     PARM *ZERO     WQ0012  10       ZALIGN No Of De
     C                     PARM 2         WQ0013  20       ZALIGN No Of Di
     C           WUZAFF    PARM *BLANK    WQ0014 16        ZALIGN File Fie
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'ZALIGN'  W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C                     SETON                     99    *
     C                     END
      * CASE: PGM.*Return code is Old Table Error
     C           W0RTN     IFEQ '*ERROR*'                  *IF
     C                     MOVEL'Y'       WUERCD           Err Code
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL'N'       WUERCD           Err Code
      * ZEDIT Screen Field - Standard Functions  *
     C                     CALL 'ZEDIT'                90  ZEDIT Screen Fi
     C           WUZASF    PARM WUZASF    WQ0015 16        ZALIGN Screen F
     C                     PARM *ZERO     WQ0016  10       ZALIGN No Of De
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'ZEDIT'   W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
     C                     END                             *FI
      * CASE: WRK.Err Code is Error Found
     C           WUERCD    IFEQ 'Y'                        *IF
      * Setup message data for message
     C                     MOVEL#1RDCI    ZA0039           Retain Deleted
      * Send message 'Retain deleted cust numbr'
     C                     MOVEL'USR2456' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9951  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVE WUZAFF    WURDIN           Retain deletd c
      * Zalign Retention info - Portfolio Management ICD  *
     C*
     C                     MOVE WUZASF    #1RDCI
     C*
      * Must be greater than zero
      * CASE: WRK.Retain deletd cust info is Greater than Zero
     C           WURDIN    IFGT *ZERO                      *IF
     C                     ELSE
      * CASE: *OTHERWISE
      * Setup message data for message
     C                     MOVEL#1RDCI    ZA0040           Retain Deleted
      * Send message 'Retn dltd cust info GT 0'
     C                     MOVEL'USR2457' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9951  *
      *
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
      * Pool Portfolios supported
      * CASE: DTL.Pool Portfolio Processing is Blank
     C           #1PPPR    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1PPPR    ZA0041           Pool Portfolio
      * Send message 'Pool Portfolios is reqd'
     C                     MOVEL'USR2458' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9952  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
      * Check for valid value entered.
      * CASE: DTL.Pool Portfolio Processing is Valid values
     C           #1PPPR    IFEQ 'N'                        *IF
     C           #1PPPR    OREQ 'Y'
     C/COPY WNCPYSRC,SD9381RC09
     C                     ELSE
      * CASE: *OTHERWISE
      * Setup message data for message
     C                     MOVEL#1PPPR    ZA0042           Pool Portfolio
      * Send message 'Pool portfolios invalid'
     C                     MOVEL'USR2459' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9952  *
      *
     C                     END                             *FI
      * Start of change S01486 (2).
      * CQQ001 processing.
      * CASE: DTL.Pool Portfolio Processing NE WRK.Pool portfolios saved
     C           #1PPPR    IFNE WUPPSV                     *IF
      * CQQ001 processing.
      * CASE: DTL.Pool Portfolio Processing is Supported
     C           #1PPPR    IFEQ 'Y'                        *IF
      * Setup message data for message
      * Retrieve message CQQ001 Text
     C                     MOVELZADFMF    ZAMSGF
     C                     CALL 'Y2RVMGC'              90  *
     C                     PARM *BLANK    W0RTN   7        Return code
     C                     PARM 'USR2620' ZAMSID  7        Message ID
     C                     PARM           ZAMSGF 10        Message file
     C                     PARM           ZAMSDA132        Message data
     C           WUG1TX    PARM           W0MTX 132        Returned messag
     C                     MOVEL*BLANK    ZAMSDA
     C                     MOVEL*BLANK    ZAMSGF
      * INS/DEL int switch feat - Standard Functions  *
     C                     CALL 'SC3011X'              90  INS/DEL int swi
     C                     PARM W0RTN     WQ0017  7        *Return code
     C                     PARM 'I'       WQ0018  1        Action Code
     C                     PARM 'CQQ001'  WQ0019  6        SAR number fiel
     C                     PARM WUG1TX    WQ0020 50        SAR Description
     C                     PARM WUWRC6    WQ0021  6        work return cod
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SC3011X' W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
     C                     ELSE
      * CASE: *OTHERWISE
      * INS/DEL int switch feat - Standard Functions  *
     C                     CALL 'SC3011X'              90  INS/DEL int swi
     C                     PARM W0RTN     WQ0022  7        *Return code
     C                     PARM 'D'       WQ0023  1        Action Code
     C                     PARM 'CQQ001'  WQ0024  6        SAR number fiel
     C                     PARM *BLANK    WQ0025 50        SAR Description
     C                     PARM WUWRC6    WQ0026  6        work return cod
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'SC3011X' W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
     C                     END                             *FI
      * Check return code.
      * CASE: WRK.work return code (6A) is blank
     C           WUWRC6    IFEQ *BLANK                     *IF
     C                     ELSE
      * CASE: *OTHERWISE
      * Setup message data for message
     C                     MOVEL#1PPPR    ZA0043           Pool Portfolio
      * Send message 'Pool p/folio update fail'
     C                     MOVEL'USR2621' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9952  *
      *
     C                     END                             *FI
     C                     END                             *FI
      * End of change S01486 (2).
     C                     END                             *FI
      * Report Capital Charges Separate
      * CASE: DTL.Report Cap Chgs Separate is Blank
     C           #1RCCS    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1RCCS    ZA0044           Report Cap Chgs
      * Send message 'Report Cap Charge requird'
     C                     MOVEL'USR2460' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9953  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
      * CASE: DTL.Report Cap Chgs Separate is Valid values
     C           #1RCCS    IFEQ 'N'                        *IF
     C           #1RCCS    OREQ 'Y'
     C                     ELSE
      * CASE: *OTHERWISE
      * Setup message data for message
     C                     MOVEL#1RCCS    ZA0045           Report Cap Chgs
      * Send message 'Report Cap Separate invld'
     C                     MOVEL'USR2461' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9953  *
      *
     C                     END                             *FI
     C                     END                             *FI
      * Acceptable Difference
      * CASE: DTL.Acceptable Difference SCR is Entered
     C           #DACPD    IFNE *BLANK                     *IF
     C                     MOVEL*BLANK    WUZASF           ZALIGN Screen F
     C                     MOVEL#DACPD    WUZASF           ZALIGN Screen F
      * Call ZALIGN & ZEDIT
      * ZALIGN Screen Field - Standard Functions  *
     C                     CALL 'ZALIGN'               90  ZALIGN Screen F
     C           W0RTN     PARM W0RTN     WQ0027  7        *Return code
     C           WUZASF    PARM WUZASF    WQ0028 16        ZALIGN Screen F
     C                     PARM *ZERO     WQ0029  10       ZALIGN No Of De
     C                     PARM 3         WQ0030  20       ZALIGN No Of Di
     C           WUZAFF    PARM *BLANK    WQ0031 16        ZALIGN File Fie
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'ZALIGN'  W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Error detected?
     C           W0RTN     IFNE *BLANK
     C                     SETON                     99    *
     C                     END
      * CASE: PGM.*Return code is Old Table Error
     C           W0RTN     IFEQ '*ERROR*'                  *IF
     C                     MOVEL'Y'       WUERCD           Err Code
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL'N'       WUERCD           Err Code
      * ZEDIT Screen Field - Standard Functions  *
     C                     CALL 'ZEDIT'                90  ZEDIT Screen Fi
     C           WUZASF    PARM WUZASF    WQ0032 16        ZALIGN Screen F
     C                     PARM *ZERO     WQ0033  10       ZALIGN No Of De
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'ZEDIT'   W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
     C                     END                             *FI
      * CASE: WRK.Err Code is Error Found
     C           WUERCD    IFEQ 'Y'                        *IF
      * Setup message data for message
     C                     MOVEL#DACPD    ZA0046           Acceptable Diff
      * Send message 'Accptbl diff. must be Num'
     C                     MOVEL'USR2462' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9954  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVE WUZAFF    #1ADIF           Acceptable Diff
      * Zalign acceptable differe - Portfolio Management ICD  *
     C*
     C                     MOVE WUZASF    #DACPD
     C*
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
     C                     Z-ADD*ZERO     #1ADIF           Acceptable Diff
     C                     END                             *FI
      * Start CPM005
      * When PM Focus Group enhancement is switched on
      * CASE: WRK.CPM005 is Present
     C           WUXUST    IFEQ 'Y'                        *IF
      * Save Notional FX Deals
      * CASE: DTL.Save Notional FX Deals is Blank
     C           #1SAVI    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1SAVI    ZA0047           Save Notional F
      * Send message 'Save Notnal FX Deals REQ'
     C                     MOVEL'USR2971' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9955  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
      * CASE: DTL.Save Notional FX Deals is Valid Values
     C           #1SAVI    IFEQ 'N'                        *IF
     C           #1SAVI    OREQ 'Y'
     C/COPY WNCPYSRC,SD9381RC10
     C                     ELSE
      * CASE: *OTHERWISE
      * Setup message data for message
     C                     MOVEL#1SAVI    ZA0048           Save Notional F
      * Send message 'Save Notionl FX DealsINV'
     C                     MOVEL'USR2942' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9955  *
      *
     C                     END                             *FI
     C                     END                             *FI
      * Notional FX Deals instrument
      * CASE: DTL.Save Notional FX Deals is Yes
     C           #1SAVI    IFEQ 'Y'                        *IF
      * Validate Notional FX Deals Instrument
      * CASE: DTL.Notional FX Deals Instrmt is Blank
     C           #1NINS    IFEQ *BLANK                     *IF
     C/COPY WNCPYSRC,SD9381RC11
      * Setup message data for message
     C                     MOVEL#1NINS    ZA0049           Notional FX Dea
      * Send message 'Notionl FX Deal Inst REQ'
     C                     MOVEL'USR2972' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9956  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL#1NINS    WUTQKF           Test ? in Key F
      * CASE: WRK.Test ? in Key Field is Question Mark
     C           WUTQKF    IFEQ '?'                        *IF
     C                     MOVEL#1NINS    WUINNR           PM Instrument C
     C                     MOVEL*BLANK    WUAPOP           Access Pgm Opti
     C                     MOVEL'*KEY'    WUAPOP           Access Pgm Opti
      * Access SDPLINPD (INNR) - Standard Functions  *     *KEY
     C*
     C                     CALL 'AOPLINR0'
     C           WUAPRC    PARM WUAPRC    UUAPRC  7        RETURN CDE
     C                     PARM WUAPOP    UUAPOP  7        OPTION
     C                     PARM WUINNR    UUINNR  3        INS TYPE
     C           D@PLIN    PARM *BLANK    UUSDY            FORMAT
     C*
      * Move NINS to Screen - Portfolio Management ICD  *
     C*
     C                     MOVE PDINNR    #1NINS
     C*
      * No selection was made
      * CASE: WRK.Access Pgm Return Code is No selection
     C           WUAPRC    IFEQ '*NOSEL'                   *IF
     C                     MOVEL*BLANK    #1NINS           Notional FX Dea
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     END                             *FI
     C                     MOVEL*BLANK    WUAPOP           Access Pgm Opti
     C                     MOVEL'*FREE'   WUAPOP           Access Pgm Opti
      * Access SDPLINPD (INNR) - Standard Functions  *     *FREE
     C*
     C                     CALL 'AOPLINR0'
     C           WUAPRC    PARM WUAPRC    UUAPRC  7        RETURN CDE
     C                     PARM WUAPOP    UUAPOP  7        OPTION
     C                     PARM WUINNR    UUINNR  3        INS TYPE
     C           D@PLIN    PARM *BLANK    UUSDY            FORMAT
     C*
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL#1NINS    WUINNR           PM Instrument C
     C                     MOVEL'*VERIFY' WUAPOP           Access Pgm Opti
      * Access SDPLINPD (INNR) - Standard Functions  *     *VERIFY
     C*
     C                     CALL 'AOPLINR0'
     C           WUAPRC    PARM WUAPRC    UUAPRC  7        RETURN CDE
     C                     PARM WUAPOP    UUAPOP  7        OPTION
     C                     PARM WUINNR    UUINNR  3        INS TYPE
     C           D@PLIN    PARM *BLANK    UUSDY            FORMAT
     C*
      * Check access object return code
      * CASE: WRK.Access Pgm Return Code is *Normal
     C           WUAPRC    IFEQ *BLANK                     *IF
     C/COPY WNCPYSRC,SD9381RC12
     C                     ELSE
      * CASE: *OTHERWISE
      * Setup message data for message
     C                     MOVEL#1NINS    ZA0050           Notional FX Dea
      * Send message 'Notionl FX Deal Inst INV'
     C                     MOVEL'USR2943' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9956  *
      *
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
     C                     ELSE
      * CASE: *OTHERWISE
      * CASE: DTL.Notional FX Deals Instrmt is Not Blank
     C           #1NINS    IFNE *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1NINS    ZA0051           Notional FX Dea
      * Send message 'Notionl FX Deal Inst NRQ'
     C                     MOVEL'USR2975' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9956  *
      *
     C                     END                             *FI
     C                     END                             *FI
      * Percentage Calculation Method
      * CASE: DTL.Percentage Calc. Method is Blank
     C           #1PCAM    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1PCAM    ZA0052           Percentage Calc
      * Send message 'Percentge Calc. Meth. REQ'
     C                     MOVEL'USR2973' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9957  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
      * CASE: DTL.Percentage Calc. Method is Valid Values
     C           #1PCAM    IFEQ 'N'                        *IF
     C           #1PCAM    OREQ 'S'
     C                     ELSE
      * CASE: *OTHERWISE
      * Setup message data for message
     C                     MOVEL#1PCAM    ZA0053           Percentage Calc
      * Send message 'Percentge Calc. Meth. INV'
     C                     MOVEL'USR2944' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9957  *
      *
     C                     END                             *FI
     C                     END                             *FI
      * Display Customer Portfolio
      * CASE: DTL.Display Customer/Portflio is Blank
     C           #1DCPD    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1DCPD    ZA0054           Display Custome
      * Send message 'Disp Cust/Portfolio REQ'
     C                     MOVEL'USR2974' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9958  *
      *
     C                     ELSE
      * CASE: *OTHERWISE
      * CASE: DTL.Display Customer/Portflio is Valid Values
     C           #1DCPD    IFEQ 'C'                        *IF
     C           #1DCPD    OREQ 'P'
     C                     ELSE
      * CASE: *OTHERWISE
      * Setup message data for message
     C                     MOVEL#1DCPD    ZA0055           Display Custome
      * Send message 'Disp Cust/Portfolio  INV'
     C                     MOVEL'USR2945' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9958  *
      *
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
      * End CPM005
      * CALC: Detail screen function fields
      * 00/Copy member SD9381RSFF - Portfolio Management ICD  *
     C*Edit portfolio managementCalc Detail Function Flds
     C/COPY WNCPYSRC,SD9381RSFF
      * USER: Validate detail screen relations
      * 00/Copy member SD9381RVSR - Portfolio Management ICD  *
     C*Edit portfolio managementValidate Screen Relns
     C/COPY WNCPYSRC,SD9381RVSR
      *================================================================
     CSR         DCEXIT    ENDSR
      /EJECT
     CSR         EBPR##    BEGSR
      *================================================================
      * Process record:
      *================================================================
      * Process update request
     C           W0PMD     CASNE'ADD'     EECHRQ
     C                     END
     C           W0RTN     IFNE *BLANK
      * Error: ROLLBACK any DBF changes
     C                     ROLBK
     C                     GOTO EBEXIT
     C                     ELSE
      * Otherwise COMMIT any DBF changes
     C                     COMIT
     C                     END
     C           W0RTN     IFEQ *BLANK
      * USER: Process command keys
      * 00/Copy member SD9381RPCK - Portfolio Management ICD  *
     C*Edit portfolio managementProcess Command Keys
     C/COPY WNCPYSRC,SD9381RPCK
      * CASE: DTL.*CMD key is *Exit
     C           *IN03     IFEQ '1'                        *IF
     C                     MOVEL'Y2U9999' P0RTN            *Return code
     C                     EXSR ZYEXPG
     C                     END                             *FI
      * Restart program for next record
     C                     MOVEL'N'       W0TRN
     C                     END
      *================================================================
     CSR         EBEXIT    ENDSR
      /EJECT
     CSR         EECHRQ    BEGSR
      *================================================================
      * Process update request
      *================================================================
      * USER: Change DBF record
      * Change Portfolio Manageme - Portfolio Management ICD  *
     C                     EXSR SCCHRC
     C           W0RTN     IFNE *BLANK
      * Data update error
      * Reset screen fields if changed record
     C           W0RTN     CASEQ'Y2U0007' MBFL#1
     C                     END
     C                     ELSE
      * Send message '*Record changed'
     C                     MOVEL'Y2U0012' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     END
      *================================================================
     CSR         EEEXIT    ENDSR
      /EJECT
     CSR         GADSAK    BEGSR
      *================================================================
      * Set key screen conditioning indicators
      *================================================================
     C           W0PMD     COMP 'ADD'                    89*
      *================================================================
     CSR         GAEXIT    ENDSR
      /EJECT
     CSR         GBDSAD    BEGSR
      *================================================================
      * Set detail screen conditioning indicators
      *================================================================
     C           W0PMD     COMP 'ADD'                    89*
      * Protect key fields on detail screen
     C                     SETON                     88    *
     C                     MOVEL'0'       *IN79
     C           WUXUST    IFEQ 'N'                        *IF
     C                     MOVEL'1'       *IN79
     C                     END                             *FI
      * Enable key screen
     C                     SETON                     87    *
      *================================================================
     CSR         GBEXIT    ENDSR
      /EJECT
     CSR         MAIZ#1    BEGSR
      *================================================================
      * Initialise record - except for key fields and "neither" paramete
      *================================================================
     C                     MOVELP3WRTC    #PWRTC           Work Return cod
     C                     Z-ADD*ZERO     #1CDYB           Charging Day Ba
     C                     Z-ADD*ZERO     #1CDVB           Charging Diviso
     C                     Z-ADD*ZERO     #1LCD            Last Change Dat
     C                     MOVEL*BLANK    #1TYLC           Type of Last Ch
     C                     Z-ADD*ZERO     #1ADIF           Acceptable Diff
     C                     MOVEL*BLANK    #1LIAB           Liabilities Inc
     C                     MOVEL*BLANK    #1HLVS           High Level Secu
     C                     MOVEL*BLANK    #1TVPS           Trade/Value Dat
     C                     MOVEL*BLANK    #1PORS           Portfolios Supp
     C                     MOVEL*BLANK    #DCDBS           Charges Day Bas
     C                     MOVEL*BLANK    #DCHDB           Charges Divisor
     C                     MOVEL*BLANK    #1DP97           Dsp Non-Portfol
     C                     MOVEL*BLANK    #1R997           Ref Attached to
     C                     MOVEL*BLANK    #1N997           Narr Attached t
     C                     MOVEL*BLANK    #1DP98           Dsp Consolidate
     C                     MOVEL*BLANK    #1R998           Ref Attached to
     C                     MOVEL*BLANK    #1N998           Narr Attached t
     C                     MOVEL*BLANK    #1R999           Ref Attached to
     C                     MOVEL*BLANK    #1N999           Narr Attached t
     C                     MOVEL*BLANK    #1DINR           Default Instrum
     C                     MOVEL*BLANK    #1SHFC           Show Fees and C
     C                     MOVEL*BLANK    #1LICD           Local Industry
     C                     MOVEL*BLANK    #1SHCC           Show Capital Ch
     C                     MOVEL*BLANK    #1CNCD           Country Code
     C                     MOVEL*BLANK    #1UIIC           Unearned Int in
     C                     MOVEL*BLANK    #1RDCI           Retain Deleted
     C                     MOVEL*BLANK    #1PPPR           Pool Portfolio
     C                     MOVEL*BLANK    #1RCCS           Report Cap Chgs
     C                     MOVEL*BLANK    #DACPD           Acceptable Diff
     C                     MOVEL*BLANK    #1SAVI           Save Notional F
     C                     MOVEL*BLANK    #1NINS           Notional FX Dea
     C                     MOVEL*BLANK    #1PCAM           Percentage Calc
     C                     MOVEL*BLANK    #1DCPD           Display Custome
      *================================================================
     CSR         MAEXIT    ENDSR
      /EJECT
     CSR         MBFL#1    BEGSR
      *================================================================
      * Move @PORTL1 fields to screen
      *================================================================
     C                     MOVELFCPORT    #1PORT           Portfolio Manag
     C                     Z-ADDFCCDYB    #1CDYB           Charging Day Ba
     C                     Z-ADDFCCDVB    #1CDVB           Charging Diviso
     C                     Z-ADDFCLCD     #1LCD            Last Change Dat
     C                     MOVELFCTYLC    #1TYLC           Type of Last Ch
     C                     Z-ADDFCADIF    #1ADIF           Acceptable Diff
     C                     MOVELFCLIAB    #1LIAB           Liabilities Inc
     C                     MOVELFCHLVS    #1HLVS           High Level Secu
     C                     MOVELFCTVPS    #1TVPS           Trade/Value Dat
     C                     MOVELFCPORS    #1PORS           Portfolios Supp
     C                     MOVELFCDP97    #1DP97           Dsp Non-Portfol
     C                     MOVELFCR997    #1R997           Ref Attached to
     C                     MOVELFCN997    #1N997           Narr Attached t
     C                     MOVELFCDP98    #1DP98           Dsp Consolidate
     C                     MOVELFCR998    #1R998           Ref Attached to
     C                     MOVELFCN998    #1N998           Narr Attached t
     C                     MOVELFCR999    #1R999           Ref Attached to
     C                     MOVELFCN999    #1N999           Narr Attached t
     C                     MOVELFCDINR    #1DINR           Default Instrum
     C                     MOVELFCSHFC    #1SHFC           Show Fees and C
     C                     MOVELFCLICD    #1LICD           Local Industry
     C                     MOVELFCSHCC    #1SHCC           Show Capital Ch
     C                     MOVELFCCNCD    #1CNCD           Country Code
     C                     MOVELFCUIIC    #1UIIC           Unearned Int in
     C                     MOVELFCRDCI    #1RDCI           Retain Deleted
     C                     MOVELFCPPPR    #1PPPR           Pool Portfolio
     C                     MOVELFCRCCS    #1RCCS           Report Cap Chgs
     C                     MOVELFCSAVI    #1SAVI           Save Notional F
     C                     MOVELFCNINS    #1NINS           Notional FX Dea
     C                     MOVELFCPCAM    #1PCAM           Percentage Calc
     C                     MOVELFCDCPD    #1DCPD           Display Custome
      * Hold existing record image
     C                     MOVEL@1DBRC    #1DBRC
      *================================================================
     CSR         MBEXIT    ENDSR
      /EJECT
     CSR         MDIZ#K    BEGSR
      *================================================================
      * Initialize key screen
      *================================================================
     C                     MOVELP3WRTC    #PWRTC           Work Return cod
     C                     MOVELP1PORT    #1PORT           Portfolio Manag
      * USER: Initialize key screen
      * 00/Copy member SD9381RIKS - Portfolio Management ICD  *
     C*Edit portfolio managementInitialise Key Screen
     C/COPY WNCPYSRC,SD9381RIKS
      *================================================================
     CSR         MDEXIT    ENDSR
      /EJECT
     CSR         SARVGN    BEGSR
      *================================================================
      * Retrieve Local Ind Code - Local Industry Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSA     KLIST
     C                     KFLD           AOLICD           Local Industry
      * Move fields to key list
     C                     MOVELWULICD    AOLICD           Local Industry
     C           KRSSA     CHAIN@AOREBL              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR0035' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SAEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
      * PAR = DB1 By name
     C                     END
      *================================================================
     CSR         SAEXIT    ENDSR
      /EJECT
     CSR         SBRVGN    BEGSR
      *================================================================
      * get country codes - Country Codes  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSB     KLIST
     C                     KFLD           A4CNCD           Country Code
      * Move fields to key list
     C                     MOVELWUCNCD    A4CNCD           Country Code
     C           KRSSB     CHAIN@A4REBR              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR0067' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
     C                     GOTO SBEXIT
     C                     END
      *
     C           *IN90     IFEQ '0'
      * USER: Process Data record
     C                     MOVEL'Y2U0003' W0RTN            *Return code
     C                     END
      *================================================================
     CSR         SBEXIT    ENDSR
      /EJECT
     CSR         SCCHRC    BEGSR
      *================================================================
      * Change Portfolio Manageme - Portfolio Management ICD  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Set PGM.*Record Data Changed flag
     C                     MOVE 'N'       YARDC   1
      *
      * Move key fields to @PORTL0
     C                     MOVEL#1PORT    FCPORT           Portfolio Manag
      *
     C           KLCHSC    KLIST
     C                     KFLD           FCPORT           Portfolio Manag
     C           KLCHSC    CHAIN@PORTL0              9091  *
      *
     C           *IN90     IFEQ '1'
      * Record not found
     C                     MOVEL'Y2U0009' W0RTN   7
      * Send message '*Record no longer on file'
     C                     MOVEL'Y2U0009' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     GOTO SCEXIT
     C                     END
      *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     GOTO SCEXIT
     C                     END
      *
      * Check for changed record
     C           #1DBRC    IFNE @1DBRC                     IF
     C                     MOVEL'Y2U0007' W0RTN   7
      * Send message '*Update not accepted'
     C                     MOVEL'Y2U0007' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
      * Release record lock
     C                     UNLCKSDPORTL0               91  *
     C                     GOTO SCEXIT
     C                     END                             FI #1DBRC
      * Store record data for null update check
     C                     MOVE @1DBRC    YARDCS
      * USER: Processing after Data read
      * save Last Change Date from record
     C                     Z-ADDFCLCD     WULCD            Last Change Dat
      * Move non-key fields to @PORTL0
     C                     MOVEL#1LIAB    FCLIAB           Liabilities Inc
     C                     MOVEL#1HLVS    FCHLVS           High Level Secu
     C                     MOVEL#1TVPS    FCTVPS           Trade/Value Dat
     C                     MOVEL#1DP97    FCDP97           Dsp Non-Portfol
     C                     MOVEL#1R997    FCR997           Ref Attached to
     C                     MOVEL#1N997    FCN997           Narr Attached t
     C                     MOVEL#1DP98    FCDP98           Dsp Consolidate
     C                     MOVEL#1R998    FCR998           Ref Attached to
     C                     MOVEL#1N998    FCN998           Narr Attached t
     C                     MOVEL#1R999    FCR999           Ref Attached to
     C                     MOVEL#1N999    FCN999           Narr Attached t
     C                     Z-ADD#1CDYB    FCCDYB           Charging Day Ba
     C                     Z-ADD#1CDVB    FCCDVB           Charging Diviso
     C                     Z-ADDWURDNB    FCLCD            Last Change Dat
     C                     MOVEL'A'       FCTYLC           Type of Last Ch
     C                     MOVEL#1DINR    FCDINR           Default Instrum
     C                     MOVEL#1LICD    FCLICD           Local Industry
     C                     MOVEL#1CNCD    FCCNCD           Country Code
     C                     MOVEL#1SHFC    FCSHFC           Show Fees and C
     C                     MOVEL#1SHCC    FCSHCC           Show Capital Ch
     C                     MOVEL#1UIIC    FCUIIC           Unearned Int in
     C                     MOVEL#1PPPR    FCPPPR           Pool Portfolio
     C                     MOVEL#1RDCI    FCRDCI           Retain Deleted
     C                     MOVEL#1RCCS    FCRCCS           Report Cap Chgs
     C                     Z-ADD#1ADIF    FCADIF           Acceptable Diff
     C                     MOVEL#1PORS    FCPORS           Portfolios Supp
     C                     MOVEL#1SAVI    FCSAVI           Save Notional F
     C                     MOVEL#1NINS    FCNINS           Notional FX Dea
     C                     MOVEL#1PCAM    FCPCAM           Percentage Calc
     C                     MOVEL#1DCPD    FCDCPD           Display Custome
      *
      * Set PGM.*Record Data Changed flag
     C           @1DBRC    IFNE YARDCS
     C                     MOVE 'Y'       YARDC
     C                     END
      * USER: Processing before Data update
      * CASE: WRK.Window processing requir. is Yes
     C           WUWDPR    IFEQ 'Y'                        *IF
      * WM call Window Manager - Window manager  *
     C/COPY WNCPYSRC,WN0481CCP1                                           S01408
     C***********          CALL 'WIND01'                                  S01212
     C                     CALL 'WN0010'                                  S01212
     C*********************PARM           ##PGM            Program        S01212
     C                     PARM ##PGM     UPGM   10        Program        S01212
     C*********************PARM *BLANK    FKEY    2        Function Key   S01212
     C                     PARM *BLANK    UFKEY   2        Function Key   S01212
     C*********************PARM           WUMEST           Action  S01212 S01229
     C*********************PARM           WUWMAC           Action  S01212 S01229
     C                     PARM 'A'       UACTCD  1        Action  S01212 S01229
     C                     PARM           DATA             Trans Data     S01212
     C                     PARM *BLANK    W0RTN            Return Code    S01212
     C                     PARM           SPARE 256        Spare Field    LN0355
      * WM Check Return
      * CASE: PAR.*Return code is *User QUIT requested
     C           W0RTN     IFEQ 'Y2U9999'                  *IF
     C                     MOVELW0RTN     P0RTN            *Return code
     C                     EXSR ZYEXPG
     C                     ELSE
      * CASE: PAR.*Return code is WN Window Error
     C           W0RTN     IFEQ 'USR0563'                  *IF
      * Send message 'WN Window Error'
     C                     MOVEL'USR0563' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO SCEXIT                     *QUIT
     C                     ELSE
      * CASE: PAR.*Return code is *DBF update error
     C           W0RTN     IFEQ 'Y2U0004'                  *IF
      * Send message 'WN Database Error'
     C                     MOVEL'USR0567' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO SCEXIT                     *QUIT
     C                     ELSE
      * CASE: PAR.*Return code is *Previous Screen
     C           W0RTN     IFEQ 'USR0790'                  *IF
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO SCEXIT                     *QUIT
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
      * 00/Copy member SD9381RBUW - Portfolio Management ICD  *
     C*Edit portfolio managementBefore Update, Window on
     C/COPY WNCPYSRC,SD9381RBUW
     C                     END                             *FI
      * 00/Copy member SD9381RBDU - Portfolio Management ICD  *
     C*Edit portfolio managementProcessing Before Update
     C/COPY WNCPYSRC,SD9381RBDU
      * Set PGM.*Record Data Changed flag
     C           @1DBRC    IFNE YARDCS
     C                     MOVE 'Y'       YARDC
     C                     END
      * If changed update record otherwise release record
     C           YARDC     IFEQ 'Y'
     C                     UPDAT@PORTL0                91  *
     C                     ELSE
      * Release record lock
     C                     UNLCKSDPORTL0               91  *
     C                     END
     C           *IN91     IFEQ '1'
      * Change error detected
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     ELSE
      *
      * Update saved record image
     C                     MOVEL@1DBRC    #1DBRC
      * DBF change successful
      * USER: Processing after Data update
      * CASE: WRK.Last Change Date NE WRK.Run day number
     C           WULCD     IFNE WURDNB                     *IF
      * only update file controls if record has not been updated already
     C                     Z-ADD*ZERO     WUNORC           No. of Records
     C                     Z-ADD*ZERO     WUNOIN           No. of Inserts
     C                     Z-ADD*ZERO     WUNODL           No. of Deletes
     C                     Z-ADD1         WUNOAM           No. of Amends
      * Change Standing Data Cont - Standing Data Controls  *
     C                     EXSR SDCHRC
     C                     END                             *FI
      * 00/Copy member SD9381RADU - Portfolio Management ICD  *
     C*Edit portfolio managementProcessing After Update
     C/COPY WNCPYSRC,SD9381RADU
     C                     END
      *================================================================
     CSR         SCEXIT    ENDSR
      /EJECT
     CSR         SDCHRC    BEGSR
      *================================================================
      * Change Standing Data Cont - Standing Data Controls  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Set PGM.*Record Data Changed flag
     C                     MOVE 'N'       YBRDC   1
      *
      * Move key fields to @AHREAU
     C                     MOVE *BLANK    AHFLNM           Filename
     C                     MOVEL'SDICDRPD'AHFLNM           Filename
      *
     C           KLCHSD    KLIST
     C                     KFLD           AHFLNM           Filename
     C           KLCHSD    CHAIN@AHREAU              9091  *
      *
     C           *IN90     IFEQ '1'
      * Record not found
     C                     MOVEL'Y2U0009' W0RTN   7
      * Send message '*Record no longer on file'
     C                     MOVEL'Y2U0009' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     GOTO SDEXIT
     C                     END
      *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     GOTO SDEXIT
     C                     END
      *
      * Store record data for null update check
     C                     MOVE QSDFC1    YBRDCS
      * USER: Processing after Data read
     C                     ADD  AHNORC    WUNORC           No. of Records
     C                     ADD  AHNOIN    WUNOIN           No. of Inserts
     C                     ADD  AHNOAM    WUNOAM           No. of Amends
     C                     ADD  AHNODL    WUNODL           No. of Deletes
      * Move non-key fields to @AHREAU
     C                     Z-ADDWUNORC    AHNORC           No. of Records
     C                     Z-ADDWUNOIN    AHNOIN           No. of Inserts
     C                     Z-ADDWUNOAM    AHNOAM           No. of Amends
     C                     Z-ADDWUNODL    AHNODL           No. of Deletes
      *
      * Set PGM.*Record Data Changed flag
     C           QSDFC1    IFNE YBRDCS
     C                     MOVE 'Y'       YBRDC
     C                     END
      * If changed update record otherwise release record
     C           YBRDC     IFEQ 'Y'
     C                     UPDAT@AHREAU                91  *
     C                     ELSE
      * Release record lock
     C                     UNLCKSDFCTLL0               91  *
     C                     END
     C           *IN91     IFEQ '1'
      * Change error detected
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     ELSE
      *
      * DBF change successful
     C                     END
      *================================================================
     CSR         SDEXIT    ENDSR
      /EJECT
     CSR         SERVGN    BEGSR
      *================================================================
      * Get all Midas Modules - MIDAS Modules  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSE     KLIST
     C                     KFLD           BGMODS           Modules
      * Move fields to key list
     C                     MOVE *BLANK    BGMODS           Modules
     C                     MOVEL'MMOD'    BGMODS           Modules
     C           KRSSE     CHAIN@BGREC8              90    *
     C           *IN90     IFEQ '1'
      * Data record not found
     C                     MOVEL'USR0096' W0RTN   7
      * USER: Processing if Data record not found
     C                     MOVEL'Y2U0005' W0RTN            *Return code
      * Setup message data for message
     C                     MOVEL'SDMMODPD'ZA0056           Filename
      * Send message 'Database Error (ICD)'
     C                     MOVEL'USR0377' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     GOTO SEEXIT                     *QUIT
     C                     GOTO SEEXIT
     C                     END
      *
      * USER: Exit processing
      * PAR = DB1 By name
     C                     MOVELBGMTMI    WUMTMI           Midas/Telex Mod
     C                     MOVELBGSWFT    WUSWFT           SWIFT Funds Tra
     C                     MOVELBGSWST    WUSWST           SWIFT Securitie
     C                     MOVELBGSWCL    WUSWCL           SWIFT Customer
     C                     MOVELBGSWSL    WUSWSL           SWIFT Synd Loan
     C                     MOVELBGSWSM    WUSWSM           SWIFT Statement
     C                     MOVELBGSWDL    WUSWDL           SWIFT Dealing
     C                     MOVELBGSDGL    WUSDGL           Standing data/G
     C                     MOVELBGDLFX    WUDLFX           Dealing: FX
     C                     MOVELBGSYLN    WUSYLN           Syndicated Loan
     C                     MOVELBGEXMG    WUEXMG           Exposure Manage
     C                     MOVELBGFNMO    WUFNMO           Financial Model
     C                     MOVELBGSTRT    WUSTRT           Statutory Retur
     C                     MOVELBGCSLN    WUCSLN           Customer Lendin
     C                     MOVELBGRTBN    WURTBN           Retail Banking
     C                     MOVELBGMSDL    WUMSDL           Midas/Swift dir
     C                     MOVELBGSECS    WUSECS           Securities
     C                     MOVELBGAURC    WUAURC           Auto-reconcilia
     C                     MOVELBGBDLI    WUBDLI           Bond Dealers In
     C                     MOVELBGDRSD    WUDRSD           DRS Standing Da
     C                     MOVELBGDRCM    WUDRCM           DRS Control mod
     C                     MOVELBGDRFE    WUDRFE           DRS Foreign Exc
     C                     MOVELBGDRMM    WUDRMM           DRS Money Marke
     C                     MOVELBGDRAR    WUDRAR           DRS Arbitrage
     C                     MOVELBGFDTR    WUFDTR           Funds Transfer
     C                     MOVELBGDRCA    WUDRCA           DRS Common Appl
     C                     MOVELBGFUOP    WUFUOP           Futures & Optio
     C                     MOVELBGMTSL    WUMTSL           Midas/Telex Syn
     C                     MOVELBGMTDL    WUMTDL           Midas/Telex Dea
     C                     MOVELBGMTGL    WUMTGL           Midas/Telex Gen
     C                     MOVELBGMTCL    WUMTCL           Midas/Telex Cus
     C                     MOVELBGNWMI    WUNWMI           Message Managem
     C                     MOVELBGFIIN    WUFIIN           FRA/IRS Indicat
     C                     MOVELBGDLMM    WUDLMM           Dealing: MM
     C                     MOVELBGINCN    WUINCN           Internal Contra
     C                     MOVELBGTRMG    WUTRMG           Treasury Manage
     C                     MOVELBGRKMG    WURKMG           Interest Risk M
     C                     MOVELBGTSKY    WUTSKY           Testkey
     C                     MOVELBGMIDQ    WUMIDQ           Midas/Q
     C                     MOVELBGMFIC    WUMFIC           Microfiche
     C                     MOVELBGIOAC    WUIOAC           Interest on acc
     C                     MOVELBGWDPR    WUWDPR           Window processi
     C                     MOVELBGSARP    WUSARP           SAR's processin
     C                     MOVELBGFRIN    WUFRIN           French return i
     C                     MOVELBGLRIN    WULRIN           Lux return indi
     C                     MOVELBGDRIN    WUDRIN           Dutch return in
     C                     MOVELBGGRIN    WUGRIN           German return i
     C                     MOVELBGBRIN    WUBRIN           Belgian return
     C                     MOVELBGIRIN    WUIRIN           Italian return
     C                     MOVELBGSWEI    WUSWEI           Swift External
     C                     MOVELBGPFMG    WUPFMG           Portfolio Manag
     C                     MOVELBGCRMG    WUCRMG           Credit Manageme
     C                     MOVELBGHORP    WUHORP           Head Office Rep
     C                     MOVELBGAVBL    WUAVBL           Average Balance
     C                     MOVELBGMARG    WUMARG           Margins
     C                     MOVELBGCFMT    WUCFMT           Confirmation Ma
     C                     MOVELBGMIMX    WUMIMX           Mimix
     C                     MOVELBGRCFI    WURCFI           Report Control
     C                     MOVELBGAMIN    WUAMIN           Amps Int
     C                     MOVELBGSWRT    WUSWRT           Swiss Returns
     C                     MOVELBGFLND    WUFLND           Fiduciary Loans
     C                     MOVELBGLMCR    WULMCR           Portfolio Lendi
     C                     MOVELBGCNTX    WUCNTX           Cantonal Tax
     C                     MOVELBGSTDU    WUSTDU           Stamp Duty
     C                     MOVELBGUDRS    WUUDRS           Use DRS Shortna
     C                     MOVELBGCHDL    WUCHDL           Chips Dealing
     C                     MOVELBGCHLN    WUCHLN           Chips Lending
     C                     MOVELBGCHOB    WUCHOB           Chips Opening B
     C                     MOVELBGCHIP    WUCHIP           CHIPS
     C                     MOVELBGCHDI    WUCHDI           Chips Direct Li
     C                     MOVELBGOPDK    WUOPDK           Optical Disk
     C                     MOVELBGMBIN    WUMBIN           Multi-branching
     C                     MOVELBGNNST    WUNNST           Leo Data Nucleu
     C                     MOVELBGNOST    WUNOST           Leo Letters of
     C                     MOVELBGNPST    WUNPST           Leo Collections
     C                     MOVELBGNQST    WUNQST           Leo Bills/Finan
     C                     MOVELBGNRST    WUNRST           Leo Bankers Acc
     C                     MOVELBGNSST    WUNSST           Leo Reimburseme
     C                     MOVELBGNTST    WUNTST           Taxes
     C                     MOVELBGNUST    WUNUST           History & Audit
     C                     MOVELBGNVST    WUNVST           Management Acco
     C                     MOVELBGNWST    WUNWST           IBLC Returns
     C                     MOVELBGNXST    WUNXST           Retail 3
     C                     MOVELBGNYST    WUNYST           Interest on Acc
     C                     MOVELBGNZST    WUNZST           Midas Export Da
     C                     MOVELBGN0ST    WUN0ST           Analytical Acco
     C                     MOVELBGN1ST    WUN1ST           User Defined Co
     C                     MOVELBGN2ST    WUN2ST           Midas-Plato Int
     C                     MOVELBGN3ST    WUN3ST           Midas-Trade Inn
     C******************** MOVELBGN4ST    WUN4ST           Reserved for LaCPB001
     C                     MOVELBGN4ST    WUN4ST           Private BankingCPB001
     C                     MOVELBGN5ST    WUN5ST           Reserved for La
     C                     MOVELBGN6ST    WUN6ST           Reserved for La
     C                     MOVELBGN7ST    WUN7ST           Reserved for La
     C                     MOVELBGN8ST    WUN8ST           Reserved for La
     C                     MOVELBGN9ST    WUN9ST           Reserved for La
     C                     MOVELBGOAST    WUOAST           Reserved for La
     C                     MOVELBGOBST    WUOBST           Reserved for La
     C                     MOVELBGOCST    WUOCST           Reserved for La
     C                     MOVELBGODST    WUODST           Reserved for La
     C                     MOVELBGOEST    WUOEST           Reserved for La
     C                     MOVELBGOFST    WUOFST           Reserved for La
     C                     MOVELBGOGST    WUOGST           Reserved for La
     C                     MOVELBGOHST    WUOHST           Reserved for La
     C                     MOVELBGOIST    WUOIST           Reserved for La
     C                     MOVELBGOJST    WUOJST           Reserved for La
     C                     MOVELBGOKST    WUOKST           Reserved for La
     C                     MOVELBGOLST    WUOLST           Reserved for La
     C                     MOVELBGOMST    WUOMST           Reserved for La
     C                     MOVELBGONST    WUONST           Reserved for La
     C                     MOVELBGOOST    WUOOST           Reserved for La
     C                     MOVELBGOPST    WUOPST           Reserved for La
     C                     MOVELBGOQST    WUOQST           Reserved for La
     C                     MOVELBGORST    WUORST           Reserved for La
     C                     MOVELBGOSST    WUOSST           Reserved for La
      *================================================================
     CSR         SEEXIT    ENDSR
      /EJECT
     CSR         Y0SET     BEGSR
      *================================================================
      * Set cursor by *SET CURSOR data
      *================================================================
      *================================================================
     CSR         Y0EXIT    ENDSR
      /EJECT
     CSR         Y1SET     BEGSR
      *================================================================
      * Set cursor by *SET CURSOR data
      *================================================================
      *================================================================
     CSR         Y1EXIT    ENDSR
      /EJECT
     CSR         Y8TST     BEGSR
      *================================================================
      * Test cursor
      *================================================================
     C           @#DFMT    IFEQ '#RCDKEY'
      * KEY Screen
     C                     Z-ADD@#RWCL    ZINPOS  50
     C           ZINPOS    DIV  256       W0CRW
     C                     MVR            W0CCL
     C                     END
     C           @#DFMT    IFEQ '#RCDDTL1'
      * DETAIL Screen
     C                     Z-ADD@#RWCL    ZINPOS  50
     C           ZINPOS    DIV  256       W0CRW
     C                     MVR            W0CCL
     C                     END
      *================================================================
     CSR         Y8EXIT    ENDSR
      /EJECT
     CSR         Y9CLR     BEGSR
      *================================================================
      * Clear *SET CURSOR data
      *================================================================
      *================================================================
     CSR         Y9EXIT    ENDSR
      /EJECT
     CSR         ZASNMS    BEGSR
      *================================================================
      * Send message to program's message queue
      *================================================================
     C           ZAPGMQ    IFEQ *BLANK
     C                     MOVEL##PGM     ZAPGMQ
     C                     END
      * If no message file specified, use default
     C           ZAMSGF    IFEQ *BLANK
     C                     MOVELZADFMF    ZAMSGF
     C                     END
     C                     CALL 'Y2SNMGC'
     C                     PARM           ZAPGMQ 10        Program queue
     C                     PARM           ZAPGRL  5        Rel queue
     C                     PARM           ZAMSID  7        Message ID
     C                     PARM           ZAMSGF 10        Message file
     C                     PARM           ZAMSDA132        Message data
     C                     PARM           ZAMSTP  7        Message type
      * Clear all fields for default mechanism next time
     C                     MOVEL*BLANK    ZAPGMQ
     C                     MOVEL*BLANK    ZAPGRL
     C                     MOVEL*BLANK    ZAMSID
     C                     MOVEL*BLANK    ZAMSGF
     C                     MOVEL*BLANK    ZAMSDA
     C                     MOVEL*BLANK    ZAMSTP
      *================================================================
     CSR         ZAEXIT    ENDSR
      /EJECT
     CSR         ZHHPKY    BEGSR
      *================================================================
      * Display HELP text
      *================================================================
      * Signal help request
     C                     MOVEL'Y'       W0HLP   1
      *
      * Extract cursor row and column
     C           @#RWCL    DIV  256       ZHCSRW  50       Row
     C                     MVR            ZHCSCL  50       Column
      *
      * Save cursor position for redisplay
     C                     Z-ADDZHCSRW    ZZCSRW  30       Row
     C                     Z-ADDZHCSCL    ZZCSCL  30       Column
      *
      *
     C                     CALL 'YDDSHPR'
     C                     PARM ##PGM     W0HPMB 10        Help text sourc
     C                     PARM *BLANK    YYHPFL 10        Help text file
     C                     PARM *BLANK    YYHPLB 10        Help text libra
     C                     PARM           W0RTN   7
     C                     PARM '*START'  YYHLVN 10        Help label
     C                     PARM '*NORMAL' YYUSOP 10        Options
     C                     PARM ZHCSRW    YYRW    50       Row
     C                     PARM ZHCSCL    YYCL    50       Column
     C                     PARM 1         YYLGCT  50       # of grps
     C                     PARM W0GRP     YYLGVN 10        Label grps
      *
      * Clear set cursor DDS indicator
     C  N94                MOVEL'OFF'     WCSRLC
     C  N94                SETON                     94    *
      *================================================================
     CSR         ZHEXIT    ENDSR
      /EJECT
     CSR         ZXEXPG    BEGSR
      *================================================================
      * Cancel and exit from key screen
      *================================================================
      * USER: Exit program processing
      * 00/Copy member SD9381REPP - Portfolio Management ICD  *
     C*Edit portfolio managementExit Program Processing
     C/COPY WNCPYSRC,SD9381REPP
      * Fast exit processing
      * CASE: KEY.*CMD key is *Exit
     C           *IN03     IFEQ '1'                        *IF
     C                     MOVEL'Y2U9999' P0RTN            *Return code
     C                     EXSR ZYEXPG
     C                     END                             *FI
     C                     MOVEL*BLANK    P0RTN
     C                     EXSR ZYEXPG
      *================================================================
     CSR         ZXEXIT    ENDSR
      /EJECT
     CSR         ZYEXPG    BEGSR
      *================================================================
      * Exit program: Direct
      *================================================================
      * ROLLBACK any uncommitted DBF changes
     C                     ROLBK                       90
      *
      * Terminate program
     C                     SETON                     LR
      *
      * Exit program
     C                     RETRN
      *
      *================================================================
     CSR         ZYEXIT    ENDSR
      /EJECT
     CSR         ZZINIT    BEGSR
      *================================================================
      * Initialisation
      *================================================================
     C           W0ICL     IFEQ *BLANK
     C                     MOVEL'Y'       W0ICL   1        *Initial call
     C                     ELSE
     C                     MOVEL'N'       W0ICL
     C                     END
     C                     MOVE *BLANK    P0RTN
     C                     MOVE *BLANK    W0RTN   7
     C                     MOVEL*BLANK    W0RSL   1
     C                     MOVEL*BLANK    W0RSF   1
     C                     MOVEL*ZEROS    W0RTW   90
     C                     MOVEL'400'     W0ENV   3
      * Setup job date/time
      *
     C                     Z-ADDUDATE     ##JDT
      * Set century digit (If YY prior to 1940 treat as 20YY)
     C           ##JYY     IFLT 40
     C                     Z-ADD1         ##JCC
     C                     ELSE
     C                     Z-ADD0         ##JCC
     C                     END
     C                     TIME           ##JTM
      * Update screen time
     C                     TIME           ##TME   60
      * Obtain default message file
     C           *NAMVAR   DEFN Y2MGFLA   ZADFMF 10
     C                     IN   ZADFMF
      * Define work field ZALIGN Screen Fun Field
     C                     MOVEL*BLANK    WUZASF 16
      * Define work field ZALIGN File Field
     C                     MOVEL*BLANK    WUZAFF 16
      * Define work field Err Code
     C                     MOVEL*BLANK    WUERCD  1
      * Define work field CPM005
     C                     MOVEL*BLANK    WUXUST  1
      * Define work field Test ? in Key Field
     C                     MOVEL*BLANK    WUTQKF  1
      * Define work field PM Instrument Code (Lndr)
     C                     MOVEL*BLANK    WUINNR  3
      * Define work field Access Pgm Option
     C                     MOVEL*BLANK    WUAPOP  7
      * Define work field Access Pgm Return Code
     C                     MOVEL*BLANK    WUAPRC  7
      * Define work field Local Industry Code
     C                     MOVEL*BLANK    WULICD  3
      * Define work field Country Code
     C                     MOVEL*BLANK    WUCNCD  2
      * Define work field Retain deletd cust info
     C                     Z-ADD*ZERO     WURDIN  20
      * Define work field Pool portfolios saved val
     C                     MOVEL*BLANK    WUPPSV  1
      * Define work field SAR Description
     C                     MOVEL*BLANK    WUG1TX 50
      * Define work field work return code (6A)
     C                     MOVEL*BLANK    WUWRC6  6
      * Define work field Run day number
     C                     Z-ADD*ZERO     WURDNB  50
      * Define work field Last Change Date
     C                     Z-ADD*ZERO     WULCD   50
      * Define work field Window processing requir.
     C                     MOVEL*BLANK    WUWDPR  1
      * Define work field No. of Records
     C                     Z-ADD*ZERO     WUNORC  50
      * Define work field No. of Inserts
     C                     Z-ADD*ZERO     WUNOIN  50
      * Define work field No. of Deletes
     C                     Z-ADD*ZERO     WUNODL  50
      * Define work field No. of Amends
     C                     Z-ADD*ZERO     WUNOAM  50
      * Define work field Midas Run Date
     C                     MOVEL*BLANK    WUMRDT  7
      * Define work field Set Up Complete
     C                     MOVEL*BLANK    WUSUC   1
      * Define work field Date format flag
     C                     MOVEL*BLANK    WUDFF   1
      * Define work field Multi-branching Indicator
     C                     MOVEL*BLANK    WUMBIN  1
      * Define work field Midas/Telex Module Ind.
     C                     MOVEL*BLANK    WUMTMI  1
      * Define work field SWIFT Funds Transfer
     C                     MOVEL*BLANK    WUSWFT  1
      * Define work field SWIFT Securities Trading
     C                     MOVEL*BLANK    WUSWST  1
      * Define work field SWIFT Customer Lending
     C                     MOVEL*BLANK    WUSWCL  1
      * Define work field SWIFT Synd Loans (REDUN)
     C                     MOVEL*BLANK    WUSWSL  1
      * Define work field SWIFT Statements
     C                     MOVEL*BLANK    WUSWSM  1
      * Define work field SWIFT Dealing
     C                     MOVEL*BLANK    WUSWDL  1
      * Define work field Standing data/Gen.Ledger
     C                     MOVEL*BLANK    WUSDGL  1
      * Define work field Dealing: FX
     C                     MOVEL*BLANK    WUDLFX  1
      * Define work field Syndicated Loans (REDUN)
     C                     MOVEL*BLANK    WUSYLN  1
      * Define work field Exposure Management
     C                     MOVEL*BLANK    WUEXMG  1
      * Define work field Financial Modeller
     C                     MOVEL*BLANK    WUFNMO  1
      * Define work field Statutory Returns
     C                     MOVEL*BLANK    WUSTRT  1
      * Define work field Customer Lending
     C                     MOVEL*BLANK    WUCSLN  1
      * Define work field Retail Banking
     C                     MOVEL*BLANK    WURTBN  1
      * Define work field Midas/Swift direct link
     C                     MOVEL*BLANK    WUMSDL  1
      * Define work field Securities
     C                     MOVEL*BLANK    WUSECS  1
      * Define work field Auto-reconciliations
     C                     MOVEL*BLANK    WUAURC  1
      * Define work field Bond Dealers Interface
     C                     MOVEL*BLANK    WUBDLI  1
      * Define work field DRS Standing Data
     C                     MOVEL*BLANK    WUDRSD  1
      * Define work field DRS Control module
     C                     MOVEL*BLANK    WUDRCM  1
      * Define work field DRS Foreign Exchange
     C                     MOVEL*BLANK    WUDRFE  1
      * Define work field DRS Money Market
     C                     MOVEL*BLANK    WUDRMM  1
      * Define work field DRS Arbitrage
     C                     MOVEL*BLANK    WUDRAR  1
      * Define work field Funds Transfer
     C                     MOVEL*BLANK    WUFDTR  1
      * Define work field DRS Common Applications
     C                     MOVEL*BLANK    WUDRCA  1
      * Define work field Futures & Options
     C                     MOVEL*BLANK    WUFUOP  1
      * Define work field Midas/Telex Synd. Loans
     C                     MOVEL*BLANK    WUMTSL  1
      * Define work field Midas/Telex Dealing
     C                     MOVEL*BLANK    WUMTDL  1
      * Define work field Midas/Telex Gen. Ledger
     C                     MOVEL*BLANK    WUMTGL  1
      * Define work field Midas/Telex Cust. Lending
     C                     MOVEL*BLANK    WUMTCL  1
      * Define work field Message Management
     C                     MOVEL*BLANK    WUNWMI  1
      * Define work field FRA/IRS Indicator
     C                     MOVEL*BLANK    WUFIIN  1
      * Define work field Dealing: MM
     C                     MOVEL*BLANK    WUDLMM  1
      * Define work field Internal Contracts
     C                     MOVEL*BLANK    WUINCN  1
      * Define work field Treasury Management
     C                     MOVEL*BLANK    WUTRMG  1
      * Define work field Interest Risk Management
     C                     MOVEL*BLANK    WURKMG  1
      * Define work field Testkey
     C                     MOVEL*BLANK    WUTSKY  1
      * Define work field Midas/Q
     C                     MOVEL*BLANK    WUMIDQ  1
      * Define work field Microfiche
     C                     MOVEL*BLANK    WUMFIC  1
      * Define work field Interest on accounts
     C                     MOVEL*BLANK    WUIOAC  1
      * Define work field SAR's processing required
     C                     MOVEL*BLANK    WUSARP  1
      * Define work field French return indicator
     C                     MOVEL*BLANK    WUFRIN  1
      * Define work field Lux return indicator
     C                     MOVEL*BLANK    WULRIN  1
      * Define work field Dutch return indicator
     C                     MOVEL*BLANK    WUDRIN  1
      * Define work field German return indicator
     C                     MOVEL*BLANK    WUGRIN  1
      * Define work field Belgian return indicator
     C                     MOVEL*BLANK    WUBRIN  1
      * Define work field Italian return indicator
     C                     MOVEL*BLANK    WUIRIN  1
      * Define work field Swift External Interface
     C                     MOVEL*BLANK    WUSWEI  1
      * Define work field Portfolio Management
     C                     MOVEL*BLANK    WUPFMG  1
      * Define work field Credit Management.
     C                     MOVEL*BLANK    WUCRMG  1
      * Define work field Head Office Reporting
     C                     MOVEL*BLANK    WUHORP  1
      * Define work field Average Balances
     C                     MOVEL*BLANK    WUAVBL  1
      * Define work field Margins
     C                     MOVEL*BLANK    WUMARG  1
      * Define work field Confirmation Matching
     C                     MOVEL*BLANK    WUCFMT  1
      * Define work field Mimix
     C                     MOVEL*BLANK    WUMIMX  1
      * Define work field Report Control Facility
     C                     MOVEL*BLANK    WURCFI  1
      * Define work field Amps Int
     C                     MOVEL*BLANK    WUAMIN  1
      * Define work field Swiss Returns
     C                     MOVEL*BLANK    WUSWRT  1
      * Define work field Fiduciary Loans & Deposit
     C                     MOVEL*BLANK    WUFLND  1
      * Define work field Portfolio Lending
     C                     MOVEL*BLANK    WULMCR  1
      * Define work field Cantonal Tax
     C                     MOVEL*BLANK    WUCNTX  1
      * Define work field Stamp Duty
     C                     MOVEL*BLANK    WUSTDU  1
      * Define work field Use DRS Shortnames
     C                     MOVEL*BLANK    WUUDRS  1
      * Define work field Chips Dealing
     C                     MOVEL*BLANK    WUCHDL  1
      * Define work field Chips Lending
     C                     MOVEL*BLANK    WUCHLN  1
      * Define work field Chips Opening Balance
     C                     MOVEL*BLANK    WUCHOB  1
      * Define work field CHIPS
     C                     MOVEL*BLANK    WUCHIP  1
      * Define work field Chips Direct Link
     C                     MOVEL*BLANK    WUCHDI  1
      * Define work field Optical Disk
     C                     MOVEL*BLANK    WUOPDK  1
      * Define work field Leo Data Nucleus
     C                     MOVEL*BLANK    WUNNST  1
      * Define work field Leo Letters of Credit
     C                     MOVEL*BLANK    WUNOST  1
      * Define work field Leo Collections
     C                     MOVEL*BLANK    WUNPST  1
      * Define work field Leo Bills/Financing
     C                     MOVEL*BLANK    WUNQST  1
      * Define work field Leo Bankers Acceptances
     C                     MOVEL*BLANK    WUNRST  1
      * Define work field Leo Reimbursements
     C                     MOVEL*BLANK    WUNSST  1
      * Define work field Taxes
     C                     MOVEL*BLANK    WUNTST  1
      * Define work field History & Audit Facility
     C                     MOVEL*BLANK    WUNUST  1
      * Define work field Management Accounts
     C                     MOVEL*BLANK    WUNVST  1
      * Define work field IBLC Returns
     C                     MOVEL*BLANK    WUNWST  1
      * Define work field Retail 3
     C                     MOVEL*BLANK    WUNXST  1
      * Define work field Interest on Accounts 3
     C                     MOVEL*BLANK    WUNYST  1
      * Define work field Midas Export Data Module
     C                     MOVEL*BLANK    WUNZST  1
      * Define work field Analytical Accounting
     C                     MOVEL*BLANK    WUN0ST  1
      * Define work field User Defined Correspondnc
     C                     MOVEL*BLANK    WUN1ST  1
      * Define work field Midas-Plato Interface
     C                     MOVEL*BLANK    WUN2ST  1
      * Define work field Midas-Trade Innovation If
     C                     MOVEL*BLANK    WUN3ST  1
      **Define*work*field*Reserved for Later Use 41                       CPB001
      * Define work field Private Banking                                 CPB001
     C                     MOVEL*BLANK    WUN4ST  1
      * Define work field Reserved for Later Use 42
     C                     MOVEL*BLANK    WUN5ST  1
      * Define work field Reserved for Later Use 43
     C                     MOVEL*BLANK    WUN6ST  1
      * Define work field Reserved for Later Use 44
     C                     MOVEL*BLANK    WUN7ST  1
      * Define work field Reserved for Later Use 45
     C                     MOVEL*BLANK    WUN8ST  1
      * Define work field Reserved for Later Use 46
     C                     MOVEL*BLANK    WUN9ST  1
      * Define work field Reserved for Later Use 47
     C                     MOVEL*BLANK    WUOAST  1
      * Define work field Reserved for Later Use 48
     C                     MOVEL*BLANK    WUOBST  1
      * Define work field Reserved for Later Use 49
     C                     MOVEL*BLANK    WUOCST  1
      * Define work field Reserved for Later Use 50
     C                     MOVEL*BLANK    WUODST  1
      * Define work field Reserved for Later Use 51
     C                     MOVEL*BLANK    WUOEST  1
      * Define work field Reserved for Later Use 52
     C                     MOVEL*BLANK    WUOFST  1
      * Define work field Reserved for Later Use 53
     C                     MOVEL*BLANK    WUOGST  1
      * Define work field Reserved for Later Use 54
     C                     MOVEL*BLANK    WUOHST  1
      * Define work field Reserved for Later Use 55
     C                     MOVEL*BLANK    WUOIST  1
      * Define work field Reserved for Later Use 56
     C                     MOVEL*BLANK    WUOJST  1
      * Define work field Reserved for Later Use 57
     C                     MOVEL*BLANK    WUOKST  1
      * Define work field Reserved for Later Use 58
     C                     MOVEL*BLANK    WUOLST  1
      * Define work field Reserved for Later Use 59
     C                     MOVEL*BLANK    WUOMST  1
      * Define work field Reserved for Later Use 60
     C                     MOVEL*BLANK    WUONST  1
      * Define work field Reserved for Later Use 61
     C                     MOVEL*BLANK    WUOOST  1
      * Define work field Reserved for Later Use 62
     C                     MOVEL*BLANK    WUOPST  1
      * Define work field Reserved for Later Use 63
     C                     MOVEL*BLANK    WUOQST  1
      * Define work field Reserved for Later Use 64
     C                     MOVEL*BLANK    WUORST  1
      * Define work field Reserved for Later Use 65
     C                     MOVEL*BLANK    WUOSST  1
      * Define work field SAR number field
     C                     MOVEL*BLANK    WUSARN  6
      * Define work field Access obj dummy DS (76)
     C                     MOVEL*BLANK    WUFDY  76
      * Flag no *SET CURSOR in the program
     C                     MOVE 'N'       YSETCS  1
     C                     MOVE *BLANK    WCSRLC  3
      * Open files
      * Begin commit control
     C                     CALL 'Y2BGCMC'
     C                     PARM           W0RTN   7
     C           W0RTN     IFNE *BLANK
     C           W0RTN     ANDNE'CPF8351'
     C                     EXSR ZYEXPG
     C                     END
      * Define *Synon program work fields
     C                     MOVEL*BLANKS   W0CFL  10        *Cursor field
     C                     Z-ADD*ZEROS    W0CRW   50       *Cursor row
     C                     Z-ADD*ZEROS    W0CCL   50       *Cursor column
      * Move main file information to JOB context
     C                     MOVE @1FFL     ZZFFL  10        Main file name
     C                     MOVE @1FLB     ZZFLB  10        Main file lib
     C                     MOVE @1FMB     ZZFMB  10        Main file mbr
     C                     MOVE ZZFFL     @1FFL  10
     C                     MOVE ZZFLB     @1FLB  10
     C                     MOVE ZZFMB     @1FMB  10
     C                     CALL 'Y2QLVNR'
     C                     PARM           ZZFFL  10
     C                     PARM           ZZFLB  10
     C                     PARM           ZZFQL  21        LIBRARY/FILE
     C                     OPEN SD9381R#
     C                     OPEN SDPORTL1
     C                     OPEN SDINDSL1
     C                     OPEN SDCTRYL1
     C                     OPEN SDMMODL1
     C                     OPEN SDPORTL0
     C                     OPEN SDFCTLL0
     C                     MOVEL'N'       W0PMT   1
      * Set to *CHANGE mode
     C                     MOVEL'CHG'     W0PMD   3
     C                     MOVEL*BLANK    W0GRP   1
      * USER: Initialize program
      * SD9381R precompiler - Portfolio Management ICD  *
      * Copyright Statement 1994 - Standard Functions  *
      * Get Rundate - Rundate  *
     C           *NAMVAR   DEFN           RUNDAT
     C                     IN   RUNDAT
     C                     MOVE MRDT      ##MRDT  7        RUN DATE
     C                     MOVE MRDT      WUMRDT
     C                     MOVE RDNB      WURDNB           RUNDAY NO.
     C                     MOVE SUC       WUSUC            SET UP COMPLT
     C                     MOVE DFF       WUDFF            DTE FMT FLAG
     C                     MOVE MBIN      WUMBIN           MULTI BR. IND
      * PM ICD data structure - Portfolio Management ICD  *
      * Get all Midas Modules - MIDAS Modules  *
     C                     EXSR SERVGN
      * Check that Private Banking Module is switched on                  CPB001
     C           WUN4ST    IFEQ 'Y'                                       CPB001
     C                     MOVE '1'       *IN80                           CPB001
     C                     ELSE                                           CPB001
     C                     MOVE '0'       *IN80                           CPB001
     C                     ENDIF                                          CPB001
      * Start CPM005
      * Check that PM Focus Group enhancement is switched on
     C                     MOVEL'CPM005'  WUSARN           SAR number fiel
     C                     MOVEL*BLANK    WUAPRC           Access Pgm Retu
      * SAR switched on check - Standard Functions  *
     C                     CALL 'AOSARDR0'             90  SAR switched on
     C           WUAPRC    PARM WUAPRC    WQ0034  7        Access Pgm Retu
     C                     PARM '*VERIFY' WQ0035  7        Option for ACCO
     C           WUSARN    PARM WUSARN    WQ0036  6        SAR number fiel
     C                     PARM WUFDY     WQ0037 76        Access obj dumm
      *
     C           *IN90     IFEQ '1'
      * Call to program ended in error
     C                     MOVEL'Y2U0032' W0RTN
     C                     MOVEL*BLANKS   W0CLPG 10
     C                     MOVEL'AOSARDR0'W0CLPG
      * Send message '*Error occured on CALL...'
     C                     MOVEL'Y2U0032' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     MOVELW0CLPG    ZAMSDA           Message data
     C                     EXSR ZASNMS
     C                     END
      *
      * Check return code.
      * CASE: WRK.Access Pgm Return Code is *Normal
     C           WUAPRC    IFEQ *BLANK                     *IF
     C                     MOVEL'Y'       WUXUST           CPM005
     C                     ELSE
      * CASE: *OTHERWISE
     C                     MOVEL'N'       WUXUST           CPM005
     C                     END                             *FI
      * End CPM005
      * 00/Copy member SD9381RFPG - Portfolio Management ICD  *
      * 00/Copy member SD9381REPG - Portfolio Management ICD  *
      * 00/Copy member SD9381RIPG - Portfolio Management ICD  *
      * 00/Copy member SD9381RCPG - Portfolio Management ICD  *
     C*Edit portfolio managementInitialise Program C-spec
     C/COPY WNCPYSRC,SD9381RCPG
      * 00/Copy member SD9381ROPG - Portfolio Management ICD  *
      *================================================================
     CSR         ZZEXIT    ENDSR
      /EJECT
     CSR         *PSSR     BEGSR
      *****************************************************************
      *                                                               *
      * *PSSR  - Program exception error routine                      *
      *          Called automatically if a program error occurs,      *
      *          or directly by the program code using EXSR.          *
      *          This subroutine DUMPs the program just once.         *
      *                                                               *
      *****************************************************************
      *
      * Core function specific processing.
      *
     C/COPY WNCPYSRC,SD9381RPSC
      *
      * Start of PSSR user point.
      *
     C/COPY WNCPYSRC,SD9381RPS1
      *
      * Standard Midas PSSR processing.
      *
     C/COPY SDCPYSRC,SDPSSRICD
      *
      * End of PSSR user point.
      *
     C/COPY WNCPYSRC,SD9381RPS2
      *
      *================================================================
     CSR                   ENDSR
      *================================================================
     O*Edit portfolio managementInitialise Program O-spec
     O/COPY WNCPYSRC,SD9381ROPG
** CPY@     : Copyright notice for inclusion in all programs
(c) Misys International Banking Systems Ltd. 2001
