     H        1   Y
      *****************************************************************
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas SD Fontis interface ICD maintenance')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  SD9421R - Midas SD Fontis Interface ICD Maintenance.         *
      *                                                               *
      *  Function:  This program maintains the Fontis Interface ICD   *
      *             record.                                           *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. CSD101             Date 07Dec18               *
      *  Prev Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD031             Date 10Apr06               *
      *                 CSD027             Date 09Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      *                 CSD003             Date 01Jul99               *
      * Midas DBA 3.01 -----------------------------------------------*
      *                 CGL009             Date 18May99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CGL004             Date 04FEB97               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD101 - Password Encryption                                 *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD031 - Enhanced Centralised Static Data (Recompile)        *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - Program removed from SD model.                    *
      *  CGL009 - Midas-Fontis Inter-Account Transfers (IAT) and      *
      *           Third Party Payments (TPP) Interface                *
      *  CGL004 - Midas-Fontis Interface:                             *
      *           New function.                                       *
      *                                                               *
      *****************************************************************
     F*Fontis Interface ICD Mnt Initialise Program F-spec
     F/COPY WNCPYSRC,SD9421RFPG
     FSD9421R#CF  E                    WORKSTN                        UC
     F                                              KINFDS INFDS#
     F                                              KINFSR *PSSR
      * DSP: Midas SD Fontis interface ICD maintenance
      *
     FSDFONTL1IF  E           K        DISK                           UC
     F                                              KINFDS INFDS1
     F                                              KINFSR *PSSR
      * RTV : Midas SD Fontis Interface ICD retrieval
      *
     FSDMMODL1IF  E           K        DISK                           UC
     F                                              KINFDS ID0001
     F                                              KINFSR *PSSR
      * RTV : Midas SD Midas module flags retrieval
      *
     FSDFONTL0UF  E           K        DISK                           UC
     F                                              KCOMIT
     F                                              KINFDS ID0002
     F                                              KINFSR *PSSR
      * UPD : Midas SD Fontis Interface ICD update
      *
     FSDFCTLL0UF  E           K        DISK                           UC
     F                                              KCOMIT
     F                                              KINFDS ID0003
     F                                              KINFSR *PSSR
      * UPD : Midas SD Standing data controls update
      *
     FFDDTSTL1IF  E           K        DISK                           UC  CGL009
     F                                              KINFDS ID0004         CGL009
     F                                              KINFSR *PSSR          CGL009
      * RTV  : BIS Midas ABS Deal Deal sub-type                           CGL009
     E* Description     : Copyright notice for inclusion in all programs
     E*
     E********************************************************************
     E                    CPY@    1   1 80               Copyright array
     E*Fontis Interface ICD Mnt Initialise Program E-spec
     E/COPY WNCPYSRC,SD9421REPG
     I*
     I* Description     : Copyright notice for inclusion in all programs
     I*
     I/COPY QWINDSRC,SD9420GDTA                                           S01229
     I*Fontis Interface ICD Mnt Initialise Program I-spec
     I/COPY WNCPYSRC,SD9421RIPG
      /EJECT
      * Data structures:
     IPGMDS     ESDSY2PGDSP
      * Program data structure
     IJBDTTM      DS
      * Job date/time
     I                                        1   70##JDT
     I                                        1   10##JCC
     I                                        2   30##JYY
     I                                        4   50##JMM
     I                                        6   70##JDD
     I                                        8  130##JTM
     I                                        8   90##JHH
     I                                       10  110##JNN
     I                                       12  130##JSS
      * ABO DEFINE LARGE STRING FOR CL CMD
     IYARTCM      DS                            512
     I                                        1   1 DUMMY1
     IINFDS#    E DSY2I#DSP
      * Display file information data structure
      *
     IINFDS1    E DSY2I1DSP
      * File information data structure
      *
     I@1DBRC    E DSSDFONTL0
      * UPD : Midas SD Fontis Interface ICD update
      * Current/previous master file format fields for change control
      *
     I***#1DBRC**    DS                            139                    CGL009
     I#1DBRC      DS                            200                       CGL009
      * Stored master file format fields
     I                                        1   1 #1DB1
      *
     I***YARDCS**    DS                            139                    CGL009
     IYARDCS      DS                            200                       CGL009
     IQSDFC1    E DSSDFCTLL0
      * UPD : Midas SD Standing data controls update
     IYBRDCS      DS                             22
     IA@CPY       DS
     I* Copyright array
      *                                                                   CGL009
     IFIATDA    E DSGLFIATDA                    256                       CGL009
      ** Data structure to update next batch number                       CGL009
      *                                                                   CGL009
     I                                        1  80 CPY@
     IRUNDAT      DS
     I                                        1   7 MRDT
     I                                    P   8  100RDNB
     I                                       11  11 SUC
     I                                       12  12 DFF
     I                                       13  13 MBIN
     IID0001      DS                            528
      * File information data structure
      *
     IID0002      DS                            528
      * File information data structure
      *
     IID0003      DS                            528
      * File information data structure
      *
     IID0004      DS                            528                       CGL009
      ** File information data structure                                  CGL009
      *                                                                   CGL009
      /EJECT
      *                                                                   CGL009
      ** Data Structures used by Access Programs                          CGL009
      *                                                                   CGL009
     IDSFDY     E DSDSFDY                                                 CGL009
     IDSSDY     E DSDSSDY                                                 CGL009
      *                                                                   CGL009
      ** Departement code                                                 CGL009
     ISDDEPT    E DSSDDEPTPD                                              CGL009
      *                                                                   CGL009
      ** Retail Transaction                                               CGL009
     ISDRETR    E DSSDRETRPD                                              CGL009
      *                                                                   CGL009
      ** Book detail                                                      CGL009
     ISDBOOK    E DSSDBOOKPD                                              CGL009
      *                                                                   CGL009
      ** Profit Centers detail                                            CGL009
     ISDPRFC    E DSSDPRFCPD                                              CGL009
      *                                                                   CGL009
      ** Deals sub-types                                                  CGL009
     ISDDLST    E DSSDDLSTPD                                              CGL009
      /EJECT                                                              CGL009
      ** Standing Data Area                                                                   CSD101
     ISDSTAT    E DSSDSTAT                                                                    CSD101
      **                                                                                      CSD101
     IPDESCR      DS                           1000                                           CSD101
      *                                                                                       CSD101
      * Parameter declarations
     IP1PARM      DS                             10
      * KEY: Midas SD Fontis Interface ICD retrieval
      * I : RST Fontis Interface ICD Key
     I                                        1  10 P1FONT
     IP2PARM      DS
      * O :  *Return code
     I                                        1   7 P2RTN
     IP3PARM      DS
      * B : MAP Work Return code
     I                                        1   5 P3WRTC
     I            DS
     I                                        1 132 ZAMSDA
      * Message data for 'Download Frequency    INV'
      * Download Frequency
     I                                    P   1   20ZA0001
      * Message data for 'Max no. of Re-tries   INV'
      * Maximum no. of re-tries
     I                                    P   1   10ZA0002
      * Message data for 'Hist Retention Period INV'
      * History Retention Period
     I                                    P   1   20ZA0003
      * Message data for 'Server Host Name REQ'
      * Fontis Server Host Name
     I                                        1  30 ZA0004
      * Message data for 'Midas Usr on Server   REQ'
      * Midas User on Fontis Srvr
     I                                        1  20 ZA0005
      * Message data for 'Passwd for Midas User REQ'
      **Password*for*Midas*User****************************************                       CSD101
     I**********                              1  20 ZA0006                                    CSD101
      * Message data for 'Server Datafile Path  REQ'
      * Fontis Servr Dtafile Path
     I                                        1  50 ZA0007
      *                                                                   CGL009
      ** Message data for 'Credit Debit Indicator is not'                 CGL009
      *                                                                   CGL009
     I                                        1   1 ZA0008                CGL009
      *                                                                   CGL009
      ** Message data for 'Settlement methods authorized are :'           CGL009
      *                                                                   CGL009
     I                                        1  60 ZA0009                CGL009
      *                                                                   CGL009
      ** Message data for 'Bank Identifier  REQ'                          CGL009
      *                                                                   CGL009
     I                                        1  16 ZA0010                CGL009
      /EJECT
      *****************************************************************
      * Entry parameters
     C           *ENTRY    PLIST
     C                     PARM           P0RTN   7
     C                     PARM           P1PARM           KEY: Fontis Int
     C           P2RTN     PARM P2RTN     WP0001  7        *Return code
     C           P3WRTC    PARM P3WRTC    WP0002  5        Work Return cod
      *****************************************************************
      * Initialize
     C                     EXSR ZZINIT
      *
      * Check passed parameters
     C                     EXSR FACKPM
      * Perform once if all passed, else repeat
     C           W0RPT     DOUEQ'N'
      * Display and process key screen
     C                     EXSR BADSKY
     C                     END
      * Terminate program
     C                     EXSR ZXEXPG
      *****************************************************************
      /EJECT
     CSR         BADSKY    BEGSR
      *================================================================
      * Display and process key screen
      *================================================================
      * Initialize key screen
     C                     EXSR MDIZ#K
      * Bypass first display of key screen is possible
     C                     MOVEL'Y'       W0BYP   1
      * Signal start of transaction
     C                     MOVEL'Y'       W0TRN   1
     C           W0TRN     DOWEQ'Y'
     C           W0TRN     OREQ 'K'
      * Ensure transaction continues (if reset)
     C                     MOVEL'Y'       W0TRN   1
      * Conduct screen conversation
     C           W0TRN     DOWEQ'Y'
      * Is bypass key screen still viable?
     C           W0BYP     IFEQ 'Y'
     C           #1FONT    IFEQ *BLANK                     Fontis Interfac
      * One or more key fields is blank
     C           *IN05     OREQ '1'
      * HOME: Reset screen fields
     C                     MOVEL'N'       W0BYP
     C                     END
     C                     END
      * Bypass key screen
     C           W0BYP     IFNE 'Y'
      * Display key screen
     C                     EXSR BBEXFM
     C                     END
      * Cancel key screen bypass
     C                     MOVEL'N'       W0BYP
      * Process response to key screen
      * Cancel & exit program
     C   03                CAS            ZXEXPG
      * HOME: Reset screen fields
     C   05                CAS            BDHMKY
      * Process key screen input
     C                     CAS            BEPRKY
     C                     END
     C           W0TRN     DOWEQ'R'
     C                     MOVEL'Y'       W0TRN
     C                     EXSR BEPRKY
     C                     END
      *
     C                     END
     C                     END
      *================================================================
     CSR         BAEXIT    ENDSR
      /EJECT
     CSR         BBEXFM    BEGSR
      *================================================================
      * Display key screen and process HELP requests
      *================================================================
      * Set screen conditioning indicators
     C                     EXSR GADSAK
      * Update screen time
     C                     TIME           ##TME
     C           W0HLP     DOUEQ'N'
     C                     MOVEL'N'       W0HLP   1
     C                     MOVE *IN25     HELP25  1
     C                     MOVE *ALL'0'   ##OFF  30
     C                     MOVEA##OFF     *IN,1
     C                     MOVE HELP25    *IN25
      * PUTOVR unless conditioned fields change
     C                     SETON                         86*
     C           *IN89     IFNE BBIN89
     C                     SETOF                         86*
     C                     END
     C                     MOVE *IN89     BBIN89  1
      * Set cursor by *SET CURSOR data
     C           YSETCS    IFEQ 'Y'
     C                     EXSR Y0SET
     C                     END
     C                     WRITE#MSGCTL
     C                     WRITE#CMDTXT1
     C                     EXFMT#RCDKEY
      * Test cursor
     C                     EXSR Y8TST
      * Clear set cursor DDS indicator
     C           WCSRLC    IFEQ 'OFF'
     C                     SETOF                     94    *
     C                     END
     C                     MOVE *BLANK    WCSRLC
      * If help requested, display help text
     C   25                EXSR ZHHPKY
     C                     END
      * Update job time
     C                     TIME           ##JTM
      * Clear messages from program message queue
     C                     CALL 'Y2CLMSC'
     C                     PARM ##PGM     ZAPGMQ 10
     C                     PARM '*SAME'   ZAPGRL  5
      * Reset first message only flag
     C                     MOVEL'Y'       ZAFSMS  1
      * Reset global error indicator
     C                     SETOF                         99*
     C           YSETCS    IFEQ 'Y'
     C                     EXSR Y9CLR
     C                     END
      *================================================================
     CSR         BBEXIT    ENDSR
      /EJECT
     CSR         BDHMKY    BEGSR
      *================================================================
      * Process HOME key
      *================================================================
     C                     MOVEL'N'       W0TRN
      *================================================================
     CSR         BDEXIT    ENDSR
      /EJECT
     CSR         BEPRKY    BEGSR
      *================================================================
      * Process key screen input
      *================================================================
      * Initialise detail screen
     C                     EXSR MAIZ#1
      * Validate key fields
     C                     EXSR BFVLKY
     C           *IN99     CABEQ'1'       BEEXIT
      * Check for existing record
     C           KRTV      KLIST
     C                     KFLD           F8FONT           Fontis Interfac
      * Setup key
     C                     MOVEL#1FONT    F8FONT           Fontis Interfac
     C           KRTV      CHAIN@FONTL1              9091  *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     SETON                     9932  *
     C                     GOTO BEEXIT
     C                     END                             FI 91
      *
      * If record does not exist, error
     C           *IN90     IFEQ '1'
     C                     SETON                     9932  *
      * Send message 'Fontis Interface ICD   NF'
     C                     MOVEL'USR3185' ZAMSID
     C                     EXSR ZASNMS
     C                     ELSE
     C                     EXSR MBFL#1
      * CALC: Detail screen function fields
      * 00/Copy Member SD9421RSFF - Fontis Interface ICD  *
     C*Fontis Interface ICD Mnt Calc Detail Function Flds
     C/COPY WNCPYSRC,SD9421RSFF
      * USER: Initialize detail screen (existing record)
      * 00/Copy Member SD9421RISE - Fontis Interface ICD  *
     C*Fontis Interface ICD Mnt Initialise Dtl Exist Rcd
     C/COPY WNCPYSRC,SD9421RISE
     C                     END
      *
      *..................................................
     C   99                GOTO BEEXIT
      * No error: Display and process details
     C                     EXSR CADSDA
      *
      *================================================================
     CSR         BEEXIT    ENDSR
      /EJECT
     CSR         BFVLKY    BEGSR
      *================================================================
      * Validate key fields
      *================================================================
      * USER: Validate key screen
      * 00/Copy Member SD9421RVKS - Fontis Interface ICD  *
     C*Fontis Interface ICD Mnt Validate Key Screen
     C/COPY WNCPYSRC,SD9421RVKS
      * Fontis Interface ICD Key required
     C           #1FONT    IFEQ *BLANK                     IF
     C                     SETON                     9932  *
      * Send message '*Value required'
     C                     MOVEL'Y2U0001' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     END                             FI
      *================================================================
     CSR         BFEXIT    ENDSR
      /EJECT
     CSR         CADSDA    BEGSR
      *================================================================
      * Display and process detail screen
      *================================================================
      * Conduct detail screen conversation
      * - repeat until screen control flag is reset:
     C           W0TRN     DOWEQ'Y'
      * Display detail screen
     C                     EXSR CBEXFM
      * Process response to detail screen
      * Cancel & exit program
     C   03                CAS            ZXEXPG
      * Redisplay previous screen
     C   12                CAS            CCDSPV
      * HOME: Reset screen fields
     C   05                CAS            CCDSPV
      * Process detail screen input
     C                     CAS            CFPRSC
     C                     END
     C           W0TRN     IFEQ 'R'
     C           W0PMD     IFEQ 'ADD'
     C                     EXSR MAIZ#1
     C                     END
     C                     END
      *
     C                     END
      *================================================================
     CSR         CAEXIT    ENDSR
      /EJECT
     CSR         CBEXFM    BEGSR
      *================================================================
      * Display screen and process HELP requests
      *================================================================
      * Set screen conditioning indicators
     C                     EXSR GBDSAD
      * Update screen time
     C                     TIME           ##TME
     C           W0HLP     DOUEQ'N'
     C                     MOVEL'N'       W0HLP   1
     C                     MOVE *IN25     HELP25  1
     C                     MOVE *ALL'0'   ##OFF  30
     C                     MOVEA##OFF     *IN,1
     C                     MOVE HELP25    *IN25
      * PUTOVR unless conditioned fields change
     C                     SETON                         86*
     C           *IN89     IFNE CBIN89
     C                     SETOF                         86*
     C                     END
     C                     MOVE *IN89     CBIN89  1
      * Set cursor by *SET CURSOR data
     C           YSETCS    IFEQ 'Y'
     C                     EXSR Y1SET
     C                     END
     C                     WRITE#MSGCTL
     C                     WRITE#CMDTXT2
     C***********          EXFMT#RCDDTL1                                  CGL009
     C                     WRITE#RCDDTL1                                  CGL009
     C           WUGL09    IFEQ 'Y'                                       CGL009
     C                     WRITE#RCDDTL2                                  CGL009
     C                     ENDIF                                          CGL009
     C                     READ #RCDDTL1                 90               CGL009
     C           WUGL09    IFEQ 'Y'                                       CGL009
     C                     READ #RCDDTL2                 90               CGL009
     C                     ENDIF                                          CGL009
      * Test cursor
     C                     EXSR Y8TST
      * Clear set cursor DDS indicator
     C           WCSRLC    IFEQ 'OFF'
     C                     SETOF                     94    *
     C                     END
     C                     MOVE *BLANK    WCSRLC
      * If help requested, display help text
     C   25                EXSR ZHHPKY
     C                     END
      * Update job time
     C                     TIME           ##JTM
      * Clear messages from program message queue
     C                     CALL 'Y2CLMSC'
     C                     PARM ##PGM     ZAPGMQ 10
     C                     PARM '*SAME'   ZAPGRL  5
      * Reset first message only flag
     C                     MOVEL'Y'       ZAFSMS  1
      * Reset global error indicator
     C                     SETOF                         99*
     C           YSETCS    IFEQ 'Y'
     C                     EXSR Y9CLR
     C                     END
      *================================================================
     CSR         CBEXIT    ENDSR
      /EJECT
     CSR         CCDSPV    BEGSR
      *================================================================
      * Redisplay previous screen
      *================================================================
      * USER: Process key screen request
      * 00/Copy Member SD9421RPKR - Fontis Interface ICD  *
     C*Fontis Interface ICD Mnt Process Key Screen Rqst
     C/COPY WNCPYSRC,SD9421RPKR
      * Bypass Key screen if F12 is taken at Detail screen
     C                     MOVEL*BLANK    P3WRTC           Work Return cod
     C                     MOVEL'PREV'    P3WRTC           Work Return cod
     C                     MOVEL'USR0790' P0RTN            *Return code
     C                     EXSR ZYEXPG
     C   05                MOVEL'R'       W0TRN
     C   12                MOVEL'K'       W0TRN
      *================================================================
     CSR         CCEXIT    ENDSR
      /EJECT
     CSR         CFPRSC    BEGSR
      *================================================================
      * Validate record
      *================================================================
      * Confirm/update is not deferred
     C                     MOVEL'N'       W0DCF   1
      * Validate details
     C                     EXSR DCVLDL
      * QUIT if error:
     C   99                GOTO CFEXIT
      * Defer confirm/update requested
     C           W0DCF     CABEQ'Y'       CFEXIT
      * No error: update record
     C                     EXSR EBPR##
      *================================================================
     CSR         CFEXIT    ENDSR
      /EJECT
     CSR         DCVLDL    BEGSR
      *================================================================
      * Validate details
      *================================================================
      * USER: Validate detail screen fields
      * Download Frequency
      * CASE: DTL.Download Frequency is Greater than Zero
     C           #1DNFQ    IFGT *ZERO                      *IF
      * CASE:
      *  - c1 OR c2
      *   |- c1    : DTL.Download Frequency is Less than 15 minutes
      *   |- c2    : DTL.Download Frequency is Greater than 180 minutes
      *   '-
     C           #1DNFQ    IFLT 15                         *IF
     C           #1DNFQ    ORGT 180                        *OR
      * Setup message data for message
     C                     Z-ADD#1DNFQ    ZA0001           Download Freque
      * Send message 'Download Frequency    INV'
     C                     MOVEL'USR3187' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9931  *
      *
     C                     END                             *FI
     C                     END                             *FI
      * Maximum Number of Re-tries
      * CASE:
      *  - c1 OR c2
      *   |- c1    : DTL.Maximum no. of re-tries is Less than 1
      *   |- c2    : DTL.Maximum no. of re-tries is Greater than 3
      *   '-
     C           #1RTRY    IFLT 1                          *IF
     C           #1RTRY    ORGT 3                          *OR
      * Setup message data for message
     C                     Z-ADD#1RTRY    ZA0002           Maximum no. of
      * Send message 'Max no. of Re-tries   INV'
     C                     MOVEL'USR3189' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9932  *
      *
     C                     END                             *FI
      * History Retention Period
      * CASE:
      *  - c1 OR c2
      *   |- c1    : DTL.History Retention Period is Less than 1
      *   |- c2    : DTL.History Retention Period is Greater than 15
      *   '-
     C           #1HSTP    IFLT 1                          *IF
     C           #1HSTP    ORGT 15                         *OR
      * Setup message data for message
     C                     Z-ADD#1HSTP    ZA0003           History Retenti
      * Send message 'Hist Retention Period INV'
     C                     MOVEL'USR3190' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9933  *
      *
     C                     END                             *FI
      * Fontis Server Host Name
      * CASE: DTL.Fontis Server Host Name is Blank
     C           #1HOST    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1HOST    ZA0004           Fontis Server H
      * Send message 'Server Host Name REQ'
     C                     MOVEL'USR3191' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9934  *
      *
     C                     END                             *FI
      * Midas User on Fontis Server
      * CASE: DTL.Midas User on Fontis Srvr is Blank
     C           #1MUFS    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1MUFS    ZA0005           Midas User on F
      * Send message 'Midas Usr on Server   REQ'
     C                     MOVEL'USR3192' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9935  *
      *
     C                     ELSE                                                               CSD101
     C           LIBR      CAT  'DMLIB'   PLIBRY                                              CSD101
     C           'FONTIS_' CAT  #1MUFS    PIDNAM                                              CSD101
      *                                                                                       CSD101
     C                     CALL 'SD000404'                                                    CSD101
     C                     PARM *BLANKS   PRTNCD                                              CSD101
     C                     PARM 'F'       PACTN                                               CSD101
     C                     PARM           PVALST                                              CSD101
     C                     PARM           PLIBRY                                              CSD101
     C                     PARM           PIDNAM                                              CSD101
     C                     PARM *BLANKS   PPASS1                                              CSD101
     C                     PARM *BLANKS   PDESCR                                              CSD101
      *                                                                                       CSD101
     C           PRTNCD    IFNE *BLANKS                                                       CSD101
     C                     MOVEL'PWD0012' ZAMSID                                              CSD101
     C                     EXSR ZASNMS                                                        CSD101
     C                     SETON                     9935                                     CSD101
     C                     ENDIF                                                              CSD101
      *                                                                                       CSD101
     C                     END                             *FI
      **Password*for*Midas*User****************************************                       CSD101
      **CASE:*DTL.Password*for*Midas*User*is*Blank*********************                       CSD101
     C********** #1PASW    IFEQ *BLANK                     *IF                                CSD101
      **Setup*message*data*for*message*********************************                       CSD101
     C**********           MOVEL#1PASW    ZA0006           Password for Mi                    CSD101
      **Send*message*'Passwd*for*Midas*User*REQ'***********************                       CSD101
     C**********           MOVEL'USR3193' ZAMSID                                              CSD101
     C**********           EXSR ZASNMS                                                        CSD101
     C**********           SETON                     9936  *                                  CSD101
      **********                                                                              CSD101
     C**********           END                             *FI                                CSD101
      * Fontis Server Data File Path
      * CASE: DTL.Fontis Servr Dtafile Path is Blank
     C           #1PATH    IFEQ *BLANK                     *IF
      * Setup message data for message
     C                     MOVEL#1PATH    ZA0007           Fontis Servr Dt
      * Send message 'Server Datafile Path  REQ'
     C                     MOVEL'USR3194' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     9937  *
      *
     C                     END                             *FI
      *                                                                   CGL009
      ** Bank Identifier should be entered                                CGL009
      *                                                                   CGL009
     C           #1BKID    IFEQ *BLANKS                                   CGL009
     C           *IN56     ANDEQ'1'                                       CGL009
     C                     MOVEL#1BKID    ZA0010                          CGL009
     C                     MOVEL'USR4403' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN53                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      * 00/Copy Member SD9421RVSF - Fontis Interface ICD  *
     C*Fontis Interface ICD Mnt Validate Detail Screen
     C/COPY WNCPYSRC,SD9421RVSF
      * CALC: Detail screen function fields
      * 00/Copy Member SD9421RSFF - Fontis Interface ICD  *
     C*Fontis Interface ICD Mnt Calc Detail Function Flds
     C/COPY WNCPYSRC,SD9421RSFF
      * USER: Validate detail screen relations
      * 00/Copy Member SD9421RVSR - Fontis Interface ICD  *
     C*Fontis Interface ICD Mnt Validate Screen Relns
     C/COPY WNCPYSRC,SD9421RVSR
      *                                                                   CGL009
     C           WUGL09    IFEQ 'Y'                                       CGL009
      *                                                                   CGL009
      ** If help pressed on some of the fields we postpone                CGL009
      ** the validity check                                               CGL009
      *                                                                   CGL009
     C                     MOVEA'00000000'*IN,38                          CGL009
     C                     MOVEA'000000'  *IN,46                          CGL009
     C                     MOVEA'00'      *IN,54                          CGL009
     C                     MOVEL'N'       WHLP#2  1                       CGL009
     C           '?'       SCAN #2DPCD                   90               CGL009
     C           *IN90     IFEQ '1'                                       CGL009
     C                     MOVEL'Y'       WHLP#2  1                       CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
     C           WHLP#2    IFEQ 'N'                                       CGL009
     C           '?'       SCAN #2TRTC                   90               CGL009
     C           *IN90     IFEQ '1'                                       CGL009
     C                     MOVEL'Y'       WHLP#2  1                       CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
     C           WHLP#2    IFEQ 'N'                                       CGL009
     C           '?'       SCAN #2TRTD                   90               CGL009
     C           *IN90     IFEQ '1'                                       CGL009
     C                     MOVEL'Y'       WHLP#2  1                       CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
     C           WHLP#2    IFEQ 'N'                                       CGL009
     C           '?'       SCAN #2IBKC                   90               CGL009
     C           *IN90     IFEQ '1'                                       CGL009
     C                     MOVEL'Y'       WHLP#2  1                       CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
     C           WHLP#2    IFEQ 'N'                                       CGL009
     C           WUANAC    ANDEQ'Y'                                       CGL009
     C           '?'       SCAN #2IPFC                   90               CGL009
     C           *IN90     IFEQ '1'                                       CGL009
     C                     MOVEL'Y'       WHLP#2  1                       CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
     C           WHLP#2    IFEQ 'N'                                       CGL009
     C           '?'       SCAN #2OPST                   90               CGL009
     C           *IN90     IFEQ '1'                                       CGL009
     C                     MOVEL'Y'       WHLP#2  1                       CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
     C           WHLP#2    IFEQ 'N'                                       CGL009
     C           '?'       SCAN #2IPST                   90               CGL009
     C           *IN90     IFEQ '1'                                       CGL009
     C                     MOVEL'Y'       WHLP#2  1                       CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
     C           WHLP#2    IFEQ 'N'                                       CGL009
     C           '?'       SCAN #2TBKC                   90               CGL009
     C           *IN90     IFEQ '1'                                       CGL009
     C                     MOVEL'Y'       WHLP#2  1                       CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
     C           WHLP#2    IFEQ 'N'                                       CGL009
     C           WUANAC    ANDEQ'Y'                                       CGL009
     C           '?'       SCAN #2TPFC                   90               CGL009
     C           *IN90     IFEQ '1'                                       CGL009
     C                     MOVEL'Y'       WHLP#2  1                       CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** Validate IAT Processing frequency                                CGL009
      *                                                                   CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
     C           #2IATF    IFLT 15                                        CGL009
     C           #2IATF    ANDGT0                                         CGL009
     C           #2IATF    ORGT 180                                       CGL009
      *                                                                   CGL009
      ** Setup message data for message                                   CGL009
      *                                                                   CGL009
     C                     MOVEL#2IATF    ZA0001                          CGL009
      *                                                                   CGL009
      ** Send message                                                     CGL009
      *                                                                   CGL009
     C                     MOVEL'USR4404' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN38                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** Validate TPP Processing Frequency                                CGL009
      *                                                                   CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
     C           #2TPPF    IFLT 15                                        CGL009
     C           #2TPPF    ANDGT0                                         CGL009
     C           #2TPPF    ORGT 180                                       CGL009
      *                                                                   CGL009
      ** Setup message data for message                                   CGL009
      *                                                                   CGL009
     C                     MOVEL#2TPPF    ZA0001                          CGL009
      *                                                                   CGL009
      ** Send message                                                     CGL009
      *                                                                   CGL009
     C                     MOVEL'USR4405' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN46                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** Validate IAT Batch number range                                  CGL009
      *                                                                   CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
     C           #2BNRL    IFEQ *ZERO                                     CGL009
      *                                                                   CGL009
      ** Send message 'Value required'                                    CGL009
      *                                                                   CGL009
     C                     MOVEL'USR0823' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN39                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
     C           #2BNRL    IFGT #2BNRU                                    CGL009
      *                                                                   CGL009
      ** Send message 'First value cannot exceed the second one'          CGL009
      *                                                                   CGL009
     C                     MOVEL'USR4402' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN39                           CGL009
     C                     MOVE '1'       *IN40                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** Define Next Batch Number from Data area GLFIATDA                 CGL009
      *                                                                   CGL009
     C           *NAMVAR   DEFN GLFIATDA  FIATDA                          CGL009
     C           *LOCK     IN   FIATDA                                    CGL009
      *                                                                   CGL009
      *                                                                   CGL009
      ** Update Batch Number Range in dataarea GLFIATDA                   CGL009
      *                                                                   CGL009
     C                     MOVEL#2BNRL    W#BNRL  30                      CGL009
     C           W#BNRL    IFNE F8BNRL                                    CGL009
     C           W#BNRL    IFGT 0                                         CGL009
     C                     SUB  1         W#BNRL                          CGL009
     C                     ENDIF                                          CGL009
     C                     MOVELW#BNRL    FFLIBN                          CGL009
     C                     OUT  FIATDA                                    CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** Validate IAT Batch Retention Days                                CGL009
      *                                                                   CGL009
     C           #2BRDS    IFEQ 0                                         CGL009
     C           WHLP#2    ANDNE'Y'                                       CGL009
      *                                                                   CGL009
      ** Send message 'Value required'                                    CGL009
      *                                                                   CGL009
     C                     MOVEL'USR0823' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN54                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** Validate TPP Message Retention Days                              CGL009
      *                                                                   CGL009
     C           #2MRDS    IFEQ 0                                         CGL009
     C           WHLP#2    ANDNE'Y'                                       CGL009
      *                                                                   CGL009
      ** Send message 'Value required'                                    CGL009
      *                                                                   CGL009
     C                     MOVEL'USR0823' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN47                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** Validate IAT Department Code                                     CGL009
      *                                                                   CGL009
     C           #2DPCD    IFEQ *BLANK                                    CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
      *                                                                   CGL009
      ** Send message 'Value required'                                    CGL009
      *                                                                   CGL009
     C                     MOVEL'USR0823' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN41                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ELSE                                           CGL009
     C                     CALL 'AODEPTR0'                                CGL009
     C                     PARM           P@RTCD  7                       CGL009
     C                     PARM '*VERIFY' P@OPTN  7                       CGL009
     C           #2DPCD    PARM #2DPCD    P@DPCD  3                       CGL009
     C           SDDEPT    PARM SDDEPT    DSFDY                           CGL009
      *                                                                   CGL009
     C           P@RTCD    IFNE *BLANK                                    CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
      *                                                                   CGL009
      ** Send message 'Department code not found'                         CGL009
      *                                                                   CGL009
     C                     MOVEL'USR0013' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN41                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** End of P@RTCD IFNE *BLANK                                        CGL009
      *                                                                   CGL009
     C                     ENDIF                                          CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** Validate TPP Outgoing Payment Sub type                           CGL009
      *                                                                   CGL009
     C           KTYST     KLIST                                          CGL009
     C                     KFLD           DTPE11                          CGL009
     C                     KFLD           #2PYST  2                       CGL009
      *                                                                   CGL009
     C           #2OPST    IFEQ *BLANK                                    CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
      *                                                                   CGL009
      ** Send message 'Value required'                                    CGL009
      *                                                                   CGL009
     C                     MOVEL'USR0823' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN55                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ELSE                                           CGL009
     C                     CALL 'AODLSTR0'                                CGL009
     C                     PARM *BLANKS   P@RTCD  7                       CGL009
     C                     PARM '*VERIFY' P@OPTN  7                       CGL009
     C           #2OPST    PARM #2OPST    @DSTC   2                       CGL009
     C           SDDLST    PARM SDDLST    DSFDY                           CGL009
     C           P@RTCD    IFNE *BLANK                                    CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
      *                                                                   CGL009
      ** Send message 'Deal sub-type invalid'                             CGL009
      *                                                                   CGL009
     C                     MOVEL'USR0760' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN55                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
     C                     ELSE                                           CGL009
     C                     MOVEL'OP'      DTPE11                          CGL009
     C                     MOVEL#2OPST    #2PYST                          CGL009
     C           KTYST     CHAINFDDTSTL1             90                   CGL009
     C           *IN90     IFEQ '1'                                       CGL009
     C           *IN90     OREQ '0'                                       CGL009
     C           RCID11    ANDEQ'*'                                       CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
      *                                                                   CGL009
      ** Send message 'Invalid combination Deal type/sub-type'            CGL009
      *                                                                   CGL009
     C                     MOVEL'USR4406' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN55                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** Validate TPP Incoming Payment Sub type                           CGL009
      *                                                                   CGL009
     C           #2IPST    IFEQ *BLANK                                    CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
      *                                                                   CGL009
      ** Send message 'Value required'                                    CGL009
      *                                                                   CGL009
     C                     MOVEL'USR0823' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN48                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ELSE                                           CGL009
     C                     CALL 'AODLSTR0'                                CGL009
     C                     PARM *BLANKS   P@RTCD  7                       CGL009
     C                     PARM '*VERIFY' P@OPTN  7                       CGL009
     C           #2IPST    PARM #2IPST    @DSTC   2                       CGL009
     C           SDDLST    PARM SDDLST    DSFDY                           CGL009
     C           P@RTCD    IFNE *BLANK                                    CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
      *                                                                   CGL009
      ** Send message 'Deal sub-type invalid'                             CGL009
      *                                                                   CGL009
     C                     MOVEL'USR0760' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN48                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
     C                     ELSE                                           CGL009
     C                     MOVEL'IN'      DTPE11                          CGL009
     C                     MOVEL#2IPST    #2PYST                          CGL009
     C           KTYST     CHAINFDDTSTL1             90                   CGL009
     C           *IN90     IFEQ '1'                                       CGL009
     C           *IN90     OREQ '0'                                       CGL009
     C           RCID11    ANDEQ'*'                                       CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
      *                                                                   CGL009
      ** Send message 'Invalid combination Deal type/sub-type'            CGL009
      *                                                                   CGL009
     C                     MOVEL'USR4407' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN48                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** Validate IAT Transaction Type CR                                 CGL009
      *                                                                   CGL009
     C           #2TRTC    IFEQ *BLANK                                    CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
      ** Send message 'Transaction type function code must be entered'    CGL009
     C                     MOVEL'USR2995' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN42                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ELSE                                           CGL009
     C                     CALL 'AORETRR0'                                CGL009
     C                     PARM           P@RTCD  7                       CGL009
     C                     PARM '*KEY   ' P@OPTN  7                       CGL009
     C           #2TRTC    PARM #2TRTC    P@RTTY  5                       CGL009
     C           SDRETR    PARM SDRETR    DSFDY                           CGL009
     C           P@RTCD    IFNE *BLANK                                    CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
      *                                                                   CGL009
      ** Send message 'Transaction type function code is invalid'         CGL009
      *                                                                   CGL009
     C                     MOVEL'USR2998' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN42                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** Else of P@RTCD IFNE *BLANK                                       CGL009
      *                                                                   CGL009
     C                     ELSE                                           CGL009
     C           A1DCIN    IFNE 'C'                                       CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
      *                                                                   CGL009
      ** Send message 'Credit Debit Indicator is not C'                   CGL009
      *                                                                   CGL009
     C                     MOVEL'C'       ZA0008                          CGL009
     C                     MOVEL'USR4401' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN42                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** End of A1DCIN IFNE 'C'                                           CGL009
      *                                                                   CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** End of P@RTCD IFNE *BLANK                                        CGL009
      *                                                                   CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** End of #2TRTC IFEQ *BLANK                                        CGL009
      *                                                                   CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** Validate TPP Settlement method                                   CGL009
      *                                                                   CGL009
     C           #2STMT    IFEQ *BLANK                                    CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
      *                                                                   CGL009
      ** Send message 'Value required'                                    CGL009
      *                                                                   CGL009
     C                     MOVEL'USR0823' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN49                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ELSE                                           CGL009
     C           #2STMT    IFNE '01'                                      CGL009
     C           #2STMT    ANDNE'02'                                      CGL009
     C           #2STMT    ANDNE'08'                                      CGL009
     C           #2STMT    ANDNE'10'                                      CGL009
     C           #2STMT    ANDNE'12'                                      CGL009
     C           #2STMT    ANDNE'13'                                      CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
     C           ZA0009    IFEQ *BLANK                                    CGL009
     C           ZA0009    CAT  '01 ':1   ZA0009                          CGL009
     C           ZA0009    CAT  '02 ':1   ZA0009                          CGL009
     C           ZA0009    CAT  '08 ':1   ZA0009                          CGL009
     C           ZA0009    CAT  '10 ':1   ZA0009                          CGL009
     C           ZA0009    CAT  '12 ':1   ZA0009                          CGL009
     C           ZA0009    CAT  '13 ':1   ZA0009                          CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** Send message 'Settlement values authorized are :'                CGL009
      *                                                                   CGL009
     C                     MOVEL'USR4408' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN49                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ENDIF                                          CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** Validate IAT Transaction Type DR                                 CGL009
      *                                                                   CGL009
     C           #2TRTD    IFEQ *BLANK                                    CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
      *                                                                   CGL009
      ** Send message 'Transaction type function code must be entered'    CGL009
      *                                                                   CGL009
     C                     MOVEL'USR2995' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN43                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ELSE                                           CGL009
     C                     CALL 'AORETRR0'                                CGL009
     C                     PARM           P@RTCD  7                       CGL009
     C                     PARM '*KEY   ' P@OPTN  7                       CGL009
     C           #2TRTD    PARM #2TRTD    P@RTTY  5                       CGL009
     C           SDRETR    PARM SDRETR    DSFDY                           CGL009
     C           P@RTCD    IFNE *BLANK                                    CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
      *                                                                   CGL009
      ** Send message 'Transaction type function code is invalid'         CGL009
      *                                                                   CGL009
     C                     MOVEL'USR2998' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN43                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** Else of P@RTCD IFNE *BLANK                                       CGL009
      *                                                                   CGL009
     C                     ELSE                                           CGL009
     C           A1DCIN    IFNE 'D'                                       CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
      *                                                                   CGL009
      ** Send message 'Credit Debit Indicator is not D'                   CGL009
      *                                                                   CGL009
     C                     MOVEL'D'       ZA0008                          CGL009
     C                     MOVEL'USR4401' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN43                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** End of A1DCIN IFNE 'D'                                           CGL009
      *                                                                   CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** End of P@RTCD IFNE *BLANK                                        CGL009
      *                                                                   CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** End of #2TRTD IFEQ *BLANK                                        CGL009
      *                                                                   CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** Validate TPP Book Code                                           CGL009
      *                                                                   CGL009
     C           #2TBKC    IFEQ *BLANK                                    CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
      *                                                                   CGL009
      ** Send message 'Value required'                                    CGL009
      *                                                                   CGL009
     C                     MOVEL'USR0823' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN50                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ELSE                                           CGL009
     C                     CALL 'AOBOOKR0'                                CGL009
     C                     PARM           P@RTCD  7                       CGL009
     C                     PARM '*VERIFY' P@OPTN  7                       CGL009
     C           #2TBKC    PARM #2TBKC    P@BKCD  2                       CGL009
     C           SDBOOK    PARM SDBOOK    DSFDY                           CGL009
      *                                                                   CGL009
      ** Send message 'Book code not found'                               CGL009
      *                                                                   CGL009
     C           P@RTCD    IFNE *BLANK                                    CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
     C                     MOVEL'USR0758' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN50                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ENDIF                                          CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** Validate IAT Book Code                                           CGL009
      *                                                                   CGL009
     C           #2IBKC    IFEQ *BLANK                                    CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
      *                                                                   CGL009
      ** Send message 'Value required'                                    CGL009
      *                                                                   CGL009
     C                     MOVEL'USR0823' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN44                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ELSE                                           CGL009
     C                     CALL 'AOBOOKR0'                                CGL009
     C                     PARM           P@RTCD  7                       CGL009
     C                     PARM '*VERIFY' P@OPTN  7                       CGL009
     C           #2IBKC    PARM #2IBKC    P@BKCD  2                       CGL009
     C           SDBOOK    PARM SDBOOK    DSFDY                           CGL009
     C           P@RTCD    IFNE *BLANK                                    CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
      *                                                                   CGL009
      ** Send message 'Book code not found'                               CGL009
      *                                                                   CGL009
     C                     MOVEL'USR0758' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN44                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ENDIF                                          CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** Validate TPP Profit Center (only if analytical accounting)       CGL009
      *                                                                   CGL009
     C           WUANAC    IFEQ 'Y'                                       CGL009
     C           #2TPFC    IFNE *BLANK                                    CGL009
     C                     CALL 'AOPRFCR0'                                CGL009
     C                     PARM           P@RTCD  7                       CGL009
     C                     PARM '*VERIFY' P@OPTN  7                       CGL009
     C           #2TPFC    PARM #2TPFC    P@PCCD  4                       CGL009
     C           SDPRFC    PARM SDPRFC    DSFDY                           CGL009
      *                                                                   CGL009
     C           P@RTCD    IFNE *BLANK                                    CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
      *                                                                   CGL009
      ** Send message 'Profit center code not found'                      CGL009
      *                                                                   CGL009
     C                     MOVEL'USR0647' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN51                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ENDIF                                          CGL009
     C                     ELSE                                           CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
     C                     MOVEL'USR0823' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN51                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** Validate IAT Profit Center (only if analytical accounting)       CGL009
      *                                                                   CGL009
     C           #2IPFC    IFNE *BLANK                                    CGL009
     C                     CALL 'AOPRFCR0'                                CGL009
     C                     PARM           P@RTCD  7                       CGL009
     C                     PARM '*VERIFY' P@OPTN  7                       CGL009
     C           #2IPFC    PARM #2IPFC    P@PCCD  4                       CGL009
     C           SDPRFC    PARM SDPRFC    DSFDY                           CGL009
     C           P@RTCD    IFNE *BLANK                                    CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
      *                                                                   CGL009
      ** Send message 'Profit center code not found'                      CGL009
      *                                                                   CGL009
     C                     MOVEL'USR0647' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN45                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ENDIF                                          CGL009
     C                     ELSE                                           CGL009
     C           WHLP#2    IFNE 'Y'                                       CGL009
     C                     MOVEL'USR0823' ZAMSID                          CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     MOVE '1'       *IN45                           CGL009
     C                     MOVE '1'       *IN99                           CGL009
     C                     ENDIF                                          CGL009
     C                     ENDIF                                          CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** End of WUGL09 IFEQ 'Y'                                           CGL009
      *                                                                   CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      *================================================================
     CSR         DCEXIT    ENDSR
      /EJECT
     CSR         EBPR##    BEGSR
      *================================================================
      * Process record:
      *================================================================
      * Process update request
     C           W0PMD     CASNE'ADD'     EECHRQ
     C                     END
     C           W0RTN     IFNE *BLANK
      * Error: ROLLBACK any DBF changes
     C                     ROLBK
     C                     GOTO EBEXIT
     C                     ELSE
      * Otherwise COMMIT any DBF changes
     C                     COMIT
     C                     END
     C           W0RTN     IFEQ *BLANK
      * USER: Process command keys
      * 00/Copy Member SD9421RPCK - Fontis Interface ICD  *
     C*Fontis Interface ICD Mnt Process Command Keys
     C/COPY WNCPYSRC,SD9421RPCK
      * Restart program for next record
     C                     MOVEL'N'       W0TRN
     C                     END
      *================================================================
     CSR         EBEXIT    ENDSR
      /EJECT
     CSR         EECHRQ    BEGSR
      *================================================================
      * Process update request
      *================================================================
      * USER: Change DBF record
      * Change Fontis Interface I - Fontis Interface ICD  *
     C                     EXSR SACHRC
     C           W0RTN     IFNE *BLANK
      * Data update error
      * Reset screen fields if changed record
     C           W0RTN     CASEQ'Y2U0007' MBFL#1
     C                     END
     C                     ELSE
      * Send message '*Record changed'
     C                     MOVEL'Y2U0012' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     END
      *================================================================
     CSR         EEEXIT    ENDSR
      /EJECT
     CSR         FACKPM    BEGSR
      *================================================================
      * Check passed parameters
      *================================================================
      * Is full key present?
     C           P1FONT    IFEQ *BLANK                     Fontis Interfac
      * Not every key field passed - loop program
     C                     MOVEL'Y'       W0RPT   1
     C                     ELSE
      * Full key passed, so single shot program
     C                     MOVEL'N'       W0RPT
     C                     END
      *================================================================
     CSR         FAEXIT    ENDSR
      /EJECT
     CSR         GADSAK    BEGSR
      *================================================================
      * Set key screen conditioning indicators
      *================================================================
     C           W0PMD     COMP 'ADD'                    89*
      *================================================================
     CSR         GAEXIT    ENDSR
      /EJECT
     CSR         GBDSAD    BEGSR
      *================================================================
      * Set detail screen conditioning indicators
      *================================================================
     C           W0PMD     COMP 'ADD'                    89*
      * Protect key fields on detail screen
     C                     SETON                     88    *
      * Enable key screen
     C                     SETON                     87    *
      *================================================================
     CSR         GBEXIT    ENDSR
      /EJECT
     CSR         MAIZ#1    BEGSR
      *================================================================
      * Initialise record - except for key fields and "neither" paramete
      *================================================================
     C                     MOVELP3WRTC    #PWRTC           Work Return cod
     C                     MOVEL*BLANK    #DFDP1           Fontis Svr DtaF
     C                     MOVEL*BLANK    #DFDP2           Fontis Svr DtaF
     C                     Z-ADD*ZERO     #1LCD            Last Change Dat
     C                     MOVEL*BLANK    #1TYLC           Type of Last Ch
     C                     Z-ADD*ZERO     #1DNFQ           Download Freque
     C                     Z-ADD*ZERO     #1RTRY           Maximum no. of
     C                     Z-ADD*ZERO     #1HSTP           History Retenti
     C                     MOVEL*BLANK    #1HOST           Fontis Server H
     C                     MOVEL*BLANK    #1MUFS           Midas User on F
     C**********           MOVEL*BLANK    #1PASW           Password for Mi                    CSD101
     C                     MOVEL*BLANK    #1PATH           Fontis Servr Dt
     C           WUGL09    IFEQ 'Y'                                       CGL009
     C                     MOVEL*BLANK    #1BKID                          CGL009
     C                     Z-ADD*ZERO     #2IATF                          CGL009
     C                     Z-ADD*ZERO     #2BRDS                          CGL009
     C                     MOVEL*BLANK    #2DPCD                          CGL009
     C                     MOVEL*BLANK    #2TRTC                          CGL009
     C                     MOVEL*BLANK    #2TRTD                          CGL009
     C                     MOVEL*BLANK    #2IBKC                          CGL009
     C                     MOVEL*BLANK    #2IPFC                          CGL009
     C                     Z-ADD*ZERO     #2BNRL                          CGL009
     C                     Z-ADD*ZERO     #2BNRU                          CGL009
     C                     Z-ADD*ZERO     #2TPPF                          CGL009
     C                     Z-ADD*ZERO     #2MRDS                          CGL009
     C                     MOVEL*BLANK    #2OPST                          CGL009
     C                     MOVEL*BLANK    #2IPST                          CGL009
     C                     MOVEL*BLANK    #2STMT                          CGL009
     C                     MOVEL*BLANK    #2TBKC                          CGL009
     C                     MOVEL*BLANK    #2TPFC                          CGL009
     C                     ENDIF                                          CGL009
      *================================================================
     CSR         MAEXIT    ENDSR
      /EJECT
     CSR         MBFL#1    BEGSR
      *================================================================
      * Move @FONTL1 fields to screen
      *================================================================
     C                     MOVELF8FONT    #1FONT           Fontis Interfac
     C                     Z-ADDF8LCD     #1LCD            Last Change Dat
     C                     MOVELF8TYLC    #1TYLC           Type of Last Ch
     C                     Z-ADDF8DNFQ    #1DNFQ           Download Freque
     C                     Z-ADDF8RTRY    #1RTRY           Maximum no. of
     C                     Z-ADDF8HSTP    #1HSTP           History Retenti
     C                     MOVELF8HOST    #1HOST           Fontis Server H
     C                     MOVELF8MUFS    #1MUFS           Midas User on F
     C**********           MOVELF8PASW    #1PASW           Password for Mi                    CSD101
     C                     MOVELF8PATH    #1PATH           Fontis Servr Dt
     C           WUGL09    IFEQ 'Y'                                       CGL009
     C                     MOVELF8BKID    #1BKID                          CGL009
     C                     MOVELF8IATF    #2IATF                          CGL009
     C                     Z-ADDF8BRDS    #2BRDS                          CGL009
     C                     MOVELF8DPCD    #2DPCD                          CGL009
     C                     MOVELF8TRTC    #2TRTC                          CGL009
     C                     MOVELF8TRTD    #2TRTD                          CGL009
     C                     MOVELF8IBKC    #2IBKC                          CGL009
     C                     MOVELF8IPFC    #2IPFC                          CGL009
     C                     MOVE F8BNRL    #2BNRL                          CGL009
     C                     MOVE F8BNRU    #2BNRU                          CGL009
     C                     MOVELF8TPPF    #2TPPF                          CGL009
     C                     Z-ADDF8MRDS    #2MRDS                          CGL009
     C                     MOVELF8OPST    #2OPST                          CGL009
     C                     MOVELF8IPST    #2IPST                          CGL009
     C           F8STMT    IFEQ 0                                         CGL009
     C                     MOVE *BLANK    #2STMT                          CGL009
     C                     ELSE                                           CGL009
     C                     MOVE F8STMT    #2STMT                          CGL009
     C                     ENDIF                                          CGL009
     C                     MOVELF8TBKC    #2TBKC                          CGL009
     C                     MOVELF8TPFC    #2TPFC                          CGL009
     C                     ENDIF                                          CGL009
      * Hold existing record image
     C                     MOVEL@1DBRC    #1DBRC
      *================================================================
     CSR         MBEXIT    ENDSR
      /EJECT
     CSR         MDIZ#K    BEGSR
      *================================================================
      * Initialize key screen
      *================================================================
     C                     MOVELP3WRTC    #PWRTC           Work Return cod
     C                     MOVELP1FONT    #1FONT           Fontis Interfac
      * USER: Initialize key screen
      * 00/Copy Member SD9421RIKS - Fontis Interface ICD  *
     C*Fontis Interface ICD Mnt Initialise Key Screen
     C/COPY WNCPYSRC,SD9421RIKS
      *================================================================
     CSR         MDEXIT    ENDSR
      /EJECT
     CSR         SACHRC    BEGSR
      *================================================================
      * Change Fontis Interface I - Fontis Interface ICD  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Set PGM.*Record Data Changed flag
     C                     MOVE 'N'       YARDC   1
      *
      * Move key fields to @FONTL0
     C                     MOVEL#1FONT    F8FONT           Fontis Interfac
      *
     C           KLCHSA    KLIST
     C                     KFLD           F8FONT           Fontis Interfac
     C           KLCHSA    CHAIN@FONTL0              9091  *
      *
     C           *IN90     IFEQ '1'
      * Record not found
     C                     MOVEL'Y2U0009' W0RTN   7
      * Send message '*Record no longer on file'
     C                     MOVEL'Y2U0009' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     GOTO SAEXIT
     C                     END
      *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     GOTO SAEXIT
     C                     END
      *
      * Check for changed record
     C           #1DBRC    IFNE @1DBRC                     IF
     C                     MOVEL'Y2U0007' W0RTN   7
      * Send message '*Update not accepted'
     C                     MOVEL'Y2U0007' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
      * Release record lock
     C                     UNLCKSDFONTL0               91  *
     C                     GOTO SAEXIT
     C                     END                             FI #1DBRC
      * Store record data for null update check
     C                     MOVE @1DBRC    YARDCS
      * USER: Processing after Data read
      * save Last Change Date from record
     C                     Z-ADDF8LCD     WULCD            Last Change Dat
      * Move non-key fields to @FONTL0
     C                     Z-ADD#1DNFQ    F8DNFQ           Download Freque
     C                     MOVEL#1HOST    F8HOST           Fontis Server H
     C                     MOVEL#1MUFS    F8MUFS           Midas User on F
     C**********           MOVEL#1PASW    F8PASW           Password for Mi                    CSD101
     C                     MOVEL#1PATH    F8PATH           Fontis Servr Dt
     C                     Z-ADD#1RTRY    F8RTRY           Maximum no. of
     C                     Z-ADD#1HSTP    F8HSTP           History Retenti
     C                     Z-ADDWURDNB    F8LCD            Last Change Dat
     C                     MOVEL'A'       F8TYLC           Type of Last Ch
     C           WUGL09    IFEQ 'Y'                                       CGL009
     C                     MOVEL#1BKID    F8BKID                          CGL009
     C                     MOVEL#2IATF    F8IATF                          CGL009
     C                     Z-ADD#2BRDS    F8BRDS                          CGL009
     C                     MOVEL#2DPCD    F8DPCD                          CGL009
     C                     MOVEL#2TRTC    F8TRTC                          CGL009
     C                     MOVEL#2TRTD    F8TRTD                          CGL009
     C                     MOVEL#2IBKC    F8IBKC                          CGL009
     C                     MOVEL#2IPFC    F8IPFC                          CGL009
     C                     MOVEL#2BNRL    F8BNRL                          CGL009
     C                     MOVEL#2BNRU    F8BNRU                          CGL009
     C                     MOVEL#2TPPF    F8TPPF                          CGL009
     C                     Z-ADD#2MRDS    F8MRDS                          CGL009
     C                     MOVEL#2OPST    F8OPST                          CGL009
     C                     MOVEL#2IPST    F8IPST                          CGL009
     C           #2STMT    IFEQ *BLANK                                    CGL009
     C                     Z-ADD0         F8STMT                          CGL009
     C                     ELSE                                           CGL009
     C                     MOVE #2STMT    F8STMT                          CGL009
     C                     ENDIF                                          CGL009
     C                     MOVEL#2TBKC    F8TBKC                          CGL009
     C                     MOVEL#2TPFC    F8TPFC                          CGL009
     C                     ENDIF                                          CGL009
      *
      * Set PGM.*Record Data Changed flag
     C           @1DBRC    IFNE YARDCS
     C                     MOVE 'Y'       YARDC
     C                     END
      * USER: Processing before Data update
      * CASE: WRK.Window processing requir. is Yes
     C           WUWDPR    IFEQ 'Y'                        *IF
      * WM call Window Manager - Window manager  *
     C/COPY WNCPYSRC,WN0481CCP1                                           S01408
     C***********          CALL 'WIND01'                                  S01212
     C                     CALL 'WN0010'                                  S01212
     C*********************PARM           ##PGM            Program        S01212
     C                     PARM ##PGM     UPGM   10        Program        S01212
     C*********************PARM *BLANK    FKEY    2        Function Key   S01212
     C                     PARM *BLANK    UFKEY   2        Function Key   S01212
     C*********************PARM           WUMEST           Action  S01212 S01229
     C*********************PARM           WUWMAC           Action  S01212 S01229
     C                     PARM 'A'       UACTCD  1        Action  S01212 S01229
     C                     PARM           DATA             Trans Data     S01212
     C                     PARM *BLANK    W0RTN            Return Code    S01212
     C                     PARM           SPARE 256        Spare Field    LN0355
      * WM Check Return
      * CASE: PAR.*Return code is *User QUIT requested
     C           W0RTN     IFEQ 'Y2U9999'                  *IF
     C                     MOVELW0RTN     P0RTN            *Return code
     C                     EXSR ZYEXPG
     C                     ELSE
      * CASE: PAR.*Return code is WN Window Error
     C           W0RTN     IFEQ 'USR0563'                  *IF
      * Send message 'WN Window Error'
     C                     MOVEL'USR0563' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO SAEXIT                     *QUIT
     C                     ELSE
      * CASE: PAR.*Return code is *DBF update error
     C           W0RTN     IFEQ 'Y2U0004'                  *IF
      * Send message 'WN Database Error'
     C                     MOVEL'USR0567' ZAMSID
     C                     EXSR ZASNMS
     C                     SETON                     99    *
      *
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO SAEXIT                     *QUIT
     C                     ELSE
      * CASE: PAR.*Return code is *Previous Screen
     C           W0RTN     IFEQ 'USR0790'                  *IF
     C                     MOVEL'Y'       W0DCF            *Defer confirm
     C                     GOTO SAEXIT                     *QUIT
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
     C                     END                             *FI
      * 00/Copy Member SD9421RBUW - Fontis Interface ICD  *
     C*Fontis Interface ICD Mnt Before Update, Window on
     C/COPY WNCPYSRC,SD9421RBUW
     C                     END                             *FI
      * 00/Copy Member SD9421RBDU - Fontis Interface ICD  *
     C*Fontis Interface ICD Mnt Processing Before Update
     C/COPY WNCPYSRC,SD9421RBDU
      * Set PGM.*Record Data Changed flag
     C           @1DBRC    IFNE YARDCS
     C                     MOVE 'Y'       YARDC
     C                     END
      * If changed update record otherwise release record
     C           YARDC     IFEQ 'Y'
     C                     UPDAT@FONTL0                91  *
     C                     ELSE
      * Release record lock
     C                     UNLCKSDFONTL0               91  *
     C                     END
     C           *IN91     IFEQ '1'
      * Change error detected
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     ELSE
      *
      * Update saved record image
     C                     MOVEL@1DBRC    #1DBRC
      * DBF change successful
      * USER: Processing after Data update
      * CASE: WRK.Last Change Date NE WRK.Run day number
     C           WULCD     IFNE WURDNB                     *IF
      * only update file controls if record has not been updated already
     C                     Z-ADD*ZERO     WUNORC           No. of Records
     C                     Z-ADD*ZERO     WUNOIN           No. of Inserts
     C                     Z-ADD*ZERO     WUNODL           No. of Deletes
     C                     Z-ADD1         WUNOAM           No. of Amends
      * Change Standing Data Cont - Standing Data Controls  *
     C                     EXSR SBCHRC
     C                     END                             *FI
      * 00/Copy Member SD9421RADU - Fontis Interface ICD  *
     C*Fontis Interface ICD Mnt Processing After Update
     C/COPY WNCPYSRC,SD9421RADU
     C                     END
      *================================================================
     CSR         SAEXIT    ENDSR
      /EJECT
     CSR         SBCHRC    BEGSR
      *================================================================
      * Change Standing Data Cont - Standing Data Controls  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Set PGM.*Record Data Changed flag
     C                     MOVE 'N'       YBRDC   1
      *
      * Move key fields to @AHREAU
     C                     MOVE *BLANK    AHFLNM           Filename
     C                     MOVEL'SDICDRPD'AHFLNM           Filename
      *
     C           KLCHSB    KLIST
     C                     KFLD           AHFLNM           Filename
     C           KLCHSB    CHAIN@AHREAU              9091  *
      *
     C           *IN90     IFEQ '1'
      * Record not found
     C                     MOVEL'Y2U0009' W0RTN   7
      * Send message '*Record no longer on file'
     C                     MOVEL'Y2U0009' ZAMSID
     C                     MOVEL'Y2USRMSG'ZAMSGF
     C                     EXSR ZASNMS
     C                     GOTO SBEXIT
     C                     END
      *
     C           *IN91     IFEQ '1'
      * Record locked
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     GOTO SBEXIT
     C                     END
      *
      * Store record data for null update check
     C                     MOVE QSDFC1    YBRDCS
      * USER: Processing after Data read
     C                     ADD  AHNORC    WUNORC           No. of Records
     C                     ADD  AHNOIN    WUNOIN           No. of Inserts
     C                     ADD  AHNOAM    WUNOAM           No. of Amends
     C                     ADD  AHNODL    WUNODL           No. of Deletes
      * Move non-key fields to @AHREAU
     C                     Z-ADDWUNORC    AHNORC           No. of Records
     C                     Z-ADDWUNOIN    AHNOIN           No. of Inserts
     C                     Z-ADDWUNOAM    AHNOAM           No. of Amends
     C                     Z-ADDWUNODL    AHNODL           No. of Deletes
      *
      * Set PGM.*Record Data Changed flag
     C           QSDFC1    IFNE YBRDCS
     C                     MOVE 'Y'       YBRDC
     C                     END
      * If changed update record otherwise release record
     C           YBRDC     IFEQ 'Y'
     C                     UPDAT@AHREAU                91  *
     C                     ELSE
      * Release record lock
     C                     UNLCKSDFCTLL0               91  *
     C                     END
     C           *IN91     IFEQ '1'
      * Change error detected
     C                     MOVEL'Y2U0004' W0RTN   7
     C                     ELSE
      *
      * DBF change successful
     C                     END
      *================================================================
     CSR         SBEXIT    ENDSR
      /EJECT
     CSR         SCRVGN    BEGSR
      *================================================================
      * Get 'Window required' ind - MIDAS Modules  *
      *================================================================
     C                     MOVEL*BLANK    W0RTN   7
      * Define keylist
     C           KRSSC     KLIST
     C                     KFLD           BGMODS           Modules
      * Move fields to key list
     C                     MOVE *BLANK    BGMODS           Modules
     C                     MOVEL'MMOD'    BGMODS           Modules
     C           KRSSC     CHAIN@BGREC8              90    *
      * Data record not found
     C   90                MOVEL'USR0096' W0RTN   7
     C           *IN90     IFEQ '0'
      * USER: Process Data record
      * CASE: DB1.Window processing requir. is Yes
     C           BGWDPR    IFEQ 'Y'                        *IF
     C                     MOVEL'Y'       WUWDPR           Window processi
     C                     END                             *FI
      *                                                                   CGL009
      ** Analytical accounting present                                    CGL009
      *                                                                   CGL009
     C           BGN0ST    IFEQ 'Y'                                       CGL009
     C                     MOVEL'Y'       WUANAC                          CGL009
     C                     MOVE '1'       *IN52                           CGL009
     C                     ELSE                                           CGL009
      *                                                                   CGL009
      ** Protect and hide profit centers                                  CGL009
      *                                                                   CGL009
     C                     MOVE '0'       *IN52                           CGL009
     C                     ENDIF                                          CGL009
     C                     END
      *================================================================
     CSR         SCEXIT    ENDSR
      /EJECT
     CSR         Y0SET     BEGSR
      *================================================================
      * Set cursor by *SET CURSOR data
      *================================================================
      *================================================================
     CSR         Y0EXIT    ENDSR
      /EJECT
     CSR         Y1SET     BEGSR
      *================================================================
      * Set cursor by *SET CURSOR data
      *================================================================
      *================================================================
     CSR         Y1EXIT    ENDSR
      /EJECT
     CSR         Y8TST     BEGSR
      *================================================================
      * Test cursor
      *================================================================
     C           @#DFMT    IFEQ '#RCDKEY'
      * KEY Screen
     C                     Z-ADD@#RWCL    ZINPOS  50
     C           ZINPOS    DIV  256       W0CRW
     C                     MVR            W0CCL
     C                     END
     C           @#DFMT    IFEQ '#RCDDTL1'
      * DETAIL Screen
     C                     Z-ADD@#RWCL    ZINPOS  50
     C           ZINPOS    DIV  256       W0CRW
     C                     MVR            W0CCL
     C                     END
      *================================================================
     CSR         Y8EXIT    ENDSR
      /EJECT
     CSR         Y9CLR     BEGSR
      *================================================================
      * Clear *SET CURSOR data
      *================================================================
      *================================================================
     CSR         Y9EXIT    ENDSR
      /EJECT
     CSR         ZASNMS    BEGSR
      *================================================================
      * Send message to program's message queue
      *================================================================
     C           ZAPGMQ    IFEQ *BLANK
     C                     MOVEL##PGM     ZAPGMQ
     C                     END
      * If no message file specified, use default
     C           ZAMSGF    IFEQ *BLANK
     C                     MOVELZADFMF    ZAMSGF
     C                     END
     C                     CALL 'Y2SNMGC'
     C                     PARM           ZAPGMQ 10        Program queue
     C                     PARM           ZAPGRL  5        Rel queue
     C                     PARM           ZAMSID  7        Message ID
     C                     PARM           ZAMSGF 10        Message file
     C                     PARM           ZAMSDA132        Message data
     C                     PARM           ZAMSTP  7        Message type
      * Clear all fields for default mechanism next time
     C                     MOVEL*BLANK    ZAPGMQ
     C                     MOVEL*BLANK    ZAPGRL
     C                     MOVEL*BLANK    ZAMSID
     C                     MOVEL*BLANK    ZAMSGF
     C                     MOVEL*BLANK    ZAMSDA
     C                     MOVEL*BLANK    ZAMSTP
      *================================================================
     CSR         ZAEXIT    ENDSR
      /EJECT
     CSR         ZHHPKY    BEGSR
      *================================================================
      * Display HELP text
      *================================================================
      * Signal help request
     C                     MOVEL'Y'       W0HLP   1
      *
      * Extract cursor row and column
     C           @#RWCL    DIV  256       ZHCSRW  50       Row
     C                     MVR            ZHCSCL  50       Column
      *
      * Save cursor position for redisplay
     C                     Z-ADDZHCSRW    ZZCSRW  30       Row
     C                     Z-ADDZHCSCL    ZZCSCL  30       Column
      *
      *
     C                     CALL 'YDDSHPR'
     C                     PARM 'SDI4E1R' W0HPMB 10        Help text sourc
     C                     PARM *BLANK    YYHPFL 10        Help text file
     C                     PARM *BLANK    YYHPLB 10        Help text libra
     C                     PARM           W0RTN   7
     C                     PARM '*START'  YYHLVN 10        Help label
     C                     PARM '*NORMAL' YYUSOP 10        Options
     C                     PARM ZHCSRW    YYRW    50       Row
     C                     PARM ZHCSCL    YYCL    50       Column
     C                     PARM 1         YYLGCT  50       # of grps
     C                     PARM W0GRP     YYLGVN 10        Label grps
      *
      * Clear set cursor DDS indicator
     C  N94                MOVEL'OFF'     WCSRLC
     C  N94                SETON                     94    *
      *================================================================
     CSR         ZHEXIT    ENDSR
      /EJECT
     CSR         ZXEXPG    BEGSR
      *================================================================
      * Cancel and exit from key screen
      *================================================================
      * USER: Exit program processing
      * 00/Copy Member SD9421REPP - Fontis Interface ICD  *
     C*Fontis Interface ICD Mnt Exit Program Processing
     C/COPY WNCPYSRC,SD9421REPP
     C                     MOVEL*BLANK    P0RTN
     C                     EXSR ZYEXPG
      *================================================================
     CSR         ZXEXIT    ENDSR
      /EJECT
     CSR         ZYEXPG    BEGSR
      *================================================================
      * Exit program: Direct
      *================================================================
      * ROLLBACK any uncommitted DBF changes
     C                     ROLBK                       90
      *
      * Terminate program
     C                     SETON                     LR
      *
      * Exit program
     C                     RETRN
      *
      *================================================================
     CSR         ZYEXIT    ENDSR
      /EJECT
     CSR         ZZINIT    BEGSR
      *================================================================
      * Initialisation
      *================================================================
     C           W0ICL     IFEQ *BLANK
     C                     MOVEL'Y'       W0ICL   1        *Initial call
     C                     ELSE
     C                     MOVEL'N'       W0ICL
     C                     END
     C                     MOVE *BLANK    P0RTN
     C                     MOVE *BLANK    W0RTN   7
     C                     MOVEL*BLANK    W0RSL   1
     C                     MOVEL*BLANK    W0RSF   1
     C                     MOVEL*ZEROS    W0RTW   90
     C                     MOVEL'400'     W0ENV   3
      *                                                                                       CSD101
     C                     MOVE *BLANK    PRTNCD  7                                           CSD101
     C                     MOVE *BLANK    PACTN   1                                           CSD101
     C                     MOVEL'SDINTFVL'PVALST 10                                           CSD101
     C                     MOVE *BLANK    PLIBRY 10                                           CSD101
     C                     MOVE *BLANK    PIDNAM100                                           CSD101
     C                     MOVE *BLANK    PPASS1128                                           CSD101
     C                     MOVE *BLANK    PDESCR                                              CSD101
      * Setup job date/time
      *
     C                     Z-ADDUDATE     ##JDT
      * Set century digit (If YY prior to 1940 treat as 20YY)
     C           ##JYY     IFLT 40
     C                     Z-ADD1         ##JCC
     C                     ELSE
     C                     Z-ADD0         ##JCC
     C                     END
     C                     TIME           ##JTM
      * Update screen time
     C                     TIME           ##TME   60
      * Obtain default message file
     C           *NAMVAR   DEFN Y2MGFLA   ZADFMF 10
     C                     IN   ZADFMF
      * Define work field Run day number
     C                     Z-ADD*ZERO     WURDNB  50
      * Define work field Last Change Date
     C                     Z-ADD*ZERO     WULCD   50
      * Define work field Window processing requir.
     C                     MOVEL*BLANK    WUWDPR  1
      * Define work field No. of Records
     C                     Z-ADD*ZERO     WUNORC  50
      * Define work field No. of Inserts
     C                     Z-ADD*ZERO     WUNOIN  50
      * Define work field No. of Deletes
     C                     Z-ADD*ZERO     WUNODL  50
      * Define work field No. of Amends
     C                     Z-ADD*ZERO     WUNOAM  50
      * Define work field Midas Run Date
     C                     MOVEL*BLANK    WUMRDT  7
      * Define work field Set Up Complete
     C                     MOVEL*BLANK    WUSUC   1
      * Define work field Date format flag
     C                     MOVEL*BLANK    WUDFF   1
      * Define work field Multi-branching Indicator
     C                     MOVEL*BLANK    WUMBIN  1
      *                                                                   CGL009
      ** Define work field Access obj dummy DS (76)                       CGL009
      *                                                                   CGL009
     C                     MOVEL*BLANK    WUFDY  76                       CGL009
      *                                                                   CGL009
      ** Define work field Analytical Accounting                          CGL009
      *                                                                   CGL009
     C                     MOVEL*BLANK    WUANAC  1                       CGL009
      * Flag no *SET CURSOR in the program
     C                     MOVE 'N'       YSETCS  1
     C                     MOVE *BLANK    WCSRLC  3
      *                                                                   CGL009
      ** Check to see if CGL009 - is present.                             CGL009
      ** SAR switched on check - Standard Functions  *                    CGL009
      *                                                                   CGL009
     C                     CALL 'AOSARDR0'             90  SAR switched onCGL009
     C                     PARM *BLANK    WUAPRC  7        Access Pgm RetuCGL009
     C                     PARM '*VERIFY' WQ0147  7        Option for ACCOCGL009
     C                     PARM 'CGL009'  WUSARN  6        SAR number fielCGL009
     C           WUFDY     PARM WUFDY     WQ0149 76        Access obj dummCGL009
      *                                                                   CGL009
      ** Call to program ended in error                                   CGL009
      *                                                                   CGL009
     C           *IN90     IFEQ '1'                                       CGL009
     C                     MOVEL'Y2U0032' W0RTN                           CGL009
     C                     MOVEL*BLANKS   W0CLPG 10                       CGL009
     C                     MOVEL'AOSARDR0'W0CLPG                          CGL009
      *                                                                   CGL009
      ** Send message '*Error occured on CALL...'                         CGL009
      *                                                                   CGL009
     C                     MOVEL'Y2U0032' ZAMSID                          CGL009
     C                     MOVEL'Y2USRMSG'ZAMSGF                          CGL009
     C                     MOVELW0CLPG    ZAMSDA           Message data   CGL009
     C                     EXSR ZASNMS                                    CGL009
     C                     ENDIF                                          CGL009
      *                                                                   CGL009
      ** Check return code.                                               CGL009
      ** CASE: WRK.Access Pgm Return Code is *Normal                      CGL009
      *                                                                   CGL009
     C           WUAPRC    IFEQ *BLANK                                    CGL009
     C           *IN90     ANDEQ'0'                                       CGL009
     C                     MOVEL'Y'       WUGL09  1                       CGL009
     C                     MOVE '1'       *IN56                           CGL009
     C                     ELSE                                           CGL009
      *                                                                   CGL009
      ** CASE: *OTHERWISE                                                 CGL009
      *                                                                   CGL009
     C                     MOVEL'N'       WUGL09                          CGL009
     C                     MOVE '0'       *IN56                           CGL009
     C                     ENDIF                                          CGL009
      * Open files
      * Begin commit control
     C                     CALL 'Y2BGCMC'
     C                     PARM           W0RTN   7
     C           W0RTN     IFNE *BLANK
     C           W0RTN     ANDNE'CPF8351'
     C                     EXSR ZYEXPG
     C                     END
      * Define *Synon program work fields
     C                     MOVEL*BLANKS   W0CFL  10        *Cursor field
     C                     Z-ADD*ZEROS    W0CRW   50       *Cursor row
     C                     Z-ADD*ZEROS    W0CCL   50       *Cursor column
      * Move main file information to JOB context
     C                     MOVE @1FFL     ZZFFL  10        Main file name
     C                     MOVE @1FLB     ZZFLB  10        Main file lib
     C                     MOVE @1FMB     ZZFMB  10        Main file mbr
     C                     MOVE ZZFFL     @1FFL  10
     C                     MOVE ZZFLB     @1FLB  10
     C                     MOVE ZZFMB     @1FMB  10
     C                     CALL 'Y2QLVNR'
     C                     PARM           ZZFFL  10
     C                     PARM           ZZFLB  10
     C                     PARM           ZZFQL  21        LIBRARY/FILE
     C                     OPEN SD9421R#
     C                     OPEN SDFONTL1
     C                     OPEN SDMMODL1
     C                     OPEN SDFONTL0
     C                     OPEN SDFCTLL0
     C           WUGL09    IFEQ 'Y'                                       CGL009
     C                     OPEN FDDTSTL1                                  CGL009
     C                     ENDIF                                          CGL009
     C                     MOVEL'N'       W0PMT   1
      * Set to *CHANGE mode
     C                     MOVEL'CHG'     W0PMD   3
     C                     MOVEL*BLANK    W0GRP   1
      * USER: Initialize program
      * SD9421R Precompiler - Fontis Interface ICD  *
      * Copyright Statement 1997 - Standard Functions  *
      * Get Rundate - Rundate  *
     C           *NAMVAR   DEFN           RUNDAT
     C                     IN   RUNDAT
     C                     MOVE MRDT      ##MRDT  7        RUN DATE
     C                     MOVE MRDT      WUMRDT
     C                     MOVE RDNB      WURDNB           RUNDAY NO.
     C                     MOVE SUC       WUSUC            SET UP COMPLT
     C                     MOVE DFF       WUDFF            DTE FMT FLAG
     C                     MOVE MBIN      WUMBIN           MULTI BR. IND
      * Get 'Window required' ind - MIDAS Modules  *
     C                     EXSR SCRVGN
      * Fontis Intrf ICD DtaStr - Fontis Interface ICD  *
      * 00/Copy Member SD9421RIPG - Fontis Interface ICD  *
      * 00/Copy Member SD9421RFPG - Fontis Interface ICD  *
      * 00/Copy Member SD9421REPG - Fontis Interface ICD  *
      * 00/Copy Member SD9421RCPG - Fontis Interface ICD  *
     C*Fontis Interface ICD Mnt Initialise Program C-spec
     C/COPY WNCPYSRC,SD9421RCPG
      * 00/Copy Member SD9421ROPG - Fontis Interface ICD  *
      *================================================================
      *                                                                                       CSD101
     C           *NAMVAR   DEFN           SDSTAT                                              CSD101
     C                     IN   SDSTAT                                                        CSD101
      *                                                                                       CSD101
      *                                                                                       CSD101
     CSR         ZZEXIT    ENDSR
      /EJECT
     CSR         *PSSR     BEGSR
      *****************************************************************
      *                                                               *
      * *PSSR  - Program exception error routine                      *
      *          Called automatically if a program error occurs,      *
      *          or directly by the program code using EXSR.          *
      *          This subroutine DUMPs the program just once.         *
      *                                                               *
      *****************************************************************
      *
      * Core function specific processing.
      *
     C/COPY WNCPYSRC,SD9421RPSC
      *
      * Start of PSSR user point.
      *
     C/COPY WNCPYSRC,SD9421RPS1
      *
      * Standard Midas PSSR processing.
      *
     C/COPY SDCPYSRC,SDPSSRICD
      *
      * End of PSSR user point.
      *
     C/COPY WNCPYSRC,SD9421RPS2
      *
      *================================================================
     CSR                   ENDSR
      *================================================================
     O*Fontis Interface ICD Mnt Initialise Program O-spec
     O/COPY WNCPYSRC,SD9421ROPG
** CPY@     : Copyright notice for inclusion in all programs
(c) Finastra International Limited 2001
