      *****************************************************************
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas SD ZALIGN Screen Field  Exec User Program')
      *****************************************************************
      *                                                               *
      *  Midas - Standing data module                                 *
      *                                                               *
      *  ZALIGN - Call to execute ZALIGN subroutine                   *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      *  Last Amend No. CPK014  *CREATE    Date 17Jul01               *
      *  Prev Amend No.                    Date ddmmmyy               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CPK014 - Header box added.                                   *
      *                                                               *
      *****************************************************************
      /COPY ZSRSRC,ZALIGNZ1
     C*
     C**
     C           *ENTRY    PLIST                           Entry parameter
     C                     PARM           ZRTN    7        B:Return Code
     C                     PARM           ZFIELD 16        B:Check Field
     C                     PARM           ZADEC   10       I:No Of Decs
     C                     PARM           ZADIG   20       I:No Of Digits
     C                     PARM           ZAFLD  16        O:Check Field
     C**
     C********************************************************************
     C**
     C                     MOVE *BLANK    ZRTN
     C**
     C                     EXSR ZALIGN
     C**
     C           *IN99     IFEQ '1'
     C                     MOVE '*ERROR*' ZRTN
     C                     ELSE
     C                     MOVELZFIELD    ZAFLD
     C                     END
     C**
     C                     RETRN
     C**
      /COPY ZSRSRC,ZALIGNZ2
