      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas - TOF Deal Type/Subtype File')                   *
      *****************************************************************
      *                                                               *
      *  TOF / Midas Interface                                        *
      *                                                               *
      *  PF/FDDTSTXT - Deal Type/Subtype  extension file              *
      *                                                               *
      *  (c) Finastra International Limited 2012                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. 207288 *CREATE     Date 29May03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  207288 - Extension file to hold Spot indicator.              *
      *           Applied for AR999664 (Child: AR999668)              *
      *                                                               *
      *****************************************************************
      *
     A                                      UNIQUE
     A          R FDDTSTD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2012')
      *
     A            TFDTPE         2A         TEXT('Deal type')
     A                                      COLHDG('Deal' 'Type')
     A            TFDLST         2A         TEXT('Deal subtype')
     A                                      COLHDG('Deal' 'Subtype')
     A            TFSPOT         1A         TEXT('Spot indicator')
     A                                      COLHDG('Spot' 'Indicator')
      *
     A          K TFDTPE
     A          K TFDLST
