      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_15WF                                                      *
/*EXI *  TEXT('Midas FD Location/Currency')
     A****************************************************************
     A*                                                              *
     A*                                                              *
     A*  Midas - Standing Data Module
     A*                                                              *
     A*   FDLCCYPP - LOCATION CURRENCY FILE.                         *
     A*                                                              *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                              *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*   LAST AMEND NO. XXXXXX     DATE  XX/XX/XX                   *
     A*                                                              *
     A*                                                              *
     A*****************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R FDLCCYP0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*
     A            LCRCID    R               REFFLD(RCID)
     A            LCDLTF    R               REFFLD(DLTF)
     A            LCDLUP    R               REFFLD(DLUP)
     A            LCMLUP    R               REFFLD(MLUP)
     A            LCYLUP    R               REFFLD(YLUP)
     A            LCTLUP    R               REFFLD(TLUP)
     A            LCCHTP    R               REFFLD(CHTP)
     A            LCLCD     R               REFFLD(LCD)
     A            LCLUID    R               REFFLD(LUID)
     A            LCLCOD    R               REFFLD(LOCD)
     A            LCLCNM    R               REFFLD(LCTM)
     A            LCLCCY    R               REFFLD(LCCY)
