      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas DL BROKERAGE RATES - HEADER')
     A**************************************************************
     A*                                                            *
     A*  Midas - Dealing Module
     A*                                                            *
     A*   PF/BROKRBN    BROKERAGE RATES HEADER RECORD              *
     A*                                                            *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                            *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*   LAST AMENDMENT NO. 00               DATE 00/00/00        *
     A*                                                            *
     A**************************************************************
     A                                      REF(MFRFL)
     A          R BROKRBNF                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            RECI      R
     A            BRKC      R
     A            CCY       R
     A            NORE      R
     A            FLSZ      R
     A            NLRB      R
     A            NINS      R               REFFLD(NINS0 )
     A            NAMD      R               REFFLD(NAMD0 )
     A            NDEL      R               REFFLD(NDEL0 )
     A            NLRA      R
     A            TBLTC     R
     A            ZZ142     R
     A            LCD       R
     A            CHTP      R
     A            TNLU      R
