      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
      *****************************************************************
      *                                                               *
      *  Midas  - DL                                                  *
      *                                                               *
      *  PF/DEALSBX0 - Midas DL DEALSDB Extension File                *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2016            *                       LUC109
      *                                                               *
      *  Last Amend No. LUC109  *CREATE    DATE 23Aug16               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  LUC109 - HO Reporting (Upgrade to FB Midas 2.1)              *
      *                                                               *
      *****************************************************************
     A          R DEALBFX0                  TEXT('(C) Copyright Misys +
     A                                      International 2016')
      *
     A            MDLNO          6S 0       COLHDG('Deal Number')
      *
     A            MXTRNO        25A         COLHDG('Murex Transaction' +
                                                   'ID')
      *
     A            MXNTAF         1A         COLHDG('Netting Agreement' +
                                                   'flag')
      *
     A            MXCNTL        25A         COLHDG('Contract ID')
      *
     A            SWPLEG         4A         COLHDG('SWAP Leg')
      *
