      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas DL Monthly/Yearly Withholding Tax File')         *
      *****************************************************************
      *                                                               *
      *  Midas - Dealing Module                                       *
      *                                                               *
      *  PF/DLAWTXPD - Monthly/Yearly Witholding Tax File             *
      *                                                               *
      *  (C) Copyright Midas-Kapiti International Ltd. 2015           *
      *                                                               *
      *  Last Amend No. CGL165  *CREATE    Date 23Feb15               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGL165 - Dual Withholding Tax                                *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R DLAWTXD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2015')
     A            RECI      R
     A            CCY       R
     A            TXRC           2A         TEXT('Tax rate code')
     A                                      COLHDG('Tax Rate Code')
     A            MTXA          13P 0       TEXT('MTD Tax amount')
     A                                      COLHDG('MTD Tax Amount')
     A            YTXA          13P 0       TEXT('YTD Tax Amount')
     A                                      COLHDG('YTD Tax Amount')
     A            MTXL          13P 0       TEXT('MTD Tax Amount in Local CCY')
     A                                      COLHDG('MTD Amnt Local CCY')
     A            YTXL          13P 0       TEXT('YTD Tax Amount in Local CCY')
     A                                      COLHDG('YTD Amnt Local CCY')
     A*---------------------------------------------------------------
     A          K CCY
     A          K TXRC
