      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas DL FID deposit commission/chrgs type trailer')
      *****************************************************************
      *                                                               *
      *  Midas - Dealing Module                                       *
      *                                                               *
      *  PF/DLCCGDPA - FID Deposit Commission/Charges Type Trailer    *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.01 -----------------------------------------------*
      *  Prev Amend No. CDL006  *CREATE    Date 26Apr99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CDL006 - Dealing Fiduciary                                   *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R DLCCGDD1                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A            FDNORE         5P 0       TEXT('Number of Records +
     A                                           on File')
     A                                      COLHDG('Number of' +
     A                                             'Records on File')
     A            FDNINS         4S 0       TEXT('Number of Records +
     A                                           Inserted')
     A                                      COLHDG('Number of' +
     A                                             'Records Inserted')
     A            FDNAMD         4S 0       TEXT('Number of Records +
     A                                           Amended')
     A                                      COLHDG('Number of' +
     A                                             'Records Amended')
     A            FDNDEL         4S 0       TEXT('Number of Records +
     A                                           Deleted')
     A                                      COLHDG('Number of' +
     A                                             'Records Deleted')
     A            FDNLRB         5P 0       TEXT('Number of Live +
     A                                           Records Before I/C')
     A                                      COLHDG('Number of Live' +
     A                                             'Records Before' +
     A                                             'I/C')
      *
