      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas DL Deal Interest Rate History')
      *****************************************************************
      *                                                               *
      *  Midas Dealing                                                *
      *                                                               *
      *  PF/DLDIRHPD - FTP/Receive/Input                              *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2005            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CDL034 *CREATE     Date 08Mar05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CDL034 - Back-valued Base Rate changes for MM deals          *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R DLDIRHD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2005')
      *
     A            A2RECI    R               REFFLD(RECI)
     A            A2DLNO    R               REFFLD(DLNO)
     A            A2HISD    R               REFFLD(HISD)
     A            A2CYCD    R               REFFLD(CYCD)
     A            A2PCPL    R               REFFLD(PCPL)
     A            A2BRT     R               REFFLD(BRT)
     A            A2CBSR    R               REFFLD(CBSR)
     A            A2RTSP    R               REFFLD(RTSP)
     A            A2INTR    R               REFFLD(INTR)
     A            A2ICBS    R               REFFLD(ICBS)
     A            A2AINP        13P 0       TEXT('Accrued interest posted')
     A                                      COLHDG('Accrued' ' Interest' -
     A                                      'Posted')
     A            A2AID1        13P 0       TEXT('Accrued interest: Day 1')
     A                                      COLHDG('Accrued' ' Interest' -
     A                                      'Day 1')
 
     A          K A2DLNO
     A          K A2HISD
