      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas DL Foreign Exchange Requirements Details')
      *****************************************************************
      *                                                               *
      *  Midas - Dealing Module                                       *
      *                                                               *
      *  PF/DLFXMRPD - Foreign Exchange Margin Requirements Details   *
      *                                                               *
      *  (c) Finastra International Limited 2003                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 25Nov05               *
      *                 CLE025  *CREATE    Date 20Oct03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CLE025 - Credit Lines                                        *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R DLFXMRD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2003')
      *
      * Begin /CSD027/
     A**********  F2FCCU         6S 0       TEXT('Facility Customer')                         CSD027
     A            F2FCCU         6A         TEXT('Facility Customer')
      * End /CSD027/
     A                                      COLHDG('Facility Customer')
     A            F2FACT         3S 0       TEXT('Facility Type')
     A                                      COLHDG('Facility Type')
     A            F2FCNO         2S 0       TEXT('Facility Sequence')
     A                                      COLHDG('Facility Sequence')
     A            F2MACY         3A         TEXT('Margin Currency')
     A                                      COLHDG('Margin Currency')
     A            F2RCAL         1A         TEXT('Recalculate?')
     A                                      COLHDG('Recalculate?')
     A            F2TMAR        15P 0       TEXT('Total Margin Posted')
     A                                      COLHDG('Total Margin Posted')
     A            F2TMAF        15P 0       TEXT('Total Margin Posted in FCCY')
     A                                      COLHDG('Total Margin Posted' +
     A                                             'in FCCY')
     A            F2TMAC        15P 0       TEXT('Total Margin Posted +
     A                                            in CA CCY')
     A                                      COLHDG('Total Margin Posted' +
     A                                             'in CA CCY')
