      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas DL Invalid FRCD Date Schedule')
      *****************************************************************
      *                                                               *
      *  Midas - Dealing Module                                       *
      *                                                               *
      *  PF/DLIFRSCPD - Midas DL Invalid FRCD Date Schedule           *
      *                                                               *
      *  (c) Finastra International Limited 2005                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CDL033  *CREATE    Date 10Feb05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CDL033 - Floating Rate CDs Issued                            *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R DLIFRSCD0                 TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2005')
      *
     A            SFOTRANID     20A         TEXT('Front Office Transaction Id')
     A                                      COLHDG('Front Office' 'Transaction +
     A                                              Id')
     A            SRPRLOCN       1A         TEXT('Deal Repair Location')
     A                                      COLHDG('Deal Repair' 'Location')
     A            SRDAT164     984A         TEXT('Rate Change Dates x164')
     A                                      COLHDG('Rate Change' 'Dates x164')
     A            SRCOH164     164A         TEXT('Confirmed Holiday x164')
     A                                      COLHDG('Confirmed Hol. 164')
     A            SPDAT164     984A         TEXT('Pay Change Dates x164')
     A                                      COLHDG('Pay Change' 'Dates x164')
     A            SPCOH164     164A         TEXT('Pay Confirmed Hol. x164')
     A                                      COLHDG('Pay Conf. Hol. x164')
      ** Timestamp
     A            STMESTMP  R               REFFLD(TIMESTMP)
