      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas DL OIS Settlement Control File')
      *****************************************************************
      *                                                               *
      *  Midas - Dealing Module                                       *
      *                                                               *
      *  PF/DLOISSPD - OIS Settlement Control file                    *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      *  Last Amend No. CIR007  *CREATE    Date 11May01               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CIR007 - Overnight Index Swaps                               *
      *                                                               *
      *****************************************************************
      *
     A          R DLOISSD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            L5BRCA         3A         TEXT('Booking Branch')
     A                                      COLHDG('Booking Branch')
     A            L5CURR         3A         TEXT('Currency')
     A                                      COLHDG('Currency')
     A            L5DLNO         6S 0       TEXT('Deal Number')
     A                                      COLHDG('Deal Number')
     A            L5RFIN         1A         TEXT('Rate Fixed Indicator')
     A                                      COLHDG('Rate Fixed Indicator')
     A            L5SRUN         3S 0       TEXT('Settlement Runs')
     A                                      COLHDG('Settlement Runs')
     A            L5SFST         1A         TEXT('Select for +
     A                                      Settlement')
     A                                      COLHDG('Select for' +
     A                                      'Settlement')
