      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas DL Valid FRCD Date Schedule')
      *****************************************************************
      *                                                               *
      *  Midas - Dealing Module                                       *
      *                                                               *
      *  PF/DLVFRSCPD- Midas DL Valid FRCD Date Schedule              *
      *                                                               *
      *  (c) Finastra International Limited 2005                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CDL033  *CREATE    Date 10Feb05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CDL033 - Floating Rate CDs Issued                            *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R DLVFRSCD0                 TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2005')
     A            XFOTRANID     20A         TEXT('Front Office Transaction Id')
     A                                      COLHDG('Front Office ' +
     A                                      'Transaction Id')
     A            XRPRLOCN       1A         TEXT('Deal Repair Location')
     A                                      COLHDG('Deal Repair Location')
     A            XRDAT164     492A         TEXT('Rate Change Dates x164')
     A                                      COLHDG('Rte Chnge Dtes x164')
     A            XRCOH164     164A         TEXT('Confirmed Holiday x164')
     A                                      COLHDG('Confirmed Hol. 164')
     A            XPDAT164     492A         TEXT('Int. Change Dates x164')
     A                                      COLHDG('Int. Chnge Dts x164')
     A            XPCOH164     164A         TEXT('Confirmed Hol. x164')
     A                                      COLHDG('Confirmed Hol. x164')
