      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas DL Deposit Service Fee Detail')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Dealing Module                             *
     A*                                                               *
     A*    PF/DPSVFAA - DEPOSIT SERVICE FEE DETAIL                    *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01390             Date 29Jan92               *
      *                 AUS005             Date 22Jan91               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     A*    S01390 - Release 10 Changes for Australianisation          *
     A*    AUS005 - AUSTRALIAN PRODUCT - FID PROCESSING               *
     A*                                                               *
     A*****************************************************************
     A          R DPSVFR
     A**********                                     Begin /S01390/
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A**********                                     End   /S01390/
     A            RECI           1A         TEXT('RECORD ID')
     A            DLNO           6S 0       TEXT('DEAL NUMBER')
SA001A**********  FDAA          13P 4       TEXT('SERVICE FEE ACC/AMT')
SA001A*           FLRA          13P 2       TEXT('SERVICE FEE F-RAT/AMT')
SA001A*           FPRA          13P 2       TEXT('SERVICE FEE PRINCIPAL')
SA001A*           FYTD          13P 2       TEXT('SERVICE FEE POS/YTD')
SA001A*           FPPY          13P 2       TEXT('SERVICE FEE POS/LST-YER')
SA001A**********  FDTP          13P 2       TEXT('SERVICE FEE TO BE POSTED')
SA001A            FDAA          13P 0       TEXT('SERVICE FEE ACC/AMT')
SA001A            FLRA          13P 0       TEXT('SERVICE FEE F-RAT/AMT')
SA001A            FPRA          13P 0       TEXT('SERVICE FEE PRINCIPAL')
SA001A            FYTD          13P 0       TEXT('SERVICE FEE POS/YTD')
SA001A            FPPY          13P 0       TEXT('SERVICE FEE POS/LST-YER')
SA001A            FDTP          13P 0       TEXT('SERVICE FEE TO BE POSTED')
     A            DFID           1A         TEXT('SERVICE FEE INDICATOR')
     A            FDCD           5P 0       TEXT('SERVICE FEE CONTROL/DATE')
SA001A********    FANP          13P 2       TEXT('SERVICE FEE ADJ-NOT-POS')
SA001A********    FAAP          13P 2       TEXT('SERVICE FEE ADJ-POSTED')
SA001A            FANP          13P 0       TEXT('SERVICE FEE ADJ-NOT-POS')
SA001A            FAAP          13P 0       TEXT('SERVICE FEE ADJ-POSTED')
     A            LCD            5P 0       TEXT('LAST CHANGE DATE')
     A            CHTP           1A         TEXT('LAST CHANGE TYPE')
     A            CFFD           1A         TEXT('CUS FID INDICATOR FOR DEAL')
SA001A*********   FAAM          13P 2       TEXT('SERVICE FEE ADJ-THIS-MONTH')
SA001A            FAAM          13P 0       TEXT('SERVICE FEE ADJ-THIS-MONTH')
     A*
