      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SM FBP Schema Upgrade Status DTAARA Layout')     *
      *****************************************************************
      *                                                               *
      *  Midas - Implementation Module                                *
      *                                                               *
      *  SMZUPSTAT - FusionBanking Platform Schema Upgrade Status     *
      *              DTAARA Layout                                    *
      *                                                               *
      *  Note: Any fix applied to this file may also need to be       *
      *        applied to the DTAARA source.                          *
      *                                                               *
      *  (c) Finastra International Limited 2021                      *
      *                                                               *
      *  Last Amend No. MD057446  *CREATE  Date 12Jun21               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD057446 - Duplicate key error on SMUPGCTD when running      *
      *             PRCA. Create separate programs for global and     *
      *             zonal schema upgrade. Create new DTAARA used to   *
      *             save the status of zonal schema migration.        *
      *                                                               *
      *****************************************************************
     A          R SMZUPSTATF                TEXT('(c) Finastra +
     A                                      International Limited +
     A                                      2021')
      *
     A            SMPHAS         1A         TEXT('Schema Upgrade +
     A                                      Phase Indicator')
      *****************************************************************
