      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas Journal Exrtract File for EM0100')
     A*
     A********************************************************************
     A***                                                              ***
     A*  Midas - Restart Recovery Module
     A***                                                              ***
     A***        LF/JRNEM  JOURNAL EXTRACT FILE FOR EM0100             ***
     A***                                                              ***
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A***                                                              ***
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A***LAST AMEND NO. 00                 DATE 00/00/00               ***
     A***                                                              ***
     A********************************************************************
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A********************************************************************
     A          R QJORDJE                   PFILE(JRNEX3)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K JOCCID
     A          O JOPGM                     VALUES('BC0230' 'BC0233' 'CL1260' +
     A                                             'DL0110' 'DL0115' 'DL0330' +
     A                                             'LE0130' 'LE0150' 'LE1080' +
     A                                             'ST0330')
     A          S JOOBJ                     VALUES('BTRAN' 'CLOANCL' 'CUSEXCE' +
     A                                           'DEALSDB' 'DEALSDC' 'DEALSDD' +
     A                                           'DEAMSDI' 'LOANSCS' 'LOANSC7' +
     A                                           'LOAMSDK')
     A            JOENTT                    VALUES('BR' 'DR' 'PT' 'RB' 'UB' +
     A                                             'UP')
     A          O                           ALL
