      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas API List of Todays Trans - Send Trans no.')
      *****************************************************************
      *                                                               *
      *  Midas - API                                                  *
      *                                                               *
      *  PRT/AP0001P2 - List of Todays Transactions                   *
      *                 By Sending Transaction Number                 *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      *  Prev Amend No. BUG27041           Date 01Mar10               *
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CAP033             Date 26Apr99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CAP002  *CREATE    Date 02Feb98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  BUG27041 - Incorrect mapping for MQ STCQ                     *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CAP033 - Conversion of PM inputs into modular structure to   *
      *           use as APIs.                                        *
      *  CAP002 - Conversion of transaction inputs into modular       *
      *           structure to use as APIs.                           *
      *                                                               *
      ********************************************************************
      *
      **********************
      * MAIN REPORT HEADER
      **********************
     A          R AP001BH1                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A                                      SKIPB(003)
     A                                     2'REFERENCE AP0001P2'
     A            TITL          53        37
     A                                    99'DATE'
     A            ORUNA          7       105
     A                                   115'PAGE'
     A            PAGE           4  0    120
     A                                      EDTCDE(Z)
     A                                      SPACEA(001)
     A                                    25'LIST OF TODAYS API TRANSACTIONS +
                                            - BY SENDING SYSTEM TRANS. NO.'
     A                                    99'TIME'
     A                                   105TIME
     A                                      EDTWRD('  :  :  ')
     A                                      SPACEA(001)
     A                                    25'-------------------------------   +
     A                                      ----------------------------'
     A                                      SPACEA(002)
      *
     A          R AP001BH2
     A                                      SPACEA(001)
     A**Start of change CGL029
     A**********                          11'SENDING TRANS NO'                                CGL029
     A**********                          +8'TIME OF ARRIVAL ON AS400'                        CGL029
     A**********                          +8'MIDAS'                                           CGL029
     A                                     2'SENDING TRANS NO'
     A                                   +26'TIME OF ARRIVAL ON AS400'
     A                                    +5'MIDAS'
     A**End of change CGL029
      *                                              Begin /CAP033/
     A***********                         +7'MIDAS'
     A**Start of change CGL029
     A**********                          +7'MIDAS TRANSACTION ID'                            CGL029
     A**Start of change BUG27041
     A**********                          +3'MIDAS TRANSACTION ID'                          BUG27041
     A**End of change BUG27041
     A**End of change CGL029
      *                                              End   /CAP033/
     A**Start of change CGL029
     A**********                          +5'ACTION'                                          CGL029
     A**********                          +5'STATUS'                                          CGL029
     A**Start of change BUG27041
     A**********                          +8'ACTION'                                        BUG27041
     A                                    +3'ACTION'
     A**End of change BUG27041
     A                                    +2'STATUS'
     A**End of change CGL029
     A                                      SPACEA(001)
     A**Start of change CGL029
     A**********                          65'MODULE ID'                                       CGL029
     A                                    71'MODULE ID'
     A**End of change CGL029
      *                                              Begin /CAP033/
     A***********                         +4'DEAL NO'
     A***********                         +5'TYPE'
     A**Start of change CGL029
     A**********                         +31'TYPE'                                            CGL029
     A**Start of change BUG27041
     A**********                         +30'TYPE'                                          BUG27041
     A                                    +2'TYPE'
     A**End of change BUG27041
     A**End of change CGL029
      *                                              End   /CAP033/
     A**Start of change BUG27041
     A                                      SPACEA(001)
     A                                     5'MIDAS TRANSACTION ID'
     A**End of change BUG27041
     A          R AP001BD1
     A                                      SPACEB(001)
     A**Start of change CGL029
     A**********  RFOTR         20A  O    11                                                  CGL029
     A**********  RTMES         26A  O    +4                                                  CGL029
     A**********  RMIDA          2A  O    +7                                                  CGL029
     A            RFOTR         40A  O     2
     A            RTMES         26A  O    +2
     A            RMIDA          2A  O    +4
     A**End of change CGL029
      *                                              Begin /CAP033/
     A*********** RMIDT          6A  O    +8
     A**Start of change CGL029
     A**********  RMIDT         20A  O    +9                                                  CGL029
     A**Start of change BUG27041
     A**********  RMIDT         26A  O    +5                                                BUG27041
     A**End of change BUG27041
     A**End of change CGL029
      *                                              End   /CAP033/
     A**Start of change CGL029
     A**********  RACTN          6A  O    +5                                                  CGL029
     A**********  RSTAT          7A  O    +5                                                  CGL029
     A**Start of change BUG27041
     A**********  RACTN          6A  O    +2                                                BUG27041
     A            RACTN          6A  O    +5
     A**End of change BUG27041
     A            RSTAT          7A  O    +2
     A**End of change CGL029
     A**Start of change BUG27041
     A                                      SPACEA(001)
     A            RMIDT         50A  O     5
     A**End of change BUG27041
      *
      *******************
      *REPORT TRAILER
      *******************
     A*
     A          R AP001BST
     A                                      SPACEB(003)
      *
     A                                    44'*** NO DETAILS TO REPORT ***'
      *
      **************
      * REPORT END
      **************
     A          R AP001BT
     A                                      SPACEB(003)
     A                                    48'*** END OF REPORT ***'
      *
