      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GZ Aggregate Facility Hierarchy')
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  PF/GZLEFCHRL1 - Aggregate Facility Hierarchy                 *
      *                                                               *
      *  (c) Finastra International Limited 2004                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. BUG10215           Date 27Sep06               *
      *                 BUG6140            Date 01Mar05               *
      *                 CLE041  *CREATE    Date 11Oct04               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  BUG10215 - Global replication needs a global interface       *
      *  BUG6140 - Various error due to FCZONE.                       *
      *  CLE041 - Collateralised Lending Phase 2B                     *
      *                                                               *
      *****************************************************************
      *
     A                                      UNIQUE
     A          R LEFCHRD0                  PFILE(GZLEFCHRPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2004')
      *
      **Start of BUG6140
     A          K FCZONE
      **End of BUG6140
      **Start of BUG10215
     A**********K FCCARN                                                                    BUG10215
      **End of BUG10215
     A          K FCHYID
      **Start of BUG6140
     A**********K FCZONE                                                                     BUG6140
      **End of BUG6140
      *
