      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXI *  TEXT('Midas GZ Valid action codes by user/brch/item')
/********LF_IM                                                        *                       BG1364
/*EXS *  LF_IMSN                                                      *                       BG1364
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  LF/GZMACBRL2 - Valid Action Codes for User/Item/Branch       *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. 239898             Date 29May06               *
      *  Prev Amend No. BUG9969 *CREATE    Date 12Jan06               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  239898 - Applied core fix BUG11032.                          *
      *  BUG11032 - Keyed global MACBR file for menu item reporting   *
      *  BUG9969 - Menu Security                                      *
      *                                                               *
      *****************************************************************
      *
     A                                      UNIQUE
     A          R MACBRDDF                  PFILE(GZMACBRDD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
      *
     A          K USRP
     A          K INDX
     A          K BRCB
      *
      **Start of change BUG11032
      *
     A          R MACBRGP                   PFILE(GPMACBRDD)
     A            RECI      R
     A            USRP      R
     A            MGRP      R
     A            ICDE      R
     A            BRCB      R
     A            ACA1      R
     A            ACA2      R
     A            ACA3      R
     A            ACA4      R
     A            ACA5      R
     A            ACA6      R
     A            ACA7      R
     A            ACA8      R
     A            ACA9      R
     A            ACA10     R
     A            LCD       R
     A            CHTP      R
     A            LCT       R
     A            INDX          10
     A            ZONE          10
     A          K USRP
     A          K INDX
     A          K BRCB
      **End of change BUG11032
