      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GZ SWIFTRef BANK DIRECTORY Plus')                *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  LF/GZMEBIB3L1 - Midas ME SWIFTRef BANK DIRECTORY Plus        *
      *                                                               *
      *  (c) Finastra International Limited 2013                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. MD023533           Date 18Nov13               *
      *                 MD022168 *CREATE   Date 12Sep13               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  MD023533 - GOC0100 seq 00199 failed in COB                   *
      *  MD022168 - GZMEBIB3PD Replication                            *
      *                                                               *
      *****************************************************************
      *                                     UNIQUE
     A          R MEBIB3D0                  PFILE(GZMEBIB3PD)
     A                                      TEXT('(c) Finastra +
     A                                      International +
     A                                      Limited +
     A                                      2013')
      *
      **Start of change MD023533
     A**********K B3BRCD                                                                    MD023533
     A          K B3ZONE
      **End of change MD023533
     A          K B3KEY
      *****************************************************************
