      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas RE Outward Clearing Transaction Types')
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  LF/GZRETTYPL0 - Outward Clearing Transaction Types           *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2015            *
      *                                                               *
      *  Last Amend No. MD035554 *CREATE   Date 11May16               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD035554 - 2 O'clock/ABC Compatibility                       *
      *                                                               *
      *****************************************************************
     A          R RETTYPD0                  PFILE(GZRETTYPPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2015')
     A          K GTTYP
      *
