      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GZ Midas System Values keyed GIZONE,GISVAL')
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  LF/GZSDSVALL1 - GZ Midas System Values keyed on GIZONE,GISVAL*
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2010            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      *  Last Amend No. CAP205  *CREATE    Date 23Mar10               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CAP205 - Teller Related APIs - Account Balance Check         *
      *                                                               *
      *****************************************************************
      *
     A                                      UNIQUE
     A          R SDSVALD0                  PFILE(GZSDSVALPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. 2010')
      *
     A          K GIZONE
     A          K GISVAL
