      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('UDF Table for Journal Entry')                          *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  LF/TGZBTPX1 - UDF Table for Journal Entry                    *
      *                                                               *
      *  (c) Finastra International Limited 2021                      *
      *                                                               *
      *  Last Amend No. MD057614 *CREATE   Date 28May21               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD057614 - BITP have incomplete journal details              *
      *             Apply for MD-58181.                               *
      *                                                               *
      *****************************************************************
      *
     A          R T_GZBITPEX                PFILE(T_GZBITPEX)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2021')
      *
     A            ZONE
     A            DDBTNB
     A            DDBINB
     A            DDBEDT
      *
     A          K DDBTNB
     A          K DDBEDT
     A          K ZONE
      *
