      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GZ Customer Extension by Customer/Zone')
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  LF/TGZCUSTEX1 - Midas GZ Customer Extension                  *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2007            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Last Amend No. BUG17953           Date 10Apr08               *
      *  Prev Amend No. BUG14009             Date 28Jun07             *
      *                 BUG12080  *CREATE    Date 18Jan07             *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  BUG17953 - CCSID of tables cannot be changed (Recompile)     *
      *  BUG14009 - Added a new field DDSTAT to identify the Status   *
      *             of the Customer i.e. 'Close' or 'Release'.        *
      *             (Recompile)                                       *
      *  BUG12080 - Customer Data Take-on Update                      *
      *                                                               *
      *****************************************************************
      *
     A          R T_GZCUSTEX                PFILE(T_GZCUSTEX)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2007')
      *
     A          K DDCUSN
     A          K ZONE
      *
