      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GP Global Instruments')
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  PF/GPINSTPD - Global Instruments                             *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. BG5769  *MOVED     Date 15Feb05               *
      *  Prev Amend No. CGP001  *CREATE    Date 23May03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  BG5769 - Move file from GMLIB to GTALIB.                     *
      *  CGP001 - Global Processing                                   *
      *                                                               *
      *****************************************************************
      *
     A          R GPINSTD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
      *
     A            INGINS        10          TEXT('Global Instrument Code')
     A                                      COLHDG('Global' +
     A                                             'Instrument' +
     A                                             'Code')
     A            INDESC        50          TEXT('Description')
     A                                      COLHDG('Description')
     A            INLCD          5P 0       TEXT('Last Change Date')
     A                                      COLHDG('Last' +
     A                                             'Change' +
     A                                             'Date')
     A            INCHTP         1          TEXT('Change Type')
     A                                      COLHDG('Change' +
     A                                             'Type')
     A            INCUSR        10          TEXT('Change User')
     A                                      COLHDG('Change' +
     A                                             'User')
