      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GP Switchable f - initialisation pgm')
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  PF/GPSARPPD - Switchable Features Initialisation Programs    *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2005            *
      *                                                               *
      *   If the attributes of this file are changed then the         *
      *   associated BRIDGE upgrade utilities must also be amended.   *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. BG7665  *CREATE    Date 20Jun05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  BG7665 - Global switchable features                          *
      *                                                               *
      *****************************************************************
     A          R SCSARPD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2005')
     A*---------------------------------------------------------------------
     A            AKSARN         6          TEXT('Switchable Feature Number')
     A                                      COLHDG('Switchable' +
     A                                             'Feature Number' )
     A            AKPNAM        10          TEXT('Program Name')
     A                                      COLHDG('Program Name' )
     A            AKPRVC         1          TEXT('Program Previously Called')
     A                                      COLHDG('Program' +
     A                                             'Previously Called' )
     A            AKPDSC        50          TEXT('Program Description')
     A                                      COLHDG('Program Description' )
     A            AKTYL1         1          TEXT('Type of Last Change')
     A                                      COLHDG('Type of' +
     A                                             'Last Change' )
     A            AKLCD          5  0       TEXT('Last change date')
     A                                      COLHDG('Last change' +
     A                                             'date' )
     A                                      EDTCDE(3)
     A*=====================================================================
