      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GP Global core non-switchable developments')     *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing                                    *
      *                                                               *
      *  PF/GPSARNPD - Global core non-switchable developments        *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2010            *
      *                                                               *
      *   If the attributes of this file are changed then the         *
      *   associated BRIDGE upgrade utilities must also be amended.   *
      *                                                               *
      *  Last Amend No. CUP039 *CREATE     Date 22Dec10               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CUP039 - Creation of a list of non-switchable developments   *
      *           within the system.                                  *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A          R SCSARSD0                  FORMAT(GPSARSPD)
      *
     A          K AXSARN
