      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
      *****************************************************************
      *                                                               *
      *  Midas - Interface to Head Office Reporting                   *
      *                                                               *
      *  LF/CLOANCY1 - Midas Customer Loans Extension File            *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *  Last Amend No. LUC109             Date 23Aug16               *
      *  Prev Amend No. LUC013 (*Create)   Date 11Jun08               *
      *                 xxxxxx             Date ddmmmyy               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  LUC109 - HO Reporting (Upgrade to FB Midas 2.1)              *
      *  LUC013 - Head office upgrade to MidasPlus                    *
      *                                                               *
      *****************************************************************
     A          R CLOANFX0                  TEXT('(c) Misys International +
     A                                      Banking Systems 2001')
     A                                      PFILE(CLOANCX0)
     A          K MLNRF
