      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas LE Customer lending facility file')              *
     A*****************************************************************     ****
     A*                                                                        *
     A*  Midas - Customer Lending Module
     A*                                                                        *
     A*   LF/FCLTY1     CUSTOMER LENDING FACILITY FILE                         *
     A*                                                                        *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                                        *
      *  Last Amend No. CLE134             Date 01Aug12               *
      *  Prev Amend No. AR750770           Date 28Aor11               *
      *                 CLE064             Date 06Dec10               *
      *                 CER059             Date 19Jul10               *
      *                 CER020             Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027             Date 05Dec05               *
      *                 CLE042             Date 06Sep05               *
      *                 CAP086             Date 08Jun05               *
      *                 CGL029             Date 01Sep03               *
      *                 CLE029             Date 24Sep02               *
      *                 CLE034             Date 05May03               *
      *                 CLE031             Date 03Feb03               *
      *                 CLE028             Date 27Jun02               *
      * Midas Release 4.01 -------------------------------------------*
      *                 CAP068             Date 25Jun02               *
      *                 CLE023             Date 19Nov01               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 189544             Date 01May01               *
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CPB001             Date 01Jun99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*                 147935             Date 17Dec98               *
     A*                 147261             Date 10Dec98               *
     A*                 CLE008             Date 10Dec98               *
      *                 149036             Date 07Dec98               *
     A*                 CEU004             Date 02Feb98               *
     A*                 CLE005             Date 31Dec97               *
     A*                 CLE004             Date 02Dec96               *
     A*                 S01270             Date 15Jun90               *        *
     A*                                                                        *
     A**************************************************************************
     A*
      *  CLE134 - Past Due Call Loan Processing (Recompile)           *
      *  AR750770 - New Frequencies on Rollover Types field not dis-  *
      *             played in Facilities Input Today (Child: AR750771)*
      *  CLE064 - Enhancement of Lending Frequencies (Recompile)      *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER020 - Enhanced Rollover Window: Upgrade FGE089 to         *
      *           Midas Plus                                          *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CLE042 - Extended Loan Sub Type                              *
      *  CAP086 - Introduce Auto Authorisation to the API's           *
      *           without it. (Recompile)                             *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CLE029 - Severity Codes.                                     *
      *  CLE034 - Lending Enhancements for Phase 1 Priority 1A        *
      *  CLE031 - Lending Enhancements.                               *
      *  CLE028 - Flat Rate Personal Loans (Rule of 78s)              *
      *  CAP068 - Recompiled for changes to FCLTYFM and FCLTYFN.      *
      *  CLE023 - Lending Facility History Improvements.              *
     A*  189544 - Add extra fields to be reported in LE0300.          *
     A*  CPB001 - Meridian DBA Middleware Replication Customization.  *
     A*           Recompiled due to changes in file FCLTYFM.          *
     A*  147935 - Addition of insert, authorise and amend user        *
     A*           profiles to lending reports                         *
     A*  147261 - Assignment/Participation Ind required for Funding   *
     A*           participants.                                       *
     A*  CLE008 - Loan Administration ID Amendment                    *
      *  149036 - Settlement instructions should be included here     *
      *           as it is being generated in LE0300P2 report         *
     A*  CEU004 - LE Settlement Ccy Conversion Upgrade to DBA R2.0    *
     A*           Recompiled due to changes in file FCLTYFM.          *
     A*  CLE005 - Customer Lending Enhancements - Others (T3)         *
     A*           Recompiled due to changes in FCLTYFM                *
     A*  CLE004 - Customer Lending Enhancements - Syndications        *
     A*  S01270 - CUSTOMER LENDING PHASE 1
     A*
     A********************************************************************
     A                                      JDFTVAL
     A          R FCLTYF                    JFILE(FCLTYFM FCLTYFN)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*
     A          J                           JOIN(1 2)
     A                                      JFLD(CNUM CNUMB)
     A                                      JFLD(FACT FACTB)
     A                                      JFLD(FCNO FCNOB)
     A** FCLTYFM ('A' RECORD) FIELDS
     A            RECI                      JREF(1)
     A            CNUM                      JREF(1)
     A            FACT                      JREF(1)
     A            FCNO                      JREF(1)
     A            RCTP                      JREF(1)
     A            BRCA
     A            FCTI
     A            FCCY
     A            FAMT
     A            OVPC
     A            DTAP
     A            DTEX
     A            RVCR
     A            SECI
     A            MCCY
     A            MCSI
     A            NACD
     A            CRSK
     A            DLFS
     A            NOMR
     A            RVDT
     A            RVFR
     A            RVDY
     A            NAR1
     A            NAR2
     A            NAR3
     A            NAR4
     A            MTDH
     A            MTDL
     A            MTDA
     A            QTDA
     A            YTDA
     A            ACOF
     A            ORBR
     A*       S01270 CHANGES POST MFRFL AMENDMENTS              S01270
     A*********   ZZ006
     A            ZZ001
     A            RVCD
     A************ZZ003A
     A            ZZ002A
     A*       S01270 CHANGES POST MFRFL AMENDMENTS              S01270
     A            ORED                      JREF(1)
     A            LCD                       JREF(1)
     A            CHTP                      JREF(1)
     A            TNLU                      JREF(1)
      *                                              Begin /189544/
     A            CMDI
     A            CAXR
      *                                              End   /189544/
      * Start /CLE029/
     A            SVCD
      * End   /CLE029/
     A***
     A***    FCLTYFN ('B' RECORD) FIELDS
     A            RECIB                     RENAME(RECI) JREF(2)
     A            CNUMB                     RENAME(CNUM) JREF(2)
     A            FACTB                     RENAME(FACT) JREF(2)
     A            FCNOB                     RENAME(FCNO) JREF(2)
     A            RCTPB                     RENAME(RCTP) JREF(2)
     A            CMFT
     A            CALC
     A            SPRD
     A            BCOD
     A            BRAT
     A            STDT
     A            EDDT
     A            DUDT
     A            BLFR
     A            BLDN
     A            BTIN
     A            BLDY
     A            SETT
     A            OBAC
     A            TNAC
     A            SLCD
     A            ACCD
     A            ADNP
     A            PDTD
     A            AFPD
     A            ADJP
     A            ADJN
     A            TOTD
     A            CAMD
     A            LSWSC
     A            PRFC
     A************ZZ001                       S01117
     A            MBFC
     A            BITS
     A            PEXP
     A            ZZ003
     A            CFBR
     A            ZZ002
     A            RUN0
     A            RUN1
     A            RUN2
     A            RUN3
     A            RUN4
     A            RUN5
     A            RUN6
     A            RUN7
     A            RUN8
     A            RUN9
     A            OAM1
     A            OAM2
     A            OAM3
     A            OAM4
     A            OAM5
     A            OAM6
     A            OAM7
     A            OAM8
     A            OAM9
     A            OA10
     A            OREDB                     RENAME(ORED) JREF(2)
     A            LCDB                      RENAME(LCD) JREF(2)
     A            CHTPB                     RENAME(CHTP) JREF(2)
     A            TNLUB                     RENAME(TNLU) JREF(2)
      *                                              Begin /CLE004/
     A            SYIN
     A            ANUM
     A            DTPS
     A            DICB
     A            RTPS
     A            RLPD
     A            CSEL
     A            ALCY
     A            COMD
     A            CDTE
     A            AVLD
     A            LPTP
     A            LPBR
     A            LPAM
     A            DFTP
     A            DFST
     A            TRCA
     A            CANM
     A            CAFT
     A            CAFN
     A            ACSQ
     A            PRTR
     A            PMFC
     A            PMFT
     A            PMFN
     A            INUM
     A            JDTE
     A            SHTP
     A            SHPC
     A            RCSI
     A            SKIR
     A            SKIS
     A            SKFR
     A            SKFS
     A            VDTC
     A            OSDB
     A            OMDB
      *                                              End   /CLE004/
      *                                              Begin /149036/
     A            RSTM      R
     A            RONS      R
     A            RIBN      R
     A            RIBA      R
     A            ROBN      R
     A            ROCN      R
     A            PSTM      R
     A            PONS      R
     A            PIBN      R
     A            PIBA      R
     A            POBN      R
     A            POCN      R
     A            RCRN      R
     A            RCRA      R
     A            RVNO      R
     A            AWBN      R
     A            AWBA      R
     A            BENN      R
     A            BENA      R
     A            DTP1      R
     A            DTP2      R
     A            DTP3      R
     A            DTP4      R
     A            DCHG      R
     A            BTB1      R
     A            BTB2      R
     A            BTB3      R
     A            BTB4      R
     A            BTB5      R
     A            BTB6      R
     A            CVMR      R
      *                                              End   /149036/
      *                                              Begin /CLE008/
     A            LAID
      *                                              End   /CLE008/
      *                                              Begin /147261/
     A            PASI
      *                                              End   /147261/
      *                                              Start /147935/
     A            IUSR
     A            AUSR
     A            XUSR
      *                                              End   /147935/
     A**Start of change CLE023
     A            CEXP
     A**End of change CLE023
      **Start of change CLE028
     A            DTPX
      **End of change CLE028
      **Start of change CLE031
     A            COAG
     A            FCAG
     A            PHAG
     A            SCAG
     A            REXR
     A            REXI
     A            PSCY
     A            PEXR
     A            PEXI
      **End of change CLE031
      * Start of Change CLE034
     A            OVAM
      * End of Change CLE034
     A*                                              Begin /CLE042/
     A            DFCL
     A*                                              End   /CLE042/
      **Start of change CER020
     A            PEXD
      *
     A            PNXD
      **End of change CER020
      **Start of change AR750770
     A            RTS15
      **End of change AR750770
     A***
     A***
     A          K BRCA
     A          K CNUM
     A          K FACT
     A          K FCNO
