      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas LE Accruals Extract by Loan Number File')        *
      *****************************************************************
      *                                                               *
      *  Midas¦ABS - European Reporting Module                        *
      *                                                               *
      *  LF/LEACXAL3 - LE Accruals Extract by Loan Number             *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2005            *
      *                                                               *
      *  Last Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CLE042             Date 06Sep05               *
      *                 CER001             Date 25Apr05               *
      *                 ULX004             Date 05Mar97               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CLE148 - Alpha Loan Reference (Recompile)                    *
      *  CLE042 - Extended Loan Sub Type (Recompile)                  *
      *  CER001 - LUX Upgrade to MidasPlus (Recompile only)           *
      *  ULX004 - Capital Adequacy                                    *
      *                                                               *
      *****************************************************************
     A          R LEACXACF                  PFILE(*LIBL/LEACXAC)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2005')
      *
     A          K LNRF
     A          O RECI                      COMP(EQ '*')
      *
