      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas LE Actions Today (MR)')                          *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  LF/LEACT3L2 - Actions Today File (MR Record only)            *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2011            *
      *                                                               *
      *  Last Amend No. CLE148             Date 23Jul12               *
      *  Prev Amend No. AR317587 *CREATE   Date 19Aug11               *
      *                 ARnnnnnn           Date ddmmmyy               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CLE148 - Alpha Loan Reference (Recompile)                    *
      *  AR317587 - Matured Loan can't be recovered using maturity    *
      *             date as the value date of the manual repayment.   *
      *             Amended program to allow value date of MR greater *
      *             than Maturity date for past due loans.            *
      *             (Child: AR810533)                                 *
      *                                                               *
      *****************************************************************
     A          R LOAMSDKF                  PFILE(ACTN3DK)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. 2011')
     A            RECI
     A            LNRF
     A            VDAT
     A            AMTP
     A            PRAM
     A            INTA
     A            TAMT
     A            XAVD
      *
     A          K LNRF
     A          K VDAT
      *
     A          O RECI                      COMP(NE 'D')
     A          S AMTP                      VALUES('MR')
      *
