      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas LE Before image of set. allocations by rec %')   *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  LF/LEBSTLL3 - LE Settlement Allocation by Receive Percentage *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      *  Last Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      *                 CLE038             Date 11May04               *
      *                 CGL029             Date 01Sep03               *
      *                 219608  *CREATE    Date 14Jul03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CLE148 - Alpha Loan Reference (Recompile)                    *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CLE038 - Lending Enhancement for Nordea: Allocation by Amount*
      *           (Recompiled over changes to LEBSTLPD).              *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  219608 - Amendment of Settlement Allocations needs a 'Before'*
      *           image to ensure the right allocations are reversed. *
      *                                                               *
      *****************************************************************
     A          R LESTALD0                  PFILE(LEBSTLPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
      *
     A          K TYPE
     A          K LNRF
     A          K VDAT
     A          K LASQ
     A          K CNUM
     A          K FACL
     A          K FESQ
     A          K RCPC
      *
     A          O RECI                      COMP(EQ 'M')
     A          O RECI                      COMP(EQ 'R')
