      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('LE Facility and Commitment by Customer Report Name')   *
      *****************************************************************
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *   LF/LEFAXL0  - LE Facility and Commitment by Customer Report *
      *                 Name                                          *
      *                                                               *
      *  (c) Finastra International Limited 2021                      *
      *                                                               *
      *  Last Amend No. CLE124  *Create    Date 02Nov21               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CLE124 - Commitment and Outstanding Report by Customer Name  *
      *                                                               *
      *****************************************************************
      *
     A          R FACEXHHF                  PFILE(FACEXHH)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited 2021')
     A          K RECI
     A          K *NONE
      *
     A          R FACEXFCF                  PFILE(FACEXFC)
     A          K *NONE
     A          K FCLB
     A          K CNAM
     A          K CFNO
     A          K *NONE
      *
     A          R FACEXFAF                  PFILE(FACEXFA)
     A          K *NONE
     A          K FCLB
     A          K CRNM
     A          K CFNO
     A          K PCRF
     A          K LPFI
     A          K ORGL
     A          K *NONE
     A          K PTYP
     A          K *NONE
      *
     A          R FACEXLCF                  PFILE(FACEXLC)
     A          K *NONE
     A          K FCLB
     A          K CRNM
     A          K CFNO
     A          K PCRF
     A          K LPFI
     A          K *NONE
     A          K LCREF
     A          K PTYP
     A          K *NONE
      *
     A          R FACEXT4F                  PFILE(FACEXT4)
     A          K RECI
     A          K *NONE
