/*STD *  LFBASE                                                       *
/*EXS *  LF_DL                                                        *
/*EXI *  TEXT('Midas LE Lending fees by account officer by brch')     *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Customer Lending Module
     A*                                                               *
     A***LF/LEFEEAO*-*Lending*Fees*by*Account*Officer******************     0074
     A*  LF/LEFEEAO - Lending Fees by Account Officer within Branch   *     0074
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CLE134             Date 01Aug12               *
      *                 CLE148             Date 23Jul12               *
      *                 CLE139             Date 06Dec10               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *                 CAS016             Date 28Feb06               *
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027             Date 05Dec05               *
      *                 CLE042             Date 06Sep05               *
      *                 CLE106             Date 01Aug04               *
      *                 233601             Date 20May05               *
      *                 CAS009             Date 04May04               *
      *                 CAP086             Date 08Jun05               *
      *                 CGL029             Date 01Sep03               *
      *                 CLE034             Date 05May03               *
      *                 CAP078             Date 19Aug03               *
      *                 CLE031             Date 03Feb03               *
      * Midas Release 4.01.02 ----------------------------------------*
      *                 204452             Date 02May02               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CLE009             Date 26Apr99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 141453             Date 16Feb99               *
     A*                 CEU004             Date 02Feb98               *
     A*                 CLE005             Date 22May97               *
     A*                 127966             Date 13Oct97               *
     A*                 CLE004             Date 02Dec96               *
     A*                  00515             Date 22May96               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CLE134 - Past Due Call Loan Processing (Recompile)           *
      *  CLE148 - Alpha Loan Reference (Recompile)                    *
      *  CLE139 - Lending Fee Capitalisation (Recompile)              *
      *  CAS016 - IAS18 EIR Recalculation (Fee Amortisation Over      *
      *           Whole Period) - Recompile                           *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CLE042 - Extended Loan Sub Type (Recompile)                  *
      *  CLE106 - Syndications Manager. (Recompiled)                  *
      *  233601 - Post Fee amount to be amortised non-linearly        *
      *           (Recompile)
      *  CAS009 - Effective Interest Rate/Amortised Cost Accounting   *
      *           (Recompile)                                         *
      *  CAP086 - Introduce Auto Authorisation to the API's           *
      *           without it. (Recompile)                             *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CLE034 - Lending Enhancements for Phase 1 Priority 1A        *
      *           (recompile).                                        *
      *  CAP078 - Conversion of LE inputs into modular structure to   *
      *           use as APIs. Recompile due to changes in PF/LEFEED  *
      *  CLE031 - Lending Enhancements (recompile).                   *
      *  204452 - Recompiled due to changed PF/LEFEED.                *
      *  CLE009 - LE I/C Swift Message Generation for Fees            *
      *           Recompiled due to changes in LEFEED                 *
      *  141453 - Recompiled due to changes in PF/LEFEED              *
     A*  CEU004 - LE Settlement Ccy Conversion Upgrade to DBA R2.0    *
     A*           Recompiled due to changes in LEFEED.                *
     A*  CLE005 - Customer Lending Enhancements - Tranche 3           *
     A*           Recompiled due to changes in file LEFEED.           *
     A*  127966 - Profit Centre Accounting Development:               *
     A*           Recompiled due to changes in LEFEED                 *
     A*  CLE004 - Customer Lending Enhancements - Syndications        *
     A*           Recompiled due to changes in file LEFEED.           *
     A*  100515 - Recompiled due to changes in LEFEED.                *
     A*                                                               *
     A*****************************************************************
      *
     A          R LEFEEDF                   PFILE(LEFEED)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*
     A***  START 0074
     A          K FEBRCA
     A***  END   0074
     A*
     A          K FEACOF
     A          K FECNUM
     A          S FERECI                    COMP(EQ 'D')
      *
