/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas LE Fee Details keyed on Loan Number')            *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  LF/LEFEEDLV - Midas LE Fee Details keyed on Loan Number      *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2012            *
      *                                                               *
      *  Last Amend No. AR1022006 *CREATE  Date 01Aug12               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  AR1022006 - COB Performance Optimisation                     *
      *                                                               *
      *****************************************************************
      *
     A          R LEFEEDF                   PFILE(LEFEED)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2012')
      *
     A          K FEBRCA
     A          K FECNUM
     A          K FEFACL
     A          K FELOAN
     A          K FEFSEQ
      *
     A          S FECALT                    COMP(EQ '90')
