      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas LE Fee Rate Chg Amendment Detail + History')     *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  LF/LEFERCL3 - Midas Fee Rate Change Amend Details + History  *
      *                                                               *
      *  (c) Finastra International Limited 2018                      *
      *                                                               *
      *  Last Amend No. CLE071  *CREATE    Date 18Jul18               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CLE071 - Value Dating of Rate Changes to Fees                *
      *                                                               *
      *****************************************************************
     A          R LEFERCD0                  PFILE(LEFERCPD)
     A                                      TEXT('(c) Finastra Interna +
     A                                      tional Limited 2018')
     A          K FCCNUM
     A          K FCFACL
     A          K FCLOAN
     A          K FCFSEQ
     A          K FCRCVD
      *
     A          S FCRECI                    COMP(EQ 'D')
      *
     A          R LEFHSTF                   PFILE(LEFHST)
     A                                      TEXT('(c) Finastra Interna +
     A                                      tional Limited 2018')
     A          K HICNUM
     A          K HIFACL
     A          K HILNRF
     A          K HIFSEQ
     A          K HIRCVD
      *
     A          S HIRECI                    COMP(EQ 'D')
     A            HIRCTP                    VALUES('IN' 'RC')
