      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas LE Fee Rate Change Amendment Extension File')    *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  LF/LEFERQL1 - Fee Rate Change Amendment Extension File       *
      *                                                               *
      *  (c) Finastra International Limited 2018                      *
      *                                                               *
      *  Last Amend No. CLE071  *CREATE    Date 18Jul18               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CLE071 - Value Dating of Rate Changes to Fees                *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A          R LEFERQD0                  PFILE(LEFERCQD)
     A                                      TEXT('(c) Finastra Interna +
     A                                      tional Limited 2018')
      *
     A          K FCBRCA
     A          K FCCNUM
     A          K FCFACL
     A          K FCLOAN
     A          K FCFSEQ
     A          K FCRCVD
      *
