      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas LE LEFEEDQD Extension File')                     *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  LF/LEFEEQL3 - Fee Extension File                             *
      *                                                               *
      *  (c) Finastra International Limited 2020                      *
      *                                                               *
      *  Last Amend No. MD057165 *CREATE   Date 18Nov20               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD057165 - SP23 Correspondence manager cob failure after     *
      *             input of new fee                                  *
      *                                                               *
      *****************************************************************
     A          R LEFEEQD0                  PFILE(LEFEEDQD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2020')
     A          K FQLOAN
     A          K FQFSEQ
