      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas LE Fees history file - active')                  *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  LF/LEFHSTL7 - Fees History File - Active                     *
      *                                                               *
      *  (c) Misys Banking Systems 2007                               *
      *                                                               *
      *  Last Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Prev Amend No. CSW208             Date 15Apr08               *
      *                 250628  *CREATE    Date 04Oct07               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CLE148 - Alpha Loan Reference (Recompile)                    *
      *  CSW208 - SWIFT 2008 Changes (Recompile)                      *
      *  250628  - Existing history records on previous fee payments  *
      *           when there is newly entered fee and it just reused  *
      *           a fee sequence number.                              *
      *                                                               *
      *****************************************************************
     A          R LEFHSTF                   PFILE(LEFHST)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2007')
      *
     A          K HICNUM
     A          K HIFACL
     A          K HIFSEQ
     A          K HIHDAT
      *
