      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas Lending Fees History by Branch')                 *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  LF/LEFHSTL8 - Fees History by Branch Layout                  *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2012            *
      *                                                               *
      *  Last Amend No. AR632102B *CREATE  Date 21Dec12               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  AR632102B - LF against historic fees file. (Child: AR632103) *
      *                                                               *
      ******************************************************************
     A          R LEFHSTF                   PFILE(LEFHST)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2012')
      *
     A          K HIBRCA
     A          K HICNUM
     A          K HIFACL
     A          K HILNRF
     A          K HIFSEQ
      *
