      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas LE Invalid Loan Income Splits')                  *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  LF/LEITISL0 - Midas LE Invalid Loan Income Splits            *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      *  Last Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027A            Date 05May06               *
      *                 CLE035   *CREATE   Date 22Sep03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CLE148 - Alpha Loan Reference                                *
      *  CSD027A - Conversion Of Customer Number to Alpha             *
      *  CLE035 - Lending Enhancements for Nordea Phase 1 Priority 2: *
      *           Income Splits                                       *
      *                                                               *
      *****************************************************************
     A          R LEITISD0                  PFILE(LEITISPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
     A          K SNLON
     A          K SISCN
      *
      **Start of change CLE148
     A**********S SNLON                     COMP(NE 0)                                        CLE148
     A          S SNLON                     COMP(NE ' ')
      **End of change CLE148
      * Start /CSD027A/
     A**********  SNCUS                     COMP(EQ 0)                                       CSD027A
     A            SNCUS                     COMP(EQ '      ')
      * End /CSD027A/
