      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas LE Loans LIBOR Deregulation Extract File')       *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  LELIBEL0 - Loans LIBOR Deregulation Extract File by Loan     *
      *                                                               *
      *  (c) Finastra International Limited 2021                      *
      *                                                               *
      *  Last Amend No. MD058182           Date 25May21               *
      *  Prev Amend No. CLE172  *CREATE    Date 01Oct20               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD058182 - Missing BR event on LOAC despite calculator       *
      *             returned complete rates. Use LDNIDT instead of    *
      *             LDINPD as one of the file key fields.             *
      *  CLE172 - LIBOR Deregulation - Lending                        *
      *                                                               *
      *****************************************************************
     A          R LELIBED0                  PFILE(LELIBEPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2021')

     A          K LDLNRF
     A          K LDVDAT
      **Start of change MD058182
     A**********K LDINPD                                                                    MD058182
     A          K LDINDT
      **End of change MD058182
