      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas LE Customer loans matured B records')            *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Customer Lending Module                              *
     A*                                                               *
     A*  LF/LETEMPL0 -  Customer Loans 'B' Records                    *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027             Date 05Dec05               *
      *                 CGL029             Date 01Sep03               *
      *                 CLE034             Date 05May03               *
      *                 CLE031             Date 03Feb03               *
      * Midas Release 4.01 -------------------------------------------*
      *                 CAS001             Date 23Nov01               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 144915             Date 28Oct98               *
      *                 CEU020             Date 13Mar98               *
      *                 CEU004             Date 02Feb98               *
     A*                 CLE004             Date 02Jan98               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CLE148 - Alpha Loan Reference (Recompile)                    *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CLE034 - Lending Enhancements for Phase 1 Priority 1A        *
      *           (recompile).                                        *
      *  CLE031 - Lending Enhancements.                               *
      *           (Recompile)                                         *
      *  CAS001 - Net Present Value (NPV) Accounting.  Recompile.     *
      *  144915 - Recompiled due to changes in file LETEMPPD.         *
     A*  CEU020 - EMU Lending Multi-Ccy Rollover (Recompile)          *
      *  CEU004 - LE Settlement Ccy Conversion:                       *
      *           - Recompiled over changed LETEMPPD.                 *
     A*  CLE004 - Customer Lending Enhancements - Syndications        *
     A*                                                               *
     A*****************************************************************
     A          R CLOANCKF                  PFILE(LETEMPPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A            RECI
     A            LNRF
     A            OPAM
     A            ABLC
      *
     A          K LNRF
      *
