      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas LE Customer bills/telexes CUTX1HP & CUTX1HQ')    *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  LF/SCUTXL2 - Customer Bills/Telexes - Sort by value date     *
      *                                                               *
      *  (c) Finastra International Limited 2004                      *
      *                                                               *
      *  Last Amend No. CSD103             Date 10Aug20               *
      *  Prev Amend No. MD046248           Date 27Oct17               *
      *                 CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 235743 *C *CREATE  Date 26Aug05               *
      *                 Xnnnnn             Date ddmmmyy               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD103 - LIBOR Deregulation - Common Layer/Standing Data.    *
      *           (Recompile)                                         *
      *  MD046248 - Finastra Rebranding                               *
      *  CLE148 - Alpha Loan Reference (Recompile)                    *
      *  235743 - The same as SCUTXL1 but with additional key fields. *
      *           Applied fix 225103.                                 *
      *                                                               *
      *****************************************************************
     A          R CUTX1HPF                  PFILE(CUTX1HP)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2004')
     A          K BRCA
     A          K BTIN
     A          K CNUM
     A          K FTYP
     A          K FSEQ
     A          K LNRF
     A          K VDAT
     A          K PRSQ
     A          K LASN
      *
     A          R CUTX1HQF                  PFILE(CUTX1HQ)
     A          K BRCA
     A          K BTIN
     A          K CNUM
     A          K FTYP
     A          K FSEQ
     A          K LNRF
     A          K VDAT
     A          K PRSQ
     A          K LASN
      *
