      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas LE COF accruals extract - branch')               *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  LF/SLACF - Accruals Extract File - Branch                    *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *  Last Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CLE042             Date 06Sep05               *
      *                 138289  *CREATE    Date 20Jun98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CLE148 - Alpha Loan Reference (Recompile)                    *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CLE042 - Extended Loan Sub Type                              *
      *  138289 - COF Accruals reports do not reconcile usefully.     *
      *                                                               *
      ****************************************************************
      *
     A          R LEACFHHF                  PFILE(LEACFHH)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K RECI
     A          K *NONE
      *
     A          R LEACFACF                  PFILE(LEACFAC)
     A          K *NONE
     A          K BRCA
     A          K CCY
     A          K LTYP
     A          K SUTP
     A*                                              Begin /CLE042/
     A          K CLAS
     A*                                              End   /CLE042/
     A          K CNUM
     A          K LNRF
     A          K PSLN
     A          K *NONE
      *
     A          R LEACFZZF                  PFILE(LEACFZZ)
     A          K RECI
     A          K *NONE
