      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas @24 KWG account record by create date')          *
      *****************************************************************
      *                                                               *
      *  Midas - European Reporting Module                            *
      *                                                               *
      *  LF/ERACEXL3 - Midas @24 KWG account record                   *
      *                                                               *
      *  (c) Finastra International Limited 2008                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CER068             Date 25Feb14               *
      *                 CER059             Date 19Jul10               *
      *                 BUG22633 *CREATE   Date 09Mar09               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CER068 - Upgrade CER047 to be compatible with BaFin 3.2.2    *
      *             (Recompile)                                       *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  BUG22633 - Extraction process fail to extract data           *
      *                                                               *
      *****************************************************************
      *
     A          R ERACEXD0                  PFILE(ERACEXPD)
     A                                      TEXT('(c) Finastra +
     A                                      International Banking +
     A                                      Limited 2008')
      *
     A          K F12ACC
     A          K F12REF
     A          K F12CDT
