      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas ER Book code / Investment type - Logical')
      *****************************************************************
      *                                                               *
      *  MIDAS/ABS EUROPEAN REPORTING                                 *
      *                                                               *
      *  LF/ERBKIVL0 - BOOK CODE / INVESTMENT TYPE - LOGICAL FILE     *
      *                                                               *
      *  (c) Finastra International Limited 2005                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CER001             Date 25Apr05               *
      *                 ERL370 TL          Date 02Sep93               *
      *                                                               *
      *****************************************************************
      *  MD046248 - Finastra Rebranding                               *
      *  CER001 - LUX Upgrade to MidasPlus (Recompile only)           *
      *  ERL370 - BOOK CODE / INVESTMENT TYPE DEVELOPMENT             *
      *****************************************************************
     A*
     A                                      UNIQUE
     A          R ERBKIVD0                  PFILE(ERBKIVPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2005')
     A            BIBOKC
     A            BIINVT
     A            BITIFA
     A            BIEVAM
     A            BILCD
     A            BITYLC
      *----------------------------------------------------------------
     A* Key fields
     A          K BIBOKC
     A          K BIINVT
