      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas ER Book code / Investment type - Logical')
/*S*D *  LFIMMED*******************************************************
      *****************************************************************
      *                                                               *
      *  Midas¦ABS  European reporting                                *
      *                                                               *
      *  LF/ERCHBKL0 - BOOK CODE / INVESTMENT TYPE - LOGICAL FILE     *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2005            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CER001             Date 25Apr05               *
      *  Prev Amend No. ULX004             Date 25Feb97               *
      *                 ERB457 PT          Date 26Apr95               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CER001 - LUX Upgrade to MidasPlus (Recompile only)           *
      *  ULX004 - CAPITAL ADEQUACY                                    *
      *           Copyright & Header Box Standardisation.             *
      *  ERB457 - BOOK CODE / INVESTMENT TYPE DEVELOPMENT             *
      *                                                               *
      *****************************************************************
     A*
     A                                      UNIQUE
     A          R ERCHBKD0                  PFILE(ERCHBKPD)
      *>>> ULX004 BEGIN >>>>>>>>>>>>>>>>>>>>
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2005')
      *<<< ULX004 END <<<<<<<<<<<<<<<<<<<<<<
     A            BIBOKC
     A            BIINVT
     A            BIAMTT
     A            BILCD
     A            BITYLC
      *----------------------------------------------------------------
     A* Key fields
     A          K BIBOKC
     A          K BIINVT
