     A*****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('MIDAS ABS ER Extract-Logical including cust. pos.')
      *****************************************************************
     A*                                                               *
     A*     MIDAS ABS - European Reporting                            *
     A*                                                               *
     A*  LF/EREXTRL4 - Production Extract - Logical read access for   *
     A*                main interface processing component to FRS     *
     A*                                                               *
      *  (c) Finastra International Limited 2005                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      *  Prev Amend No. 225555             Date 30Oct06               *
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027A            Date 04May06               *
      *                 CER001             Date 25Apr05               *
      *                 ULX046             Date 18Oct02               *
      *                 CEU007             Date 15Oct98               *
     A*                    CAD007        Date 22Jul98                 *
     A*                    ULX004        Date 25MAR97                 *
     A*                    ERL438 PT     Date 03SEP94                 *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  225555 - Add discount/premium amount, amount to amortize     *
      *           and 'Prix d'acquisition'. (Recompile only)          *
      *  CSD027A - Conversion Of Customer Number to Alpha (recompile) *
      *  CER001 - LUX Upgrade to MidasPlus (Recompile only)           *
     A*     ULX046 - Circulars 2002/170-174-175 Integration           *
     A*              Recompiled due to changes on PF/EREXTRPD         *
     A*     CEU007 - Holidays Changes for Reporting Interface.        *
     A*              (recompiled)                                     *
     A*     CAD007 - Midas CAD adaptation to Data Dictionary 1.6      *
     A*              (recompiled)                                     *
     A*     ULX004 - Capital Adequacy (recompile)                     *
     A*     ERL438 - To exclude customer positions (new file -        *
     A*                                                               *
     A*****************************************************************
     A*
     A          R EREXTRF0                  PFILE(EREXTRPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2005')
     A          K EXBRCD
     A          K EXLOTD
     A          K EXDECK
     A          K EXDRCR
     A          K EXCCYC
     A          K EXCUST
     A*** ERL438 START ***
     A*
     A          S EXLOTD                    COMP(EQ 'CPO')
     A*
     A*** ERL438 END ***
