     A*****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('MIDAS ABS ER Reduced extract - Facility records')
      *****************************************************************
     A*                                                               *
     A*     MIDAS ABS - European Reporting                            *
     A*                                                               *
     A*  LF/EREXTRL1 - Production Extract - Facility Records          *
     A*                                                               *
      *  (c) Finastra International Limited 2005                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      *  Prev Amend No. 225555             Date 30Oct06               *
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027A            Date 04May06               *
      *                 CER001             Date 25Apr05               *
      *                 ULX046             Date 18Oct02               *
      *                 CEU007             Date 15Oct98               *
     A*                    CAD007        Date 22Jul98                 *
     A*                    ULX004        Date 25MAR97                 *
     A*                    ERL428 PT     Date 27AUG94                 *
     A*                    ERL417 PT     DATE 27AUG94                 *
     A*                    ER0336 TLI    DATE 05APR93                 *
     A*                    ER0322 TLI    DATE 16FEB93                 *
     A*                    ER0321 TLI    DATE 15FEB93                 *
     A*                    ER0205 AF     DATE 14JAN93                 *
     A*                    ER0101 ADS    DATE 24NOV92                 *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  225555 - Add discount/premium amount, amount to amortize     *
      *           and 'Prix d'acquisition'. (Recompile only)          *
      *  CSD027A - Conversion Of Customer Number to Alpha (recompile) *
      *  CER001 - LUX Upgrade to MidasPlus (Recompile only)           *
     A*     ULX046 - Circulars 2002/170-174-175 Integration           *
     A*              Recompiled due to changes on PF/EREXTRPD         *
     A*     CEU007 - Holidays Changes for Reporting Interface.        *
     A*              (recompiled)                                     *
     A*     CAD007 - Midas CAD adaptation to Data Dictionary 1.6      *
     A*              (recompiled)                                     *
     A*     ULX004 - Capital Adequacy (recompile)                     *
     A*     ERL428 - Add customer classification (just recompiled)    *
     A*     ERL416 - Add loan processing type (just recompiled)       *
     A*     ER0336 - Add 'Credit Type' (just recompiled)              *
     A*     ER0322 - Add 'Deal Type code' (just recompiled)           *
     A*     ER0321 - Add 'Country of Citizenship' (just recompiled)   *
     A*     ER0205 - New fields 'Bank non Bank indicator' + 'Second   *
     A*              Currency' in PF (just recompiled)                *
     A*     ER0101 - Decision Key lenght from 6 to 8 (RECOMPILATION)  *
     A*                                                               *
     A*****************************************************************
      *
     A          R EREXTRF1                  PFILE(EREXTRPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2005')
     A            EXLOTD
     A            EXSTRD
     A            EXENDD
     A            EXREVD
     A            EXFCUS
     A            EXFACT
     A            EXFCNO
      *
     A          K EXFCUS
     A          K EXFACT
     A          K EXFCNO
      *
     A          S EXLOTD                    COMP(EQ 'FCL')
