      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas Amounts Due Weighting Rates Decision Table')
      *****************************************************************
      *                                                               *
      *  Midas - European Reporting Module                            *
      *                                                               *
      *  LF/EREXRAV1 - Amounts Due Weighting Rates Decision Table     *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2005            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CER001             Date 25Apr05               *
      *  Prev Amend No. ULX012  *CREATE    Date 16Jul98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CER001 - LUX Upgrade to MidasPlus (Recompile only)           *
      *  ULX012 - Guarantees and Collateral Management enhancements   *
      *                                                               *
      *****************************************************************
     A          R EREXRAD0                  PFILE(EREXRAPP)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems LTd. +
     A                                      2005')
     A*----------------------------------------------------------------
     A* Key fields
     A          K XRECSC
     A          K XRZABI
     A          K XRCLAT
     A          K XRPECO
     A          K XRWEIG
     ************* End of data ****************************************
