      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas European Reporting I.C.D. - upd idx')
     A****************************************************************
     A*                                                              *
     A*                                                              *
     A*   MIDAS/ABS - EUROPEAN REPORTING                             *
     A*                                                              *
     A*   ERICDRL0  -  European Reporting I.C.D. - update index       *
     A*                                                              *
      *  (c) Misys International Banking Systems Ltd. 2005            *
     A*                                                              *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CER001             Date 25Apr05               *
      *  Prev Amend No.                    Date 00XXX00               *
     A*                                                              *
     A*--------------------------------------------------------------*
     A*                                                              *
      *  CER001 - LUX Upgrade to MidasPlus (Recompile only)           *
      *                                                               *
     A****************************************************************
     A*                                                               *
     A                                      UNIQUE
     A          R ERICDRD0                  PFILE(ERICDRPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2005')
     A*
     A*=========================================================================
     A          K VDICCD
