      *****************************************************************
      *  The following creation parameters should be used when a PF   *
      *  with MAINT(*REBLD) is required:                              *
/*STD *  LFBASE                                                       *
/*EXS *  LF_RB                                                        *
/*EXI *  TEXT('MIDAS ER Loan details')                                *
      *****************************************************************
      *                                                               *
      *  Midas - European Reporting                                   *
      *                                                               *
      *  LF/ERLOANL0 - MIDAS ER Loan details                          *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2002            *
      *                                                               *
      *  Last Amend No. CLE134             Date 01Aug12               *
      *  Prev Amend No. CLE148             Date 23Jul12               *
      *                 CRE073             Date 06Dec10               *
      *                 CLE143             Date 06Dec10               *
      *                 CER059             Date 19Jul10               *
      *                 CER020             Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CLE042             Date 06Sep05               *
      *                 CER001             Date 25Apr05               *
      *                 UPG402             Date 02Oct04               *
      *                 ULX046  *CREATE    Date 23Oct02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CLE134 - Past Due Call Loan Processing (Recompile)           *
      *  CLE148 - Alpha Loan Reference (Recompile)                    *
      *  CRE073 - Interest Rate Rounding (Recompile)                  *
      *  CLE143 - Original Loan Contract Date & Effective Interest    *
      *           Rate (Recompile)                                    *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER020 - Enhanced Rollover Window: Upgrade FGE089 to         *
      *           Midas Plus (Recompile)                              *
      *  CLE042 - Extended Loan Sub Type (Recompile)                  *
      *  CER001 - LUX Upgrade to MidasPlus (Recompile only)           *
      *  UPG402 - Recompile due to change in CLOANCL and MCLONCL for  *
      *           R4.02 upgrade.                                      *
      *   ULX046 - Circulars 2002/170-174-175 Integration             *
      *            Recompiled due to changes on PF/ERLUTRPD           *
      *                                                               *
      *****************************************************************
      *
     A          R ERLOANF0                  PFILE(CLOANCL)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. 2002')
      *
     A            RECI
     A            LNRF
     A            RCDT
     A            MRIN
     A            PTYP
     A            CNUM
     A            BRCA
     A            LTYP
     A            SUTP
     A            DDAT
     A            VDAT
     A            MDAT
     A            LASQ
     A            FCUS
     A            FTYP
     A            FSEQ
     A            CCY
     A            CPAM
     A            INTC
     A            INTR
     A            BRTT
     A            BRTE
     A            RTSP
     A            MARG
     A            SPIN
     A            CHIN
     A            WTRT
     A            WTIN
     A            REPT
     A            RAMT
     A            NRPD
     A            RFRQ
     A            RDYN
     A            FCCY
     A            LIND
     A            CRSK
     A            ACOF
     A            NACD
     A            RELI
     A            AUTO
     A            PSAM
     A            BCXR
     A            FCXR
     A            SDST
     A            OSDA
     A            TSTN
     A            MDST
     A            OMDA
     A            TMAN
     A            FACO
     A            RLDT
     A            NROD
     A            RLFQ
     A            RLDY
     A            NBRA
     A            NRTS
     A            NSIN
     A            NCAS
     A            AWTP
     A            WTRD
     A            WTWD
     A            IWOD
     A            PWOD
     A            BMDI
     A            FMDI
     A            PDIN
     A            LSWC
     A            LSWS
     A            OSDB
     A            OMDB
     A            ORBR
     A            PRFC
     A            FCLB
     A            MLNR
     A            BTIN
     A            BLDY
     A            OLNO
     A            RCSI
     A            ICBS
     A            IPFR
     A            TOTI
     A            NIDT
     A            IBDT
     A            SLID
     A            AIPD
     A            DLRC
     A            IACD
     A            AITC
     A            TFEP
     A            AIAP
     A            IPRD
     A            IPRM
     A            ICTD
     A            AIMN
     A            RBDT
     A            NOPS
     A            NCHI
     A            ZZ001A
     A            IFDY
     A            LONI
     A            CNFI
     A            ACEI
     A            TLXI
     A            CBLI
     A            ORED
     A            LCD
     A            CHTP
     A            TNLU
     A            BOKC
     A            COCU
     A            RECE
     A            OMDT
     A            NIPD
     A            NMDT
     A            APMI
     A            RSTM
     A            RONS
     A            RIBN
     A            RIBA
     A            ROBN
     A            ROCN
     A            PSTM
     A            PONS
     A            PIBN
     A            PIBA
     A            POBN
     A            POCN
     A            RCRN
     A            RCRA
     A            RVNO
     A            AWBN
     A            AWBA
     A            BENN
     A            BENA
     A            DTP1
     A            DTP2
     A            DTP3
     A            DTP4
     A            DCHG
     A            BTB1
     A            BTB2
     A            BTB3
     A            BTB4
     A            BTB5
     A            BTB6
     A            CVMR
     A            PTFR
     A            HLEX
     A            FSRP
     A            FSGN
     A            FPRC
     A            TCOF
     A            ACPD
     A            ACDA
     A            ACAJ
     A            ACAP
     A            COFD
     A            COFM
     A            CFCD
     A            NFRS
     A            NFSN
     A            NFPC
     A            PDCF
     A            FCTD
     A            FWOD
     A            DFTP
     A            DFST
     A            MCRA
     A            FCRA
     A            PDDI
     A            PTDI
     A            GDPR
     A            GDIN
     A            LNKS
     A            MNSG
     A            GASS
     A            GPRT
     A            TOLN
     A            LSTS
     A            IUSR
     A            AUSR
     A            XUSR
     A            RATF
     A            CNCF
     A            PCRF
     A            LPFI
     A            PTFC
     A            PTFT
     A            PTFN
     A            PCOB
     A            LRLD
     A            LMCD
     A            SCCY
     A            ICCY
     A            OINR
     A            OIDT
     A            REPI
     A****        RFDY
     A****        RFRI
     A****        RFRT
     A****        RFAR
      *
     A          K CNUM
      *
     A          R ERLOANF1                  PFILE(MCLONCL)
      *
     A            RECI
     A            LNRF
     A            RCDT
     A            MRIN
     A            PTYP
     A            CNUM
     A            BRCA
     A            LTYP
     A            SUTP
     A            DDAT
     A            VDAT
     A            MDAT
     A            LASQ
     A            FCUS
     A            FTYP
     A            FSEQ
     A            CCY
     A            CPAM
     A            INTC
     A            INTR
     A            BRTT
     A            BRTE
     A            RTSP
     A            MARG
     A            SPIN
     A            CHIN
     A            WTRT
     A            WTIN
     A            REPT
     A            RAMT
     A            NRPD
     A            RFRQ
     A            RDYN
     A            FCCY
     A            LIND
     A            CRSK
     A            ACOF
     A            NACD
     A            RELI
     A            AUTO
     A            PSAM
     A            BCXR
     A            FCXR
     A            SDST
     A            OSDA
     A            TSTN
     A            MDST
     A            OMDA
     A            TMAN
     A            FACO
     A            RLDT
     A            NROD
     A            RLFQ
     A            RLDY
     A            NBRA
     A            NRTS
     A            NSIN
     A            NCAS
     A            AWTP
     A            WTRD
     A            WTWD
     A            IWOD
     A            PWOD
     A            BMDI
     A            FMDI
     A            PDIN
     A            LSWC
     A            LSWS
     A            OSDB
     A            OMDB
     A            ORBR
     A            PRFC
     A            FCLB
     A            MLNR
     A            BTIN
     A            BLDY
     A            OLNO
     A            RCSI
     A            ICBS
     A            IPFR
     A            TOTI
     A            NIDT
     A            IBDT
     A            SLID
     A            AIPD
     A            DLRC
     A            IACD
     A            AITC
     A            TFEP
     A            AIAP
     A            IPRD
     A            IPRM
     A            ICTD
     A            AIMN
     A            RBDT
     A            NOPS
     A            NCHI
     A            ZZ001A
     A            IFDY
     A            LONI
     A            CNFI
     A            ACEI
     A            TLXI
     A            CBLI
     A            ORED
     A            LCD
     A            CHTP
     A            TNLU
     A            BOKC
     A            COCU
     A            RECE
     A            OMDT
     A            NIPD
     A            NMDT
     A            APMI
     A            RSTM
     A            RONS
     A            RIBN
     A            RIBA
     A            ROBN
     A            ROCN
     A            PSTM
     A            PONS
     A            PIBN
     A            PIBA
     A            POBN
     A            POCN
     A            RCRN
     A            RCRA
     A            RVNO
     A            AWBN
     A            AWBA
     A            BENN
     A            BENA
     A            DTP1
     A            DTP2
     A            DTP3
     A            DTP4
     A            DCHG
     A            BTB1
     A            BTB2
     A            BTB3
     A            BTB4
     A            BTB5
     A            BTB6
     A            CVMR
     A            PTFR
     A            HLEX
     A            FSRP
     A            FSGN
     A            FPRC
     A            TCOF
     A            ACPD
     A            ACDA
     A            ACAJ
     A            ACAP
     A            COFD
     A            COFM
     A            CFCD
     A            NFRS
     A            NFSN
     A            NFPC
     A            PDCF
     A            FCTD
     A            FWOD
     A            DFTP
     A            DFST
     A            MCRA
     A            FCRA
     A            PDDI
     A            PTDI
     A            GDPR
     A            GDIN
     A            LNKS
     A            MNSG
     A            GASS
     A            GPRT
     A            TOLN
     A            LSTS
     A            IUSR
     A            AUSR
     A            XUSR
     A            RATF
     A            CNCF
     A            PCRF
     A            LPFI
     A            PTFC
     A            PTFT
     A            PTFN
     A            PCOB
     A            LRLD
     A            LMCD
     A            SCCY
     A            ICCY
     A            OINR
     A            OIDT
     A            REPI
     A****        RFDY
     A****        RFRI
     A****        RFRT
     A****        RFAR
      *
     A          K CNUM
      *
