/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas ER Customer Lending Events - Rtv. file')         *
     A****************************************************************
     A*                                                              *
     A*                                                              *
     A*   MIDAS/ABS - EUROPEAN REPORTING                             *
     A*                                                              *
     A*   ERLVENL0  -  ER CUSTOMER LENDING EVENTS - RTV. IDX         *
     A*                                                              *
      *  (c) Finastra International Limited 2005                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CLE154             Date 06Aug12               *
      *                 CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027A            Date 05May06               *
      *                 CER001             Date 25Apr05               *
      *                 ULX047             Date 22Jan03               *
      *                 ULX046             Date 11Nov02               *
      *                 CAD027 PT          Date 13Jan99               *
      *                 158312 PTFIX1      Date 31Mar99               *
      *                 ERL463 PT          Date 05Nov96               *
      *                 ER_R10             Date 27Oct94               *
      *                 ERL416 PT          Date 25Jul94               *
     A*                                                              *
     A*--------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CLE154 - Loan Repayment Schedule Enhancement (Recompile)     *
      *  CLE148 - Alpha Loan Reference (Recompile)                    *
      *  CSD027A - Conversion Of Customer Number to Alpha (recompile) *
      *  CER001 - LUX Upgrade to MidasPlus  (Recompile only)          *
     A*   ULX047 - PAST DUE EVENTS ARE NOT REPORTED ANYMORE IN       *
     A*            RELEASE 4 TO AVOID DUPLICATION WITH FORWARD EVENTS*
     A*   ULX046 - Circulars 2002/170-174-175 Integration            *
     A*            This file should be included in xxCADLIB          *
     A*   CAD027 - FILE MUST BE KEYED ON EVENT DATE                  *
     A*   158312 - Interbranch events cannot be processed *PTFIX1*   *
     A*   ERL463 - TO INCLUDE EVENTS TYPE X2 FOR RELEASE 10          *
     A*   ER_R10 - EUROPEAN REPORTING - LUXEMBOURG UPGRADE IN R10    *
     A*   ERL416 - REPAYMENTS MANAGEMENT FOR ER                      *
     A*                                                              *
     A****************************************************************
     A*
     A          R ERLVEND0                  PFILE(ERLVENPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2005')
     A*
     A            RECI
     A            LNRF
     A* ER_R10 >>>
     A************CNUM
     A            CUNR
     A* ER_R10 <<<
     A            ETYP1              I      SST(ETYP 1 2)
     A            ETYP2              I      SST(ETYP 3 2)
     A            EDAT
     A            EAMT
     A            ECCY
     A* 158312 >>>
     A            IBRE
     A* 158312 <<<
     A*
     A          K LNRF
     A* CAD027 START
     A**********K ETYP2
     A**********K EAMT
     A          K EDAT
     A          K ETYP2                     DESCEND
     A* CAD027 END
     A*
     A* ULX047 START
     A****      S RECI                      COMP(EQ 'L')
     A****        ETYP1                     COMP(EQ '61')
     A****        ETYP2                     COMP(EQ 'D1')
     A****      S RECI                      COMP(EQ 'L')
     A****        ETYP1                     COMP(EQ '62')
     A****        ETYP2                     COMP(EQ 'D1')
     A****      S RECI                      COMP(EQ 'L')
     A****        ETYP1                     COMP(EQ '64')
     A****        ETYP2                     COMP(EQ 'D1')
     A* ULX047 END
     A          S RECI                      COMP(EQ 'L')
     A            ETYP1                     COMP(EQ '61')
     A            ETYP2                     COMP(EQ 'I2')
     A          S RECI                      COMP(EQ 'L')
     A            ETYP1                     COMP(EQ '62')
     A            ETYP2                     COMP(EQ 'I2')
     A          S RECI                      COMP(EQ 'L')
     A            ETYP1                     COMP(EQ '64')
     A            ETYP2                     COMP(EQ 'I2')
     A          S RECI                      COMP(EQ 'L')
     A            ETYP1                     COMP(EQ '61')
     A            ETYP2                     COMP(EQ 'R1')
     A          S RECI                      COMP(EQ 'L')
     A            ETYP1                     COMP(EQ '62')
     A            ETYP2                     COMP(EQ 'R1')
     A          S RECI                      COMP(EQ 'L')
     A            ETYP1                     COMP(EQ '64')
     A            ETYP2                     COMP(EQ 'R1')
     A          S RECI                      COMP(EQ 'L')
     A            ETYP1                     COMP(EQ '61')
     A            ETYP2                     COMP(EQ 'M1')
     A          S RECI                      COMP(EQ 'L')
     A            ETYP1                     COMP(EQ '62')
     A            ETYP2                     COMP(EQ 'M1')
     A          S RECI                      COMP(EQ 'L')
     A            ETYP1                     COMP(EQ '64')
     A            ETYP2                     COMP(EQ 'M1')
     A* ERL463 START
     A          S RECI                      COMP(EQ 'L')
     A            ETYP1                     COMP(EQ '61')
     A            ETYP2                     COMP(EQ 'X2')
     A          S RECI                      COMP(EQ 'L')
     A            ETYP1                     COMP(EQ '62')
     A            ETYP2                     COMP(EQ 'X2')
     A          S RECI                      COMP(EQ 'L')
     A            ETYP1                     COMP(EQ '64')
     A            ETYP2                     COMP(EQ 'X2')
     A* ERL463 END
