      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MT Intermediary Msg File Creation')
     A*****************************************************************
     A**                                                             **
     A**  Midas Midas/TELEX INTERFACE.                           **
     A**                                                             **
     A**  PF/MTJIMPF - INTERMEDIARY MESSAGE WORKFILE.                **
     A**                                                             **
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A**                                                             **
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A**  LAST AMENDMENT NO. 00000            DATE 00/00/00          **
     A**                                                             **
     A*****************************************************************
     A          R MTJIMPFF                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*
     A            WDTA         199A
     A*
