      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MT Input to testkey (error recovery)')
      *****************************************************************
      *                                                               *
      *  Midas - Midas Mailer / Testkey II Module                     *
      *                                                               *
      *  PF/TKIBCKPD - MT Input to Testkey (Error Recovery)           *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.03 -----------------------------------------------*
      *  Last Amend No. 170748  *CREATE    Date 01Aug00               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  170748 - Wrong keys are being calculated for outgoing        *
      *           messages when more than one Testkey user send       *
      *           batches for BISTKO calculation.                     *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R TKIBCKD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            TKIN      R
      *
