      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Bank of England Customer Details - Update')
      *****************************************************************
      *                                                               *
      *  Midas - Bank of England                                      *
      *                                                               *
      *  LF/BYCUSTY2 - Bank of England Customer Details - Update      *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd 2005             *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. LLN018  *CREATE    Date 10May00               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LLN018 - Upgrade BoE to APIs and addition of 2 new fields    *
      *           on ICD.                                             *
      *                                                               *
      *****************************************************************
     A          R BYCUSTD0                  PFILE(BYCUSTX0)
     A                                      TEXT('(C) Midas-Kapiti +
     A                                      International Ltd. 1997')
      *
     A          K LCUST
