      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_RB                                                        *
/*EXIA*  MBR(BYMTDTV5) DTAMBRS((BYMTDTPP (BYMTDTPP BYEXACM BYEXDLM    *                      BUG7238
/*EXIA*  BYEXFFM BYEXFRM BYEXLEM BYEXNTM BYEXSEM BYEXTRM)))           *                      BUG7238
/*EXI *  TEXT('Bank of England Extract Mature Details')               *
      *****************************************************************
      *                                                               *
      *  Midas - Bank of England                                      *
      *                                                               *
      *  LF/BYMTDTV5 - Bank of England Extract File (Mature)          *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd 1999             *
      *                                                               *
      *  Last Amend No. CER059             Date 19Jul10               *
      *  Prev Amend No. BUG24746           Date 02Jul09               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027             Date 05Dec05               *
      *                 BUG7238            Date 18May05               *
      *                 LLN021             Date 31Nov03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  NOTE:  This file must be created with one member built over  *
      *         all the members of PF/BYEXDTPP                        *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  BUG24746 - Missing Source for German Features (Recompile)    *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  BUG7238- No detail records generated for extract files       *
      *           BYEXABPP, BYEXLRPP and BYEXPLPP                     *
      *  LLN021 - BoE Profit and Loss return                          *
      *                                                               *
      *****************************************************************
      *
      *
     A          R BYEXDTD0                  PFILE(BYMTDTPP)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      1999')
     A          K L8MMOD
     A          K L8BRCD
     A          K L8CUST
     A          K L8CYCD
     A          K L8TRAN
      *
     A          S L8BTEX                    COMP(EQ 'Y')
