      ********************************************************************
/*STD *  PFBASE                                                          *
/*EXS *  PF_15WF                                                         *
/*EXI *  TEXT('I/O Reconcile - Reconcile Data File (EBCDIC)')            *
     A********************************************************************
     A*                                                                  *
     A*  Midas - Inter-office Reconcile                                  *
     A*                                                                  *
     A*    PF/IORECNEB - I/O RECONCILE DATA FILE (EBCDIC)                *
     A*                                                                  *
     A*  (C) Finastra International Limited 2021                         *
     A*                                                                  *
     A*  Last Amend No. EML114   *CREATE   Date 23Sep21                  *
     A*                                                                  *
     A*------------------------------------------------------------------*
     A*                                                                  *
     A*  EML114 - Upgrade TFJ004 to FM2.1                                *
     A*  TFJ004 - Inter-office Reconcile                                 *
     A*                                                                  *
     A********************************************************************
     A          R IORECEBF                  TEXT('(C) Finastra Internation+
     A                                      al Limited 2021')
     A            SYSTEM         6A         TEXT('System ID')
     A                                      COLHDG('System ID')
     A            DATE          10A         TEXT('Date')
     A                                      COLHDG('Date')
     A            REC            6A         TEXT('Record type')
     A                                      COLHDG('Record Type')
     A            SCODE1        10A         TEXT('Own Customer Code')
     A                                      COLHDG('Own Customer Code')
     A            ICODE1        10A         TEXT('Own Account Code')
     A                                      COLHDG('Own Account Code')
     A            SCODE2        12A         TEXT('Counterparty Code')
     A                                      COLHDG('Counterparty Code')
     A            ICODE2         8A         TEXT('Counterparty A/C Code')
     A                                      COLHDG('Counterparty' +
     A                                      'A/C Code')
     A            CUR1           8A         TEXT('Currency Code')
     A                                      COLHDG('Currency Code')
     A            AMT1          19A         TEXT('Y-T-D Balance')
     A                                      COLHDG('Y-T-D Balance')
