      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL Amount Accruals Detail (Clone)')              *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  PF/XXAMACPD - Amount Accruals Detail - Clone                 *
      *                                                               *
      *  (c) Finastra Systems Technology, Inc. 2019                   *
      *                                                               *
      *  Last Amend No. DAI101A            Date 11Jun19               *
      *  Prev Amend No. DAI101 *CREATE     Date 20May19               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  DAI101A - Changed Associated Customer definition to 6A       *
      *  DAI101 - Upgrade to FB Midas                                 *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R XXAMACD0                  TEXT('(c) Finastra Systems +
     A                                      Technology, Inc. 2019')
      *
     A            FBRECI    R               REFFLD(RECI )
     A            FBREF     R               REFFLD(FAREF)
     A            FBTYP     R               REFFLD(FATYP)
     A            FBZZ22    R               REFFLD(ZZ022)
     A            FBTNLU    R               REFFLD(TNLU)
     A            FBORED    R               REFFLD(ORED)
     A            FBLCD     R               REFFLD(LCD )
     A            FBCHTP    R               REFFLD(CHTP)
     A            FBAMNT    R               REFFLD(AMNT)
     A            FBCCY     R               REFFLD(CCY )
     A            FBSTDT    R               REFFLD(STDT)
     A            FBMDAT    R               REFFLD(MDAT)
     A            FBDRXX         4S 0
     A            FBDRCN    R               REFFLD(DRCN)
     A            FBCRXX         4S 0
     A            FBCRCN    R               REFFLD(CRCN)
     A            FBPNAR    R               REFFLD(PNAR)
     A            FBFAPD    R               REFFLD(FAPD)
     A            FBDRSQ    R               REFFLD(DRSQ)
     A            FBCRSQ    R               REFFLD(CRSQ)
     A            FBZZ04    R               REFFLD(ZZ004)
     A            FBPRFC    R               REFFLD(PRFC)
     A            FBBRCA    R               REFFLD(BRCA)
     A            FBAPFQ    R               REFFLD(APFQ)
     A            FBFDAY    R               REFFLD(FDAY)
     A            FBAPDA    R               REFFLD(APDA)
     A            FBDRCO    R               REFFLD(DRCO)
     A            FBCRCO    R               REFFLD(CRCO)
      **Start of change DAI101A
     A**********  FBASOC    R               REFFLD(ASOC)                                     DAI101A
     A            FBASOC         6A         TEXT('Associated Customer')
      **End of change DAI101A
     A            FBLCUS        10          TEXT('Last Change User')
     A                                      COLHDG('Last Change User')
     A            FBAUSR        10          TEXT('Authorising User')
     A                                      COLHDG('Authorising User')
