      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_RU                                                        *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      ***PF/APOSTX0*-*ACCOUNTS*POSTINGS*DETAIL*-*EXTENSION*FILE********             LUC110
      *  PF/XXPOSTX0 - Account Postings Detail - Extension file       *             LUC110
      *                                                               *
      ***(c)*Misys*International*Banking*Systems*Ltd.*2005*************             LUC110
      *  (c) Finastra International Limited 2019                      *             LUC110
      *                                                               *
      *  Last Amend No. LUC110             Date 19Jan19               *
      *  Prev Amend No. NUC002 (S25019)    Date 06May05  *CREATE      *
      * Midas Release 4.01.03 --------- Base -------------------------*
      *                                                               *
      *****************************************************************
      *                                                               *
      *  LUC119 - Extended Narratives (Upgrade to FBM 2.1)            *
      *  NUC002 - EXTENDED NARRATIVES for GL, DL and RE Modules.      *
      *                                                               *
      *****************************************************************
      ** Start of LUC110
     A**********R APOSTX0F                  TEXT('(c) Misys International +
     A**********                            Banking Systems Ltd. +
     A**********                            2005')
     A          R XXAPOSF1                  TEXT('(c) Finastra Internation+
     A                                      al Limited 2019')
      ** End of LUC110
      *---------------------------------------------------------------------
     A            BRCA           3A         TEXT('Branch Code')
     A            CNUM           6A         TEXT('Customer No')
     A            CCY            3A         TEXT('Currency Code')
     A            ACOD          10S 0       TEXT('Account Code')
     A            ACSQ           2S 0       TEXT('Account Seq')
     A            PSTD           5P 0       TEXT('Posting Date')
     A            VALD           5P 0       TEXT('Value Date')
     A            UNQK           9A         TEXT('Unique Key Sequence')
     A            GETP           1A         TEXT('Generated Entry Typ')
     A            GNAR1         35A         TEXT('Posting Narrative 1')
     A            GNAR2         35A         TEXT('Posting Narrative 2')
     A            GNAR3         35A         TEXT('Posting Narrative 3')
      *=====================================================================
