      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL GCMS message reference file')                 *
      *****************************************************************
      *                                                               *
      *  Midas - Midas-GCMS Interface Module                          *
      *                                                               *
      ***PF/GLMREFPD*-*Midas-GCMS*Message*Reference********************                   JMI113
      *  PF/XXMREFPD - Midas-GCMS Message Reference                   *                   JMI113
      *                                                               *
      ***(c)*Misys*International*Banking*Systems*Ltd.*2007*************                   JMI113
      *  (c) Finastra International Limited 20108                     *                   JMI113
      *                                                               *
      *  Last Amend No. JMI113              Date 23May18              *
      *  Prev Amend No. JMI019  *CREATE     Date 02Feb07              *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  JMI113 - Midas GCMS Interface. Upgrade to FBM 2.1            *
      *  JMI019 - Phase III MT999 Message Processing                  *
      *                                                               *
      *****************************************************************
      *
      ** Start of JMI113
     A**********                            REF(MFRFL)
     A**********R GLMREFD0                  TEXT('(c) Misys International +
     A**********                            Banking Systems Ltd. +
     A**********                            2007')
     A          R XXMREFD0                  TEXT('(c) Finastra Internation+
     A                                      al Limited 2018.')
      ** End of JMI113
      *
      ** Start of JMI113
     A**********  F3MBRN    R               REFFLD(MBRN)
     A            F3MBRN        10A
      ** End of JMI113
     A                                      TEXT('Member Name')
     A                                      COLHDG('Member' +
     A                                      'Name')
      ** Start of JMI113
     A**********  F3DNLS    R               REFFLD(DNLS)
     A            F3DNLS         1A
      ** End of JMI113
     A                                      TEXT('Download Status')
     A                                      COLHDG('Dld' +
     A                                      'Sts')
      ** Start of JMI113
     A**********  F3RSTN    R               REFFLD(RSTN)
     A            F3RSTN         3S 0
      ** End of JMI113
     A                                      TEXT('Reset Number')
     A                                      COLHDG('Rst' +
     A                                      'No.')
      ** Start of JMI113
     A**********  F3RSTU    R               REFFLD(RSTU)
     A            F3RSTU        10A
      ** End of JMI113
     A                                      TEXT('Reset User')
     A                                      COLHDG('Reset User')
      ** Start of JMI113
     A**********  F3RSTD    R               REFFLD(RSTD)
     A            F3RSTD         5S 0
      ** End of JMI113
     A                                      TEXT('Reset Date')
     A                                      COLHDG('Reset' +
     A                                      'Date')
      ** Start of JMI113
     A**********  F3RTIM    R               REFFLD(RTIM)
     A            F3RTIM         6S 0
      ** End of JMI113
     A                                      TEXT('Reset Time')
     A                                      COLHDG('Reset' +
     A                                      'Time')
      ** Start of JMI113
     A**********  F3DLDL    R               REFFLD(DLDL)
     A            F3DLDL         5S 0
      ** End of JMI113
     A                                      TEXT('Date of Last Download')
     A                                      COLHDG('Date' +
     A                                      'Last' +
     A                                      'Downld')
      ** Start of JMI113
     A**********  F3TDNL    R               REFFLD(TDNL)
     A            F3TDNL         6S 0
      ** End of JMI113
     A                                      TEXT('Time of Last Download')
     A                                      COLHDG('Time' +
     A                                      'Last' +
     A                                      'Download')
      ** Start of JMI113
     A**********  F3DLFN    R               REFFLD(DPGM)
     A            F3DLFN         8A
      ** End of JMI113
     A                                      TEXT('Download File Name')
     A                                      COLHDG('Download' +
     A                                      'File' +
     A                                      'Name')
