      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Midas/OPICS interface ICD')                   *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      ***PF/SDOPINPD*-*Midas/OPICS*Interface*ICD***********************                       JMI111
      *  PF/XXOPINPD - Midas/OPICS Interface ICD                      *                       JMI111
      *                                                               *
      ***(c)*Misys*International*Banking*Systems*Ltd.*2007*************                       JMI111
      *  (c) Finastra International Limited 2018                      *                       JMI111
      *                                                               *
      *  Last Amend No. JMI111             Date 16May18               *
      *  Prev Amend No. CGL019  *CREATE    Date 20Apr07               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  JMI111 - OPICS-Midas Interface phase. Upgrade to FBM 2.1     *
      *  CGL019 - OPICS-Midas Interface phase                         *
      *                                                               *
      *****************************************************************
      *
      ** Start of JMI111
     A**********R SDOPIND0                  TEXT('(c) Misys International +
     A**********                            Banking Systems Ltd. +
     A**********                            2007')
      *
     A          R XXOPIND0                  TEXT('(c) Finastra International +
     A                                      Limited 2018')
      ** End of JMI111
      *
     A*---------------------------------------------------------------------
     A            OPINKY        10          TEXT('Midas/OPICS Interface Key')
     A                                      COLHDG('Midas/OPICS' +
     A                                             'Interface Key' )
     A            OPDEPT         3          TEXT('Department')
     A                                      COLHDG('Department' )
     A            OPPRFC         4          TEXT('Profit centre code  MIDAS')
     A                                      COLHDG('Profit centre' +
     A                                             'code  MIDAS' )
     A            OPBOOK         2          TEXT('Book')
     A                                      COLHDG('Book' )
     A            OPLRBN         3S 0       TEXT('Lower Range Batch Number')
     A                                      COLHDG('Lower Range' +
     A                                             'Batch Number' )
     A                                      EDTCDE(3)
     A            OPURBN         3S 0       TEXT('Upper Range Batch Number')
     A                                      COLHDG('Upper Range' +
     A                                             'Batch Number' )
     A                                      EDTCDE(3)
     A            OPBALA        10          TEXT('Balancing a/c code')
     A                                      COLHDG('Bal.' 'A/c' 'Code')
     A            OPTRTP         5          TEXT('Transaction Type (OPICS)')
     A                                      COLHDG('Transaction' +
     A                                             'Type (OP)' )
     A            OPTYLC         1          TEXT('Type of Last Change')
     A                                      COLHDG('Type of' +
     A                                             'Last Change' )
     A            OPLCD          5  0       TEXT('Last Change Date')
     A                                      COLHDG('Last' +
     A                                             'Change Date' )
