      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE Position Sett with A/C Blocked for CR')       *
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      ****PF/SEPOBCPP*-*SE*Position*Settlements*with*A/C*Blocked*******                  HUT111
      *   PF/XXPOBCTD - SE Position Settlements with A/C Blocked      *                  HUT111
      *                 for Credit                                    *
      *                                                               *
      ***(c)*Misys*International*Banking*Systems*Ltd.*2016*************                  HUT111
      *  (c) Finastra International Systems Ltd. 2020                 *                  HUT111
      *                                                               *
      *  Last Amend No. HUT111             Date 08Apr20               *
      *  Prev Amend No. HUT024  *Create    Date 17Oct16               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  HUT111 - Corporate Actions Blocked Credit Account            *
      *           (Upgrade HUT024 to FM2.1 SP22)                      *
      *  HUT024  Corporate Actions Blocked Credit Account            *
      *                                                               *
      *****************************************************************
      *
      ** Start of HUT111
     A**********R SEPOBCD0                  TEXT('(c) Misys International +
     A**********                            Banking Systems Ltd. +
     A**********                            2016')
     A          R XXPOBCD0                  TEXT('(c) Finastra Internation+
     A                                      al Systems Ltd. 2020')
      ** End of HUT111
      *
     A            XPBCA          3A         TEXT('Booking Branch')
     A                                      COLHDG('Booking' +
     A                                             'Branch')
     A            XPSSH         10A         TEXT('Security')
     A                                      COLHDG('Security')
      ** Start of HUT111
     A**********  XPCPY          6  0       TEXT('Customer Number')
     A            XPCPY          6A         TEXT('Customer Number')
      ** End of HUT111
     A                                      COLHDG('Customer Number')
     A            XPEVT          2A         TEXT('Event Type')
     A                                      COLHDG('Event Type')
     A            XPSVL          5  0       TEXT('Value Date')
     A                                      COLHDG('Value Date')
     A            XPAMD         13  0       TEXT('Amount')
     A                                      COLHDG('Amount')
     A            XPSCU          3A         TEXT('Settlement Currency')
     A                                      COLHDG('Settlement' +
     A                                             'Currency')
     A            XPSMT          2A         TEXT('Settlement Method')
     A                                      COLHDG('Settlement' +
     A                                             'Method')
     A            XACNO         10A         TEXT('Settlement Account')
     A                                      COLHDG('Settlement' +
     A                                             'Account')
     A          K XPBCA
     A          K XPSSH
     A          K XPCPY
     A          K XPEVT
      *
      *****************************************************************
