000100200529      *****************************************************************
000200200529/*STD *  PRTFBASE                                                     *
000300200529/*EXS *  PR_STD60J                                                    *
000400200529/*EXI *  TEXT('Midas SE Position settlements audit list')
000500200529/*ADD *  CHGPRTF FILE(SE0335P1) OVRFLW(63)                            *
000600200529     A*****************************************************************
000700200529     A*                                                               *
000800200529     A*  Midas - Securities Trading Module
000900200529     A*                                                               *
001000200529     A*  PRTF/SE0335P1 - SE0335 POSITION SETTLEMENTS AUDIT LIST       *
001100200529     A*                                                               *
001200200529      *  (c) Finastra International Limited 2001                      *
001300200529     A*                                                               *
001400200604      *  Last Amend No. AR324888           Date 22May20               *
001500200529      *  Prev Amend No. MD046248           Date 27Oct17               *
001600200529      * Bank Fusion Midas 1.4 Base -----------------------------------*
001700200529      * Midas Plus 1.4 Base 04 ---------------------------------------*
001800200529      * Midas Plus 1.4 Base ------------------------------------------*
001900200529      * Midas Plus 1.3 ----------- Base ------------------------------*
002000200529      *                 CSD027             Date 30Nov05               *
002100200529      *                 CGL029             Date 01Sep03               *
002200200529      * Midas Release 4 --------------- Base -------------------------*
002300200529      * Midas DBA 3.04 -----------------------------------------------*
002400200529      *                 CSE023             Date 12Jul00               *
002500200529      * Midas DBA 3.03 -----------------------------------------------*
002600200529      *                 166145             Date 08Jun00               *
002700200529      * Midas DBA 3.00 ---------------- Base -------------------------*
002800200529      *                 123673             Date 23Feb98               *
002900200529     A*                 CAC002             Date 15Sep96               *
003000200529     A*                 S01408             Date 23Feb96               *
003100200529     A*                 087178             Date 15Jun95               *
003200200529     A*                 S01486             DATE 10NOV94               *
003300200529     A*                 S01496             DATE 15JUL94               *
003400200529     A*                 078011             DATE 27OCT94               *
003500200529     A*                 S01512             DATE 10AUG94               *
003600200529     A*                 S01447             DATE 18OCT93               *
003700200529     A*                 S01401             DATE 16JUN93               *
003800200529     A*                 E29170             DATE 08NOV91               *
003900200529     A*                 E28705             DATE 24SEP91               *
004000200529     A*                 S01117             DATE 24MAY90               *
004100200529     A*                                                               *
004200200529     A*---------------------------------------------------------------*
004300200529     A*                                                               *
004400200529      *  AR324888 - Include User name in Audit reports.               *
004500200529      *  MD046248 - Finastra Rebranding                               *
004600200529      *  CSD027 - Conversion Of Customer Number to Alpha              *
004700200529      *  CGL029 - Increase Account Code to 10 digits                  *
004800200529      *  CSE023 - Treaty Withholding Tax                              *
004900200529     A*  166145 - Avoid overwriting of 'PLUS' with 'LESS'             *
005000200529     A*  123673 - Avoid overwriting of field 'S.W.I.F..' by 'CONVER..'*
005100200529     A*  CAC002 - Profit Centre Accounting Development - Phase 2      *
005200200529     A*           If Analytical Accounting is available, the profit   *
005300200529     A*           centre for each Charge/Commission Code would be     *
005400200529     A*           reported.  If the settlement currency is not the    *
005500200529     A*           same as the nominal currency, the FX Margin Points  *
005600200529     A*           and Amount will also be reported.                   *
005700200529     A*  S01408 - Addition of core hook SE0335P101                    *
005800200529     A*           Addition of core hook SE0335P102                    *
005900200529     A*  087178 - Withholding tax can be added or subtracted          *
006000200529     A*  S01486 - PRINT PORTFOLIO REFERENCE DETAILS                   *
006100200529     A*  S01496 - Incorp. of Private Banking SE Enhancements (S10985) *
006200200529     A*  078011 - Wrong branch code is printed on the last page for a *
006300200529     A*           branch containing only the total positions          *
006400200529     A*  S01512 - Add value date to Position Settlements              *
006500200529     A*  S01447 - POSITION SETTLEMENTS AUDIT LIST                     *
006600200529     A*           Amended to print the Withholding Tax Details about a*
006700200529     A*           settlement position if it has them and the feature  *
006800200529     A*           is switched on.                                     *
006900200529     A*  S01401 - This has been amended to add SWIFT Further          *
007000200529     A*           Identification field (for MT554).                   *
007100200529     A*  E29170 - Report Control Facility changes                     *
007200200529     A*  E28705 - Space missing between literal 'DATE' and the date.  *
007300200529     A*  S01117 - MULITBRANCHING                                      *
007400200529     A*                                                               *
007500200529     A*****************************************************************
007600200529     A                                      REF(MFRFL)
007700200529     A**
007800200529     A**   *******************
007900200529     A**   PAGE HEADINGS
008000200529     A**   *******************
008100200529     A**
008200200529     A          R HEADP1                    SKIPB(3)
008300200529     A                                      TEXT('(c) Finastra International +
008400200529     A                                      Limited +
008500200529     A                                      2001')
008600200529     A                                     6'REFERENCE SE0335P1'
008700200529     A            TITL      R             39
008800200529      *                                              Begin /E28705/
008900200529     A***********                        101'DATE'
009000200529     A                                   100'DATE'
009100200529      *                                              End   /E28705/
009200200529     A            RUNA      R            105
009300200529     A                                   119'PAGE'
009400200529     A            PAGE         004S 0    125EDTCDE(Z) SPACEA(2)
009500200529     A                                    10'SECURITIES TRADING'
009600200529     A                                    29'POSITION SETTLEMENTS AUDIT LIST -'
009700200529     A  40                                63'AUDIT - EXCEPTION'
009800200529     A  40                                81TIME
009900200529     A  41                                63'AUDIT'
010000200529     A  42                                63'FULL LIST'
010100200529     A***                                            Begin /S01117/
010200200529     A***********                         90'BRANCH'
010300200529     A*N80******* PBCH      R             97
010400200529     A**80******* ZPBCH     R             97REFFLD(TDBR)
010500200529     A***********                        100'-'
010600200529     A*********** ZBRNM     R            101REFFLD(BRNM)
010700200529     A***********                           SPACEA(1)
010800200529     A***********                         10'-------------------'
010900200529     A  35N36                             93'BRANCH '
011000200529     A*                                              Begin /078011/
011100200529     A**35N36*****PBCA      R            100
011200200529     A  35N36     ZPBCA          3A      100
011300200529     A*                                              End   /078011/
011400200529     A  35N36                            103'-'
011500200529     A  35N36     ZBRNM     R            104REFFLD(BRNM)
011600200529     A                                    10'-------------------' SPACEB(1)
011700200529     A***                                            End   /S01117/
011800200529     A                                    29'-------------------------------'
011900200529     A                                      SPACEA(3)
012000200529     A**
012100200529     A**   *******************
012200200529     A**   DETAIL PART OF REPORT
012300200529     A**   *******************
012400200529     A**
012500200529     A          R DETAIL
012600200529      *                                              Begin /CAC002/
012700200529     A***********                           SPACEB(1)
012800200529      *                                              End   /CAC002/
012900200529     A                                     1'SECURITY'
013000200529     A            PSSH      R             14
013100200529     A*/COPY WNCPYSRC,SE0335P109
013200200529     A            RNME          41        26
013300200529     A*/COPY WNCPYSRC,SE0335P110
013400200529      **Start of change AR324888
013500200529     A N72                                  SPACEA(1)
013600200529     A**********                          94'LAST ACTIVITY'                                 AR324888
013700200529     A  72                                70'LAST REVERSED AUTHORISED BY'
013800200529     A  72        PAUUSR    R             99REFFLD(USRP)
013900200529     A  72                               110'/'
014000200529     A  72        ZRLCD     R            112REFFLD(RUNA)
014100200529      **End of change AR324888
014200200529     A                                      SPACEA(1)
014300200529     A*
014400200529     A*/COPY WNCPYSRC,SE0335P111
014500200529     A                                     1'CUSTOMER'
014600200529      * Begin /CSD027/
014700200529     A**********  PCPY      R             14                                                  CSD027
014800200529     A            PCPY           6A       14TEXT('Counterparty')
014900200529      * End /CSD027/
015000200529     A            CSNMC     R             26REFFLD(CSNM)
015100200529     A            CRNMC     R             37REFFLD(CRNM)
015200200529     A            CTWNC     R             58REFFLD(CTWN)
015300200529      **Start of change AR324888
015400200529     A**********                          94'DATE'                                          AR324888
015500200529     A**********                         103'TYPE'                                          AR324888
015600200529     A N73                                  SPACEA(1)
015700200529     A  73                                70'PREVIOUS LAST ACTIVITY BY'
015800200529     A  73        PAPUSR    R             99REFFLD(USRP)
015900200529     A  73                               110'/'
016000200529     A  73        ZPLCD     R            112REFFLD(RUNA)
016100200529     A  73                               120'/'
016200200529     A  74                               122'INS'
016300200529     A                                      SPACEA(1)
016400200529     A  75                               122'AMD'
016500200529     A                                      SPACEA(1)
016600200529     A  76                               122'DEL'
016700200529     A                                      SPACEA(1)
016800200529     A  77                               122'AUT'
016900200529     A                                      SPACEA(1)
017000200529     A  78                               122'RAU'
017100200529     A                                      SPACEA(1)
017200200529     A  79                               122'REV'
017300200529      **End of change AR324888
017400200529     A                                      SPACEA(1)
017500200529     A                                     1'DUE DATE'
017600200529     A            ZAPDUD    R             14REFFLD(RUNA)
017700200529      *                                              Begin /S01512/
017800200529     A  38                                26'VALUE DATE'
017900200529     A  38        ZAPSVL    R             38REFFLD(RUNA)
018000200529      *                                              End   /S01512/
018100200529      **Start of change AR324888
018200200529     A N88                                70'LAST ACTIVITY BY'
018300200529     A N88        PALUSR    R             99REFFLD(USRP)
018400200529     A N88                               110'/'
018500200529     A**********  ZALCD     R             94REFFLD(RUNA)                                    AR324888
018600200529     A N88        ZALCD     R            112REFFLD(RUNA)
018700200529     A N88                               120'/'
018800200529     A**51******                         103'AMEND'                                         AR324888
018900200529     A  51                               122'AMD'
019000200529      **End of change AR324888
019100200529     A                                      SPACEA(1)
019200200529     **Start of change AR324888
019300200529     A**52******                         103'INSERT'                                        AR324888
019400200529     A  52                               122'INS'
019500200529      **End of change AR324888
019600200529     A                                      SPACEA(1)
019700200529      **Start of change AR324888
019800200529     A**53******                         103'DELETE'                                        AR324888
019900200529     A  53                               122'DEL'
020000200529      **End of change AR324888
020100200529     A                                      SPACEA(1)
020200200529     **Start of change AR324888
020300200529     A**54******                         103'AUTHORISE'                                     AR324888
020400200529     A  54                               122'AUT'
020500200529      **End of change AR324888
020600200529     A                                      SPACEA(1)
020700200529     A***********                                    Begin /S01496/
020800200529      **Start of change AR324888
020900200529     A**69*70***                         103'REVERSE'                                       AR324888
021000200529     A  69 70                            122'REV'
021100200529      **End of change AR324888
021200200529     A     70                               SPACEA(1)
021300200529      **Start of change AR324888
021400200529     A  87                               122'RAU'
021500200529     A                                      SPACEA(1)
021600200529      **End of change AR324888
021700200529     A***********                                    End   /S01496/
021800200529     A***********                                    Begin /S01486/
021900200529     A  56                                 1'PORTFOLIO'
022000200529     A  56        RRPREF         4        14
022100200529     A  56        RRPNAR        20        26
022200200529      *                                              Begin /CAC002/
022300200529     A  20                               119'PRFT'
022400200529     A***********                           SPACEA(1)
022500200529      *                                              End   /CAC002/
022600200529     A***********                                    End   /S01486/
022700200529     A                                     1'EVENT TYPE'
022800200529      *                                              Begin /CAC002/
022900200529     A                                      SPACEB(1)
023000200529      *                                              End   /CAC002/
023100200529     A            PEVT      R             14
023200200529     A            LPEVT         14        26
023300200529      *                                              Begin /CAC002/
023400200529     A  20                               119'CNTR'
023500200529     A***********                           SPACEA(1)
023600200529      *                                              End   /CAC002/
023700200529     A                                     1'POSITION'
023800200529      *                                              Begin /CAC002/
023900200529     A                                      SPACEB(1)
024000200529      *                                              End   /CAC002/
024100200529     A            PNCY      R             14
024200200529     A            ZEPNMP        16        19
024300200529     A                                    57'AMOUNT DUE'
024400200529     A                                    70'PAY/REC'
024500200529     A  64                                78'PAY'
024600200529     A  65                                78'RECEIVE'
024700200529     A            ZPNCYA    R             94REFFLD(PNCY)
024800200529     A            ZEPAMD        18        99
024900200529     A                                      SPACEA(1)
025000200529     A                                     1'SETTLEMENT'
025100200529     A            PSMT      R             14
025200200529     A            LPSMT         14        26
025300200529     A                                    57'CHARGES'
025400200529     A            PCHC      R             70
025500200529     A            ZCHNRA    R             73REFFLD(CHNR)
025600200529     A  66                                94'PLUS'
025700200529     A  67                                94'LESS'
025800200529     A            ZEPCHA        18        99
025900200529      *                                              Begin /CAC002/
026000200529     A  20        PCPRFC         4       119
026100200529     A*                                                                   S01408
026200200529     A*/COPY WNCPYSRC,SE0335P101                                          S01408
026300200529     A*                                                                   S01408
026400200529     A***********                           SPACEA(1)
026500200529      *                                              End   /CAC002/
026600200529     A                                     1'ACCOUNT'
026700200529      *                                              Begin /CAC002/
026800200529     A                                      SPACEB(1)
026900200529      *                                              End   /CAC002/
027000200529     A**Start of change CGL029
027100200529     A**********  ZPSE14        14        14                                                  CGL029
027200200529     A**********                          34'BR'                                              CGL029
027300200529     A**********  PSEB      R             37                                                  CGL029
027400200529     A            ZPSE14        20        14                                                  CGL029
027500200529     A                                    36'BR'                                              CGL029
027600200529     A            PSEB      R             39                                                  CGL029
027700200529     A**End of change CGL029
027800200529     A                                    57'COMMISSION'
027900200529     A            PCCD      R             70
028000200529     A            ZCHNRB    R             73REFFLD(CHNR)
028100200529     A  66                                94'PLUS'
028200200529     A  67                                94'LESS'
028300200529     A            ZEPCAM        18        99
028400200529      *                                              Begin /CAC002/
028500200529     A  20        PPRFC          4       119
028600200529     A*                                                                   S01408
028700200529     A*/COPY WNCPYSRC,SE0335P102                                          S01408
028800200529     A*                                                                   S01408
028900200529     A***********                           SPACEA(1)
029000200529      *                                              End   /CAC002/
029100200529     A                                     1'COUNTERPARTY'
029200200529      *                                              Begin /CAC002/
029300200529     A                                      SPACEB(1)
029400200529      *                                              End   /CAC002/
029500200529     A            PCPN      R             14
029600200529      *                                              Start /S01447/
029700200529     A N34                                  SPACEA(1)
029800200529     A  34 33                             57'TAX AMOUNT DEDUCTED AT +
029900200529     A                                      SOURCE'
030000200529      *                                              Begin /087178/
030100200529     A**34*33***                          94'LESS'         /166145/
030200200529     A  34 33 66                          94'PLUS'
030300200529     A  34 33 67                          94'LESS'
030400200529      *                                              End   /087178/
030500200529     A  34 33     STASO         18        99
030600200529      *                                              End   /S01447/
030700200529     A                                      SPACEA(1)
030800200529     A                                     1'FOR A/C OF'
030900200529      *                                              Start /S01447/
031000200529     A  34N33                               SPACEB(1)
031100200529      *                                              End   /S01447/
031200200529     A            PFAC      R             14
031300200529      *                                              Start /S01447/
031400200529     A**********                          87'TOTAL'
031500200529     A**********  ZPNCYB    R             94REFFLD(PNCY)
031600200529     A**********  ZETOT         18        99
031700200529     A**********                            SPACEA(1)
031800200529     A**********                           1'SPECIAL INSTRUCTIONS'
031900200529     A**********  PSPI      R             22
032000200529     A**********                          62'CONVERTED AT'
032100200529     A**********  PSXR      R             75EDTCDE(3)
032200200529     A**********                          90'TO'
032300200529     A**********  PSCU      R             94
032400200529     A**********  ZEPSAT        18        99
032500200529     A*/COPY WNCPYSRC,SE0335P113
032600200529     A*/COPY WNCPYSRC,SE0335P103
032700200529     A N34                                  SPACEA(1)
032800200529     A*/COPY WNCPYSRC,SE0335P114
032900200529     A*/COPY WNCPYSRC,SE0335P104
033000200529     A  34 33                             57'TAX AMOUNT DEDUCTED +
033100200529     A                                      BY USER'
033200200529      *                                              Begin /087178/
033300200529     A**34*33***                          94'LESS'         /166145/
033400200529     A  34 33 66                          94'PLUS'
033500200529     A  34 33 67                          94'LESS'
033600200529      *                                              End   /087178/
033700200529     A  34 33     STAUS         18        99SPACEA(1)
033800200529     A*/COPY WNCPYSRC,SE0335P115
033900200529     A*/COPY WNCPYSRC,SE0335P105
034000200529     A                                     1'SPECIAL INSTRUCTIONS'
034100200529     A*/COPY WNCPYSRC,SE0335P116
034200200529     A*/COPY WNCPYSRC,SE0335P106
034300200529     A  34N33                               SPACEB(1)
034400200529     A*/COPY WNCPYSRC,SE0335P117
034500200529     A*/COPY WNCPYSRC,SE0335P107
034600200529      *                                              End   /S01447/
034700200529     A            PSPI      R             22
034800200529     A*
034900200529      *                                              Start /S01447/
035000200529     A  34                                  SPACEA(1)
035100200529     A  34 33                              1'TAX DEDUCTED AT +
035200200529     A                                      SOURCE - REFUNDABLE'
035300200529     A  34 33     STASR         18        36
035400200529     A*
035500200529     A                                    87'TOTAL'
035600200529     A            ZPNCYB    R             94REFFLD(PNCY)
035700200529     A            ZETOT         18        99
035800200529     A                                      SPACEA(1)
035900200529     A                                    62'CONVERTED AT'
036000200529     A            PSXR      R             75EDTCDE(3)
036100200529     A                                    90'TO'
036200200529     A            PSCU      R             94
036300200529     A            ZEPSAT        18        99
036400200529      *                                              End   /S01447/
036500200529     A**                                             Begin /S01117/
036600200529     A**
036700200529      *                                              Begin /S01401/
036800200529     A***********                           SPACEA(1)
036900200529     A  37                                  SPACEA(1)
037000200529      *                                              End   /S01401/
037100200529     A  37                                 1'PROFIT CENTRE'
037200200529     A  37        PPFC      R             18
037300200529      *                                              Begin /CAC002/
037400200529     A  19 20                             62'FX MARGIN OF'
037500200529     A  19 20     PFXMP          9        75
037600200529     A  19 20                             90'IS'
037700200529     A  19 20     PSCU1          3        94
037800200529     A  19 20     PMAMT         18        99
037900200529     A                                      SPACEA(1)
038000200529      *                                              End   /CAC002/
038100200529     A***                                            End   /S01117/
038200200529      *                                              Begin /S01401/
038300200529     A***********                           SPACEA(3)
038400200529      *                                              Begin /S01447/
038500200529     A*N37*******                          1' '
038600200529     A*N37*******                           SPACEA(1)
038700200529     A**83*******                         26'S.W.I.F.T. FURTHER +
038800200529     A***********                           IDENTIFICATION (MT554 ONLY)'
038900200529     A**83******* POFID3    R             74REFFLD(FID3)
039000200529      *                                              Begin /123673/
039100200529     A N37 83                              1' '
039200200529     A N37 83                               SPACEA(1)
039300200529      *                                              End   /123673/
039400200529     A  83                                57'S.W.I.F.T. FURTHER +
039500200529     A                                      IDENTIFICATION (MT554 ONLY)'
039600200529     A  83        POFID3    R            105REFFLD(FID3)
039700200529      *                                              End   /S01447/
039800200529     A*/COPY WNCPYSRC,SE0335P108
039900200529      *
040000200529     A                                   132' '
040100200529     A**Start of change CSE023
040200200529     A  85                                  SPACEA(1)
040300200529     A  85                                 1'TAX BASKET'
040400200529     A  85        TXBS           2A       15
040500200529     A  85        TXBN          15A       18
040600200529     A  85                                57'EXEMPTION CODE'
040700200529     A  85        EXCD           2A       73
040800200529     A  85                                85'COUNTRY OF TAX'
040900200529     A  85        CRTX           2A      100
041000200529     A  85                                  SPACEA(1)
041100200529     A  85                                 1'RECEPIENT CODE'
041200200529     A  85        RPCD           2A       20
041300200529     A  85                                57'INCOME TYPE'
041400200529     A  85        ICTP           2A       70
041500200529     A  85                                76'BENEFICIAL OWNER NUMBER'
041600200529     A  85        BNFO          26A      100
041700200529     A  85                                  SPACEA(1)
041800200529     A  85                                 1'MT565 MESSAGE REQUIRED'
041900200529     A  85        MT5R           1A       30
042000200529     A  85                                57'MT565 GENERATED'
042100200529     A  85        MT5G           1A       75
042200200529     A  85                                86'CUSTOMER TYPE'
042300200529     A  85        CTYP           1A      103
042400200529     A  85                                  SPACEA(1)
042500200529     A  85                                 1'POSITION SETTLEMENT +
042600200529     A                                      REFERENCE NUMBER'
042700200529     A  85        PREF           6A       40
042800200529     A  85                                57'SWIFT SEQUENCE NUMBER'
042900200529     A  85        RPSEQ          3A       80
043000200529     A  85                                  SPACEA(1)
043100200529     A  85                                 1'CUSTOMER TAX +
043200200529     A                                      ID NUMBER'
043300200529     A  85        CTIN          20A       30
043400200529     A  85                                57'TOTAL DISCOUNTED +
043500200529     A                                      AMOUNT'
043600200529     A  85        RDAMT         21A       90
043700200529     A                                   132' '
043800200529     A**End of change CSE023
043900200529     A                                      SPACEA(3)
044000200529      *                                              End   /S01401/
044100200529     A
044200200529     A**
044300200529     A**   *******************
044400200529     A**   TOTAL LINE
044500200529     A**   *******************
044600200529     A**
044700200529     A          R TOTAL
044800200529     A**                                             Begin /S01117/
044900200529     A**********                            SPACEB(3)
045000200529     A                                      SPACEB(1)
045100200529     A**                                             End   /S01117/
045200200529     A                                    14'TOTAL NUMBER OF POSITION'
045300200529     A                                    39'SETTLEMENTS'
045400200529     A                                    51'LISTED-'
045500200529     A  40        ZCHGP1    R             59REFFLD(NORE)
045600200529     A                                      SPACEA(3)
045700200529     A  41        ZCOUNT    R             59REFFLD(NORE)
045800200529     A                                      SPACEA(3)
045900200529     A  42        ZLIVP1    R             59REFFLD(NORE)
046000200529     A                                      SPACEA(3)
046100200529     A**
046200200529     A**   *******************
046300200529     A**   REPORT TRAILER
046400200529     A**   *******************
046500200529     A**
046600200529     A***                                            Begin /S01117/
046700200529     A**********R TRAILP1
046800200529     A***********                         56'*** END OF REPORT ***'
046900200529     A***********                           SPACEB(3)
047000200529     A***********
047100200529     A***********
047200200529     A          R TRAILP1                   SPACEB(1)
047300200529     A  35N36                             46'***  END OF REPORT FOR BRANCH '
047400200529     A  35N36     ZPBCA          3A       76TEXT('BRANCH CODE')
047500200529     A  35N36                             81'***'
047600200529     A  35 36                             56'*** END OF REPORT ***'
047700200529     A N35                                56'*** END OF REPORT ***'
047800200529     A**
047900200529     A**
048000200529     A**   *******************
048100200529     A**   REPORT DATABASE ERROR
048200200529     A**   *******************
048300200529     A**
048400200529     A          R ERRORP1
048500200529     A                                    25'**** DATABASE ERROR ****'
048600200529     A***********                                    BEGIN /E29170/
048700200529     A***********                           SPACEB(2)
048800200529     A***********                         11'************************'
048900200529     A***********                           SPACEB(2)
049000200529     A***********                         35'************************'
049100200529     A***********                         59'******'
049200200529     A***********                         11'*'
049300200529     A***********                           SPACEB(1)
049400200529     A***********                         64'*'
049500200529     A***********                         11'*    PROGRAM NAME '''
049600200529     A***********                           SPACEB(1)
049700200529     A*********** DBPGM         10A       30
049800200529     A***********                         40''''
049900200529     A***********                         64'*'
050000200529     A***********                         11'*    AT           '''
050100200529     A***********                           SPACEB(1)
050200200529     A*********** DBASE          3  0     30
050300200529     A***********                         33''''
050400200529     A***********                         64'*'
050500200529     A***********                         11'*'
050600200529     A***********                           SPACEB(1)
050700200529     A***********                         64'*'
050800200529     A***********                         11'************************'
050900200529     A***********                           SPACEB(1)
051000200529     A***********                         35'************************'
051100200529     A***********                         59'******'
051200200529     A***********
051300200529     A***                                            End   /S01117/
051400200529     A***********                                    END   /E29170/
