      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas SE Trade Settlements List')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Securities Trading Module
     A*                                                               *
     A*  PRTF/SE0330P1 - SE0330 TRADE SETTLEMENTS AUDIT LIST          *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. E35515             Date 10Feb92               *
      *                 E29170             Date 08Nov91               *
     A*                 E28705             DATE 24SEP91               *
     A*                 S01117             DATE 08MAY90               *
     A*                 S01176             DATE 21JUL88               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     A*  E35515 - Wrong branch printed out on overflow                *
     A*  E29170 - Report Control Facility changes                     *
     A*  E28705 - Space missing between literal 'DATE' and the date.  *
     A*  S01117 - MULITBRANCHING                                      *
     A*  S01176 - INCLUDE AUTO SETTLEMENTS TYPE ON REPORT             *
     A*                                                               *
     A*****************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A**
     A**   *******************
     A**   PAGE HEADINGS
     A**   *******************
     A**
     A          R HEADP1                    SKIPB(3)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A                                     6'REFERENCE SE0330P1'
     A            TITL      R             39
      *                                              Begin /E28705/
     A***********                        101'DATE'
     A                                   100'DATE'
      *                                              End   /E28705/
     A            RUNA      R            105
     A                                   119'PAGE'
     A            PAGE         004S 0    125EDTCDE(Z) SPACEA(2)
     A                                    12'SECURITIES TRADING'
     A                                    31'TRADE SETTLEMENTS AUDIT LIST -'
     A  40                                63'AUDIT - EXCEPTION'
     A  40                                81TIME
     A  41                                63'AUDIT'
     A  42                                63'FULL LIST'
     A***********                         90'BRANCH'                    /S01117/
     A*N80********SBCD      R             97                            /S01117/
     A**80********ZSBCD     R             97REFFLD(SBCD)                /S01117/
     A***********                        100'-'                         /S01117/
     A*********** ZBRNM     R            101REFFLD(BRNM)                /S01117/
     A***********                                                       /S01117/
     A  35                                93'BRANCH '
     A***********                                    Begin /E35515/
     A**35******* SBCA      R            100
     A  35        ZSBCA     R            100REFFLD(SBCA)
     A***********                                    End   /E35515/
     A  35                               103'-'
     A  35        ZBRNM     R            104REFFLD(BRNM)
     A***********                                                       /S01117/
     A***********                           SPACEA(1)                   /S01117/
     A***********                         12'-------------------'       /S01117/
     A***********                                                       /S01117/
     A                                    12'-------------------'   SPACEB(1)
     A***********                                                       /S01117/
     A                                    31'----------------------------'
     A                                      SPACEA(3)
     A                                     1'TRADE'
     A                                    10'TYP BK/'
     A                                    18'SECURITY DESCRIPTION/'
     A                                    67'NOMINAL/'
     A*                                                                   S01176
     A*                                   78'SETL'
     A                                    76'A.SETL'
     A*                                                                   S01176
     A                                    84'MOVT DATE'
     A                                    96'MKT TYPE'
     A                                   109'DISC'
     A                                   120'DISCREP'
     A                                      SPACEA(1)
     A                                     1'SETT.REF.'
     A                                    10'SEQ BR.'
     A                                    18'CLIENT'
     A                                    62'COUNTERVALUE'
     A                                    79'CCY'
     A                                    84'NARRATIVE'
     A                                   120'LAST ACTIVITY'
     A                                      SPACEA(1)
     A                                   120'DATE   TYPE'
     A**
     A**   *******************
     A**   DETAIL PART OF REPORT
     A**   *******************
     A**
     A          R DETAIL
     A                                       SPACEB(2)
     A            STDR      R              1
     A            STET      R             11
     A            SBOC      R             14
     A            RNME          41        18
     A            ZESNMS        16        60
     A*                                                                   S01176
     A            AUTS           1        79
     A*                                                                   S01176
     A            ZASEDE    R             84REFFLD(RUNA)
     A            SMKI      R             97
     A            LTYPE          7       100
     A            LSDSI          4       109
     A            ZESDAM        19       115
     A                                      SPACEA(1)
     A            SSRF      R              1
     A            SSQN      R             10
     A*********** SBCD      R             14                              S01117
     A************                                                      /S01117/
     A***********                                    Begin /E35515/
     A*********** SBCA      R             14
     A            ZSBCA     R             14REFFLD(SBCA)
     A***********                                    End   /E35515/
     A************                                                      /S01117/
     A            SCPN      R             18
     A            CRNMC     R             25REFFLD(CRNM)
     A            CTWNC     R             46REFFLD(CTWN)
     A            ZESVLS        19        60
     A            SSCY      R             79
     A            SNTV      R             84
     A            ZALCD     R            120REFFLD(RUNA)
     A  51                               128'AMD'
     A                                      SPACEA(1)
     A  52                               128'INS'
     A                                      SPACEA(1)
     A  53                               128'DEL'
     A                                      SPACEA(1)
     A  55        LSFSL         67        62
     A                                      SPACEA(1)
     A  56        LSNFS         67        62
     A                                      SPACEA(1)
     A**
     A**   *******************
     A**   TOTAL LINE
     A**   *******************
     A**
     A          R TOTAL
     A                                      SPACEB(3)
     A                                    17'TOTAL NUMBER OF TRADE SETTLEMENTS'
     A                                    51'LISTED-'
     A  40        ZCHGP1    R             59REFFLD(NORE)
     A                                      SPACEA(3)
     A  41        ZCOUNT    R             59REFFLD(NORE)
     A                                      SPACEA(3)
     A  42        ZLIVP1    R             59REFFLD(NORE)
     A                                      SPACEA(3)
     A**
     A**   *******************
     A**   REPORT TRAILER
     A**   *******************
     A**
     A          R TRAILP1
     A***********                         56'*** END OF REPORT ***'     /S01117/
     A***********                                                       /S01117/
     A  35                                46'***  END OF REPORT FOR BRANCH '
     A                                      SPACEB(3)
     A  35        ZSBCA          3A       76TEXT('BRANCH CODE')
     A  35                                81'***'
     A N35                                56'*** END OF REPORT ***'
     A***********                                                       /S01117/
     A                                      SPACEB(3)
     A***********                                    BEGIN /E29170/
     A***********                                                       /S01117/
     A***********
     A************************
     A*****NO*RECORDS**************************************************
     A************************
     A***********
     A**********R NONEP1
     A***********                         52'*** NO DETAILS TO REPORT ***'
     A***********                           SPACEB(3)
     A***********                                    END   /E29170/
     A**
     A**   *******************
     A**   REPORT DATABASE ERROR
     A**   *******************
     A**
     A          R ERRORP1
     A                                    25'**** DATABASE ERROR ****'
     A***********                                    BEGIN /E29170/
     A***********                           SPACEB(2)
     A***********                         11'************************'
     A***********                           SPACEB(2)
     A***********                         35'************************'
     A***********                         59'******'
     A***********                         11'*'
     A***********                           SPACEB(1)
     A***********                         64'*'
     A***********                         11'*    PROGRAM NAME '''
     A***********                           SPACEB(1)
     A*********** DBPGM         10A       30
     A***********                         40''''
     A***********                         64'*'
     A***********                         11'*    AT           '''
     A***********                           SPACEB(1)
     A*********** DBASE          3  0     30
     A***********                         33''''
     A***********                         64'*'
     A***********                         11'*'
     A***********                           SPACEB(1)
     A***********                         64'*'
     A***********                         11'************************'
     A***********                           SPACEB(1)
     A***********                         35'************************'
     A***********                         59'******'
     A***********
     A***********                                                       /S01117/
     A***********                                    END  /E29170/
