      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas SE Depot movements audit list')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Securities Trading Module                            *
     A*                                                               *
     A*  PRTF/SE0340P1 - SE0340 DEPOT MOVEMENTS AUDIT LIST            *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Prev Amend No. CSW208             Date 15Apr08               *
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 BUG10056           Date 24Jan06               *
      *                 CGL031             Date 05Jul04               *
      *                 CER001             Date 25Apr05               *
      *                 CGL029             Date 01Sep03               *
      * Midas Release 4.01.01 ----------------------------------------*
      *                 207006             Date 18Jun02               *
      * Midas Release 4.01 -------------------------------------------*
      *                 176702             Date 19Feb02               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 CSE028             Date 06Jun01               *
      *                 CSW201             Date 02May01               *
      *                 CSE016             Date 10Apr98               *
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CSE015             Date 06Dec99               *
      *                 CSE017             Date 21Oct99               *
      *                 CSE012             Date 16Aug99               *
      *                 CPB001             Date 21Jun99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CSW098             Date 02Jul98               *
     A*                 137011             Date 11Jun98               *
     A*                 CEU017             Date 03Mar98               *
     A*                 CSE007             Date 05Jan98               *
     A*                 S01408             Date 22Aug96               *
     A*                 CSW003             Date 15Jan96               *
     A*                 S01408             DATE 25AUG93               *
     A*                 S01496             DATE 15NOV94               *
     A*                 S01486             DATE 26OCT94               *
     A*                 S01445             DATE 29SEP93               *
     A*                 S01401             DATE 16JUN93               *
     A*                 E32517             DATE 17DEC91               *
     A*                 E29170             DATE 07NOV91               *
     A*                 E28705             DATE 24SEP91               *
     A*                 S01117             DATE 29MAY90               *
     A*                 S01176             DATE 16AUG88               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSW208 - SWIFT 2008 Changes                                  *
      *  BUG10056 - SEC0304 failed due to printer overflow error      *
      *             (Applied fix 230583)                              *
      *  CGL031 - Taxation on Savings Income                          *
      *  CER001 - LUX Upgrade to MidasPlus                            *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  207006 - Add Counterparty & Market Centre to SSI             *
      *  176702 - Records with change type 'T' shown as transfers.    *
      *  CSE028 - Standing Settlement Instructions Enhancement        *
      *  CSW201 - SWIFT 2001 Standards Update                         *
      *  CSE016 - Extended Security Descriptions                      *
     A*  CSE015 - Forward Valued Depot Movement                       *
     A*  CSE017 - Cum/Ex Indicator on Depot Movements                 *
     A*  CSE012 - SE Depot Movement Narratives                        *
     A*  CPB001 - Private Banking Module                              *
     A*  CSW098 - SWIFT 1998 changes.                                 *
     A*  137011 - Overprinting of Profit Center                       *
     A*  CEU017 - Securities Redenomination Euro Changes              *
     A*           Same coding than CSE007                             *
     A*  CSE007 - Corporate Actions                                   *
     A*  S01408 - Addition of core hook SE0340P107                    *
     A*         - Addition of core hook SE0340P106                    *
     A*         - Addition of core hook SE0340P105                    *
     A*         - Addition of core hook SE0340P104                    *
     A*         - Addition of core hook SE0340P103                    *
     A*         - Addition of core hook SE0340P102                    *
     A*  CSW003 - MT5XX Message Generation - Phase 2.                 *
     A*  S01408 - Addition of core hook SE0340P101                    *
     A*  S01496 - Incorporation of Jyske Enhancements (S10978)        *
     A*  S01486 - PORTFOLIO MANAGEMENT ENHANCEMENT                    *
     A*  S01445 - DEPOT MOVEMENT CHARGES ENHANCEMENT                  *
     A*           Fields and narrative added to show the Charge       *
     A*           Details if the switch S01445 is on.                 *
     A*  S01401 - A few extra lines added to the report for each item *
     A*           to print SWIFT fields if MT5xx Feature is present.  *
     A*  E32517 - Header produced at overflow uses wrong branch       *
     A*  E29170 - RCF changes                                         *
     A*  E28705 - Space missing between literal 'DATE' and the date.  *
     A*  S01117 - MULTIBRANCHING                                      *
     A*  S01176 - SECURITIES TRADING 3.1 (AUSTRALIA)                  *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A**
     A**   *******************
     A**   PAGE HEADINGS
     A**   *******************
     A**
     A          R HEADP1                    SKIPB(3)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A                                     6'REFERENCE SE0340P1'
     A            TITL      R             39
      *                                              Begin /E28705/
     A***********                        101'DATE'
     A                                   100'DATE'
      *                                              End   /E28705/
     A            RUNA      R            105
     A                                   119'PAGE'
     A            PAGE         004S 0    125EDTCDE(Z) SPACEA(2)
      *
     A                                    25'SECURITIES TRADING'
     A                                    45'DEPOT MOVEMENTS -'
     A  40                                63'AUDIT - EXCEPTION'
     A  40                                81TIME
     A  41                                63'AUDIT'
     A  42                                63'FULL LIST'
     A**                                             Begin /S01117/
     A***********                         90'BRANCH - '
     A*********** SVBR      R             99REFFLD(DPBC)
     A*********** ZBRNM     R            103REFFLD(BRNM)
     A***********                           SPACEA(1)
     A  35                                93'BRANCH '
     A***********                                    BEGIN /E32517/
     A**35******* DPBA      R            100
     A  35        SVBR      R            100REFFLD(DPBA)
     A***********                                    END   /E32517/
     A  35                               103'-'
     A  35        ZBRNM     R            104REFFLD(BRNM)
     A**                                             End   /S01117/
      *                                              Begin /S01401/
     A***********                         25'---------------------'
     A                                    25'--------------------'
      *                                              End   /S01401/
     A                                      SPACEB(1)
     A                                    45'---------------'
     A                                      SPACEA(3)
     A*
     A*                               /S01176/
     A                                   111'SWITCH'
     A*****                              113'LAST ACTIVITY'               S01176
     A                                   119'LAST ACTIVITY'
     A*                               /S01176/                            S01176
     A                                      SPACEA(1)
     A                                     2'SECURITY'
     A                                    14'REF'
     A                                    21'BK  ''IN'' DEPOT'
     A                                    43'''OUT'' DEPOT'
     A                                    61'CLIENT'
     A**                                             Begin /S01117/
     A  37                                67'/PROFIT C.'
     A**                                             End   /S01117/
     A                                    79'DATE-IN DATE-OUT'
     A                                    98'AMOUNT/PRICE'
     A*                               /S01176/
     A                                   113'REF'
     A*****                              113'DATE     TYPE'
     A                                   119'DATE     TYPE'
     A*                               /S01176/
     A                                      SPACEA(1)
     A                                     2'--------'
     A                                    14'---'
     A                                    21'--  ----------'
     A                                    43'-----------'
     A                                    61'------'
     A**                                             Begin /S01117/
     A  37                                67'----------'
     A**                                             End   /S01117/
     A                                    79'------- --------'
     A                                    98'------------'
     A*                               /S01176/
     A*****                              113'-------------'
     A                                   111'------'
     A                                   119'-------------'
     A*                               /S01176/
     A                                      SPACEA(3)
     A**
     A**   *******************
     A**   DETAIL PART OF REPORT
     A**   *******************
     A**
     A          R DETAIL
     A            SDPSS         10         2
     A            SDPRN          6        14
     A            SDPBK          2        21
     A            SDPID          6        25
     A            SDPIR         10        32
     A            SDPOD          6        43
     A            SDPOR         10        50
     A            SDPBN          6        61
     A            SDPBR         10        68
     A            SDPMD          7        79
     A            SDPDO          7        87
     A            SDPNA         16        96
     A*                               /S01176/
     A            SSWRF          3       112
     A  71                               116'IN'
     A  72                               116'OUT'
     A*****       SLCD           7       113
     A            SLCD           7       120
     A**51                               123'AMD'
     A  51                               129'AMD'
     A                                      SPACEA(1)
     A**52                               123'INS'
     A  52                               129'INS'
     A                                      SPACEA(1)
     A**53                               123'DEL'
     A  53                               129'DEL'
     A*                               /S01176/
     A                                      SPACEA(1)
      **Start of change 176702
     A  56                               129'TRN'
     A                                      SPACEA(1)
      **End of change 176702
     A*/COPY WNCPYSRC,SE0340P110
     A**Start of change CSE016
     A  38        SRNME         41         2SPACEA(1)
     A**End of change CSE016
     A**
     A                                     2'TYPE-'
     A*                                              Begin /S01496/
     A**60*******                          7'WALK IN       '
     A**61*******                          7'WALK OUT      '
     A  60                                 7'WALK IN  '
     A  61                                 7'WALK OUT '
     A  80 81                             16'REDEMP'
      *                                              Begin /CSE007/
     A**79*81                            121'BLOCK ERROR'
     A  79 82
     AO 79 81                            121'BLOCK ERROR'
     A*                                              End   /CSE007/
     A*                                              End   /S01496/
     A  62                                 7'DEPOT TRANSFER'
     A  63                                 7'BOND LENDING  '
     A  64                                 7'BOND BORROWING'
     A  65                                 7'REPO          '
     A  66                                 7'REVERSE REPO  '
     A  68                                 7'PLEDGED DEPOSIT'
     A  69                                 7'PLEDGED LOAN  '
     A                                    24'NARRATIVE-'
     A            SDPNR         35        34
      *                                     Start of change /137011/
     A**                                             Begin /S01117/
     A**37**      DPPC      R             61REFFLD(PRFC)
     A**                                             End   /S01117/
     A**67**                              70'ASSOC.DEAL-'
     A**67**      SDPAD          6        81
     A  37        DPPC      R             70REFFLD(PRFC)
     A*/COPY WNCPYSRC,SE0340P111
     A  67                                75'ASSOC.DEAL-'
     A*/COPY WNCPYSRC,SE0340P112
     A  67        SDPAD          6        86
      *                                       End of change /137011/
     A            SDMKP         17        94
      **Start of change CER001
     A                                      SPACEA(1)
      **End of change CER001
     A*                                              Begin /S01486/
     A*                                              Begin /CPB001/
     A**39*******                          2'PORTFOLIO REF.' SPACEB(1)
     A**39******* PTFR           4        17
     A  32
      **Start of change BUG10056
     A***O*39***                           2'PORTFOLIO REF.' SPACEB(1)                      BUG10056
     AO 39                                 2'PORTFOLIO REF.'
      **End of change BUG10056
     A  32
     AO 39        PTFR           4        17
     A*                                              End   /CPB001/
     A*/COPY WNCPYSRC,SE0340P108
     A**Start of change 207006
     A**39******                          61'Customer Withdrawal/Delivery'                    207006
     A**39******  CWDI           1        90                                                  207006
     A  39                                24'Customer Withdrawal/Delivery'
     A  39        CWDI           1        53
     A**End of change 207006
     A*                                              End   /S01486/
      *                                              Begin /CSE015/
     A**Start of change 207006
     A**73*60***                                                                              207006
     A**73*61***                          98'Trade Date-'                                     207006
     A**73*60***                                                                              207006
     A**73*61***  RDMTD          7       109                                                  207006
     A  73 60
     AO 73 61                             57'Trade Date-'
     A  73 60
     AO 73 61     RDMTD          7        69
      *
     A  33                                79'COUNTERPARTY'
     A  33        RCPTY          6        92
     A  33                               101'MARKET CENTRE'
     A  33        RMRKT          2       115
     A**End of change 207006
      *                                              End   /CSE015/
      *                                              Begin /S01401/
      *
     A*/COPY WNCPYSRC,SE0340P101                                          S01408
      **Start of change CER001
     A                                      SPACEA(1)
     A N50 25                              2'EXCESS COLLATERAL TREATMENT FLAG-'
     A N50 25     WNEXCF         1  0     36
     A  25                                57'OP. TYPE-'
     A  25        WNOPTP         3  0     67
     A  25 60
     AO 25 61                              2'Commisssariat aux Bourses :'
     A                                       SPACEB(001)
     A  25 60
     AO 25 61                             30'TRANSACTION TIME :'
     A  25 60
     AO 25 61     WNTIME         6  0     49TEXT('Time of Transaction')
      *
     A  25 60
     AO 25 61                             57'TO BE EXCLUDED IN CAB :'
     A  25 60
     AO 25 61     WNCABR         1        81TEXT('Excluded in CAB flag')
     A  25 60
     AO 25 61                             85'COUNTERPARTY NUMBER :'
     A  25 60
     AO 25 61     WNCNBR         6       108TEXT('Counterparty Number')
      **End of change CER001
      *                                              Begin /CSE012/
      *                                              Begin /CSE015/
     A***********                        132' '
     A  60
     AO 61                               132' '
      *                                              End   /CSE015/
     A                                      SPACEA(1)
     A  76 60
     AO 76 61                             24
     A                                      'NARRATIVE2-'
     A  76 60
     AO 76 61     SDPNR2        35        35
     A                                      SPACEA(1)
     A  76 60
     AO 76 61                             24
     A                                      'NARRATIVE3-'
     A  76 60
     AO 76 61     SDPNR3        35        35
     A                                      SPACEA(1)
     A  76 60
     AO 76 61                             24
     A                                      'NARRATIVE4-'
     A  76 60
     AO 76 61     SDPNR4        35        35
     A                                      SPACEA(1)
     A  76 60
     AO 76 61                             24
     A                                      'NARRATIVE5-'
     A  76 60
     AO 76 61     SDPNR5        35        35
      *                                              End   /CSE012/
      *                                              Begin /CSE017/
      *                                              Begin /CSE015/
     A***********                           SPACEA(1)
     A  75 60
     AO 75 61                               SPACEA(1)
      *                                              End   /CSE015/
     A  75 60
     AO 75 61                             72'PRINT ADVICE :'
     A  75 60
     AO 75 61     SDPAP          1        87
     A  75 60
     AO 75 61                             89'CUM/EX/FLAT :'
     A  75 60
     AO 75 61     SDPIN          1       103
      *                                              End   /CSE017/
      *
     A************                          SPACEA(2)
     A  24                               132' '
     A  24                                  SPACEA(1)
      *                                                    /S01445/
     A*N24********                       132' '
     A*N24********                          SPACEA(2)
     A*                                                           /Start S01408/
     A*/COPY WNCPYSRC,SE0340P102
     A*                                                           /End   S01408/
     A N24N74                            132' '
     A N24N74                               SPACEA(2)
     A*                                                           /Start S01408/
     A*/COPY WNCPYSRC,SE0340P103
     A*                                                           /End   S01408/
      *                                                    /S01445/
      *
      *                                              Start /CSW003/
     A**24********                         2'S.W.I.F.T. FIELDS :'
     A**24********                          SPACEA(1)
     A  24N20N21                           2'S.W.I.F.T. FIELDS :'
     A  24N20N21                            SPACEA(1)
     A  20                                 2'S.W.I.F.T. FIELDS FOR FROM DEPOT'
     A  20                                  SPACEA(1)
     A  21                                 2'S.W.I.F.T. FIELDS FOR START DATE'
     A  21                                  SPACEA(1)
     A  24 21
     AO 24 20                              2'TIME OF TRADE'
     A  24 21
     AO 24 20     RTRT1          4  0     27EDTWRD('  :  ')
     A  24 21
     AO 24 20                             44'REQUESTED PRIORITY'
     A  24 21
     AO 24 20     DPRPT1    R             72REFFLD(RPTY)
     A  24 21
     AO 24 20                             83'FUNGIBILITY CODE'
     A  24 21
     AO 24 20     DPFCO1    R            112REFFLD(M5FCOD)
     A  24 21
     AO 24 20                               SPACEA(1)
     A  24 21
     AO 24 20                              2'FREE OR AGAINST PAYMENT'
     A  24 21
     AO 24 20     DPFIN1    R             27REFFLD(M5FIND)
     A  24 21
     AO 24 20                             44'SENDER''S ROLE'
     A  24 21
     AO 24 20     DPSRO1    R             69REFFLD(SROL)
     A  24 21
     A**Start of Change CSE028
     A*O*24*20**                          83'CEDEL/EUROCLEAR A/C NO.'                         CSE028
     AO 24 20                             83'CLEARSTREAM/EUROCLEAR A/C'
     A**End of Change CSE028
     A  24 21
     AO 24 20     DPEUC1    R            109REFFLD(M5EUCL)
     A  24 20
     AO 24 21                               SPACEA(1)
     A*                                              Begin /CSW098/
     A  22 20 24
     A**Start of Change CSW201
     AAN26
     A*O*22*21*24                          2'STANDING INSTRUCTION OVERRIDE'                   CSW201
     AO 22 21 24
     AAN26                                 2'STANDING INSTRUCTION OVERRIDE'
     A**End of Change CSW201
     A  22 20 24
     A**Start of Change CSW201
     AAN26
     A*O*22*21*24  DPSIO1         1        34                                                 CSW201
     AO 22 21 24
     AAN26        DPSIO1         1        34
     A**End of Change CSW201
     A  22 20 24
     A**Start of Change CSW201
     AAN26
     A*O*22*21*24                           SPACEA(1)                                         CSW201
     AO 22 21 24
     AAN26                                  SPACEA(1)
     A**End of Change CSW201
     A*                                              End   /CSW098/
     A  20
     AO 21                                 2'PRICE'
     A  20
     AO 21        DPPRI1        16         8
     A  20
     AO 21                                26'EXCHANGE RATE'
     A  20
     AO 21        DPTDE1        21        40
     A  20
     AO 21                                63'ACCRUED INTEREST'
     A  20
     AO 21        DPITR1        21        80
     A  20
     AO 21                                  SPACEA(1)
     A  20                                 2'S.W.I.F.T. FIELDS FOR TO DEPOT'
     A  20                                  SPACEA(1)
     A  21                                 2'S.W.I.F.T. FIELDS FOR MATURITY DA-
     A                                      TE'
     A  21                                  SPACEA(1)
      *                                              End   /CSW003/
     A  24                                 2'TIME OF TRADE'
     A  24        RTRTT          4  0     27EDTWRD('  :  ')
     A  24                                44'REQUESTED PRIORITY'
     A  24        DPRPTY    R             72REFFLD(RPTY)
     A  24                                83'FUNGIBILITY CODE'
     A  24        DPFCOD    R            112REFFLD(M5FCOD)
     A  24                                  SPACEA(1)
     A** Start of change CSW208
     A  24 46                              2'SYSTEM OFFSET'
     A  24 46     RRSYOF         5        20
     A                                      SPACEA(1)
     A  24 46                              2'LOCAL:'
     A  24 46                             14'DATE'
     A  24 46     RRLCDT         7        26
     A  24 46                             36'TIME'
     A  24 46     RRLCTM         4  0     46EDTWRD('  :  ')
     A  24 46                             55'OFFSET'
     A  24 46     RRLCOF         5        67
     A                                      SPACEA(1)
     A  24 46                              2'MARKET:'
     A  24 46                             14'DATE'
     A  24 46     RRMKDT         7        26
     A  24 46                             36'TIME'
     A  24 46     RRMKTM         4  0     46EDTWRD('  :  ')
     A  24 46                             55'OFFSET'
     A  24 46     RRMKOF         5        67
     A                                      SPACEA(1)
     A** End of change CSW208
     A  24                                 2'FREE OR AGAINST PAYMENT'
     A  24        DPFIND    R             27REFFLD(M5FIND)
     A  24                                44'SENDER''S ROLE'
     A  24        DPSROL    R             69REFFLD(SROL)
     A**Start of Change CSE028
     A**24******                          83'CEDEL/EUROCLEAR A/C NO.'                         CSE028
     A  24                                83'CLEARSTREAM/EUROCLEAR A/C'
     A**End of Change CSE028
     A  24        DPEUCL    R            109REFFLD(M5EUCL)
      *                                              Begin /S01445/
     A**24**********                        SPACEA(2)
     A  24                                  SPACEA(1)
      *                                              End   /S01445/
      *                                              End   /S01401/
      *                                              Start /CSW003/
     A*                                              Begin /CSW098/
     A**Start of Change CSW201
     A**22*24***                           2'STANDING INSTRUCTION OVERRIDE'                   CSW201
     A**22*24***  DPSIOR         1        34                                                  CSW201
     A**22*24***                            SPACEA(1)                                         CSW201
     A  22 24N26                           2'STANDING INSTRUCTION OVERRIDE'
     A  22 24N26  DPSIOR         1        34
     A  22 24N26                            SPACEA(1)
     A**End of Change CSW201
     A*                                              End   /CSW098/
     A*                                                           /Start S01408/
     A*/COPY WNCPYSRC,SE0340P104
     A*                                                           /End   S01408/
     A  24N20N21                         132' '
     A                                      SPACEA(1)
     A  20
     AO 21                                 2'PRICE'
     A  20
     AO 21        DPPRI2        16         8
     A  20
     AO 21                                26'EXCHANGE RATE'
     A  20
     AO 21        DPTDE2        21        40
     A  20
     AO 21                                63'ACCRUED INTEREST'
     A  20
     AO 21        DPITR2        21        80
     A  20
     AO 21                                  SPACEA(2)
      *                                              End   /CSW003/
      *                                              Start /S01445/
     A*/COPY WNCPYSRC,SE0340P109
     A  74N24                            132' '
     A  74N24                               SPACEA(1)
     A  74                                 2'CHARGE DETAILS:'
     A  74                                  SPACEA(1)
     A*                                                           /Start S01408/
     A*/COPY WNCPYSRC,SE0340P105
     A*                                                           /End   S01408/
     A  74                                 2'CHARGE CODE'
     A  74        SDCHC          2        17
     A  74                                21'CURRENCY'
     A  74        SDCCE          3        30
     A  74                                36'AMOUNT'
     A  74        SDCHA         17        44
     A  74                                67'SETTLEMENT METHOD'
     A  74        SDCSE          2S 0     85
     A**Start of change CGL029
     A**74******                          98'BRANCH'                                          CGL029
     A**74******  SDCAB          3       105                                                  CGL029
     A**74******                         111'ACCOUNT'                                         CGL029
     A**74******  SDCAT         12       119                                                  CGL029
     A  74                                93'BRANCH'
     A  74        SDCAB          3       100
     A  74                               105'ACCOUNT'
     A  74        SDCAT         18       113
     A**End of change CGL029
     A  74                               132' '
     A*                                                           /Start S01408/
     A*/COPY WNCPYSRC,SE0340P106
     A*                                                           /End   S01408/
     A  74                                  SPACEA(2)
     A*                                                           /Start S01408/
     A*/COPY WNCPYSRC,SE0340P107
     A*                                                           /End   S01408/
      *                                              End   /S01445/
     A**Start of Change CGL031
     A  83                                 2'Fiscal Price :'
     A  83        RFSPR         17A       17
     A  83                                44'Original Purchase Date :'
     A  83        ROPDT          7A       69
     A  83                                83'Original Purchase Interest :'
     A  83        ROPIN         17A      112
     A  83                                  SPACEA(2)
     A**End of Change CGL031
     A
     A**
     A**   *******************
     A**   TOTAL LINE
     A**   *******************
     A**
     A          R TOTAL
     A                                      SPACEB(3)
     A                                    20'TOTAL NUMBER OF DEPOT MOVEMENTS'
     A                                    52'LISTED-'
     A  40        ZCHGP1    R             59REFFLD(NORE)
     A                                      SPACEA(3)
     A  41        ZCOUNT    R             59REFFLD(NORE)
     A                                      SPACEA(3)
     A  42        ZLIVP1    R             59REFFLD(NORE)
     A                                      SPACEA(3)
     A**
     A**   *******************
     A**   REPORT TRAILER
     A**   *******************
     A**
     A**                                             Begin /S01117/
     A**********R TRAILP1
     A***********                         56'*** END OF REPORT ***'
     A***********                           SPACEB(3)
     A***********
     A          R TRAILP1                   SPACEB(3)
     A  35                                46'***  END OF REPORT FOR BRANCH '
     A  35        SVBR           3A       76TEXT('BRANCH CODE')
     A  35                                81'***'
     A N35                                56'*** END OF REPORT ***'
     A**
     A**
     A*   ********************
     A*   *REPORT DATABASE ERROR
     A*   ********************
     A*
     A          R ERRORP1
     A                                    25'**** DATABASE ERROR ****'
     A*                                              Begin /E29170/
     A**********                            SPACEB(2)
     A**********                          11'************************'
     A**********                            SPACEB(2)
     A**********                          35'************************'
     A**********                          59'******'
     A**********                          11'*'
     A**********                            SPACEB(1)
     A**********                          64'*'
     A**********                          11'*    PROGRAM NAME '''
     A**********                            SPACEB(1)
     A**********  DBPGM         10A       30
     A**********                          40''''
     A**********                          64'*'
     A**********                          11'*    AT           '''
     A**********                            SPACEB(1)
     A**********  DBASE          3  0     30
     A**********                          33''''
     A**********                          64'*'
     A**********                          11'*'
     A**********                            SPACEB(1)
     A**********                          64'*'
     A**********                          11'************************'
     A**********                            SPACEB(1)
     A**********                          35'************************'
     A**********                          59'******'
     A**********
     A**                                             End   /S01117/
     A**                                             End   /E29170/
