      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas SE Position Settlements Overdue')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Securities Trading Module
     A*                                                               *
     A*  PRTF/SE0680P1  SE0680 POSITION SETTLEMENTS REPORT            *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 30Nov05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  Prev Amend No. S01486             Date 21Nov94               *
     A*                 S01512             Date 10Aug94               *
     A*                 051110             DATE 25NOV93               *
     A*                 E29170             DATE 07OCT91               *
     A*                 S01117             DATE 14MAY91               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*  S01486 - Incorporation of PM Enhancements (R05803)           *
     A*  S01512 - Add value date to Position Settlements              *
     A*  051110 - Changed to add Pay/Receive column.                  *
     A*  E29170 - RCF CHANGES                                         *
     A*  S01117 - MULTIBRANCHING                                      *
     A*                                                               *
     A*****************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
      *
     A                                      REF(TABTB10)
     A**
     A**   *******************
     A**   MAIN PAGE HEADINGS
     A**   *******************
     A**
     A          R HEAD1                     SKIPB(3)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A                                     6'REFERENCE SE0680P1'
     A            TITL      R             39
     A                                   101'DATE'
     A            RUNA      R            106
     A                                   119'PAGE'
     A            PAGE         004S 0    124EDTCDE(Z) SPACEA(2)
     A**
     A**   *******************
     A**     PAGE HEADINGS
     A**   *******************
     A**
     A                                    27'SECURITIES TRADING '
     A                                    46'POSITION SETTLEMENTS OVERDUE'
     A***********                                    BEGIN /E29170/
     A***********                         84'BRANCH'
     A**                                                   Begin /S01117/
     A*********** PBCH           3  0     91
     A*********** PBCA           3        91
     A**                                                    End  /S01117/
     A***********                         94'-'
     A*********** BRNM          30        95 SPACEA(1)
     A***********                         27'-------------------'
     A  37                                84'BRANCH'
     A  37                                91'-'
     A  37        PBCA           3        93
     A  37        BRNM          30       100
     A                                    27'-------------------' SPACEB(1)
     A***********                                    END   /E29170/
     A                                    46'----------------------------'
     A                                      SPACEA(2)
     A**
     A**   ***********************
     A**   SECONDARY PAGE HEADINGS
     A**   ***********************
     A**
     A
      *                                              Begin /S01512/
     A***********                          4'DUE'
     A***********                         25'CUSTOMER/DEPOT'
      *                                              Begin /051110/
     A***********                         70'EVENT'
     A***********                        105'DATE'
     A***********                         68'EVENT'
     A***********                         75'PAY/'
     A***********                        108'DATE'
      *                                              End   /051110/
     A***********                        119'DAYS' SPACEA(1)
      *
     A***********                          4'DATE'
     A***********                         13'SECURITY'
     A***********                         25'NUMBER  NAME'
     A***********                         57'TOWN'
      *                                              Begin /051110/
     A***********                         70'TYPE'
     A***********                         78'CCY'
     A***********                         92'AMOUNT'
     A***********                        105'GENERATED'
     A***********                         68'TYPE'
     A***********                         75'RECV'
     A***********                         81'CCY'
     A***********                         95'AMOUNT'
     A***********                        108'GENERATED'
      *                                              End   /051110/
     A***********                        119'OVERDUE'
     A                                     3'DUE'
     A  38                                12'VALUE'
     A                                    31'CUSTOMER/DEPOT'
     A***********                                    Begin /S01486/
     A***********                         74'EVENT'
     A***********                         81'PAY/'
     A                                    71'EVENT'
     A                                    77'PAY/'
     A                                    82'PORT-'
     A***********                                    End   /S01486/
     A                                   115'DATE'
     A                                   127'DAYS' SPACEA(1)
     A                                     3'DATE'
     A  38                                12'DATE'
     A                                    20'SECURITY'
     A                                    31'NUMBER  NAME'
     A                                    62'TOWN'
     A***********                                    Begin /S01486/
     A***********                         74'TYPE'
     A***********                         81'RECV'
     A                                    72'TYPE'
     A                                    77'RECV'
     A                                    82'FOLIO'
     A***********                                    End   /S01486/
     A                                    88'CCY'
     A                                   104'AMOUNT'
     A                                   113'GENERATED'
     A                                   126'OVERDUE'
      *                                              End   /S01512/
     A**
     A**
     A**   ****************
     A**   DETAIL OF REPORT
     A**   ****************
     A**
     A**
     A
     A          R DETAIL                    SPACEB(2)
      *                                              Begin /S01512/
     A*********** ODATE1         7         4
     A*********** PSSH          10        13
     A*********** PCPY           6  0     25
     A*********** CRNM          20        33
     A*********** CTWN          10        57
      *                                              Begin /051110/
     A*********** PEVT           2        71
     A*********** PNCY           3        78
     A*********** OAMT          18        83
     A*********** ODATE2         7       105
     A*********** PEVT           2        69
     A*********** PPRE           1        76
     A*********** PNCY           3        81
     A*********** OAMT          18        86
     A*********** ODATE2         7       108
      *                                              End   /051110/
     A*********** ODAYS          5  0    119EDTCDE(Z)
     A            ODATE1         7         2
     A  38        ODATE3         7        11
     A            PSSH          10        19
      * Begin /CSD027/
     A**********  PCPY           6  0     31                                                  CSD027
     A            PCPY           6A       31
      * End /CSD027/
     A            CRNM          20        38
     A            CTWN          10        61
     A***********                                    Begin /S01486/
     A*********** PEVT           2        75
     A*********** PPRE           1        83
     A            PEVT           2        73
     A            PPRE           1        79
     A  67        RRPTFR         4        82
     A***********                                    End   /S01486/
     A            PNCY           3        88
     A            OAMT          18        92
     A            ODATE2         7       114
     A            ODAYS          5  0    126EDTCDE(Z)
      *                                              End   /S01512/
     A**
     A**
     A**   *****************
     A**   TRAILER TO REPORT
     A**   *****************
     A**
     A**
     A          R TRAIL                     SPACEB(2)
     A***********                                    BEGIN /E29170/
     A***********                         55'*** END OF REPORT ***'
     A N37                                55'*** END OF REPORT ***'
     A  37                                50'*** END OF REPORT FOR'
     A  37                                72'BRANCH ***'
     A***********                                    END   /E29170/
