      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas SE Unrealized P/L analysis report')              *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Securities Trading Module
     A*                                                               *
     A*  PRTF/SE0915P1  SE0915 UNREALISED P & L ANALYSIS REPORT       *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      *  Last Amend No. 262179             Date 14Sep10               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSE092             Date 30Jan06               *
      *                 228948             Date 27Sep04               *
      *                 223999             Date 29Dec03               *
      *                 CAS006             Date 21Jan03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.03 -----------------------------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CAC005             Date 21Dec98               *
      *                 111158             Date 11Apr97               *
      *                 092158             Date 27Jun96               *
     A*                 S01408             DATE 10JAN96               *
     A*                 S01408             DATE 15SEP95               *
     A*                 E37493             DATE  1APR92               *
     A*                 E37178             DATE 20MAR92               *
     A*                 E29170             DATE 23OCT91               *
     A*                 S01117             DATE 07JUN91               *
     A*                 E20125             DATE 10NOV89               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  262179 - SE0915P1 Report Data are overprinted. Placed also a *
      *           SPACEA function if *IN66 is off.                    *
      *  CSE092 - Upgrade LBV026 to Midas Plus                        *
      *           Add Shortname to report                             *
      *  228948 - Add 'Exclude Accrued Interest in Unrealized Profit  *
      *           or Loss'.                                           *
      *  223999 - Include Event Date in Header                        *
      *  CAS006 - Hedge Accounting Phase B                            *
      *  CAC005 - Profit Centre Accounting - SE Enhancement           *
     A*  111158 - Billions trucated on nominal position               *
     A*  092158 - Report SE0915 does not show correct values for      *
     A*           branch and book at control break.                   *
     A*  S01408 - Addition of core hook SE0915P102                    *
     A*           Addition of core hook SE0915P103                    *
     A*           Addition of core hook SE0915P104                    *
     A*           Addition of core hook SE0915P105                    *
     A*           Addition of core hook SE0915P106                    *
     A*           Addition of core hook SE0915P107                    *
     A*  S01408 - Addition of core hook SE0915P101                    *
     A*  E37493 - Underlining in Single Branch Mode is wrong          *
     A*  E37178 - Did have non-standard blank line in heading         *
     F*  E29170 - Report Control Facility changes                     *
     F*  S01117 - MULTIBRANCHING                                      *
     A*  E20125 - Amount fields are too small - large figures were    *
     A*           being truncated. Moved amounts onto separate line   *
     A*           to the Security Report Name and all of the amounts  *
     A*           are now edited with commas. (CAR150)                *
     A*                                                               *
     A*****************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A**
     A**   *******************
     A**   MAIN PAGE HEADINGS
     A**   *******************
     A**
     A          R HEAD1                     SKIPB(3)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                     7'REFERENCE SE0915P1'
     A            TITL      R             37
     A                                   101'DATE'
     A            RUNA      R            106
     A                                   119'PAGE'
     A            PAGE         004S 0    124EDTCDE(Z) SPACEA(2)
     A  21                                 7'TRADE DATE'
     A N21                                 7'VALUE DATE'
      **Start of change 223999
     A**********                          30'SECURITIES TRADING'                              223999
     A**********                          49'UNREALISED PROFIT & LOSS'                        223999
     A**********                          74'ANALYSIS'                                        223999
     A N60                                30'SECURITIES TRADING'
     A N60                                49'UNREALISED PROFIT & LOSS'
     A N60                                74'ANALYSIS'
     A  60                                19'SECURITIES TRADING'
     A  60                                38'UNREALISED PROFIT & LOSS'
     A  60                                63'ANALYSIS'
     A  60                                72'AS OF'
     A  60        REVCD          7A       78TEXT('Event Control Date')
      **End of change 223999
     A***********                                    BEGIN /E29170/
     A***********                         89'BRANCH -'
     A*                                              Begin /S01117/
     A*********** URBR           3  0     98
     A*********** URBA           3        98
     A*                                              End   /S01117/
     A*********** BRNM          30       102SPACEA(2)
     A  42                                89'BRANCH -'
     A*                                              Start /092158/
     A**42*****   URBA           3        98
     A  42        @URBA          3        98
     A*                                              End   /092158/
     A  42        BRNM          30       102
     A***********                                    Begin /E37178/
     A***********                           SPACEA(2)
     A***********                                    Begin /E37493/
     A                                   132' '
     A***********                                    End   /E37493/
     A                                      SPACEA(1)
     A***********                                    End   /E37178/
     A***********                                    END   /E29170/
      **Start of change 223999
     A**********                          30'-------------------'                             223999
     A**********                          49'-------------------------'                       223999
     A**********                          74'--------' SPACEA(2)                              223999
     A N60                                30'-------------------'
     A N60                                49'-------------------------'
     A N60                                74'--------'
     A N60                                  SPACEA(2)
     A  60                                19'-------------------'
     A  60                                38'-------------------------'
     A  60                                63'----------------------'
     A  60                                  SPACEA(2)
      **End of change 223999
     A**
     A**   ***********************
     A**   SECONDARY PAGE HEADINGS
     A**   ***********************
     A**
     A          R HEAD2
     A                                     7'BOOK' SPACEB(1)
     A*                                              Start /092158/
     A*********   URBK           2        12
     A            @URBK          2        12
     A*                                              End   /092158/
     A                                    15'-'
     A N32        BOKD          30        17
     A                                    49'CURRENCY -'
     A            RCCY           3        60
     A                                    68'MARKET-'
     A  26                                75'GREY'
     A  27                                75'PRIMARY'
     A  28                                75'SECONDARY'
     A                                    88'INVESTMENT TYPE -'
     A            INVT           3       106
      *                                              Begin /CAC005/
     A*********** INAM          20       110SPACEA(2)
     A            INAM          20       110
     A  01                                 7'PROFIT CENTRE - '
     A                                      SPACEB(1)
     A  01        PRFC           4        23
     A  01        PRFN          30        29
     A                                   131' '
     A                                      SPACEA(2)
      *                                              End   /CAC005/
     A**
     A**   *******************
     A**   DETAIL HEADINGS
     A**   *******************
     A**
     A          R HEAD3
      *                                                    /E20125/
     A***********                         63'AVERAGE'
     A***********                         96'MARKET'
     A***********                        110'MARKET'
     A***********                        118'UNREALISED' SPACEA(1)
     A***********                         14'SECURITY'
     A***********                         47'NOMINAL'
     A***********                         64'PRICE'
     A***********                         76'BOOK COST'
     A***********                         96'PRICE'
     A***********                        110'VALUE'
     A***********                        118'PROFIT/LOSS' SPACEA(1)
     A***********                         14'--------'
     A***********                         47'-------'
     A***********                         64'-----'
     A***********                         76'---------'
     A***********                         96'-----'
     A***********                        110'-----'
     A***********                        118'-----------' SPACEA(2)
      *
     A*/COPY WNCPYSRC,SE0915P111
     A                                    37'AVERAGE'
     A                                    77'MARKET'
     A                                    99'MARKET'
     A                                   117'UNREALIZED' SPACEA(1)
     A*/COPY WNCPYSRC,SE0915P112
     A                                     5'SECURITY'
     A*/COPY WNCPYSRC,SE0915P113
     A*                                              Begin /111158/
     A**                                  20'NOMINAL'
     A                                    22'NOMINAL'
     A*                                              End /111158/
     A                                    38'PRICE'
     A                                    57'BOOK COST'
     A                                    77'PRICE'
     A                                    99'VALUE'
     A                                   117'PROFIT/LOSS' SPACEA(1)
     A                                     5'--------'
     A                                    20'-------'
     A                                    38'-----'
     A                                    57'---------'
     A                                    77'-----'
     A                                    99'-----'
     A                                   117'-----------' SPACEA(2)
      *                                                    /E20125/
      **Start of change CAS006
     A          R HEAD4
     A                                     3'SECURITY'
     A                                    45'SHORTNAME'
     A  21                                  SPACEA(1)
      **Start of change 228948
     A*N21*******                         70'ACCRUED INT'                 228948
     A*N21*******                           SPACEA(1)                     228948
     A N21 08                             70'ACCRUED INT'
      **End of change 228948
     A                                     3'--------'
      **Start of change 228948
     A N21                                  SPACEB(1)
      **End of change 228948
     A                                    45'---------'
     A  21                                  SPACEA(1)
      **Start of change 228948
     A*N21******                          70'-----------'                 228948
     A*N21******                            SPACEA(1)                     228948
     A N21 08                             70
     A                                      '-----------'
      **End of change 228948
     A                                    10'NOMINAL'
      **Start of change 228948
     A N21                                  SPACEB(001)
      **End of change 228948
     A                                    27'AVERAGE PRICE'
     A                                    51'BOOK COST'
     A                                    70'MARKET PRICE'
     A                                    90'MARKET VALUE'
     A                                   108'UNREALIZED PROFIT/LOSS'
     A                                      SPACEA(1)
     A                                    10'-------'
     A                                    27'-------------'
     A                                    51'---------'
     A                                    70'------------'
     A                                    90'------------'
     A                                   108'----------------------'
     A                                      SPACEA(2)
      **End of change CAS006
     A**
     A**   *******************
     A**   DETAIL LINE
     A**   *******************
     A**
      **Start of change CAS006
     A**********R DETAIL                                                                      CAS006
     A          R DETAIL1
      **End of change CAS006
     A*/COPY WNCPYSRC,SE0915P109
      **Start of change CSE092
     A  66        SESN          10         3
     A**********  SECNM         41         3                                                  CSE092
     A N66        SECNM         41         3
      **Start of change 262179
     A                                      SPACEA(1)
      **End of change 262179
     A  66        @SECNM        41        14
      **End of change CSE092
     A*/COPY WNCPYSRC,SE0915P110
      *                                                    /E20125/
     A                                      SPACEA(1)
     A*********** NPOUT         13        44
     A*********** APOUT         17        57
     A*********** BKOUT         13        75
     A*********** MPOUT         17        87
     A*********** MKOUT         13       104
     A*********** PLOUT         13       117SPACEA(1)
      *
     A*                                              Begin /S01408/
     A*/COPY WNCPYSRC,SE0915P101
     A*                                              End   /S01408/
     A*                                              Begin /111158/
     A***         NPOUT         16        14
     A*                                              End   /111158/
     A            APOUT         16        31
     A*                                              Begin /111158/
     A            NPOUT         21        12
     A*                                              End   /111158/
     A            BKOUT         21        48
     A            MPOUT         16        70
     A            MKOUT         21        87
     A            PLOUT         21       109SPACEA(1)
      *                                                    /E20125/
      **Start of change CAS006
     A          R DETAIL2
     A            SECNM         41         3
     A            SECSN         10        45
     A  21                                  SPACEA(1)
      **Start of change 228948
     A*N21******  AIOUT         21        68                              228948
     A*N21******                            SPACEA(1)                     228948
     A N21 08     AIOUT         21        68
      **End of change 228948
     A            NPOUT         21         3
      **Start of change 228948
     A N21                                  SPACEB(1)
      **End of change 228948
     A            APOUT         16        26
     A            BKOUT         21        45
     A            MPOUT         16        68
     A            MKOUT         21        86
     A            PLOUT         21       109
     A                                      SPACEA(1)
      **End of change CAS006
     A**
     A**   *******************
     A**   L1 TOTAL LINE
     A**   *******************
     A**
     A          R L1LIN
     A*                                              Begin /S01408/
     A*/COPY WNCPYSRC,SE0915P102
     A*                                              End   /S01408/
     A                                    55'INVESTMENT TYPE TOTAL -'
     A                                       SPACEB(1)
     A            INAM          20        79
     A*                                              Begin /S01408/
     A*/COPY WNCPYSRC,SE0915P103
     A*                                              End   /S01408/
     A            L1OUT         21       109SPACEA(1)
     A**
     A**   *******************
     A**   L2 TOTAL LINE
     A**   *******************
     A**
     A          R L2LIN
     A*                                              Begin /S01408/
     A*/COPY WNCPYSRC,SE0915P104
     A*                                              End   /S01408/
     A                                    55'MARKET TOTAL -' SPACEB(1)
     A  26                                70'GREY'
     A  27                                70'PRIMARY'
     A  28                                70'SECONDARY'
     A*                                              Begin /S01408/
     A*/COPY WNCPYSRC,SE0915P105
     A*                                              End   /S01408/
     A            L2OUT         21       109SPACEA(1)
     A**
     A**   *******************
     A**   L3 TOTAL LINE
     A**   *******************
     A**
     A          R L3LIN
     A*                                              Begin /S01408/
     A*/COPY WNCPYSRC,SE0915P106
     A*                                              End   /S01408/
     A                                    55'CURRENCY TOTAL -'
     A                                       SPACEB(1)
     A            RCCY           3        72
     A*                                              Begin /S01408/
     A*/COPY WNCPYSRC,SE0915P107
     A*                                              End   /S01408/
     A            L3OUT         21       109SPACEA(1)
     A*/COPY WNCPYSRC,SE0915P108
     A**
     A**   *******************
     A**   REPORT TRAILER
     A**   *******************
     A**
     A          R TRAIL
     A***********                                    Begin /E37493/
     A                                      SPACEB(3)
     A***********                                    End   /E37493/
     A***********                                    BEGIN /E29170/
     A***********                         55'*** END OF REPORT ***'
     A N42                                55'*** END OF REPORT ***'
     A  42                                50'*** END OF REPORT FOR'
     A***********                                    END   /E29170/
     A***********                                    Begin /E37493/
     A***********                           SPACEB(3)
     A***********                                    End   /E37493/
     A***********                                    BEGIN /E29170/
     A  42                                72'BRANCH ***'
     A***********                                    END   /E29170/
