      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_AU60                                                      *
/*EXI *  TEXT('Midas SE Split Todays acts by bok posn-Aud')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Securities Trading Module
     A*                                                               *
     A*  PRTF/SE2110AU  SE2110 RUN CONTROL REPORT                     *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. E37527             DATE 31MAR92               *
     A*  PREV AMEND NO. E29170             DATE 05NOV91               *
     A*                 S01117             DATE 06JUN91               *
     A*                 E21125             DATE 13FEB90               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
     A*  E37527 - Various Heading errors caused by overlapping fields.*
     A*           Redefined all headings correctly.                   *
     A*  E29170 - Report Control Facility changes                     *
     A*  S01117 - Multibranching                                      *
     A*  E21125 - AMEND NARRATIVE - 'BPACBD' APPEARS TWICE ON REPORT, *
     A*           'BPACCD' NOT AT ALL.                                *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
      *
     A                                      REF(TABTB10)
     A**
     A**   *******************
     A**   PAGE HEADINGS
     A**   *******************
     A**
     A          R HEADR                     SKIPB(3)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                     7'REFERENCE SE2110AU'
     A            TITL      R             37
     A                                   101'DATE'
     A            RUNA      R            106
     A                                   119'PAGE'
     A            PAGE         004S 0    124EDTCDE(Z) SPACEA(2)
      *                                              Begin /E37527/
     A***********                         35'SECURITIES TRADING '
     A***********                         54'SPLIT TODAY''S ACTIONS BY BOOK POS'
     A***********                         87'ITION  - RUN CONTROLS' SPACEA(1)
     A***********                         35'-------------------'
     A***********                         54'----------------------------------'
     A***********                         87'-----'
     A***********                           SPACEA(3)
      *
     A                                    35'SECURITIES TRADING SPLIT -
     A                                      TODAY''S ACTIONS BY BOOK -
     A                                      POSITION - RUN CONTROLS'
     A                                      SPACEA(1)
     A                                    35'--------------------------
     A                                      --------------------------
     A                                      --------'
     A                                      SPACEA(3)
      *                                              End   /E37527/
     A**
     A**   *******************
     A**   CONTROL REPORT
     A**   *******************
     A**
     A          R CONTROL
     A                                    60'FILE CONTROL' SPACEB(3)
     A                                    93'CALCULATED  ' SPACEA(3)
      *                                              Begin /E37527/
     A***********                          6'FILE - SECURITY ACTIONS - '
     A***********                         35'PF/SECACD'  SPACEA(1)
     A***********                          6'------------------------------'
     A***********                         35'---------' SPACEA(2)
      *
     A                                     6'FILE - SECURITY ACTIONS -
     A                                      - PF/SECACD'
     A                                      SPACEA(1)
     A                                     6'-------------------------
     A                                      -----------'
     A                                      SPACEA(2)
      *                                              End   /E37527/
     A                                    10'NO. OF RECORDS '
     A            SNORE          5  0     65EDTCDE(3)
     A  57                               112'*** DIFFERENCE ***'
     A            ISEC           5  0     98EDTCDE(3) SPACEA(3)
     A*
      *                                              Begin /E37527/
     A***********                          6'FILE - TRADE    ACTIONS - '
     A***********                         35'PF/TRDACD'  SPACEA(1)
     A***********                          6'------------------------------'
     A***********                         35'---------' SPACEA(2)
      *
     A                                     6'FILE - TRADE ACTIONS -
     A                                      - PF/TRDACD'
     A                                      SPACEA(1)
     A                                     6'----------------------
     A                                      -----------'
     A                                      SPACEA(2)
      *                                              End   /E37527/
     A                                    10'NO. OF RECORDS '
     A                                    25'FOR TRADE DATE '
     A            NORT           5  0     65EDTCDE(3)
     A  58                               112'*** DIFFERENCE ***'
     A            ITRDT          5  0     98EDTCDE(3) SPACEA(1)
     A                                    10'NO. OF RECORDS '
     A                                    25'FOR VALUE DATE '
     A            NRDT           5  0     65EDTCDE(3)
     A  59                               112'*** DIFFERENCE ***'
     A            ITRDV          5  0     98EDTCDE(3) SPACEA(3)
     A*
      *                                              Begin /E37527/
     A***********                          6'FILE - PRICES (UPDATE)  - '
     A***********                         35'PF/PRICED'  SPACEA(1)
     A***********                          6'------------------------------'
     A***********                         35'---------' SPACEA(2)
      *
     A                                     6'FILE - PRICES (UPDATE) -
     A                                      - PF/PRICED'
     A                                      SPACEA(1)
     A                                     6'------------------------
     A                                      -----------'
     A                                      SPACEA(2)
      *                                              End   /E37527/
     A                                    10'NO. OF RECORDS '
     A            PNORE          5  0     65EDTCDE(3)
     A  60                               112'*** DIFFERENCE ***'
     A            IPRI           5  0     98EDTCDE(3) SPACEA(1)
     A                                    10'NO. OF RECORDS UPDATED'
     A            UPRI           5  0     98EDTCDE(3) SPACEA(3)
     A*
      *                                              Begin /E37527/
     A***********                          6'FILE - BOOK POSITION ACTIONS B/V'
     A***********                         38' - PF/BPACBD' SPACEA(1)
     A***********                          6'--------------------------------'
     A***********                         38'------------' SPACEA(2)
      *
     A                                     6'FILE - BOOK POSITION ACTIONS -
     A                                      B/V - PF/BPACBD'
     A                                      SPACEA(1)
     A                                     6'------------------------------
     A                                      ---------------'
     A                                      SPACEA(2)
      *                                              End   /E37527/
     A                                    10'NO. OF RECORDS WRITTEN'
     A            OACB           5  0     98EDTCDE(3) SPACEA(3)
     A*
      *                                              Begin /E37527/
     A***********                          6'FILE - BOOK POSITION ACTIONS'
      ***                                            Begin /E21125/
     A***************               34' CURRENT - PF/BPACBD' SPACEA(1)
     A***********                         34' CURRENT - PF/BPACCD' SPACEA(1)
      ***                                            End   /E21125/
     A***********                          6'----------------------------'
     A***********                         34'--------------------' SPACEA(2)
      *
     A                                     6'FILE - BOOK POSITION ACTIONS -
     A                                      CURRENT - PF/BPACCD'
     A                                      SPACEA(1)
     A                                     6'------------------------------
     A                                      -------------------'
     A                                      SPACEA(2)
      *                                              End   /E37527/
     A                                    10'NO. OF RECORDS WRITTEN'
     A            OACC           5  0     98EDTCDE(3) SPACEA(3)
     A**
     A***********                                    BEGIN /E29170/
     A************************
     A*****NO*RECORDS*********
     A************************
     A**********
     A**********R NONE
     A**********                          52'*** NO DETAILS TO REPORT ***'
     A**********                            SPACEB(3)
     A************************
     A*****REPORT*TRAILER**********************************************
     A************************
     A***********
     A**********R TRAIL
     A***********                         55'*** END OF REPORT ***'
     A***********                           SPACEB(3)
     A***********                                    END   /E29170/
     A**
     A**   *******************
     A**   REPORT DATABASE ERROR
     A**   *******************
     A**
     A          R ERROR
     A                                    25'**** DATABASE ERROR ****'
     A                                      SPACEB(2)
     A                                    11'************************'
     A                                      SPACEB(2)
     A                                    35'************************'
     A                                    59'******'
     A                                    11'*'
     A                                      SPACEB(1)
     A                                    64'*'
     A                                    11'*    FILE NAME    '''
     A                                      SPACEB(1)
     A**                                                   Begin /S01117/
     A*********** DBFILE         5        30
     A***********                         35''''
     A            DBFILE         8        30
     A                                    38''''
     A**                                                    End  /S01117/
     A                                    64'*'
     A                                    11'*    KEY          '''
     A                                      SPACEB(1)
     A            DBKEY         29        30
     A                                    59 '''    *'
     A                                    11'*    PROGRAM NAME '''
     A                                      SPACEB(1)
     A**                                                   Begin /S01117/
     A*********** DBPGM          8        30
     A***********                         38''''
     A            DBPGM         10        30
     A                                    40''''
     A**                                                    End  /S01117/
     A                                    64'*'
     A                                    11'*    AT           '''
     A                                      SPACEB(1)
     A**                                                   Begin /S01117/
     A*********** DBASE          2  0     30
     A***********                         32''''
     A**87*******                         34''''
     A**87******* DBSTAT         5        35
     A**87*******                         40''''
     A            DBASE          3  0     30
     A                                    33''''
     A  87                                35''''
     A  87        DBSTAT         5        36
     A  87                                41''''
     A**                                                    End  /S01117/
     A                                    64'*'
     A                                    11'*'
     A                                      SPACEB(1)
     A                                    64'*'
     A                                    11'************************'
     A                                      SPACEB(1)
     A                                    35'************************'
     A                                    59'******'
