      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_AU60                                                      *
/*EXI *  TEXT('Midas SE Generate Pos. settlement A/c keys')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Securities Trading Module
     A*                                                               *
     A*    PRTF/SE2300AU  SE2300 RUN CONTROL REPORT                   *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*    LAST AMEND NO. S01117   DATE 22JAN91                       *
     A*    PREV AMEND NO. E14884   DATE 08/09/88                      *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*    S01117  -  MULTI-BRANCHING                                 *
     A*    E14884  -  NO. OF MATURED RECORDS ON POSETD NOW SHOWN      *
     A*                                                               *
     A*****************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
      *                                      Begin /S01117/
     A***********                           REF(TABTB10)
      *                                      End   /S01117/
     A**
     A**   *******************
     A**   PAGE HEADINGS
     A**   *******************
     A**
     A          R HEADR                     SKIPB(3)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                     7'REFERENCE SE2300AU'
      *                                      Begin /S01117/
     A*********** TITL      R             37
     A            TITL          53A       37
      *                                      End   /S01117/
     A                                   101'DATE'
      *                                      Begin /S01117/
     A*********** RUNA      R            106
     A            RUNA           7A      106
      *                                      End   /S01117/
     A                                   119'PAGE'
     A            PAGE         004S 0    124EDTCDE(Z) SPACEA(2)
     A                                    34'SECURITIES TRADING '
     A                                    53'GENERATE A/C KEYS - POSITION SETTL'
      *                                      Begin /S01117/
     A***********                         87'EMENTS - RUN CONTROLS' SPACEA(1)
     A                                    87'EMENTS    RUN CONTROLS' SPACEA(1)
      *                                      End   /S01117/
     A                                    34'-------------------'
     A                                    53'----------------------------------'
     A                                    87'------'
     A                                      SPACEA(3)
     A**
     A**   *******************
     A**   CONTROL REPORT
     A**   *******************
     A**
     A          R CONTROL
     A                                    60'FILE CONTROL' SPACEB(3)
     A                                    91'CALCULATED  ' SPACEA(2)
     A                                    53'NUMBER'
     A                                    74'VALUE'
     A                                    82'NUMBER'
     A                                   103'VALUE' SPACEA(3)
     A                                     6'FILE - POSITION SETTLEMENTS - '
     A                                    35' PF/POSETD'  SPACEA(1)
     A                                     6'------------------------------'
     A                                    35'----------' SPACEA(3)
     A                                    10'NO. OF RECORDS '
     A*                                                   /E14884/
     A************NORE           5  0     54EDTCDE(3)
     A            ONORE          5  0     54EDTCDE(3)
     A*                                                   /E14884/
     A  57                               112'*** DIFFERENCE ***'
     A            IREC           5  0     83EDTCDE(3) SPACEA(3)
     A                                    10'NO. OF AUTHORISED RECORDS'
     A            AREC           5  0     83EDTCDE(3) SPACEA(3)
     A*                                                   /E14884/
     A                                    10'NO. OF MATURED RECORDS'
     A            MREC           5  0     83EDTCDE(3) SPACEA(3)
     A                                    10'NEW NO. OF RECORDS'
     A            NORE           5  0     83EDTCDE(3) SPACEA(3)
     A*                                                   /E14884/
     A                                     6'FILE - GENERATED ACCOUNT KEYS'
     A                                    35' - PF/SEKEYD' SPACEA(1)
     A                                     6'-----------------------------'
     A                                    35'------------' SPACEA(3)
     A                                    10'NO. OF RECORDS WRITTEN'
     A            OREC           5  0     83EDTCDE(3) SPACEA(3)
     A                                    10'HASH TOTAL OF EVENT AMOUNTS'
     A            OHASH1        15  0     93EDTCDE(3)
     A            OHASH2         3  0    108SPACEA(3)
     A**
      *                                      Begin /S01117/
     A************************
     A*****NO*RECORDS*********
     A************************
     A************************
     A**********R*NONE********
     A************************            52'*** NO DETAILS TO REPORT ***'
     A************************              SPACEB(3)
     A************************
     A************************
     A*****REPORT*TRAILER*****
     A************************
     A************************
     A**********R*TRAIL*******
     A************************            55'*** END OF REPORT ***'
     A************************              SPACEB(3)
      *                                      End   /S01117/
     A**
     A**   *******************
     A**   REPORT DATABASE ERROR
     A**   *******************
     A**
     A          R ERROR
     A                                    25'**** DATABASE ERROR ****'
     A                                      SPACEB(2)
     A                                    11'************************'
     A                                      SPACEB(2)
     A                                    35'************************'
     A                                    59'******'
     A                                    11'*'
     A                                      SPACEB(1)
     A                                    64'*'
     A                                    11'*    FILE NAME    '''
     A                                      SPACEB(1)
      *                                      Begin /S01117/
     A*********** DBFILE         5        30
     A***********                         35''''
     A            DBFILE         8        30
     A                                    38''''
      *                                      End   /S01117/
     A                                    64'*'
     A                                    11'*    KEY          '''
     A                                      SPACEB(1)
     A            DBKEY         29        30
     A                                    59 '''    *'
     A                                    11'*    PROGRAM NAME '''
     A                                      SPACEB(1)
      *                                      Begin /S01117/
     A*********** DBPGM          8        30
     A***********                         38''''
     A            DBPGM         10        30
     A                                    40''''
      *                                      End   /S01117/
     A                                    64'*'
     A                                    11'*    AT           '''
     A                                      SPACEB(1)
      *                                      Begin /S01117/
     A*********** DBASE          2  0     30
     A***********                         32''''
     A            DBASE          3  0     30
     A                                    33''''
      *                                      End   /S01117/
     A  87                                34''''
     A  87        DBSTAT         5        35
     A  87                                40''''
     A                                    64'*'
     A                                    11'*'
     A                                      SPACEB(1)
     A                                    64'*'
     A                                    11'************************'
     A                                      SPACEB(1)
     A                                    35'************************'
     A                                    59'******'
