      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_AU60                                                      *
/*EXI *  TEXT('Midas SE Gen a/c keys - Cont Liab at Mat')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Securities Trading Module
     A*                                                               *
     A*    PRTF/SE2420AU  SE2420 RUN CONTROL REPORT                   *
     A*                                                               *
     A*  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*    PREV AMEND NO. E35627   DATE 24FEB92                       *
     A*                   E29170   DATE 07NOV91                       *
     A*                   S01117   DATE 31MAY91                       *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
     A*    MD046248 - Finastra Rebranding                             *
     A*    E35627  -  Need a space between DATE and the date          *
     A*    E29170  -  Report Control Facility changes                 *
     A*    S01117  -  MULTI-BRANCHING                                 *
     A*                                                               *
     A*****************************************************************
     A*
     A*****************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A**
     A**   *******************
     A**   PAGE HEADINGS
     A**   *******************
     A**
     A          R HEADAU                    SKIPB(3)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A                                     6'REFERENCE SE2420AU'
     A            TITL      R             39
     A                                   101'DATE'
     A***********                                    Begin /E35627/
     A*********** RUNA      R            105
     A            RUNA      R            106
     A***********                                    End   /E35627/
     A                                   119'PAGE'
     A            PAGE1        004S 0    125EDTCDE(Z) SPACEA(2)
      *
     A                                    24'SECURITIES TRADING'
     A                                    43'CONTINGENT LIABILITIES AT MATURITY-
     A                                       A/C KEY GENERATION -'
     A                                    99'AUDIT'
     A                                   105'- RUN CONTROLS'   SPACEA(1)
     A                                    24'-------------------'
     A                                    43'-----------------------------------
     A                                      -------------------'
     A                                      SPACEA(3)
     A          R DETLAU                    SPACEB(3)
     A                                    60'FILE CONTROL'
     A                                    91'CALCULATED' SPACEA(2)
     A                                    53'NUMBER'
     A                                    74'VALUE   NUMBER'
     A                                   103'VALUE' SPACEA(2)
     A                                     6'FILE - MATURITY RECORDS ONLY - PF/-
     A                                      SECACD'
     A                                     6SPACEB(1) '-------------------------
     A                                      ----------------' SPACEA(2)
     A                                    17'NO. OF RECORDS'
     A            MTRRD          5  0     83EDTCDE(3) SPACEA(3)
     A                                     6'FILE - CONTINGENT LIABILITIES - PF-
     A                                      /CLIABD' SPACEA(1)
     A                                     6'-----------------------------------
     A                                      -------' SPACEA(2)
     A                                    17'NO. OF RECORDS'
     A            CLRNO          5  0     54EDTCDE(3) SPACEA(2)
     A                                    17'NO. OF RECORDS DELETED'
     A            CLDEL          5  0     83EDTCDE(3) SPACEA(2)
     A                                    17'NEW NO. OF RECORDS'
     A            CLNEW          5  0     83EDTCDE(3) SPACEA(3)
     A                                     6'FILE - GENERATED ACCOUNT KEYS - PF-
     A                                      /SEKEYD' SPACEA(1)
     A                                     6'-----------------------------------
     A                                      -------' SPACEA(2)
     A                                    17'NO. OF RECORDS WRITTEN'
     A            NORECS         5  0     83EDTCDE(3)
     A            HSHINT        15  0     90EDTCDE(3)
     A            HSHDEC         3  0    105SPACEA(2)
     A***********                                    BEGIN  /E29170/
     A************************
     A*****REPORT*TRAILER**********************************************
     A************************
     A***********
     A**********R TRAILAU
     A***********                         56'*** END OF REPORT ***'
     A***********                           SPACEB(3)
     A***********                                    END    /E29170/
     A**
     A**   *******************
     A**   REPORT DATABASE ERROR
     A**   *******************
     A**
     A          R ERROR
     A                                    25'**** DATABASE ERROR ****'
     A                                      SPACEB(2)
     A                                    11'************************'
     A                                      SPACEB(2)
     A                                    35'************************'
     A                                    59'******'
     A                                    11'*'
     A                                      SPACEB(1)
     A                                    64'*'
     A                                    11'*    FILE NAME    '''
     A                                      SPACEB(1)
      *                                      Begin /S01117/
     A*********** DBFILE         5        30
     A***********                         35''''
     A            DBFILE         8        30
     A                                    38''''
      *                                      End   /S01117/
     A                                    64'*'
     A                                    11'*    KEY          '''
     A                                      SPACEB(1)
     A            DBKEY         29        30
     A                                    59 '''    *'
     A                                    11'*    PROGRAM NAME '''
     A                                      SPACEB(1)
      *                                      Begin /S01117/
     A*********** DBPGM          8        30
     A***********                         38''''
     A            DBPGM         10        30
     A                                    40''''
      *                                      End   /S01117/
     A                                    64'*'
     A                                    11'*    AT           '''
     A                                      SPACEB(1)
      *                                      Begin /S01117/
     A*********** DBASE          2        30
     A***********                         32''''
     A            DBASE          3  0     30
     A                                    33''''
      *                                      End   /S01117/
     A                                    64'*'
     A                                    11'*'
     A                                      SPACEB(1)
     A                                    64'*'
     A                                    11'************************'
     A                                      SPACEB(1)
     A                                    35'************************'
     A                                    59'******'
