      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas SE Missing book position headers')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Securities Trading Module
     A*                                                               *
     A*  PRTF/SE2670P1  MISSING BOOK POSITION HEADERS                 *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CAC005             Date 15Dec98               *
      *                 S01117             Date 10Jun91               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CAC005 - PCA-SE Enhancement.                                 *
     A*    S01117 - Multi-Branching                                   *
     A*                                                               *
     A*****************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(TABTB10)
     A**
     A**   *******************
     A**   MAIN PAGE HEADINGS
     A**   *******************
     A**
     A          R HEADS                     SKIPB(3)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A                                     6'REFERENCE SE2670P1'
     A            TITL      R             39
     A                                   101'DATE'
     A            RUNA      R            106
     A                                   119'PAGE'
     A            PAGE         004S 0    124EDTCDE(Z) SPACEA(3)
     A**
     A**   *******************
     A**     PAGE HEADINGS
     A**   *******************
     A**
     A                                    41'SECURITIES TRADING'
     A                                    60'BOOK POSITIONS WITHOUT'
     A                                    83'HEADERS'          SPACEA(1)
     A                                    41'------------------'
     A                                    59'----------------------'
     A                                    81'--------'         SPACEA(3)
     A**
     A**   ***********************
     A**   SECONDARY PAGE HEADINGS
     A**   ***********************
     A**
     A          R HEADS2                    SPACEB(3)
     A                                     3'SECURITY'
     A                                    12'BRANCH'
      *                                              Begin /CAC005/
     A***********                         19'BOOK'
     A                                    19'BK'
     A  68                                22'PCTR'
     A***********                         24'MARKET'
     A                                    27'MKT'
      *                                              End   /CAC005/
     A                                    31'TRADE/VALUE'
     A                                    43'POSITION'
     A                                    53'NOMINAL POSITION'
     A                                    73'EX-COUPON NOMINAL'
     A                                    96'AVERAGE PRICE'
     A                                   117'PURCHASED'
     A**
     A          R HEADS3                    SPACEB(1)
     A                                    34'DATE'
     A                                    45'DATE'
     A                                    77'POSITION'
     A                                    98'NUMERATOR'
     A                                   118'INTEREST'
     A**   *****************
     A**   DETAIL  OF REPORT
     A**   *****************
     A**
     A          R DETAIL                    SPACEB(2)
     A            PRSC          10         2
     A*                                      Begin /S01117/
     A*********** PRBR           3        14
     A            PRBA           3        14
     A*                                      End   /S01117/
      *                                              Begin /CAC005/
     A*********** PRBK           2        20
     A            PRBK           2        19
     A  68        PRFC           4        22
     A*********** MRKT           1        26
     A            MRKT           1        28
      *                                              End   /CAC005/
     A            PRTV           5        33
     A            PRPD           7        43
     A            PRNOM         20        51
     A            PREX          20        72
     A            PRAVP         20        93
     A            PRPI          18       114
     A**   *******************
     A**   REPORT TRAILER
     A**   *******************
     A**
     A          R TRAILER
     A                                    56'*** END OF REPORT ***'
     A                                      SPACEB(3)
     A**
     A**   **********************
     A**   NO DETAILS TO REPORT
     A**   **********************
     A**
     A          R NONE                      SPACEB(3)
     A                                    52'*** NO DETAILS TO REPORT ***'
     A                                    55'*** END OF REPORT ***' SPACEB(3)
