      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas SE Trades Awaiting Completion')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Securities Trading Module.                       *
     A*                                                               *
     A*  PRTF/SE5220P1 - Pool Trades Awaiting Completion.             *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 30Nov05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 S01486 MD          Date 08Nov94               *
     A*                 058886             Date 17Jul93               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*  S01486 - Private Banking Upgrade to Release 10.              *
     A*  058886 - RENAME OBJECT PM5120P1 TO SE5220P1                  *
     A*                                                               *
     A*****************************************************************
     A*                                                                  *
     A********************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
      *                                              Begin /S01486/
     A***********                           REF(TABTB10)
     A                                      REF(MFRFL)
      *                                              End   /S01486/
     A**
     A**   *******************
     A**   PAGE HEADINGS
     A**   *******************
     A**
     A          R HEAD1                     TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A***START 58886 ***
     A***                                  6'REFERENCE PM5120P1'
     A                                     6'REFERENCE SE5220P1'
     A***END 58886 ***
     A            TITL      R             39
     A                                   101'DATE'
     A            RUNA      R            106
     A                                   119'PAGE'
      *                                              Begin /S01486/
     A*********** PAGE         004S 0    125EDTCDE(Z) SPACEA(2)
     A                                   124PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(1)
      *
     A                                   101'TIME'
     A                                   106TIME
     A                                      EDTWRD('  :  :  ')
     A                                      SPACEA(1)
      *
     A                                    30'SECURITIES TRADING POOL TRADES AWA-
     A                                      ITING COMPLETION'
      *
     A  36                                89'CONSOLIDATED'
      *
     A                                   132' '
     A                                      SPACEA(1)
     A                                    46'-----------------------------------
     A                                      ----'
     A                                      SPACEA(2)
      *
     A************                        33'SECURITIES TRADING POOL TRADES AWA-
     A************                          ITING COMPLETION'
     A************                        87'BRANCH -'
     A************TDBR           3  0     96
     A*********** BRNM          30       100SPACEA(1)
     A***********                         25'-----------------------------------
     A***********                           ----------------' SPACEA(2)
      *                                              End   /S01486/
     A                                     6'SECURITY'
     A                                    20'VALUE'
     A                                    33'POOL '
     A                                    39'TYPE'
     A                                    45'BK'
     A                                    53'TRADE DATE'
     A                                    69'CLIENT'
     A                                    77'PORTFOLIO'
     A                                    87'CCY'
     A                                    99'PRICE'
     A                                   120'NOMINAL' SPACEA(1)
     A                                    21'DATE'
      *                                              Begin /S01486/
     A***********                         34'REF'  SPACEA(2)
     A                                    34'REF'
     A                                    85'BRANCH    CODE / NAME '
     A                                      SPACEA(2)
      *                                              End   /S01486/
     A*
     A* ****************
     A* DETAIL OF REPORT
     A* ****************
     A*
     A          R DETAIL
     A N71                                  SPACEB(1)
     A N71        TDSS          10         6 SPACEA(2)
     A            ODATE1         7        19
     A            BLKR           6        32
     A            TDTP           2        40
     A            TDBK           2        45
     A            ODATE2         7        55
     A N41        CSNM          10        67
      * Begin /CSD027/
     A**41******  PCNU           6  0     71                                                  CSD027
     A  41        PCNU           6A       71
      * End /CSD027/
     A            PTFR           4        80
     A            NMCY           3        87
     A            PRICE         20        90
     A            OUTNOM        20       112 SPACEA(1)
      *                                              Begin /S01486/
     A            TDBR           3        96
     A            BRNM          30       100
     A                                      SPACEB(1)
     A**
     A**********************
     A***NO*RECORDS
     A**********************
     A************
     A**********R*NONE1
     A************                        52'*** NO DETAILS TO REPORT ***'
     A************                          SPACEB(3)
      *                                              End   /S01486/
     A**
     A**
     A*
     A*  *****************
     A*  TRAILER TO REPORT
     A*  *****************
     A*
     A          R TRAIL                     SPACEB(2)
      *                                              Begin /S01486/
     A***********                         55'*** END OF REPORT ***'
     A                                    51'*** END OF REPORT ***'
      *                                              End   /S01486/
