      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas Missing Custody Fees Report')
     A********************************************************************
     A*                                                                  *
     A*    Midas SAFE CUSTODY FEES MODULE                                *
     A*                                                                  *
     A*    PRTF/SE6280P1 MISSING CUSTODY FEES REPORT                     *
     A*                                                                  *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                                  *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. 091522             Date 24Aug95               *
      *                 S01464             Date 04Apr94               *
     A*                                                                  *
     A*                                                                  *
     A********************************************************************
     A*                                                                  *
      *  CGL029 - Increase Account Code to 10 digits                  *
     A*    091522 - Safe Custody Fees - Private Banking (CSE001)         *
     A*    S01464 - Safe Custody Fees                                    *
     A*                                                                  *
     A********************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A**--------------------------------------------------------------*
     A**   FIRST HEADING LINE
     A**--------------------------------------------------------------*
     A          R HEADER1                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                  3  7'REFERENCE SE6280P1'
     A            BJURPT        53A     3 40
     A                                  3102'DATE'
     A            BJMRDT         7A     3107
     A                                  3119'PAGE'
     A                                  3124PAGNBR
     A                                      EDTCDE(Z)
     A*                                                                  *
     A                                  5 53'MISSING CUSTODY FEES REPORT'
     A  88                              5 99'BRANCH - '
     A  88        RRBRCD         3A     5108
     A                                  6 53'---------------------------'
     A  88                              6 99'---------'
     A  88                              6108'---'
     A**--------------------------------------------------------------*
     A**   SECOND HEADING LINE
     A**--------------------------------------------------------------*
     A          R HEADER2
     A                                  7  2'ACCOUNT OFFICER'
     A            RRACOC         4A     7 19
     A            RRACON        30A     7 24
     A**--------------------------------------------------------------*
     A**   THIRD HEADING LINE
     A**--------------------------------------------------------------*
     A          R HEADER3
     A***REMOVE*PORTFOLIO*COLUMN*HEADING*****************
     A**                                           Begin /091522/
     A**********                       11 16'PORTFOLIO'
     A***********                      11 17'CUSTODY'
     A***********                      11 41'SECURITY'
     A***********                      11 56'INV.'
      **Start of change CGL029
     A**89******                       11 11'PORTFOLIO'                                       CGL029
     A**********                       11 23'CUSTODY'                                         CGL029
     A**********                       11 43'SECURITY'                                        CGL029
     A  89                             11 11'PORT'
     A                                 11 17'CUSTODY'
     A                                 11 40'SECURITY'
      **End of change CGL029
     A                                 11 57'INV.'
     A**                                             End /091522/
     A                                 11 96'MARKET VALUE'
     A                                 11114'MARKET VALUE BANK'
     A*
     A**                                           Begin /091522/
     A**********                       12  5'CUSTOMER'
     A***REMOVE*PORTFOLIO*COLUMN*HEADING****************
     A**********                       12 16'REFERENCE'
     A**********                       12 16'FEE GROUP'
     A**88******                       12 29'BRANCH'
     A************                     12 41'/ACCOUNT'
     A************                     12 56'TYPE'
     A************                     12 63'CCY'
     A                                 12  1'CUSTOMER'
      **Start of change CGL029
     A**89******                       12 11'REFERENCE'                                       CGL029
     A**********                       12 22'FEE GROUP'                                       CGL029
     A**88******                       12 32'BRANCH'                                          CGL029
     A**********                       12 43'/ACCOUNT'                                        CGL029
     A  89                             12 11'REF'
     A                                 12 17'FEE GRP'
     A  88                             12 26'BRANCH'
     A                                 12 40'/ACCOUNT'
      **End of change CGL029
     A                                 12 57'TYPE'
     A                                 12 64'CCY'
     A**                                             End /091522/
     A                                 12 71'NOMINAL POSITION'
     A                                 12 95'IN NOMINAL CCY'
     A                                 12113'CHARGING CCY ('
     A            RRBCCY         3A    12127
     A                                 12130')'
     A*
     A**                                           Begin /091522/
     A**********                       13  5'--------'
     A***REMOVE*PORTFOLIO*COLUMN*HEADING********
     A**********                       13 16'---------'
     A**********                       13 16'---------'
     A**88******                       13 29'------'
     A**********                       13 41'--------'
     A**********                       13 56'----'
     A**********                       13 63'---'
     A                                 13  1'--------'
      **Start of change CGL029
     A**89******                       13 11'---------'                                       CGL029
     A**********                       13 22'---------'                                       CGL029
     A**88******                       13 33'------'                                          CGL029
     A**********                       13 43'--------'                                        CGL029
     A  89                             13 11'----'
     A                                 13 17'-------'
     A  88                             13 26'------'
     A                                 13 40'--------'
      **End of change CGL029
     A                                 13 57'----'
     A                                 13 64'---'
     A**                                             End /091522/
     A                                 13 71'----------------'
     A                                 13 95'--------------'
     A                                 13113'--------------'
     A                                 13127'---'
     A                                 13130'-'
     A**--------------------------------------------------------------*
     A**   SIXTH DETAIL RECORD LINE
     A**--------------------------------------------------------------*
     A          R DETAIL2
     A                                      SPACEB(1)
     A**                                           Begin /091522/
     A************RRCUSS         6A        6
     A***REMOVE*PORTFOLIO*DETAIL*****************
     A************RRPFRS         4A       19
     A************RRCFGS         2A       19
     A**88********RRBRCS         3A       30
     A************RRSCTY        10A       40
     A************RRIVTS         3A       56
     A************RRNMCS         3A       63
     A            RRCUSS         6A        1
      **Start of change CGL029
     A**89******  RRPFRS         4A       13                                                  CGL029
     A**********  RRCFGS         2A       25                                                  CGL029
     A**88******  RRBRCS         3A       34                                                  CGL029
     A**********  RRSCTY        10A       42                                                  CGL029
     A  89        RRPFRS         4A       11
     A            RRCFGS         2A       19
     A  88        RRBRCS         3A       27
     A            RRSCTY        10A       39
      **End of change CGL029
     A            RRIVTS         3A       57
     A            RRNMCS         3A       64
     A**                                             End /091522/
     A            RRNPSS        20A       68
     A            RRMNCS        20A       91
     A            RRMCCS        20A      112
     A**--------------------------------------------------------------*
     A**   SEVENTH DETAIL RECORD LINE
     A**--------------------------------------------------------------*
     A          R DETAIL3
     A                                      SPACEB(1)
     A**                                           Begin /091522/
     A************RRCUSA         6A        6
     A***REMOVE*PORTFOLIO*DETAIL*********
     A************RRPFRA         4A       19
     A************RRCFGA         2A       19
     A**88********RRBRCA         3A       30
     A************RRACNT        14A       38
     A************RRIVTA         3A       56
     A************RRNMCA         3A       63
     A            RRCUSA         6A        1
      **Start of change CGL029
     A**89******  RRPFRA         4A       13                                                  CGL029
     A**********  RRCFGA         2A       25                                                  CGL029
     A**88******  RRBRCA         3A       34                                                  CGL029
     A**********  RRACNT        14A       40                                                  CGL029
     A  89        RRPFRA         4A       11
     A            RRCFGA         2A       19
     A  88        RRBRCA         3A       27
     A            RRACNT        20A       34
      **End of change CGL029
     A            RRIVTA         3A       57
     A            RRNMCA         3A       64
     A**                                             End /091522/
     A            RRNPSA        20A       68
     A            RRDRCR         2A       88
     A            RRMNCA        20A       91
     A            RRMCCA        20A      112
     A**--------------------------------------------------------------*
     A**   LEAVE EMPTY LINE
     A**--------------------------------------------------------------*
     A          R EMPTY
     A                                      SPACEB(1)
     A                                    40' '
     A**--------------------------------------------------------------*
     A**   FOOTING
     A**--------------------------------------------------------------*
     A          R FOOTING1
     A                                    53'** END OF REPORT **'
     A                                      SPACEB(4)
