      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas AP Layout of DTAQ/APCLIPDTQ for API server')
      *****************************************************************
      *                                                               *
      *  Midas - Midas API Modules                                    *
      *                                                               *
      *  PF/APCLIPDTQ - API server/DB update data queue layout        *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2002            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CAP074  *CREATE    Date 26Mar02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CAP074 - Lending API enhancements - Loans input.             *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R APCLIPDTQF                TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2002')
      *
     A            APMSGD        10          TEXT('Message Detail')
      *
