      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas AP Layout of DTAQ/APCONFDTQ')
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger module                                *
      *                                                               *
      *  PF/APCONFDTQ - API Confirmation Submit data queue layout     *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2004            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. BUG2381 *CREATE    Date 13May04               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  BUG2381- Batch submit of confirmations programs              *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R APCONFDTQF                TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2004')
     A            APMSGD        10          TEXT('Message Detail')
