      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas API Main-Extension Link Details')                *
      *****************************************************************
      *                                                               *
      *  Midas - APIs                                                 *
      *                                                               *
      *  PF/APMNEXPD - Midas API Main-Extension Link Details          *
      *                                                               *
      *  (c) Finastra International Limited 2006                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CER059             Date 19Jul10               *
      *                 CAP190             Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CAP185  *CREATE    Date 21Apr06               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CAP190 - Customer Exchange MQ enabling. (Recompile).         *
      *  CAP185 - MQ Series Interface                                 *
      *                                                               *
      *****************************************************************
     A          R APMNEXD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2006')
      *
     A            APMAIN        15A         TEXT('Main Table/View')
     A                                      COLHDG('Main Table/' +
     A                                             'View')
     A            APMKEY       100A         TEXT('Main Table/View Unique +
     A                                            key - comma delimited')
     A                                      COLHDG('Main Table/View' +
     A                                             'Unique key')
     A            APHIST        15A         TEXT('Historic Table/View')
     A                                      COLHDG('Historic' +
     A                                             'Table/View')
     A            APHKEY       100A         TEXT('Historic Table/View Unique +
     A                                            key - comma delimited')
     A                                      COLHDG('Historic Table/' +
     A                                             'View Unique key')
     A            APEXTN        15A         TEXT('Extension Table')
     A                                      COLHDG('Extension' +
     A                                             'Table')
     A            APEKEY       100A         TEXT('Extension Table Unique +
     A                                            key - comma delimited')
     A                                      COLHDG('Extension Table' +
     A                                             'Unique key')
