      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas EU EMU In currency - sequence number link')
      *****************************************************************
      *                                                               *
      *  Midas - EMU Module                                           *
      *                                                               *
      *  PF/EUCYSQPD - EMU In Currency - Sequence Number Link         *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CEU028  *CREATE    Date 24Aug98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CEU028 - EMU GL Utilities                                    *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R EUCYSQD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A            EUINCY    R               REFFLD(CCY)
     A                                      TEXT('In Currency')
     A                                      COLHDG('In Currency')
     A            EUINSQ    R               REFFLD(ACSQ)
     A                                      TEXT('Sequence No.')
     A                                      COLHDG('Sequence No.')
