      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SM Change Narrative Log')
      *****************************************************************
      *                                                               *
      *  Midas - Implementation Module                                *
      *                                                               *
      *  PF/SMCNLGPD - Midas SM Change Narrative Log                  *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2004            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGL029  *CREATE    Date 01Sep03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *                                                               *
      *****************************************************************
      *
     A          R SMCNLGD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2004')
      *
     A            SMDBNM        10A         TEXT('Database Name')
     A                                      COLHDG('Database Name')
     A            SMTREF        30A         TEXT('Transaction Ref')
     A                                      COLHDG('Transaction Ref')
     A            SMNTYP         1A         TEXT('Narrative Type')
     A                                      COLHDG('Narrative Type')
     A            SMFLDN        10A         TEXT('Field Name')
     A                                      COLHDG('Field Name')
     A            SMFRNR        35A         TEXT('From Narrative')
     A                                      COLHDG('From Narrative')
     A            SMTONR        35A         TEXT('To Narrative')
     A                                      COLHDG('To Narrative')
      *
