      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SM File member lists')
      *****************************************************************
      *                                                               *
      *  Midas - Implementation module                                *
      *                                                               *
      *  PF/SMFILMBRPD - File member lists                            *
      *                                                               *
      *  (c) Finastra International Limited 2004                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CUP025  *CREATE    Date 04Feb04               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CUP025 - Change branches utility                             *
      *                                                               *
      *****************************************************************
      *
     A          R SMFILMBRD0                TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2004')
      *
     A            FMFILE        10A         TEXT('File Name')
     A                                      COLHDG('File Name')
     A            FMFMBR        10A         TEXT('File Member')
     A                                      COLHDG('File Member')
