      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SM File member lists')
      *****************************************************************
      *                                                               *
      *  Midas - Implementation module                                *
      *                                                               *
      *  PF/SMFILMBRPD - File member lists                            *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2004            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CUP025  *CREATE    Date 04FEB04               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CUP025 - Change branches utility                             *
      *                                                               *
      *****************************************************************
      *
     A          R SMFILMBRD0                TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2004')
      *
     A            FMFILE        10A         TEXT('File Name')
     A                                      COLHDG('File Name')
     A            FMFMBR        10A         TEXT('File Member')
     A                                      COLHDG('File Member')
