      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SM Template file for PB upgrade - SECHRGPD')
      *****************************************************************
      *                                                               *
      *  Midas - Implementation module                                *
      *                                                               *
      *  PF/SMPBFCPD - Customer Fee Charges                           *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2002            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSM001  *CREATE    Date 14Oct02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSM001 - Upgrade of Private Banking layer                    *
      *                                                               *
      *****************************************************************
      *
     A          R SMPBFCD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2002')
      *
     A            CHRECI         1
     A            CHREFE         8S 0       TEXT('Charge Reference')
     A            CHFTYP         2          TEXT('Fee Type')
     A            CHCNUM         6          TEXT('Customer number')
     A            CHPORT         4          TEXT('Portfolio')
     A            CHGROU         2          TEXT('Charge Group')
     A            CHCCY          3          TEXT('Charge Currency')
     A            CHAMT         15  0       TEXT('Charge Amount')
     A            CHBRCH         3          TEXT('Charge Branch')
     A            CHSEAC        18          TEXT('Settlement Account')
     A            CHSLSD         5  0       TEXT('Fee start/Last sett Date')
     A            CHAPOS         1          TEXT('Automatic posting')
     A            CHSEDA         2S 0       TEXT('Settl Gene Days')
     A            CHFREQ         1          TEXT('Settlement Frequency')
     A            CHDAMO         2S 0       TEXT('Settl Day in Month')
     A            CHFNSD         5  0       TEXT('First/Next settl date')
     A            CHFIND         5  0       TEXT('Final settlement date')
     A            CHACCR         1          TEXT('Accrual Indicator')
     A            CHNAR1        35          TEXT('Narrative 1')
     A            CHNAR2        35          TEXT('Narrative 2')
     A            CHNAR3        35          TEXT('Narrative 3')
     A            CHNAR4        35          TEXT('Narrative 4')
     A            CHSTAT         1          TEXT('Status')
     A            CHJOBN        10          TEXT('Locked by Job Name')
     A            CHUSER        10          TEXT('Locked by User Identifier')
     A            CHJNBR         6S 0       TEXT('Job number')
     A            CHCHTP         1          TEXT('Change type')
      *
