      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SM Suspect fields')
      *****************************************************************
      *                                                               *
      *  Midas - Implementation module                                *
      *                                                               *
      *  PF/SMSUSFLDPD - Suspect fields                               *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2004            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CUP025  *CREATE    Date 27Jan04               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CUP025 - Change branches utility                             *
      *                                                               *
      *****************************************************************
      *
     A          R SMSUSFLDD0                TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2004')
      *
     A            SFFILE        10A         TEXT('File Name')
     A                                      COLHDG('File Name')
     A            SFFMBR        10A         TEXT('File Member')
     A                                      COLHDG('File Member')
     A            SFOLDB         3A         TEXT('Old branch')
     A                                      COLHDG('Old' 'Branch')
     A            SFSTRP         5S 0       TEXT('Branch string starting +
     A                                      position')
     A                                      COLHDG('Branch string' +
     A                                             'starting position')
