      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SM Dropped Unmatched Facility History')
      *****************************************************************
      *                                                               *
      *  Midas - Implementation module                                *
      *                                                               *
      *  PF/SMU004PD - Dropped Unmatched Facility History             *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      *  Last Amend No. BG26993            Date 26Jan10               *
      *  Prev Amend No. 165940  *CREATE    Date 24AUG99               *
      *                                                               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  BG26993 - Delivery of upgrade programs to core.              *
      *          - Renamed FACHDRP.                                   *
      *  165940 - To drop unmatched records on facility history       *
      *           between FACHISH/FACHISA and FCLTYFM.                *
      *                                                               *
      *****************************************************************
      *
     A                                      REF(MFRFL)
      *
     A          R SMU004D0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            FHRECI    R               REFFLD(RECI)
     A            FHCNUM    R    6A         REFFLD(CNUM)
     A            FHFTYP    R
     A            FHFSEQ    R               REFFLD(FSEQ)
     A            FHBRCH    R               REFFLD(BRCA)
     A            FHFTIN    R               REFFLD(FCTI)
     A            FHFCCY    R               REFFLD(CCY)
     A            FHOFAM    R
     A            FHEXDT    R               REFFLD(DTEX)
      *
     A          K FHCNUM
     A          K FHFTYP
     A          K FHFSEQ
