      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Records to be added in FACHISA')                       *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/SMU00288PD - Copy of created PDCL principal repayments.   *
      *                                                               *
      *  (c) Misys Banking Systems 2013                               *
      *                                                               *
      *  Last Amend No. AR1036834 *CREATE  Date 25Jun13               *
      *  Prev Amend No. Xxxxxxxxx          Date ddmmmyy               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  AR1036834 - Output PDCL principal repayments to FACHISA.     *
      *              (Child: AR1036835)                               *
      *                                                               *
      *****************************************************************
     A          R FACHISAF                  FORMAT(FACHISA)
      *
     A          K BRCA
     A          K FACNUM
     A          K FAFCTY
     A          K FADATE
      *
