      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SM Template for migration of SDACUSPD - 02')     *
      *****************************************************************
      *                                                               *
      *  Midas - Implementation module                                *
      *                                                               *
      *  PF/SMUGF02PD - Template for SDACUSPD migration 02            *
      *                                                               *
      *  (c) Finastra International Limited 2009                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CER059             Date 19Jul10               *
      *                 BUG25441           Date 12Aug09               *
      *                 CSM011  *CREATE    Date 05May09               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  BUG25441 - Migration issue on Additional Customer Details.   *
      *  CSM011 - New utility to process CAR migration                *
      *                                                               *
      *****************************************************************
      *
     A                                      UNIQUE
     A          R SMUGF02D0                 TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2009')
      *
     A            BBCUST         6          TEXT('Customer number')
     A                                      COLHDG('Cust.' 'Number')
     A            BBCDCL        40          TEXT('Characteristic of demand')
     A                                      COLHDG('Characteristic' 'of Demand')
      ** Start of change BUG25441
     A            BBTINO        20A         TEXT('Tax Identification Number (TI+
     A                                      N)')
     A                                      COLHDG('Tax Identification' +
     A                                      'Number (TIN)')
     A            BBCIDI         2A         TEXT('Country Id Document Issued')
     A                                      COLHDG('Country Id' 'Document +
     A                                      Issued')
      ** End of change BUG25441
     A          K BBCUST
      *
