      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SM Template for migration of DEALSDB')           *
      *****************************************************************
      *                                                               *
      *  Midas - Implementation module                                *
      *                                                               *
      *  PF/SMUGF04PD - Template for DEALSDB migration                *
      *                                                               *
      *  (c) Finastra International Limited 2009                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CER059             Date 19Jul10               *
      *                 CSM011  *CREATE    Date 05May09               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CSM011 - New utility to process CAR migration                *
      *                                                               *
      *****************************************************************
 
     A          R SMUGF04D0                 TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2009')
      *
     A            XDN38          6S 0       TEXT('Deal number')
     A                                      COLHDG('Deal' 'Number')
     A            XRECP          1A         TEXT('Reciprocal rate indicator')
     A                                      COLHDG('Rcp' 'Rte' 'Ind')
      *
