      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SM Template for migration of GLACNTQD')          *
      *****************************************************************
      *                                                               *
      *  Midas - Implementation module                                *
      *                                                               *
      *  PF/SMUGF11PD - Template for GLACNTQD migration               *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2011            *
      *                                                               *
      *  Last Amend No. AR800209  *CREATE  Date 07Jul11               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  AR800209 - Database migration from a previous Midas Release  *
      *             to Midas Plus 1.4                                 *
      *                                                               *
      *****************************************************************
 
     A          R SMUGF11D0                 TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2011')
     A            Z3BRCA         3A         TEXT('Branch Code')
     A                                      COLHDG('Branch' 'Code')
     A            Z3CNUM         6S 0       TEXT('Customer Number')
     A                                      COLHDG('Customer' +
     A                                             'Number')
     A            Z3CCY          3A         TEXT('Currency Code')
     A                                      COLHDG('Currency' 'Code')
     A            Z3ACOD        10S 0       TEXT('Account Code')
     A                                      COLHDG('Account' 'Code')
     A            Z3ACSQ         2S 0       TEXT('Account Seq Number')
     A                                      COLHDG('Account' 'Seq Number')
     A            Z3ZINS         1A         TEXT('Interest Scale Flag')
     A                                      COLHDG('Interest' 'Scale' +
     A                                              'Flag')
