      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_SN                                                        *
/*EXI *  TEXT('Midas FT CCT detail')
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FT102DPD - CCT Detail                                     *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Last Amend No. CSW207             Date 07Jun07               *
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CGP001             Date 23May03               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 CSW201             Date 02May01               *
      * Midas DBA 3.05 -----------------------------------------------*
      *                 CFT009             Date 30May00               *
      * Midas DBA 3.04 -----------------------------------------------*
      *                 184060             Date 22Sep00               *
      * Midas DBA 3.03 -----------------------------------------------*
      *  Prev Amend No. 178751             Date 09May00               *
      *                 CFT008  *CREATE    Date 06Sep99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSW207 - SWIFT 2007 Changes (recompile)                      *
      *  CGP001 - Global Processing                                   *
      *           - File now shares format with the global layer      *
      *             equivalent.                                       *
      *  CSW201 - SWIFT 2001 Standards Update                         *
      *  CFT009 - Addition of fields for FT fees and charges          *
      *  184060 - No transaction type code in detail screen           *
      *  178751 - Auto generation of references                       *
      *  CFT008 - Funds Transfer/Swift Messages MT102                 *
      *                                                               *
      *****************************************************************
      *                                     Start of Change CGP001
     A          R FT102DD0                  FORMAT(GZFT102DPD)
      *
      *
      **********
     A**********                            REF(MFRFL)
      **********
     A**********R FT102DD0                  TEXT('(c) Misys International +
     A**********                            Banking Systems Ltd. +
     A**********                            2001')
      **********
     A**********  CCTID     R               REFFLD(ACID)
     A**********                            TEXT('CCT Id')
     A**********                            COLHDG('CCT Id')
     A**********  TRNSID    R               REFFLD(ACOR)
     A**********                            TEXT('Transaction +
     A**********                            Reference')
     A**********                            COLHDG('Transaction ' +
     A**********                            'Reference')
     A**********  CCTAMT    R               REFFLD(M5DLAM)
     A**********                            TEXT('Credit Transfer +
     A**********                            Amount')
     A**********                            COLHDG('Credit Transfer ' +
     A**********                            'Amount')
     A**********  CCTCCY    R               REFFLD(BCCY)
     A**********                            TEXT('Transaction +
     A**********                            Currency')
     A**********                            COLHDG('Transaction +
     A**********                            Currency')
     A**********  CRDVDT    R               REFFLD(CHAP)
     A**********                            TEXT('Credit Value Date')
     A**********                            COLHDG('Credit Value Date')
     A**********  ORDCU1    R               REFFLD(POBA)
     A**********                            TEXT('Ordering Customer 1')
     A**********                            COLHDG('Ordering Customer +
     A**********                            1')
     A**********  ORDCU2    R               REFFLD(POBA)
     A**********                            TEXT('Ordering Customer 2')
     A**********                            COLHDG('Ordering Customer +
     A**********                            2')
     A**********  ORDCU3    R               REFFLD(POBA)
     A**********                            TEXT('Ordering Customer 3')
     A**********                            COLHDG('Ordering Customer +
     A**********                            3')
     A**********  ORDCU4    R               REFFLD(POBA)
     A**********                            TEXT('Ordering Customer 4')
     A**********                            COLHDG('Ordering Customer +
     A**********                            4')
     A**********  CUSTTD    R               REFFLD(TYPG)
     A**********                            TEXT('Ordering Customer +
     A**********                            Type')
     A**********                            COLHDG('Ordering ' +
     A**********                            'Customer Type')
     A**********  ORDI35    R               REFFLD(AWIL)
     A**********                            TEXT('Ordering +
     A**********                            Institution')
     A**********                            COLHDG('Ordering ' +
     A**********                            'Institution')
     A**********  ORDI11    R               REFFLD(SWID)
     A**********                            TEXT('Ordering +
     A**********                            Institution')
     A**********                            COLHDG('Ordering ' +
     A**********                            'Institution')
     A**********  ORDITP    R               REFFLD(TYPG)
     A**********                            TEXT('Ordering Institution +
     A**********                            Type')
     A**********                            COLHDG('Ordering ' +
     A**********                            'Institution Type')
     A**********  ACCI35    R               REFFLD(AWIL)
     A**********                            TEXT('Account with +
     A**********                            Institution')
     A**********                            COLHDG('Account with ' +
     A**********                            'Institution')
     A**********  ACCI11    R               REFFLD(SWID)
     A**********                            TEXT('Account with +
     A**********                            Institution')
     A**********                            COLHDG('Account with ' +
     A**********                            'Institution')
     A**********  AWITP     R               REFFLD(TYPG)
     A**********                            TEXT('Account With Inst +
     A**********                            Type')
     A**********                            COLHDG('Account With ' +
     A**********                            'Institution Type')
     A**********  BENF1     R               REFFLD(CABN)
     A**********                            TEXT('Beneficiary')
     A**********                            COLHDG('Beneficiary')
     A**********  BENF2     R               REFFLD(CABN)
     A**********                            TEXT('Beneficiary')
     A**********                            COLHDG('Beneficiary')
     A**********  BENF3     R               REFFLD(CABN)
     A**********                            TEXT('Beneficiary')
     A**********                            COLHDG('Beneficiary')
     A**********  BENF4     R               REFFLD(CABN)
     A**********                            TEXT('Beneficiary')
     A**********                            COLHDG('Beneficiary')
     A**********  BENF5     R               REFFLD(CABN)
     A**********                            TEXT('Beneficiary')
     A**********                            COLHDG('Beneficiary')
     A**********  BENTTD    R               REFFLD(TYPG)
     A**********                            TEXT('Beneficiary +
     A**********                            Type')
     A**********                            COLHDG('Beneficiary' +
     A**********                            'Type')
     A**********  REMI1     R               REFFLD(CABN)
     A**********                            TEXT('Remittance Info')
     A**********                            COLHDG('Remittance Info')
     A**********  REMI2     R               REFFLD(CABN)
     A**********                            TEXT('Remittance Info')
     A**********                            COLHDG('Remittance Info')
     A**********  REMI3     R               REFFLD(CABN)
     A**********                            TEXT('Remittance Info')
     A**********                            COLHDG('Remittance Info')
     A**********  REMI4     R               REFFLD(CABN)
     A**********                            TEXT('Remittance Info')
     A**********                            COLHDG('Remittance Info')
      **********                                     Begin /184060/
     A************CCTTYC    R               REFFLD(PRTY)
     A**********  CCTTYC         3
      **********                                     End   /184060/
     A**********                            TEXT('Transaction Type +
     A**********                            Code')
     A**********                            COLHDG('Transaction ' +
     A**********                            'Type Code')
     A**********  REGRP1    R               REFFLD(CABN)
     A**********                            TEXT('Regulatory +
     A**********                            Reporting')
     A**********                            COLHDG('Regulatory +
     A**********                            Reporting')
     A**********  REGRP2    R               REFFLD(CABN)
     A**********                            TEXT('Regulatory +
     A**********                            Reporting')
     A**********                            COLHDG('Regulatory +
     A**********                            Reporting')
     A**********  REGRP3    R               REFFLD(CABN)
     A**********                            TEXT('Regulatory +
     A**********                            Reporting')
     A**********                            COLHDG('Regulatory +
     A**********                            Reporting')
      **********
     A**********  ORIGCY    R               REFFLD(BCCY)
     A**********                            TEXT('Original Currency')
     A**********                            COLHDG('Original Currency')
     A**********  ORIGAM    R               REFFLD(M5DLAM)
     A**********                            TEXT('Original Amount')
     A**********                            COLHDG('Original Amount')
      **********
     A**********  PAYCCY    R               REFFLD(BCCY)
     A**********                            TEXT('Payment Currency')
     A**********                            COLHDG('Payment Currency')
     A**********  PAYAMT    R               REFFLD(M5DLAM)
     A**********                            TEXT('Payment Amount')
     A**********                            COLHDG('Payment Amount')
     A**********  PYBCQS    R               REFFLD(DAXR)
     A**********                            TEXT('PAY Base Ccy Equiv +
     A**********                            Spot Rate')
     A**********                            COLHDG('Base Ccy Equiv ' +
     A**********                            'Spot Rate')
     A**********  TFBCQS    R               REFFLD(DAXR)
     A**********                            TEXT('TFR Base Ccy Equiv +
     A**********                            Spot Rate')
     A**********                            COLHDG('Base Ccy Equiv ' +
     A**********                            'Spot Rate')
     A**********  CCYCHG    R               REFFLD(CHINL)
     A**********                            TEXT('Detail of Charges')
     A**********                            COLHDG('Detail of Charges')
     A**********  SNDCHG    R               REFFLD(CHGS)
     A**********                            TEXT('Senders Charges')
     A**********                            COLHDG('Senders Charges')
     A**********  SNDCCY    R               REFFLD(BCCY)
     A**********                            TEXT('Senders Charges +
     A**********                            Currency')
     A**********                            COLHDG('Senders ' +
     A**********                            'Charges Currency')
     A**********  SNDOCG    R               REFFLD(CHGS)
     A**********                            TEXT('Senders Charges in +
     A**********                            Payment Currency')
     A**********                            COLHDG('Senders ' +
     A**********                            'Chargers in Payment ' +
     A**********                            'Currency')
     A**********  SNDCTF    R               REFFLD(CHGS)
     A**********                            TEXT('Senders Charges in +
     A**********                            Transfer Currency')
     A**********                            COLHDG('Senders ' +
     A**********                            'Chargers in ' +
     A**********                            'Transfer Currency')
     A**********  RCVCHG    R               REFFLD(CHGS)
     A**********                            TEXT('Receivers Charges')
     A**********                            COLHDG('Receivers Charges')
     A**********  RCVCCY    R               REFFLD(BCCY)
     A**********                            TEXT('Receivers Charges +
     A**********                            Currency')
     A**********                            COLHDG('Receivers ' +
     A**********                            'Charges Currency')
     A**********  RCVOCG    R               REFFLD(CHGS)
     A**********                            TEXT('Receivers Charges +
     A**********                            Payment Currency')
     A**********                            COLHDG('Receivers ' +
     A**********                            'Chargers Payment ' +
     A**********                            'Currency')
     A**********  RCVCTF    R               REFFLD(CHGS)
     A**********                            TEXT('Receivers Charges +
     A**********                            Transfer Currency')
     A**********                            COLHDG('Receivers ' +
     A**********                            'Chargers Transfer ' +
     A**********                            'Currency')
     A**********  CHGACC    R               REFFLD(POBA)
     A**********                            TEXT('Charge Account')
     A**********                            COLHDG('Charge Account')
     A**********  XRATE     R               REFFLD(EXRATE)
     A**********                            TEXT('Exchange Rate')
     A**********                            COLHDG('Exchange Rate')
     A**********  GOPFLG    R               REFFLD(ACBT)
     A**********                            TEXT('Generate Outgoing +
     A**********                            Payments Flag')
     A**********                            COLHDG('Generate ' +
     A**********                            'Outgoing Payments ' +
     A**********                            'Flag')
     A**********  XRATEO    R               REFFLD(ADDC)
     A**********                            TEXT('Exchange Rate +
     A**********                            Override Indicator')
     A**********                            COLHDG('Exchange Rate ' +
     A**********                            'Override Indicator')
     A**********  TFTRNT    R               REFFLD(ACBT)
     A**********                            TEXT('Further Transaction +
     A**********                            Type (I,O,C)')
     A**********                            COLHDG('Further ' +
     A**********                            'Transaction Type ' +
     A**********                            '(I,O,C)')
     A**********  TFTREF    R               REFFLD(ACID)
     A**********                            TEXT('Further Transaction +
     A**********                            Ref')
     A**********                            COLHDG('Further ' +
     A**********                            'Transaction Ref')
     A**********  CQIN      R
     A**********  CHQNUM    R               REFFLD(CQNM)
     A**********  INUSER    R               REFFLD(RGUD)
     A**********                            TEXT('Input User')
     A**********                            COLHDG('Input User')
     A**********  INDATE    R               REFFLD(LASD)
     A**********                            TEXT('Input Date')
     A**********                            COLHDG('Input Date')
     A**********  INTIME    R               REFFLD(LATM)
     A**********                            TEXT('Input Time')
     A**********                            COLHDG('Input Time')
     A**********  UPDUSR    R               REFFLD(RGUD)
     A**********                            TEXT('Update User')
     A**********                            COLHDG('Update User')
     A**********  UPDDTE    R               REFFLD(LASD)
     A**********                            TEXT('Update Date')
     A**********                            COLHDG('Update Date')
     A**********  UPDTIM    R               REFFLD(LATM)
     A**********                            TEXT('Update Time')
     A**********                            COLHDG('Update Time')
      **********
     A**********  CCTMSQ    R               REFFLD(MTCD)
     A**********                            TEXT('CCT Message +
     A**********                            Sequence')
     A**********                            COLHDG('CCT Message ' +
     A**********                            'Sequence')
      **********
     A**********  AKEYCD    R               REFFLD(TSKS)
     A**********                            TEXT('Account Key +
     A**********                            Generated: credit date')
     A**********                            COLHDG('Account Key ' +
     A**********                            'Generated: credit ' +
     A**********                            'date')
     A**********  CCTMSG    R               REFFLD(MSGR)
     A**********                            TEXT('CCT Message +
     A**********                            reference')
     A**********                            COLHDG('CCT Message ' +
     A**********                            'reference')
      **********
      **********                                     Begin /178751/
     A**********  TSEQNO         3  0       TEXT('Credit Sequence +
     A**********                            Number')
     A**********                            COLHDG('Credit Sequence' +
     A**********                            'Number')
      **********                                     End   /178751/
      **********                                     Begin /CFT009/
     A**********  MICCD1    R               REFFLD(DBFL)
     A**********                            TEXT('Miscellaneous +
     A**********                            charge code 1.')
     A**********                            COLHDG('Miscellaneous' +
     A**********                            'charge code 1.')
      **********
     A**********  MICCD2    R               REFFLD(DBFL)
     A**********                            TEXT('Miscellaneous +
     A**********                            charge code 2.')
     A**********                            COLHDG('Miscellaneous' +
     A**********                            'charge code 2.')
      **********
     A**********  MICCD3    R               REFFLD(DBFL)
     A**********                            TEXT('Miscellaneous +
     A**********                            charge code 3.')
     A**********                            COLHDG('Miscellaneous' +
     A**********                            'charge code 3.')
      **********
     A**********  MICCD4    R               REFFLD(DBFL)
     A**********                            TEXT('Miscellaneous +
     A**********                            charge code 4.')
     A**********                            COLHDG('Miscellaneous' +
     A**********                            'charge code 4.')
      **********
     A**********  MICCD5    R               REFFLD(DBFL)
     A**********                            TEXT('Miscellaneous +
     A**********                            charge code 5.')
     A**********                            COLHDG('Miscellaneous' +
     A**********                            'charge code 5.')
      **********
     A**********  TRCOCC    R               REFFLD(DBFL)
     A**********                            TEXT('Transfer +
     A**********                            commission +
     A**********                            charge code.')
     A**********                            COLHDG('Transfer commission' +
     A**********                            'charge code.')
      **********
     A**********  FXCCC     R               REFFLD(DBFL)
     A**********                            TEXT('FX/Change +
     A**********                            charge code.')
     A**********                            COLHDG('FX/Change' +
     A**********                            'charge code.')
      **********
     A**********  MICH1     R               REFFLD(CHGS)
     A**********                            TEXT('Miscellaneous +
     A**********                            charge 1.')
     A**********                            COLHDG('Miscellaneous' +
     A**********                            'charge 1.')
      **********
     A**********  MICH2     R               REFFLD(CHGS)
     A**********                            TEXT('Miscellaneous +
     A**********                            charge 2.')
     A**********                            COLHDG('Miscellaneous' +
     A**********                            'charge 2.')
      **********
     A**********  MICH3     R               REFFLD(CHGS)
     A**********                            TEXT('Miscellaneous +
     A**********                            charge 3.')
     A**********                            COLHDG('Miscellaneous' +
     A**********                            'charge 3.')
      **********
     A**********  MICH4     R               REFFLD(CHGS)
     A**********                            TEXT('Miscellaneous +
     A**********                            charge 4.')
     A**********                            COLHDG('Miscellaneous' +
     A**********                            'charge 4.')
      **********
     A**********  MICH5     R               REFFLD(CHGS)
     A**********                            TEXT('Miscellaneous +
     A**********                            charge 5.')
     A**********                            COLHDG('Miscellaneous' +
     A**********                            'charge 5.')
      **********
     A**********  FXCHAC    R               REFFLD(CHGS)
     A**********                            TEXT('FX/Change +
     A**********                            commission +
     A**********                            charge.')
     A**********                            COLHDG('FX/Change' +
     A**********                            'commission' +
     A**********                            'charge.')
      **********
     A**********  TRCOCH    R               REFFLD(CHGS)
     A**********                            TEXT('Transfer +
     A**********                            commission +
     A**********                            charge.')
     A**********                            COLHDG('Transfer' +
     A**********                            'commission' +
     A**********                            'charge.')
      **********
     A**********  VMICH1    R               REFFLD(CGAS)
     A**********                            TEXT('VAT on Miscellaneous +
     A**********                            charge 1.')
     A**********                            COLHDG('VAT on Miscellaneous' +
     A**********                            'charge 1.')
      **********
     A**********  VMICH2    R               REFFLD(CGAS)
     A**********                            TEXT('VAT on Miscellaneous +
     A**********                            charge 2.')
     A**********                            COLHDG('VAT on Miscellaneous' +
     A**********                            'charge 2.')
      **********
     A**********  VMICH3    R               REFFLD(CGAS)
     A**********                            TEXT('VAT on Miscellaneous +
     A**********                            charge 3.')
     A**********                            COLHDG('VAT on Miscellaneous' +
     A**********                            'charge 3.')
      **********
     A**********  VMICH4    R               REFFLD(CGAS)
     A**********                            TEXT('VAT on Miscellaneous +
     A**********                            charge 4.')
     A**********                            COLHDG('VAT on Miscellaneous' +
     A**********                            'charge 4.')
      **********
     A**********  VMICH5    R               REFFLD(CGAS)
     A**********                            TEXT('VAT on Miscellaneous +
     A**********                            charge 5.')
     A**********                            COLHDG('VAT on Miscellaneous' +
     A**********                            'charge 5.')
      **********
     A**********  VAFCCC    R               REFFLD(CGAS)
     A**********                            TEXT('VAT on FX/Change +
     A**********                            commission +
     A**********                            charge.')
     A**********                            COLHDG('VAT on FX/Change' +
     A**********                            'commission' +
     A**********                            'charge.')
      **********
     A**********  VTRCC     R               REFFLD(CGAS)
     A**********                            TEXT('VAT on Transfer +
     A**********                            commission +
     A**********                            charge.')
     A**********                            COLHDG('VAT on Transfer' +
     A**********                            'commission' +
     A**********                            'charge.')
      **********
     A**********  VATAMU    R               REFFLD(CHGS)
     A**********                            TEXT('VAT Amount')
     A**********                            COLHDG('VAT amount')
      **********
     A**********  VARATE    R               REFFLD(FXRT)
     A**********                            TEXT('VAT Rate')
     A**********                            COLHDG('VAT Rate')
      **********
     A**********  DATNNT    R               REFFLD(ACCD)
     A**********                            TEXT('Date notification +
     A**********                            entered.')
     A**********                            COLHDG('Date notification' +
     A**********                            'entered.')
      **********
     A**********  DATNAT    R               REFFLD(ACCD)
     A**********                            TEXT('Date notification +
     A**********                            authorised.')
     A**********                            COLHDG('Date notification' +
     A**********                            'authorised.')
      **********
     A**********  CUSTNF    R               REFFLD(CGAS)
     A**********                            TEXT('Customer +
     A**********                            notification +
     A**********                            flag.')
     A**********                            COLHDG('Customer' +
     A**********                            'notification' +
     A**********                            'flag.')
      **********
     A**********  M2CHRT    R               REFFLD(DAXR)
     A**********                            TEXT('XRate between charges +
     A**********                                 ccy and charge display ccy')
      **********
     A**********  M2CHGC    R               REFFLD(BCCY)
     A**********                            TEXT('Charges Currency Code')
      **********
      **********                                     End   /CFT009/
     A**Start*of Change CSW201
     A**********  SDCHG2        13P 0       TEXT('Senders Charges 2')
     A**********                            COLHDG('Senders Charges 2')
     A**********  SDCCY2         3A         TEXT('Senders Charges Currency 2')
     A**********                            COLHDG('Senders' +
     A**********                                   'Charges' +
     A**********                                   'Ccy 2')
     A**********  SDOCG2        13P 0       TEXT('Senders Charges in +
     A**********                            Payment Currency 2')
     A**********                            COLHDG('Senders Charges' +
     A**********                                   'in Payment' +
     A**********                                   'Currency 2')
     A**********  SDCTF2        13P 0       TEXT('Senders Charges in +
     A**********                            Transfer Currency 2')
     A**********                            COLHDG('Senders Charges' +
     A**********                                   'in Transfer' +
     A**********                                   'Currency 2')
     A**********  SDCHG3        13P 0       TEXT('Senders Charges 3')
     A**********                            COLHDG('Senders Charges 3')
     A**********  SDCCY3         3A         TEXT('Senders Charges Currency 3')
     A**********                            COLHDG('Senders' +
     A**********                                   'Charges' +
     A**********                                   'Ccy 3')
     A**********  SDOCG3        13P 0       TEXT('Senders Charges in +
     A**********                            Payment Currency 3')
     A**********                            COLHDG('Senders Charges' +
     A**********                                   'in Payment' +
     A**********                                   'Currency 3')
     A**********  SDCTF3        13P 0       TEXT('Senders Charges in +
     A**********                            Transfer Currency 3')
     A**********                            COLHDG('Senders Charges' +
     A**********                                   'in Transfer' +
     A**********                                   'Currency 3')
     A**********  SDCHG4        13P 0       TEXT('Senders Charges 4')
     A**********                            COLHDG('Senders Charges 4')
     A**********  SDCCY4         3A         TEXT('Senders Charges Currency 4')
     A**********                            COLHDG('Senders' +
     A**********                                   'Charges' +
     A**********                                   'Ccy 4')
     A**********  SDOCG4        13P 0       TEXT('Senders Charges in +
     A**********                            Payment Currency 4')
     A**********                            COLHDG('Senders Charges' +
     A**********                                   'in Payment ' +
     A**********                                   'Currency 4')
     A**********  SDCTF4        13P 0       TEXT('Senders Charges in +
     A**********                            Transfer Currency 4')
     A**********                            COLHDG('Senders Charges' +
     A**********                                   'in Transfer' +
     A**********                                   'Currency 4')
     A**********  SDCHG5        13P 0       TEXT('Senders Charges 5')
     A**********                            COLHDG('Senders Charges 5')
     A**********  SDCCY5         3A         TEXT('Senders Charges Currency 5')
     A**********                            COLHDG('Senders' +
     A**********                                   'Charges' +
     A**********                                   'Ccy 5')
     A**********  SDOCG5        13P 0       TEXT('Senders Charges in +
     A**********                            Payment Currency 5')
     A**********                            COLHDG('Senders Charges' +
     A**********                                   'in Payment' +
     A**********                                   'Currency 5')
     A**********  SDCTF5        13P 0       TEXT('Senders Charges in +
     A**********                            Transfer Currency 5')
     A**********                            COLHDG('Senders Charges' +
     A**********                                   'in Transfer' +
     A**********                                   'Currency 5')
     A**End*of*Change CSW201
      *                                     End of Change CGP001
