      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_RU                                                        *
/*EXI *  TEXT('Midas FT Book code defaults')
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTBKDFP0 - Book code defaults                             *
      *                                                               *
      *  (C) Copyright Misys IBS Ltd. 2003                            *
      *                                                               *
      *  Last Amend No. MD031937           Date 13Jan15               *
      *  Prev Amend No. AR856737           Date 13Sep11               *
      *                 ERN054   *CREATE   Date 19Jun2003             *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD031937 - Upgrade STP enhancements to BF Midas 2.1          *
      *  AR856737 - Upgrade STP enhancements to Midas Plus level      *
      *  ERN054 - Agency message changes                              *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R @BKDFP0                   TEXT('(C) Misys IBS  +
     A                                      . 2003')
      *---------------------------------------------------------------------
     A            BDBRCA         3          TEXT('Branch code')
     A                                      COLHDG('Branch' +
     A                                             'Code')
     A            BDUSER        10          TEXT('User')
     A                                      COLHDG('User')
     A            BDPTYP         2          TEXT('Payment Type')
     A                                      COLHDG('Payment' +
     A                                             'Type')
     A            BDPYST         2          TEXT('Payment Sub-Type')
     A                                      COLHDG('Payment' +
     A                                             'Sub-Type')
     A            BDSTMT         2          TEXT('Settlement Method')
     A                                      COLHDG('Settlement' +
     A                                             'Method')
     A            BDNWRK         6          TEXT('Network')
     A                                      COLHDG('Network')
     A            BDMTPY         3          TEXT('Message Type')
     A                                      COLHDG('Message' +
     A                                             'Type')
     A            BDADDC         1          TEXT('Add/Deduct Indicator')
     A                                      COLHDG('Add/Deduct' 'Indicator')
     A            BDFXTR         1          TEXT('FX Transaction')
     A                                      COLHDG('FX Trade')
     A            BDBOOK         2          TEXT('Book')
     A                                      COLHDG('Book')
     A*=====================================================================
