      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_RU                                                        *
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTBSCHP0 - Midas FT BIC Plus Search QUICK                 *
      *                                                               *
      *  (C) Copyright Misys IBS Ltd. 2004                            *
      *                                                               *
      *  Last Amend No. MD31937            Date 13Jan15               *
      *  Last Amend No. AR856737           Date 13Sep11               *
      *  Last Amend No. EEE065             Date 21Oct2004             *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD31937  - Upgrade STP enhancements to BF Midas 2.1          *
      *  AR856737 - Upgrade STP enhancements to Midas Plus level      *
      *  EEE065 - FT Payment Routing                                  *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R @BSCHP0                   TEXT('(C) Misys IBS  +
     A                                      . 2004')
      *---------------------------------------------------------------------
      *
     A            BSBIC         11          TEXT('BIC Code')
     A                                      COLHDG('BIC Code' )
     A            BSKEY          8          TEXT('Key')
     A                                      COLHDG('Key')
     A            BSSTYP         4          TEXT('Subtype')
     A                                      COLHDG('Subtype')
     A            BSCHIP         6          TEXT('CHIPS')
     A                                      COLHDG('CHIPS')
     A            BSCNTC         2          TEXT('Country Code')
     A                                      COLHDG('Country' 'Code')
     A            BSNATI        15          TEXT('National ID')
     A                                      COLHDG('National ID')
     A            BSACTD         6          TEXT('Activation Date')
     A                                      COLHDG('Activation' 'Date')
     A            BSDCTD         6          TEXT('Deactivation Date')
     A                                      COLHDG('Deactivation' +
     A                                          'Date')
      *
      *****************************************************************
