      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas IBLC 2002 Cheques For Collect. Extended File')
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTCCX1PD   - IBLC Cheques for Collection Extended File    *
      *                  Layout                                       *
      *                                                               *
      *  (c) Finastra International Limited 2005                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CER001  *CREATE    Date 25Apr05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CER001 - LUX Upgrade to MidasPlus                            *
      *                                                               *
      *****************************************************************
      *
     A                                      UNIQUE
      *
     A          R CQCODDL                   TEXT('(c) Finastra International +
     A                                      Limited 2005')
      *
     A            CCPREF        15A         TEXT('Payment Reference')
     A                                      COLHDG('Payment' 'Reference')
      *
     A            CCCQSQ         2S 0       TEXT('Cheque Sequence')
     A                                      COLHDG('Cheque' 'Sequence')
      *
     A            CCORTY         2A         TEXT('Ordering Type')
     A                                      COLHDG('Ordering' 'Type')
      *
     A            CCBETY         2A         TEXT('Beneficiary Type')
     A                                      COLHDG('Beneficiary' 'Type')
      *
     A            CCOPCO         3A         TEXT('IBLC Operation Code')
     A                                      COLHDG('IBLC' 'Operation' 'Code')
      *
     A            CCCOCO         2A         TEXT('Country Code')
     A                                      COLHDG('Country' 'Code')
      *
     A            CCIDCO         2A         TEXT('Identification Code')
     A                                      COLHDG('Identification' 'Code')
      *
     A            CCIDEN         9A         TEXT('Identification')
     A                                      COLHDG('Identification')
      *
      ***  KEY List
      *
     A          K CCPREF
     A          K CCCQSQ
      *
