      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_RU                                                        *
/*EXI *  TEXT('Midas FT Faster Payment. Pay through BIC and A/C')
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTFASTP0 - STP - Faster Payment. Pay through BIC and A/C  *
      *                                                               *
      *  (C) Copyright Finastra                                       *
      *                                                               *
      *  Last Amend No. LUC112   MD49398   Date 30Oct17               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LUC112   - STP - Faster Payments                             *
      *           - UCI specific change                               *
      *           - Faster Payment share same routing as for local    *
      *             clearing bank but the payment is to be sent to    *
      *             special faster payment designated BIC code.       *
      *           - This table maintain link between local clearing   *
      *             bank and special faster payment BIC code          *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R @FASTP0                   TEXT('(C) Finastra +
     A                                      . 2017')
      *---------------------------------------------------------------------
     A            LCCCY          3          TEXT('Local Clearing Currency Code')
     A                                      COLHDG('Local Clearing ' +
     A                                             'Currency Code ')
     A            LCBICC        11          TEXT('Local Clearing BIC code')
     A                                      COLHDG('Local Clearing ' +
     A                                             '   BIC code ')
     A            LCACN          5          TEXT('Local Clearing Account')
     A                                      COLHDG('Local Clearing' +
     A                                               ' Account' )
      *
     A            FPBICC        11          TEXT('FASTP - Destination BIC')
     A                                      COLHDG('FASTP - Destination' +
     A                                             '     BIC code ')
     A            FPACN          5          TEXT('FASTP - Destination Account')
     A                                      COLHDG('FASTP - Destination' +
     A                                             '     Account' )
      *
     A            FPLIM         15  0       TEXT('FASTP - Limit Amount in GBP')
     A                                      COLHDG('FASTP - Limit ' +
     A                                             'Amount in GBP' )
      *
     A*=====================================================================
