      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas IBLC 2002 Incoming Payments Extended File')
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTIPX1PD  - IBLC Incoming Payments Extended File Layout   *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2005            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CER001  *CREATE    Date 25Apr05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CER001 - LUX Upgrade to MidasPlus                            *
      *                                                               *
      *****************************************************************
      *
     A                                      UNIQUE
      *
     A          R INPAYDDL                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. 2005')
      *
     A            INPREF        15A         TEXT('Payment Reference')
     A                                      COLHDG('Payment' 'Reference')
      *
     A            INORTY         2A         TEXT('Ordering Type')
     A                                      COLHDG('Ordering' 'Type')
      *
     A            INBETY         2A         TEXT('Beneficiary Type')
     A                                      COLHDG('Beneficiary' 'Type')
      *
     A            INOPCO         3A         TEXT('IBLC Operation Code')
     A                                      COLHDG('IBLC' 'Operation' 'Code')
      *
     A            INCOCO         2A         TEXT('Country Code')
     A                                      COLHDG('Country' 'Code')
      *
     A            INIDCO         2A         TEXT('Identification Code')
     A                                      COLHDG('Identification' 'Code')
      *
     A            INIDEN         9A         TEXT('Identification')
     A                                      COLHDG('Identification')
      *
      ***  KEY List
      *
     A          K INPREF
      *
