      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_RU                                                        *
/*EXI *  TEXT('Midas FT Loro Correspondent relationship')
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTLCORP0 - Loro Correspondent relationship                *
      *                                                               *
      *  (C) Copyright Misys IBS Ltd. 2003                            *
      *                                                               *
      *  Last Amend No. MD031937           Date 13Jan15               *
      *  Prev Amend No. AR856737           Date 13Sep11               *
      *                 ESL038             Date 04Oct2004             *
      *                 EEE058   *Create   Date 19Mar2003             *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD031937 - Upgrade STP enhancements to BF Midas 2.1          *
      *  AR856737 - Upgrade STP enhancements to Midas Plus level      *
      *  ESL038 - ING STP Development                                 *
      *  EEE058 - Incominng STP                                       *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R @BCORP0                   TEXT('(C) Misys IBS  +
     A                                      . 2003')
      *---------------------------------------------------------------------
     A            BDBICC         8          TEXT('BIC (Bank, Country, & Loc')
     A                                      COLHDG('BIC Code' +
     A                                             'Bank, Country, ' +
     A                                             'Location')
     A            BDBICB         3          TEXT('BIC (Branch Code)')
     A                                      COLHDG('BIC' +
     A                                             'Branch' +
     A                                             'Code')
     A            BDLCCY         3          TEXT('Loro A/c ccy')
     A                                      COLHDG('Loro' +
     A                                             'A/c' +
     A                                             'Ccy')
     A            BDM191         1          TEXT('OUR Mt191 Ind.')
     A                                      COLHDG('OUR' +
     A                                             'Mt191 Ind.')
     A            BDM900         1          TEXT('OUR Mt900 ind.')
     A                                      COLHDG('OUR' +
     A                                             'Mt900 ind.')
     A            BDINS1        35          TEXT('Institution Name 1')
     A                                      COLHDG('Institution Name 1')
     A            BDINS2        35          TEXT('Institution Name 2')
     A                                      COLHDG('Institution Name 2')
     A            BDINS3        35          TEXT('Institution Name 3')
     A                                      COLHDG('Institution Name 3')
      *
     A            BDRECI         1          TEXT('Record Identifier')
     A                                      COLHDG('Record' +
     A                                             'Indentifier')
      *
      *---------------------------------------------------------------------
     A            BDDES1        35          TEXT('Description 1')
     A                                      COLHDG('Description 1')
     A            BDDES2        35          TEXT('Description 2')
     A                                      COLHDG('Description 2')
     A            BDDES3        35          TEXT('Description 3')
     A                                      COLHDG('Description 3')
      *
      *
      *---------------------------------------------------------------------
      * Audit information
     A            BDAJOB    R               TEXT('Job name')
     A                                      COLHDG('Job name')
     A                                      REFFLD(JOJOB)
     A            BDAUSR        10          TEXT('User name')
     A                                      COLHDG('User name')
     A            BDATIM         6  0       TEXT('Action Time')
     A                                      COLHDG('Action' +
     A                                             'Time')
     A            BDARDT         7          TEXT('Action Date')
     A                                      COLHDG('Action' +
     A                                             'Date')
     A            BDAACT         1          TEXT('Action Type')
     A                                      COLHDG('Action' +
     A                                             'Type')
     A            BDRDNB         5  0       TEXT('Run day number')
     A                                      COLHDG('Run day' +
     A                                             'number')
      *
     A*=====================================================================
