      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_RU                                                        *
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTMCCYP0 - STP - List of Main Currency and when Payment   *
      *                can be made flags                              *
      *                                                               *
      *  (C) COPYRIGHT Misys ibs Ltd 2011.                            *
      *                                                               *
      *  Last Amend No. MD31937            Date 13Jan15               *
      *  Last Amend No. AR856737           Date 13Sep11               *
      *  Last Amend No. HVB016   *CREATE   Date 16Nov2011             *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD31937  - Upgrade STP enhancements to BF Midas 2.1          *
      *  AR856737 - Upgrade STP enhancements to Midas Plus level      *
      *  HVB016 - STP Check if currency is one of the main ccy        *
      *                                                               *
      *****************************************************************
      *                                                               *
     A                                      REF(MFRFL)
     A*=====================================================================
     A          R FTMCCYD0                  TEXT('(C) Misys 2011')
     A*---------------------------------------------------------------------
     A            FTCCY          3          TEXT('Currency Code')
     A                                      COLHDG('Currency Code')
      *
     A            FTTDAY         1          TEXT('Same Day')
     A                                      COLHDG('Today')
      *
     A            FTNDAY         1          TEXT('Next Day')
     A                                      COLHDG('Next Day')
      *
     A            FTSDAY         1          TEXT('Spot Day')
     A                                      COLHDG('Spot Day')
      *
      *
      ** KEY LIST
     A          K FTCCY
     A*=====================================================================
