      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_RU                                                        *
/*EXI *  TEXT('Midas FT Cut Off Time for Network')
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTNCOTPO - Cut Off Time for Network                       *
      *                                                               *
      *  (C) Copyright Misys IBS Ltd. 2003                            *
      *                                                               *
      *  Last Amend No. MD031937           Date 13Jan15               *
      *  Prev Amend No. AR856737           Date 13Sep11               *
      *                 ESL038             Date 04Oct2004             *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD031937 - Upgrade STP enhancements to BF Midas 2.1          *
      *  AR856737 - Upgrade STP enhancements to Midas Plus level      *
      *  ESL038 - ING STP Development                                 *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R @NCOTP0                   TEXT('(C) Misys IBS  +
     A                                      . 2003')
      *---------------------------------------------------------------------
     A            NNNWRK         6          TEXT('Networky')
     A                                      COLHDG('Network')
     A            NNFX           1          TEXT('FX Flag')
     A                                      COLHDG('FX FLag')
     A            NNNCOT         4S 0       TEXT('Cot Off Time')
     A                                      COLHDG('Cut Off' +
     A                                             'Time')
      *
     A*=====================================================================
