      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_SN                                                        *
/*EXI *  TEXT('Midas FT Payment Date Offset Codes')
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTPDOCPD - Payment Date Offset Codes                      *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. BUG433             Date 02Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *  Prev Amend No. CFT009  *CREATE    Date 05JUN00               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  BUG433 - File now shares format with global equivalent       *
      *  CFT009 - Funds Transfer Fees and Charges                     *
      *                                                               *
      *****************************************************************
      *                                     Start of Change BUG433
     A          R FTPDOCD0                  FORMAT(GZFTPDOCPD)
     A**********                            REF(MFRFL)
      **********
     A**********R FTPDOCD0                  TEXT('(c) Misys International +
     A**********                            Banking Systems Ltd. +
     A**********                            2001')
      **********
     A**********  PYDTOC    R               REFFLD(DBFL)
     A**********                            TEXT('Payment date offset code')
     A**********                            COLHDG('Payment date offset' +
     A**********                            'Code')
      **********
     A**********  PYDTOD    R               REFFLD(BDES)
     A**********                            TEXT('Off Set Description')
     A**********                            COLHDG('Off Set Description')
      **********
     A**********  LSTTIM    R               REFFLD(CHAP)
     A**********                            TEXT('Local Start Time')
     A**********                            COLHDG('Local Start Time')
      **********
     A**********  LCUTOF    R               REFFLD(CHAP)
     A**********                            TEXT('Local cut-off time')
     A**********                            COLHDG('Local cut-off time')
      **********
     A**********  BCOSDO    R               REFFLD(CHAP)
     A**********                            TEXT('Before cut-off settle'+
     A**********                            'Date Offset')
     A**********                            COLHDG('Before cut-off ' +
     A**********                            'Settle Date Offset')
      **********
     A**********  BCOPDO    R               REFFLD(CHAP)
     A**********                            TEXT('Before cut-off Payment '+
     A**********                            'Date Offset')
     A**********                            COLHDG('Before cut-off ' +
     A**********                            'Payment Date Offset')
      **********
     A**********  ACOSDO    R               REFFLD(CHAP)
     A**********                            TEXT('After cut-off settle '+
     A**********                            'date offset')
     A**********                            COLHDG('After cut-off ' +
     A**********                            'settle Date Offset')
      **********
     A**********  ACOPDO    R               REFFLD(CHAP)
     A**********                            TEXT('After cut-off payment '+
     A**********                            'date offset')
     A**********                            COLHDG('After cut-off ' +
     A**********                            'payment Date Offset')
      *                                     End of Change BUG433
