      *================================================================
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FT Payment Reference Control')
      *================================================================
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTPREFPD - Midas FT Payment Reference Control File        *
      *                                                               *
      *                                                               *
      *  (c) Finastra International Limited 2004                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. BUG4776  *CREATE   Date 12Nov04               *
      *                 NNNNNN             Date DDMmmYY               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  BUG4776 - Correct skipping of transaction reference.         *
      *                                                               *
      *===============================================================*
      *                                                               *
      *  Formats     Description                                      *
      *  ~~~~~~~     ~~~~~~~~~~~                                      *
      *  FTPREFDF    FT Payment Reference Control File                *
      *                                                               *
      *===============================================================*
      *
     A          R FTPREFDF                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2004')
      *
     A            MLRECI         1A         TEXT('Record ID')
     A            MLPYTP         2A         TEXT('Payment Type')
     A            MLPREF        13A         TEXT('Payment Ref')
      *
      *================================================================
