      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_SN                                                        *
/*EXI *  TEXT('Midas FT Payment Charge Defaults')
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTPYCGPD - Payment Charge Defaults                        *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *  Prev Amend No. CFT009  *CREATE    Date 30May00               *
      *                 XXXXXX             Date DDMmmYY               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CFT009 - Funds Transfer Fees and Changes                     *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R FTPYCGD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A            BRANCH    R               REFFLD(BCCY)
     A                                      TEXT('Branch.')
     A                                      COLHDG('Branch.')
      *
     A            CUSTOM    R               REFFLD(ACCK)
     A                                      TEXT('Customer.')
     A                                      COLHDG('Customer.')
      *
     A            TRNTYP    R               REFFLD(CKEN)
     A                                      TEXT('Transaction +
     A                                           type.')
     A                                      COLHDG('Transaction' +
     A                                             'type')
      *
     A            TRSBTY    R               REFFLD(CKEN)
     A                                      TEXT('Transaction +
     A                                           sub-type.')
     A                                      COLHDG('Transaction ' +
     A                                             'sub-type.')
      *
     A            CSGRCD    R               REFFLD(ATST)
     A                                      TEXT('Customer +
     A                                           grouping +
     A                                           code.')
     A                                      COLHDG('Customer' +
     A                                             'grouping' +
     A                                             'code.')
      *
     A            CURRCY    R               REFFLD(BCCY)
     A                                      TEXT('Currency.')
     A                                      COLHDG('Currency.')
      *
     A            PDESCR    R               REFFLD(BNC1)
     A                                      TEXT('Default Description.')
     A                                      COLHDG('Default Description.')
      *
     A            FXSPST    R               REFFLD(DBFL)
     A                                      TEXT('FX spread set +
     A                                           (from Exchange +
     A                                           Spread table).')
     A                                      COLHDG('FX spread set' +
     A                                             '(from exchange' +
     A                                             'spread table).')
      *
     A            PDOFCD    R               REFFLD(DBFL)
     A                                      TEXT('Payment date +
     A                                           offset code.')
     A                                      COLHDG('Payment date' +
     A                                             'offset code.')
      *
     A            TXCHCD    R               REFFLD(DBFL)
     A                                      TEXT('Telex +
     A                                           charge +
     A                                           code.')
     A                                      COLHDG('Telex' +
     A                                             'charge' +
     A                                             'code.')
      *
     A            CHCHRG    R               REFFLD(DBFL)
     A                                      TEXT('Cheque +
     A                                           charge.')
     A                                      COLHDG('Cheque' +
     A                                             'charge.')
      *
     A            CABCHC    R               REFFLD(DBFL)
     A                                      TEXT('Costs abroad +
     A                                           charge code.')
     A                                      COLHDG('Costs abroad' +
     A                                             'charge code.')
      *
     A            SWSTCH    R               REFFLD(DBFL)
     A                                      TEXT('S.W.I.F.T. +
     A                                           standard charge')
     A                                      COLHDG('S.W.I.F.T.' +
     A                                             'standard' +
     A                                             'charge.')
      *
     A            SWPRCH    R               REFFLD(DBFL)
     A                                      TEXT('S.W.I.F.T. +
     A                                           priority +
     A                                           charge.')
     A                                      COLHDG('S.W.I.F.T.' +
     A                                             'priority' +
     A                                             'charge.')
      *
     A            MISCHG    R               REFFLD(DBFL)
     A                                      TEXT('Miscellaneous +
     A                                           charge.')
     A                                      COLHDG('Miscellaneous' +
     A                                             'charge.')
      *
     A            MISCH1    R               REFFLD(DBFL)
     A                                      TEXT('Miscellaneous +
     A                                           charge 1.')
     A                                      COLHDG('Miscellaneous' +
     A                                             'charge 1.')
      *
     A            MISCH2    R               REFFLD(DBFL)
     A                                      TEXT('Miscellaneous +
     A                                           charge 2.')
     A                                      COLHDG('Miscellaneous' +
     A                                             'charge 2.')
      *
     A            MISCH3    R               REFFLD(DBFL)
     A                                      TEXT('Miscellaneous +
     A                                           charge 3.')
     A                                      COLHDG('Miscellaneous' +
     A                                             'charge 3.')
      *
     A            MISCH4    R               REFFLD(DBFL)
     A                                      TEXT('Miscellaneous +
     A                                           charge 4.')
     A                                      COLHDG('Miscellaneous' +
     A                                             'charge 4.')
      *
     A            MISCH5    R               REFFLD(DBFL)
     A                                      TEXT('Miscellaneous +
     A                                           charge 5.')
     A                                      COLHDG('Miscellaneous' +
     A                                             'charge 5.')
      *
     A            TRCMCH    R               REFFLD(DBFL)
     A                                      TEXT('Transfer +
     A                                           commission +
     A                                           charge.')
     A                                      COLHDG('Transfer' +
     A                                             'commission' +
     A                                             'charge.')
      *
     A            FXCHCC    R               REFFLD(DBFL)
     A                                      TEXT('FX/Change +
     A                                           commission +
     A                                           charge.')
     A                                      COLHDG('FX/Change' +
     A                                             'commission' +
     A                                             'charge.')
      *
     A            ADVCHG    R               REFFLD(DBFL)
     A                                      TEXT('Advice +
     A                                           charge.')
     A                                      COLHDG('Advice' +
     A                                             'charge.')
      *
     A            TELCHG    R               REFFLD(DBFL)
     A                                      TEXT('Telephone +
     A                                           charge.')
     A                                      COLHDG('Telephone' +
     A                                             'charge.')
      *
     A            COLCHG    R               REFFLD(DBFL)
     A                                      TEXT('Collection +
     A                                           charge.')
     A                                      COLHDG('Collection' +
     A                                             'charge.')
      *
     A            CORCHG    R               REFFLD(DBFL)
     A                                      TEXT('Correspondents +
     A                                           charge.')
     A                                      COLHDG('Correspondents' +
     A                                             'charge.')
      *
     A            DEDCHG    R               REFFLD(DBFL)
     A                                      TEXT('Deductions +
     A                                           charge.')
     A                                      COLHDG('Deductions' +
     A                                             'charge.')
      *
