      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_RU                                                        *
/*EXI *  TEXT('Midas FT Quote Override Screen shown ')
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTQOVRP0 - FT Quote Override Screen shown                 *
      *                                                               *
      *  (C) Copyright Misys IBS Ltd. 2003                            *
      *                                                               *
      *  Last Amend No. MD031937           Date 13Jan15               *
      *  Prev Amend No. AR856737           Date 13Sep11               *
      *                 ESL038             Date 04Oct2004             *
      *                 E00030             Date 15Dec2003             *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD031937 - Upgrade STP enhancements to BF Midas 2.1          *
      *  AR856737 - Upgrade STP enhancements to Midas Plus level      *
      *  ESL038 - ING STP Development                                 *
      *  E00030 - FT Override FX Rate against convention              *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R @QOVRP0                   TEXT('(C) Misys IBS  +
     A                                      . 2003')
      *---------------------------------------------------------------------
     A            QOPREF        16          TEXT('Payment Reference')
     A                                      COLHDG('Payment' +
     A                                             'Reference')
     A            QOAJOB    R               TEXT('Job name')
     A                                      COLHDG('Job name')
     A                                      REFFLD(JOJOB)
     A            QOAUSR        10          TEXT('User name')
     A                                      COLHDG('User name')
     A            QOAJNO    R     S         TEXT('Job number')
     A                                      COLHDG('Job' +
     A                                             'number')
     A                                      REFFLD(JONBR)
     A            QOACTN        10          TEXT('Action')
     A                                      COLHDG('Action')
     A            QOATIM         6  0       TEXT('Action Time')
     A                                      COLHDG('Action' +
     A                                             'Time')
     A*=====================================================================
