      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_RU                                                        *
/*EXI *  TEXT('Midas FT SWIFT Keys file')
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTSWKYP0 - SWIFT Keys file                                *
      *                                                               *
      *  (C) Copyright Misys IBS Ltd. 2004                            *
      *                                                               *
      *  Last Amend No. MD031937           Date 13Jan15               *
      *  Prev Amend No. AR856737           Date 13Sep11               *
      *                 ESL038             Date 22Feb2005             *
      *                 EEE065             Date 01Jan2004             *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD031937 - Upgrade STP enhancements to BF Midas 2.1          *
      *  AR856737 - Upgrade STP enhancements to Midas Plus level      *
      *  ESL038 - ING STP Development                                 *
      *  EEE065 - FT SWIFT Keys                                       *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R @SWKYP0                   TEXT('(C) Misys IBS  +
     A                                      . 2004')
      *
     A            BANKID         8A         TEXT('Bank SWIFT ID')
     A                                      COLHDG('Bank SWIFT ID')
     A            BRANCH        11A         TEXT('Branch id')
     A                                      COLHDG('Branch id')
     A            BANKKEY        8A         TEXT('Bank Key - Counterparty')
     A                                      COLHDG('Bank Key ' +
     A                                           'Counterparty')
     A            BRANKEY       11A         TEXT('Branch Key Counterparty')
     A                                      COLHDG('Branch Key ' +
     A                                           'Counterparty')
     A            KEYDATA       53A         TEXT('Key data')
     A            KEYFLAG        1A         TEXT('0=Has key, 5=No key')
     A                                      COLHDG('0=Has Key ' +
     A                                           '5=No Key')
     A            FILLER1       38A         TEXT('Filler 1 - spaces')
     A            FLAG9          1A         TEXT('Flag=9,   Detail Rec')
     A            FILLER       893A         TEXT('Filler')
      * ESL038 Start
      *
     A            SWRECI         1          TEXT('Record Identifier')
     A                                      COLHDG('Record' +
     A                                             'Indentifier')
      *
      *
      *---------------------------------------------------------------------
      * Active Dates
      *
     A            SWSTAT         1          TEXT('Status' )
     A                                      COLHDG('Status')
     A            SWSTDT         5S 0       TEXT('Start Date')
     A                                      COLHDG('Start' +
     A                                             'Date')
     A            SWENDT         5S 0       TEXT('End Date')
     A                                      COLHDG('End' +
     A                                             'Date')
      *
      *---------------------------------------------------------------------
      * Audit information
     A            SWAJOB    R               TEXT('Job name')
     A                                      COLHDG('Job name')
     A                                      REFFLD(JOJOB)
     A            SWAUSR        10          TEXT('User name')
     A                                      COLHDG('User name')
     A            SWATIM         6  0       TEXT('Action Time')
     A                                      COLHDG('Action' +
     A                                             'Time')
     A            SWARDT         7          TEXT('Action Date')
     A                                      COLHDG('Action' +
     A                                             'Date')
     A            SWAACT         1          TEXT('Action Type')
     A                                      COLHDG('Action' +
     A                                             'Type')
     A            SWRDNB         5  0       TEXT('Run day number')
     A                                      COLHDG('Run day' +
     A                                             'number')
      * ESL038 End
      *
      *****************************************************************
