      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas FF Generated Account Keys')
      *****************************************************************
      *                                                               *
      *  Midas   FINANCIAL FUTURES AND OPTIONS MODULE                 *
      *                                                               *
      *  LF/MXAKFFL1 - FF GENERATED ACCOUNT KEYS                      *
      *                                                               *
      *  (c) Finastra International Limited 2005                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      *                 LLN021             Date 07Dec03               *
      *                 LLN021  *CREATE    Date 13Nov03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  LLN021 - New file created to incled EOC account keys         *
      *  LLN021 - BoE Profit and Loss return                          *
      *                                                               *
      ********************************************************************
      * LLN021
     A********* R FOKEYDF                   PFILE(FOKEYD)
     A          R FOKEYDF                   PFILE(BYFOKYPP)
      * LLN021
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2003')
      *
     A          K BRCA
     A          K FFKY
     A          K CCY
      *
