      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXI *  TEXT('Midas MX Daily Events - Lending Loans')                *
/*E*S****LF_IM                                                        *                     BUG18304
/*EXS *  LF_IMNM                                                      *                     BUG18304
/*E*I****MBR(MXDELELL1)*DTAMBRS((MXDELELPD*(CLZZ*CLGU)))***************                       LLN022
/*EXI *  MBR(CLLN ) DTAMBRS((MXDELELPD (CLLN CLGU CLPS)))             *                       LLN022
/*X*IA**ADDLFM*FILE(MXDELELL1)*MBR(CLPS)*DTAMBRS((MXDELELPD*(CLPS)))***         LLN022 /*AR1015742*/
/*X*IB**ADDLFM*FILE(MXDELELL1)*MBR(CLGU)*DTAMBRS((MXDELELPD*(CLGU)))***         LLN022 /*AR1015742*/
/*X*IC**ADDLFM*FILE(MXDELELL1)*MBR(CLZZ)*DTAMBRS((MXDELELPD*(CLZZ)))***         LLN022 /*AR1015742*/
/*XAIA*  ADDLFM FILE(MXDELELL1) MBR(CLPS)                             *                /*AR1015742*/
/*XAIA*  DTAMBRS((MXDELELPD (CLPS)))                                  *                /*AR1015742*/
/*XAIB*  ADDLFM FILE(MXDELELL1) MBR(CLGU)                             *                /*AR1015742*/
/*XAIB*  DTAMBRS((MXDELELPD (CLGU)))                                  *                /*AR1015742*/
/*XAIC*  ADDLFM FILE(MXDELELL1) MBR(CLZZ)                             *                /*AR1015742*/
/*XAIC*  DTAMBRS((MXDELELPD (CLZZ)))                                  *                /*AR1015742*/
      *****************************************************************
      *                                                               *
      *  Midas - Meridian Export Module                               *
      *                                                               *
      *  LF/MXDELELL1 - Daily Events - LENDING Loans                  *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *  Last Amend No. AR1015742          Date 06Aug12               *
      *  Prev Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *                 BUG18304           Date 21Apr08               *
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 LLN022             Date 24Jan05               *
      *                 CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *                 190997             Date 23Mar01               *
      *                 189208             Date 25Jan01               *
      *                 CMX001  *CREATE    Date 01Jan00               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  AR1015742 - Compilation error for creation parameter         *
      *  CLE148 - Alpha Loan Reference (Recompile)                    *
      *  BUG18304 - Error adding LF members to MXDELELL1              *
      *  LLN022 - BOE Upgrade to MidasPlus (apply LLN021 changes)     *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  190997 - Duplication of data sent to Meridian                *
      *  189208 - Consolidation of Loans & participations into 1 fmt  *
      *  CMX001 - Meridian Export                                     *
      *                                                               *
      *****************************************************************
      *
     A          R MXDELELP0                 PFILE(MXDELELPD)
                                            TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
 
     A          K LNNO
     A          K EDAT
