      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE PF reflecting DTAARA layout')
     A*****************************************************************
     A*                                                               *
     A*  Midas CUSTOMER LENDING MODULE
     A*                                                               *
     A*  PF/LETEMP     COPY OF LESTAT FOR C.O.B. UPDATE               *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. MOF60              Date 20Feb92               *
      *                 S01310             Date 12Aug91               *
     A*                  E00000            DATE 00XXX00               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  NOTE: Any fix applied to this file may also need to be       *
     A*        applied to the core DTAARA source.                     *
     A*        See also LETEMP and LETMPR.                            *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     A*  MOF60  - CUSTOMER PROFITABILITY & FEES PROCESSING            *
     A*  S01310 - SWIFT RATIONALISATION                               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A          R LETEMPF
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            FLSETUP        5          TEXT('FILE/TABLE SETUP FLAG -      +
     A                                      POSN.1 to 5')
     A            STPCNF         1          TEXT('STOP CONFIRMATIONS PRINT FLAG+
     A                                       - POSN.6')
     A            PYRCV          1          TEXT('PAY/RECEIVE ACTIVE FLAG -    +
     A                                      POSN.7')
     A            AKMSG          1          TEXT('ACCOUNT KEYS MISSING FLAG    +
     A                                      POSN.8')
     A            HSTPROC        3          TEXT('HISTORY PROCESSING FLAG      +
     A                                      POSN.9 to 11')
     A            SPFLG1         3          TEXT('SPARE FLAGS - POSN.12 to 14')
     A            EXTFLG         1          TEXT('EXTRACT FLAG - POSN.15')
     A            SPFLG2         3          TEXT('SPARE FLAGS - POSN.16 to 18')
      */MOF60/                                                      /MOF60/
     A************ZZ0015        15          TEXT('FILLER - POSN.19 to 33')
     A            CODT           5P 0       TEXT('CONTROL DATE - +
     A                                      POSN 19-21')
     A            ZZ0012        12          TEXT('FILLER - POSN.22 to 33')
      */MOF60/                                                      /MOF60/
     A            TLXRCV         1          TEXT('TELEX RECOVERY FLAG          +
     A                                      POSN.34')
      */S01310/                                                     /S01310/
     A            ZZ0063        63          TEXT('FILLER - POSN.34 to 97')
     A            LECE           1          TEXT('LENDING CONF PHASE')
     A            LEPR           1          TEXT('LENDING P/R PHASE')
     A            ZZ0157       157          TEXT('FILLER - POSN.100 to 256')
     A************ZZ0222*******222          TEXT('FILLER - POSN.35 to 256')
      */S01310/                                                     /S01310/
     A*
