000100220121     H        1
000101220121      *****************************************************************
000102220121/*STD *  RPGBASE                                                      *
000103220121/*EXI *  TEXT('Events by Currency with Running Totals Company')       *
000104220121     F*****************************************************************
000105220121     F*                                                               *
000106220121     F*  Midas - Dealing Module
000107220121     F*                                                               *
000108220121     F*  GL0559 - Events by Currency with Running Totals - Company    *
000109220121      *                                                               *
000110220121      *     Note: Any changes to GL0552 should be considered for      *
000111220121      *           this program.                                       *
000112220121      *                                                               *
000113220121      *  (c) Finastra International Limited 2021                      *
000114220121      *                                                               *
000115220121      *  Last Amend No. CGL091 *Create     Date 02Nov21               *
000116220121     F*                                                               *	
000117220121     F*---------------------------------------------------------------*
000118220121      *                                                               *
000119220121      *  CGL091 - Events by Currency with Running Totals Report       *
000120220121     F*                                                               *
000121220121     F*  THIS PROGRAM IS A NEW PROGRAM FOR RELEASE 10 - BASED ON      *
000122220121     F*  DL0550. FIXES MADE TO DL0550 HAVE BEEN INCLUDED AS WELL AS   *
000123220121     F*  S01196  -  REMOVE PROCESSING FOR LETTERS OF CREDIT AND       *
000124220121     F*  S01194  -  NEW STANDING DATA - USE ACCESS PROGRAMS           *
000125220121     F*****************************************************************
000126220121     F*EVNTML2*IP**E***********K********DISK***************************   E172
000127220121     F*EVNTML10IP**E***********K        DISK                         E172 CEU011
000128220121      *                                                                   CEU011
000129220121     FDLEVNTLAIP  E           K        DISK                               CEU011
000130220121      *                                                                   CEU011
000131220121      ** Midas Merged Events File                                         CEU011
000132220121     FTREVEA  IF  E                    DISK
000133220121     FCPEVEA  IF  E                    DISK
000134220121     FDPEVEA  IF  E                    DISK
000135220121     FBPEVEA  IF  E                    DISK
000136220121     FDRSDEALSIF  F    1074  6AI     2 DISK                               S01392
000137220121     FDEALS   IF  E           K        DISK                                                 AR743357
000138220121     F            DEALSDAF                          KIGNORE                                 AR743357
000139220121     F            DEALSDBF                          KIGNORE                                 AR743357
000140220121     F            DEALSDCF                          KIGNORE                                 AR743357
000141220121     F            DEALSDDF                          KIGNORE                                 AR743357
000142220121     F            DEALSDEF                          KIGNORE                                 AR743357
000143220121     F            DEALSDFF                          KIGNORE                                 AR743357
000144220121     FINTYP   IF  E           K        DISK                                                   CGL091
000145220121     FDLDTSCL5IF  E           K        DISK                                                   CGL091
000146220121     FDLDLDGDEIF  E           K        DISK                                                   CGL091
000147220121     F            DEALSDGF                          KRENAMEDEALSDGE                           CGL091
000148220121     FCLOAN   IF  E           K        DISK                           UC  CLE004
000149220121     F            CLOANHHF                          KIGNORE               CLE004
000150220121     F            CLOANCKF                          KIGNORE               CLE004
000151220121     F            CLOANZ1F                          KIGNORE               CLE004
000152220121     F*NOSEXEC*O***F*****320************DISK                              E193
000153220121     F*NOSEXED*O***F*****320************DISK                              E193
000154220121     F*NOSEXCC*O***F*****320************DISK                              E193
000155220121     F*NOSEXEL*O***F*****320************DISK                              E193
000156220121     F*NOSEXES*O***E********************DISK                      A       E193
000157220121     F*NOSEXSE*O***E********************DISK                      A       E193
000158220121     F*NOSEXFP*O***E********************DISK                      A       E193
000159220121     F*NOSEXZZ*O***F*****320************DISK                              E193
000160220121     F**DL0552AUO***F***132*****OV*****PRINTER******KINFDS SPOOLU         E257
000161220121     F**DL0552P1O***F***132*****OF*****PRINTER******KINFDS SPOOL      UC  E257
000162220121     F**DL0550AUO***F***132*****OV*****PRINTER******KINFDS SPOOLU    E257 LN0746
000163220121     F**DL0550P1O***F***132*****OF*****PRINTER******KINFDS SPOOL UC  E257 LN0746
000164220121     F*DL0552AUO**F*****132*****OV*****PRINTER      KINFDS SPOOLU   LN0746E22608
000165220121     F*DL0552P1O**F*****132*****OF*****PRINTER      KINFDS SPOOLUC  LN0746E22608
000166220121     FGL0559AUO   F     132     OV     PRINTER      KINFDS SPOOLU         E22608
000167220121     FGL0559P1O   F     132     OF     PRINTER      KINFDS SPOOL      UC  E22608
000168220121     FGL0559P2O   E             79     PRINTER      KINFDS SPOOL2     UC  CLE004
000169220121     F* ID F  C  H  L    FUNCTION OF INDICATORS
000170220121     F* 01            EVENT HEADER
000171220121     F* 02            EVENT DETAIL - DEAL EVENT
000172220121     F* 03            EVENT DETAIL - COMMERCIAL LOAN EVENT
000173220121     F* 04            EVENT TRAILER
000174220121     F*       11      NEGATIVE INTEREST INDICATOR
000175220121     F* 12            EVENT TRAILER - COMMERCIAL LOAN EVENT
000176220121     F* 13            CUSTOMER LENDING EVENT
000177220121     F* 14            CUSTOMER LENDING EVENTS FILE TRAILER
000178220121     F* 15            Letters of Credit event details                     CTI001
000179220121     F* 16            Letters of credit event trailer                     CTI001
000180220121     F**17******      SECURITIES TRADING EVENT DETAIL                     E20669
000181220121     F**18******      SECURITIES TRADING EVENT TRAILER                    E20669
000182220121     F*    19         END OF FILE ON EVENTS TRAILERS
000183220121     F*    20         FULL INSTRUCTIONS PRESENT INDICATOR IS BLANK - DEAL
000184220121     F*    21         INCOMING/OUTGOING INDICATOR IS BLANK
000185220121     F*    22         OTHER DATE IS ZERO
000186220121     F*    23         INTEREST/EXCHANGE RATE IS ZERO
000187220121     F*    24         DEALING TRAILER HAS BEEN READ
000188220121     F*    25         REPORTING SECURITY SHORTNAME FOR COUPON/MATURITY
000189220121     F*    26         TRADE EVENTS DETAIL HAS BEEN READ
000190220121     F*    27         CUSTOMER POSITION EVENTS DETAIL HAS BEEN READ
000191220121     F*    28         DEPOT POSITION EVENTS DETAIL HAS BEEN READ
000192220121     F*****29**       BOOK POSITION EVENTS DETAIL HAS BEEN READ           E20669
000193220121      *    29         EMU Position/Risk Enquiries & Reports               CEU011
000194220121      *                   feature indicator                               CEU011
000195220121     F*       30      CURRENCY HAS 0 D.P.
000196220121     F*       31      CURRENCY HAS 1 D.P.
000197220121     F*       32      CURRENCY HAS 2 D.P.
000198220121     F*       33      CURRENCY HAS 3 D.P.
000199220121     F*      N34      NO DETAILS TO REPORT
000200220121     F********35******PRINT*DEALT*BASE*CCY*RATE*FOR*FX*EVENTS*-*DEALS*****090909
000201220121     F*       36      NEGATIVE AMOUNT IN HASH TOTALLING
000202220121     F* 37            FUNDS TRANSFER EVENT DETAIL
000203220121     F* 38            FUNDS TRANSFER EVENT TRAILER
000204220121     F********39      WHOLE BOOK TO BE REPORTED                           S01243
000205220121      *    39         'In' ccy indicator                                  CEU011
000206220121     F********40      NUMBER OF DAYS ENTERED BY OPERATOR IS LESS THAN 5   S01243
000207220121     F*       40      NUMBER OF DAYS IS LESS THAN 5                       S01243
000208220121     F*      N41      EVENT IS TO BE REPORTED
000209220121     F*       42      EVENT CODE ENDS WITH 'M1' DEAL EVENT ONLY
000210220121     F*       43      OUTPUT NEW CURRENCY HEADINGS
000211220121     F*       48      COMMITMENT FEE EVENT
000212220121     F*       49      FIRST CYCLE INDICATOR
000213220121     F*       50      TABLE ACCESS SUCCESSFUL
000214220121     F********51******DAYS FORWARD HAS NOT BEEN SET                       036796
000215220121     F******************(CAN OCCUR IF ST. BUT NOT DL. IS IN THE SYSTEM.)  036796
000216220121     F*       52      NO EVENTS ON CHANGE OF COMPANY
000217220121     F*       53      CSE007 present                                      CSE007
000218220121     F*       53      CEU017 present                                      CEU017
000219220121     F*       54      ER event narrative to be printed                    CSE007
000220220121     F*       55      NO DETAILS TO PRINT FOR THIS BRANCH
000221220121     F*       58      MULTIBRANCHING OUTPUT INDICATOR
000222220121     F*       60      INCOMING/OUTGOING INDICATOR EQUALS 'I'
000223220121     F*       61          '       '         '        '   'O'
000224220121     F*       62      ER event narrative to be printed                    S01496
000225220121     F*       63      S01496 present                                      S01496
000226220121     F*       66      FX Daily Events by Currency Only                    AUS017
000227220121     F*       67      MM Daily Events by Currency Only                    AUS017
000228220121     F*       70      FILE CONTROL TOTALS ZEROISED
000229220121     F*       71      Generated Entries Event Detail                                          CAP204
000230220121     F*       72      Generated Entries Event Trailer                                         CAP204
000231220121     F*       75      MATURITY DATE INDICATOR IS 'O'
000232220121     F*       76      MATURITY DATE INDICATOR IS 'A'
000233220121     F*       78      Chain to CLOAN failed                               CLE004
000234220121     F*       79      Overflow indicator for GL0559P2                     CLE004
000235220121     F********79******Midas/TI Interface is installed               CTI001CLE005
000236220121     F*       80      Midas/TI Interface is installed                     CLE005
000237220121     F* 82            EVNTM DETAIL - FO RECORD
000238220121     F* 83            EVNTM TRAILER- FO RECORD
000239220121     F*       U7 U8   DATABASE ERROR
000240220121     F*             L1CHANGE OF CURRENCY
000241220121     F*       U4      RUN WITH ONLY ST EVENTS
000242220121     F*       U5      SECURITIES TRADING ONE - ONLY , OVERRIDE
000243220121     E                    CPY@    1   1 80
000244220121     E                    INT         4 15 0             HASH TOTALS
000245220121     E                    DEC         4  3 0             HASH TOTALS
000246220121     E                    ZYDY    4   4  4 0             ZDATE1/2 SR.ARRAY
000247220121     E                    ZMDY   13  13  3 0             ZDATE1/2 SR.ARRAY
000248220121     E                    ZMNM   12  12  3               ZDATE2 SR. ARRAY
000249220121     E******************* TABA    1 131  4   TABB   15   EVENT NARRATIVES.S01243
000250220121     E************        TABA    1 132  4   TABB   15   EVENT NARRATIVES.S01243
000251220121     E*                                                                   S01314
000252220121     E** R10 PTF Incorporation changes: fix E23278 adapted from GL0550 forS01314
000253220121     E** this program.                                                    S01314
000254220121     E******************* TABA    1 134  4   TABB   15   EVENT NARR.S01243S01314
000255220121     E********************TABA    1 144  4   TABB   15   EVENT NARR S01314S01270
000256220121     E*****               TABA    1 147  4   TABB   15   EVENT NARRAS01270S01392
000257220121     E********************TABA    1 148  4   TABB   15   EVENT NARRAS01392E34885
000258220121     E********************TABA    1 150  4   TABB   15   EVENT NARRAE34885045634
000259220121     E********************TABA    1 149  4   TABB   15   EVENT NARR045634 S01464
000260220121     E********************TABA    1 150  4   TABB   15   EVENT NARRAS01464073714
000261220121     E*                                                                   S01408
000262220121     E/COPY WNCPYSRC,GL0559EEP1                                           S01408
000263220121     E*                                                                   S01408
000264220121     E********************TABA    1 151  4   TABB   15   EVENT NARRA073714CIR001
000265220121     E********************TABA    1 156  4   TABB   15   EVENT NARRACIR001030749
000266220121     E***********         TABA    1 158  4   TABB   15   EVENT NARR030749 CLE004
000267220121     E********************TABA    1 180  4   TABB   15   EVENT NAR CLE004 CLE005
000268220121     E***********         TABA    1 226  4   TABB   15   EVENT NARRCLE005 CEU003
000269220121     E***********         TABA    1 295  4   TABB   15   EVENT NARRCEU003 142393
000270220121     E***********         TABA    1 299  4   TABB   15   EVENT NARR142393 142388
000271220121     E***********         TABA    1 303  4   TABB   15   EVENT NARR142388 CDL008
000272220121     E**********          TABA    1 305  4   TABB   15   EVENT NARRCDL008 CIR006
000273220121     E**********          TABA    1 306  4   TABB   15   EVENT NARRCIR006 CIR003
000274220121     E**********          TABA    1 310  4   TABB   15   EVENT NARRATIVES              CIR003 CAS009
000275220121     E**********          TABA    1 313  4   TABB   15   EVENT NARRATIVES              CAS009 CAP204
000276220121     E**********          TABA    1 315  4   TABB   15   EVENT NARRATIVES            CAP204 MD055652
000277220121     E                    TABA    1 318  4   TABB   15   EVENT NARRATIVES                   MD055652
000278220121     E*                                                                   S01408
000279220121     E/COPY WNCPYSRC,GL0559EEP2                                           S01408
000280220121     E*                                                                   S01408
000281220121     E*
000282220121      /COPY ZSRSRC,ZHOLE
000283220121      /COPY ZSRSRC,ZSEDITZ1                                               CLE004
000284220121     E*
000285220121     E**  Narratives for Early Redemption Events                          S01496
000286220121     E*                                                                   S01496
000287220121     E                    NARR    1   4 15                                S01496
000288220121     E*                                                                   CSE007
000289220121     E**  Narratives for Corporate Action Events                          CSE007
000290220121     E*                                                                   CSE007
000291220121     E                    NARR1   1   4 15                                CSE007
000292220121      *                                                                                       CLE028
000293220121      ** Event types/narratives for CLE028 (Rule of 78)                                       CLE028
000294220121     E                    TABA2   1   5  4   TABB2  15                                        CLE028
000295220121      *                                                                                       CLE028
000296220121     I*
000297220121     I*    DEALS EVENTS FILE - HEADER RECORD.
000298220121     I*
000299220121     IEVNTXECF    01
000300220121     I*
000301220121     I*    EVENTS FILE - DEALS DETAIL RECORD.
000302220121     I*
000303220121     IEVNTXEDF    02
000304220121     I**************ECPY****************************CMPYM L2               E172
000305220121     I**************EBRC****************************BRCA                   E172
000306220121     I                                              ECPY  L2               E172
000307220121     I                                              ECCY  L1
000308220121     I                                              EXRT            23
000309220121     I                                              OTHD            22
000310220121     I                                              FIPI            20
000311220121     I                                              INOI            21
000312220121     I*                                                                   S01408
000313220121     I/COPY WNCPYSRC,GL0559IIPG                                           S01408
000314220121     I*                                                                   S01408
000315220121     I*
000316220121     I*    MERGED EVENTS FILE - COMMERCIAL LOAN DETAIL RECORD.
000317220121     I*
000318220121     ICEVNXCCF    03
000319220121     I**********************************************CMPYM L2               E172
000320220121     I              CMPYM                           ECPY  L2               E172
000321220121     I                                              ECCY  L1
000322220121     I                                              EINR            23
000323220121     I                                              INOI            21
000324220121     I                                              OTHD            22
000325220121     I**********    LNNO                            DLNO                                      CLE148
000326220121     I              BWCN                            CUNR
000327220121     I              LNTP                            DTYP
000328220121     I              LNST                            DLST
000329220121     I*
000330220121     IBVNTXEDF    15                                                      CTI001
000331220121     I                                              TICM  L2              CTI001
000332220121     I                                              ECCY  L1              CTI001
000333220121      ** Letters of Credit Event Detail                                   CTI001
000334220121      *                                                                   CTI001
000335220121     IBVNTXEZF    16                                                      CTI001
000336220121      ** Letters of Credit Events File Trailer                            CTI001
000337220121     I*    MERGED EVENTS FILE - CUSTOMER LENDING DETAIL RECORD
000338220121     I*
000339220121     ILVENTELF    13
000340220121     I**************ECPY****************************CMPYM L2               E172
000341220121     I                                              ECPY  L2               E172
000342220121     I                                              ECCY  L1
000343220121     I                                              INTR            23
000344220121     I                                              INOI            21
000345220121     I                                              OTHD            22
000346220121     I              LTYP                            DTYP
000347220121     I              SUTP                            DLST
000348220121     I              DFCE                            LCEQ
000349220121     I              CDOM                            CLOC
000350220121     I              ECDP                            DEC1
000351220121     I              FACT                            FTYP
000352220121     I              FCNO                            FSEQ
000353220121     I*
000354220121     I*   SECURITIES TRADING EVENT DETAIL
000355220121     I*
000356220121     I*STEVEABF****17*******************************                      E20669
000357220121     I**************RECI****************************RECIST                E20669
000358220121     I**********************************************CMPYM L2               E172
000359220121     I**************CMPYM***************************ECPY  L2          E172E20669
000360220121     I**********************************************ECCY  L1              E20669
000361220121     I**************ODTE****************************OTHD            22    E20669
000362220121     I**************IOIN                            INOI            21    E20669
000363220121     I**************SBEE                            BCEQ                  E20669
000364220121     I**************DBRT                            DBCR                  E20669
000365220121     I**************TRDR                            DLNO                  E20669
000366220121     I**************TRSE                            DLST                  E20669
000367220121     I**************TRTE                            DTYP                  E20669
000368220121     I**************DNEE                            LCEQ                  E20669
000369220121     I**************OURE                            OSAC                  E20669
000370220121     I**************NOMC                            OTHC                  E20669
000371220121     I**************REGR                            REGC                  E20669
000372220121     I**************SETL                            SETP                  E20669
000373220121     I**************OAME                            OTHA                  E20669
000374220121     I*
000375220121     I*   TRADE EVENT DETAIL
000376220121     I*
000377220121     ITREVEDF     26
000378220121     I              TRRI                            RECI
000379220121     I              TRTR                            TRNO                  055798
000380220121     I              TRSS                            SECS
000381220121     I              TRTT                            DTYP
000382220121     I              TRVD                            EDAT
000383220121     I              TRSC                            ECCY  L1
000384220121     I              TRVS                            EAMT
000385220121     I              TRTS                            DLST
000386220121     I              TRCN                            CRNM
000387220121     I              TRTN                            CTWN
000388220121     I              TRIO                            INOI            21
000389220121     I              TREC                            ETYP
000390220121     I**************COBB****************************CMPYM L2               E172
000391220121     I              COBB                            ECPY  L2               E172
000392220121     I              EARL                            WEARL                 S01496
000393220121     I              COAF                            WCOAF                 CSE007
000394220121     I*
000395220121     I*   CUSTOMER POSTITION EVENTS DETAIL
000396220121     I*
000397220121     ICPEVEDF     27
000398220121     I              CCRN                            CRNM
000399220121     I              CCTR                            CTWN
000400220121     I**************CCDT                            EDAT                  S01512
000401220121     I              CPYD                            EDAT                  S01512
000402220121     I              CCCE                            ETYP
000403220121     I              CCEC                            ECCY  L1
000404220121     I              CCSS                            SECS
000405220121     I              CCIO                            INOI            21
000406220121     I              CCEA                            EAMT
000407220121     I**************COBB****************************CMPYM L2               E172
000408220121     I              COBB                            ECPY  L2               E172
000409220121     I              EARL                            WEARL                 S01496
000410220121     I              COAF                            WCOAF                 CSE007
000411220121     I*
000412220121     I*   DEPOT POSTITION EVENTS DETAIL
000413220121     I*
000414220121     IDPEVEDF     28
000415220121     I              CCDN                            CRNM
000416220121     I              CCTW                            CTWN
000417220121     I**************CCDT                            EDAT                  S01512
000418220121     I              CCPD                            EDAT                  S01512
000419220121     I              CCCE                            ETYP
000420220121     I              CCEC                            ECCY  L1
000421220121     I              CCSS                            SECS
000422220121     I              CCIO                            INOI            21
000423220121     I              CCEA                            EAMT
000424220121     I**************COBB****************************CMPYM L2               E172
000425220121     I              COBB                            ECPY  L2               E172
000426220121     I              EARL                            WEARL                 S01496
000427220121     I              COAF                            WCOAF                 CSE007
000428220121     I*
000429220121     I****BOOK*POSTITION*EVENTS*DETAIL*******                             E20669
000430220121     I**************************************                              E20669
000431220121     I*BPEVEDF*****29**                                                   E20669
000432220121     I**************CCDT                            EDAT                  E20669
000433220121     I**************CCCE                            ETYP                  E20669
000434220121     I**************CCEC                            ECCY  L1              E20669
000435220121     I**************CCSS                            SECS                  E20669
000436220121     I**************CCIO                            INOI            21    E20669
000437220121     I**************CCEA                            EAMT                  E20669
000438220121     I**************COBB****************************CMPYM L2               E172
000439220121     I**************COBB                            ECPY  L2         E172 E20669
000440220121     I*
000441220121     IFPVNTDDF    37
000442220121     I*
000443220121     I*  FUNDS TRANSFER EVENTS DETAIL RECORD
000444220121     I*
000445220121     I                                              ECCY  L1
000446220121     I                                              OTHD            22
000447220121     I                                              INOI            21
000448220121     I**************COBB****************************CMPYM L2               E172
000449220121     I              COBB                            ECPY  L2               E172
000450220121      *                                                                                       CAP204
000451220121      ** ACCOUNT TRANSFER DETAIL RECORD                                                       CAP204
000452220121      *                                                                                       CAP204
000453220121     IGLEVNTDF    71                                                                          CAP204
000454220121     I                                              ECCY  L1                                  CAP204
000455220121     I                                              ECPY  L2                                  CAP204
000456220121     I                                              OTHD            22                        CAP204
000457220121     I*
000458220121     I*
000459220121     I*    DEALS EVENTS FILE - TRAILER RECORD.
000460220121     I*
000461220121     IEVNTXZZF    04
000462220121     I*
000463220121     I*
000464220121     I*    COMMERCIAL LOANS EVENTS FILE - TRAILER RECORD.
000465220121     I*
000466220121     ICEVNXZZF    12
000467220121     I*
000468220121     I*    CUSTOMER LENDING EVENTS FILE TRAILER
000469220121     I*
000470220121     ILVENTZZF    14
000471220121     I*
000472220121     I*    SECURITIES TRADING EVENTS FILE TRAILER
000473220121     I*
000474220121     I*STEVEFCF****18*********                                            E20669
000475220121     I**************HSTA                            HRWN                  E20669
000476220121     I**************HSTB                            HRDC                  E20669
000477220121     I*
000478220121     IFPVNTZZF    38
000479220121     I*
000480220121     I*    FUNDS TRANSFER EVENTS FILE TRAILER
000481220121     I*
000482220121     I              NORE1                           NORE
000483220121     I*
000484220121     I*    EVNTM FILE - FO DETAIL RECORD
000485220121     IFOEVEDF     82
000486220121     I*
000487220121     I                                              ECCY  L1              E178
000488220121     I                                              EXRT            23    E178
000489220121     I                                              INOI            21    E178
000490220121     I*    EVNTM FILE - FO TRAILER
000491220121     IFOEVEZZF    83
000492220121      *                                                                                       CAP204
000493220121      **   ACCOUNT TRANSFER TRAILER RECORD                                                    CAP204
000494220121      *                                                                                       CAP204
000495220121     IGLEVNTZF    72                                                                          CAP204
000496220121     I              ZZ304                           GZZ304                                    CAP204
000497220121     IDRSDEALSNS                                                          S01392
000498220121     I                                    P 214 2200TOTI                  S01392
000499220121      *                                                                                       CGL091
000500220121      * Rename IRS look-ahead fields to prevent corruption                                    CGL091
000501220121     IDLDTSCD0                                                                                CGL091
000502220121     I              DLNO                            @DLNO                                     CGL091
000503220121     I*
000504220121     ISDBANK    E DSSDBANKPD
000505220121     I** EXTERNAL DS FOR BANK DETAILS
000506220121     I*
000507220121     ISDCOMP    E DSSDCOMPPD
000508220121     I** EXTERNAL DS FOR COMPANY DETAILS
000509220121     I*
000510220121     ISDCURR    E DSSDCURRPD
000511220121     I** EXTERNAL DS FOR CURRENCY DETAILS
000512220121     I*
000513220121     ISDGELR    E DSSDGELRPD                                              CEU011
000514220121      ** General ledger details                                           CEU011
000515220121      *                                                                   CEU011
000516220121     ISCSARD    E DSSCSARDPD                                                                  CLE028
000517220121      ** Switchable Features File                                                             CLE028
000518220121      *                                                                                       CLE028
000519220121     IDSFDY     E DSDSFDY                                                 S01194
000520220121     I* FIRST DS FOR ACCESS PROGRAMS, SHORT DATA STRUCTURE                S01194
000521220121     I*                                                                   S01117
000522220121     IDSSDY     E DSDSSDY                                                 S01194
000523220121     I* SECOND DS FOR ACCESS PROGRAMS, LONG DATA STRUCTURE                S01194
000524220121     I*
000525220121     ISDMOD     E DSSDMMODPD                                              CTI001
000526220121     I**  EXTERNAL DS FOR MODULE ID'S                                     CTI001
000527220121     I*                                                                   CTI001
000528220121      *COPY*ZSRSRC,ZHOLI                                                                      CGL091
000529220121      /COPY ZSRSRC,ZHOLIA                                                                     CGL091
000530220121      /COPY ZSRSRC,ZSEDITZ2                                               CLE004
000531220121     I*
000532220121     I*LOT1********DS******                      256                      E193
000533220121     I*********************                   1   1 RECI                  E193
000534220121     I*********************                   2   70DLNO                  E193
000535220121     I***(SOME*FORMATS*FOR EVNTM HAVE CNUM (6,0) , OTHERS CUNR (6A) -     E193
000536220121     I****USE*DATA*STRUCTURE TO ENSURE ALL INPUT IN CNUM.)                E193
000537220121     I*********************                   8  130CNUM                  E193
000538220121     I*********************                   8  13 CUNR                  E193
000539220121     I*********************                  14  17 ETYP                  E193
000540220121     I*********************               P  18  200EDAT                  E193
000541220121     I*********************               P  21  270EAMT                  E193
000542220121     I*********************                  28  30 ECCY                  E193
000543220121     I*********************                  31  320ECSS                  E193
000544220121     I*********************                  33  34 DTYP                  E193
000545220121     I*********************                  35  36 DLST                  E193
000546220121     I*********************                  37  39 BRCA                  E193
000547220121     I*********************               P  40  468EXRT                  E193
000548220121     I*********************                  47  47 NGII                  E193
000549220121     I*********************                  48  500NOTD                  E193
000550220121     I*********************               P  51  530OTHD                  E193
000551220121     I*********************               P  54  600OTHA                  E193
000552220121     I*********************                  61  63 OTHC                  E193
000553220121     I*********************               P  64  700DBCE                  E193
000554220121     I*********************               P  71  770BCEQ                  E193
000555220121     I*********************               P  78  848DBCR                  E193
000556220121     I*********************               P  85  910LCEQ                  E193
000557220121     I*********************                  92  930SETP                  E193
000558220121     I*********************                  94 105 OSAC                  E193
000559220121     I*********************                 106 115 TSEN                  E193
000560220121     I*********************                 116 118 ZZ0116                E193
000561220121     I*********************                 119 119 FIPI                  E193
000562220121     I*********************                 120 120 INOI                  E193
000563220121     I*********************                 121 121 FCTI                  E193
000564220121     I*********************                 122 122 RLVI                  E193
000565220121     I***(SOME*FORMATS*FOR EVNTM HAVE CPAR (6,0) , OTHERS PTNU (6A) -     E193
000566220121     I****USE*DATA*STRUCTURE TO ENSURE ALL INPUT IN CPAR.)                E193
000567220121     I*********************                 123 1280CPAR                  E193
000568220121     I*********************                 123 128 PTNU                  E193
000569220121     I*********************                 129 1290PARI                  E193
000570220121     I*********************                 130 149 CRNM                  E193
000571220121     I*********************                 150 159 CTWN                  E193
000572220121     I*********************                 160 167 CASK                  E193
000573220121     I*********************                 168 187 PRNM                  E193
000574220121     I*********************                 188 197 PTWN                  E193
000575220121     I*********************                 198 205 PASK                  E193
000576220121     I*********************                 206 207 CCTZ                  E193
000577220121     I*********************                 208 209 CLOC                  E193
000578220121     I*********************                 210 211 REGC                  E193
000579220121     I*********************                 212 2140DASN                  E193
000580220121     I*********************               P 215 2170FFVD                  E193
000581220121     I*********************                 218 218 FFIN                  E193
000582220121     I*********************                 219 2210FACT                  E193
000583220121     I*********************                 222 2230FCNO                  E193
000584220121     I*********************                 224 233 FACO                  E193
000585220121     I*********************                 234 256 SPI11                 E193
000586220121     I*LOT2********DS******                       64                      E193
000587220121     I*********************                   1  12 SPI21                 E193
000588220121     I*********************                  13  180CPCN                  E193
000589220121     I*********************                  19  190FSLI                  E193
000590220121     I*********************               P  20  257ICIR                  E193
000591220121     I*********************               P  26  320ICAM                  E193
000592220121     I*********************               P  33  390RBDA                  E193
000593220121     I*********************                  40  40 OCFF                  E193
000594220121     I*********************                  41  63 ZZ0296                E193
000595220121     I*********************                  64  64 TAXI                  E193
000596220121     I*LOT3********DS******                      256                      E193
000597220121     I*********************                   1   1 RECI1                 E193
000598220121     I*********************                   2   70DLNO1                 E193
000599220121     I*********************                   8  130DDNO                  E193
000600220121     I*********************                  14  190CNUM1                 E193
000601220121     I*********************                  20  23 ETYP1                 E193
000602220121     I*********************               P  24  260EDAT1                 E193
000603220121     I*********************               P  27  330EAMT1                 E193
000604220121     I*********************                  34  36 ECCY1                 E193
000605220121     I*********************                  37  380ECSS1                 E193
000606220121     I*********************                  39  40 DTYP1                 E193
000607220121     I*********************                  41  42 DLST1                 E193
000608220121     I*********************                  43  45 BRCA1                 E193
000609220121     I*********************               P  46  480OTHD1                 E193
000610220121     I*********************               P  49  550OTHA1                 E193
000611220121     I*********************                  56  58 OTHC1                 E193
000612220121     I*********************               P  59  650BCEQ1                 E193
000613220121     I*********************               P  66  720LCEQ1                 E193
000614220121     I*********************               P  73  750CSTD                  E193
000615220121     I*********************               P  76  780CMTD                  E193
000616220121     I*********************                  79  790RPYT                  E193
000617220121     I*********************               P  80  857EINR                  E193
000618220121     I*********************                  86  870SETP1                 E193
000619220121     I*********************                  88  99 OSACA                 E193
000620220121     I*********************                 100 109 TSEN1                 E193
000621220121     I*********************               P 110 1179DXRT                  E193
000622220121     I*********************                 118 1180DEC1                  E193
000623220121     I*********************                 119 1190DEC2                  E193
000624220121     I*********************                 120 139 CRNM1                 E193
000625220121     I*********************                 140 149 CTWN1                 E193
000626220121     I**************************************150 157 CASK1                 E193
000627220121     I**************************************158 177 PRNM1                 E193
000628220121     I**************************************178 187 PTWN1                 E193
000629220121     I**************************************188 195 PASK1                 E193
000630220121     I**************************************196 196 INOI1                 E193
000631220121     I**************************************197 197 CYSW                  E193
000632220121     I**************************************198 199 CRSK                  E193
000633220121     I**************************************200 201 CLOC1                 E193
000634220121     I**************************************202 203 REGC1                 E193
000635220121     I**************************************204 204 FFIN1                 E193
000636220121     I************************************P 205 2070FFVD1                 E193
000637220121     I************************************P 208 2140OADD                  E193
000638220121     I************************************P 215 2170LIPD                  E193
000639220121     I************************************  218 2180PARI1                 E193
000640220121     I************************************  219 2240CPAR1                 E193
000641220121     I************************************  225 256 ZZ0225                E193
000642220121     I*LOT4********DS*********************       256                      E193
000643220121     I************************************    1   1 RECI2                 E193
000644220121     I************************************    2   70LNRF2                 E193
000645220121     I************************************    8  130ZZ0008                E193
000646220121     I************************************   14  190CNUM2                 E193
000647220121     I************************************   20  23 ETYP2                 E193
000648220121     I************************************P  24  260EDAT2                 E193
000649220121     I************************************P  27  330EAMT2                 E193
000650220121     I************************************   34  36 ECCY2                 E193
000651220121     I************************************   37  380ECSS2                 E193
000652220121     I************************************   39  40 DTYP2                 E193
000653220121     I************************************   41  42 DLST2                 E193
000654220121     I************************************   43  45 BRCA2                 E193
000655220121     I************************************P  46  480OTHD2                 E193
000656220121     I************************************P  49  550OTHA2                 E193
000657220121     I************************************   56  58 ZZ0056                E193
000658220121     I************************************P  59  650BCEQ2                 E193
000659220121     I************************************P  66  720LCEQ2                 E193
000660220121     I************************************   73  78 ZZ0073                E193
000661220121     I************************************   79  790NGII2                 E193
000662220121     I************************************P  80  857INTR2                 E193
000663220121     I************************************   86  870SETP2                 E193
000664220121     I************************************   88  99 OSACB                 E193
000665220121     I************************************  100 109 TSEN2                 E193
000666220121     I************************************  110 117 ZZ0110                E193
000667220121     I************************************  118 1180DEC12                 E193
000668220121     I************************************  119 119 ZZ0119                E193
000669220121     I************************************  120 139 CRNM2                 E193
000670220121     I************************************  140 149 CTWN2                 E193
000671220121     I************************************  150 157 CASK2                 E193
000672220121     I************************************  158 177 PRNM2                 E193
000673220121     I************************************  178 187 PTWN2                 E193
000674220121     I************************************  188 195 PASK2                 E193
000675220121     I************************************  196 196 INOI2                 E193
000676220121     I************************************  197 197 ZZ0197                E193
000677220121     I************************************  198 199 CRSK2                 E193
000678220121     I************************************  200 201 CLOC2                 E193
000679220121     I************************************  202 203 REGC2                 E193
000680220121     I************************************  204 217 ZZ0204                E193
000681220121     I************************************  218 2180PARI2                 E193
000682220121     I************************************  219 2240CPAR2                 E193
000683220121     I************************************  225 256 ZZ225                 E193
000684220121     I*SPI*********DS*********************        35                      E193
000685220121     I************************************    1  23 SPI1                  E193
000686220121     I************************************   24  35 SPI2                  E193
000687220121     I*DLSTAT****UDS                            256                       036796
000688220121     I***********                            10  110DAYS                  036796
000689220121     I***********                            10  11 DYSA                  036796
000690220121     IGLSTAT     UDS                            256                       036796
000691220121     I                                       33  340DAYS                  036796
000692220121     I                                       33  34 DYSA                  036796
000693220121     I**
000694220121     I**   PROGRAM STATUS DATA STRUCTURE
000695220121     I**
000696220121     IPSDS       SDS
000697220121     I                                      244 253 JOBNM
000698220121     I                                      254 263 USRID
000699220121     I                                      264 2690JOBNO
000700220121     I**
000701220121     I**   FILE INFORMATION DATA STRUCTURE
000702220121     I**
000703220121     ISPOOL       DS
000704220121     I                                       83  92 SFILE
000705220121     I                                    B 123 1240SFNUM
000706220121      *                                                                   CLE004
000707220121     ISPOOL2      DS                                                      CLE004
000708220121     I** File information data structure - P2                             CLE004
000709220121     I                                       83  92 SFILE2                CLE004
000710220121     I                                    B 123 1240SFNUM2                CLE004
000711220121      *                                                                   CLE004
000712220121     ISPOOLU      DS
000713220121     I                                       83  92 SFILEU
000714220121     I                                    B 123 1240SFNUMU
000715220121     I**
000716220121     I              'INT. ESTIMATE  '     C         WINEST                                    CIR007
000717220121      ** Value of Event Description if either side of the deal is an                          CIR007
000718220121      ** OIS                                                                                  CIR007
000719220121      *                                                                                       CIR007
000720220121     I/EJECT
000721220121     C*
000722220121     C           *ENTRY    PLIST
000723220121     C                     PARM           TYPE    2                       AUS017
000724220121     C                     PARM           SEQ     5
000725220121     C                     PARM           BRNCH   3         BRANCH OR ALL
000726220121     C                     PARM           FWDDAY  3                                           CGL091
000727220121     C*
000728220121     C*    F I R S T   C Y C L E
000729220121     C*
000730220121     C   49                GOTO DETAIL
000731220121     C                     SETON                     49
000732220121     C                     MOVEACPY@      BIS@   80
000733220121     C*                                                                   AUS017
000734220121     C**   INITIALIZE FX AND MM DEAL INDICATORS                           AUS017
000735220121     C*                                                                   AUS017
000736220121     C                     MOVE '0'       *IN66                           AUS017
000737220121     C                     MOVE '0'       *IN67                           AUS017
000738220121     C*                                                                   S01496
000739220121     C**  Access SAR details file to see if S01496 is installed.          S01496
000740220121     C*                                                                   S01496
000741220121     C                     CALL 'AOSARDR0'                                S01496
000742220121     C                     PARM '       ' @RTCD   7                       S01496
000743220121     C                     PARM '*VERIFY' @OPTN   7                       S01496
000744220121     C                     PARM 'S01496'  WSARD   6                       S01496
000745220121     C*                                                                   S01496
000746220121     C           @RTCD     IFEQ *BLANK                                    S01496
000747220121     C                     MOVE '1'       *IN63                           S01496
000748220121     C                     END                                            S01496
000749220121      *                                                                   CLE004
000750220121      ** Check if customer lending enhancement - syndication is           CLE004
000751220121      ** installed                                                        CLE004
000752220121      *                                                                   CLE004
000753220121     C                     CALL 'AOSARDR0'                                CLE004
000754220121     C                     PARM *BLANKS   @RTCD                           CLE004
000755220121     C                     PARM '*VERIFY' @OPTN                           CLE004
000756220121     C                     PARM 'CLE004'  WSARD                           CLE004
000757220121      *                                                                   CLE004
000758220121     C           @RTCD     IFEQ *BLANKS                                   CLE004
000759220121     C                     MOVE 'Y'       CLE004  1                       CLE004
000760220121     C                     OPEN CLOAN                                     CLE004
000761220121     C                     ENDIF                                          CLE004
000762220121      *                                                                   CLE005
000763220121      **  Access Switchable SAR details for the existence of CLE005       CLE005
000764220121      **  (Tranch 3)                                                      CLE005
000765220121      *                                                                   CLE005
000766220121     C                     MOVE 'N'       CLE005  1                       CLE005
000767220121     C                     CALL 'AOSARDR0'                                CLE005
000768220121     C                     PARM *BLANK    @RTCD                           CLE005
000769220121     C                     PARM '*VERIFY' @OPTN                           CLE005
000770220121     C                     PARM 'CLE005'  @SARD   6                       CLE005
000771220121      *                                                                   CLE005
000772220121     C           @RTCD     IFEQ *BLANK                                    CLE005
000773220121     C                     MOVE 'Y'       CLE005                          CLE005
000774220121     C                     ENDIF                                          CLE005
000775220121      *                                                                   CLE005
000776220121     C           @RTCD     IFNE *BLANKS                                   CLE005
000777220121     C           @RTCD     ANDNE'*NRF  '                                  CLE005
000778220121     C                     MOVEL'SCSARDPD'DBFILE 10        ************   CLE005
000779220121     C                     MOVEL'06'      DBASE   2        * DBERR 06 *   CLE005
000780220121     C                     MOVEL@OPTN     DBKEY            ************   CLE005
000781220121     C                     SETON                     U7U8LR               CLE005
000782220121     C                     EXSR *PSSR                                     CLE005
000783220121     C                     GOTO END                                       CLE005
000784220121     C                     ENDIF                                          CLE005
000785220121     C*                                                                   CSE007
000786220121     C**  Access SAR details file to see if CSE007 is installed.          CSE007
000787220121     C*                                                                   CSE007
000788220121     C                     CALL 'AOSARDR0'                                CSE007
000789220121     C                     PARM '       ' @RTCD   7                       CSE007
000790220121     C                     PARM '*VERIFY' @OPTN   7                       CSE007
000791220121     C                     PARM 'CSE007'  WSARD   6                       CSE007
000792220121     C*                                                                   CSE007
000793220121     C           @RTCD     IFEQ *BLANK                                    CSE007
000794220121     C                     MOVE '1'       *IN53                           CSE007
000795220121     C                     END                                            CSE007
000796220121     C*                                                                   CEU017
000797220121     C**  Access SAR details file to see if CEU017 is installed.          CEU017
000798220121     C*                                                                   CEU017
000799220121     C                     CALL 'AOSARDR0'                                CEU017
000800220121     C                     PARM '       ' @RTCD   7                       CEU017
000801220121     C                     PARM '*VERIFY' @OPTN   7                       CEU017
000802220121     C                     PARM 'CEU017'  WSARD   6                       CEU017
000803220121     C*                                                                   CEU017
000804220121     C           @RTCD     IFEQ *BLANK                                    CEU017
000805220121     C                     MOVE '1'       *IN53                           CEU017
000806220121     C                     END                                            CEU017
000807220121      *                                                                   CLE005
000808220121      ** Check if Position/Risk Enquiries & Reports feature (CEU011)      CEU011
000809220121      ** is on.                                                           CEU011
000810220121      *                                                                   CEU011
000811220121     C                     CALL 'AOSARDR0'                                CEU011
000812220121     C                     PARM *BLANKS   @RTCD                           CEU011
000813220121     C                     PARM '*VERIFY' @OPTN                           CEU011
000814220121     C                     PARM 'CEU011'  @KEY    6                       CEU011
000815220121      *                                                                   CEU011
000816220121     C           @RTCD     IFEQ *BLANKS                                   CEU011
000817220121     C                     MOVE 'Y'       CEU011  1                       CEU011
000818220121     C                     MOVE *ON       *IN29                           CEU011
000819220121     C                     ELSE                                           CEU011
000820220121     C                     MOVE 'N'       CEU011                          CEU011
000821220121     C                     ENDIF                                          CEU011
000822220121      *                                                                   CEU011
000823220121     C           @RTCD     IFNE *BLANKS                                   CEU011
000824220121     C           @RTCD     ANDNE'*NRF  '                                  CEU011
000825220121     C                     MOVEL'SCSARDPD'DBFILE           ************   CEU011
000826220121     C                     MOVEL'07'      DBASE            * DBERR 07 *   CEU011
000827220121     C                     MOVEL'CEU011  'DBKEY            ************   CEU011
000828220121     C                     SETON                     U7U8LR               CEU011
000829220121     C                     EXSR *PSSR                                     CEU011
000830220121     C                     ENDIF                                          CEU011
000831220121      *                                                                                       CIR007
000832220121      ** Access SAR details file to determine if CIR007                                       CIR007
000833220121      ** (Overnight Index Swaps) is switched on.                                              CIR007
000834220121      *                                                                                       CIR007
000835220121     C                     CALL 'AOSARDR0'                                                    CIR007
000836220121     C                     PARM *BLANK    PRTCD   7                                           CIR007
000837220121     C                     PARM '*VERIFY' POPTN   7                                           CIR007
000838220121     C                     PARM 'CIR007'  PSARD   6                                           CIR007
000839220121      *                                                                                       CIR007
000840220121     C           PRTCD     IFNE *BLANKS                                                       CIR007
000841220121     C           PRTCD     ANDNE'*NRF   '                                                     CIR007
000842220121      *                                                                                       CIR007
000843220121     C                     MOVEL'SCSARDPD'DBFILE                                              CIR007
000844220121     C                     MOVEL'14'      DBASE                                               CIR007
000845220121     C                     MOVEL'CIR007  'DBKEY                                               CIR007
000846220121     C                     EXSR *PSSR                                                         CIR007
000847220121     C                     ENDIF                                                              CIR007
000848220121      *                                                                                       CIR007
000849220121     C           PRTCD     IFEQ *BLANKS                                                       CIR007
000850220121     C                     MOVE 'Y'       CIR007  1                                           CIR007
000851220121     C                     ELSE                                                               CIR007
000852220121     C                     MOVE 'N'       CIR007                                              CIR007
000853220121     C                     ENDIF                                                              CIR007
000854220121      *                                                                                       CLE028
000855220121      ** Check if enhancement CLE028 is installed                                             CLE028
000856220121      *                                                                                       CLE028
000857220121     C                     CALL 'AOSARDR0'                                                    CLE028
000858220121     C                     PARM *BLANKS   PRTCD                                               CLE028
000859220121     C                     PARM '*VERIFY 'POPTN                                               CLE028
000860220121     C                     PARM 'CLE028'  PSARD                                               CLE028
000861220121     C           SCSARD    PARM SCSARD    DSFDY                                               CLE028
000862220121      *                                                                                       CLE028
000863220121     C           PRTCD     IFNE *BLANKS                                                       CLE028
000864220121     C           PRTCD     ANDNE'*NRF   '                                                     CLE028
000865220121     C                     MOVEL'SCSARDPD'DBFILE                                              CLE028
000866220121     C                     MOVEL'CLE028'  DBKEY                                               CLE028
000867220121     C                     MOVEL'16'      DBASE                                               CLE028
000868220121     C                     EXSR *PSSR                                                         CLE028
000869220121     C                     ENDIF                                                              CLE028
000870220121      *                                                                                       CLE028
000871220121     C           PRTCD     IFEQ *BLANKS                                                       CLE028
000872220121     C                     MOVE 'Y'       CLE028  1                                           CLE028
000873220121     C                     ELSE                                                               CLE028
000874220121     C                     MOVE 'N'       CLE028                                              CLE028
000875220121     C                     ENDIF                                                              CLE028
000876220121      *                                                                                     AR743357
000877220121     C                     CALL 'AOSARDR0'                                                  AR743357
000878220121     C                     PARM *BLANK    PRTCD   7                                         AR743357
000879220121     C                     PARM '*VERIFY' POPTN   7                                         AR743357
000880220121     C                     PARM 'CIR003'  PSARD   6                                         AR743357
000881220121      *                                                                                     AR743357
000882220121     C           PRTCD     IFNE *BLANKS                                                     AR743357
000883220121     C           PRTCD     ANDNE'*NRF   '                                                   AR743357
000884220121      *                                                                                     AR743357
000885220121     C                     MOVEL'SCSARDPD'DBFILE                                            AR743357
000886220121     C                     MOVEL'17'      DBASE                                             AR743357
000887220121     C                     MOVEL'CIR003'  DBKEY                                             AR743357
000888220121     C                     EXSR *PSSR                                                       AR743357
000889220121     C                     ENDIF                                                            AR743357
000890220121      *                                                                                     AR743357
000891220121     C           PRTCD     IFEQ *BLANKS                                                     AR743357
000892220121     C                     MOVE 'Y'       CIR003  1                                         AR743357
000893220121     C                     ELSE                                                             AR743357
000894220121     C                     MOVE 'N'       CIR003                                            AR743357
000895220121     C                     ENDIF                                                            AR743357
000896220121      *                                                                                       CAP204
000897220121      ** Check if enhancement CAP204 is installed                                             CAP204
000898220121      *                                                                                       CAP204
000899220121     C                     CALL 'AOSARDR0'                                                    CAP204
000900220121     C                     PARM '       ' @RTCD                                               CAP204
000901220121     C                     PARM '*VERIFY' @OPTN                                               CAP204
000902220121     C                     PARM 'CAP204'  WSARD                                               CAP204
000903220121      *                                                                                       CAP204
000904220121     C           @RTCD     IFEQ *BLANK                                                        CAP204
000905220121     C                     MOVE 'Y'       CAP204  1                                           CAP204
000906220121     C                     ELSE                                                               CAP204
000907220121     C           PRTCD     IFNE *BLANKS                                                       CAP204
000908220121     C           PRTCD     ANDNE'*NRF   '                                                     CAP204
000909220121     C                     MOVEL'SCSARDPD'DBFILE                                              CAP204
000910220121     C                     MOVEL'CAP204'  DBKEY                                               CAP204
000911220121     C                     MOVEL'17'      DBASE                                               CAP204
000912220121     C                     EXSR *PSSR                                                         CAP204
000913220121     C                     ENDIF                                                              CAP204
000914220121     C                     ENDIF                                                              CAP204
000915220121      *                                                                   CEU011
000916220121      ** Retrieve general ledger details                                  CEU011
000917220121      *                                                                   CEU011
000918220121     C**********           CALL 'AOGELRR0'                                CEU011              CGL029
000919220121     C                     CALL 'AOGELRR1'                                                    CGL029
000920220121     C                     PARM *BLANKS   @RTCD                           CEU011
000921220121     C                     PARM '*FIRST ' @OPTN                           CEU011
000922220121     C********** SDGELR    PARM SDGELR    DSFDY                           CEU011              CGL029
000923220121     C           SDGELR    PARM SDGELR    DSSDY                                               CGL029
000924220121      *                                                                   CEU011
000925220121     C           @RTCD     IFNE *BLANKS                                   CEU011
000926220121     C           @RTCD     ANDNE'*NRF   '                                 CEU011
000927220121     C                     MOVEL'SDGELRPD'DBFILE           ************   CEU011
000928220121     C                     MOVEL'09'      DBASE            * DBERR 09 *   CEU011
000929220121     C                     MOVEL'*FIRST'  DBKEY            ************   CEU011
000930220121     C                     SETON                     U7U8LR               CEU011
000931220121     C                     EXSR *PSSR                                     CEU011
000932220121     C                     ENDIF                                          CEU011
000933220121     C*                                                                   AUS017
000934220121     C**   CHECK DEAL AND SET CORRESPONDING INDICATOR                     AUS017
000935220121     C*                                                                   AUS017
000936220121     C           TYPE      IFEQ 'FX'                                      AUS017
000937220121     C                     MOVE '1'       *IN66                           AUS017
000938220121     C                     ELSE                                           AUS017
000939220121     C           TYPE      IFEQ 'MM'                                      AUS017
000940220121     C                     MOVE '1'       *IN67                           AUS017
000941220121     C                     END                                            AUS017
000942220121     C                     END                                            AUS017
000943220121     C*
000944220121     C** READ BANK DETAILS VIA ACCESS PROGRAM
000945220121     C                     CALL 'AOBANKR0'
000946220121     C                     PARM '*MSG   ' @RTCD   7
000947220121     C                     PARM '*FIRST ' @OPTN   7
000948220121     C           SDBANK    PARM SDBANK    DSFDY
000949220121     C           BJDFIN    COMP 'M'                      98MMDDYY, 98 ON
000950220121     C           @RTCD     IFNE *BLANK
000951220121     C                     MOVEL'SDBANKPD'DBFILE           ************
000952220121     C                     MOVEL'03'      DBASE            * DBERR 03 *
000953220121     C                     MOVEL@OPTN     DBOPTN           ************
000954220121     C                     MOVEL@OPTN     DBKEY
000955220121     C                     EXSR *PSSR
000956220121     C                     SETON                     99
000957220121     C                     GOTO END
000958220121     C                     END
000959220121     C*
000960220121     C                     CALL 'AOMMODR0'                                CTI001
000961220121     C                     PARM '*DBERR ' @RTCD                           CTI001
000962220121     C                     PARM '*FIRST ' @OPTN                           CTI001
000963220121     C           SDMOD     PARM SDMOD     DSFDY                           CTI001
000964220121      *                                                                   CTI001
000965220121     C           @RTCD     IFNE *BLANK                                    CTI001
000966220121     C                     MOVEL'SDMMODPD'DBFILE            ************* CTI001
000967220121     C                     MOVEL'04'      DBASE             * DBERR 04 *  CTI001
000968220121     C                     MOVEL@OPTN     DBOPTN            ************* CTI001
000969220121     C                     MOVEL@OPTN     DBKEY                           CTI001
000970220121     C                     SETON                     U7U8LR               CTI001
000971220121     C                     EXSR *PSSR                                     CTI001
000972220121     C                     GOTO END                                       CTI001
000973220121     C                     ENDIF                                          CTI001
000974220121      *                                                                   CTI001
000975220121      ** Midas/TI interface installed?                                    CTI001
000976220121     C           BGN3ST    IFEQ 'Y'                                       CTI001
000977220121     C                     MOVE 'Y'       M#TION  1                       CTI001
000978220121     C*********************MOVE *ON       *IN79                     CTI001CLE005
000979220121     C                     MOVE *ON       *IN80                           CLE005
000980220121     C                     ENDIF                                          CTI001
000981220121      *                                                                   CTI001
000982220121     C***THIS*PROGRAM*CAN*BE*RUN*BY*SECURITIES*TRADING*WITHOUT*DEALING*   036796
000983220121     C***IN*THE*SYSTEM,*IN*WHICH*CASE*D/DLSTAT*WILL*NOT*BE*SET.*          036796
000984220121     C***********DYSA      COMP '  '                     51               036796
000985220121     C***51******          MOVE '99'      DYSA                            036796
000986220121     C**********                                                          046872              CGL091
000987220121     C***If*days*not*set*to*99,*calculate*this*no*of*working*days*fwd*****046872              CGL091
000988220121     C**********                                                          046872              CGL091
000989220121     C********** DAYS      IFNE 99                                        046872              CGL091
000990220121     C**********           Z-ADDDAYS      ZNRDYS                                              CGL091
000991220121     C********** DAYS      COMP 5                      40                                     CGL091
000992220121      *                                                                                       CGL091
000993220121     C                     MOVE FWDDAY    #DAYS   30                                          CGL091
000994220121     C           #DAYS     IFEQ *ZEROS                                                        CGL091
000995220121     C                     Z-ADD999       #DAYS                                               CGL091
000996220121     C                     ENDIF                                                              CGL091
000997220121     C           #DAYS     IFNE *ZEROS                                                        CGL091
000998220121     C           #DAYS     ANDNE999                                                           CGL091
000999220121     C                     SETON                     56                                       CGL091
001000220121     C                     ENDIF                                                              CGL091
001001220121     C*                                                                                       CGL091
001002220121     C** If days not set to 999, calculate this no of working days fwd                        CGL091
001003220121     C*                                                                                       CGL091
001004220121     C           #DAYS     IFNE 999                                                           CGL091
001005220121     C                     Z-ADD#DAYS     ZNRDYS                                              CGL091
001006220121     C           #DAYS     COMP 5                      40                                     CGL091
001007220121     C   40                Z-ADD5         ZNRDYS
001008220121     C                     MOVE BJRDNB    ZDAYNO
001009220121     C                     MOVE BJLCCY    ZCCY
001010220121     C                     MOVE BJSLCD    ZLOC    3
001011220121     C**********           EXSR ZFWDT                                                         CGL091
001012220121     C                     EXSR ZFWDTA                                                        CGL091
001013220121     C***********DAYS      COMP 99                       39               S01243
001014220121     C***39******          MOVE 99999     ZDYNBR                          S01243
001015220121     C*
001016220121     C*    IF DAYS IS SET TO 99 ALLOW ALL EVENTS TO END OF BOOK TO        BHF136
001017220121     C*    BE PRODUCED                                                    BHF136
001018220121     C***********DAYS      IFEQ 99                                 BHF136 046872
001019220121     C                     ELSE                                           046872
001020220121     C                     MOVE 99999     ZDYNBR                          BHF136
001021220121     C                     END                                            BHF136
001022220121     C*                                                                   S01496
001023220121     C           *IN63     IFEQ '1'                                       S01496
001024220121     C                     MOVE '0'       *IN62                           S01496
001025220121     C                     END                                            S01496
001026220121     C*                                                                   CSE007
001027220121     C/COPY WNCPYSRC,GL0559C005
001028220121     C           *IN53     IFEQ '1'                                       CSE007
001029220121     C                     MOVE '0'       *IN54                           CSE007
001030220121     C                     END                                            CSE007
001031220121     C*
001032220121     C*    FUTURE DAY NUMBER NOW HELD IN ZDYNBR
001033220121     C           DETAIL    TAG                             ** DETAIL TAG *
001034220121     C************IN02*****IFEQ '1'                                       E193
001035220121     C*********************MOVE SPI1      SPI11                           E193
001036220121     C*********************MOVE SPI2      SPI21                           E193
001037220121     C*********************END                                            E193
001038220121     C************IN03*****IFEQ '1'                                       E193
001039220121     C*********************MOVE RECI      RECI1                           E193
001040220121     C*********************Z-ADDDLNO      DLNO1                           E193
001041220121     C*********************Z-ADDCNUM      CNUM1                           E193
001042220121     C*********************MOVE DTYP      DTYP1                           E193
001043220121     C*********************MOVE DLST      DLST1                           E193
001044220121     C*********************Z-ADDEDAT      EDAT1                           E193
001045220121     C*********************Z-ADDEAMT      EAMT1                           E193
001046220121     C*********************Z-ADDECSS      ECSS1                           E193
001047220121     C*********************MOVE BRCA      BRCA1                           E193
001048220121     C*********************Z-ADDOTHD      OTHD1                           E193
001049220121     C*********************Z-ADDOTHA      OTHA1                           E193
001050220121     C*********************Z-ADDBCEQ      BCEQ1                           E193
001051220121     C*********************Z-ADDLCEQ      LCEQ1                           E193
001052220121     C*********************Z-ADDSETP      SETP1                           E193
001053220121     C*********************Z-ADDFFVD      FFVD1                           E193
001054220121     C*********************Z-ADDPARI      PARI1                           E193
001055220121     C*********************Z-ADDCPAR      CPAR1                           E193
001056220121     C*********************MOVE ETYP      ETYP1                           E193
001057220121     C*********************MOVE ECCY      ECCY1                           E193
001058220121     C*********************MOVE OTHC      OTHC1                           E193
001059220121     C*********************MOVE OSAC      OSACA                           E193
001060220121     C*********************MOVE TSEN      TSEN1                           E193
001061220121     C*********************MOVE CRNM      CRNM1                           E193
001062220121     C*********************MOVE CTWN      CTWN1                           E193
001063220121     C*********************MOVE CASK      CASK1                           E193
001064220121     C*********************MOVE PRNM      PRNM1                           E193
001065220121     C*********************MOVE PTWN      PTWN1                           E193
001066220121     C*********************MOVE PASK      PASK1                           E193
001067220121     C*********************MOVE INOI      INOI1                           E193
001068220121     C*********************MOVE CLOC      CLOC1                           E193
001069220121     C*********************MOVE REGC      REGC1                           E193
001070220121     C*********************MOVE FFIN      FFIN1                           E193
001071220121     C*********************END                                            E193
001072220121     C******SETUP*CUSTOMER*LENDING OUTPUT DATA STRUCTURE                  E193
001073220121     C************IN13*****IFEQ '1'                                       E193
001074220121     C*********************MOVE RECI******RECI2                           E193
001075220121     C*********************Z-ADDLNRF      LNRF2                           E193
001076220121     C*********************Z-ADDCNUM      CNUM2                           E193
001077220121     C*********************MOVE ETYP      ETYP2                           E193
001078220121     C*********************Z-ADDEDAT      EDAT2                           E193
001079220121     C*********************Z-ADDEAMT      EAMT2                           E193
001080220121     C*********************MOVE ECCY      ECCY2                           E193
001081220121     C*********************Z-ADDECSS      ECSS2                           E193
001082220121     C*********************MOVE DTYP      DTYP2                           E193
001083220121     C*********************MOVE DLST      DLST2                           E193
001084220121     C*********************MOVE BRCA      BRCA2                           E193
001085220121     C*********************Z-ADDOTHD      OTHD2                           E193
001086220121     C*********************Z-ADDOTHA      OTHA2                           E193
001087220121     C*********************Z-ADDBCEQ      BCEQ2                           E193
001088220121     C*********************Z-ADDLCEQ      LCEQ2                           E193
001089220121     C*********************MOVE NGII      NGII2                           E193
001090220121     C*********************Z-ADDINTR      INTR2                           E193
001091220121     C*********************Z-ADDSETP      SETP2                           E193
001092220121     C*********************MOVE OSAC      OSACB                           E193
001093220121     C*********************MOVE TSEN      TSEN2                           E193
001094220121     C*********************Z-ADDDEC1      DEC12                           E193
001095220121     C*********************MOVE CRNM      CRNM2                           E193
001096220121     C*********************MOVE CTWN      CTWN2                           E193
001097220121     C*********************MOVE CASK      CASK2                           E193
001098220121     C*********************MOVE PRNM      PRNM2                           E193
001099220121     C*********************MOVE PTWN      PTWN2                           E193
001100220121     C*********************MOVE PASK      PASK2                           E193
001101220121     C*********************MOVE INOI      INOI2                           E193
001102220121     C*********************MOVE CLOC      CLOC2                           E193
001103220121     C*********************MOVE REGC      REGC2                           E193
001104220121     C*********************Z-ADDPARI      PARI2                           E193
001105220121     C*********************Z-ADDCPAR      CPAR2                           E193
001106220121     C*********************END                                            E193
001107220121     C*********************                                               E193
001108220121     C*****SET*UP*OUTPUT*FIELDS FOR TRADE EVENTS                          E193
001109220121     C************IN26*****IFEQ '1'                                       E193
001110220121     C*********************MOVE 'E'       NREI                            E193
001111220121     C*********************MOVE ECCY      NEEC                            E193
001112220121     C*********************MOVELTRSA      NENC                            E193
001113220121     C*********************Z-ADDEDAT      NEED                            E193
001114220121     C*********************MOVE CRNM      NERN                            E193
001115220121     C*********************MOVE CTWN      NERT                            E193
001116220121     C*********************MOVE TRTR      NETR                            E193
001117220121     C*********************MOVE ETYP      NECD                            E193
001118220121     C*********************Z-ADDEAMT      NEAM                            E193
001119220121     C*********************MOVE INOI      NEIO                            E193
001120220121     C*********************MOVE TRTR      DLNO                            E193
001121220121     C*********************                                               E193
001122220121     C*********************MOVE TRSM      SETP                            E193
001123220121     C*********************MOVE '       ' OTHDA                           E193
001124220121     C*********************MOVE ' '       FFIN                            E193
001125220121     C*********************END                                            E193
001126220121     C*********************                                               E193
001127220121     C*****SET*UP*OUTPUT*FIELDS FOR CUSTOMER POSITION EVENTS OR DEPOT     E193
001128220121     C*****POSITION*EVENTS                                                E193
001129220121     C************IN27*****IFEQ '1'                                       E193
001130220121     C************IN28*****OREQ '1'                                       E193
001131220121     C*********************MOVE 'E'       NREI                            E193
001132220121     C*********************MOVE ECCY      NEEC                            E193
001133220121     C*********************MOVELCCSA      NENC                            E193
001134220121     C*********************Z-ADDEDAT      NEED                            E193
001135220121     C*********************MOVE CRNM      NERN                            E193
001136220121     C*********************MOVE CTWN      NERT                            E193
001137220121     C*********************MOVE *BLANKS   NETR                            E193
001138220121     C*********************MOVE ETYP      NECD                            E193
001139220121     C*********************Z-ADDEAMT      NEAM                            E193
001140220121     C*********************MOVE INOI      NEIO                            E193
001141220121     C*********************                                               E193
001142220121     C*********************MOVE CCSM      SETP                            E193
001143220121     C*********************MOVE '       ' OTHDA                           E193
001144220121     C*********************MOVE ' '       FFIN                            E193
001145220121     C*********************Z-ADD0         DLNO                            E193
001146220121     C*********************END                                            E193
001147220121     C*********************                                               E193
001148220121     C************IN29*****IFEQ '1'                                       E193
001149220121     C*********************MOVE '       ' OTHDA                           E193
001150220121     C*********************MOVE ' '       FFIN                            E193
001151220121     C*********************MOVE 00        SETP                            E193
001152220121     C*********************END                                            E193
001153220121     C*********************                                               E193
001154220121     C*****SECURITIES*TRADING EVENTS                                      E193
001155220121     C************IN17*****IFEQ '1'                                       E193
001156220121     C*********************MOVELOSAC      OSAC1                           E193
001157220121     C*********************MOVE OSAC      OSAC2                           E193
001158220121     C*********************MOVE THRE      TSEN                            E193
001159220121     C*
001160220121     C           *IN03     IFEQ *ON                                                           CLE148
001161220121     C                     MOVE LNNO      DLNO                                                CLE148
001162220121     C                     ENDIF                                                              CLE148
001163220121      *                                                                                       CLE148
001164220121     C** If trade events file is read, move trade ref. to DLNO            055798
001165220121     C*                                                                   055798
001166220121     C           *IN26     IFEQ '1'                                       055798
001167220121     C                     MOVE TRNO      DLNO                            055798
001168220121     C                     END                                            055798
001169220121     C*                                                                   055798
001170220121     C**CHECK*FOR*TYPE8C1,C2,M1*AND*M2*********************************   CEU003
001171220121     C* CHECK FOR TYPE C1,C2,M1,M2,MX AND MY                              CEU003
001172220121     C*
001173220121     C**N17****************GOTO NOT17                                     E20669
001174220121     C                     GOTO NOT17                                     E20669
001175220121     C*
001176220121     C                     MOVE ETYP      ALPH2   2
001177220121     C           ALPH2     COMP 'C1'                     25
001178220121     C  N25      ALPH2     COMP 'C2'                     25
001179220121     C  N25      ALPH2     COMP 'M1'                     25
001180220121     C  N25      ALPH2     COMP 'M2'                     25
001181220121     C  N25      ALPH2     COMP 'MX'                     25               CEU003
001182220121     C  N25      ALPH2     COMP 'MY'                     25               CEU003
001183220121     C*
001184220121     C           NOT17     TAG                             ** NOT17 TAG **
001185220121     C*
001186220121     C*********************END                                            E193
001187220121     C************INL2     IFEQ '1'
001188220121     C*********************CLOSEDL0552P1                                  E172
001189220121     C***********BRNCH     IFEQ 'ALL'                                     E172
001190220121     C***********BRNCH*****OREQ CMPYM                                     E172
001191220121     C***********BRNCH     OREQ ECPY                                      E172
001192220121     C*********************SETON                     5855                 E172
001193220121     C*********************OPEN DL0552P1                                  E172
001194220121     C*********************                                               E172
001195220121      ** TRANSFER BINARY DATA INTO NUMERIC FIELD                          E172
001196220121     C*********************Z-ADDSFNUM     ZSNUM   60                      E172
001197220121     C*********************                                               E172
001198220121     C** ENSURE REPORT SPOOL FILE RECORDED BY RCF                         E172
001199220121     C*********************CALL 'ZSFILE'                                  E172
001200220121     C*********************PARM           SEQ                             E172
001201220121     C*********************PARM CMPYM     @PARM                           E172
001202220121     C*********************PARM ECPY      @PARM                           E172
001203220121     C*********************PARM           SFILE                           E172
001204220121     C*********************PARM           ZSNUM                           E172
001205220121     C*********************PARM *BLANK    ZSERR   1                 S01117E172
001206220121     C********************                                          S01117E172
001207220121     C***********ZSERR     IFEQ 'Y'                                 S01117E172
001208220121     C*********************SETON                     U7U8LR         S01117E172
001209220121     C*********************RETRN                                    S01117E172
001210220121     C*********************END                                      S01117E172
001211220121     C*********************                                               E172
001212220121     C*********************Z-ADD0         PAGE                            E172
001213220121     C** READ COMPANY FILE VIA ACCESS PROGRAM                             E172
001214220121     C******************** CALL 'AOCOMPR0'                                E172
001215220121     C*********************PARM '*MSG   ' @RTCD   7                       E172
001216220121     C*********************PARM '*KEY   ' @OPTN   7                       E172
001217220121     C*********************PARM CMPYM     @CENB   3                       E172
001218220121     C*********************PARM ECPY      @CENB   3                       E172
001219220121     C*********************PARM           SDCOMP                          E172
001220220121     C***********@RTCD*****IFNE *BLANK                                    E172
001221220121     C*********************MOVEL'SDCOMPPD'DBFILE 10        ************   E172
001222220121     C*********************MOVEL'01'      DBASE   2        * DBERR 01 *   E172
001223220121     C*********************MOVEL@OPTN     DBOPTN  7        ************   E172
001224220121     C*********************MOVELCMPYM     DBKEY  29                       E172
001225220121     C*********************MOVELECPY      DBKEY  29                       E172
001226220121     C*********************EXSR *PSSR                                     E172
001227220121     C*********************SETON                     99                   E172
001228220121     C*********************GOTO END                                       E172
001229220121     C*********************END                                            E172
001230220121     C*********************                                               E172
001231220121     C*********************ELSE                                           E172
001232220121     C*********************SETOF                     58                   E172
001233220121     C*********************SETON                     41                   E172
001234220121     C*********************END                                            E172
001235220121     C*********************END                                            E172
001236220121     C**
001237220121     C** IF CHANGE IN EVENT DATE PRINT THE SUBTOTAL DETAILS IF EVENT                          CGL091
001238220121     C** PRINTED                                                                              CGL091
001239220121     C                     MOVE 'N'       ROLLY   1                                           CGL091
001240220121      *                                                                                       CGL091
001241220121      * If change of currency, reset running totals                                           CGL091
001242220121     C           *INL1     IFEQ '1'                                                           CGL091
001243220121     C                     Z-ADD0         RPAMT  130                                          CGL091
001244220121     C                     Z-ADD0         RINTAM 130                                          CGL091
001245220121     C                     Z-ADD0         RTAMT  130                                          CGL091
001246220121     C                     END                                                                CGL091
001247220121      *                                                                                       CGL091
001248220121     C           EDAT      IFNE SAVDAT                                                        CGL091
001249220121     C           SAVDAT    ANDNE0                                                             CGL091
001250220121     C           *INL1     OREQ '1'                                                           CGL091
001251220121     C           SAVDAT    ANDNE0                                                             CGL091
001252220121     C                     EXCPTSUBTL                                                         CGL091
001253220121      *                                                                                       CGL091
001254220121      * After output of subtotal, output running total                                        CGL091
001255220121     C                     ADD  TPAMT     RPAMT  130                                          CGL091
001256220121     C                     ADD  TINTAM    RINTAM 130                                          CGL091
001257220121     C                     ADD  TTAMT     RTAMT  130                                          CGL091
001258220121     C                     EXCPTRUNTL                                                         CGL091
001259220121      *                                                                                       CGL091
001260220121      **If change of currency, reset running totals                                           CGL091
001261220121     C                     Z-ADD0         TPAMT  130                                          CGL091
001262220121     C                     Z-ADD0         TINTAM 130                                          CGL091
001263220121     C                     Z-ADD0         TTAMT  130                                          CGL091
001264220121     C                     Z-ADD0         SAVDAT                                              CGL091
001265220121     C                     END                                                                CGL091
001266220121     C*                                                                                       CGL091
001267220121     C/COPY WNCPYSRC,GL0559C001
001268220121     C           *INL1     IFEQ '1'
001269220121     C*
001270220121     C** READ CURRENCY DETAILS VIA ACCESS PROGRAM
001271220121     C                     CALL 'AOCURRR0'
001272220121     C                     PARM '*MSG   ' @RTCD   7
001273220121     C                     PARM '*KEY   ' @OPTN   7
001274220121     C                     PARM ECCY      @AJCD   3
001275220121     C           SDCURR    PARM SDCURR    DSSDY
001276220121     C           @RTCD     IFNE *BLANK
001277220121     C                     MOVEL'SDCURRPD'DBFILE           ************
001278220121     C                     MOVEL'02'      DBASE            * DBERR 02 *
001279220121     C                     MOVEL@OPTN     DBOPTN           ************
001280220121     C                     MOVELECCY      DBKEY
001281220121     C                     EXSR *PSSR
001282220121     C                     SETON                     99
001283220121     C                     END
001284220121     C*
001285220121     C                     END
001286220121     C   L1      A6NBDP    COMP 1                      3031
001287220121     C   L1      A6NBDP    COMP 2                    33  32
001288220121     C   L1                SETOF                     4344
001289220121     C   L1                MOVE *OFF      *IN39                           CEU011
001290220121     C   L1
001291220121     COR 45 46             SETOF                     4546
001292220121     C   OF                SETON                     45
001293220121     C                     SETOF                     43
001294220121     C                     SETOF                     414265
001295220121     C                     SETOF                     48
001296220121     C*****RESTORE*SECURITY*TRADING*RECI*                                 E20669
001297220121     C************IN17*****IFEQ '1'                                       E20669
001298220121     C*********************MOVE RECIST    RECI                            E20669
001299220121     C*********************END                                            E20669
001300220121     C*    COUNT NUMBER OF RECORDS READ FROM EVENTM
001301220121      * Keep separate record count for the Security (II) Events.
001302220121      *
001303220121     C           *IN26     IFEQ '1'
001304220121     C           *IN27     OREQ '1'
001305220121     C           *IN28     OREQ '1'
001306220121     C************IN29*****OREQ '1'                                       E20669
001307220121     C                     ADD  1         #SEIN   50
001308220121     C                     ELSE
001309220121      *
001310220121     C*    IN FUTURE AND OPTION, TRAILER IS NOT INCLUDED IN NORE
001311220121     C*                                                                   S01408
001312220121     C/COPY WNCPYSRC,GL0559CCP1                                           S01408
001313220121     C*                                                                   S01408
001314220121     C**N83******RECRED****ADD  1         RECRED  50                      105140
001315220121     C  N83      RECRED    ADD  1         RECRED  90                      105140
001316220121     C                     END
001317220121     C*                                                                   S01408
001318220121     C/COPY WNCPYSRC,GL0559CCP2                                           S01408
001319220121     C*                                                                   S01408
001320220121     C   U8                GOTO END
001321220121     C*                                                                   AUS017
001322220121     C/COPY WNCPYSRC,GL0559C002
001323220121     C**    PROCESSING FOR FX OR MM DEALS ONLY                            AUS017
001324220121     C*                                                                   AUS017
001325220121     C           TYPE      IFEQ 'FX'                                      AUS017
001326220121     C           TYPE      OREQ 'MM'                                      AUS017
001327220121     C*                                                                   AUS017
001328220121     C**    IF RECORD READ IS NOT A DEAL RECORD                           AUS017
001329220121     C*                                                                   AUS017
001330220121     C           *IN02     IFEQ '0'                                       AUS017
001331220121     C                     MOVE '1'       *IN41                           AUS017
001332220121     C                     GOTO END                                       AUS017
001333220121     C                     END                                            AUS017
001334220121     C*                                                                   AUS017
001335220121     C                     END                                            AUS017
001336220121     C*                                                                   AUS017
001337220121      ** If LC  records are being processed, check for LC  trailer        CTI001
001338220121      ** or detail records having been read                               CTI001
001339220121     C           M#TION    IFEQ 'Y'                                       CTI001
001340220121      *                                                                   CTI001
001341220121     C           *IN16     IFEQ '1'                                       CTI001
001342220121     C                     MOVE 'Y'       ULTRL   1                       CTI001
001343220121     C                     GOTO TRAIL                                     CTI001
001344220121     C                     END                                            CTI001
001345220121      *                                                                   CTI001
001346220121     C           *IN15     IFEQ '1'                                       CTI001
001347220121     C                     MOVE 'Y'       ULDET   1                       CTI001
001348220121     C                     ENDIF                                          CTI001
001349220121      *                                                                   CTI001
001350220121     C                     ENDIF                                          CTI001
001351220121      *                                                                                       CAP204
001352220121      ** If CAP204 is installed and trailer indicator is ON                                   CAP204
001353220121      *                                                                                       CAP204
001354220121     C           CAP204    IFEQ 'Y'                                                           CAP204
001355220121     C           *IN72     ANDEQ'1'                                                           CAP204
001356220121     C                     GOTO TRAIL                                                         CAP204
001357220121     C                     ENDIF                                                              CAP204
001358220121     C   12
001359220121     COR 14
001360220121     COR 38
001361220121     C*OR*18***************                                               E20669
001362220121     COR 83
001363220121     COR 04                GOTO TRAIL
001364220121     C   01                GOTO END
001365220121     C*                                                                   CEU003
001366220121     C**  If transaction is settled in another currency exclude events    CEU003
001367220121     C**  from report                                                     CEU003
001368220121     C*                                                                   CEU003
001369220121     C           SIAC      IFEQ 'Y'                                       CEU003
001370220121     C                     MOVE '1'       *IN41                           CEU003
001371220121     C                     GOTO END                                       CEU003
001372220121     C                     ENDIF                                          CEU003
001373220121     C*                                                                   S01221
001374220121     C**  Skip S.R.M. event types                                         S01221
001375220121     C****Do*not*skip*IRS*Event*22S1*and*22S2**********************E23278 030749
001376220121     C***********ETYP      IFEQ '20S1'                                    S01393              CGL091
001377220121     C***********ETYP      OREQ '20S2'                                    S01393              CGL091
001378220121     C********** ETYP      IFEQ '21S1'                             S01221 S01393
001379220121     C***********ETYP      OREQ '21S1'                                    S01393              CGL091
001380220121     C***********ETYP      OREQ '21S2'                                    S01221              CGL091
001381220121     C***********ETYP      OREQ '21S3'                                    S01221              CGL091
001382220121     C***********ETYP      OREQ '21S4'                                                 208461 CGL091
001383220121     C***********ETYP      OREQ '21C1'                                    030749              CGL091
001384220121     C***********ETYP      OREQ '21C2'                                    030749              CGL091
001385220121     C***********ETYP      OREQ '21C3'                                    030749              CGL091
001386220121     C***********ETYP      OREQ '21C4'                                                 208461 CGL091
001387220121     C***********ETYP      OREQ '21O1'                                    030749              CGL091
001388220121     C***********ETYP      OREQ '21E1'                                    030749              CGL091
001389220121     C***********ETYP      OREQ '22S1'                            S01221  E23278
001390220121     C***********ETYP      OREQ '22S2'                            S01221  E23278
001391220121     C***********ETYP      OREQ '22S1'                                    030749              CGL091
001392220121     C***********ETYP      OREQ '22S2'                                    030749              CGL091
001393220121     C***********ETYP      OREQ '22S3'                                    S01393              CGL091
001394220121     C***********ETYP      OREQ '22S4'                                    S01393              CGL091
001395220121     C***********ETYP      OREQ '22C1'                                    030749              CGL091
001396220121     C***********ETYP      OREQ '22C2'                                    030749              CGL091
001397220121     C***********ETYP      OREQ '22C3'                                                 208461 CGL091
001398220121     C***********ETYP      OREQ '22C4'                                                 208461 CGL091
001399220121     C***********ETYP      OREQ '22O1'                                    030749              CGL091
001400220121     C***********ETYP      OREQ '22E1'                                    030749              CGL091
001401220121     C***********ETYP      OREQ '23S1'                                    S01221              CGL091
001402220121     C***********ETYP      OREQ '23S2'                                    S01221              CGL091
001403220121     C***********ETYP      OREQ '23S3'                                                 208461 CGL091
001404220121     C***********ETYP      OREQ '23S4'                                                 208461 CGL091
001405220121     C***********ETYP      OREQ '23C1'                                    030749              CGL091
001406220121     C***********ETYP      OREQ '23C2'                                    030749              CGL091
001407220121     C***********ETYP      OREQ '23C3'                                                 208461 CGL091
001408220121     C***********ETYP      OREQ '23C4'                                                 208461 CGL091
001409220121     C***********ETYP      OREQ '23O1'                                    030749              CGL091
001410220121     C***********ETYP      OREQ '23E1'                                    030749              CGL091
001411220121     C***********ETYP      OREQ '24S1'                                    S01221              CGL091
001412220121     C***********ETYP      OREQ '24S2'                                    S01221              CGL091
001413220121     C***********ETYP      OREQ '24S3'                                                 208461 CGL091
001414220121     C***********ETYP      OREQ '24S4'                                                 208461 CGL091
001415220121     C***********ETYP      OREQ '24C1'                                    030749              CGL091
001416220121     C***********ETYP      OREQ '24C2'                                    030749              CGL091
001417220121     C***********ETYP      OREQ '24C3'                                                 208461 CGL091
001418220121     C***********ETYP      OREQ '24C4'                                                 208461 CGL091
001419220121     C***********ETYP      OREQ '24O1'                                    030749              CGL091
001420220121     C***********ETYP      OREQ '24E1'                                    030749              CGL091
001421220121      *                                                                                       CGL091
001422220121      * Include FRA/IRS notional principal and interest events                                CGL091
001423220121     C           ETYP      IFEQ '20S1'                                                        CGL091
001424220121     C           ETYP      OREQ '20S2'                                                        CGL091
001425220121     C           ETYP      OREQ '21O1'                                                        CGL091
001426220121     C           ETYP      OREQ '21E1'                                                        CGL091
001427220121     C           ETYP      OREQ '22S3'                                                        CGL091
001428220121     C           ETYP      OREQ '22S4'                                                        CGL091
001429220121     C           ETYP      OREQ '22O1'                                                        CGL091
001430220121     C           ETYP      OREQ '22E1'                                                        CGL091
001431220121     C           ETYP      OREQ '23O1'                                                        CGL091
001432220121     C           ETYP      OREQ '23E1'                                                        CGL091
001433220121     C           ETYP      OREQ '24O1'                                                        CGL091
001434220121     C           ETYP      OREQ '24E1'                                                        CGL091
001435220121     C           ETYP      OREQ '23C3'                                                        CGL091
001436220121     C           ETYP      OREQ '23C4'                                                        CGL091
001437220121     C           ETYP      OREQ '23S3'                                                        CGL091
001438220121     C           ETYP      OREQ '23S4'                                                        CGL091
001439220121     C           ETYP      OREQ '22C3'                                                        CGL091
001440220121     C           ETYP      OREQ '22C4'                                                        CGL091
001441220121     C*                                                                   S01221
001442220121      ** Set on *IN41 so that S.R.M. event types are not output to        LN0597
001443220121      ** spool file                                                       LN0597
001444220121     C                     MOVE '1'       *IN41                           LN0597
001445220121     C*                                                                   LN0597
001446220121     C           CIR003    IFEQ 'Y'                                                         AR743357
001447220121     C           DTYP      ANDEQ'RX'                                                        AR743357
001448220121      *                                                                                     AR743357
001449220121     C           *LIKE     DEFN DLNO      TDLNO                                             AR743357
001450220121     C                     Z-ADDDLNO      TDLNO                                             AR743357
001451220121     C           TDLNO     CHAINDEALS                05                                     AR743357
001452220121     C           *IN05     IFEQ '1'                                                         AR743357
001453220121     C                     MOVEL'DEALS   'DBFILE                                            AR743357
001454220121     C                     MOVEL'16'      DBASE                                             AR743357
001455220121     C                     MOVELDLNO      DBKEY                                             AR743357
001456220121     C                     EXSR *PSSR                                                       AR743357
001457220121     C                     MOVE '1'       *IN99                                             AR743357
001458220121     C                     GOTO END                                                         AR743357
001459220121     C                     ENDIF                                                            AR743357
001460220121      *                                                                                     AR743357
001461220121     C           ETYP      IFEQ '23S3'                                                      AR743357
001462220121     C           ETYP      OREQ '23C3'                                                      AR743357
001463220121      *                                                                                     AR743357
001464220121     C           VDEI      IFEQ 'Y'                                                         AR743357
001465220121     C           EDAT      ANDEQVDAT                                                        AR743357
001466220121     C           PDEI      OREQ 'Y'                                                         AR743357
001467220121     C           EDAT      ANDNEVDAT                                                        AR743357
001468220121     C                     MOVE '0'       *IN41                                             AR743357
001469220121     C                     ELSE                                                             AR743357
001470220121     C                     GOTO END                                                         AR743357
001471220121     C                     ENDIF                                                            AR743357
001472220121      *                                                                                     AR743357
001473220121     C                     ELSE                                                             AR743357
001474220121      *                                                                                     AR743357
001475220121     C           ETYP      IFEQ '23S4'                                                      AR743357
001476220121     C           ETYP      OREQ '23C4'                                                      AR743357
001477220121      *                                                                                     AR743357
001478220121     C           MDEI      IFEQ 'Y'                                                         AR743357
001479220121     C           EDAT      ANDEQMDAT                                                        AR743357
001480220121     C           PDEI      OREQ 'Y'                                                         AR743357
001481220121     C           EDAT      ANDNEMDAT                                                        AR743357
001482220121     C                     MOVE '0'       *IN41                                             AR743357
001483220121     C                     ELSE                                                             AR743357
001484220121     C                     GOTO END                                                         AR743357
001485220121     C                     ENDIF                                                            AR743357
001486220121      *                                                                                     AR743357
001487220121     C                     ELSE                                                             AR743357
001488220121     C                     GOTO END                                                         AR743357
001489220121     C                     ENDIF                                                            AR743357
001490220121     C                     ENDIF                                                            AR743357
001491220121     C                     ELSE                                                             AR743357
001492220121      *                                                                                     AR743357
001493220121     C                     GOTO END                                       S01221
001494220121     C                     ENDIF                                                            AR743357
001495220121     C*                                                                   S01221
001496220121     C                     END                                            S01221
001497220121     C/COPY WNCPYSRC,GL0559C006
001498220121     C                     MOVE ETYP      EVTP2   2                                           223572
001499220121      *                                                                                       223572
001500220121     C*                                                                   S01221
001501220121     C**  SKIP CAPITALISED INTEREST LOANS                                 E25263
001502220121     C           ETYP      IFEQ '61X2'                                    E25263
001503220121     C           ETYP      OREQ '62X2'                                    E25263
001504220121     C           ETYP      OREQ '64X2'                                    E25263
001505220121     C           ETYP      OREQ '66X2'                                    E25263
001506220121     C           ETYP      OREQ '70X2'                                    E25263
001507220121      *                                                                   CLE005
001508220121     C           CLE005    OREQ 'Y'                                       CLE005
001509220121     C           ETYP      ANDEQ'68X2'                                    CLE005
001510220121     C           CLE005    OREQ 'Y'                                       CLE005
001511220121     C           ETYP      ANDEQ'69X2'                                    CLE005
001512220121     C           CLE005    OREQ 'Y'                                       CLE005
001513220121     C           ETYP      ANDEQ'71X2'                                    CLE005
001514220121     C           CLE005    OREQ 'Y'                                       CLE005
001515220121     C           ETYP      ANDEQ'72X2'                                    CLE005
001516220121      *                                                                                       223572
001517220121     C           EVTP2     OREQ 'I6'                                                          223572
001518220121     C           EVTP2     OREQ 'V4'                                                          223572
001519220121     C           EVTP2     OREQ 'V6'                                                          223572
001520220121     C           EVTP2     OREQ 'M6'                                                          223572
001521220121     C           EVTP2     OREQ 'M8'                                                          223572
001522220121     C           EVTP2     OREQ 'R6'                                                          223572
001523220121     C           EVTP2     OREQ 'R4'                                                          223572
001524220121     C           ETYP      ANDNE'63R4'                                                        223572
001525220121     C           EVTP2     OREQ 'R4'                                                          223572
001526220121     C           ETYP      ANDNE'41R4'                                                        223572
001527220121     C           CLE028    OREQ 'Y'                                                           CLE028
001528220121     C           ETYP      ANDEQ'80X2'                                                        CLE028
001529220121     C           CLE028    OREQ 'Y'                                                           CLE028
001530220121     C           ETYP      ANDEQ'80H1'                                                        CLE028
001531220121     C*                                                                   E25263
001532220121      * Set on *IN41 so these event types are not output to spool file.   E25263
001533220121     C                     SETON                     41                   E25263
001534220121     C                     GOTO END                                       E25263
001535220121     C                     END                                            E25263
001536220121     C*                                                                   E25263
001537220121     C*********************SETON                     34                   E172
001538220121     C*
001539220121     C*    ACC. AMOUNT OF DETAIL RECORDS READ
001540220121     C*
001541220121      * Keep separate record count for the Security (II) Events.
001542220121      *
001543220121     C           *IN26     IFEQ '1'
001544220121     C           *IN27     OREQ '1'
001545220121     C           *IN28     OREQ '1'
001546220121     C************IN29*****OREQ '1'                                       E20669
001547220121     C                     Z-ADD4         X
001548220121     C                     ELSE
001549220121     C*
001550220121     C                     Z-ADD3         X
001551220121     C                     END
001552220121     C                     EXSR HASH
001553220121     C*    TEST WHETHER EVENT IS TO BE REPORTED
001554220121     C*
001555220121     C                     SETOF                     3542
001556220121     C*    IF EVENT IS SECURITIES TRADING, INCLUDE UNSETTLED TRADE        E19293
001557220121     C*    WITH EVENT DATE < RUN DATE                                     E19293
001558220121     C*    + ALL PAST-DUE POSITION SETTLEMENT EVENTS                      087177
001559220121     C           *IN26     IFEQ '1'                                       E19293
001560220121     C           *IN27     OREQ '1'                                       087177
001561220121     C           *IN28     OREQ '1'                                       087177
001562220121     C           EDAT      COMP ZDYNBR               41                   E19293
001563220121     C                     ELSE                                           E19293
001564220121     C           EDAT      COMP ZDYNBR               41
001565220121     C  N41      EDAT      COMP BJRDNB                 4141
001566220121     C                     END                                            E19293
001567220121     C*                                                                   AUS017
001568220121     C*    IF TYPE = 'FX' (SELECT FX DAILY EVENTS ONLY)                   AUS017
001569220121     C*                                                                   AUS017
001570220121     C           TYPE      IFEQ 'FX'                                      AUS017
001571220121     C           *IN41     ANDEQ'0'                                       AUS017
001572220121     C*                                                                   AUS017
001573220121     C*    SELECT ONLY F.X. DEALS                                         AUS017
001574220121     C*                                                                   AUS017
001575220121     C                     MOVELETYP      ET12    2                       AUS017
001576220121     C           ET12      IFNE '11'                                      AUS017
001577220121     C           ET12      ANDNE'12'                                      AUS017
001578220121     C           ET12      ANDNE'13'                                      AUS017
001579220121     C           ET12      ANDNE'14'                                      AUS017
001580220121     C           ETYP      ANDNE'CPV1'                                    CDL008
001581220121     C           ETYP      ANDNE'CRV1'                                    CDL008
001582220121     C                     MOVE '1'       *IN41                           AUS017
001583220121     C                     END                                            AUS017
001584220121     C*                                                                   AUS017
001585220121     C                     END                                            AUS017
001586220121     C*                                                                   AUS017
001587220121     C*    IF TYPE = 'MM' (SELECT MM DAILY EVENTS ONLY)                   AUS017
001588220121     C*                                                                   AUS017
001589220121     C           TYPE      IFEQ 'MM'                                      AUS017
001590220121     C           *IN41     ANDEQ'0'                                       AUS017
001591220121     C*                                                                   AUS017
001592220121     C*    SELECT ONLY F.X. DEALS                                         AUS017
001593220121     C*                                                                   AUS017
001594220121     C                     MOVELETYP      ET12    2                       AUS017
001595220121     C           ET12      IFNE '15'                                      AUS017
001596220121     C           ET12      ANDNE'16'                                      AUS017
001597220121     C           ET12      ANDNE'17'                                      AUS017
001598220121     C           ET12      ANDNE'18'                                      AUS017
001599220121     C                     MOVE '1'       *IN41                           AUS017
001600220121     C                     END                                            AUS017
001601220121     C*                                                                   AUS017
001602220121     C                     END                                            AUS017
001603220121     C*                                                                   AUS017
001604220121     C*****DO*NOT*REPORT*ROLLOVER*DEAL*IF*EVENT*IS*'START'*(='V1')*****   CEU003
001605220121     C*    DO NOT REPORT ROLLOVER DEAL IF EVENT IS 'START'(='V1' OR 'VX') CEU003
001606220121     C                     MOVE ETYP      PART    2
001607220121     C           PART      COMP 'V1'                     47
001608220121     C  N47      PART      COMP 'VX'                     47               CEU003
001609220121     C   47      RLVI      COMP 'Y'                      47
001610220121      *                                                                   E23278
001611220121     C*****Do*not*Process*Deal*Events*with*ETPY*'M2'***************E23278 CEU003
001612220121     C*    Do not Process Deal Events with ETPY 'M2' or 'MY'              CEU003
001613220121     C           *IN02     IFEQ '1'                                       E23278
001614220121     C           PART      ANDEQ'M2'                                      E23278
001615220121     C           *IN02     OREQ '1'                                       CEU003
001616220121     C           PART      ANDEQ'MY'                                      CEU003
001617220121     C                     SETON                         41               E23278
001618220121     C                     GOTO END                                       E23278
001619220121     C                     END                                            E23278
001620220121      *                                                                   E23278
001621220121      **   Allow Deal Events having field 'FIPI' blank to be processed    E23278
001622220121     C***47*02***                                                         CLE004
0016232201210292 C**********OR 20 02                                                  E23278
001624220121     C***OR*20*02                                                         CLE004
001625220121     C*  20
001626220121     C** 20 02
001627220121     C***OR*21***             SETON                     41                CLE004
001628220121     C*****DO*NOT REPORT EVENT FOR FUTURE AND OPTION                      073714
001629220121     C***82*****           SETON                     41                   073714
001630220121      *                                                                   CLE004
001631220121     C           *IN47     IFEQ '1'                                       CLE004
001632220121     C           *IN02     ANDEQ'1'                                       CLE004
001633220121     C           *IN20     OREQ '1'                                       CLE004
001634220121     C           *IN02     ANDEQ'1'                                       CLE004
001635220121     C           *IN21     OREQ '1'                                       CLE004
001636220121     C           CLE004    ANDNE'Y'                                       CLE004
001637220121     C           *IN21     OREQ '1'                                       CLE004
001638220121     C           CLE004    ANDEQ'Y'                                       CLE004
001639220121     C           *IN13     ANDEQ'0'                                       CLE004
001640220121     C                     MOVE '1'       *IN41                           CLE004
001641220121     C                     ENDIF                                          CLE004
001642220121      *                                                                   CLE004
001643220121      ** Report lending events with blank I/O indicator if it is          CLE004
001644220121      ** an internal parts purchased                                      CLE004
001645220121      *                                                                   CLE004
001646220121     C           CLE004    IFEQ 'Y'                                       CLE004
001647220121     C           *IN13     ANDEQ'1'                                       CLE004
001648220121     C           *IN21     ANDEQ'1'                                       CLE004
001649220121     C                     MOVE *BLANK    WWRP2   1                       CLE004
001650220121     C           LNRF      CHAINCLOAN                78                   CLE004
001651220121     C           *IN78     IFEQ '1'                                       CLE004
001652220121     C                     MOVEL'CLOAN   'DBFILE           ************   CLE004
001653220121     C                     MOVEL'05'      DBASE            * DBERR 05 *   CLE004
001654220121     C                     MOVELLNRF      DBKEY            ************   CLE004
001655220121     C                     EXSR *PSSR                                     CLE004
001656220121     C                     MOVE '1'       *IN99                           CLE004
001657220121     C                     GOTO END                                       CLE004
001658220121     C                     ENDIF                                          CLE004
001659220121      *                                                                   CLE004
001660220121     C           LNKS      IFNE 'Y'                                       CLE004
001661220121     C                     MOVE '1'       *IN41                           CLE004
001662220121     C                     ELSE                                           CLE004
001663220121     C                     MOVE '1'       *IN44                           CLE004
001664220121     C                     MOVE 'Y'       WWRP2                           CLE004
001665220121     C                     ENDIF                                          CLE004
001666220121     C                     ELSE                                           CLE004
001667220121     C                     MOVE *BLANK    WWRP2                           CLE004
001668220121     C                     ENDIF                                          CLE004
001669220121     C*                                                                   073714
001670220121     C** ONLY REPORT PREMIUM EVENTS FOR FUTURES & OPTIONS MODULE          073714
001671220121     C*                                                                   073714
001672220121     C***82***** ETYP      COMP '93V1'               4141  *              073714              CGL091
001673220121     C*                                                                   073714
001674220121      *                                                                                       CGL091
001675220121      * Check for eligible FF events                                                          CGL091
001676220121     C           *IN82     IFEQ '1'                                                           CGL091
001677220121      *                                                                                       CGL091
001678220121     C           ETYP      IFEQ '93V1'                                                        CGL091
001679220121     C           ETYP      OREQ '94V1'                                                        CGL091
001680220121     C           ETYP      OREQ '94V2'                                                        CGL091
001681220121     C           ETYP      OREQ '95V1'                                                        CGL091
001682220121     C           ETYP      OREQ '95V2'                                                        CGL091
001683220121     C           ETYP      OREQ '96V1'                                                        CGL091
001684220121     C           ETYP      OREQ '96V2'                                                        CGL091
001685220121     C           ETYP      OREQ '97V1'                                                        CGL091
001686220121     C           ETYP      OREQ '97V2'                                                        CGL091
001687220121     C           ETYP      OREQ '98V1'                                                        CGL091
001688220121     C           ETYP      OREQ '98V2'                                                        CGL091
001689220121     C           ETYP      OREQ '99V1'                                                        CGL091
001690220121     C           ETYP      OREQ '99V2'                                                        CGL091
001691220121     C                     MOVE '0'       *IN41                                               CGL091
001692220121      *                                                                                       CGL091
001693220121      * Only report events for OTC instrument types                                           CGL091
001694220121     C           ISTT      CHAININTYP                99                                       CGL091
001695220121     C           *IN99     IFEQ '1'                                                           CGL091
001696220121     C                     SETON                     U7U8LR                                   CGL091
001697220121     C                     MOVEL'INTYP   'DBFILE                                              CGL091
001698220121     C                     MOVEL'99'      DBASE                                               CGL091
001699220121     C                     MOVELISTT      DBKEY                                               CGL091
001700220121     C                     GOTO END                                                           CGL091
001701220121     C                     END                                                                CGL091
001702220121     C           ISTI      IFNE 'Y'                                                           CGL091
001703220121     C                     MOVE '1'       *IN41                                               CGL091
001704220121     C                     END                                                                CGL091
001705220121      *                                                                                       CGL091
001706220121      * else event type not required on report                                                CGL091
001707220121     C                     ELSE                                                               CGL091
001708220121     C                     MOVE '1'       *IN41                                               CGL091
001709220121     C                     END                                                                CGL091
001710220121     C                     END                                                                CGL091
001711220121      *                                                                                       CGL091
001712220121     C   41                GOTO END
001713220121     C*
001714220121     C*****DO*NOT*REPORT*BOOK*EVENTS*****                                 E20669
001715220121     C***29****************SETON                     41                   E20669
001716220121     C***41****************GOTO END                                       E20669
001717220121     C*
001718220121     C*    DO NOT REPORT IF COMPANY NOT SELECTED
001719220121     C           BRNCH     IFNE 'ALL'
001720220121     C***********BRNCH*****IFNE CMPYM                                     E172
001721220121     C           BRNCH     IFNE ECPY                                      E172
001722220121     C                     SETON                     41
001723220121     C                     GOTO END
001724220121     C                     END
001725220121     C                     END
001726220121     C*
001727220121     C*    THIS PART DONE FOR REPORTED DEAL EVENTS
001728220121     C*
001729220121     C                     SETOF                     55
001730220121     C   45                SETON                     46
001731220121     C  N44                SETON                     4344
001732220121     C   03                GOTO DATE
001733220121     C   13                GOTO DATE
001734220121      ** If processing TI events check for the LC  detail file having     CTI001
001735220121      ** been read.                                                       CTI001
001736220121     C           M#TION    IFEQ 'Y'                                       CTI001
001737220121     C           ULDET     ANDEQ'Y'                                       CTI001
001738220121     C                     GOTO DATE                                      CTI001
001739220121     C                     ENDIF                                          CTI001
001740220121      *                                                                   CTI001
001741220121     C***17****************GOTO DATE                                      E20669
001742220121     C   26                GOTO DATE
001743220121     C   27                GOTO DATE
001744220121     C   28                GOTO DATE
001745220121     C   82                GOTO DATE                                      073714
001746220121     C***29****************GOTO DATE                                      E20669
001747220121     C           CAP204    IFEQ 'Y'                                                           CAP204
001748220121     C           *IN71     ANDEQ'1'                                                           CAP204
001749220121     C                     GOTO DATE                                                          CAP204
001750220121     C                     ENDIF                                                              CAP204
001751220121     C           NGII      COMP 'Y'                      11
001752220121     C           PART      COMP 'M1'                     42
001753220121     C   42      ETYP      COMP '18M1'               4242
001754220121     C/COPY WNCPYSRC,GL0559C007
001755220121     C*                                                                   CEU003
001756220121      ** Check for Event type 18MX                                        CEU003
001757220121     C           ETYP      IFNE '18M1'                                    CEU003
001758220121     C           *IN42     ANDEQ*OFF                                      CEU003
001759220121     C           PART      COMP 'MX'                     42               CEU003
001760220121     C   42      ETYP      COMP '18MX'               4242                 CEU003
001761220121     C                     ENDIF                                          CEU003
001762220121     C*                                                                   CEU003
001763220121     C   42      EAMT      ADD  OTHA      REPAMT 130
001764220121     C*
001765220121     C*****FOR*FX*EVENTS*PRINT*DEALT*BASE*CCY*RATE************************090909
001766220121     C                     MOVELETYP      ET12    2
001767220121     C***********ET12      COMP '11'                     35               090909
001768220121     C**N35******ET12      COMP '12'                     35               090909
001769220121     C**N35******ET12      COMP '13'                     35               090909
001770220121     C**N35******ET12      COMP '14'                     35               090909
001771220121     C**   SUPPRESS PRINTING OF RATE IF NX
001772220121     C           ET12      IFEQ '10'
001773220121     C                     SETON                         23
001774220121     C                     END
001775220121     C*
001776220121     C*    CONVERT DAY NUMBERS TO ALPHAMERIC FORMAT
001777220121     C*
001778220121     C           DATE      TAG                             ** DATE TAG ***
001779220121     C                     Z-ADDEDAT      ZDAYNO
001780220121     C                     EXSR ZDATE2
001781220121     C                     MOVE ZADATE    EDATA   7
001782220121     C                     MOVE *BLANKS   OTHDA                           055798
001783220121     C           *IN26     IFEQ '0'
001784220121     C           *IN27     ANDEQ'0'
001785220121     C           *IN28     ANDEQ'0'
001786220121     C************IN29*****ANDEQ'0'                                       E20669
001787220121     C  N22                Z-ADDOTHD      ZDAYNO
001788220121     C  N22                EXSR ZDATE2
001789220121     C  N22                MOVE ZADATE    OTHDA   7
001790220121     C                     END
001791220121     C*
001792220121     C*    FOR C/L EVENTS MOVE INTEREST RATE TO FIELD WITH 8 DEC. POSNS.
001793220121     C*
001794220121     C   03                Z-ADDEINR      EINRX  128
001795220121     C   13                Z-ADDINTR      EINRX
001796220121     C*
001797220121     C*    OBTAIN EVENT NARRATIVE FOR OUTPUT TO REPORT
001798220121     C*                                                                   S01408
001799220121     C** SAVE THE EVENT DATE TO CONTROL SUBTOTAL OUTPUT WHEN NEW DATE                         CGL091
001800220121     C                     Z-ADDEDAT      SAVDAT  50                                          CGL091
001801220121     C*
001802220121     C/COPY WNCPYSRC,GL0559CCP3                                           S01408
001803220121     C*                                                                   S01408
001804220121     C*
001805220121     C           ETYP      IFEQ '    '                                    E20669
001806220121     C*                    MOVE *BLANKS   TABB                    E20669  E21676
001807220121     C                     MOVE *BLANKS   TABB                            E21676
001808220121     C                     MOVE *BLANKS   TABB2                                               CLE028
001809220121     C                     ELSE                                           E20669
001810220121      *                                                                                       CLE028
001811220121      ** If CLE028 is on and event is for flat rate loans,                                    CLE028
001812220121      ** use table TABA2/TABB2 so as to distinguish                                           CLE028
001813220121      ** event types '80M1' and '80M2' from that of TABA/TABB.                                CLE028
001814220121      *                                                                                       CLE028
001815220121     C           2         SUBSTETYP      WVAR2   2                                           CLE028
001816220121     C                     MOVE *OFF      *IN64                                               CLE028
001817220121     C           CLE028    IFEQ 'Y'                                                           CLE028
001818220121     C           *IN13     ANDEQ*ON                                                           CLE028
001819220121     C           WVAR2     ANDEQ'80'                                                          CLE028
001820220121     C           ETYP      LOKUPTABA2     TABB2          50                                   CLE028
001821220121     C                     MOVE *ON       *IN64                                               CLE028
001822220121     C                     ELSE                                                               CLE028
001823220121     C           ETYP      LOKUPTABA      TABB           50
001824220121     C                     ENDIF                                                              CLE028
001825220121     C                     END                                            E20669
001826220121     C*                                                                   S01408
001827220121     C/COPY WNCPYSRC,GL0559CCP4                                           S01408
001828220121     C*                                                                   S01408
001829220121     C           *IN63     IFEQ '1'                        B*1            S01496
001830220121     C                     MOVE *BLANKS   EVNARR 15                       S01496
001831220121     C                     MOVE '0'       *IN62                           S01496
001832220121     C*                                                                   S01496
001833220121     C**  Record is from PF/TREVED and Due to ER indicator is on.         S01496
001834220121     C*                                                                   S01496
001835220121     C           *IN26     IFEQ '1'                        B*2            S01496
001836220121     C           WEARL     ANDEQ'Y'                                       S01496
001837220121     C*                                                                   S01496
001838220121     C                     MOVE '1'       *IN62                           S01496
001839220121     C*                                                                   S01496
001840220121     C**  Check In/Out indicator.                                         S01496
001841220121     C*                                                                   S01496
001842220121     C           INOI      IFEQ 'I'                        B*3            S01496
001843220121     C                     MOVELNARR,1    EVNARR                          S01496
001844220121     C                     ELSE                            X*3            S01496
001845220121     C                     MOVELNARR,2    EVNARR                          S01496
001846220121     C                     END                             E*3            S01496
001847220121     C                     END                             E*2            S01496
001848220121     C*                                                                   S01496
001849220121     C**  Record is from PF/CPEVED and Due to ER indicator is on.         S01496
001850220121     C*                                                                   S01496
001851220121     C           *IN27     IFEQ '1'                        B*2            S01496
001852220121     C           WEARL     ANDEQ'Y'                                       S01496
001853220121     C                     MOVE '1'       *IN62                           S01496
001854220121     C                     MOVELNARR,3    EVNARR                          S01496
001855220121     C                     END                             E*2            S01496
001856220121     C*                                                                   S01496
001857220121     C**  Record is from PF/DPEVED and Due to ER indicator is on.         S01496
001858220121     C*                                                                   S01496
001859220121     C           *IN28     IFEQ '1'                        B*2            S01496
001860220121     C           WEARL     ANDEQ'Y'                                       S01496
001861220121     C                     MOVE '1'       *IN62                           S01496
001862220121     C                     MOVELNARR,4    EVNARR                          S01496
001863220121     C                     END                             E*2            S01496
001864220121     C*                                                                   S01496
001865220121     C                     END                             E*1            S01496
001866220121     C*
001867220121     C           *IN53     IFEQ '1'                        B*1            CSE007
001868220121     C                     MOVE *BLANKS   CANARR 15                       CSE007
001869220121     C                     MOVE '0'       *IN54                           CSE007
001870220121     C*                                                                   CSE007
001871220121     C**  Record is from PF/TREVED and Due to CA indicator is on.         CSE007
001872220121     C*                                                                   CSE007
001873220121     C           *IN26     IFEQ '1'                        B*2            CSE007
001874220121     C           WCOAF     ANDEQ'Y'                                       CSE007
001875220121     C*                                                                   CSE007
001876220121     C                     MOVE '1'       *IN54                           CSE007
001877220121     C*                                                                   CSE007
001878220121     C**  Check In/Out indicator.                                         CSE007
001879220121     C*                                                                   CSE007
001880220121     C           INOI      IFEQ 'I'                        B*3            CSE007
001881220121     C                     MOVELNARR1,1   CANARR                          CSE007
001882220121     C                     ELSE                            X*3            CSE007
001883220121     C                     MOVELNARR1,2   CANARR                          CSE007
001884220121     C                     END                             E*3            CSE007
001885220121     C                     END                             E*2            CSE007
001886220121     C*                                                                   CSE007
001887220121     C**  Record is from PF/CPEVED and Due to CA indicator is on.         CSE007
001888220121     C*                                                                   CSE007
001889220121     C           *IN27     IFEQ '1'                        B*2            CSE007
001890220121     C           WCOAF     ANDEQ'Y'                                       CSE007
001891220121     C                     MOVE '1'       *IN54                           CSE007
001892220121     C                     MOVELNARR1,3   CANARR                          CSE007
001893220121     C                     END                             E*2            CSE007
001894220121     C*                                                                   CSE007
001895220121     C**  Record is from PF/DPEVED and Due to CA indicator is on.         CSE007
001896220121     C*                                                                   CSE007
001897220121     C           *IN28     IFEQ '1'                        B*2            CSE007
001898220121     C           WCOAF     ANDEQ'Y'                                       CSE007
001899220121     C                     MOVE '1'       *IN54                           CSE007
001900220121     C                     MOVELNARR1,4   CANARR                          CSE007
001901220121     C                     END                             E*2            CSE007
001902220121     C*                                                                   CSE007
001903220121     C                     END                             E*1            CSE007
001904220121      *                                                                                       CIR007
001905220121      ** Change the 'Event Type' description to 'INT.ESTIMATE' if                             CIR007
001906220121      ** either side of the deal is an OIS and the event record                               CIR007
001907220121      ** represent an interest event for an IRS deal (ETYP='22I1')                            CIR007
001908220121      *                                                                                       CIR007
001909220121     C           CIR007    IFEQ 'Y'                                                           CIR007
001910220121      *                                                                                       CIR007
001911220121     C           ETYP      IFEQ '22I1'                                                        CIR007
001912220121      *                                                                                       CIR007
001913220121     C                     MOVE *BLANKS   CANARR                                              CIR007
001914220121      *                                                                                       CIR007
001915220121      ** Call program DL1660 to obtain deal information from deals file                       CIR007
001916220121      ** DEALSDG.                                                                             CIR007
001917220121      *                                                                                       CIR007
001918220121     C                     CALL 'DL1660'                                                      CIR007
001919220121     C                     PARM DLNO      PDLNUM  60                                          CIR007
001920220121     C                     PARM 'N'       POIS    1                                           CIR007
001921220121     C                     PARM 'N'       PERR    1                                           CIR007
001922220121      *                                                                                       CIR007
001923220121     C           PERR      IFEQ 'Y'                                                           CIR007
001924220121     C                     MOVE *ON       *INU7                                               CIR007
001925220121     C                     MOVE *ON       *INU8                                               CIR007
001926220121     C                     MOVE *ON       *INLR                                               CIR007
001927220121     C                     MOVEL'15'      DBASE                                               CIR007
001928220121     C                     MOVEL'DEALSDG' DBFILE    P                                         CIR007
001929220121     C                     MOVELPDLNUM    DBKEY     P                                         CIR007
001930220121     C                     ENDIF                                                              CIR007
001931220121      *                                                                                       CIR007
001932220121      ** Returned code POIS is equal to Y if either OUR or THEIR side                         CIR007
001933220121      ** of the deal is an OIS.                                                               CIR007
001934220121      *                                                                                       CIR007
001935220121     C           POIS      IFEQ 'Y'                                                           CIR007
001936220121     C                     MOVE *ON       *IN54                                               CIR007
001937220121     C                     MOVE WINEST    CANARR                                              CIR007
001938220121     C                     ENDIF                                                              CIR007
001939220121      *                                                                                       CIR007
001940220121     C                     ENDIF                                                              CIR007
001941220121      *                                                                                       CIR007
001942220121     C                     ENDIF                                                              CIR007
001943220121      *                                                                                       CIR007
001944220121     C*
001945220121     C*       CUSTOMER LENDING COMMITMENT FEES EVENT (SETUP FIELDS)
001946220121     C   13      ETYP      COMP '71F2'                   48
001947220121     C***13*48*************MOVELFTYP      LNRF2                           E193
001948220121     C***13*48*************MOVE FSEQ      LNRF2                           E193
001949220121     C*
001950220121     C*
001951220121     C           INOI      COMP 'I'                      60
001952220121     C           INOI      COMP 'O'                      61
001953220121     C*
001954220121     C*    IF EVENT TYPE ENDS IN 'N1' DONT PRINT EVENT AMOUNT
001955220121     C*
001956220121     C                     MOVE ETYP      ALPH2
001957220121     C           ALPH2     IFEQ 'N1'
001958220121     C                     MOVEA'00'      *IN,60
001959220121     C                     END
001960220121     C*
001961220121     C*    IF EVENT TYPE ENDS IN 'N2' DONT PRINT EVENT
001962220121     C*    EVENT MAY BE OUTPUT TO NOSEX FILE
001963220121     C*
001964220121     C           ALPH2     IFEQ 'N2'
001965220121     C                     MOVEA'1'       *IN,41
001966220121     C                     END
001967220121     C*
001968220121     C*    TEST WHETHER EVENT RECORD IS TO BE OUTPUT TO NOSEX FILE
001969220121     C           SETP      COMP 01                       65
001970220121     C  N65      SETP      COMP 02                       65
001971220121     C  N65      SETP      COMP 07                       65
001972220121     C  N65      SETP      COMP 08                       65
001973220121     C  N65      SETP      COMP 12                       65
001974220121     C*
001975220121     C*    MAINTAIN TOTALS OF NUMBER AND VALUE OF RECORDS REPORTED,
001976220121     C*    AND OF NUMBER AND VALUE OF RECORDS WRITTEN TO NOSEX
001977220121     C*
001978220121     C                     SETOF                     81
001979220121     C           *IN41     IFEQ '0'
001980220121     C           RECREP    ADD  1         RECREP  50
001981220121     C                     Z-ADD1         X       10
001982220121     C                     EXSR HASH
001983220121     C                     END
001984220121     C   02      RLVI      COMP 'Y'                      81
001985220121     C   42 81   REPAMT    SUB  RBDA      REPAMT
001986220121     C*                                                                   S01392
001987220121     C* IF FRONT-UP INTEREST = Y                                          S01392
001988220121     C*                                                                   S01392
001989220121     C   02      FUID      IFEQ 'Y'                                       S01392
001990220121     C*                                                                   S01392
001991220121     C* INCLUDE INTEREST ON VALUE DATE EVENT                              S01392
001992220121     C*                                                                   S01392
001993220121     C           ETYP      IFEQ '15V1'                                    S01392
001994220121     C           ETYP      OREQ '16V1'                                    S01392
001995220121     C           ETYP      OREQ '15VX'                                    CEU003
001996220121     C           ETYP      OREQ '16VX'                                    CEU003
001997220121     C           EAMT      SUB  OTHA      REPAMT                          S01392
001998220121     C                     MOVE '1'       *IN42                           S01392
001999220121     C                     END                                            S01392
002000220121     C*                                                                   S01392
002001220121     C* IF MATURITY DATE EVENT WITH ROLLOVER, ACCESS ROLLOVER DEAL        S01392
002002220121     C* FOR NET SETTLEMENT AMOUNT (FRONT-UP INTEREST ON THAT DEAL)        S01392
002003220121     C*                                                                   S01392
002004220121     C           ETYP      IFEQ '15M1'                                    S01392
002005220121     C           ETYP      OREQ '16M1'                                    S01392
002006220121     C           ETYP      OREQ '15MX'                                    CEU003
002007220121     C           ETYP      OREQ '16MX'                                    CEU003
002008220121     C           RLVI      IFEQ 'Y'                                       S01392
002009220121     C           RBDN      CHAINDRSDEALS             99    *              S01392
002010220121     C           *IN99     IFEQ '1'                                       S01392
002011220121     C                     SETON                     U7U8LR               S01392
002012220121     C                     MOVEL'DRSDEALS'DBFILE                          S01392
002013220121     C                     MOVEL'04'      DBASE                           S01392
002014220121     C                     MOVELRBDN      DBKEY                           S01392
002015220121     C                     GOTO END                                       S01392
002016220121     C                     END                                            S01392
002017220121     C                     Z-ADDTOTI      REPAMT                          S01392
002018220121     C                     MOVE '1'       *IN42                           S01392
002019220121     C** SET UP MARKER TO INDICATE DEAL EVENT WAS A ROLLOVER                                  CGL091
002020220121     C                     MOVE 'Y'       ROLLY   1                                           CGL091
002021220121     C/COPY WNCPYSRC,GL0559C003
002022220121     C                     END                                            S01392
002023220121     C                     END                                            S01392
002024220121     C                     END                                            S01392
002025220121     C** SHOW REPAYMENT AMOUNT ON THE REPORT IF DEAL ROLLED OVER.
002026220121     C*
002027220121     C           *IN37     IFEQ '1'                        ## B001
002028220121     C                     MOVE 'F'       RECI             'FOR OUTPUT
002029220121     C*
002030220121     C           INOI      IFEQ 'I'                        ## B002
002031220121     C                     Z-ADDEAMT      INPYAM 130       'INOI = I
002032220121     C                     Z-ADD*ZEROS    OTPYAM 130
002033220121     C                     ELSE                            ## X002
002034220121     C                     Z-ADDEAMT      OTPYAM           'INOI = O
002035220121     C                     Z-ADD*ZEROS    INPYAM
002036220121     C                     END                             ## E002
002037220121     C*
002038220121     C           ETYP      IFEQ '91P3'                     ## B002
002039220121     C           ETYP      OREQ '91P5'
002040220121     C           ETYP      OREQ '91P7'
002041220121     C                     MOVE *BLANKS   OTHDA
002042220121     C                     END                             ## E002
002043220121     C*
002044220121     C                     SETOF                     65
002045220121     C           STNI      IFEQ 'Y'                        ## B002
002046220121     C                     SETON                     65    'OUTPUT
002047220121     C                     END                             ## E002
002048220121     C*
002049220121     C                     END                             ## E001
002050220121     C*
002051220121      *                                                                                       CAP204
002052220121      ** Move Incoming and Outgoing amount                                                    CAP204
002053220121      *                                                                                       CAP204
002054220121     C           CAP204    IFEQ 'Y'                                                           CAP204
002055220121     C           *IN71     ANDEQ'1'                                                           CAP204
002056220121     C           INOI      IFEQ 'I'                                                           CAP204
002057220121     C                     Z-ADDEAMT      INAMT  130                                          CAP204
002058220121     C                     Z-ADD0         OTAMT  130                                          CAP204
002059220121     C                     ELSE                                                               CAP204
002060220121     C                     Z-ADD0         INAMT                                               CAP204
002061220121     C                     Z-ADDEAMT      OTAMT                                               CAP204
002062220121     C                     ENDIF                                                              CAP204
002063220121     C                     ENDIF                                                              CAP204
002064220121      ** Convert Amounts to Euro equivalent for 'In' ccy                  CEU011
002065220121      *                                                                   CEU011
002066220121     C           CEU011    IFEQ 'Y'                                       CEU011
002067220121     C           A6INCY    ANDEQ'Y'                                       CEU011
002068220121      *                                                                   CEU011
002069220121     C                     MOVE *ON       *IN39                           CEU011
002070220121     C                     MOVE *BLANKS   PRTCD                           CEU011
002071220121     C                     MOVE ECCY      PFRCY                           CEU011
002072220121     C                     MOVE BKEURO    PTOCY                           CEU011
002073220121     C                     Z-ADD0         POUTA                           CEU011
002074220121     C                     Z-ADD0         PINTA                           CEU011
002075220121     C                     Z-ADD0         PEXRT                           CEU011
002076220121     C                     MOVE *BLANKS   PMDIN                           CEU011
002077220121      *                                                                   CEU011
002078220121     C           *IN02     IFEQ *ON                                       CEU011
002079220121     C           *IN03     OREQ *ON                                       CEU011
002080220121     C           *IN13     OREQ *ON                                       CEU011
002081220121     C           *IN15     OREQ *ON                                       CEU011
002082220121     C           *IN26     OREQ *ON                                       CEU011
002083220121     C           *IN27     OREQ *ON                                       CEU011
002084220121     C           *IN28     OREQ *ON                                       CEU011
002085220121     C           *IN82     OREQ *ON                                       CEU011
002086220121      *                                                                   CEU011
002087220121     C                     Z-ADDEAMT      PFRAM                           CEU011
002088220121     C                     MOVEL'10'      WDBASE  2                       CEU011
002089220121     C                     EXSR SREURO                                    CEU011
002090220121     C                     Z-ADDPOUTA     WEAMT  130                      CEU011
002091220121      *                                                                   CEU011
002092220121     C           *IN82     IFEQ *OFF                                      CEU011
002093220121     C                     Z-ADDREPAMT    PFRAM                           CEU011
002094220121     C                     MOVEL'11'      WDBASE                          CEU011
002095220121     C                     EXSR SREURO                                    CEU011
002096220121     C                     Z-ADDPOUTA     WPAMT  130                      CEU011
002097220121     C                     ENDIF                                          CEU011
002098220121     C                     ELSE                                           CEU011
002099220121      *                                                                   CEU011
002100220121     C           *IN37     IFEQ *ON                                       CEU011
002101220121      *                                                                   CEU011
002102220121     C                     Z-ADDINPYAM    PFRAM                           CEU011
002103220121     C                     MOVEL'12'      WDBASE                          CEU011
002104220121     C                     EXSR SREURO                                    CEU011
002105220121     C                     Z-ADDPOUTA     WINPY  130                      CEU011
002106220121      *                                                                   CEU011
002107220121     C                     Z-ADDOTPYAM    PFRAM                           CEU011
002108220121     C                     MOVEL'13'      WDBASE                          CEU011
002109220121     C                     EXSR SREURO                                    CEU011
002110220121     C                     Z-ADDPOUTA     WOTPY  130                      CEU011
002111220121     C                     ENDIF                                          CEU011
002112220121      *                                                                                       CAP204
002113220121      ** Convert amounts to EURO                                                              CAP204
002114220121      *                                                                                       CAP204
002115220121     C           CAP204    IFEQ 'Y'                                                           CAP204
002116220121     C           *IN71     ANDEQ'1'                                                           CAP204
002117220121     C                     Z-ADDINAMT     PFRAM                                               CAP204
002118220121     C                     MOVEL'14'      WDBASE                                              CAP204
002119220121     C                     EXSR SREURO                                                        CAP204
002120220121     C                     Z-ADDPOUTA     WINAMT 130                                          CAP204
002121220121      *                                                                                       CAP204
002122220121     C                     Z-ADDOTAMT     PFRAM                                               CAP204
002123220121     C                     MOVEL'15'      WDBASE                                              CAP204
002124220121     C                     EXSR SREURO                                                        CAP204
002125220121     C                     Z-ADDPOUTA     WOTAMT 130                                          CAP204
002126220121     C                     ENDIF                                                              CAP204
002127220121      *                                                                   CEU011
002128220121     C                     ENDIF                                          CEU011
002129220121      *                                                                   CEU011
002130220121     C                     ENDIF                                          CEU011
002131220121      *                                                                   CEU011
002132220121     C*  FOR EVENT TYPES  31B5, 31C5, 31D5, CHECK MATURITY DATE
002133220121     C*  INDICATOR
002134220121     C*
002135220121     C           ETYP      IFEQ '31B5'
002136220121     C           ETYP      OREQ '31C5'
002137220121     C           ETYP      OREQ '31D5'
002138220121     C*
002139220121     C*  IF MATURITY DATE INDICATOR = 'O', SET ON INDICATOR TO
002140220121     C*  OUTPUT '* OVERDUE *' ON REPORT
002141220121     C*  IF MATURITY DATE INDICATOR = 'A', SET ON INDICATOR TO
002142220121     C*  OUTPUT '* APPROXIMATE *' ON REPORT
002143220121     C*
002144220121     C           MDTI      IFEQ 'O'
002145220121     C                     MOVE '1'       *IN75
002146220121     C                     ELSE
002147220121     C                     MOVE '0'       *IN75
002148220121     C                     END
002149220121     C*
002150220121     C           MDTI      IFEQ 'A'
002151220121     C                     MOVE '1'       *IN76
002152220121     C                     ELSE
002153220121     C                     MOVE '0'       *IN76
002154220121     C                     END
002155220121     C*
002156220121     C                     ELSE
002157220121     C                     MOVE '0'       *IN75
002158220121     C                     MOVE '0'       *IN76
002159220121     C                     END
002160220121      *                                                                   CLE004
002161220121      ** If event is an internal parts purchased, do not output in P1     CLE004
002162220121      *                                                                   CLE004
002163220121     C           WWRP2     IFEQ 'Y'                                       CLE004
002164220121     C                     MOVE '1'       *IN41                           CLE004
002165220121     C                     ENDIF                                          CLE004
002166220121      *                                                                   CLE004
002167220121     C           *INL2     IFEQ '1'                                       E172
002168220121     C           *IN52     OREQ '1'                                       E172
002169220121     C           *IN41     ANDEQ'0'                                       E172
002170220121     C                     MOVE '0'       *IN52                           E172
002171220121     C                     MOVE '1'       *IN34                           E172
002172220121     C*********************CLOSEDL0552P1                             E172 E257
002173220121     C*********************CLOSEDL0550P1                        E172 E257 LN0746
002174220121     C*********************CLOSEDL0552P1                            LN0746E22608
002175220121      *                                                                                       CGL091
002176220121      * Only close P1 if not LR and not report for one branch                                 CGL091
002177220121     C           *INLR     IFNE '1'                                                           CGL091
002178220121     C                     CLOSEGL0559P1                                  E22608
002179220121     C           BRNCH     IFEQ 'ALL'                                     E172
002180220121     C           BRNCH     OREQ ECPY                                      E172
002181220121     C                     SETON                     5855                 E172
002182220121     C*********************OPEN DL0552P1                             E172 E257
002183220121     C*********************OPEN DL0550P1                        E172 E257 LN0746
002184220121     C*********************OPEN DL0552P1                            LN0746E22608
002185220121     C                     OPEN GL0559P1                                  E22608
002186220121     C*                                                                   E172
002187220121      ** TRANSFER BINARY DATA INTO NUMERIC FIELD                          E172
002188220121     C                     Z-ADDSFNUM     ZSNUM   60                      E172
002189220121     C*                                                                   E172
002190220121     C** ENSURE REPORT SPOOL FILE RECORDED BY RCF                         E172
002191220121     C                     CALL 'ZSFILE'                                  E172
002192220121     C                     PARM           SEQ                             E172
002193220121     C                     PARM ECPY      @PARM                           E172
002194220121     C                     PARM           SFILE                           E172
002195220121     C                     PARM           ZSNUM                           E172
002196220121     C                     PARM *BLANK    ZSERR   1                 S01117E172
002197220121     C*                                                             S01117E172
002198220121     C           ZSERR     IFEQ 'Y'                                 S01117E172
002199220121     C                     SETON                     U7U8LR         S01117E172
002200220121     C                     RETRN                                    S01117E172
002201220121     C                     END                                      S01117E172
002202220121     C*                                                                   E172
002203220121     C                     Z-ADD0         PAGE                            E172
002204220121      * Reset running totals on change of company                                             CGL091
002205220121     C                     Z-ADD0         RPAMT                                               CGL091
002206220121     C                     Z-ADD0         RINTAM                                              CGL091
002207220121     C                     Z-ADD0         RTAMT                                               CGL091
002208220121     C** READ COMPANY FILE VIA ACCESS PROGRAM                             E172
002209220121     C                     CALL 'AOCOMPR0'                                E172
002210220121     C                     PARM '*MSG   ' @RTCD   7                       E172
002211220121     C                     PARM '*KEY   ' @OPTN   7                       E172
002212220121     C                     PARM ECPY      @CENB   3                       E172
002213220121     C           SDCOMP    PARM SDCOMP    DSFDY
002214220121     C           @RTCD     IFNE *BLANK                                    E172
002215220121     C                     MOVEL'SDCOMPPD'DBFILE 10        ************   E172
002216220121     C                     MOVEL'01'      DBASE   2        * DBERR 01 *   E172
002217220121     C                     MOVEL@OPTN     DBOPTN  7        ************   E172
002218220121     C                     MOVELECPY      DBKEY  29                       E172
002219220121     C                     EXSR *PSSR                                     E172
002220220121     C                     SETON                     99                   E172
002221220121     C                     GOTO END                                       E172
002222220121     C                     END                                            E172
002223220121     C*                                                                   E172
002224220121     C                     ELSE                                           E172
002225220121     C                     SETOF                     58                   E172
002226220121     C                     SETON                     41                   E172
002227220121     C                     END                                                                CGL091
002228220121     C                     END                                            E172
002229220121     C                     END                                            E172
002230220121      *                                                                   CLE004
002231220121      ** For CLE004, if a LE event is read that is an internal parts      CLE004
002232220121      ** purchased, output to GL0550P2                                    CLE004
002233220121      *                                                                   CLE004
002234220121     C           WWRP2     IFEQ 'Y'                                       CLE004
002235220121      *                                                                   CLE004
002236220121      ** Every new branch should be reported on a new page                CLE004
002237220121      *                                                                   CLE004
002238220121     C           ECPY      IFNE RECPY                                     CLE004
002239220121      *                                                                   CLE004
002240220121     C           WOPEN     IFEQ 'Y'                                       CLE004
002241220121     C                     WRITETRAILP2                                   CLE004
002242220121     C                     CLOSEGL0559P2                                  CLE004
002243220121     C                     ENDIF                                          CLE004
002244220121      *                                                                   CLE004
002245220121      ** Make GL0559P2 available and ensure that it recorded by RCF       CLE004
002246220121      *                                                                   CLE004
002247220121     C                     OPEN GL0559P2                                  CLE004
002248220121     C                     MOVE '1'       *IN79                           CLE004
002249220121     C                     MOVE 'Y'       WOPEN   1                       CLE004
002250220121     C                     Z-ADDSFNUM2    ZSNUM2  60                      CLE004
002251220121     C                     CALL 'ZSFILE'                                  CLE004
002252220121     C                     PARM           SEQ                             CLE004
002253220121     C                     PARM ECPY      @PARM                           CLE004
002254220121     C                     PARM           SFILE2                          CLE004
002255220121     C                     PARM           ZSNUM2                          CLE004
002256220121     C                     PARM *BLANK    ZSERR   1                       CLE004
002257220121     C           ZSERR     IFEQ 'Y'                                       CLE004
002258220121     C                     SETON                     U7U8LR               CLE004
002259220121     C                     RETRN                                          CLE004
002260220121     C                     ENDIF                                          CLE004
002261220121      *                                                                   CLE004
002262220121      ** Get new company's details                                        CLE004
002263220121      *                                                                   CLE004
002264220121     C           ECPY      IFNE APCMCD                                    CLE004
002265220121     C                     CALL 'AOCOMPR0'                                CLE004
002266220121     C                     PARM '*MSG   ' @RTCD                           CLE004
002267220121     C                     PARM '*KEY   ' @OPTN                           CLE004
002268220121     C                     PARM ECPY      @CENB                           CLE004
002269220121     C           SDCOMP    PARM SDCOMP    DSFDY                           CLE004
002270220121     C           @RTCD     IFNE *BLANK                                    CLE004
002271220121     C                     MOVEL'SDCOMPPD'DBFILE           ************   CLE004
002272220121     C                     MOVEL'01'      DBASE   2        * DBERR 01 *   CLE004
002273220121     C                     MOVELECPY      DBKEY  29        ************   CLE004
002274220121     C                     EXSR *PSSR                                     CLE004
002275220121     C                     SETON                     99                   CLE004
002276220121     C                     GOTO END                                       CLE004
002277220121     C                     ENDIF                                          CLE004
002278220121     C                     ENDIF                                          CLE004
002279220121      *                                                                   CLE004
002280220121     C                     MOVE ECPY      RECPY                           CLE004
002281220121     C                     MOVE APCMNM    RCMNM                           CLE004
002282220121     C                     ENDIF                                          CLE004
002283220121      *                                                                   CLE004
002284220121      ** Write details of internal parts purchased                        CLE004
002285220121      *                                                                   CLE004
002286220121     C                     MOVE CRNM      RCRNM                           CLE004
002287220121     C                     MOVE CTWN      RCTWN                           CLE004
002288220121     C           *IN48     IFEQ '0'                                       CLE004
002289220121     C                     MOVE LNRF      RLNRF                           CLE004
002290220121     C                     ELSE                                           CLE004
002291220121     C                     MOVELFTYP      RLNRF                           CLE004
002292220121     C                     MOVEL'/'       WTEMP   3                       CLE004
002293220121     C                     MOVE FSEQ      WTEMP                           CLE004
002294220121     C                     MOVE WTEMP     RLNRF                           CLE004
002295220121     C                     ENDIF                                          CLE004
002296220121     C                     MOVE EDATA     REDAT                           CLE004
002297220121     C                     MOVE TABB      RENAR                           CLE004
002298220121     C                     MOVE OTHDA     ROTHD                           CLE004
002299220121     C                     MOVE EAMT      ZFLD15                          CLE004
002300220121     C                     MOVE 'J'       ZECODE                          CLE004
002301220121     C                     Z-ADDA6NBDP    ZDECS                           CLE004
002302220121     C                     EXSR ZSEDIT                                    CLE004
002303220121     C                     MOVE ZOUT21    REAMT                           CLE004
002304220121     C                     MOVE EINRX     ZFLD15                          CLE004
002305220121     C                     Z-ADD8         ZDECS                           CLE004
002306220121     C                     EXSR ZSEDIT                                    CLE004
002307220121     C                     MOVE ZOUT21    RINTR                           CLE004
002308220121      *                                                                   CLE004
002309220121      ** Write on a new page for overflows or new currencies              CLE004
002310220121      *                                                                   CLE004
002311220121     C           *IN79     IFEQ '1'                                       CLE004
002312220121     C           A6CYNM    ORNE RCYNM                                     CLE004
002313220121     C                     MOVE A6CYNM    RCYNM                           CLE004
002314220121     C                     WRITEHEADP2                                    CLE004
002315220121     C                     WRITECOLMP2                                    CLE004
002316220121     C                     MOVE '0'       *IN79                           CLE004
002317220121     C                     ENDIF                                          CLE004
002318220121     C                     WRITEDETLP2                                    CLE004
002319220121     C                     MOVE '1'       *IN41                           CLE004
002320220121      *                                                                   CLE004
002321220121     C                     ENDIF                                          CLE004
002322220121     C*
002323220121     C**N65****************GOTO END                                       E193
002324220121     C***********RECRIT****ADD  1         RECRIT  50                      E193
002325220121     C*********************Z-ADD2         X                               E193
002326220121     C*********************EXSR HASH                                      E193
002327220121      *                                                                   E172
002328220121     C**
002329220121     C** SETUP THE OUTPUT FIELDS FOR THE NEW COLUMNS                                          CGL091
002330220121     C           *IN41     IFEQ '0'                                                           CGL091
002331220121     C** CLEAR THE FIELDS                                                                     CGL091
002332220121     C                     Z-ADD*ZEROS    PRAMT  130                                          CGL091
002333220121     C                     Z-ADD*ZEROS    INTAMT 130                                          CGL091
002334220121     C                     MOVE ETYP      TEST2   2                                           CGL091
002335220121     C           TEST2     IFEQ 'V1'                                                          CGL091
002336220121     C           TEST2     OREQ 'V2'                                                          CGL091
002337220121     C           TEST2     OREQ 'V3'                                                          CGL091
002338220121     C           TEST2     OREQ 'M4'                                                          CGL091
002339220121     C           TEST2     OREQ 'R1'                                                          CGL091
002340220121     C           TEST2     OREQ 'R3'                                                          CGL091
002341220121     C           TEST2     OREQ 'M1'                                                          CGL091
002342220121      *                                                                                       CGL091
002343220121      * Include FRA/IRS notional principal amounts and SE trade,                              CGL091
002344220121      * part payment, mortgage and maturity amounts in principal                              CGL091
002345220121      * column                                                                                CGL091
002346220121     C           ETYP      OREQ '21S1'                                                        CGL091
002347220121     C           ETYP      OREQ '21S2'                                                        CGL091
002348220121     C           ETYP      OREQ '21C1'                                                        CGL091
002349220121     C           ETYP      OREQ '21C2'                                                        CGL091
002350220121     C           ETYP      OREQ '22S1'                                                        CGL091
002351220121     C           ETYP      OREQ '22S2'                                                        CGL091
002352220121     C           ETYP      OREQ '22C1'                                                        CGL091
002353220121     C           ETYP      OREQ '22C2'                                                        CGL091
002354220121     C           ETYP      OREQ '23S1'                                                        CGL091
002355220121     C           ETYP      OREQ '23S2'                                                        CGL091
002356220121     C           ETYP      OREQ '23C1'                                                        CGL091
002357220121     C           ETYP      OREQ '23C2'                                                        CGL091
002358220121     C           ETYP      OREQ '24S1'                                                        CGL091
002359220121     C           ETYP      OREQ '24S2'                                                        CGL091
002360220121     C           ETYP      OREQ '24C1'                                                        CGL091
002361220121     C           ETYP      OREQ '24C2'                                                        CGL091
002362220121     C           ETYP      OREQ '31P1'                                                        CGL091
002363220121     C           ETYP      OREQ '31S1'                                                        CGL091
002364220121     C           ETYP      OREQ '31C1'                                                        CGL091
002365220121     C           ETYP      OREQ '31C4'                                                        CGL091
002366220121     C           ETYP      OREQ '31C5'                                                        CGL091
002367220121     C           ETYP      OREQ '31D1'                                                        CGL091
002368220121     C           ETYP      OREQ '31D4'                                                        CGL091
002369220121     C           ETYP      OREQ '31D5'                                                        CGL091
002370220121     C                     Z-ADDEAMT      PRAMT                                               CGL091
002371220121     C                     END                                                                CGL091
002372220121      *                                                                                       CGL091
002373220121      * Include FRA/IRS notional interest amounts and SE coupon                               CGL091
002374220121      * and dividend amounts in interest column                                               CGL091
002375220121     C           TEST2     IFEQ 'I2'                                                          CGL091
002376220121     C           TEST2     OREQ 'R2'                                                          CGL091
002377220121     C           TEST2     OREQ 'M2'                                                          CGL091
002378220121     C           ETYP      OREQ '21S3'                                                        CGL091
002379220121     C           ETYP      OREQ '21C3'                                                        CGL091
002380220121     C           ETYP      OREQ '22I1'                                                        CGL091
002381220121     C           ETYP      OREQ '23I1'                                                        CGL091
002382220121     C           ETYP      OREQ '24I1'                                                        CGL091
002383220121     C           ETYP      OREQ '31C2'                                                        CGL091
002384220121     C           ETYP      OREQ '31C3'                                                        CGL091
002385220121     C           ETYP      OREQ '31D2'                                                        CGL091
002386220121     C           ETYP      OREQ '31D3'                                                        CGL091
002387220121     C                     Z-ADDEAMT      INTAMT                                              CGL091
002388220121     C                     END                                                                CGL091
002389220121     C** IF 42 = 'M1'                                                                         CGL091
002390220121     C   42                Z-ADDEAMT      PRAMT                                               CGL091
002391220121     C   42                Z-ADDOTHA      INTAMT                                              CGL091
002392220121     C* ROLLOVER DEAL                                                                         CGL091
002393220121     C   42      ROLLY     IFEQ 'Y'                                                           CGL091
002394220121     C                     Z-ADDREPAMT    INTAMT                                              CGL091
002395220121     C                     Z-ADD*ZEROS    PRAMT                                               CGL091
002396220121     C                     END                                                                CGL091
002397220121     C** IF ROLLOVER AMOUNT IS ZEROS - REPORT OTHERS AS ZEROS                                 CGL091
002398220121     C   42      REPAMT    IFEQ *ZEROS                                                        CGL091
002399220121     C                     Z-ADD*ZEROS    PRAMT                                               CGL091
002400220121     C                     Z-ADD*ZEROS    INTAMT                                              CGL091
002401220121     C                     END                                                                CGL091
002402220121     C** IF ETYP IS "N1" - DO NOT REPORT THE AMOUNT                                           CGL091
002403220121     C           TEST2     IFEQ 'N1'                                                          CGL091
002404220121     C                     Z-ADD*ZEROS    PRAMT                                               CGL091
002405220121     C                     Z-ADD*ZEROS    INTAMT                                              CGL091
002406220121     C                     Z-ADD*ZEROS    EAMT                                                CGL091
002407220121     C                     END                                                                CGL091
002408220121      *                                                                                       CGL091
002409220121      * FRA/IRS notional principal events and FF option events should                         CGL091
002410220121      * not be reckoned in Total column but should only show amount                           CGL091
002411220121     C           ETYP      IFEQ '21S1'                                                        CGL091
002412220121     C           ETYP      OREQ '21S2'                                                        CGL091
002413220121     C           ETYP      OREQ '21S3'                                                        CGL091
002414220121     C           ETYP      OREQ '21C1'                                                        CGL091
002415220121     C           ETYP      OREQ '21C2'                                                        CGL091
002416220121     C           ETYP      OREQ '22S1'                                                        CGL091
002417220121     C           ETYP      OREQ '22S2'                                                        CGL091
002418220121     C           ETYP      OREQ '22C1'                                                        CGL091
002419220121     C           ETYP      OREQ '22C2'                                                        CGL091
002420220121     C           ETYP      OREQ '23S1'                                                        CGL091
002421220121     C           ETYP      OREQ '23S2'                                                        CGL091
002422220121     C           ETYP      OREQ '23C1'                                                        CGL091
002423220121     C           ETYP      OREQ '23C2'                                                        CGL091
002424220121     C           ETYP      OREQ '24S1'                                                        CGL091
002425220121     C           ETYP      OREQ '24S2'                                                        CGL091
002426220121     C           ETYP      OREQ '24C1'                                                        CGL091
002427220121     C           ETYP      OREQ '24C2'                                                        CGL091
002428220121     C           ETYP      OREQ '96V1'                                                        CGL091
002429220121     C           ETYP      OREQ '96V2'                                                        CGL091
002430220121     C           ETYP      OREQ '97V1'                                                        CGL091
002431220121     C           ETYP      OREQ '97V2'                                                        CGL091
002432220121     C           ETYP      OREQ '98V1'                                                        CGL091
002433220121     C           ETYP      OREQ '98V2'                                                        CGL091
002434220121     C           ETYP      OREQ '99V1'                                                        CGL091
002435220121     C           ETYP      OREQ '99V2'                                                        CGL091
002436220121     C                     Z-ADD*ZEROS    EAMT                                                CGL091
002437220121     C                     END                                                                CGL091
002438220121      *                                                                                       CGL091
002439220121      * For Rate swap and cap/collar/floor deal events, set the other                         CGL091
002440220121      * date to the rate change date prior to this event date - this is                       CGL091
002441220121      * obtained by reading backwards through the IRS date schedule                           CGL091
002442220121      * file. If no schedule is found then the last date is calculated                        CGL091
002443220121      * based on the rate change frequencies of each side of the deal                         CGL091
002444220121     C           ETYP      IFEQ '22I1'                                                        CGL091
002445220121     C           ETYP      OREQ '22S1'                                                        CGL091
002446220121     C           ETYP      OREQ '22S2'                                                        CGL091
002447220121     C           ETYP      OREQ '22C1'                                                        CGL091
002448220121     C           ETYP      OREQ '22C2'                                                        CGL091
002449220121     C           ETYP      OREQ '23I1'                                                        CGL091
002450220121     C           ETYP      OREQ '23S1'                                                        CGL091
002451220121     C           ETYP      OREQ '23S2'                                                        CGL091
002452220121     C           ETYP      OREQ '23C1'                                                        CGL091
002453220121     C           ETYP      OREQ '23C2'                                                        CGL091
002454220121     C           ETYP      OREQ '24I1'                                                        CGL091
002455220121     C           ETYP      OREQ '24S1'                                                        CGL091
002456220121     C           ETYP      OREQ '24S2'                                                        CGL091
002457220121     C           ETYP      OREQ '24C1'                                                        CGL091
002458220121     C           ETYP      OREQ '24C2'                                                        CGL091
002459220121      *                                                                                       CGL091
002460220121     C           EVNTKY    KLIST                                                              CGL091
002461220121     C                     KFLD           DLNO                                                CGL091
002462220121     C                     KFLD           EDAT                                                CGL091
002463220121      *                                                                                       CGL091
002464220121     C           EVNTKY    SETLLDLDTSCD0                                                      CGL091
002465220121     C                     READPDLDTSCD0                 99                                   CGL091
002466220121      *                                                                                       CGL091
002467220121      * If end of file or different deal number, then retrieve deal                           CGL091
002468220121      * details to enable last rate change date to be calculated                              CGL091
002469220121      * based on the floating side rate fix frequency                                         CGL091
002470220121     C           *IN99     IFNE '1'                                                           CGL091
002471220121     C           @DLNO     ANDEQDLNO                                                          CGL091
002472220121     C                     Z-ADDPRDT      ZDAYNO                                              CGL091
002473220121     C                     EXSR ZDATE2                                                        CGL091
002474220121     C                     MOVE ZADATE    OTHDA   7                                           CGL091
002475220121     C                     MOVE '0'       *IN22                                               CGL091
002476220121     C                     ELSE                                                               CGL091
002477220121     C           DLNO      CHAINDLDLDGDE             99                                       CGL091
002478220121      *                                                                                       CGL091
002479220121      * Database error if deal not found                                                      CGL091
002480220121     C           *IN99     IFEQ '1'                                                           CGL091
002481220121     C                     MOVEL'DEALSDG' DBFILE           ************                       CGL091
002482220121     C                     MOVEL'99'      DBASE            * DBERR 99 *                       CGL091
002483220121     C                     MOVELDLNO      DBKEY            ************                       CGL091
002484220121     C                     EXSR *PSSR                                                         CGL091
002485220121     C                     GOTO END                                                           CGL091
002486220121     C                     END                                                                CGL091
002487220121      *                                                                                       CGL091
002488220121      * Check rate change frequency for both sides of deal and                                CGL091
002489220121      * calculate last rate change dates based on frequencies.                                CGL091
002490220121      * If no frequency specified then default to deal value date.                            CGL091
002491220121      * Output the later of the two dates calculated                                          CGL091
002492220121     C                     MOVE RUICFR    WUICFR  1                                           CGL091
002493220121     C                     MOVE RTICFR    WTICFR  1                                           CGL091
002494220121     C                     SELEC                                                              CGL091
002495220121     C           WUICFR    WHEQ *BLANK                                                        CGL091
002496220121     C                     Z-ADDRVDAT     UOTHD   50                                          CGL091
002497220121     C           WUICFR    WHEQ 'Z'                                                           CGL091
002498220121     C                     Z-ADDRVDAT     UOTHD                                               CGL091
002499220121     C           WUICFR    WHEQ 'Y'                                                           CGL091
002500220121     C           EDAT      SUB  365       UOTHD                                               CGL091
002501220121     C           WUICFR    WHEQ 'Q'                                                           CGL091
002502220121     C           EDAT      SUB  91        UOTHD                                               CGL091
002503220121     C           WUICFR    WHEQ 'M'                                                           CGL091
002504220121     C           EDAT      SUB  31        UOTHD                                               CGL091
002505220121     C           WUICFR    WHEQ 'X'                                                           CGL091
002506220121     C           EDAT      SUB  183       UOTHD                                               CGL091
002507220121     C                     ENDSL                                                              CGL091
002508220121      *                                                                                       CGL091
002509220121     C                     SELEC                                                              CGL091
002510220121     C           WTICFR    WHEQ *BLANK                                                        CGL091
002511220121     C                     Z-ADDRVDAT     TOTHD   50                                          CGL091
002512220121     C           WTICFR    WHEQ 'Z'                                                           CGL091
002513220121     C                     Z-ADDRVDAT     TOTHD                                               CGL091
002514220121     C           WTICFR    WHEQ 'Y'                                                           CGL091
002515220121     C           EDAT      SUB  365       TOTHD                                               CGL091
002516220121     C           WTICFR    WHEQ 'Q'                                                           CGL091
002517220121     C           EDAT      SUB  91        TOTHD                                               CGL091
002518220121     C           WTICFR    WHEQ 'M'                                                           CGL091
002519220121     C           EDAT      SUB  31        TOTHD                                               CGL091
002520220121     C           WTICFR    WHEQ 'X'                                                           CGL091
002521220121     C           EDAT      SUB  183       TOTHD                                               CGL091
002522220121     C                     ENDSL                                                              CGL091
002523220121      *                                                                                       CGL091
002524220121     C           UOTHD     IFGT TOTHD                                                         CGL091
002525220121     C                     Z-ADDUOTHD     ZDAYNO                                              CGL091
002526220121     C                     ELSE                                                               CGL091
002527220121     C                     Z-ADDTOTHD     ZDAYNO                                              CGL091
002528220121     C                     END                                                                CGL091
002529220121      *                                                                                       CGL091
002530220121     C                     EXSR ZDATE2                                                        CGL091
002531220121     C                     MOVE ZADATE    OTHDA   7                                           CGL091
002532220121     C                     MOVE '0'       *IN22                                               CGL091
002533220121     C                     END                                                                CGL091
002534220121      *                                                                                       CGL091
002535220121     C                     END                                                                CGL091
002536220121      *                                                                                       CGL091
002537220121      * For IRS interest events check if our/their interest processing                        CGL091
002538220121      * method is 'C' (capitalize). For these interest events, the                            CGL091
002539220121      * event amount should only show in the total column on maturity                         CGL091
002540220121      * date since this is the actual date of payment.                                        CGL091
002541220121     C           ETYP      IFEQ '22I1'                                                        CGL091
002542220121     C           ETYP      OREQ '23I1'                                                        CGL091
002543220121     C           ETYP      OREQ '24I1'                                                        CGL091
002544220121      *                                                                                       CGL091
002545220121     C           DLNO      CHAINDLDLDGDE             99                                       CGL091
002546220121      *                                                                                       CGL091
002547220121      * Database error if deal not found                                                      CGL091
002548220121     C           *IN99     IFEQ '1'                                                           CGL091
002549220121     C                     MOVEL'DEALSDG' DBFILE           ************                       CGL091
002550220121     C                     MOVEL'98'      DBASE            * DBERR 98 *                       CGL091
002551220121     C                     MOVELDLNO      DBKEY            ************                       CGL091
002552220121     C                     EXSR *PSSR                                                         CGL091
002553220121     C                     GOTO END                                                           CGL091
002554220121     C                     END                                                                CGL091
002555220121      *                                                                                       CGL091
002556220121      * If both sides are capitalizing and event date *NE maturity                            CGL091
002557220121      * date, then set event amount to zero - no further processing                           CGL091
002558220121      * required                                                                              CGL091
002559220121     C           RUINPM    IFEQ 'C'                                                           CGL091
002560220121     C           RTINPM    ANDEQ'C'                                                           CGL091
002561220121      *                                                                                       CGL091
002562220121     C           EDAT      IFNE RMDAT                                                         CGL091
002563220121     C                     Z-ADD0         EAMT                                                CGL091
002564220121     C                     END                                                                CGL091
002565220121      *                                                                                       CGL091
002566220121     C                     END                                                                CGL091
002567220121      *                                                                                       CGL091
002568220121      * If only one side is using method 'C', need to determine                               CGL091
002569220121      * whether the event is on the side that is capitalizing                                 CGL091
002570220121     C           RUINPM    IFEQ 'C'                                                           CGL091
002571220121     C           RTINPM    ANDNE'C'                                                           CGL091
002572220121     C           RTINPM    OREQ 'C'                                                           CGL091
002573220121     C           RUINPM    ANDNE'C'                                                           CGL091
002574220121      *                                                                                       CGL091
002575220121      * If amount is incoming, check Their side                                               CGL091
002576220121     C           INOI      IFEQ 'I'                                                           CGL091
002577220121     C           RTINPM    IFEQ 'C'                                                           CGL091
002578220121     C           EDAT      ANDNERMDAT                                                         CGL091
002579220121     C                     Z-ADD0         EAMT                                                CGL091
002580220121     C                     END                                                                CGL091
002581220121      *                                                                                       CGL091
002582220121      * else amount is outgoing, check Our side                                               CGL091
002583220121     C                     ELSE                                                               CGL091
002584220121     C           RUINPM    IFEQ 'C'                                                           CGL091
002585220121     C           EDAT      ANDNERMDAT                                                         CGL091
002586220121     C                     Z-ADD0         EAMT                                                CGL091
002587220121     C                     END                                                                CGL091
002588220121      *                                                                                       CGL091
002589220121     C                     END                                                                CGL091
002590220121     C                     END                                                                CGL091
002591220121     C                     END                                                                CGL091
002592220121      *                                                                                       CGL091
002593220121     C*                                                                                       CGL091
002594220121     C           *IN41     IFEQ *OFF                                                        AR407101
002595220121     C           *IN02     IFEQ *ON                                                         AR407101
002596220121     C           *IN03     OREQ *ON                                                         AR407101
002597220121     C           *IN13     OREQ *ON                                                         AR407101
002598220121     C           *IN26     OREQ *ON                                                         AR407101
002599220121     C           *IN27     OREQ *ON                                                         AR407101
002600220121     C           *IN28     OREQ *ON                                                         AR407101
002601220121     C           *IN37     OREQ *ON                                                         AR407101
002602220121     C           *IN82     OREQ *ON                                                         AR407101
002603220121      *                                                                                     AR407101
002604220121     C** IF OUTGOING AMOUNT REVERSE THE SIGN (-)                                              CGL091
002605220121     C           *IN61     IFEQ '1'                                                           CGL091
002606220121     C                     Z-SUBPRAMT     PRAMT                                               CGL091
002607220121     C                     Z-SUBINTAMT    INTAMT                                              CGL091
002608220121     C  N42                Z-SUBEAMT      EAMT                                                CGL091
002609220121     C   42                Z-SUBREPAMT    REPAMT                                              CGL091
002610220121     C                     END                                                                CGL091
002611220121     C** MAINTAIN SUBTOTAL FOR EACH COLUMN                                                    CGL091
002612220121     C           TPAMT     ADD  PRAMT     TPAMT                                               CGL091
002613220121     C           TINTAM    ADD  INTAMT    TINTAM                                              CGL091
002614220121     C   42      TTAMT     ADD  REPAMT    TTAMT                                               CGL091
002615220121     C  N42N82   TTAMT     ADD  EAMT      TTAMT                                               CGL091
002616220121     C           *IN37     IFEQ '1'                                                           CGL091
002617220121     C   60      TTAMT     ADD  INPYAM    TTAMT                                               CGL091
002618220121     C   61      TTAMT     SUB  OTPYAM    TTAMT                                               CGL091
002619220121     C                     END                                                                CGL091
002620220121     C           *IN82     IFEQ '1'                                                           CGL091
002621220121     C   60      TTAMT     ADD  EAMT      TTAMT                                               CGL091
002622220121     C   61      TTAMT     SUB  EAMT      TTAMT                                               CGL091
002623220121     C                     END                                                                CGL091
002624220121      *                                                                                     AR407101
002625220121     C                     ENDIF                                                            AR407101
002626220121     C                     ENDIF                                                            AR407101
002627220121      *                                                                                     AR407101
002628220121     C                     END                                                                CGL091
002629220121     C**                                                                                      CGL091
002630220121     C/COPY WNCPYSRC,GL0559C004
002631220121     C                     GOTO END
002632220121     C           TRAIL     TAG                             ** TRAIL TAG **
002633220121     C*
002634220121     C  N70                Z-ADD0         ZZTOTI
002635220121     C  N70                Z-ADD0         ZZTOTD
002636220121     C  N70                Z-ADD0         NORED
002637220121     C  N70                SETON                     70
002638220121     C*
002639220121     C*    PROCESS TRAILER  RECORD
002640220121     C*
002641220121     C           *IN04     IFEQ '1'
002642220121     C*********************Z-ADDHRWN      ZZTOTI                          E20669
002643220121     C*********************Z-ADDHRDC      ZZTOTD                          E20669
002644220121     C**********           Z-ADDNORE      NORED   50                      105140
002645220121     C                     Z-ADDNORE      NORED   90                      105140
002646220121     C                     END
002647220121     C*
002648220121     C           *IN14     IFEQ '1'
002649220121     C*********************Z-ADDHRWN      ZZAMTI                          E20669
002650220121     C*********************Z-ADDHRDC      ZZAMTD                          E20669
002651220121     C                     EXSR GLZSUM
002652220121     C********** NORE      ADD  NORED     NORED                           105140
002653220121     C           NORE0     ADD  NORED     NORED                           105140
002654220121     C           NORED     SUB  1         NORED
002655220121      *                                                                   CTI001
002656220121      ** IF processing TI events check for the LC  trailer file having    CTI001
002657220121      ** been read.                                                       CTI001
002658220121     C           M#TION    IFEQ 'Y'                                       CTI001
002659220121     C           ULTRL     ANDEQ'Y'                                       CTI001
002660220121     C                     Z-ADDHRWN      ZZAMTI                          CTI001
002661220121     C                     Z-ADDHRDC      ZZAMTD                          CTI001
002662220121     C                     EXSR GLZSUM                                    CTI001
002663220121     C           NORE      ADD  NORED     NORED                           CTI001
002664220121     C           NORED     SUB  1         NORED                           CTI001
002665220121     C                     END                                            CTI001
002666220121      *                                                                   CTI001
002667220121     C                     END
002668220121     C*
002669220121     C           *IN12     IFEQ '1'
002670220121     C*********************Z-ADDHRWN      ZZAMTI                          E20669
002671220121     C*********************Z-ADDHRDC      ZZAMTD                          E20669
002672220121     C                     EXSR GLZSUM
002673220121     C           NORE      ADD  NORED     NORED
002674220121     C           NORED     SUB  1         NORED
002675220121     C                     END
002676220121     C***SECURITIES*TRADING*TRAILER***                                    E20669
002677220121     C************IN18*****IFEQ '1'                                       E20669
002678220121     C*********************Z-ADDHRWN      ZZAMTI                          E20669
002679220121     C*********************Z-ADDHRDC      ZZAMTD                          E20669
002680220121     C*********************EXSR GLZSUM                                    E20669
002681220121     C***********NORE******ADD  NORED     NORED                           E20669
002682220121     C*********************END                                            E20669
002683220121     C*  'FT' TRAILER
002684220121     C           *IN38     IFEQ '1'
002685220121     C                     Z-ADDHRWN      ZZAMTI
002686220121     C                     Z-ADDHRDC      ZZAMTD
002687220121     C*********************Z-ADDHRWN      ZZAMTI                          E20669
002688220121     C*********************Z-ADDHRDC      ZZAMTD                          E20669
002689220121     C                     EXSR GLZSUM
002690220121     C           NORE      ADD  NORED     NORED
002691220121     C                     END
002692220121     C*  FINANCIAL FUTURE
002693220121     C           *IN83     IFEQ '1'
002694220121     C*********************Z-ADDHRWN      ZZAMTI                          E20669
002695220121     C*********************Z-ADDHRDC      ZZAMTD                          E20669
002696220121     C                     EXSR GLZSUM
002697220121     C           NORE      ADD  NORED     NORED
002698220121     C                     END
002699220121     C*
002700220121     C/EJECT
002701220121     C           END       TAG                             ** END TAG **
002702220121     C           *INL2     IFEQ '1'                                       E172
002703220121     C           *IN41     ANDEQ'1'                                       E172
002704220121     C                     MOVE '1'       *IN52                           E172
002705220121     C*********************CLOSEDL0552P1                             E172 E257
002706220121     C*********************CLOSEDL0550P1                        E172 E257 LN0746
002707220121     C*********************CLOSEDL0552P1                            LN0746E22608
002708220121     C                     CLOSEGL0559P1                                  E22608
002709220121     C                     END                                            E172
002710220121     C                     MOVE *BLANKS   PDLNO   6
002711220121     C**N27N28N29**********MOVE DLNO      PDLNO                           E20669
002712220121     C  N27N28             MOVE DLNO      PDLNO                           E20669
002713220121      *                                                                                       189129
002714220121      ** If TI is ON, check for detail records having been read, then                         189129
002715220121      ** seton *IN15 for output.                                                              189129
002716220121      *                                                                                       189129
002717220121     C           M#TION    IFEQ 'Y'                                                           189129
002718220121      *                                                                                       189129
002719220121     C           ULDET     IFEQ 'Y'                                                           189129
002720220121     C                     SETON                       15                                     189129
002721220121     C                     ELSE                                                               189129
002722220121     C                     SETOF                       15                                     189129
002723220121     C                     END                                                                189129
002724220121      *                                                                                       189129
002725220121      ** Reset the Leo Detail and Trailer records read flags                                  189129
002726220121      *                                                                                       189129
002727220121     C                     MOVE *BLANK    ULDET                                               189129
002728220121     C                     MOVE *BLANK    ULTRL                                               189129
002729220121     C                     END                                                                189129
002730220121     C*
002731220121     C*    T O T A L   T I M E   C A L C U L A T I O N S
002732220121     C*
002733220121     C**                                                                                      CGL091
002734220121      * Last record subtotal processing                                                       CGL091
002735220121      *                                                                                       CGL091
002736220121     CLR 55                EXCPTSUBTL                                                         CGL091
002737220121      *                                                                                       CGL091
002738220121      * After output of subtotal, output running total                                        CGL091
002739220121     CLR                   ADD  TPAMT     RPAMT  130                                          CGL091
002740220121     CLR                   ADD  TINTAM    RINTAM 130                                          CGL091
002741220121     CLR                   ADD  TTAMT     RTAMT  130                                          CGL091
002742220121     CLR 55                EXCPTRUNTL                                                         CGL091
002743220121      *                                                                                       CGL091
002744220121      **  Read Securities Trading 2 Audit files and print separate
002745220121      **   totals.
002746220121     CLR         *INU5     IFEQ '0'
002747220121     C*LR**********         Z-ADD0         HRWN                           E20669
002748220121     C*LR**********         Z-ADD0         HRDC                           E20669
002749220121     CLR                   Z-ADD0         HRWN                            E28339
002750220121     CLR                   Z-ADD0         HRDC                            E28339
002751220121     CLR                   Z-ADD0         NORE
002752220121      *
002753220121      ** Save previous accumulater values.
002754220121     CLR                   Z-ADDZZTOTI    #TOTI  150
002755220121     CLR                   Z-ADDZZTOTD    #TOTD   30
002756220121      *
002757220121      ** Read all Audit files.
002758220121     CLR         1         CHAINTREVEAF              19
002759220121     C*LR*******************Z-ADDHRWN      ZZTOTI                         E20669
002760220121     C*LR*******************Z-ADDHRDC      ZZTOTD                         E20669
002761220121     CLR                   Z-ADDHRWN      ZZTOTI                          E28339
002762220121     CLR                   Z-ADDHRDC      ZZTOTD                          E28339
002763220121     CLR                   Z-ADDNORE      #SEREC  50
002764220121      *
002765220121     CLR         1         CHAINCPEVEAF              19
002766220121     CLR         *IN19     IFEQ '0'
002767220121     C*LR*******************Z-ADDHRWN      ZZAMTI                         E20669
002768220121     C*LR*******************Z-ADDHRDC      ZZAMTD                         E20669
002769220121     CLR                   Z-ADDHRWN      ZZAMTI                          E28339
002770220121     CLR                   Z-ADDHRDC      ZZAMTD                          E28339
002771220121     CLR                   EXSR GLZSUM
002772220121     CLR                   ADD  NORE      #SEREC
002773220121     CLR                   END
002774220121      *
002775220121     CLR         1         CHAINDPEVEAF              19
002776220121     CLR         *IN19     IFEQ '0'
002777220121     C*LR*******************Z-ADDHRWN      ZZAMTI                         E20669
002778220121     C*LR*******************Z-ADDHRDC      ZZAMTD                         E20669
002779220121     CLR                   Z-ADDHRWN      ZZAMTI                          E28339
002780220121     CLR                   Z-ADDHRDC      ZZAMTD                          E28339
002781220121     CLR                   EXSR GLZSUM
002782220121     CLR                   ADD  NORE      #SEREC
002783220121     CLR                   END
002784220121      *
002785220121     CLR         1         CHAINBPEVEAF              19
002786220121     CLR         *IN19     IFEQ '0'
002787220121     C*LR*******************Z-ADDHRWN      ZZAMTI                         E20669
002788220121     C*LR*******************Z-ADDHRDC      ZZAMTD                         E20669
002789220121     CLR                   Z-ADDHRWN      ZZAMTI                          E28339
002790220121     CLR                   Z-ADDHRDC      ZZAMTD                          E28339
002791220121     CLR                   EXSR GLZSUM
002792220121     CLR                   ADD  NORE      #SEREC
002793220121     CLR                   END
002794220121      *
002795220121     CLR                   Z-ADDZZTOTI    #SETI  150
002796220121     CLR                   Z-ADDZZTOTD    #SETD   30
002797220121     CLR                   END
002798220121      /EJECT
002799220121     C*
002800220121     C***DO*NOT*UPDATE*D/DLSTAT*WITH*VALUE*'99'*IF*IT*WAS*NOT*SET*BEFORE.*036796
002801220121     C*LR*51******         MOVE '  '      DYSA                            036796
002802220121      *
002803220121      ** Restore previousely saved accumulator values
002804220121      *
002805220121     CLR         *INU5     IFEQ '0'
002806220121     CLR                   Z-ADD#TOTI     ZZTOTI
002807220121     CLR                   Z-ADD#TOTD     ZZTOTD
002808220121     CLR                   END
002809220121      *
002810220121     C*LR*******************Z-ADDZZTOTI    HRWN                           E20669
002811220121     C*LR*******************Z-ADDZZTOTD    HRDC                           E20669
002812220121     CLR                   Z-ADDNORED     NORE
002813220121     C*LR*********NORE***** COMP RECRED               U8U8                E339
002814220121     C*LRNU8******INT,3*****COMP HRWN                 U8U8                E339
002815220121     C*LRNU8******DEC,3*****COMP HRDC                 U8U8                E339
002816220121     C*LR*********RECRIT****ADD  2         RECRIT                         E193
002817220121     CLR         INT,1     COMP 0                        80
002818220121      *                                                                   CLE004
002819220121      ** Write end of report for GL0559P2                                 CLE004
002820220121      *                                                                   CLE004
002821220121     CLR         CLE004    IFEQ 'Y'                                       CLE004
002822220121     CLR         WOPEN     ANDEQ'Y'                                       CLE004
002823220121     CLR                   WRITETRAILP2                                   CLE004
002824220121     CLR                   ENDIF                                          CLE004
002825220121     C*
002826220121      ** TRANSFER BINARY DATA INTO NUMERIC FIELD                          S01117
002827220121     CLR                   Z-ADDSFNUMU    ZSNUMU  60                      S01117
002828220121     C** ENSURE TOTALS SPOOL FILE RECORDED BY RCF
002829220121     CLR                   CALL 'ZSFILE'
002830220121     CLR                   PARM           SEQ
002831220121     CLR                   PARM *BLANKS   @PARM   3
002832220121     CLR                   PARM           SFILEU
002833220121     CLR                   PARM           ZSNUMU
002834220121     CLR                   PARM *BLANK    ZSERR                           S01117
002835220121     C*                                                                   S01117
002836220121     CLR         ZSERR     IFEQ 'Y'                                       S01117
002837220121     CLR                   SETON                     U7U8                 S01117
002838220121     CLR                   RETRN                                          S01117
002839220121     CLR                   END                                            S01117
002840220121     C*
002841220121      *****************************************************************   CEU011
002842220121      *                                                               *   CEU011
002843220121      *  SR/SREURO - Call program to convert amount to Euro           *   CEU011
002844220121      *              Equivalent.                                      *   CEU011
002845220121      *                                                               *   CEU011
002846220121      *****************************************************************   CEU011
002847220121      *                                                                   CEU011
002848220121     C           SREURO    BEGSR                                          CEU011
002849220121      *                                                                   CEU011
002850220121     C                     CALL 'EU0200'               8383               CEU011
002851220121     C                     PARM           PRTCD   7                       CEU011
002852220121     C                     PARM           PFRAM  183                      CEU011
002853220121     C                     PARM           PFRCY   3                       CEU011
002854220121     C                     PARM           PTOCY   3                       CEU011
002855220121     C                     PARM           POUTA  150                      CEU011
002856220121     C                     PARM           PINTA  183                      CEU011
002857220121     C                     PARM           PEXRT  159                      CEU011
002858220121     C                     PARM           PMDIN   1                       CEU011
002859220121      *                                                                   CEU011
002860220121     C           PRTCD     IFNE *BLANKS                                   CEU011
002861220121     C                     MOVEL'*CALL   'DBFILE                          CEU011
002862220121     C                     MOVEL'EU0200  'DBKEY             ************  CEU011
002863220121     C                     MOVELWDBASE    DBASE             * DBERR NN *  CEU011
002864220121     C                     SETON                     U7U8LR ************  CEU011
002865220121     C                     EXSR *PSSR                                     CEU011
002866220121     C                     GOTO END                                       CEU011
002867220121     C                     ENDIF                                          CEU011
002868220121      *                                                                   CEU011
002869220121     C                     ENDSR                                          CEU011
002870220121      *                                                                   CEU011
002871220121     C********************************************************************
002872220121     C*
002873220121     C           HASH      BEGSR
002874220121     C                     Z-ADDINT,X     ZZTOTI
002875220121     C                     Z-ADDDEC,X     ZZTOTD
002876220121     C  N42      EAMT      DIV  1000      ZZAMT        36
002877220121     C   42      REPAMT    DIV  1000      ZZAMT        36
002878220121     C   36                Z-SUBZZAMT     ZZAMT
002879220121     C                     EXSR GLZADD
002880220121     C                     Z-ADDZZTOTI    INT,X
002881220121     C                     Z-ADDZZTOTD    DEC,X
002882220121      *
002883220121      ** Clear previous accumulater values.
002884220121     C                     Z-ADD0         ZZTOTI
002885220121     C                     Z-ADD0         ZZTOTD
002886220121      *
002887220121     C                     ENDSR
002888220121     C**
002889220121     C********************************************************************
002890220121     C* SUBROUTINE TO ADD AN AMOUNT (ZZAMT) TO THE TOTAL (ZZTOTI,ZZTOTD)
002891220121     C*   IND '99' IS SET BY AN OVERFLOW ERROR
002892220121     C*
002893220121     CSR         GLZADD    BEGSR                           *** GLZADD ****
002894220121     C*
002895220121     CSR                   Z-ADDZZAMT     ZZAMT  153     91-DEFINE ZZAMT
002896220121     CSR 91                GOTO ZZAEND                     AMT = 0.BYPASS
002897220121     C*
002898220121     C* SPLIT ZZAMT INTO INTEGER AND DECIMAL FIELDS
002899220121     CSR                   Z-ADDZZAMT     ZZAMTI 150       INTEGER FIELD
002900220121     CSR                   MOVE ZZAMT     ZZAMTD  30       DECIMAL FIELD
002901220121     C* BOTH ZZAMTI AND ZZAMTD CONTAIN A 'SIGN' ZONE NOW
002902220121     C*
002903220121     CSR                   EXSR GLZSUM
002904220121     CSR         ZZAEND    ENDSR                           ** ZZAEND TAG *
002905220121     C*
002906220121     C********************************************************************
002907220121     C* SUBROUTINE TO CARRY OUT THE ADDITION FOR SUBROUTINES -
002908220121     C*                        GLZADD, GLZSUB, GLZCMP.
002909220121     C*          PARAMETERS PASSED -
002910220121     C*                     I/P ZZAMTI ZZAMTD
002911220121     C*                     O/P ZZTOTI ZZTOTD ZZNEGD IND 96 IND 99.
002912220121     C*
002913220121     CSR         GLZSUM    BEGSR                           *** GLZSUM ****
002914220121     C*
002915220121     CSR                   Z-ADDZZTOTI    ZZTOTI 150       DEFINE ZZTOTI
002916220121     CSR                   Z-ADDZZTOTD    ZZTOTD  30       DEFINE ZZTOTD
002917220121     CSR                   SETOF                     919293
002918220121     CSR                   SETOF                     949599
002919220121     C*
002920220121     C*    DETERMINE SIGN OF ZZAMTI & D,   92 IF NEG
002921220121     CSR         ZZAMTI    COMP 0                      9293
002922220121     CSR 93      ZZAMTD    COMP 0                      9293
002923220121     CSR 93                GOTO ZZSEND                     ZERO BYPASS
002924220121     C*
002925220121     C*    DETERMINE SIGN OF ZZTOTI & D, 91 IF NEG.
002926220121     CSR         ZZTOTI    COMP 0                      9193
002927220121     CSR 93      ZZTOTD    COMP 0                      9193
002928220121     C*
002929220121     C*    IF ZZTOTAL IS ZERO, RETURN ZZAMOUNT.
002930220121     CSR 93                Z-ADDZZAMTI    ZZTOTI
002931220121     CSR 93                Z-ADDZZAMTD    ZZTOTD
002932220121     CSR 93                GOTO ZZSEND                     ZERO BYPASS
002933220121     C*    IF SIGNS DIFFER BYPASS OVERFLOW CHECKS.
002934220121     CSR 91N92
002935220121     CORN91 92             GOTO ZZOFPS
002936220121     C*
002937220121     CSR         ZZAMTD    ADD  ZZTOTD    ZZWK2   40
002938220121     CSR         ZZWK2     COMP 999                  93    '93' = CARRY
002939220121     CSRN93      ZZWK2     COMP -999                   93    INTO INTEGER.
002940220121     C*
002941220121     CSR 93N92   ZZAMTI    ADD  1         ZZWK3  150       ADD 'CARRY' +VE
002942220121     CSR    93 92ZZAMTI    SUB  1         ZZWK3            SUB 'CARRY' -VE
002943220121     CSR 93      ZZTOTI    ADD  ZZWK3     ZZWK3
002944220121     CSRN93      ZZTOTI    ADD  ZZAMTI    ZZWK3
002945220121     C*
002946220121     C* IF THE MODULUS OF ZZWK3 IS LT MOD. ZZTOTI THEN O/F HAS OCCURED
002947220121     CSRN92      ZZWK3     COMP ZZTOTI                 99  -92 MEANS NOS.
002948220121     CSR 92      ZZWK3     COMP ZZTOTI               99     NEGATIVE
002949220121     CSRN99                Z-ADDZZWK2     ZZTOTD
002950220121     CSRN99                Z-ADDZZWK3     ZZTOTI
002951220121     C*
002952220121     C* IF O/F ZEROIZE ZZAMT , IND '99' SET AND ZZTOT FIELDS LEFT INTACT.
002953220121     CSR 99                Z-ADD0         ZZAMT  153
002954220121     CSR                   GOTO ZZSEND
002955220121     C*
002956220121     C* THE 'SIGNS' ARE DIFFERENT
002957220121     CSR         ZZOFPS    TAG                             ** ZZOFPS TAG**
002958220121     C* IF ZZAMT WAS NEGATIVE, MAKE IT POS. TO COMP WITH ZZTOT
002959220121     C*
002960220121     CSR 92                Z-SUBZZAMTI    ZZAMTI 150
002961220121     CSR 92                Z-SUBZZAMTD    ZZAMTD  30
002962220121     C*
002963220121     C* IF ZZTOT WAS NEGATIVE, MAKE IT POS. TO COMP WITH ZZAMT.
002964220121     C*
002965220121     CSR 91                Z-SUBZZTOTI    ZZTOTI
002966220121     CSR 91                Z-SUBZZTOTD    ZZTOTD
002967220121     C* BOTH ZZAMT AND ZZTOT ARE NOW POSITIVE.
002968220121     C*
002969220121     CSR         ZZTOTI    COMP ZZAMTI               93  95
002970220121     CSR 95      ZZTOTD    COMP ZZAMTD               93  95
002971220121     C*
002972220121     C* IF ZZTOT EQ. ZZAMT RETURN ZERO.
002973220121     CSR 95                Z-ADD0         ZZTOTI
002974220121     CSR 95                Z-ADD0         ZZTOTD
002975220121     CSR 95                GOTO ZZSEND
002976220121     C*
002977220121     C* IF ZZTOT GT. ZZAMT.
002978220121     CSR 93      ZZAMTD    COMP ZZTOTD               94
002979220121     CSR 93 94   ZZTOTI    SUB  1         ZZTOTI
002980220121     CSR 93 94   ZZTOTD    ADD  1000      ZZWK2
002981220121     CSR 93      ZZTOTI    SUB  ZZAMTI    ZZTOTI
002982220121     CSR 93 94   ZZWK2     SUB  ZZAMTD    ZZTOTD
002983220121     CSR 93N94   ZZTOTD    SUB  ZZAMTD    ZZTOTD
002984220121     C*
002985220121     C*
002986220121     C* IF ZZAMT GT. ZZTOT.
002987220121     CSRN93      ZZTOTD    COMP ZZAMTD               94
002988220121     CSRN93 94   ZZAMTI    SUB  1         ZZWK3  150
002989220121     CSRN93 94   ZZAMTD    ADD  1000      ZZWK2
002990220121     CSRN93 94   ZZWK3     SUB  ZZTOTI    ZZTOTI
002991220121     CSRN93N94   ZZAMTI    SUB  ZZTOTI    ZZTOTI
002992220121     CSRN93 94   ZZWK2     SUB  ZZTOTD    ZZTOTD
002993220121     CSRN93N94   ZZAMTD    SUB  ZZTOTD    ZZTOTD
002994220121     C*
002995220121     C* REVERSE SIGN OF ZZTOT IF LARGER I/P FIELDS WERE NEGATIVE
002996220121     CSR                   SETOF                     94
002997220121     CSR 93 91
002998220121     CORN93 92             SETON                     94
002999220121     CSR 94                Z-SUBZZTOTI    ZZTOTI
003000220121     CSR 94                Z-SUBZZTOTD    ZZTOTD
003001220121     C**
003002220121     C**   RESTORE SIGN OF ZZAMTI & ZZAMTD IF IT WAS REVERSED.
003003220121     CSR 92                Z-SUBZZAMTI    ZZAMTI
003004220121     CSR 92                Z-SUBZZAMTD    ZZAMTD
003005220121     CSR         ZZSEND    TAG                             ** ZZSEND TAG *
003006220121     C**
003007220121     C**   IF ZZTOTD IS ZERO, AND ZZTOTI IS NEG. SET UP ZZNEGD.
003008220121     CSR                   SETOF                     96
003009220121     CSR         ZZTOTD    COMP 0                        91
003010220121     CSR 91      ZZTOTI    COMP 0                      96
003011220121     CSR 96                MOVE '.000-'   ZZNEGD  5
003012220121     CSR                   ENDSR                             ** ENDSR **
003013220121     C********************************************************************
003014220121     C**
003015220121     C**   ZDATE2 SR. TO CONVERT A DAY NUMBER TO DATE FORMATS.
003016220121     C**
003017220121     C**   THE YEAR 2000, BEING DIVISIBLE BY 400, IS A LEAP YEAR.
003018220121     C**
003019220121     C           ZDATE2    BEGSR                           *** ZDATE2 ***
003020220121     C**
003021220121     C**   CLEAR DATE FIELDS.
003022220121     C                     Z-ADD0         ZDATE   60
003023220121     C                     MOVEL'       ' ZADATE  7
003024220121     C**
003025220121     C**   CALCULATION TO DEFINE INPUT DAY NUMBER.
003026220121     C                     Z-ADDZDAYNO    ZDAYNO  50
003027220121     C**
003028220121     C**   DETERMINE YEAR NUMBER.
003029220121     C**
003030220121     C**   ADJUST DAY NUMBER IN CASE LAST DAY OF YEAR.
003031220121     C           ZDAYNO    SUB  1         ZDAYN1  50   99
003032220121     C   99                GOTO ZDEND2
003033220121     C**
003034220121     C**   CALCULATE NUMBER OF 4 YEAR SPANS SINCE 31/12/1971.
003035220121     C           ZDAYN1    DIV  1461      ZLYR    20
003036220121     C                     MVR            ZDAYN1           SAVE REMAINING
003037220121     C**                                                   DAYS
003038220121     C**   CALCULATE NUMBER OF REMAINING YEARS.
003039220121     C                     Z-ADD1         ZWRK2   20
003040220121     C           ZDTAG1    TAG                             ** ZDTAG1 TAG *
003041220121     C           ZDAYN1    COMP ZYDY,ZWRK2             90
003042220121     C  N90      ZWRK2     ADD  1         ZWRK2
003043220121     C  N90                GOTO ZDTAG1
003044220121     C           ZWRK2     SUB  1         ZWRK2          91LEAP YR, 91 ON
003045220121     C**
003046220121     C**   DECREMENT DAY NO. BY DAYS IN REMAINING YEARS.
003047220121     C  N91      ZDAYN1    SUB  ZYDY,ZWRK2ZDAYN1
003048220121     C**
003049220121     C**   CALCULATE ACTUAL YEAR NUMBER.
003050220121     C           ZLYR      MULT 4         ZWRK3   30
003051220121     C           ZWRK3     ADD  72        ZWRK3            BASE IS 1972
003052220121     C                     Z-ADDZWRK3     ZYEAR   20
003053220121     C           ZYEAR     ADD  ZWRK2     ZYEAR            YEAR
003054220121     C**
003055220121     C**   DETERMINE MONTH NUMBER.
003056220121     C**
003057220121     C**   ADJUST DAY NO. IN CASE LAST DAY OF LEAP YEAR FEBRUARY.
003058220121     C                     SETOF                     9293
003059220121     C   91      ZDAYN1    COMP 59                     9293
003060220121     C   91N92   ZDAYN1    SUB  1         ZDAYN1
003061220121     C**
003062220121     C**   CALCULATE MONTH NUMBER.
003063220121     C                     Z-ADD2         ZWRK2
003064220121     C           ZDTAG2    TAG                             ** ZDTAG2 TAG *
003065220121     C           ZDAYN1    COMP ZMDY,ZWRK2             94
003066220121     C  N94      ZWRK2     ADD  1         ZWRK2
003067220121     C  N94                GOTO ZDTAG2
003068220121     C           ZWRK2     SUB  1         ZWRK2
003069220121     C**
003070220121     C                     Z-ADDZWRK2     ZMTH    20       MONTH
003071220121     C**
003072220121     C**   DETERMINE DAY OF MONTH.
003073220121     C**
003074220121     C**   ADD BACK LAST DAY OF YEAR ADJUSTMENT.
003075220121     C           ZDAYN1    ADD  1         ZDAYN1
003076220121     C**
003077220121     C**   CALCULATE DAY OF MONTH.
003078220121     C           ZDAYN1    SUB  ZMDY,ZWRK2ZDAY    20       DAY
003079220121     C**
003080220121     C**   ADD BACK LEAP YEAR 29TH FEBUARY ADJUSTMENT, IF REQUIRED.
003081220121     C   93      ZDAY      ADD  1         ZDAY
003082220121     C**
003083220121     C**   FORMAT DATE, DDMMYY OR MMDDYY.
003084220121     C  N98                MOVELZDAY      ZWRK4   40
003085220121     C   98                MOVE ZDAY      ZWRK4
003086220121     C  N98                MOVE ZMTH      ZWRK4
003087220121     C   98                MOVELZMTH      ZWRK4
003088220121     C                     MOVELZWRK4     ZDATE
003089220121     C                     MOVE ZYEAR     ZDATE
003090220121     C**
003091220121     C**   FORMAT ALPHA DATE, DDMMMYY.
003092220121     C           ZDAY      COMP 10                     95
003093220121     C                     MOVELZDAY      ZWRK5   5
003094220121     C   95                MOVEL' '       ZWRK5
003095220121     C                     MOVE ZMNM,ZMTH ZWRK5
003096220121     C                     MOVELZWRK5     ZADATE
003097220121     C                     MOVE ZYEAR     ZADATE
003098220121     C**
003099220121     C           ZDEND2    ENDSR                           * ZDEND2 ENDSR*
003100220121     C**
003101220121     C********************************************************************
003102220121      *COPY*ZSRSRC,ZFWDT                                                                      CGL091
003103220121      /COPY ZSRSRC,ZFWDTA                                                                     CGL091
003104220121     C********************************************************************
003105220121      /COPY ZSRSRC,ZACCH
003106220121      /EJECT                                                              CLE004
003107220121      /COPY ZSRSRC,ZSEDITZ3                                               CLE004
003108220121     C********************************************************************
003109220121     C*
003110220121     C           *PSSR     BEGSR
003111220121     C*
003112220121     C           @RUN      IFEQ *BLANK
003113220121     C                     MOVE 'Y'       @RUN    1
003114220121     C                     SETON                     U7U8LR
003115220121     C                     DUMP
003116220121     C                     END
003117220121     C*
003118220121     C                     ENDSR
003119220121     C*****************************************************************
003120220121     C/EJECT
003121220121     O*
003122220121     O*****NOSTRO*EVENTS*EXTRACT FILE                                     E193
003123220121     O*********************                                               E193
003124220121     O*NOSEXEC*D********01                                                E193
003125220121     O*********************               1 'A'                           E193
003126220121     O*NOSEXED*D********02 65                                             E193
003127220121     O*********************    LOT1     256                               E193
003128220121     O*********************    LOT2     320                               E193
003129220121     O*********************  42REPAMT    27P                              E193
003130220121     O*NOSEXCC*D********03 65                                             E193
003131220121     O*********************    LOT3     256                               E193
003132220121     O*NOSEXEL*D********13 65                                             E193
003133220121     O*********************    LOT4     256                               E193
003134220121     O*NOSEXESFDADD*****17 65                                             E193
003135220121     O*********************    *ALL                                       E193
003136220121     O*NOSEXSEFDADD*****26 65                                             E193
003137220121     O*******OR********27 65                                              E193
003138220121     O*******OR********28 65                                              E193
003139220121     O*********************    *ALL                                       E193
003140220121     O*NOSEXFPFDADD*****37 65                                             E193
003141220121     O*********************    *ALL                                       E193
003142220121     O*NOSEXZZ*T******* LR                                                E193
003143220121     O*********************               1 'T'                           E193
003144220121     O*********************    RECRIT     6                               E193
003145220121     O*********************    INT,2     14P                              E193
003146220121     O*********************    DEC,2     16P                              E193
003147220121     O*
003148220121     O**DL0552P1D**203***43*************                                  E257
003149220121     O**DL0550P1D**203***43*************                             E257 LN0746
003150220121     O*DL0552P1D  203   43                                          LN0746E22608
003151220121     OGL0559P1D  203   43                                                 E22608
003152220121     O       OR        46N41
003153220121     O***********************************24 'REFERENCE DL0552P1'          E22608
003154220121     O                                   24 'REFERENCE GL0559P1'          E22608
003155220121     O                         BJURPT    89
003156220121     O                                  104 'DATE'
003157220121     O                         BJMRDT   112
003158220121     O                                  122 'PAGE'
003159220121     O                         PAGE  Z  127
003160220121     O        D  1     43
003161220121     O       OR        46N41
003162220121     O***********         66NU4          51 'F.X. '                       AUS017              CGL091
003163220121     O***********         67NU4          51 'M.M. '                       AUS017              CGL091
003164220121     O***********           NU4          75 'DAILY EVENTS BY CURRENCY'                        CGL091
003165220121     O                    66NU4          40 'F.X. '                                           CGL091
003166220121     O                    67NU4          40 'M.M. '                                           CGL091
003167220121     O                      NU4          64 'EVENTS BY CURRENCY WITH '                        CGL091
003168220121     O                      NU4          83 'RUNNING TOTALS - TO'                             CGL091
003169220121     O                   N56NU4          96 'END OF BOOKS'                                    CGL091
003170220121     O                    56NU4#DAYS     87                                                   CGL091
003171220121     O                    56NU4         100 'DAYS FORWARD'                                    CGL091
003172220121     O/COPY WNCPYSRC,GL0559O001
003173220121     O                       U4          71 'SECURITIES TRADING EVENT'
003174220121     O                       U4          84 'S BY CURRENCY'
003175220121     O        D  1     43
003176220121     O       OR        46N41
003177220121     O***********         66NU4          51 '-----'                       AUS017              CGL091
003178220121     O***********         67NU4          51 '-----'                       AUS017              CGL091
003179220121     O***********           NU4          75 '------------------------'                        CGL091
003180220121     O                    66NU4          40 '-----'                                           CGL091
003181220121     O                    67NU4          40 '-----'                                           CGL091
003182220121     O                      NU4          64 '------------------------'                        CGL091
003183220121     O                      NU4          83 '-------------------'                             CGL091
003184220121     O                   N56NU4          96 '--------------'                                  CGL091
003185220121     O                    56NU4          87 '----'                                            CGL091
003186220121     O                    56NU4         100 '-------------'                                   CGL091
003187220121     O                       U4          71 '------------------------'
003188220121     O                       U4          84 '-------------'
003189220121     O        D  2     43
003190220121     O       OR        46N41
003191220121     O                                   12 'COMPANY'
003192220121     O*************************CMPYM     16                               E172
003193220121     O                         ECPY      16                               E172
003194220121     O                         APCMNM    48
003195220121     O        D  1     43
003196220121     O       OR        46N41
003197220121     O                         A6CYNM    19
003198220121     O********D* 1     43                                                                     CGL091
003199220121     O*******OR*       46N41                                                                  CGL091
003200220121     O/COPY WNCPYSRC,GL0559O002
003201220121     O***********                        56 ' LOAN/DEAL  FED EVENT'       AUS017
003202220121     O***********************************46 ' LOAN/DEAL'           AUS017 CDL038
003203220121     O**********                         44 ' LOAN/DEAL'                  CDL038              CGL091
003204220121     O**********         N67             50 ' FED'                        AUS017              CGL091
003205220121     O**********                         56 ' EVENT'                      AUS017              CGL091
003206220121     O**********                         97 'INCOMING'                                        CGL091
003207220121     O**********                        130 'OUTGOING'                                        CGL091
003208220121     O********D* 2     43                                                                     CGL091
003209220121     O*******OR*       46N41                                                                  CGL091
003210220121     O**********                         12 'CUSTOMER'                                        CGL091
003211220121     O***********                        56 'NUMBER  TYPE FDS  DATE'      AUS017
003212220121     O***********************************46 ' NUMBER  TYPE'        AUS017 CDL038
003213220121     O**********                         44 ' NUMBER  TYPE'               CDL038              CGL091
003214220121     O**********         N67             50 ' FDS'                        AUS017              CGL091
003215220121     O**********                         56 '  DATE'                      AUS017              CGL091
003216220121     O**********                         81 'EVENT         VAL/MAT'                           CGL091
003217220121     O**********                        107 'AMOUNT       RATE'                               CGL091
003218220121     O**********                        129 'AMOUNT'                                          CGL091
003219220121      *                                                                   CEU011
003220220121     O********D  1     43                                                 CEU011              CGL091
003221220121     O*******AND       29 39                                              CEU011              CGL091
003222220121     O*******OR*       46N41                                              CEU011              CGL091
003223220121     O*******AND       29 39                                              CEU011              CGL091
003224220121     O**********                         99 'EURO EQUIVALENT'             CEU011              CGL091
003225220121     O**********                        131 'EURO EQUIVALENT'             CEU011              CGL091
003226220121     O********D* 1     02N41                                                                  CGL091
003227220121     O*                                                                   S01408
003228220121     O/COPY WNCPYSRC,GL0559OOP1                                           S01408
003229220121     O*                                                                   S01408
003230220121     O*******OR* 1     03N41                                                                  CGL091
003231220121     O*******OR* 1     13N41                                                                  CGL091
003232220121     O*******OR**1*****17N41                                              E20669
003233220121     O*******OR* 1     26N41                                                                  CGL091
003234220121     O*******OR* 1     27N41                                                                  CGL091
003235220121     O*******OR* 1     28N41                                                                  CGL091
003236220121     O*******OR  1     15 79N41                                     CTI001CLE005
003237220121     O*******OR* 1     15 80N41                                           CLE005              CGL091
003238220121     O*******OR**1*****29N41                                              E20669
0032392201210737 O****************N29      CRNM      20                               E20669
0032402201210738 O****************N29      CTWN      31                               E20669
0032412201210737 O**********               CRNM      20                               E20669              CGL091
0032422201210738 O**********               CTWN      31                               E20669              CGL091
003243220121     O**********      N13N15   PDLNO     38                               CDL038              CGL091
003244220121     O**********      N13 15   LCNO      38                               CDL038              CGL091
003245220121     O**********       13                32 'LE'                          CDL038              CGL091
003246220121     O**********       13N48   LNRF      38                               CDL038              CGL091
003247220121     O**********       13 48   FTYP      35                               CDL038              CGL091
003248220121     O**********       13 48             36 '/'                           CDL038              CGL091
003249220121     O**********       13 48   FSEQ      38                               CDL038              CGL091
003250220121     O**********      N27N28   DTYP      41                               CDL038              CGL091
003251220121     O**********      N27N28             42 '-'                           CDL038              CGL091
003252220121     O**********      N27N28   DLST      44                               CDL038              CGL091
003253220121     O**********       02      CLAS      48                               CDL038              CGL091
003254220121     O**********       13      CLAS      48                               CLE042              CGL091
003255220121     O*****************29      CCBD      30                               E20669
003256220121     O*
003257220121     O***********     N13      PDLNO     40                               CTI001
003258220121     O****************N13N15   PDLNO     40                        CTI001 CDL038
003259220121     O****************N13 15   LCNO      40                        CTI001 CDL038
003260220121     O*****************13                34 'LE'                          CDL038
003261220121     O*****************13N48   LNRF      40                               CDL038
003262220121     O*****************13 48   FTYP      37                               CDL038
003263220121     O*****************13 48             38 '/'                           CDL038
003264220121     O*****************13 48   FSEQ      40                               CDL038
003265220121     O****************N27N28N29DTYP      43                               E20669
003266220121     O****************N27N28   DTYP      43                        E20669 CDL038
003267220121     O****************N27N28N29          44 '-'                           E20669
003268220121     O****************N27N28             44 '-'                    E20669 CDL038
003269220121     O****************N27N28N29DLST      46                               E20669
003270220121     O****************N27N28   DLST      46                        E20669 CDL038
0032712201210743 O****************N13N17   FFIN      49                               E20669
0032722201210743 O**********      N13      FFIN      49                               E20669              CGL091
003273220121     O**********               EDATA     57                                                   CGL091
003274220121     O*************************TABB      73                               S01496
003275220121     O****************N62      TABB      73                        S01496 CSE007
003276220121     O**********      N62N54   TABB      73                                            CSE007 CLE028
003277220121     O**********      N62N54N64TABB      73                                            CLE028 CGL091
003278220121     O**********       64      TABB2     73                                            CLE028 CGL091
003279220121     O**********       62 63   EVNARR    73                               S01496              CGL091
003280220121     O**********       54 53   CANARR    73                               CSE007              CGL091
003281220121      *                                                                   S01408
003282220121     O/COPY WNCPYSRC,GL0559OOP3                                           S01408
003283220121      *                                                                   S01408
003284220121     O**********            N22OTHDA     81                                                   CGL091
003285220121     O**********      N42 60 30EAMT      99 ' ,   ,   ,   , 0 -'                              CGL091
003286220121     O**********      N42 60 31EAMT      99 '   ,   ,   , 0 . -'                              CGL091
003287220121     O**********      N42 60 32EAMT      99 '  ,   ,   , 0 .  -'                              CGL091
003288220121     O**********      N42 60 33EAMT      99 ' ,   ,   , 0 .   -'                              CGL091
003289220121     O*
003290220121     O**********       42 60 30REPAMT    99 ' ,   ,   ,   , 0 -'                              CGL091
003291220121     O**********       42 60 31REPAMT    99 '   ,   ,   , 0 . -'                              CGL091
003292220121     O**********       42 60 32REPAMT    99 '  ,   ,   , 0 .  -'                              CGL091
003293220121     O**********       42 60 33REPAMT    99 ' ,   ,   , 0 .   -'                              CGL091
003294220121     O***********      02N23N35EXRT     113 '   0 .        '              090909
003295220121     O***********      02 35   DBCR     113 '   0 .        '              090909
003296220121     O*****************15 79   DBCR     113 '   0 .        '        CTI001CLE005
003297220121     O**********       15 80   DBCR     113 '   0 .        '              CLE005              CGL091
003298220121     O**********       02N23   EXRT     113 '   0 .        '              090909              CGL091
003299220121     O**********       03N23   EINRX    113 '  0 .        '                                   CGL091
003300220121     O**********       13N23   EINRX    113 '  0 .        '                                   CGL091
003301220121     O**********       02 11N23         114 '-'                                               CGL091
003302220121     O*
003303220121     O*     OUTPUT SECURITY SHORTNAME INSTEAD OF RATE
003304220121     O*
003305220121     O**********       17 25   SECS     113                               E20669
003306220121     O**********       25      SECS     113                               E20669              CGL091
003307220121     O**********       26      SECS     113                                                   CGL091
003308220121     O**********       27      SECS     113                                                   CGL091
003309220121     O**********       28      SECS     113                                                   CGL091
003310220121     O*****************29      SECS     113                               E20669
003311220121     O**********      N42 61 30EAMT     132 ' ,   ,   ,   , 0 -'                              CGL091
003312220121     O**********      N42 61 31EAMT     132 '   ,   ,   , 0 . -'                              CGL091
003313220121     O**********      N42 61 32EAMT     132 '  ,   ,   , 0 .  -'                              CGL091
003314220121     O**********      N42 61 33EAMT     132 ' ,   ,   , 0 .   -'                              CGL091
003315220121     O*
003316220121     O**********       42 61 30REPAMT   132 ' ,   ,   ,   , 0 -'                              CGL091
003317220121     O**********       42 61 31REPAMT   132 '   ,   ,   , 0 . -'                              CGL091
003318220121     O**********       42 61 32REPAMT   132 '  ,   ,   , 0 .  -'                              CGL091
003319220121     O**********       42 61 33REPAMT   132 ' ,   ,   , 0 .   -'                              CGL091
003320220121      *                                                                   CEU011
003321220121     O********D* 1     02N41                                              CEU011              CGL091
003322220121     O*******AND       29 39                                              CEU011              CGL091
003323220121     O*******OR* 1     03N41                                              CEU011              CGL091
003324220121     O*******AND       29 39                                              CEU011              CGL091
003325220121     O*******OR* 1     13N41                                              CEU011              CGL091
003326220121     O*******AND       29 39                                              CEU011              CGL091
003327220121     O*******OR* 1     26N41                                              CEU011              CGL091
003328220121     O*******AND       29 39                                              CEU011              CGL091
003329220121     O*******OR* 1     27N41                                              CEU011              CGL091
003330220121     O*******AND       29 39                                              CEU011              CGL091
003331220121     O*******OR* 1     28N41                                              CEU011              CGL091
003332220121     O*******AND       29 39                                              CEU011              CGL091
003333220121     O*******OR* 1     15 80N41                                           CEU011              CGL091
003334220121     O*******AND       29 39                                              CEU011              CGL091
003335220121     O**********      N42 60 30WEAMT     97 ' ,   ,   ,   , 0 -'    CEU011146393
003336220121     O**********      N42 60 31WEAMT     97 '   ,   ,   , 0 . -'    CEU011146393
003337220121     O**********      N42 60 32WEAMT     97 '  ,   ,   , 0 .  -'    CEU011146393
003338220121     O**********      N42 60 33WEAMT     97 ' ,   ,   , 0 .   -'    CEU011146393
003339220121     O**********      N42 60   WEAMT     97 '  ,   ,   , 0 .  -'          146393              CGL091
003340220121      *                                                                   CEU011
003341220121     O**********       42 60 30WPAMT     97 ' ,   ,   ,   , 0 -'    CEU011146393
003342220121     O**********       42 60 31WPAMT     97 '   ,   ,   , 0 . -'    CEU011146393
003343220121     O**********       42 60 32WPAMT     97 '  ,   ,   , 0 .  -'    CEU011146393
003344220121     O**********       42 60 33WPAMT     97 ' ,   ,   , 0 .   -'    CEU011146393
003345220121     O**********       42 60   WPAMT     97 '  ,   ,   , 0 .  -'          146393              CGL091
003346220121      *                                                                   CEU011
003347220121     O**********      N42 61 30WEAMT    130 ' ,   ,   ,   , 0 -'    CEU011146393
003348220121     O**********      N42 61 31WEAMT    130 '   ,   ,   , 0 . -'    CEU011146393
003349220121     O**********      N42 61 32WEAMT    130 '  ,   ,   , 0 .  -'    CEU011146393
003350220121     O**********      N42 61 33WEAMT    130 ' ,   ,   , 0 .   -'    CEU011146393
003351220121     O**********      N42 61   WEAMT    130 '  ,   ,   , 0 .  -'          146393              CGL091
003352220121      *                                                                   CEU011
003353220121     O**********       42 61 30WPAMT    130 ' ,   ,   ,   , 0 -'    CEU011146393
003354220121     O**********       42 61 31WPAMT    130 '   ,   ,   , 0 . -'    CEU011146393
003355220121     O**********       42 61 32WPAMT    130 '  ,   ,   , 0 .  -'    CEU011146393
003356220121     O**********       42 61 33WPAMT    130 ' ,   ,   , 0 .   -'    CEU011146393
003357220121     O**********       42 61   WPAMT    130 '  ,   ,   , 0 .  -'          146393              CGL091
003358220121      *                                                                   CEU011
003359220121     O********D**1****N41 15 79                                     CTI001CLE005
003360220121     O********D* 1    N41 15 80                                           CLE005              CGL091
003361220121     O**********                         25 'TRADE INNOVATION REFEREN'    CTI001              CGL091
003362220121     O**********                         48 'CE'                          CTI001              CGL091
003363220121     O**********               TIRF      69                               CTI001              CGL091
003364220121     O**********                         95 'TRADE INNOVATION COMPANY'    CTI001              CGL091
003365220121     O**********                        102 ' CODE: '                     CTI001              CGL091
003366220121     O**********               TICM     106                               CTI001              CGL091
003367220121     O********D* 1     37N41                                                                  CGL091
003368220121     O**********               PREF      40                                                   CGL091
003369220121     O**********               PYTP      43                                                   CGL091
003370220121     O**********                         44 '-'                                               CGL091
003371220121     O**********               PYST      46                                                   CGL091
003372220121     O**********                         49 'N'                                               CGL091
003373220121     O**********               EDATA     57                                                   CGL091
003374220121     O**********               TABB      73                                                   CLE028
003375220121     O**********      N64      TABB      73                                            CLE028 CGL091
003376220121     O**********       64      TABB2     73                                            CLE028 CGL091
003377220121     O**********               OTHDA     81                                                   CGL091
003378220121     O**********          30 60INPYAM    99 ' ,   ,   ,   , 0 '                               CGL091
003379220121     O**********          31 60INPYAM    99 '   ,   ,   , 0 . '                               CGL091
003380220121     O**********          32 60INPYAM    99 '  ,   ,   , 0 .  '                               CGL091
003381220121     O**********          33 60INPYAM    99 ' ,   ,   , 0 .   '                               CGL091
003382220121     O**********               RATE     113 '   0 .        '                                  CGL091
003383220121     O**********          30 61OTPYAM   132 ' ,   ,   ,   , 0 '                               CGL091
003384220121     O**********          31 61OTPYAM   132 '   ,   ,   , 0 . '                               CGL091
003385220121     O**********          32 61OTPYAM   132 '  ,   ,   , 0 .  '                               CGL091
003386220121     O**********          33 61OTPYAM   132 ' ,   ,   , 0 .   '                               CGL091
003387220121      *                                                                   CEU011
003388220121     O********D* 1     37N41                                              CEU011              CGL091
003389220121     O*******AND       29 39                                              CEU011              CGL091
003390220121     O**********          30 60WINPY     97 ' ,   ,   ,   , 0 '     CEU011146393
003391220121     O**********          31 60WINPY     97 '   ,   ,   , 0 . '     CEU011146393
003392220121     O**********          32 60WINPY     97 '  ,   ,   , 0 .  '     CEU011146393
003393220121     O**********          33 60WINPY     97 ' ,   ,   , 0 .   '     CEU011146393
003394220121     O**********             60WINPY     97 '  ,   ,   , 0 .  '           146393              CGL091
003395220121      *                                                                   CEU011
003396220121     O**********          30 61WOTPY    130 ' ,   ,   ,   , 0 '     CEU011146393
003397220121     O**********          31 61WOTPY    130 '   ,   ,   , 0 . '     CEU011146393
003398220121     O**********          32 61WOTPY    130 '  ,   ,   , 0 .  '     CEU011146393
003399220121     O**********          33 61WOTPY    130 ' ,   ,   , 0 .   '     CEU011146393
003400220121     O**********             61WOTPY    130 '  ,   ,   , 0 .  '           146393              CGL091
003401220121      *                                                                   CEU011
003402220121      *                                                                                       CAP204
003403220121      ** GENERATED ENTRIES DETAIL                                                             CAP204
003404220121      *                                                                                       CAP204
003405220121     O        D  1     71N41                                                                  CAP204
003406220121     O                         TREF      40                                                   CAP204
003407220121     O                         RTYP      43                                                   CAP204
003408220121     O                                   49 'N'                                               CAP204
003409220121     O                         EDATA     57                                                   CAP204
003410220121     O                         TABB      73                                                   CAP204
003411220121     O                         OTHDA     81                                                   CAP204
003412220121     O                    30 60INAMT     99 ' ,   ,   ,   , 0 '                               CAP204
003413220121     O                    31 60INAMT     99 '   ,   ,   , 0 . '                               CAP204
003414220121     O                    32 60INAMT     99 '  ,   ,   , 0 .  '                               CAP204
003415220121     O                    33 60INAMT     99 ' ,   ,   , 0 .   '                               CAP204
003416220121     O                    30 61OTAMT    132 ' ,   ,   ,   , 0 '                               CAP204
003417220121     O                    31 61OTAMT    132 '   ,   ,   , 0 . '                               CAP204
003418220121     O                    32 61OTAMT    132 '  ,   ,   , 0 .  '                               CAP204
003419220121     O                    33 61OTAMT    132 ' ,   ,   , 0 .   '                               CAP204
003420220121      *                                                                                       CAP204
003421220121     O        D  1     71N41                                                                  CAP204
003422220121     O       AND       29 39                                                                  CAP204
003423220121     O                       60WINAMT    97 '  ,   ,   , 0 .  '                               CAP204
003424220121     O                       61WOTAMT   130 '  ,   ,   , 0 .  '                               CAP204
003425220121     O********D* 1     82N41                                              073714              CGL091
003426220121     O**********               CRNM      20                               073714              CGL091
003427220121     O**********               CTWN      31                               073714              CGL091
003428220121     O**********                         34 'FF'                          073714              CGL091
003429220121     O**********               TNBR      40                               073714              CGL091
003430220121     O**********               EDATA     57                               073714              CGL091
003431220121     O**********               TABB      73                                            073714 CLE028
003432220121     O**********      N64      TABB      73                                            CLE028 CGL091
003433220121     O**********       64      TABB2     73                                            CLE028 CGL091
003434220121     O**********          30 60EAMT      99 ' ,   ,   ,   , 0 '           073714              CGL091
003435220121     O**********          31 60EAMT      99 '   ,   ,   , 0 . '           073714              CGL091
003436220121     O**********          32 60EAMT      99 '  ,   ,   , 0 .  '           073714              CGL091
003437220121     O**********          33 60EAMT      99 ' ,   ,   , 0 .   '           073714              CGL091
003438220121     O**********          30 61EAMT     132 ' ,   ,   ,   , 0 '           073714              CGL091
003439220121     O**********          31 61EAMT     132 '   ,   ,   , 0 . '           073714              CGL091
003440220121     O**********          32 61EAMT     132 '  ,   ,   , 0 .  '           073714              CGL091
003441220121     O**********          33 61EAMT     132 ' ,   ,   , 0 .   '           073714              CGL091
003442220121      *                                                                   CEU011
003443220121     O********D  1     82N41                                              CEU011              CGL091
003444220121     O*******AND       29 39                                              CEU011              CGL091
003445220121     O**********          30 60WEAMT     97 ' ,   ,   ,   , 0 '     CEU011146393
003446220121     O**********          31 60WEAMT     97 '   ,   ,   , 0 . '     CEU011146393
003447220121     O**********          32 60WEAMT     97 '  ,   ,   , 0 .  '     CEU011146393
003448220121     O**********          33 60WEAMT     97 ' ,   ,   , 0 .   '     CEU011146393
003449220121     O**********          30 61WEAMT    130 ' ,   ,   ,   , 0 '     CEU011146393
003450220121     O**********          31 61WEAMT    130 '   ,   ,   , 0 . '     CEU011146393
003451220121     O**********          32 61WEAMT    130 '  ,   ,   , 0 .  '     CEU011146393
003452220121     O**********          33 61WEAMT    130 ' ,   ,   , 0 .   '     CEU011146393
003453220121     O**********             60WEAMT     97 '  ,   ,   , 0 .  '           146393              CGL091
003454220121     O**********             61WEAMT    130 '  ,   ,   , 0 .  '           146393              CGL091
003455220121      *                                                                   CEU011
003456220121     O********D* 1     27N41                                                                  CGL091
003457220121     O*******OR* 1     28N41                                                                  CGL091
003458220121     O*******OR**1*****29N41                                              E20669
003459220121     O**********             75          73 '* OVERDUE *    '                                 CGL091
003460220121     O**********             76          73 '* APPROXIMATE *'                                 CGL091
003461220121     O********D* 1     02N41                                                                  CGL091
003462220121     O*                                                                   S01408
003463220121     O/COPY WNCPYSRC,GL0559OOP2                                           S01408
003464220121     O*                                                                   S01408
003465220121     O*******OR* 1     03N41                                                                  CGL091
003466220121     O*******OR* 1     13N41                                                                  CGL091
003467220121     O*******OR**1*****17N41                                              E20669
003468220121     O*******OR* 1     26N41                                                                  CGL091
003469220121     O*******OR* 1     27N41                                                                  CGL091
003470220121     O*******OR* 1     28N41                                                                  CGL091
003471220121     O*******OR**1*****29N41                                              E20669
003472220121     O**********             03          34 'D/D'                                             CGL091
003473220121     O**********             03DDNO      41                                                   CGL091
003474220121     O********T**203***L2 55 58                                           E172
003475220121     O*************************          24 'REFERENCE DL0552P1'          E172
003476220121     O*************************BJAGNA    89                               E172
003477220121     O************************          104 'DATE'                        E172
003478220121     O************************ BJHZNB   112                               E172
003479220121     O************************          122 'PAGE'                        E172
003480220121     O************************ PAGE  Z  127                               E172
003481220121     O********T  1     L2 55 58                                           E172
003482220121     O********************* NU4          75 'DAILY EVENTS BY CURRENCY'    E172
003483220121     O********************** U4          71 'SECURITIES TRADING EVENT'    E172
003484220121     O***********************U4          84 'S BY CURRENCY'               E172
003485220121     O********T**1*****L2 55 58                                           E172
003486220121     O**********************NU4          75 '------------------------'    E172
003487220121     O***********************U4          71 '------------------------'    E172
003488220121     O***********************U4          84 '-------------'               E172
003489220121     O********T**2*****L2 55 58                                           E172
003490220121     O*************************          12 'COMPANY'                     E172
003491220121     O*************************CMPYM     16                               E172
003492220121     O*************************APAPTX    48
003493220121     O** Begin of new report layout                                                           CGL091
003494220121     O        D  1     43                                                                     CGL091
003495220121     O       OR        46N41                                                                  CGL091
003496220121     O                                    8 ' EVENT'                                          CGL091
003497220121     O                                   45 ' LOAN/DEAL'                                      CGL091
003498220121     O                                   61 'PRINCIPAL'                                       CGL091
003499220121     O                                   92 'INTEREST'                                        CGL091
003500220121     O                                  122 'TOTAL'                                           CGL091
003501220121     O        D  2     43                                                                     CGL091
003502220121     O       OR        46N41                                                                  CGL091
003503220121     O                                    7 '  DATE'                                          CGL091
003504220121     O                                   22 'CUSTOMER'                                        CGL091
003505220121     O                                   45 ' NUMBER  TYPE'                                   CGL091
003506220121     O                                   75 'AMOUNT          VAL/MAT'                         CGL091
003507220121     O                                  104 'AMOUNT          RATE'                            CGL091
003508220121     O                                  123 'AMOUNT'                                          CGL091
003509220121     O        D  1     02N41                                                                  CGL091
003510220121     O       OR  1     03N41                                                                  CGL091
003511220121     O       OR  1     13N41                                                                  CGL091
003512220121     O       OR  1     26N41                                                                  CGL091
003513220121     O       OR  1     27N41                                                                  CGL091
003514220121     O       OR  1     28N41                                                                  CGL091
003515220121     O                         EDATA      8                                                   CGL091
003516220121     O                         CRNM      30                                                   CGL091
003517220121     O*                                                                                       CGL091
003518220121     O                N13                39 '      '                                          CGL091
003519220121     O                N13      PDLNO     39                                                   CGL091
003520220121     O                 25                39 '      '                                          CGL091
003521220121     O                 26                39 '      '                                          CGL091
003522220121     O                 27                39 '      '                                          CGL091
003523220121     O                 28                39 '      '                                          CGL091
003524220121     O                 13                33 'LE'                                              CGL091
003525220121     O                 13N48   LNRF      39                                                   CGL091
003526220121     O                 13 48   FTYP      36                                                   CGL091
003527220121     O                 13 48             37 '/'                                               CGL091
003528220121     O                 13 48   FSEQ      39                                                   CGL091
003529220121     O                N27N28   DTYP      42                                                   CGL091
003530220121     O                N27N28             43 '-'                                               CGL091
003531220121     O                N27N28   DLST      45                                                   CGL091
003532220121     O                N13      FFIN      47                                                   CGL091
003533220121     O                      N22OTHDA     75                                                   CGL091
003534220121     O*                                                                                       CGL091
003535220121     O** PRINCIPAL AMOUNT                                                                     CGL091
003536220121     O                       30PRAMT     67 ' ,   ,   ,   , 0 -'                              CGL091
003537220121     O                       31PRAMT     67 '   ,   ,   , 0 . -'                              CGL091
003538220121     O                       32PRAMT     67 '  ,   ,   , 0 .  -'                              CGL091
003539220121     O                       33PRAMT     67 ' ,   ,   , 0 .   -'                              CGL091
003540220121     O*                                                                                       CGL091
003541220121     O** INTEREST AMOUNT                                                                      CGL091
003542220121     O                       30INTAMT    96 ' ,   ,   ,   , 0 -'                              CGL091
003543220121     O                       31INTAMT    96 '   ,   ,   , 0 . -'                              CGL091
003544220121     O                       32INTAMT    96 '  ,   ,   , 0 .  -'                              CGL091
003545220121     O                       33INTAMT    96 ' ,   ,   , 0 .   -'                              CGL091
003546220121     O** TOTAL AMOUNT                                                                         CGL091
003547220121     O                 42    30REPAMT   132 ' ,   ,   ,   , 0 -'                              CGL091
003548220121     O                 42    31REPAMT   132 '   ,   ,   , 0 . -'                              CGL091
003549220121     O                 42    32REPAMT   132 '  ,   ,   , 0 .  -'                              CGL091
003550220121     O                 42    33REPAMT   132 ' ,   ,   , 0 .   -'                              CGL091
003551220121     O**                                                                                      CGL091
003552220121     O                N42    30EAMT     132 ' ,   ,   ,   , 0 -'                              CGL091
003553220121     O                N42    31EAMT     132 '   ,   ,   , 0 . -'                              CGL091
003554220121     O                N42    32EAMT     132 '  ,   ,   , 0 .  -'                              CGL091
003555220121     O                N42    33EAMT     132 ' ,   ,   , 0 .   -'                              CGL091
003556220121     O                 02N23   EXRT     111 '   0 .        '                                  CGL091
003557220121     O                 03N23   EINRX    111 '  0 .        '                                   CGL091
003558220121     O                 13N23   EINRX    111 '  0 .        '                                   CGL091
003559220121     O                 02 11N23         112 '-'                                               CGL091
003560220121     O*                                                                                       CGL091
003561220121     O*     OUTPUT SECURITY SHORTNAME INSTEAD OF RATE                                         CGL091
003562220121     O*                25      SECS     111                                                   CGL091
003563220121     O                 25      SECS     111                                                   CGL091
003564220121     O                 26      SECS     111                                                   CGL091
003565220121     O                 27      SECS     111                                                   CGL091
003566220121     O                 28      SECS     111                                                   CGL091
003567220121     O*                                                                                       CGL091
003568220121     O        D  1     37N41                                                                  CGL091
003569220121     O                         EDATA      8                                                   CGL091
003570220121     O                         PREF      39                                                   CGL091
003571220121     O                         PYTP      42                                                   CGL091
003572220121     O                                   43 '-'                                               CGL091
003573220121     O                         PYST      45                                                   CGL091
003574220121     O                                   47 'N'                                               CGL091
003575220121     O                         OTHDA     75                                                   CGL091
003576220121     O** TOTAL AMOUNT                                                                         CGL091
003577220121     O                    30 60INPYAM   131 ' ,   ,   ,   , 0 '                               CGL091
003578220121     O                    31 60INPYAM   131 '   ,   ,   , 0 . '                               CGL091
003579220121     O                    32 60INPYAM   131 '  ,   ,   , 0 .  '                               CGL091
003580220121     O                    33 60INPYAM   131 ' ,   ,   , 0 .   '                               CGL091
003581220121     O                       60         132 ' '                                               CGL091
003582220121     O                         RATE     111 '   0 .        '                                  CGL091
003583220121     O                    30 61OTPYAM   131 ' ,   ,   ,   , 0 '                               CGL091
003584220121     O                    31 61OTPYAM   131 '   ,   ,   , 0 . '                               CGL091
003585220121     O                    32 61OTPYAM   131 '  ,   ,   , 0 .  '                               CGL091
003586220121     O                    33 61OTPYAM   131 ' ,   ,   , 0 .   '                               CGL091
003587220121     O                       61         132 '-'                                               CGL091
003588220121     O        D  1     82N41                                                                  CGL091
003589220121     O                         EDATA      8                                                   CGL091
003590220121     O                         CRNM      30                                                   CGL091
003591220121     O                                   33 'FF'                                              CGL091
003592220121     O                         TNBR      39                                                   CGL091
003593220121     O                    30 60EAMT     131 ' ,   ,   ,   , 0 '                               CGL091
003594220121     O                    31 60EAMT     131 '   ,   ,   , 0 . '                               CGL091
003595220121     O                    32 60EAMT     131 '  ,   ,   , 0 .  '                               CGL091
003596220121     O                    33 60EAMT     131 ' ,   ,   , 0 .   '                               CGL091
003597220121     O                       60         132 ' '                                               CGL091
003598220121     O                    30 61EAMT     131 ' ,   ,   ,   , 0 '                               CGL091
003599220121     O                    31 61EAMT     131 '   ,   ,   , 0 . '                               CGL091
003600220121     O                    32 61EAMT     131 '  ,   ,   , 0 .  '                               CGL091
003601220121     O                    33 61EAMT     131 ' ,   ,   , 0 .   '                               CGL091
003602220121     O                       61         132 '-'                                               CGL091
003603220121     O        D  1     27N41                                                                  CGL091
003604220121     O       OR  1     28N41                                                                  CGL091
003605220121     O                       75          73 '* OVERDUE *    '                                 CGL091
003606220121     O                       76          73 '* APPROXIMATE *'                                 CGL091
003607220121     O        D  1     03N41                                                                  CGL091
003608220121     O                       03          34 'D/D'                                             CGL091
003609220121     O                       03DDNO      41                                                   CGL091
003610220121     O* SUBTOTAL LINE FOR CHANGE OF EVENT DATE                                                CGL091
003611220121     O        E 12             SUBTL                                                          CGL091
003612220121     O                                   45 'DAILY TOTAL'                                     CGL091
003613220121     O** TOTAL PRINCIPAL AMOUNT                                                               CGL091
003614220121     O                       30TPAMT     67 ' ,   ,   ,   , 0 -'                              CGL091
003615220121     O                       31TPAMT     67 '   ,   ,   , 0 . -'                              CGL091
003616220121     O                       32TPAMT     67 '  ,   ,   , 0 .  -'                              CGL091
003617220121     O                       33TPAMT     67 ' ,   ,   , 0 .   -'                              CGL091
003618220121     O*                                                                                       CGL091
003619220121     O** TOTAL INTEREST AMOUNT                                                                CGL091
003620220121     O                       30TINTAM    96 ' ,   ,   ,   , 0 -'                              CGL091
003621220121     O                       31TINTAM    96 '   ,   ,   , 0 . -'                              CGL091
003622220121     O                       32TINTAM    96 '  ,   ,   , 0 .  -'                              CGL091
003623220121     O                       33TINTAM    96 ' ,   ,   , 0 .   -'                              CGL091
003624220121     O** TOTAL AMOUNT                                                                         CGL091
003625220121     O                       30TTAMT    132 ' ,   ,   ,   , 0 -'                              CGL091
003626220121     O                       31TTAMT    132 '   ,   ,   , 0 . -'                              CGL091
003627220121     O                       32TTAMT    132 '  ,   ,   , 0 .  -'                              CGL091
003628220121     O                       33TTAMT    132 ' ,   ,   , 0 .   -'                              CGL091
003629220121     O**                                                                                      CGL091
003630220121     O** End of new layout                                                                    CGL091
003631220121      *                                                                                       CGL091
003632220121      * Format for output of running totals of Principal, Interest                            CGL091
003633220121      * and total amounts                                                                     CGL091
003634220121     O        E  1             RUNTL                                                          CGL091
003635220121     O                                   56 '------------------------'                        CGL091
003636220121     O                                   80 '------------------------'                        CGL091
003637220121     O                                  104 '------------------------'                        CGL091
003638220121     O                                  128 '------------------------'                        CGL091
003639220121     O                                  132 '----'                                            CGL091
003640220121     O        E  1             RUNTL                                                          CGL091
003641220121     O**                                                                                      CGL091
003642220121     O                                   45 'RUNNING TOTAL'                                   CGL091
003643220121     O** RUNNING TOTAL TOTAL AMOUNT                                                           CGL091
003644220121     O                       30RTAMT    132 ' ,   ,   ,   , 0 -'                              CGL091
003645220121     O                       31RTAMT    132 '   ,   ,   , 0 . -'                              CGL091
003646220121     O                       32RTAMT    132 '  ,   ,   , 0 .  -'                              CGL091
003647220121     O                       33RTAMT    132 ' ,   ,   , 0 .   -'                              CGL091
003648220121      *                                                                                       CGL091
003649220121     O        E  2             RUNTL                                                          CGL091
003650220121     O                                   56 '------------------------'                        CGL091
003651220121     O                                   80 '------------------------'                        CGL091
003652220121     O                                  104 '------------------------'                        CGL091
003653220121     O                                  128 '------------------------'                        CGL091
003654220121     O                                  132 '----'                                            CGL091
003655220121     O        E 1              RUNTL                                                          CGL091
003656220121     O                 L2                66 '*** END OF REPORT FOR'                           CGL091
003657220121     O                 L2                78 ' COMPANY ***'                                    CGL091
003658220121     O/COPY WNCPYSRC,GL0559O003
003659220121     O        T 22     LR U7
003660220121     O       AND       58
003661220121     O***********************************22 'REFERENCE DL0552'            E22608
003662220121     O                                   22 'REFERENCE GL0559'            E22608
003663220121     O                                   62 'PRINT TERMINATED, '
003664220121     O                                   80 'DATABASE IN ERROR'
003665220121     O********T*3******L2 58                                              E172
003666220121     O        T 3      L2 58N52                                           E172
003667220121     O**********                         66 '*** END OF REPORT FOR'                           CGL091
003668220121     O**********                         78 ' COMPANY ***'                                    CGL091
003669220121     O*********                          66 '*** END OF COMPANY '
003670220121     O*********                          76 'REPORT ***'
003671220121     O********T*3******LR 58                                              E172
003672220121     O***********************************65 '***   END OF REPORT'         E172
003673220121     O***********************************71 '***'                         E172
003674220121     O**DL0552AUT**203***LR**************                                 E257
003675220121     O**DL0550AUT**203***LR**************                            E257 LN0746
003676220121     O*DL0552AUT**203***LR***************                           LN0746E22608
003677220121     OGL0559AUT  203   LR                                                 E22608
003678220121     O***********************************24 'REFERENCE DL0552AU'          E22608
003679220121     O                                   24 'REFERENCE GL0559AU'          E22608
003680220121     O                         BJURPT    89
003681220121     O                                  104 'DATE'
003682220121     O                         BJMRDT   112
003683220121     O                                  122 'PAGE'
003684220121     O                         PAGE1 Z  127
003685220121     O        T  1     LR
003686220121     O**********          66NU4          51 'F.X. '                       AUS017              CGL091
003687220121     O**********          67NU4          51 'M.M. '                       AUS017              CGL091
003688220121     O**********            NU4          75 'DAILY EVENTS BY CURRENCY'                        CGL091
003689220121     O**********            NU4          90 '- RUN CONTROLS'                                  CGL091
003690220121     O                    66NU4          40 'F.X. '                                           CGL091
003691220121     O                    67NU4          40 'M.M. '                                           CGL091
003692220121     O                      NU4          64 'EVENTS BY CURRENCY WITH '                        CGL091
003693220121     O                      NU4          83 'RUNNING TOTALS - TO'                             CGL091
003694220121     O                   N56NU4          97 'END OF BOOKS '                                   CGL091
003695220121     O                   N56NU4         111 '- RUN CONTROLS'                                  CGL091
003696220121     O                    56NU4#DAYS     87                                                   CGL091
003697220121     O                    56NU4         100 'DAYS FORWARD'                                    CGL091
003698220121     O                    56NU4         115 '- RUN CONTROLS'                                  CGL091
003699220121     O                       U4          64 'SECURITIES TRADING '
003700220121     O                       U4          82 'EVENTS BY CURRENCY'
003701220121     O                       U4          97 '- RUN CONTROLS'
003702220121     O        T  1     LR
003703220121     O**********          66NU4          51 '-----'                       AUS017              CGL091
003704220121     O**********          67NU4          51 '-----'                       AUS017              CGL091
003705220121     O**********            NU4          75 '------------------------'                        CGL091
003706220121     O**********            NU4          90 '----------------'                                CGL091
003707220121     O                    66NU4          40 '-----'                                           CGL091
003708220121     O                    67NU4          40 '-----'                                           CGL091
003709220121     O                      NU4          64 '------------------------'                        CGL091
003710220121     O                      NU4          83 '-------------------'                             CGL091
003711220121     O                   N56NU4          97 '--------------'                                  CGL091
003712220121     O                   N56NU4         111 '---------------'                                 CGL091
003713220121     O                    56NU4          87 '----'                                            CGL091
003714220121     O                    56NU4         100 '-------------'                                   CGL091
003715220121     O                    56NU4         115 '---------------'                                 CGL091
003716220121     O                       U4          64 '-------------------'
003717220121     O                       U4          82 '------------------'
003718220121     O                       U4          97 '--------------'
003719220121     O        T  236   LR   NU7
003720220121     O                                   18 'RUN CONTROLS'
003721220121     O        T  2     LR   NU7
003722220121     O                                   59 'NUMBER'
003723220121     O                                   84 'VALUE'
003724220121     O        T  2     LR   NU7
003725220121     O                                   30 'EVENTS FILE RECORDS RE'
003726220121     O                                   32 'AD'
003727220121     O                         RECRED3   59
003728220121     O                         INT,3 Z   81
003729220121     O                         DEC,3     84
003730220121     O        T  2     LR   NU7
003731220121     O                                   27 'EVENTS FILE CONTROL'
003732220121     O                                   34 'TOTALS'
003733220121     O                         NORE  3   59
0037342201210800 O*************************HRWN  Z   81                               E20669
0037352201210801 O*************************HRDC      84                               E20669
003736220121     O        T 22     LR
003737220121     O       AND         NU7NU5
003738220121     O       AND         N66N67                                           AUS017
003739220121     O                                   26 'SECURITY TRADING 2'
003740220121     O                                 +  1 'RECORDS READ'
003741220121     O                         #SEIN 3   59
003742220121     O                         INT,4 Z   81
003743220121     O                         DEC,4     84
003744220121     O        T  2     LR
003745220121     O       AND         NU7NU5
003746220121     O       AND         N66N67                                           AUS017
003747220121     O                                   26 'SECURITY TRADING 2'
003748220121     O                                 +  1 'AUDIT TOTALS'
003749220121     O                         #SEREC3   59
003750220121     O                         #SETI Z   81
003751220121     O                         #SETD     84
003752220121     O        T  2     LR   NU7
003753220121     O                                   29 'EVENTS RECORDS LISTED'
003754220121     O                                   44 'IN THIS REPORT'
003755220121     O                         RECREP3   59
003756220121     O                         INT,1 Z   81
003757220121     O                       80DEC,1 3   84
003758220121     O                      N80DEC,1     84
003759220121     O        T        LR   NU7
003760220121     O*********************              30 'NOSTRO EVENTS EXTRACT '      E193
003761220121     O*********************              45 'RECORDS CREATED'             E193
003762220121     O*********************    RECRIT3   59                               E193
003763220121     O*********************    INT,2 Z   81                               E193
003764220121     O*********************    DEC,2     84                               E193
003765220121     O********T   49   LRN34N99
003766220121     O********                           58 '***   NO DETAILS TO'
003767220121     O********                           71 'REPORT   ***'
003768220121     O        T 2      LRN34N99                                           E131
003769220121     O                                   62 '***   NO DETAILS TO'         E131
003770220121     O                                   75 'REPORT   ***'                E131
003771220121     O        T 3      LR U7
003772220121     O                                   71 '*** PRINT TERMINATED ***'
003773220121     O        T 1      LR U7
003774220121     O                                   57 'DATABASE ERROR'
003775220121     O                         DBASE     61
003776220121     O                                   67 'FILE'
003777220121     O                         DBFILE    78
003778220121     O        T 13     LR U7
003779220121     O                                   46 'KEY'
003780220121     O                         DBKEY     76
003781220121     O********T*2******LR****************                                 E172
003782220121     O***********************************65 '***   END OF REPORT'         E172
003783220121     O***********************************71 '***'                         E172
003784220121     O/COPY WNCPYSRC,GL0559O004
003785220121** CPY@   **      OBJECT COPYRIGHT
003786220121(c) Finastra International Limited 2021
003787220121**   ZYDY - YEARS IN DAYS CUMULATIVE, FOUR YEAR SPAN
0037882201210366073110961461
003789220121**   ZMDY - MONTHS IN DAYS CUMULATIVE THROUGH YEAR
003790220121000031059090120151181212243273304334365
003791220121**   ZMNM - MONTHS SHORT NAMES
003792220121JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC
003793220121**   TABA/TABB - EVENT NARATIVES
00379422012110V1VALUE DATE
00379522012110V2VALUE DATE
00379622012111V1VALUE DATE
00379722012111V2VALUE DATE
00379822012113V1VALUE DATE
00379922012113V2VALUE DATE
00380022012114V1VALUE DATE
00380122012114V2VALUE DATE
00380222012112V1OPTION MATURITY
00380322012112V2OPTION MATURITY
00380422012115V1START DATE
00380522012116V1START DATE
00380622012115I2INT. DUE DATE
00380722012116I2INT. DUE DATE
00380822012117I2INT. DUE DATE
00380922012115M1MATURITY DATE
00381022012116M1MATURITY DATE
00381122012117M1MATURITY DATE
00381222012117V1PURCHASE DATE
00381322012117V3PURCHASE DATE
00381422012118M1SALE DATE
00381522012115V3PRINCIPAL INC.
00381622012116V3PRINCIPAL INC.
00381722012115M4PRINCIPAL DEC.
00381822012116M4PRINCIPAL DEC.
00381922012141S1START
00382022012141I2INTEREST
00382122012141M3REPAYMENT
00382222012141M4REPAY INTEREST
00382322012141R1ROLLOVER
00382422012141R2ROLLOVER INT.
00382522012141R3NEW PRINCIPAL
00382622012141R4ROLLOVER REPAY.
00382722012141M1MATURITY
00382822012141M2MATURITY INT.
00382922012142S8START DISC.
00383022012142M1MATURITY
00383122012161V1START DATE
00383222012162V1START DATE
00383322012163V1START DATE
00383422012163V2START DATE
00383522012164V1START DATE
00383622012165V1START DATE
00383722012165V2START DATE
00383822012166V1START DATE
00383922012167V1START DATE
00384022012167V2START DATE
00384122012171F1LOAN FEE DUE
00384222012171F2FACLTY FEE DUE
00384322012161I2INT. DUE DATE
00384422012162I2INT. DUE DATE
00384522012164I2INT. DUE DATE
00384622012166I2INT. DUE DATE
00384722012170I2INT. DUE DATE
00384822012161M1MATURITY DATE
00384922012162M1MATURITY DATE
00385022012163M1MATURITY DATE
00385122012164M1MATURITY DATE
00385222012165M1MATURITY DATE
00385322012166M1MATURITY DATE
00385422012167M1MATURITY DATE
00385522012170M2MATURITY DATE
00385622012161V3PRIN. INCREASE
00385722012162V3PRIN. INCREASE                                                        S01243
00385822012164V3PRIN. INCREASE                                                        S01243
00385922012166V3PRIN. INCREASE                                                        S01243
00386022012161R1REPAY - PRINC                                                         077500
00386122012161R2REPAY - INT                                                           077500
00386222012162R1REPAY - PRINC                                                         077500
00386322012162R2REPAY - INT                                                           077500
00386422012164R1REPAY - PRINC                                                         077500
00386522012164R2REPAY - INT                                                           077500
00386622012166R1REPAY - PRINC                                                         077500
00386722012166R2REPAY - INT                                                           077500
00386822012161M2MATURITY INT
00386922012162M2MATURITY INT
00387022012164M2MATURITY INT
00387122012166M2MATURITY INT
00387222012163R3ROLLOVER PRINC                                                        S01392
00387322012163R4ROLLOVER                                                              S01392
00387422012163R5ROLLOVER DISC.                                                        S01392
00387522012181A2START PAYMENT
00387622012182A2START PAYMENT
00387722012182A1START RECEIPT
00387822012181D1DISHONOR DATE
00387922012181P1PAYMENT DATE
00388022012180M1MATURITY RECPT.
00388122012181M1MATURITY RECPT.
00388222012182M1MATURITY RECPT.
00388322012180M2MATURITY PAYMT.
00388422012181M2MATURITY PAYMT.
00388522012182M2MATURITY PAYMT.
00388622012181M3MATURITY EXC.
00388722012181M4MATURITY EXC.
00388822012184V1VALUE DATE
00388922012184V2VALUE DATE
00389022012184V3VALUE DATE
00389122012130P1VALUE DATE
00389222012130S1VALUE DATE
00389322012130C1COUPON PAYMENT
00389422012130C2COUPON PAYMENT
00389522012130A1PART. PAID CALL
00389622012130D1DIVIDEND RECPT.
00389722012130D2DIVIDEND RECPT.
00389822012130M1MATURITY
00389922012130M2MATURITY
00390022012121N1VALUE DATE
00390122012121N2VALUE DATE                                                            030749
00390222012121I1SETTLEMENT
00390322012122I1INTEREST
00390422012123I1INTEREST
00390522012124N1INTEREST
00390622012124N2INTEREST                                                              030749
00390722012124I1INTEREST
00390822012121C1VALUE DATE                                                            E23278
00390922012122C1VALUE DATE                                                            E23278
00391022012122S1VALUE DATE                                                            E23278
00391122012123C1RATE CHANGE                                                           E23278
00391222012124C1RATE CHANGE                                                           E23278
00391322012121C2MATURITY                                                              E23278
00391422012122C2MATURITY                                                              E23278
00391522012122S2MATURITY                                                              E23278
00391622012123C2MATURITY                                                              E23278
00391722012124C2MATURITY                                                              E23278
00391822012131P1TRADE-PURCHASE
00391922012131S1TRADE-SALE
00392022012131C1CUST-PART PAYT.
00392122012131C2CUST-COUPON
00392222012131C3CUST-DIVIDEND
00392322012131C4CUST-MORT.PAYT.
00392422012131C5CUST-MATURITY
00392522012131D1DEPOT-PART PAYT
00392622012131D2DEPOT-COUPON
00392722012131D3DEPOT-DIVIDEND
00392822012131D4DEPOT-MORT.PAYT
00392922012131D5DEPOT-MATURITY
00393022012131B1BOOK-PART PAYT.
00393122012131B2BOOK-COUPON
00393222012131B3BOOK-DIVIDEND
00393322012131B4BOOK-MORT.PAYT.
00393422012131B5BOOK-MATURITY
00393522012191P1PAYMENT DATE
00393622012191P2RECEIPT DATE
00393722012191P3CHQ REC DATE
00393822012191P4CREDIT DATE
00393922012191P5CHQ PAY DATE
00394022012191P6DEBIT DATE
00394122012191P7TRANSFER DATE
00394222012191P8REGULAR RECEIPT                                                       E23912
00394322012191P9REGULAR PAYMENT                                                       E23912
00394422012170V3PRIN.INCREASE                                                         S01270
00394522012131C6SAFE CUST FEE                                                         S01464
00394622012193V1PREMIUM                                                               073714
00394722012122FEUp-Front Fee                                                          CIR001
00394822012123FEUp-Front Fee                                                          CIR001
00394922012124FEPremium                                                               CIR001
00395022012122BOBuy-Out                                                               CIR001
00395122012123BOBuy-Out                                                               CIR001
00395222012161R7PRIN. TFR. FROM                                                       CLE004
00395322012162R7PRIN. TFR. FROM                                                       CLE004
00395422012163R7PRIN. TFR. FROM                                                       CLE004
00395522012164R7PRIN. TFR. FROM                                                       CLE004
00395622012165R7PRIN. TFR. FROM                                                       CLE004
00395722012166R7PRIN. TFR. FROM                                                       CLE004
00395822012167R7PRIN. TFR. FROM                                                       CLE004
00395922012170R7PRIN. TFR. FROM                                                       CLE004
00396022012161V5PRIN. TFR. TO                                                         CLE004
00396122012162V5PRIN. TFR. TO                                                         CLE004
00396222012163V5PRIN. TFR. TO                                                         CLE004
00396322012164V5PRIN. TFR. TO                                                         CLE004
00396422012165V5PRIN. TFR. TO                                                         CLE004
00396522012166V5PRIN. TFR. TO                                                         CLE004
00396622012167V5PRIN. TFR. TO                                                         CLE004
00396722012170V5PRIN. TFR. TO                                                         CLE004
00396822012162R9MULCCY ROL PAY                                                        CLE004
00396922012163R9MULCCY ROL PAY                                                        CLE004
00397022012164R9MULCCY ROL PAY                                                        CLE004
00397122012162V7MULCCY ROL DRAW                                                       CLE004
00397222012163V7MULCCY ROL DRAW                                                       CLE004
00397322012164V7MULCCY ROL DRAW                                                       CLE004
00397422012168R1REPAY - PRINC                                                         CLE005
00397522012168R2REPAY - INT                                                           CLE005
00397622012168R7PRIN. TFR.  FROM                                                      CLE005
00397722012168R9MULCCY ROL PAY                                                        CLE005
00397822012169R1REPAY - PRINC                                                         CLE005
00397922012169R2REPAY - INT                                                           CLE005
00398022012169R7PRIN. TFR. FROM                                                       CLE005
00398122012169R9MULCCY ROL PAY                                                        CLE005
00398222012172R1REPAY - PRINC                                                         CLE005
00398322012172R2REPAY - INT                                                           CLE005
00398422012172R7PRIN. TFR. FROM                                                       CLE005
00398522012172R9MILCCY ROL PAY                                                        CLE005
00398622012168V1START DATE                                                            CLE005
00398722012168V3PRIN. INCREASE                                                        CLE005
00398822012168V5PRIN. TFR. TO                                                         CLE005
00398922012168V7MULCCY ROL DRAW                                                       CLE005
00399022012169V1START DATE                                                            CLE005
00399122012169V3PRIN. INCREASE                                                        CLE005
00399222012169V5PRIN. TFR. TO                                                         CLE005
00399322012169V7MULCCY ROL DRAW                                                       CLE005
00399422012172V1START DATE                                                            CLE005
00399522012172V3PRIN. INCREASE                                                        CLE005
00399622012172V5PRIN. TFR. TO                                                         CLE005
00399722012172V7MULCCY ROL DRAW                                                       CLE005
00399822012168M1MATURITY DATE                                                         CLE005
00399922012168M2MATURITY INT                                                          CLE005
00400022012169M1MATURITY DATE                                                         CLE005
00400122012169M2MATURITY INT                                                          CLE005
00400222012171M2MATURITY DATE                                                         CLE005
00400322012172M1MATURITY DATE                                                         CLE005
00400422012172M2MATURITY INT                                                          CLE005
00400522012168I2INT. DUE DATE                                                         CLE005
00400622012169I2INT. DUE DATE                                                         CLE005
00400722012171I2INT. DUE DATE                                                         CLE005
00400822012172I2INT. DUE DATE                                                         CLE005
00400922012161R9MULCCY ROL PAY                                                        CLE005
00401022012166R9MULCCY ROL PAY                                                        CLE005
00401122012167R9MULCCY ROL PAY                                                        CLE005
00401222012161V7MULCCY ROL DRAW                                                       CLE005
00401322012165V7MULCCY ROL DRAW                                                       CLE005
00401422012166V7MULCCY ROL DRAW                                                       CLE005
00401522012167V7MULCCY ROL DRAW                                                       CLE005
00401622012171M1MATURITY DATE                                                         CLE005
00401722012171R7PRIN.TFR. FROM                                                        CLE005
00401822012171V5PRIN. TFR. TO                                                         CLE005
00401922012165R9MULCCY ROL PAY                                                        CLE005
00402022012110VXVALUE DATE                                                            CEU003
00402122012110VYVALUE DATE                                                            CEU003
00402222012111VXVALUE DATE                                                            CEU003
00402322012111VYVALUE DATE                                                            CEU003
00402422012113VXVALUE DATE                                                            CEU003
00402522012113VYVALUE DATE                                                            CEU003
00402622012114VXVALUE DATE                                                            CEU003
00402722012114VYVALUE DATE                                                            CEU003
00402822012112VXOPTION MATURITY                                                       CEU003
00402922012112VYOPTION MATURITY                                                       CEU003
00403022012115VXSTART DATE                                                            CEU003
00403122012116VXSTART DATE                                                            CEU003
00403222012115IYINT. DUE DATE                                                         CEU003
00403322012116IYINT. DUE DATE                                                         CEU003
00403422012117IYINT. DUE DATE                                                         CEU003
00403522012115MXMATURITY DATE                                                         CEU003
00403622012116MXMATURITY DATE                                                         CEU003
00403722012117MXMATURITY DATE                                                         CEU003
00403822012117VXPURCHASE DATE                                                         CEU003
00403922012117VZPURCHASE DATE                                                         CEU003
00404022012118MXSALE DATE                                                             CEU003
00404122012115VZPRINCIPAL INC.                                                        CEU003
00404222012116VZPRINCIPAL INC.                                                        CEU003
00404322012115MZPRINCIPAL DEC.                                                        CEU003
00404422012116MZPRINCIPAL DEC.                                                        CEU003
00404522012161VXSTART DATE                                                            CEU003
00404622012162VXSTART DATE                                                            CEU003
00404722012163VXSTART DATE                                                            CEU003
00404822012163VYSTART DATE                                                            CEU003
00404922012164VXSTART DATE                                                            CEU003
00405022012165VXSTART DATE                                                            CEU003
00405122012165VYSTART DATE                                                            CEU003
00405222012166VXSTART DATE                                                            CEU003
00405322012167VXSTART DATE                                                            CEU003
00405422012167VYSTART DATE                                                            CEU003
00405522012161IYINT. DUE DATE                                                         CEU003
00405622012162IYINT. DUE DATE                                                         CEU003
00405722012164IYINT. DUE DATE                                                         CEU003
00405822012166IYINT. DUE DATE                                                         CEU003
00405922012170IYINT. DUE DATE                                                         CEU003
00406022012161MXMATURITY DATE                                                         CEU003
00406122012162MXMATURITY DATE                                                         CEU003
00406222012163MXMATURITY DATE                                                         CEU003
00406322012164MXMATURITY DATE                                                         CEU003
00406422012165MXMATURITY DATE                                                         CEU003
00406522012166MXMATURITY DATE                                                         CEU003
00406622012167MXMATURITY DATE                                                         CEU003
00406722012170MYMATURITY DATE                                                         CEU003
00406822012161VZPRIN. INCREASE                                                        CEU003
00406922012162VZPRIN. INCREASE                                                        CEU003
00407022012164VZPRIN. INCREASE                                                        CEU003
00407122012166VZPRIN. INCREASE                                                        CEU003
00407222012161RXREPAY - PRINC                                                         CEU003
00407322012161RYREPAY - INT                                                           CEU003
00407422012162RXREPAY - PRINC                                                         CEU003
00407522012162RYREPAY - INT                                                           CEU003
00407622012164RXREPAY - PRINC                                                         CEU003
00407722012164RYREPAY - INT                                                           CEU003
00407822012166RXREPAY - PRINC                                                         CEU003
00407922012166RYREPAY - INT                                                           CEU003
00408022012161MYMATURITY INT                                                          CEU003
00408122012162MYMATURITY INT                                                          CEU003
00408222012164MYMATURITY INT                                                          CEU003
00408322012166MYMATURITY INT                                                          CEU003
00408422012163RZROLLOVER DISC.                                                        CEU003
00408522012121IXSETTLEMENT                                                            CEU003
00408622012122IXINTEREST                                                              CEU003
00408722012123IXINTEREST                                                              CEU003
00408822012124IXINTEREST                                                              CEU003
00408922012170R9MULCCY ROL PAY                                                        142393
00409022012170V7MULCCY ROL DRAW                                                       142393
00409122012171R9MULCCY ROL PAY                                                        142393
00409222012171V7MULCCY ROL DRAW                                                       142393
00409322012170R1REPAY - PRINC                                                         142388
00409422012170R2REPAY - INT                                                           142388
00409522012171R1REPAY - PRINC                                                         142388
00409622012171R2REPAY - INT                                                           142388
004097220121CPV1CLS PAYMENT                                                           CDL008
004098220121CRV1CLS RECEIVE                                                           CDL008
00409922012124BOBUY-OUT                                                               CIR006
00410022012123C3VALUE DATE                                                            CIR003
00410122012123S3VALUE DATE                                                            CIR003
00410222012123C4MATURITY DATE                                                         CIR003
00410322012123S4MATURITY DATE                                                         CIR003
00410422012115F1LOAN FEE DUE                                                                              CAS009
00410522012116F1DEPOSIT FEE DUE                                                                           CAS009
00410622012117F1PURCH FEE DUE                                                                             CAS009
004107220121DTV1DEBIT TRANSFER                                                                            CAP204
004108220121CTV1DEBIT TRANSFER                                                                            CAP204
00410922012163R1REPAY - PRINC                                                                           MD055652
00411022012165R1REPAY - PRINC                                                                           MD055652
00411122012167R1REPAY - PRINC                                                                           MD055652
004112220121**  Narratives for ER Events                                              S01496
004113220121RED. CALL IN                                                              S01496
004114220121RED. CALL OUT                                                             S01496
004115220121CUST-RED. CALL                                                            S01496
004116220121DEPOT-RED.CALL                                                            S01496
004117220121     X/COPY WNCPYSRC,GL0559X001
004118220121**  Narratives for CA Events                                              CSE007
004119220121COR. ACT. SALE                                                            CSE007
004120220121COR. ACT. PURCH                                                           CSE007
004121220121CUST-COR. ACT                                                             CSE007
004122220121DEPOT-COR. ACT                                                            CSE007
004123220121** TABA2/TABB2 - Event types/narratives for CLE028 (Rule of 78)                               CLE028
00412422012180V1VALUE DATE                                                                                CLE028
00412522012180R1REPAY PRIN                                                                                CLE028
00412622012180R2REPAY INT                                                                                 CLE028
00412722012180M1MATURITY PRIN                                                                             CLE028
00412822012180M2MATURITY INT                                                                              CLE028
004129220121     X/COPY WNCPYSRC,GL0559X002
