      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas PM Instrument Types List')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Management Module                          *
     A*                                                               *
     A*  PRTF/PM0230P1 - PRINT AN INSTRUMENT TYPES LIST               *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CLE025             Date 20Oct03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 085806             Date 08Mar95               *
      *                 S01486             Date 11Aug94               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CLE025 - Credit Lines                                        *
     A*  085806 - OUTPUT 'CASH INSTRUMENT' INDICATOR                  *
     A*  S01486 - Portfolio Management Upgrade to R10.                *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*           C R E A T I O N     P A R A M E T E R S             *
     A*
     A*****************************************************************
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR DOCUMENT HEADER
     A**---------------------------------------------------------------
     A*
     A***********                                    Begin /S01486/
     A**********R HEADLI
     A          R HEADLI                    TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A***********                                    End   /S01486/
     A                                      SKIPB(3)
     A                                     7'REFERENCE'
     A                                    17'PM0230P1'
     A            BJURPT        53        37
     A                                   101'DATE'
     A            BJMRDT         7       106
     A                                   119'PAGE'
     A                                   124PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(2)
     A                                    42'PORTFOLIO MANAGEMENT INSTRUMENT '
     A                                    74'TYPES - '
     A  41                                82'AUDIT'
     A                                      SPACEA(1)
     A  42                                82'LIST'
     A                                      SPACEA(1)
     A                                    42'--------------------------------'
     A                                    74'-----'
     A                                      SPACEA(2)
     A***********                                    Begin /085806/
     A***********                         49'DISPLAY GROUP'
     A***********                         66'VALUATION GROUP'
     A***********                         88'LOMBARD'
      **Start of change CLE025
     A**********                           4'INSTRUMENT'                                      CLE025
     A**********                          25'NARRATIVE'                                       CLE025
     A**********                          41'DISPLAY GROUP'                                   CLE025
     A**********                          57'VALUATION GROUP'                                 CLE025
     A**********                          75'PORTFOLIO LENDING'                               CLE025
     A**********                          97'CASH'                                            CLE025
     A                                     3'INST'
     A                                    14'NARRATIVE'
     A                                    31'DISP GRP'
     A                                    41'VAL GRP'
     A                                    51'PORT LE'
     A                                    60'CASH'
     A  25                                67'WT.'
     A  26                                72'FCLTY'
     A  27                                79'INCLUDE'
     A  28                                88'MARG'
     A  29                                94'INCL OFFSET'
      **End of change CLE025
     A***********                                    End   /085806/
     A                                   107'L A S T  A C T I V I T Y'
     A                                      SPACEA(1)
     A***********                                    Begin /085806/
     A***********                          2'INSTRUMENT TYPE CODE'
     A***********                         29'NARRATIVE'
     A***********                         51'CODE SEQ.'
     A***********                         69'CODE SEQ.'
     A***********                         85'DISPLAY GROUP'
      **Start of change CLE025
     A**********                           4'TYPE CODE'                                       CLE025
     A**********                          43'CODE SEQ.'                                       CLE025
     A**********                          60'CODE SEQ.'                                       CLE025
     A**********                          77'DISPLAY GROUP'                                   CLE025
     A**********                          94'INSTRUMENT'                                      CLE025
     A                                     3'TYPE'
     A                                    31'CODE SEQ'
     A                                    41'CODE SEQ'
     A                                    51'DSP GRP'
     A                                    60'INST'
     A  25                                66'CODE'
     A  26                                72'MAND'
     A  27                                79'OFFSETS'
     A  28                                88'FLAG'
     A  29                                94'PREDEAL CHK'
      **End of change CLE025
     A***********                                    End   /085806/
     A                                   107'ACTION    DATE    TIME'
     A                                      SPACEA(1)
     A***********                                    Begin /085806/
     A***********                          2'--------------------'
     A***********                         29'---------'
     A***********                         49'-------------'
     A***********                         66'---------------'
     A***********                         85'-------------'
      **Start of change CLE025
     A**********                           4'----------'                                      CLE025
     A**********                          25'---------'                                       CLE025
     A**********                          41'-------------'                                   CLE025
     A**********                          57'---------------'                                 CLE025
     A**********                          75'-----------------'                               CLE025
     A**********                          94'----------'                                      CLE025
     A                                     3'----'
     A                                    14'---------'
     A                                    31'--------'
     A                                    41'--------'
     A                                    51'-------'
     A                                    60'----'
     A  25                                66'----'
     A  26                                72'-----'
     A  27                                79'-------'
     A  28                                88'----'
     A  29                                94'-----------'
      **End of change CLE025
     A***********                                    End   /085806/
     A                                   107'------------------------'
     A                                      SPACEA(1)
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR INSTRUMENT TYPES LIST & AUDIT
     A**---------------------------------------------------------------
     A*
     A          R LIST
      **Start of change CLE025
     A**********  RRINNR         3         8                                                  CLE025
      **End of change CLE025
     A***********                                    Begin /085806/
     A*********** RRISTN        20        24
     A*********** RRDSPG         3        52
     A*********** RRITDS         2  0     56
     A*********** RRVALG         3        70
     A*********** RRVLIS         2  0     74
     A*********** RRLOMG         3        90
     A**Start of change CLE025
     A**********  RRISTN        20        20                                                  CLE025
     A**********  RRDSPG         3        44                                                  CLE025
     A**********  RRITDS         2  0     48                                                  CLE025
     A**********  RRVALG         3        61                                                  CLE025
     A**********  RRVLIS         2  0     65                                                  CLE025
     A**********  RRLOMG         3        82                                                  CLE025
     A**********  RRCSHI         1        98                                                  CLE025
     A            RRINNR         3         3
     A            RRISTN        20         9
     A            RRDSPG         3        32
     A            RRITDS         2  0     35
     A            RRVALG         3        42
     A            RRVLIS         2  0     45
     A            RRLOMG         3        53
     A            RRCSHI         1        61
     A  25        RRWEIG         2  0     67
     A  26        RRFCMF         1        74
     A  27        RRINOF         1        82
     A  28        RRMARG         1        89
     A  29        RRIOPC         1        99
      **End of change CLE025
     A***********                                    End   /085806/
     A            RRCHTP         6       107
     A            RRDLUP         2  0    115
     A            RRMLUP         3       117
     A            RRYLUP         2  0    120
     A            RRTLUP         6  0    123EDTWRD('  :  :  ')
     A                                      SPACEA(1)
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR END OF REPORT
     A**---------------------------------------------------------------
     A*
     A          R ENDLI
     A                                      SPACEB(3)
     A                                    56'** END OF REPORT **'
