      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_AU60                                                      *
/*EXI *  TEXT('Midas PM Charges On Portfolios Clsg Tody Audit')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Management Module                      *
     A*                                                               *
     A*  PRTF/PM0380AU - CHARGES ON PORTFOLIOS CLOSING TODAY AUDIT    *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01486             Date 03Oct94               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     A*  S01486 - Portfolio Management Upgrade to R10                 *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR DOCUMENT HEADER
     A**---------------------------------------------------------------
     A*
     A          R HEADAU
     A*                                              Begin /S01486/
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*                                              End   /S01486/
     A                                      SKIPB(3)
     A                                     7'REFERENCE'
     A                                    17'PM0380AU'
     A            BJURPT        53        37
     A                                   101'DATE'
     A            BJMRDT         7       106
     A                                   119'PAGE'
     A                                   124PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(2)
     A                                    29'PORTFOLIO MANAGEMENT OUTSTANDING'
     A                                    61' CHARGES ON PORTFOLIOS CLOSING'
     A                                    91' TODAY'
     A                                      SPACEA(1)
     A                                    29'--------------------------------'
     A                                    61'------------------------------'
     A                                    91'------'
     A                                      SPACEA(2)
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR CONTROL
     A**---------------------------------------------------------------
     A*
     A          R CONTROL
     A                                    40'NUMBER OF PORTFOLIOS PROCESSED :'
     A            RRCNT          5  0     70EDTCDE(3)
     A*
     A*                                              Begin /S01486/
     A***********------------------------------------------------------
     A*****FORMAT*FOR END OF REPORT
     A***********------------------------------------------------------
     A***********
     A**********R ENDAU
     A**********                            SPACEB(3)
     A**********                          56'** END OF REPORT **'
     A**********
     A*                                              End   /S01486/
     A**---------------------------------------------------------------
     A**   FORMAT FOR DATABASE ERROR MESSAGE.
     A**---------------------------------------------------------------
     A*
     A          R ERRORAU                   TEXT('DATABASE ERROR MSG')
     A                                    33'DATABASE ERROR'
     A                                      SKIPB(15)
     A            DBASE          3  0     48
     A                                    52'IN PROGRAM'
     A            DBPGM         10        63
     A                                      SPACEA(3)
     A*
     A                                    33'FILE'
     A*                                              Begin /S01486/
     A************DBFILE        10        38
     A            DBFILE         8        38
     A*                                              End   /S01486/
     A                                    48', KEY'
     A            DBKEY         29        54
     A                                      SPACEA(1)
     A*                                              Begin /S01486/
     A*
     A**   FORMAT FOR NO DETAILS MESSAGE.
     A*
     A          R NODETAIL                  TEXT('NO DETAILS MSG')
     A                                    51'**** NO DETAILS TO REPORT ****'
     A                                      SPACEB(2)
     A*                                              End   /S01486/
