      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_AU60                                                      *
/*EXI *  TEXT('Midas PM  PM Exceptions Extract audit')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Management Module                      *
     A*                                                               *
     A*  PRTF/PM0445AU - PM INVESRMENT POLICY EXCEPTIONS AUDIT        *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. S01486             DATE  03OCT94              *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  S01486 - Portfolio Management Upgrade to R10                 *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A*
     A**  FORMAT FOR DOCUMENT HEADER:
     A          R HEADAU
     A***********                                    Begin /S01486/
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A***********                                    End   /S01486/
     A                                      SKIPB(3)
     A                                     7'REFERENCE PM0445AU'
     A            BJURPT        53        37
     A                                   101'DATE'
     A            BJMRDT         7       106
     A                                   119'PAGE'
     A                                   124PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(2)
     A                                    41'PM INVESTMENT POLICY EXCEPIONS '
     A                                    72'EXTRACT AUDIT LIST'
     A                                      SPACEA(1)
     A                                    41'-------------------------------'
     A                                    72'-----------------'
     A                                      SPACEA(2)
     A*
     A**  FORMAT FOR DOCUMENT AUDIT:
     A          R AUDIT
     A                                    21'NUMBER OF RECORDS WRITTEN TO '
     A***********                                    Begin /S01486/
     A************                        50'PF/PMIVPEPP '
     A                                    50'PF/PMIVPEPD '
     A***********                                    End   /S01486/
     A            RRIVPT         5  0     82EDTCDE(3) SPACEA(2)
     A*
     A***********                                    Begin /S01486/
     A****FORMAT*FOR*END*OF*AUDIT:
     A********* R ENDAU
     A*********                           56'** END OF REPORT **'
     A***********                                    End   /S01486/
