     A*****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas PM Daily Transactions Report')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Management Module                          *
     A*                                                               *
     A*  PRTF/PM0400P1 - PM DAILY TRANSACTION REPORT                  *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 30Nov05               *
      *  Prev Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.01 -----------------------------------------------*
      *                 CDL006             Date 26Apr99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 S71062             Date 27Nov95               *
      *                 S01408             Date 01Apr96               *
     A*                 CPM004             DATE 08FEB96               *
     A*                 085867             DATE 16MAR95               *
     A*                 S01486             DATE 11AUG94               *
     A*                 049421             DATE 07JAN92               *
     A*                 062353             DATE 21OCT93               *
     A*                 056452             DATE 14JUN93               *
     A*                 056448             DATE 14JUN93               *
     A*                 ROLLOV             DATE 30SEP91               *
     A*                 B07949             DATE 06JUN91               *
     A*                 R05915             DATE 30/04/91              *
     A*                 R05913             DATE 30/04/91              *
     A*                 R10040             DATE 17/09/90              *
     A*                 R10039             DATE 17/09/90              *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CDL006 - Dealing Fiduciary.                                  *
     A*  S71062 - FF/PM Interface                                     *
     A*  S01408 - Addition of core hooks PM0400P101                   *
     A*                                  PM0400P102                   *
     A*  CPM004 - Bank Portfolios                                     *
     A*  085867 - Change Pay A/C and Rec A/C to have the branch code  *
     A*  S01486 - Portfolio Management Upgrade to Release 10          *
     A*  049421 - HEADER BOX STANDARDISATION                          *
     A*  062353 - OUTPUT ROLLOVER DATE FOR LOANS                      *
     A*  056452 - TRANSACTIONS DISPLAYED FROM CUSTOMER POINT OF VIEW  *
     A*  056448 - NARRATIVE CHANGED TO 'VALUE/INTEREST/FEES'          *
     A*  ROLLOV - ROLLOVER DETAILS INTEGRATION                        *
     A*  B07949 - OUPUT CHARGE AMOUNTS TO DAILY TRANSACTION EXTRACT   *
     A*  R05915 - OUTPUT AMOUNT OF REALLOWANCE                        *
     A*  R10040 - OUTPUT ACCOUNT NAME TO REPORT                       *
     A*  R10039 - PAY/RECEIVE DETAILS NOT OUTPUT FOR FIDUCIARY        *
     A*           DEPOSIT AMENDMENTS                                  *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A*                                              Begin /S01486/
     A                                      REF(MFRFL)
     A*                                              End   /S01486/
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR DOCUMENT HEADER
     A**---------------------------------------------------------------
     A*
     A***********                                    Begin /S01486/
     A**********R PM0400HD
     A          R PM0400HD                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A***********                                    End   /S01486/
     A*                                              Begin /S01486/
     A***********                       2  6'REFRENCE PM0400P1'
     A                                  2  6'REFERENCE PM0400P1'
     A*                                              End   /S01486/
     A            BJURPT        53A     2 36
     A                                  2101'DATE'
     A            BJMRDT         7      2106
     A                                  2119'PAGE'
     A            PAGE           3  0   2124EDTCDE(Z)
     A*                                              Begin /S01486/
     A                                  3101'TIME'
     A                                  3106TIME
     A*                                              End   /S01486/
     A*
     A                                  4 33'PORTFOLIO MANAGEMENT DAILY TRANSAC-
     A                                      TIONS PER ACCOUNT OFFICER'
     A                                  5 33'-----------------------------------
     A                                      -------------------------'
     A*                                              Begin /S01486/
     A                                  7 89'A/C OFR -'
     A            AZACOC         2A     7 99
     A            AZACON    R           7102REFFLD(BRNM)
     A*                                              End   /S01486/
     A          R PM0400F1
     A*                                              Begin /S01486/
     A***********                       7  4'ACCOUNT OFFICER'
     A***********                           HIGHLIGHT
     A*********** AZACOC         2A     7 21
     A***********                           HIGHLIGHT
     A*********** AZACON        30A     7 25
     A***********                           HIGHLIGHT
     A***********                       9  4'CUSTOMER'
     A***********                           HIGHLIGHT
     A*********** SACNUM         6S 0   9 15
     A***********                           HIGHLIGHT
     A*********** SACRNM        20A     9 23
     A***********                           HIGHLIGHT
     A***********                      11  4'PORTFOLIO REFERENCE'
     A***********                           HIGHLIGHT
     A*********** SAPTFR         4A    11 26
     A***********                           HIGHLIGHT
     A*********** PNPTFN        20A    11 32
     A***********                           HIGHLIGHT
     A***********                      11 55'PORTFOLIO CURRENCY'
     A***********                           HIGHLIGHT
     A*********** PNPTCY         3A    11 74
     A***********                           HIGHLIGHT
     A                                  9  4'CUSTOMER'
      * Begin /CSD027/
     A**********  SACNUM         6S 0   9 15                                                  CSD027
     A            SACNUM         6A     9 15
      * End /CSD027/
     A            SACRNM        20A     9 23
     A                                 11  4'PORTFOLIO REFERENCE'
     A            SAPTFR         4A    11 26
     A            PNPTFN        20A    11 32
     A                                 11 55'PORTFOLIO CURRENCY'
     A            PNPTCY         3A    11 74
     A*                                              End   /S01486/
     A          R PM0400F2
     A                                      SPACEB(2)
     A                                      SPACEA(1)
     A                                     4'DISPLAY GROUP'
     A*                                              Begin /S01486/
     A***********                           HIGHLIGHT
     A*                                              End   /S01486/
     A            SARCOA         3A       22
     A*                                              Begin /S01486/
     A***********                           HIGHLIGHT
     A*                                              End   /S01486/
     A            PADSPT        20A       27
     A*                                              Begin /S01486/
     A***********                           HIGHLIGHT
     A*                                              End   /S01486/
     A          R PM0400F3
     A                                      SPACEB(1)
     A                                      SPACEA(1)
     A                                     4'INSTRUMENT TYPE'
     A*                                              Begin /S01486/
     A***********                           HIGHLIGHT
     A*                                              End   /S01486/
     A            SAINNR         3A       22
     A*                                              Begin /S01486/
     A***********                           HIGHLIGHT
     A*                                              End   /S01486/
     A            SAISTN        20A       27
     A*                                              Begin /S01486/
     A***********                           HIGHLIGHT
     A*                                              End   /S01486/
     A                                      SPACEA(1)
     A          R PM0400F4
     A                                      SPACEB(2)
     A                                    16'NOMINAL'
     A                                    29'INSTRUMENT'
     A*>>> 062353 >>>
     A***                                 48'TRADE/VALUE'
     A                                    48'TRD/VAL/ROLL'
     A*<<< 062353 <<<
     A                                    63'PRICE'
     A*** START 056448 ***
     A***                                 77'VALUE/INTEREST'
     A                                    77'VALUE/INTEREST/FEES'
     A*** END   056448 ***
     A                                   114'SETTLEMENT VALUE'
     A                                      SPACEA(1)
     A                                    16'-------'
     A                                    29'----------'
     A*>>> 062353 >>>
     A****                                48'-----------'
     A                                    48'------------'
     A*<<< 062353 <<<
     A                                    63'-----'
     A*** START 056448 ***
     A***                                 77'--------------'
     A                                    77'-------------------'
     A*** END   056448 ***
     A                                   114'----------------'
     A                                      SPACEA(1)
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR SE TRADES
     A**---------------------------------------------------------------
     A*
     A          R PM400TPC
     A            RRTRN1         3A        2
     A                                      SPACEB(1)
     A            RRCCY1         3A        7
     A            RRAM1R        16A       11
     A            RRT1XT        20A       29
     A            RRDDAT         7A       50
     A            RRPR2R        16A       58
     A            RRAPNM        16A       75
     A            RRRTAR        14A       92
     A            RRTAS1         1A      106
     A            RRSETC         3A      109
     A            RRTOTR        19A      113
     A                                      SPACEA(1)
     A            RRT2XT        20A       29
     A            RRVDAT         7A       50
     A            RRPR1R        16A       58
     A            RRPUIR        16A       75
     A            RRAINT         6A       91
     A                                      SPACEA(1)
     A            RRTRNB         6A       29
     A            RRCHTP         8A       41
     A            RRVL2R        16A       75
     A                                      SPACEA(1)
     A                                    35'/'
     A***********                                    Begin /CPM004/
     A**22                                29'REC:'
     A  22N50                             29'REC:'
     A  22 50                             29'PAY:'
     A***********                                    End   /CPM004/
     A  22        RRPAYM         2A       33
     A**Start of change CGL029
     A**22******  RRPYAC        12A       36                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**22******  RRPYBR         3A       48                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A***START*R05915**************************************************                       CGL029
     A**22********RRPYNM********20A*******49SPACEA(1)******************                       CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**22********RRPYNM********20A*******49***************************                       CGL029
     A**22******  RRPYNM        20A       52                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A***END*R05915****************************************************                       CGL029
     A  22        RRPYAC        18A       36
     A  22        RRPYBR         3A       54
     A  22        RRPYNM        20A       58
     A**End of change CGL029
     A***********                                    Begin /CPM004/
     A**24                                29'PAY:'
     A  24N50                             29'PAY:'
     A  24 50                             29'REC:'
     A***********                                    End   /CPM004/
     A  24        RRRCVM         2A       33
     A**Start of change CGL029
     A**24******  RRRCAC        12A       36                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**24******  RRRCBR         3A       48                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A***START R05915**************************************************                       CGL029
     A**24********RRRCNM********20A*******49SPACEA(1)******************                       CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**24********RRRCNM********20A*******49***************************                       CGL029
     A**24******  RRRCNM        20A       52                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A***END R05915****************************************************                       CGL029
     A***START R05915**************************************************                       CGL029
     A**********  RRVLGL        16A       75                                                  CGL029
     A**********  RRALLW         6A       91SPACEA(1)                                         CGL029
     A  24        RRRCAC        18A       36
     A  24        RRRCBR         3A       54
     A  24        RRRCNM        20A       58
     A            RRVLGL        16A       81
     A            RRALLW         6A       97SPACEA(1)
     A**End of change CGL029
     A***END R05915***
     A***********                                    Begin /CPM004/
      * Begin /CSD027/
     A**50******  SATCNM         6S       29                                                  CSD027
     A  50        SATCNM         6A       29
      * End /CSD027/
     A  50        SATCRN        20A       36SPACEA(1)
     A***********                                    End   /CPM004/
     A          R PM400TPF
     A                                      SPACEB(1)
     A                                      SPACEA(1)
     A                                     7'TRADE REF'
     A            RRTRNB         6A       24
     A            RRCHTP         8A       61
     A***********                                    Begin /CPM004/
     A  50                                75'CUSTOMER'
      * Begin /CSD027/
     A**50******  SATCNM         6S       85                                                  CSD027
     A  50        SATCNM         6A       85
      * End /CSD027/
     A  50        SATCRN        20A       93
     A***********                                    End   /CPM004/
     A                                      SPACEA(1)
     A                                     7'SECURITY'
     A            RRTDSS        10A       24
     A            RRT1XT        20A       38
     A                                      SPACEA(1)
     A                                     7'TYPE'
     A            RRCHT1         8A       24
     A            RRT2XT        20A       38
     A                                    61'PRICE'
     A            RRPR2L        16A       81
     A                                      SPACEA(1)
     A                                     7'NOMINAL'
     A            RRAM1L        16A       24
     A                                    61'NOMINAL CURRENCY'
     A            RRCCY1         3A       81
     A                                      SPACEA(1)
     A                                     7'BRANCH'
     A            RRBRCD         3A       24
     A                                    61'PURCHASED INTEREST'
     A            RRPUIL        16A       81
     A            RRAINT         6A      103
     A                                      SPACEA(1)
     A                                     7'TRADE DATE'
     A            RRDDAT         7A       24
     A                                    61'REALLOWANCE'
     A            RRVL1L        16A       81
     A                                      SPACEA(1)
     A                                     7'VALUE DATE'
     A            RRVDAT         7A       24
     A                                    61'CHARGES/COMMISSIONS'
     A            RRVL2L        16A       81
     A                                      SPACEA(1)
     A                                     7'PRICE/DISC/YLD'
     A            RRPR1L        16A       24
     A                                    61'TOTAL'
     A            RRSETC         3A       70
     A            RRTOTL        19A       81
     A                                      SPACEA(1)
     A                                     7'EXCHANGE RATE'
     A            RRRTAL        14A       24
     A            RRTAS1         1A       39
     A                                    41'(NOMINAL to SETTLE)'
     A                                      SPACEA(1)
     A                                     7'EXCHANGE RATE'
     A            RRRTBL        14A       24
     A            RRTBS1         1A       39
     A                                    41'(SETTLE to FOLIO)'
     A  22                                61'PAYMENT DETAILS'
     A  22        RRPAYM         2A       81
     A***********                                    Begin /085867/
     A**22******* RRPYAC        12A       84SPACEA(1)
     A**Start of change CGL029
     A**22******  RRPYAC        12A       84                                                  CGL029
     A**22******  RRPYBR         3A       96SPACEA(1)                                         CGL029
     A  22        RRPYAC        18A       84
     A  22        RRPYBR         3A      102SPACEA(1)
     A**End of change CGL029
     A***********                                    End   /085867/
     A  24                                61'RECEIPT DETAILS'
     A  24        RRRCVM         2A       81
     A***********                                    Begin /085867/
     A**24******* RRRCAC        12A       84SPACEA(1)
     A**Start of change CGL029
     A**24******  RRRCAC        12A       84                                                  CGL029
     A**24******  RRRCBR         3A       96SPACEA(1)                                         CGL029
     A  24        RRRCAC        18A       84
     A  24        RRRCBR         3A      102SPACEA(1)
     A**End of change CGL029
     A***********                                    End   /085867/
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR SE DEPOTS MOVEMENTS
     A**---------------------------------------------------------------
     A*
     A          R PM400WIC
     A            RRTRN1         3A        2
     A                                      SPACEB(1)
     A            RRCCY1         3A        7
     A            RRAM1R        16A       11
     A            RRT1XT        20A       29
     A            RRVDAT         7A       50
     A            RRPR1R        16A       58
     A            RRAPNM        16A       75
     A            RRSETC         3A      109
     A            RRTOTR        19A      113
     A                                      SPACEA(1)
     A            RRT2XT        20A       29
     A                                      SPACEA(1)
     A            RRTRNB         6A       29
     A            RRCHTP         8A       41
     A                                      SPACEA(1)
     A***********                                    Begin /CPM004/
      * Begin /CSD027/
     A**50******  SATCNM         6S       29                                                  CSD027
     A  50        SATCNM         6A       29
      * End /CSD027/
     A  50        SATCRN        20A       36SPACEA(1)
     A***********                                    End   /CPM004/
     A          R PM400WIF
     A                                      SPACEB(1)
     A                                      SPACEA(1)
     A                                     7'REFERENCE'
     A            RRTRNB         6A       24
     A            RRCHTP         8A       61
     A***********                                    Begin /CPM004/
     A  50                                75'CUSTOMER'
      * Begin /CSD027/
     A**50******  SATCNM         6S       85                                                  CSD027
     A  50        SATCNM         6A       85
      * End /CSD027/
     A  50        SATCRN        20A       93
     A***********                                    End   /CPM004/
     A                                      SPACEA(1)
     A                                     7'SECURITY'
     A            RRTDSS        10A       24
     A            RRT1XT        20A       38
     A                                      SPACEA(1)
     A                                     7'TYPE'
     A            RRWALK         8A       24
     A            RRT2XT        20A       38
     A                                    61'PRICE'
     A            RRPR1L        16A       82
     A                                      SPACEA(1)
     A                                     7'NOMINAL'
     A            RRAM1L        16A       24
     A                                    61'NOMINAL CURRENCY'
     A            RRCCY1         3A       82
     A                                      SPACEA(1)
     A                                     7'BRANCH'
     A            RRBRCD         3A       24
     A                                      SPACEA(1)
     A                                     7'DATE'
     A            RRVDAT         7A       24
     A                                      SPACEA(1)
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR FF TRADES & EXERCISES
     A**---------------------------------------------------------------
     A*
     A          R PM400FFC
     A            RRTRN1         3A        2
     A                                      SPACEB(1)
     A            RRCCY1         3A        7
     A            RRAM1R        16A       11
     A            RRT1XT        20A       29
     A            RRDDAT         7A       50
     A            RRPR1R        16A       58
     A***********                                    Begin /S71062/
     A            RRAMT2        16A       75
     A            RRCCY2         3A      109
     A            RRSETV        19A      113
     A***********                                    End   /S71062/
     A                                      SPACEA(1)
     A            RRT2XT        20A       29
     A***********                                    Begin /S71062/
     A            RRVDAT         7A       50
     A N76                                92'(Chg)'
     A            RRVAL1        16A       75
     A***********                                    End   /S71062/
     A                                      SPACEA(1)
     A            RRTRNB         6A       29
     A            RRCHTP         8A       41
     A***********                                    Begin /S71062/
     A N77                                92'(Com)'
     A            RRVAL2        16A       75
     A***********                                    End   /S71062/
     A                                      SPACEA(1)
     A                                    29'PAY:'
     A            RRPAYM         2A       33
     A                                    35'/'
     A**Start of change CGL029
     A**********  RRPYAC        12A       36                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A************RRPYNM********20A*******49SPACEA(1)******************                       CGL029
     A**********  RRPYBR         3A       48                                                  CGL029
     A***********************************************Begin*/S71062/****                       CGL029
     A************RRPYNM********20A*******52SPACEA(1)******************                       CGL029
     A**********  RRPYNM        20A       52                                                  CGL029
     A            RRPYAC        18A       36
     A            RRPYBR         3A       54
     A            RRPYNM        20A       58
     A**End of change CGL029
     A  80                                  SPACEA(1)
     A N80                                70'INITIAL MARGIN:'
     A N80        RRIMAR        16A       85SPACEA(1)
     A***********                                    End   /S71062/
     A***********                                    End   /085867/
     A          R PM400FFF
     A                                      SPACEB(1)
     A                                      SPACEA(1)
     A                                     7'TRANSACTION REF'
     A            RRTRNB         6A       24
     A            RRCHTP         8A       61
     A                                      SPACEA(1)
     A                                     7'INSTRUMENT'
     A            RRFFNM         5        24
     A            RRT1XT        20A       39
     A                                      SPACEA(1)
     A                                     7'TYPE'
     A            RRWALK         8A       24
     A            RRT2XT        20A       39
     A            RRTRTD        14        61
     A            RRPR1L        16        82
     A                                      SPACEA(1)
     A                                     7'NO. OF CONTRACTS'
     A            RRAM1L        16        24
     A                                      SPACEA(1)
     A                                     7'BRANCH'
     A            RRBRCD         3A       24
     A                                    61'BROKER SETTLEMENT DETAILS'
     A            RRCGST         2        89
     A**Start of change CGL029
     A**********  RRCGAD        12        92                                                  CGL029
     A            RRCGAD        18        92
     A**End of change CGL029
     A                                      SPACEA(1)
     A***********                                    Begin /S71062/
     A************                         7'TRANSACTION DATE'
     A                                     7'TRADE DATE'
     A***********                                    End   /S71062/
     A            RRDDAT         7A       24
     A                                    61'CUSTOMER SETTLEMENT DETAILS'
     A            RRPAYM         2        89
     A**Start of change CGL029
     A**********  RRPYAC        12        92                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**********  RRPYBR         3A      104                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A            RRPYAC        18A       92
     A            RRPYBR         3A      110
     A**End of change CGL029
     A                                      SPACEA(1)
     A***********                                    Begin /S71062/
     A                                     7'VALUE DATE'
     A            RRVDAT         7A       24
     A                                    61'COMMISSIONS'
     A            RRVAL1        16A       73
     A                                      SPACEA(1)
     A                                     7'INITIAL MARGIN'
     A            RRIMAR        16A       24
     A                                    61'CHARGES'
     A            RRVAL2        16A       73
     A                                      SPACEA(1)
     A***********                                    End   /S71062/
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR MM DEALS
     A**---------------------------------------------------------------
     A*
     A          R PM400MMC
     A            RRTRN1         3A        2
     A                                      SPACEB(1)
     A            RRCCY1         3A        7
     A            RRAM1R        16A       11
     A            RRT1XT        20A       29
     A            RRDDAT         7A       50
     A***START B07949***
     A  60        RRVAL1        16A       76
     A  60                                92'CHARGES'
     A***END B07949***
     A            RRSETC         3A      109
     A            RRTOTR        19A      113
     A                                      SPACEA(1)
     A            RRT2XT        20A       29
     A** ROLLOV
     A  30                                60'AUTO:'
     A  30        RRAURO         1A       65
     A  30                                70'P.SEP:'
     A  30        RRINPS         1A       76
     A  30                                80'MARGIN:'
     A  30        RRCUMA        11A       87
     A  30                               100'FREQ:'
     A  30        RRFREQ         1A      105
     A  30                               111'DAY:'
     A  30        RRDNUM         2A      115
     A** ROLLOV
     A*/COPY WNCPYSRC,PM0400P103
     A            RRVDAT         7A       50
     A                                      SPACEA(1)
      *                                              Begin /CDL006/
     A  88                                84'CHARGE:'
     A  88        RFCGA         20A       92
     A  88                                  SPACEA(1)
     A  88                                80'COMMISSION:'
     A  88        RFCMA         20A       92
     A  88                                  SPACEA(1)
      *                                              End   /CDL006/
     A            RRTRNB         6A       29
     A** ROLLOV
     A  30                                60'SET METH:'
     A  30        RRIMET         2A       69
     A  30                                74'SET ACCOUNT:'
     A  30        RRISAC        12A       86
     A  30                               101'COUNT. NOST:'
     A  30        RRINOS        10A      113
     A** ROLLOV
     A*/COPY WNCPYSRC,PM0400P104
     A            RRCHTP         8A       41
     A                                      SPACEA(1)
     A                                    29'PAY:'
     A            RRPAYM         2A       33
     A                                    35'/'
     A**Start of change CGL029
     A**********  RRPYAC        12A       36                                                  CGL029
     A            RRPYAC        18A       36
     A**End of change CGL029
     A***********                                    Begin /085867/
     A*********** RRPYNM        20A       49
     A***********                         71'REC:'
     A*********** RRRCVM         2A       75
     A***********                         77'/'
     A*********** RRRCAC        12A       78
     A*********** RRRCNM        20A       91
     A**Start of change CGL029
     A**********  RRPYBR         3A       48                                                  CGL029
     A**********  RRPYNM        20A       52                                                  CGL029
     A**********                          74'REC:'                                            CGL029
     A**********  RRRCVM         2A       78                                                  CGL029
     A**********                          80'/'                                               CGL029
     A**********  RRRCAC        12A       81                                                  CGL029
     A**********  RRRCBR         3A       93                                                  CGL029
     A**********  RRRCNM        20A       97                                                  CGL029
     A            RRPYBR         3A       54
     A            RRPYNM        20A       58
     A                                    80'REC:'
     A            RRRCVM         2A       84
     A                                    86'/'
     A            RRRCAC        18A       87
     A            RRRCBR         3A      105
     A            RRRCNM        20A      109
     A**End of change CGL029
     A***********                                    End   /085867/
     A                                      SPACEA(1)
     A***********                                    Begin /CPM004/
      * Begin /CSD027/
     A**50******  SATCNM         6S       29                                                  CSD027
     A  50        SATCNM         6A       29
      * End /CSD027/
     A  50        SATCRN        20A       36SPACEA(1)
     A***********                                    End   /CPM004/
     A          R PM400MMF
     A                                      SPACEB(1)
     A                                      SPACEA(1)
     A N23                                 7'DEAL NUMBER'
     A  23                                 7'DEPOSIT NUMBER'
     A            RRTRNB         6A       24
     A            RRCHTP         8A       61
     A***********                                    Begin /CPM004/
     A  50                                75'CUSTOMER'
      * Begin /CSD027/
     A**50******  SATCNM         6S       85                                                  CSD027
     A  50        SATCNM         6A       85
      * End /CSD027/
     A  50        SATCRN        20A       93
     A***********                                    End   /CPM004/
     A                                      SPACEA(1)
     A                                     7'DEAL NARRATIVE'
     A            RRT1XT        20A       24
     A                                      SPACEA(1)
     A                                     7'TYPE/SUB TYPE'
     A            RRTRTP         2        24
     A                                    27'/'
     A            RRTRST         2        29
     A                                    61'INTEREST'
     A            RRBRT1         2        82
     A            RRRAI1        14        85
     A            RRFRQ1         1       102
     A            RRIPD1         7       105
     A                                      SPACEA(1)
     A                                     7'AMOUNT'
     A            RRAM1L        16        24
     A                                    61'CURRENCY'
     A            RRCCY1         3A       82
     A                                      SPACEA(1)
     A                                     7'BRANCH'
     A            RRBRCD         3A       24
     A N23                                  SPACEA(1)
     A*                                                   /*S01408*/
     A*/COPY WNCPYSRC,PM0400P101                          /*S01408*/
     A*                                                   /*S01408*/
     A***********                                    Begin /085867/
     A**23*******                         61'FIDUCIARY NUMBER'
     A**23******* RRFINR         6A       82
     A**23*******                           SPACEA(1)
     A***********                                    End   /085867/
     A  23                                 7'PLACED WITH'
     A  23        RRBNUM         6A       24
     A  23                                61'POOLING NUMBER'
     A  23        RRPOOL         2A       82
     A  23                                  SPACEA(1)
     A                                     7'DEAL DATE'
     A            RRDDAT         7A       24
     A N23                                  SPACEA(1)
     A  23                                61'COMMISSION'
     A  23        RRCOMC         2A       82
     A  23        RRCFRQ         1A       85
     A  23        RRNCDT         7A       87
     A  23                                  SPACEA(1)
     A                                     7'VALUE DATE'
     A            RRVDAT         7        24
     A N23                                  SPACEA(1)
     A  23                                61'SETTLE COMMISSION'
     A  23        RRCGST         2A       82
     A**Start of change CGL029
     A**23******  RRCGAD        12A       85                                                  CGL029
     A  23        RRCGAD        18A       85
     A**End of change CGL029
     A  23                                  SPACEA(1)
     A N21                                 7'MATURITY DATE'
     A N21        RRMDA1         7        24
     A                                    61'PAYMENT DETAILS'
     A            RRPAYM         2A       82
     A**Start of change CGL029
     A**********  RRPYAC        12A       85                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**********  RRPYBR         3A       97                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A            RRPYAC        18A       85
     A            RRPYBR         3A      103
     A**End of change CGL029
     A                                      SPACEA(1)
     A  21                                 7'CALL/NOTICE DAYS'
     A  21        RRMDA2         7        24
     A                                    61'RECEIPT DETAILS'
     A            RRRCVM         2A       82
     A**Start of change CGL029
     A**********  RRRCAC        12A       85                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**********  RRRCBR         3A       97                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A            RRRCAC        18A       85
     A            RRRCBR         3A      103
     A**End of change CGL029
     A                                      SPACEA(1)
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR DEAL AMENDMENTS: PI,PD
     A**---------------------------------------------------------------
     A*
     A          R PM400PIC
     A            RRTRN1         3A        2
     A                                      SPACEB(1)
     A            RRCCY1         3A        7
     A            RRAM1R        16A       11
     A            RRT1XT        20A       29
     A            RRVDAT         7A       50
     A                                      SPACEA(1)
     A            RRT2XT        20A       29
     A                                      SPACEA(1)
     A            RRTRNB         6A       29
     A                                    35'/'
     A            RRSQNO         3        36
     A            RRCHTP         8A       41
     A                                      SPACEA(1)
     A***START R10039***
     A***                                 29'PAY:'
     A***         RRPAYM         2A       33
     A***                                 35'/'
     A***         RRPYAC        12A       36
     A  22                                29'PAY:'
     A  22        RRPAYM         2A       33
     A  22                                35'/'
     A**Start of change CGL029
     A**22******  RRPYAC        12A       36                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**22********RRPYNM********20A*******49***************************                       CGL029
     A**22******  RRPYBR         3A       48                                                  CGL029
     A**22******  RRPYNM        20A       52                                                  CGL029
     A  22        RRPYAC        18A       36
     A  22        RRPYBR         3A       54
     A  22        RRPYNM        20A       58
     A**End of change CGL029
     A***********                                    End   /085867/
     A                                      SPACEA(1)
     A  24                                29'RCV:'
     A  24        RRRCVM         2A       33
     A  24                                35'/'
     A**Start of change CGL029
     A**24******  RRRCAC        12A       36                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**24********RRRCNM********20A*******49***************************                       CGL029
     A**24******  RRRCBR         3A       48                                                  CGL029
     A**24******  RRRCNM        20A       52                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A  24        RRRCAC        18A       36
     A  24        RRRCBR         3A       54
     A  24        RRRCNM        20A       58
     A**End of change CGL029
     A                                      SPACEA(1)
     A***END R10039***
     A***********                                    Begin /CPM004/
      * Begin /CSD027/
     A**50******  SATCNM         6S       29                                                  CSD027
     A  50        SATCNM         6A       29
      * End /CSD027/
     A  50        SATCRN        20A       36SPACEA(1)
     A***********                                    End   /CPM004/
     A          R PM400PIF
     A                                      SPACEB(1)
     A                                      SPACEA(1)
     A                                     7'DEAL NUMBER'
     A            RRTRNB         6A       24
     A            RRCHTP         8A       61
     A***********                                    Begin /CPM004/
     A  50                                75'CUSTOMER'
      * Begin /CSD027/
     A**50******  SATCNM         6S       85                                                  CSD027
     A  50        SATCNM         6A       85
      * End /CSD027/
     A  50        SATCRN        20A       93
     A***********                                    End   /CPM004/
     A                                      SPACEA(1)
     A                                     7'DEAL NARRATIVE'
     A            RRT1XT        20A       24
     A                                      SPACEA(1)
     A                                     7'TYPE'
     A            RRTRTP         2A       24
     A                                    61'SEQUENCE'
     A            RRSQNO         3        82
     A                                      SPACEA(1)
     A                                     7'AMOUNT'
     A            RRAM1L        16A       24
     A                                    61'CURRENCY'
     A            RRCCY1         3A       82
     A                                      SPACEA(1)
     A                                     7'BRANCH'
     A            RRBRCD         3A       24
     A                                      SPACEA(1)
     A                                     7'VALUE DATE'
     A            RRVDAT         7A       24
     A  22                                61'PAYMENT DETAILS'
     A  22        RRPAYM         2A       82
     A**Start of change CGL029
     A**22******  RRPYAC        12A       85                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**22******  RRPYBR         3A       97                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A  22        RRPYAC        18A       85
     A  22        RRPYBR         3A      103
     A**End of change CGL029
     A  24                                61'RECEIPT DETAILS'
     A  24        RRRCVM         2A       82
     A**Start of change CGL029
     A**24******  RRRCAC        12A       85                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**24******  RRRCBR         3A       97                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A  24        RRRCAC        18A       85
     A  24        RRRCBR         3A      103
     A**End of change CGL029
     A                                      SPACEA(1)
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR DEAL AMENDMENTS: SC,CI,SI
     A**---------------------------------------------------------------
     A*
     A          R PM400SCC
     A            RRTRN1         3A        2
     A                                      SPACEB(1)
     A            RRT1XT        20A       29
     A            RRVDAT         7A       50
     A            RRBRT1         2        58
     A            RRRAI1        14        61
     A                                      SPACEA(1)
     A            RRT2XT        20A       29
     A                                      SPACEA(1)
     A            RRTRNB         6A       29
     A                                    35'/'
     A            RRSQNO         3        36
     A            RRCHTP         8A       41
     A                                      SPACEA(1)
     A***START R10039***
     A******                              29'PAY:'
     A******      RRPAYM         2A       33
     A******                              35'/'
     A******      RRPYAC        12A       36
     A******                                SPACEA(1)
     A  22                                29'PAY:'
     A  22        RRPAYM         2A       33
     A  22                                35'/'
     A**Start of change CGL029
     A**22******  RRPYAC        12A       36                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**22********RRPYNM********20A*******49***************************                       CGL029
     A**22******  RRPYBR         3A       48                                                  CGL029
     A**22******  RRPYNM        20A       52                                                  CGL029
     A  22        RRPYAC        18A       36
     A  22        RRPYBR         3A       54
     A  22        RRPYNM        20A       58
     A**End of change CGL029
     A***********                                    End   /085867/
     A                                      SPACEA(1)
     A  24                                29'RCV:'
     A  24        RRRCVM         2A       33
     A  24                                35'/'
     A**Start of change CGL029
     A**24******  RRRCAC        12A       36                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**24********RRRCNM********20A*******49***************************                       CGL029
     A**24******  RRRCBR         3A       48                                                  CGL029
     A**24******  RRRCNM        20A       52                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A  24        RRRCAC        18A       36
     A  24        RRRCBR         3A       54
     A  24        RRRCNM        20A       58
     A**End of change CGL029
     A                                      SPACEA(1)
     A***END R10039***
     A***********                                    Begin /CPM004/
      * Begin /CSD027/
     A**50******  SATCNM         6S       29                                                  CSD027
     A  50        SATCNM         6A       29
      * End /CSD027/
     A  50        SATCRN        20A       36SPACEA(1)
     A***********                                    End   /CPM004/
     A          R PM400SCF
     A                                      SPACEB(1)
     A                                      SPACEA(1)
     A                                     7'DEAL NUMBER'
     A            RRTRNB         6A       24
     A            RRCHTP         8A       61
     A***********                                    Begin /CPM004/
     A  50                                75'CUSTOMER'
      * Begin /CSD027/
     A**50******  SATCNM         6S       85                                                  CSD027
     A  50        SATCNM         6A       85
      * End /CSD027/
     A  50        SATCRN        20A       93
     A***********                                    End   /CPM004/
     A                                      SPACEA(1)
     A                                     7'DEAL NARRATIVE'
     A            RRT1XT        20A       24
     A                                      SPACEA(1)
     A                                     7'TYPE'
     A            RRTRTP         2A       24
     A                                    61'SEQUENCE'
     A            RRSQNO         3A       82
     A                                      SPACEA(1)
     A                                     7'INTEREST RATE'
     A            RRBRT1         2        24
     A            RRRAI1        14        28
     A                                      SPACEA(1)
     A                                     7'BRANCH'
     A            RRBRCD         3A       24
     A  22                                61'PAYMENT DETAILS'
     A  22        RRPAYM         2A       82
     A**Start of change CGL029
     A**22******  RRPYAC        12A       85                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**22******  RRPYBR         3A       97                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A  22        RRPYAC        18A       85
     A  22        RRPYBR         3A      103
     A**End of change CGL029
     A  24                                61'RECEIPT DETAILS'
     A  24        RRRCVM         2A       82
     A**Start of change CGL029
     A**24******  RRRCAC        12A       85                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**24******  RRRCBR         3A       97                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A  24        RRRCAC        18A       85
     A  24        RRRCBR         3A      103
     A**End of change CGL029
     A                                      SPACEA(1)
     A N22N24                              7'VALUE DATE'
     A                                      SPACEB(1)
     A  22
     AO 24                                 7'VALUE DATE'
     A            RRVDAT         7A       24
     A                                      SPACEA(1)
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR FX DEAL
     A**---------------------------------------------------------------
     A*
     A          R PM400FXC
     A            RRTRN1         3A        2
     A                                      SPACEB(1)
     A            RRCCY2         3A        7
     A            RRAM2R        16A       11
     A            RRT1XT        20A       29
     A            RRDDAT         7A       50
     A            RRRTAR        14A       58
     A                                      SPACEA(1)
     A            RRTRN2         3A        2
     A            RRCCY1         3A        7
     A            RRAM1R        16A       11
     A            RRT2XT        20A       29
     A            RRVDAT         7A       50
     A                                      SPACEA(1)
     A            RRTRNB         6A       29
     A            RRCHTP         8A       41
     A                                      SPACEA(1)
     A                                    29'PAY:'
     A            RRPAYM         2A       33
     A                                    35'/'
     A*** 056452 ***
     A***         RRPYAC        12A       36
     A***         RRPYNM        20A       49
     A***                                 71'REC:'
     A***         RRRCVM         2A       75
     A***                                 77'/'
     A***         RRRCAC        12A       78
     A***         RRRCNM        20A       91
     A**Start of change CGL029
     A**********  RPYAC1        15A       36                                                  CGL029
     A**********  RRPYNM        20A       52                                                  CGL029
     A**********                          74'REC:'                                            CGL029
     A**********  RRRCVM         2A       78                                                  CGL029
     A**********                          80'/'                                               CGL029
     A**********  RRCAC1        15A       81                                                  CGL029
     A**********  RRRCNM        20A       98                                                  CGL029
     A            RPYAC1        21A       36
     A            RRPYNM        20A       58
     A                                    80'REC:'
     A            RRRCVM         2A       84
     A                                    86'/'
     A            RRCAC1        21A       87
     A            RRRCNM        20A      110
     A**End of change CGL029
     A***  END 056452 ***
     A                                      SPACEA(1)
     A***********                                    Begin /CPM004/
      * Begin /CSD027/
     A**50******  SATCNM         6S       29                                                  CSD027
     A  50        SATCNM         6A       29
      * End /CSD027/
     A  50        SATCRN        20A       36SPACEA(1)
     A***********                                    End   /CPM004/
     A          R PM400FXF
     A                                      SPACEB(1)
     A                                      SPACEA(1)
     A                                     7'DEAL NUMBER'
     A            RRTRNB         6A       24
     A            RRCHTP         8A       61
     A***********                                    Begin /CPM004/
     A  50                                75'CUSTOMER'
      * Begin /CSD027/
     A**50******  SATCNM         6S       85                                                  CSD027
     A  50        SATCNM         6A       85
      * End /CSD027/
     A  50        SATCRN        20A       93
     A***********                                    End   /CPM004/
     A                                      SPACEA(1)
     A                                     7'DEAL NARRATIVE'
     A            RRT1XT        20A       24
     A                                      SPACEA(1)
     A                                     7'TYPE/SUB TYPE'
     A            RRTRTP         2A       24
     A                                    27'/'
     A            RRTRST         2A       29
     A                                    61'EXCHANGE RATE'
     A            RRRTAL        14A       82
     A                                      SPACEA(1)
     A                                     7'BUY AMOUNT'
     A            RRAM2L        16A       24
     A                                    61'BUY CURRENCY'
     A            RRCCY2         3A       82
     A                                      SPACEA(1)
     A                                     7'SELL AMOUNT'
     A            RRAM1L        16        24
     A                                    61'SELL CURRENCY'
     A            RRCCY1         3        82
     A                                      SPACEA(1)
     A                                     7'BRANCH'
     A            RRBRCD         3A       24
     A                                    61'SWAP/OPTION DEAL'
     A            RRSWOD         6        82
     A                                      SPACEA(1)
     A                                     7'DEAL DATE'
     A            RRDDAT         7A       24
     A                                    61'B/C EQUIVALENT'
     A            RRVL1L        16        82
     A                                      SPACEA(1)
     A                                     7'VALUE DATE'
     A            RRVDAT         7A       24
     A                                    61'PAYMENT DETAILS'
     A            RRPAYM         2A       82
     A**Start of change CGL029
     A**********  RRPYAC        12A       85                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**********  RRPYBR         3A       97                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A            RRPYAC        18A       85
     A            RRPYBR         3A      103
     A**End of change CGL029
     A                                      SPACEA(1)
     A                                     7'OPTION TO DATE'
     A            RRMDAT         7A       24
     A                                    61'RECEIPT DETAILS'
     A            RRRCVM         2A       82
     A**Start of change CGL029
     A**********  RRRCAC        12A       85                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**********  RRRCBR         3A       97                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A            RRRCAC        18A       85
     A            RRRCBR         3A      103
     A**End of change CGL029
     A                                      SPACEA(1)
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR FR DEAL
     A**---------------------------------------------------------------
     A*
     A          R PM400FRC
     A            RRTRN1         3A        2
     A                                      SPACEB(1)
     A            RRCCY1         3A        7
     A            RRAM1R        16A       11
     A            RRT1XT        20A       29
     A            RRDDAT         7A       50
     A                                      SPACEA(1)
     A            RRT2XT        20A       29
     A            RRVDAT         7A       50
     A                                      SPACEA(1)
     A            RRTRNB         6A       29
     A            RRCHTP         8A       41
     A                                      SPACEA(1)
     A                                    29'PAY:'
     A            RRPAYM         2A       33
     A                                    35'/'
     A**Start of change CGL029
     A**********  RRPYAC        12A       36                                                  CGL029
     A            RRPYAC        18A       36
     A**End of change CGL029
     A***********                                    Begin /085867/
     A*********** RRPYNM        20A       49
     A***********                         71'REC:'
     A*********** RRRCVM         2A       75
     A***********                         77'/'
     A*********** RRRCAC        12A       78
     A*********** RRRCNM        20A       91
     A**Start of change CGL029
     A**********  RRPYBR         3A       48                                                  CGL029
     A**********  RRPYNM        20A       52                                                  CGL029
     A**********                          74'REC:'                                            CGL029
     A**********  RRRCVM         2A       78                                                  CGL029
     A**********                          80'/'                                               CGL029
     A**********  RRRCAC        12A       81                                                  CGL029
     A**********  RRRCBR         3A       93                                                  CGL029
     A**********  RRRCNM        20A       97                                                  CGL029
     A            RRPYBR         3A       54
     A            RRPYNM        20A       58
     A                                    80'REC:'
     A            RRRCVM         2A       84
     A                                    86'/'
     A            RRRCAC        18A       87
     A            RRRCBR         3A      105
     A            RRRCNM        20A      109
     A**End of change CGL029
     A***********                                    End   /085867/
     A                                      SPACEA(1)
     A          R PM400FRF
     A                                      SPACEB(1)
     A                                      SPACEA(1)
     A                                     7'DEAL NUMBER'
     A            RRTRNB         6A       24
     A            RRCHTP         8A       61
     A                                      SPACEA(1)
     A                                     7'DEAL NARRATIVE'
     A            RRT1XT        20A       24
     A                                      SPACEA(1)
     A                                     7'TYPE/SUB TYPE'
     A            RRTRTP         2A       24
     A                                    27'/'
     A            RRTRST         2A       29
     A                                    61'INTEREST'
     A            RRBRT1         2A       82
     A            RRRAI1        14A       85
     A            RRFRQ1         1A      102
     A            RRIPD1         7A      105
     A                                      SPACEA(1)
     A                                     7'AMOUNT'
     A            RRAM1L        16A       24
     A                                    61'CURRENCY'
     A            RRCCY1         3A       82
     A                                      SPACEA(1)
     A                                     7'BRANCH'
     A            RRBRCD         3A       24
     A                                      SPACEA(1)
     A                                     7'DEAL DATE'
     A            RRDDAT         7A       24
     A                                    61'PAYMENT DETAILS'
     A            RRPAYM         2A       81
     A**Start of change CGL029
     A**********  RRPYAC        12A       84                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**********  RRPYBR         3A       96                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A            RRPYAC        18A       84
     A            RRPYBR         3A      102
     A**End of change CGL029
     A                                      SPACEA(1)
     A                                     7'VALUE DATE'
     A            RRVDAT         7        24
     A                                    61'RECEIPT DETAILS'
     A            RRRCVM         2A       82
     A**Start of change CGL029
     A**********  RRRCAC        12A       85                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**********  RRRCBR         3A       97                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A            RRRCAC        18A       85
     A            RRRCBR         3A      103
     A**End of change CGL029
     A                                      SPACEA(1)
     A                                     7'MATURITY DATE'
     A            RRMDAT         7A       24
     A                                      SPACEA(1)
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR RX DEAL
     A**---------------------------------------------------------------
     A*
     A          R PM400RXC
     A            RRTRN1         3A        2
     A                                      SPACEB(1)
     A            RRCCY1         3A        7
     A            RRAM1R        16A       11
     A            RRT1XT        20A       29
     A            RRDDAT         7A       50
     A            RRBRT1         2        58
     A            RRRAI1        14A       61
     A                                      SPACEA(1)
     A            RRTRN2         3A        2
     A            RRCCY2         3A        7
     A            RRAM2R        16A       11
     A            RRT2XT        20A       29
     A            RRVDAT         7A       50
     A                                      SPACEA(1)
     A            RRTRNB         6A       29
     A            RRCHTP         8A       41
     A                                      SPACEA(1)
     A                                    29'PAY:'
     A            RRPAYM         2A       33
     A                                    35'/'
     A**Start of change CGL029
     A**********  RRPYAC        12A       36                                                  CGL029
     A            RRPYAC        18A       36
     A**End of change CGL029
     A***********                                    Begin /085867/
     A*********** RRPYNM        20A       49
     A***********                         71'REC:'
     A*********** RRRCVM         2A       75
     A***********                         77'/'
     A*********** RRRCAC        12A       78
     A*********** RRRCNM        20A       91
     A**Start of change CGL029
     A**********  RRPYBR         3A       48                                                  CGL029
     A**********  RRPYNM        20A       52                                                  CGL029
     A**********                          74'REC:'                                            CGL029
     A**********  RRRCVM         2A       78                                                  CGL029
     A**********                          80'/'                                               CGL029
     A**********  RRRCAC        12A       81                                                  CGL029
     A**********  RRRCBR         3A       93                                                  CGL029
     A**********  RRRCNM        20A       97                                                  CGL029
     A            RRPYBR         3A       54
     A            RRPYNM        20A       58
     A                                    80'REC:'
     A            RRRCVM         2A       84
     A                                    86'/'
     A            RRRCAC        18A       87
     A            RRRCBR         3A      105
     A            RRRCNM        20A      109
     A**End of change CGL029
     A***********                                    End   /085867/
     A                                      SPACEA(1)
     A          R PM400RXF
     A                                      SPACEB(1)
     A                                      SPACEA(1)
     A                                     7'DEAL NUMBER'
     A            RRTRNB         6A       24
     A            RRCHTP         8A       61
     A                                      SPACEA(1)
     A                                     7'DEAL NARRATIVE'
     A            RRT1XT        20A       24
     A                                      SPACEA(1)
     A                                     7'TYPE/SUB TYPE'
     A            RRTRTP         2A       24
     A                                    27'/'
     A            RRTRST         2A       29
     A                                    61'INTEREST'
     A            RRBRT1         2        78
     A            RRRAI1        14A       81
     A            RRFRQ1         1        98
     A            RRIPD1         7       100
     A            RRBRT2         2       108
     A            RRRAI2        12       111
     A            RRFRQ2         1       124
     A            RRIPD2         7       126
     A                                      SPACEA(1)
     A                                     7'BUY AMOUNT'
     A            RRAM1L        16A       24
     A                                    61'BUY CURRENCY'
     A            RRCCY1         3A       81
     A                                      SPACEA(1)
     A                                     7'SELL AMOUNT'
     A            RRAM2L        16A       24
     A                                    61'SELL CURRENCY'
     A            RRCCY2         3A       81
     A                                      SPACEA(1)
     A                                     7'BRANCH'
     A            RRBRCD         3A       24
     A                                      SPACEA(1)
     A                                     7'DEAL DATE'
     A            RRDDAT         7A       24
     A                                    61'PAYMENT DETAILS'
     A            RRPAYM         2A       81
     A**Start of change CGL029
     A**********  RRPYAC        12A       84                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**********  RRPYBR         3A       96                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A            RRPYAC        18A       84
     A            RRPYBR         3A      102
     A**End of change CGL029
     A                                      SPACEA(1)
     A                                     7'VALUE DATE'
     A            RRVDAT         7        24
     A                                    61'RECEIPT DETAILS'
     A            RRRCVM         2A       81
     A**Start of change CGL029
     A**********  RRRCAC        12A       84                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**********  RRRCBR         3A       96                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A            RRRCAC        18A       84
     A            RRRCBR         3A      102
     A**End of change CGL029
     A                                      SPACEA(1)
     A                                     7'MATURITY DATE'
     A            RRMDAT         7A       24
     A                                      SPACEA(1)
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR LOAN
     A**---------------------------------------------------------------
     A*
     A          R PM400LEC
     A            RRTRN1         3A        2
     A                                      SPACEB(1)
     A            RRCCY1         3A        7
     A            RRAM1R        16A       11
     A            RRT1XT        20A       29
     A            RRDDAT         7A       50
     A***START B07949***
     A  60        RRVAL1        16A       76
     A  60                                92'CHARGES'
     A***END B07949***
     A            RRSETC         3A      109
     A            RRTOTR        19A      113
     A                                      SPACEA(1)
     A            RRT2XT        20A       29
     A            RRVDAT         7A       50
     A                                      SPACEA(1)
     A            RRTRNB         6A       29
     A*>>> 062353 >>>
     A            RRRLDT         7A       50
     A****        RRCHTP         8A       41
     A            RRCHTP         8A       38
     A*<<< 062353 <<<
     A                                      SPACEA(1)
     A                                    29'PAY:'
     A            RRPAYM         2A       33
     A                                    35'/'
     A**Start of change CGL029
     A**********  RRPYAC        12A       36                                                  CGL029
     A            RRPYAC        18A       36
     A**End of change CGL029
     A***********                                    Begin /085867/
     A*********** RRPYNM        20A       49
     A***********                         71'REC:'
     A*********** RRRCVM         2A       75
     A***********                         77'/'
     A*********** RRRCAC        12A       78
     A*********** RRRCNM        20A       91
     A**Start of change CGL029
     A**********  RRPYBR         3A       48                                                  CGL029
     A**********  RRPYNM        20A       52                                                  CGL029
     A**********                          74'REC:'                                            CGL029
     A**********  RRRCVM         2A       78                                                  CGL029
     A**********                          80'/'                                               CGL029
     A**********  RRRCAC        12A       81                                                  CGL029
     A**********  RRRCBR         3A       93                                                  CGL029
     A**********  RRRCNM        20A       97                                                  CGL029
     A            RRPYBR         3A       54
     A            RRPYNM        20A       58
     A                                    80'REC:'
     A            RRRCVM         2A       84
     A                                    86'/'
     A            RRRCAC        18A       87
     A            RRRCBR         3A      105
     A            RRRCNM        20A      109
     A**End of change CGL029
     A***********                                    End   /085867/
     A                                      SPACEA(1)
     A***********                                    Begin /CPM004/
      * Begin /CSD027/
     A**50******  SATCNM         6S       29                                                  CSD027
     A  50        SATCNM         6A       29
      * End /CSD027/
     A  50        SATCRN        20A       36SPACEA(1)
     A***********                                    End   /CPM004/
     A          R PM400LEF
     A                                      SPACEB(1)
     A                                      SPACEA(1)
     A                                     7'LOAN NUMBER'
     A            RRTRNB         6A       24
     A            RRFTYP         3A       33
     A            RRFSEQ         2A       37
     A            RRCHTP         8A       61
     A***********                                    Begin /CPM004/
     A  50                                75'CUSTOMER'
      * Begin /CSD027/
     A**50******  SATCNM         6S       85                                                  CSD027
     A  50        SATCNM         6A       85
      * End /CSD027/
     A  50        SATCRN        20A       93
     A***********                                    End   /CPM004/
     A                                      SPACEA(1)
     A                                     7'LOAN NARRATIVE'
     A            RRT1XT        20A       24
     A                                      SPACEA(1)
     A                                     7'TYPE/SUB TYPE'
     A            RRTRTP         2A       24
     A                                    27'/'
     A            RRTRST         2A       29
     A                                    61'INTEREST'
     A            RRBRT1         2A       82
     A            RRRAI1        14A       85
     A            RRFRQ1         1A      102
     A            RRIPD1         7A      105
     A                                      SPACEA(1)
     A                                     7'AMOUNT'
     A            RRAM1L        16A       24
     A                                    61'CURRENCY'
     A            RRCCY1         3A       82
     A                                      SPACEA(1)
     A                                     7'BRANCH'
     A            RRBRCD         3A       24
     A N23                                  SPACEA(1)
     A*                                                   /*S01408*/
     A*/COPY WNCPYSRC,PM0400P102                          /*S01408*/
     A*                                                   /*S01408*/
     A***********                                    Begin /085867/
     A**23*******                         61'FIDUCIARY NUMBER'
     A**23******* RRFINR         6A       82
     A**23*******                           SPACEA(1)
     A***********                                    End   /085867/
     A  23                                 7'BORROWER'
     A  23        RRBNUM         6A       24
     A  23                                61'COMMISSION'
     A  23        RRCOMC         2A       81
     A  23        RRCFRQ         1A       84
     A  23        RRNCDT         7A       86
     A  23                                  SPACEA(1)
     A                                     7'DEAL DATE'
     A            RRDDAT         7A       24
     A N23                                  SPACEA(1)
     A  23                                61'SETTLE COMMISSION'
     A  23        RRCGST         2A       81
     A**Start of change CGL029
     A**23******  RRCGAD        12A       84                                                  CGL029
     A  23        RRCGAD        18A       84
     A**End of change CGL029
     A  23                                  SPACEA(1)
     A                                     7'VALUE DATE'
     A            RRVDAT         7        24
     A                                    61'PAYMENT DETAILS'
     A            RRPAYM         2A       81
     A**Start of change CGL029
     A**********  RRPYAC        12A       84                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**********  RRPYBR         3A       96                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A            RRPYAC        18A       84
     A            RRPYBR         3A      102
     A**End of change CGL029
     A                                      SPACEA(1)
     A                                     7'MATURITY DATE'
     A            RRMDAT         7A       24
     A                                    61'RECEIPT DETAILS'
     A            RRRCVM         2A       81
     A**Start of change CGL029
     A**********  RRRCAC        12A       84                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**********  RRRCBR         3A       96                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A            RRRCAC        18A       84
     A            RRRCBR         3A      102
     A**End of change CGL029
     A                                      SPACEA(1)
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR LOAN  AMENDMENTS:PI,MR
     A**---------------------------------------------------------------
     A*
     A          R PM400MRC
     A            RRTRN1         3A        2
     A                                      SPACEB(1)
     A            RRCCY1         3A        7
     A            RRAM1R        16A       11
     A            RRT1XT        20A       29
     A            RRVDAT         7A       50
     A                                      SPACEA(1)
     A            RRT2XT        20A       29
     A                                      SPACEA(1)
     A            RRTRNB         6A       29
     A                                    35'/'
     A            RRSQNO         3        36
     A            RRCHTP         8A       41
     A                                      SPACEA(1)
     A***START R10039***
     A********                            29'PAY:'
     A********    RRPAYM         2A       33
     A********                            35'/'
     A********    RRPYAC        12A       36
     A********                              SPACEA(1)
     A  22                                29'PAY:'
     A  22        RRPAYM         2A       33
     A  22                                35'/'
     A**Start of change CGL029
     A**22******  RRPYAC        12A       36                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**22********RRPYNM********20A*******49***************************                       CGL029
     A**22******  RRPYBR         3A       48                                                  CGL029
     A**22******  RRPYNM        20A       52                                                  CGL029
     A  22        RRPYAC        18A       36
     A  22        RRPYBR         3A       54
     A  22        RRPYNM        20A       58
     A**End of change CGL029
     A***********                                    End   /085867/
     A                                      SPACEA(1)
     A***********                                    Begin /085867/
     A**24*******                         71'RCV:'
     A**24******* RRRCVM         2A       75
     A**24*******                         77'/'
     A**24******* RRRCAC        12A       78
     A**24******* RRRCNM        20A       91
     A  24                                74'RCV:'
     A  24        RRRCVM         2A       78
     A  24                                80'/'
     A**Start of change CGL029
     A**24******  RRRCAC        12A       81                                                  CGL029
     A**24******  RRRCBR         3A       93                                                  CGL029
     A**24******  RRRCNM        20A       97                                                  CGL029
     A  24        RRRCAC        18A       81
     A  24        RRRCBR         3A       99
     A  24        RRRCNM        20A      103
     A**End of change CGL029
     A***********                                    End   /085867/
     A                                      SPACEA(1)
     A***START R10039***
     A***********                                    Begin /CPM004/
      * Begin /CSD027/
     A**50******  SATCNM         6S       29                                                  CSD027
     A  50        SATCNM         6A       29
      * End /CSD027/
     A  50        SATCRN        20A       36SPACEA(1)
     A***********                                    End   /CPM004/
     A          R PM400MRF
     A                                      SPACEB(1)
     A                                      SPACEA(1)
     A                                     7'LOAN NUMBER'
     A            RRTRNB         6A       24
     A            RRCHTP         8A       61
     A***********                                    Begin /CPM004/
     A  50                                75'CUSTOMER'
      * Begin /CSD027/
     A**50******  SATCNM         6S       85                                                  CSD027
     A  50        SATCNM         6A       85
      * End /CSD027/
     A  50        SATCRN        20A       93
     A***********                                    End   /CPM004/
     A                                      SPACEA(1)
     A                                     7'LOAN NARRATIVE'
     A            RRT1XT        20A       24
     A                                      SPACEA(1)
     A                                     7'TYPE'
     A            RRTRTP         2A       24
     A                                    61'SEQUENCE'
     A            RRSQNO         3A       82
     A                                      SPACEA(1)
     A                                     7'AMOUNT'
     A            RRAM1L        16A       24
     A                                    61'CURRENCY'
     A            RRCCY1         3A       82
     A                                      SPACEA(1)
     A                                     7'BRANCH'
     A            RRBRCD         3A       24
     A                                      SPACEA(1)
     A                                     7'VALUE DATE'
     A            RRVDAT         7A       24
     A  22                                61'PAYMENT DETAILS'
     A  22        RRPAYM         2A       82
     A**Start of change CGL029
     A**22******  RRPYAC        12A       85                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**22******  RRPYBR         3A       97                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A**24******                          61'RECEIPT DETAILS'                                 CGL029
     A**24******  RRRCVM         2A       82                                                  CGL029
     A**24******  RRRCAC        12A       85                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**24******  RRRCBR         3A       97                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A  22        RRPYAC        18A       85
     A  22        RRPYBR         3A      103
     A  24                                61'RECEIPT DETAILS'
     A  24        RRRCVM         2A       82
     A  24        RRRCAC        18A       85
     A  24        RRRCBR         3A      103
     A**End of change CGL029
     A                                      SPACEA(1)
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR LOAN  AMENDMENTS:SC,CI,SI
     A**---------------------------------------------------------------
     A*
     A          R PM400SIC
     A            RRTRN1         3A        2
     A                                      SPACEB(1)
     A            RRT1XT        20A       29
     A            RRVDAT         7A       50
     A            RRBRT1         2A       58
     A            RRRAI1        14A       61
     A                                      SPACEA(1)
     A            RRT2XT        20A       29
     A                                      SPACEA(1)
     A            RRTRNB         6A       29
     A                                    35'/'
     A            RRSQNO         3        36
     A            RRCHTP         8A       41
     A                                      SPACEA(1)
     A***START R10039***
     A******                              29'PAY:'
     A******      RRPAYM         2A       33
     A******                              35'/'
     A******      RRPYAC        12A       36
     A******                                SPACEA(1)
     A  22                                29'PAY:'
     A  22        RRPAYM         2A       33
     A  22                                35'/'
     A**Start of change CGL029
     A**22******  RRPYAC        12A       36                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A**22******* RRPYNM        20A       49                                                  CGL029
     A**22******  RRPYBR         3A       48                                                  CGL029
     A**22******  RRPYNM        20A       52                                                  CGL029
     A  22        RRPYAC        18A       36
     A  22        RRPYBR         3A       54
     A  22        RRPYNM        20A       58
     A**End of change CGL029
     A***********                                    End   /085867/
     A                                      SPACEA(1)
     A***********                                    Begin /085867/
     A**24*******                         71'RCV:'
     A**24******* RRRCVM         2A       75
     A**24*******                         77'/'
     A**24******* RRRCAC        12A       78
     A**24******* RRRCNM        20A       91
     A  24                                74'RCV:'
     A  24        RRRCVM         2A       78
     A  24                                80'/'
     A**Start of change CGL029
     A**24******  RRRCAC        12A       81                                                  CGL029
     A**24******  RRRCBR         3A       93                                                  CGL029
     A**24******  RRRCNM        20A       97                                                  CGL029
     A  24        RRRCAC        18A       81
     A  24        RRRCBR         3A       99
     A  24        RRRCNM        20A      103
     A**End of change CGL029
     A***********                                    End   /085867/
     A                                      SPACEA(1)
     A***START R10039***
     A***********                                    Begin /CPM004/
      * Begin /CSD027/
     A**50******  SATCNM         6S       29                                                  CSD027
     A  50        SATCNM         6A       29
      * End /CSD027/
     A  50        SATCRN        20A       36SPACEA(1)
     A***********                                    End   /CPM004/
     A          R PM400SIF
     A                                      SPACEB(1)
     A                                      SPACEA(1)
     A                                     7'LOAN NUMBER'
     A            RRTRNB         6A       24
     A            RRCHTP         8A       61
     A***********                                    Begin /CPM004/
     A  50                                75'CUSTOMER'
      * Begin /CSD027/
     A**50******  SATCNM         6S       85                                                  CSD027
     A  50        SATCNM         6A       85
      * End /CSD027/
     A  50        SATCRN        20A       93
     A***********                                    End   /CPM004/
     A                                      SPACEA(1)
     A                                     7'LOAN NARRATIVE'
     A            RRT1XT        20A       24
     A                                      SPACEA(1)
     A                                     7'TYPE'
     A            RRTRTP         2A       24
     A                                    61'SEQUENCE'
     A            RRSQNO         3A       82
     A                                      SPACEA(1)
     A                                     7'INTEREST RATE'
     A            RRBRT1         2A       24
     A            RRRAI1        14A       28
     A                                      SPACEA(1)
     A                                     7'BRANCH'
     A            RRBRCD         3A       24
     A  23                                  SPACEA(1)
     A N23 22                             61'PAYMENT DETAILS'
     A N23 22     RRPAYM         2A       82
     A**Start of change CGL029
     A*N23*22***  RRPYAC        12A       85                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A*N23*22***  RRPYBR         3A       97                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A N23 22     RRPYAC        18A       85
     A N23 22     RRPYBR         3A      103
     A**End of change CGL029
     A N23 24                             61'RECEIPT DETAILS'
     A N23 24     RRRCVM         2A       82
     A**Start of change CGL029
     A*N23*24***  RRRCAC        12A       85                                                  CGL029
     A***********************************************Begin*/085867/****                       CGL029
     A*N23*24***  RRRCBR         3A       97                                                  CGL029
     A***********************************************End***/085867/****                       CGL029
     A N23 24     RRRCAC        18A       85
     A N23 24     RRRCBR         3A      103
     A**End of change CGL029
     A N23                                  SPACEA(1)
     A N22N24                              7'VALUE DATE'
     A                                      SPACEB(1)
     A  22
     AO 24                                 7'VALUE DATE'
     A            RRVDAT         7A       24
     A                                      SPACEA(1)
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR RETAIL
     A**---------------------------------------------------------------
     A*
     A          R PM400REC
     A            RRTRN1         3A        2
     A                                      SPACEB(1)
     A            RRCCY1         3A        7
     A            RRAM1R        16A       11
     A***START R05913***
     A****        RRT1XT        20A       29
     A****        RRDDAT         7A       50
     A            RRT1X1        30A       29
     A***END R05913***
     A            RRSETC         3A      109
     A            RRTOTR        19A      113
     A                                      SPACEA(1)
     A            RRT2XT        20A       29
     A***START R05913***
     A****        RRVDAT         7A       50
     A            RRDDAT         7A       50
     A                                    58'/'
     A            RRVDAT         7A       60
     A***END R05913***
     A                                      SPACEA(1)
     A          R PM400REF
     A                                      SPACEB(1)
     A                                      SPACEA(1)
     A                                     7'ACCOUNT CODE'
     A            RRCNUM         6A       24
     A                                    31'-'
     A            RRCCY1         3        33
     A                                    37'-'
     A**Start of change CGL029
     A**********  RRACOD         4        39
     A**********                          44'-'
     A**********  RRACSQ         2        46
     A            RRACOD        10        39
     A                                    50'-'
     A            RRACSQ         2        52
     A**End of change CGL029
     A                                      SPACEA(1)
     A                                     7'ACCOUNT NAME'
     A***START R05913***
     A********    RRT1XT        20A       24
     A            RRT1X1        30A       24
     A***END R05913***
     A                                      SPACEA(1)
     A                                     7'AMOUNT'
     A            RRAM1L        16A       24
     A                                      SPACEA(1)
     A                                     7'BRANCH'
     A            RRBRCD         3A       24
     A                                      SPACEA(1)
     A                                     7'POSTING DATE'
     A            RRDDAT         7A       24
     A                                      SPACEA(1)
     A                                     7'VALUE DATE'
     A            RRVDAT         7A       24
     A                                      SPACEA(1)
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR FIDUCIARY
     A**---------------------------------------------------------------
     A*
     A          R PM400FIC
     A            RRTRN1         3A        2
     A                                      SPACEB(1)
     A            RRT1XT        20A       29
     A            RRVDAT         7A       50
     A                                      SPACEA(1)
     A            RRT2XT        20A       29
     A                                      SPACEA(1)
     A            RRTRNB         6A       29
     A            RRCHTP         8A       41
     A                                      SPACEA(1)
     A***********                                    Begin /CPM004/
      * Begin /CSD027/
     A**50******  SATCNM         6S       29                                                  CSD027
     A  50        SATCNM         6A       29
      * End /CSD027/
     A  50        SATCRN        20A       36SPACEA(1)
     A***********                                    End   /CPM004/
     A          R PM400FIF
     A                                      SPACEB(1)
     A                                      SPACEA(1)
     A                                     7'LOAN NUMBER'
     A            RRTRNB         6A       24
     A            RRCHTP         8A       61
     A***********                                    Begin /CPM004/
     A  50                                75'CUSTOMER'
      * Begin /CSD027/
     A**50******  SATCNM         6S       85                                                  CSD027
     A  50        SATCNM         6A       85
      * End /CSD027/
     A  50        SATCRN        20A       93
     A***********                                    End   /CPM004/
     A                                      SPACEA(1)
     A                                     7'LOAN NARRATIVE'
     A            RRT1XT        20A       24
     A                                      SPACEA(1)
     A                                     7'TYPE'
     A            RRTRTP         2A       24
     A                                    61'SEQUENCE'
     A            RRSQNO         3A       82
     A                                      SPACEA(1)
     A                                     7'BRANCH'
     A            RRBRCD         3A       24
     A                                      SPACEA(1)
     A                                     7'VALUE DATE'
     A            RRVDAT         7A       24
     A                                      SPACEA(1)
     A*                                              Begin /S01486/
     A**---------------------------------------------------------------
     A*****FORMAT*FOR*NO*DETAILS*TO*REPORT***************************
     A**---------------------------------------------------------------
     A**********
     A**********R PM0400ND
     A**********                        7  4'ACCOUNT OFFICER'
     A**********                            HIGHLIGHT
     A**********                        7 21'*ALL'
     A**********                            HIGHLIGHT
     A**********                        7 29'ALL ACCOUNT OFFICERS'
     A**********                            HIGHLIGHT
     A**********                        9  4'CUSTOMER'
     A**********                            HIGHLIGHT
     A**********                        9 15'*ALL'
     A**********                            HIGHLIGHT
     A**********                        9 23'ALL CUSTOMERS'
     A**********                            HIGHLIGHT
     A**********                       11  4'PORTFOLIO REFERENCE'
     A**********                            HIGHLIGHT
     A**********                       11 26'*ALL'
     A**********                            HIGHLIGHT
     A**********                       11 34'ALL PORTFOLIOS'
     A**********                            HIGHLIGHT
     A**********                       16 52'** NO DETAILS TO REPORT **'
     A**********
     A*                                              End   /S01486/
     A**---------------------------------------------------------------
     A**   FORMAT FOR END  LR
     A**---------------------------------------------------------------
     A*
     A          R PM0400EN
     A                                      SPACEB(3)
     A*                                              Begin /S01486/
     A**********                          55'** END OF REPORT **'
     A                                    46'*** END OF REPORT FOR A/C OFR ***'
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR DATABASE ERROR REFERENCE
     A**---------------------------------------------------------------
     A*
     A          R PM0400DB                  SPACEB(3)
     A                                    32'*** REFERENCE PM0400'
     A                                      SPACEB(3)
     A                                    53'DATABASE ERROR ***'
     A*                                              End   /S01486/
