      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas PM Customer Portfolio Positions Details')
     A*
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Management Module                          *
     A*                                                               *
     A*  PRTF/PM1300P1 - Customer Portfolio Position Report Details   *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. AR1075401          Date 01Jun20               *     
      *  Prev Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027             Date 30Nov05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 S01486             Date 11Aug94               *
     A*                 059465             Date 02Aug93               *
     A*                 R01119             DATE 04DEC90               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  AR1075401 - Increase QANOML and QAOTNM in PMCPOSPD.          *
      *              Adjust the PPNOML to avoid overlap with date.    *
      *              (Child: AR1075402)                               *     
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*  S01486 - Portfolio Management Upgrade to Release 10.         *
     A*  059465 - OUTPUT BETTER TITLE ON REPORT                       *
     A*  R01119 - ONLY DISPLAY AVERAGE PRICES TO FIVE DECIMALS TO     *
     A*            AVOID ROUNDING ERRORS                              *
     A*                                                               *
     A*****************************************************************
     A*                                              Begin /S01486/
     A                                      REF(MFRFL)
     A*                                              End   /S01486/
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR REPORT HEADING
     A**---------------------------------------------------------------
     A*
     A          R HEADER
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A                                      SKIPB(3)
     A*                                              Begin /S01486/
     A***********                          7'REFERENCE'
     A***********                         17'PM1300P1'
     A                                     6'REFERENCE PM1300P1'
     A*                                              End   /S01486/
     A            BJURPT        53        37
     A                                   101'DATE'
     A            BJMRDT         7       106
     A                                   119'PAGE'
     A                                   124PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(2)
     A***START 059465***
     A****                                39'PORTFOLIO MANAGEMENT CUSTOMER -
     A****                                  PORTFOLIO POSITIONS REPORT'
     A                                    39'PORTFOLIO MANAGEMENT UPDATED -
     A                                      POSITIONS REPORT'
     A***END 059465***
     A  10                               110'TRADE BASIS'
     A N10                               110'VALUE BASIS'
     A  12                               122'TRANSFERS'
     A                                   132 ' '
     A                                      SPACEA(1)
     A***START 059465***
     A****                                39'-------------------------------
     A****                                  --------------------------'
     A                                    39'------------------------------
     A                                      ----------------'
     A***END 059465***
     A                                      SPACEA(1)
     A*                                              Begin /S01486/
     A                                    95'BRANCH -'
     A            WWBRCD    R            104REFFLD(BRCA)
     A            WWBRNM    R            108REFFLD(BRNM)
     A                                      SPACEA(2)
     A*                                              End   /S01486/
     A*
     A                                    37'AP'
     A                                    56'AVERAGE'
     A                                    80'FX AP'
     A                                    99'AVERAGE'
     A                                   112'AVERAGE'
     A                                      SPACEA(1)
     A                                     5'DATE'
     A                                    18'NOMINAL'
     A                                    34'NUMERATOR'
     A                                    57'PRICE'
     A                                    78'NUMERATOR'
     A                                   100'FX RATE'
     A                                   112'YLD RATE'
     A                                      SPACEA(1)
     A                                     5'----'
     A                                    18'-------'
     A                                    34'---------'
     A                                    57'-------'
     A                                    78'---------'
     A                                   100'-------'
     A                                   112'--------'
     A                                      SPACEA(2)
     A N11                                 7'CUSTOMER'
      * Begin /CSD027/
     A*N11******  PPCNUM         6  0     17                                                  CSD027
     A N11        PPCNUM         6A       17
      * End /CSD027/
     A            CRNM          20A       24
     A                                      SPACEA(1)
     A N11                                 7'PORTFOLIO'
     A N11        PPPTFR         4        18
     A            PNPTFN        20A       24
     A                                      SPACEA(1)
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR SECURITY HEADING
     A**---------------------------------------------------------------
     A*
     A          R SECHDR
     A                                      SPACEB(1)
     A                                     7'SECURITY'
     A            PPTDSS        10        17
     A            SRPN          20        28
     A                                      SPACEA(2)
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR POSITION LINE
     A**---------------------------------------------------------------
     A*
     A          R POSITN
     A            PPNAR          3         1
     A            PPDATE         7         5
      **Start of change AR1075401
     A**********  PPNOML        16        11                                               AR1075401
     A**********  PPAPNM        21        27                                               AR1075401
     A            PPNOML        18        13
     A            PPAPNM        21        31
      **End of change AR1075401
     A*** START R01119 ***
     A************PPAVPR        21        48
     A            PPAVPR        17        52
     A*** END R01119 ***
     A            PPFXAP        21        69
     A*** START R01119 ***
     A************PPAFXR        21        90
     A            PPAFXR        17        94
     A*** END R01119 ***
     A            PPAYDR         9       111
     A                                      SPACEA(1)
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR MOVEMENT LINE
     A**---------------------------------------------------------------
     A*
     A          R MOVEMT
     A            PPDATE         7         5
      **Start of change AR1075401
     A**********  PPNOML        16        11                                               AR1075401
     A**********  PPAPNM        21        27                                               AR1075401
     A            PPNOML        18        13
     A            PPAPNM        21        31
      **End of change AR1075401
     A*** START R01119 ***
     A************PPAVPR        21        48
     A            PPAVPR        17        52
     A*** END R01119 ***
     A            PPFXAP        21        69
     A*** START R01119 ***
     A************PPAFXR        21        90
     A            PPAFXR        17        94
     A*** END R01119 ***
     A            PPCYRT         9       111
     A            PPCSOA         3       122
     A            PPCSRF         6       126
     A                                      SPACEA(1)
     A**---------------------------------------------------------------
     A**   FORMAT FOR END REPORT
     A**---------------------------------------------------------------
     A*
     A          R END
     A                                      SPACEB(2)
     A*                                              Begin /S01486/
     A***********                         56'** END OF REPORT **'
     A                                    51'*** END OF BRANCH REPORT ***'
     A*                                              End   /S01486/
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR DATABASE ERROR MESSAGE.
     A**---------------------------------------------------------------
     A*
     A*                                              Begin /S01486/
     A          R DBERROR                   SPACEB(3)
     A                                    45'*** REFERENCE PM1300'
     A                                    66'DATABASE ERROR ***'
     A*
     A**********R ERRORAU                   TEXT('DATABASE ERROR MSG')
     A***********                           SKIPB(3)
     A***********                          7'REFERENCE'
     A***********                         17'PM1300P1'
     A*********** BJURPT        53        37
     A***********                        101'DATE'
     A*********** BJMRDT         7       106
     A***********                        119'PAGE'
     A***********                        124PAGNBR
     A***********                           EDTCDE(Z)
     A***********                           SPACEA(2)
     A***********                         39'PORTFOLIO MANAGEMENT CUSTOMER -
     A***********                           PORTFOLIO POSITIONS REPORT'
     A**10*******                        110'TRADE BASIS'
     A***********                           SPACEA(1)
     A*N10*******                        110'VALUE BASIS'
     A***********                           SPACEA(1)
     A***********                         39'-------------------------------
     A***********                           --------------------------'
     A***********                           SPACEA(3)
     A***********
     A***********                         33'DATABASE ERROR'
     A***********                           SKIPB(15)
     A*********** DBASE          3  0     48
     A***********                         52'IN PROGRAM'
     A*********** DBPGM         10        63
     A***********                           SPACEA(3)
     A***********
     A***********                         33'FILE'
     A*********** DBFILE        10        38
     A***********                         48', KEY'
     A*********** DBKEY         29        54
     A***********                           SPACEA(1)
     A*                                              End   /S01486/
     A*
