      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_AU60                                                      *
/*EXI *  TEXT('Midas PM Generate Forward Cashflow Events')
      *****************************************************************
      *                                                               *
      *  Midas - Portfolio Management Module                          *
      *                                                               *
      *  PRTF/PM1380AU - Generate Forward Cashflow Events             *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CPM005             Date 11Jul96               *
      *  LAST AMEND NO. S01124             DATE 15JUL94               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CPM005 - Private Banking Phase 2                             *
      *           Focus Group Changes upgraded to DBA                 *
      *  S01124 - PBFG/7 - NET COMMITMENT BY CURRENCY                 *
      *           PBFG/8 - DISPLAY POSITIONS SPLIT BY CURRENCY        *
      *                                                               *
      *****************************************************************
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR DOCUMENT
     A**---------------------------------------------------------------
     A*
     A*                                              Begin /CPM005/
     A**********R PM1380PP
     A          R PM1380PP                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*                                              End   /CPM005/
     A                                  1  7'REFERENCE'
     A                                  1 17'PM1380AU'
     A            BJURPT        53      1 37
     A                                  1101'DATE'
     A            BJMRDT         7      1106
     A                                  1119'PAGE'
     A                                  1124PAGNBR
     A                                      EDTCDE(Z)
     A                                  3 40'EXTRACT FORWARD CASHFLOW EVENTS +
     A                                      AUDIT REPORT'
     A                                  4 40'--------------------------------+
     A                                      ------------'
     A*
     A*                                              Begin /CPM005/
     A***********                      10  5'NUMBER OF RECORDS OUTPUT TO +
     A***********                            PF/PMEVNTPP:'
     A                                 10  5'NUMBER OF RECORDS OUTPUT TO +
     A                                       PF/PMEVNTPD:'
     A*                                              End   /CPM005/
     A            RRNOR1         5  0  10 55EDTCDE(3)
     A*
     A*                                              Begin /CPM005/
     A***********                      11  5'NUMBER OF RECORDS OUTPUT TO +
     A***********                            PF/PMEVCYPP:'
     A                                 11  5'NUMBER OF RECORDS OUTPUT TO +
     A                                       PF/PMEVCYPD:'
     A*                                              End   /CPM005/
     A            RRNOR2         5  0  11 55EDTCDE(3)
     A*
     A*                                              Begin /CPM005/
     A***********                      15 56'** END OF REPORT **'
     A*                                              End   /CPM005/
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR DATABASE ERROR MESSAGE.
     A**---------------------------------------------------------------
     A*
     A**********                                     Begin /CPM005/
     A**********R ERRORAU                   TEXT('DATABASE ERROR MSG')
     A          R TITLAU                    TEXT('TITLE')
     A**********                                     End   /CPM005/
     A                                      SKIPB(3)
     A                                     7'REFERENCE'
     A                                    17'PM1380AU'
     A            BJURPT        53        37
     A                                   101'DATE'
     A            BJMRDT         7       106
     A                                   119'PAGE'
     A                                   124PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(2)
     A                                    40'EXTRACT FORWARD CASHFLOW EVENTS +
     A                                      AUDIT REPORT'
     A                                      SPACEA(1)
     A                                    40'--------------------------------+
     A                                      ------------'
     A                                      SPACEA(3)
     A*
     A**********                                     Begin /CPM005/
     A          R ERRORAU                   TEXT('DATABASE ERROR MSG')
     A**********                                     End   /CPM005/
     A                                    33'DATABASE ERROR'
     A                                      SKIPB(15)
     A            DBASE          3  0     48
     A                                    52'IN PROGRAM'
     A            DBPGM         10        63
     A                                      SPACEA(3)
     A*
     A                                    33'FILE'
     A*                                              Begin /CPM005/
     A*********** DBFILE        10        38
     A***********                         48', KEY'
     A*********** DBKEY         29        54
     A            DBFILE         8        38
     A                                    46', KEY'
     A            DBKEY         29        52
     A*                                              End   /CPM005/
     A                                      SPACEA(1)
     A*
     A*                                              Begin /CPM005/
     A**---------------------------------------------------------------
     A**  Format for No Details To Report message
     A**---------------------------------------------------------------
     A*
     A          R NODTLS
     A                                    52'*** NO DETAILS TO REPORT ***'
     A                                      SPACEB(3)
     A*                                              End   /CPM005/
