      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD66J                                                    *
/*EXI *  TEXT('Midas Portfolio Performance By Account Officer')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Management Module                      *
     A*                                                               *
     A*  PRTF/PM1700P1 - Portfolio Performance By Account Officer Rept*
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. S01486             DATE 11AUG94               *
     A*  LAST AMEND NO. S01313             DATE                       *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
     A*  S01486 - Portfolio Management Upgrade to Release 10          *
     A*  S01313 - PORTFOLIO PERFORMANCE                               *
     A*                                                               *
     A*****************************************************************
     A*                                              Begin /S01486/
     A                                               REF(MFRFL)
     A*                                              End   /S01486/
     A*
     A          R FORMAT1                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*                                              Begin /S01486/
     A***********                       1  7'REFERENCE PM1700P1'
     A                                  1  6'REFERENCE PM1700P1'
     A*********** BJURPT        53A     1 40
     A            BJURPT        53A     3 40
     A***********                       1101'DATE'
     A                                  3101'DATE'
     A*********** BJMRDT         7A     1106
     A            BJMRDT         7A     3106
     A***********                       1119'PAGE'
     A                                  3119'PAGE'
     A***********                       1124PAGNBR
     A                                  3124PAGNBR
     A                                      EDTCDE(Z)
     A***********                       3 37'PORTFOLIO PERFORMANCE BY ACCOUNT +
     A                                  5 37'PORTFOLIO PERFORMANCE BY ACCOUNT +
     A                                      OFFICER REPORT TO'
     A                                      UNDERLINE
     A*********** RRPERD         7A     3 88
     A            RRPERD        16A     5 76
     A  46                              6 89'DEPT -'
     A  46        PDPCD          4A     6 98
     A  46        PDPNM         30A     6102
     A*
     A  47                              6 89'A/C OFR -'
     A  47        PACOC     R           6 99REFFLD(ACOC)
     A  47        PACNM         30A     6102
     A***********                       4 37'---------------------------------+
     A***********                            -------------------------'
     A***********                       5  1'DEPARTMENT'
     A                                  7  1'DEPARTMENT'
     A                                      HIGHLIGHT
     A*********** RRDPCD         4A     5 17HIGHLIGHT
     A            RRDPCD         4A     7 17HIGHLIGHT
     A*********** RRDPNM        30A     5 22HIGHLIGHT
     A            RRDPNM        30A     7 22HIGHLIGHT
     A***********                       6  1'ACCOUNT OFFICER'
     A                                  8  1'ACCOUNT OFFICER'
     A                                      HIGHLIGHT
     A*********** RRACOC         4A     6 17HIGHLIGHT
     A            RRACOC         4A     8 17HIGHLIGHT
     A*********** RRACON        30A     6 22HIGHLIGHT
     A            RRACON        30A     8 22HIGHLIGHT
     A***********                       8  3'CUSTOMER / PORTFOLIO'
     A                                 10  3'CUSTOMER / PORTFOLIO'
     A*/COPY WNCPYSRC,PM1700P101
     A***********                       8 28'NET/GROSS      PAST YEAR +
     A                                 10 28'NET/GROSS      PAST YEAR +
     A                                      PERFORMANCE            TAX YEAR TO +
     A                                      DATE              SHORT +
     A                                      PERFORMANCE PERIOD'
     A***********                       9 30'OF TAX   START    ABSOLUTE +
     A                                 11 30'OF TAX   START    ABSOLUTE +
     A                                        ANNUALISED     START    ABSOLUTE +
     A                                       ANNUALISED    START    ABSOLUTE +
     A                                       ANNUALISED'
     A*/COPY WNCPYSRC,PM1700P102
     A***********                      10  1'  '
     A                                 12  1'  '
     A*                                              End   /S01486/
     A*
     A          R FORMAT3
     A            RRCUST         6A        1SPACEB(1)
     A            RRCRNM        20A        8SPACEA(1)
     A*
     A          R FORMAT4
     A            RRPTFR         4A        2
     A            RRPTFN        20A        8
     A*/COPY WNCPYSRC,PM1700P103
     A            RRPMNG         1A       33
     A            RRPSPY         7A       38
     A            RRABPY         8A       48
     A            RRANPY         8A       59
     A*/COPY WNCPYSRC,PM1700P104
     A            RRPSTY         7A       71
     A            RRABTY         8A       81
     A            RRANTY         8A       92
     A            RRPSSP         7A      103
     A            RRABSP         8A      113
     A            RRANSP         8A      124SPACEA(1)
     A*                                              Begin /S01486/
     A*
     A          R FORMAT5                   SPACEB(3)
     A                                    25'PORTFOLIO PERFORMANCE +
     A                                      RECONCILIATION (ALL FIGURE+
     A                                      S IN PORTFOLIO CURRENCY)'  +
     A                                      UNDERLINE
     A                                      SPACEA(2)
     A                                     4'CUSTOMER   FOLIO   PERFORMANCE'
     A                                    45'RETURN ON      SUM OF COMPONENTS'
     A                                    82'PORTFOLIO'
     A                                   104'DIFFERENCE'
     A                                   122'POSITION'
     A                                      SPACEA(1)
     A                                    25'PERIOD'
     A                                    41'INVESTED CAPITAL'
     A                                    63 'OF PERFORMANCE      CURRENCY'
     A                                   121 'SETTLEMENT'
     A                                     1' '
     A*
     A          R FORMAT6                   SPACEB(1)
     A            R1CUST         6A        5
     A            R1PTFR         4A       15
     A            R1PFMP         1A       28
     A            R1RTRN        19A       38
     A            R1SCMP        19A       59
     A            R1PTCY         3A       85
     A            R1DIFF        19A       95
     A            R1OTPS         1A      125
     A                                      SPACEA(1)
     A*
     A          R NOEX                      SPACEB(3)
     A                                    47'*** NO EXCEPTIONS TO REPORT ***'
     A*
     A**********R*ENDRPT                    SPACEB(1)
     A          R ENDRPT                    SPACEB(3)
     A***********                         53'*** END OF REPORT ***'
     A  46                                46'*** END OF REPORT FOR +
     A                                      DEPT ***'
     A  47                                46'*** END OF REPORT FOR +
     A                                      A/C OFR ***'
     A*
     A** Database Error
     A*
     A          R DBERREF                   SPACEB(3)
     A                                    32'*** REFERENCE PM1700'
     A                                    53'DATABASE ERROR ***'
     A***********
     A**********R NODET                     SPACEB(3)
     A***********                         49'*** NO DETAILS TO REPORT ***'
     A***********                           SPACEA(2)
     A*                                              End   /S01486/
