      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas PM Net Currency Commitment Report')
      *****************************************************************
      *                                                               *
      *  Midas - Portfolio Management Module                          *
      *                                                               *
      *  PRTF/PM6040P1 - PM Net Currency Commitment Report            *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CPM005             Date 19Jun96               *
      *                 S01124             Date 02Jun94               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CPM005 - Private Banking Phase II                            *
      *           Focus Group Changes Upgraded to DBA                 *
      *  S01124 - PBFG/7 - Net Commitment By Currency                 *
      *           PBFG/8 - Display Positions Split By Currency        *
      *                                                               *
      *****************************************************************
     A*
     A**  FORMAT FOR DOCUMENT HEADER:
      *                                              Begin /CPM005/
     A**********R HEADRE
     A          R HEADRE                    TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *                                              End   /CPM005/
     A                                      SKIPB(3)
     A                                     7'REFERENCE PM6040P1'
     A            BJURPT        53        37
     A                                   101'DATE'
     A            BJMRDT         7       106
     A                                   119'PAGE'
     A                                   124PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(2)
     A                                    49'NET CURRENCY COMMITMENT REPORT'
     A                                      SPACEA(1)
     A                                    49'------------------------------'
     A                                      SPACEA(2)
     A*
     A**  FORMAT FOR ACCOUNT OFFICER:
     A          R ACOFRE
     A                                     3'ACCOUNT OFFICER'
     A            RRACOC         2        21
     A            RRACON        30        24
     A                                      SPACEA(1)
     A                                     3'CUSTOMER'
     A            RRCUST         6        17
     A            RRCSSN        10        24
     A            RRCRNM        20        36
     A                                      SPACEA(1)
     A                                     3'PORTFOLIO '
     A            RRPORT         4        17
     A            RRNARR        20        24
     A                                      SPACEA(1)
     A                                    22'<----------------------------------
     A                                      -- FIGURES IN PORTFOLIO CURRENCY - '
     A            RRCURR         3        91
     A                                    95'-----------------------------------
     A                                      ->'
     A                                      SPACEA(1)
     A                                     2'CURRENCY'
     A                                    30'CURRENT'
     A                                    42'FWD CAPITAL'
     A                                    80'FWD NET'
     A                                   102'FOREX F&O'
     A                                   121'UNHEDGED'
     A                                      SPACEA(1)
     A                                    32'VALUE'
     A                                    44'CHANGES'
     A                                    55'FWD COMMITMENTS'
     A                                    77'COMMITMENT'
     A                                    93'%'
     A                                   105'AMOUNT'
     A                                   121'POSITION'
     A                                      SPACEA(2)
     A*
     A**  FORMAT FOR DETAILS
     A          R DET01
     A            RRCCY          3         2
     A            RRCYNM        14         6
     A            RRCURV        17        21
     A            RRFWCC        17        37
     A            RRFWCO        17        53
     A            RRFWNC        17        71
     A            RRRATE         6        90
     A            RRFFOA        17        95
     A            RRUNPO        17       113
     A                                      SPACEA(1)
     A*
     A**  FORMAT TOTALS
     A          R DETTOT
     A                                    72'---------------'
     A                                    90'-----'
     A                                      SPACEA(1)
     A            RRTOT1        17        71
     A            RRTOT2         6        90
      *                                              Begin /CPM005/
     A**********
     A**  FORMAT FOR NO DETAILS TO REPORT:
     A**********R NOCERE
     A**********                            SPACEB(3)
     A**********                          50'*** NO DETAILS TO REPORT ***'
     A**********                            SPACEA(3)
      *                                              End   /CPM005/
     A*
     A**  FORMAT FOR END OF REPORT:
     A          R ENDRE
     A                                      SPACEB(3)
      *                                              Begin /CPM005/
     A**********                          55'*** END OF REPORT ***'
     A                                    47'*** End of Report for A/C Officer +
     A                                      ***'
      *                                              End   /CPM005/
