      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM15                                                      *
/*EXI *  TEXT('Midas Daylight and overnight limits.')
     A****************************************************************
     A*                                                              *
     A*  Midas - Foreign Exchange (Dealing)
     A*                                                              *
     A*     FXDOLML1 - DAYLIGHT AND OVERNIGHT LIMITS                 *
     A*                                                              *
     A*  (c) Finastra International Limited 2001                     *
     A*                                                              *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*     PREV AMEND NO. XXXXXX    DATE   XX/XXX/XX                *
     A*                                                              *
     A****************************************************************
     A*                                                              *
     A*     MD046248 - Finastra Rebranding                           *
     A*     NEW LOGICAL FILE FOR R10 TREASURY MANAGEMENT             *
     A*      - USED BY TM3170                                        *
     A*     OMITS ALL LOGICALLY DELETED RECORDS                      *
     A*                                                              *
     A****************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A********************************************************************
     A                                      UNIQUE
     A          R FXDOLMP0                  PFILE(FXDOLMPP)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*
     A          K FLCCY
     A*
     A          S FLDLTF                    COMP(NE '*')
     A*
