      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_DL                                                        *
/*EXI *  TEXT('Midas FX Net events extract syslvl cus')
      *****************************************************************
      *                                                               *
      *  Midas - Dealing (FX) Module                                  *
      *                                                               *
      *  PF/FXNEVTL6 - Net Events Extract by Customer                 *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Last Amend No. CDL002  *CREATE    Date 08MAY97               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CDL002 - FX Netting.                                         *
      *                                                               *
      *****************************************************************
      *
     A          R FXNEVTD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A                                      PFILE(FXNEVTPD)
      *
     A            RECI
     A            DLNO
     A            CUNR
     A            ETYP
     A            EDAT
     A            EAMT
     A            ECCY
     A            EBRC
     A            INOI
     A            LCEQ
     A            PTNU
     A            CCTZ
     A            REGC
     A            NAME                      RENAME(CRNM)
     A            TOWN                      RENAME(CTWN)
     A            PASK
     A            CASK
     A            BR                        RENAME(BRCA)
     A            CO                        RENAME(COBB)
      *
     A          K PASK
     A          K PTNU
     A          K CASK
     A          K CUNR
     A          K CO
     A          K BR
      *
