      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas CB Dependency Relations')
      *****************************************************************
      *                                                               *
      *  Midas - Close of Business Module                             *
      *                                                               *
      *  PF/CBDPRLPD - COB Component Dependencies                     *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *   If the attributes of this file are changes then the         *
      *   associated BRIDGE upgrade utilities must also be amended.   *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CCB008             Date 12Oct98               *
      *                 S01459             Date 02Jan98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CCB008 - Synon Closedown Project (CB):                       *
      *           - File removed from CB model.                       *
      *  S01459 - Addition of Midas headerbox.                        *
      *                                                               *
      *****************************************************************
     A          R CBDPRLD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            DIDSON        10          TEXT('Component Depends-on Name')
     A                                      COLHDG('Component' +
     A                                             'Depends-on Name' )
     A            DIDSOS         5          TEXT('Compnt Depends-on Seq No')
     A                                      COLHDG('Compnt' +
     A                                             'Depends-on Seq No' )
     A            DIDRUN         3          TEXT('Comp Depends-on Unique No')
     A                                      COLHDG('Comp Depends-on' +
     A                                             'Unique No' )
     A            DIDDON        10          TEXT('Compnt Depended-on Name')
     A                                      COLHDG('Compnt' +
     A                                             'Depended-on Name' )
     A            DIDDOS         5          TEXT('Compnt Depended-on Seq No')
     A                                      COLHDG('Compnt Depended-on' +
     A                                             'Seq No' )
     A            DICDST         1          TEXT('Component Depended-on Sts')
     A                                      COLHDG('Component' +
     A                                             'Depended-on Sts' )
     A                                      DFT(' ')
     A*=====================================================================
