      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas CB Condition value list')
      *****************************************************************
      *                                                               *
      *  Midas - Synon Delivered Object Module                        *
      *                                                               *
      *  PF/CBVLLSP  - Condition Value List                           *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      *  Last Amend No. CPK014 *CREATE     Date 20Aug01               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CPK014 - Create source for this file (based on Y2VLLSP).     *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R @VALLST                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A*---------------------------------------------------------------------
     A            @@CND          7  0       TEXT('CONDITION SURROGATE FOR CONDI-
     A                                      TION DETAILS')
     A                                      COLHDG('CONDITION' +
     A                                             'SURROGATE')
     A                                      EDTCDE(3)
     A            CNDTYP         3          TEXT('CONDITION TYPE')
     A                                      COLHDG('CONDITION' +
     A                                             'TYPE')
     A            EXTVAL        25          TEXT('EXTERNAL VALUE')
     A                                      COLHDG('EXTERNAL' +
     A                                             'VALUE')
     A            INTVAL        25          TEXT('INTERNAL VALUE')
     A                                      COLHDG('INTERNAL' +
     A                                             'VALUE')
     A            CNDTXT        50          TEXT('CONDITION TEXT')
     A                                      COLHDG('CONDITION TEXT')
     A            USRMOD         1          TEXT('USER MODIFIED')
     A                                      COLHDG('USER' +
     A                                             'MODIFIED')
     A            VALMAP         1          TEXT('VALUE MAPPING IND.')
     A                                      COLHDG('VALUE' +
     A                                             'MAPPING IND.')
