      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas CB User Defined Components File')                *
      *****************************************************************
      *                                                               *
      *  Midas - Close of Business Processing                         *
      *                                                               *
      *  PF/CBUDCFPD   -  CB User Defined Components File             *
      *                                                               *
      *  (c) Finastra International Limited 2022                      *
      *                                                               *
      *  Last Amend No. CCB019  *CREATE    Date 21Sep22               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CCB019 - Close of business Scheduler Enhancement             *
      *           Upgrade IPL089                                      *
      *                                                               *
      *****************************************************************
      *
     A          R CBUDCFPF                  TEXT('(c) Finastra International +
     A                                      Banking Systems Ltd. +
     A                                      2022')
      *
     A            CMSEQN         3          TEXT('Seq number')
     A                                      COLHDG('Seq number')
     A            CMNAME        10          TEXT('Pgm name')
     A                                      COLHDG('Pgm name')
     A            CMLIBR        10          TEXT('Pgm lib')
     A                                      COLHDG('Pgm lib')
     A            CMMQ           1          TEXT('Invoke pgm')
     A                                      COLHDG('Inv pgm')
     A            CMDESC        30          TEXT('Description')
     A                                      COLHDG('Descript')
     A            CMCOBI         1          TEXT('COB or IC')
     A                                      COLHDG('COB or IC')
     A            CMLOCK         1          TEXT('Loc')
     A                                      COLHDG('Loc')
     A            CMFREQ         2          TEXT('Frequency')
     A                                      COLHDG('Frequency')
     A            CMCLOC         1          TEXT('Anchor point')
     A                                      COLHDG('Anchor')
     A            CMITIM         6          TEXT('IC Run time')
     A                                      COLHDG('IC Run time')
     A            CMCFRL        10          TEXT('CF From lib')
     A                                      COLHDG('CF From lib')
     A            CMCFRF        10          TEXT('CF From file')
     A                                      COLHDG('CF From file')
     A            CMCTOL        10          TEXT('CF To lib')
     A                                      COLHDG('CF To lib')
     A            CMCTOF        10          TEXT('CF To File')
     A                                      COLHDG('CF To File')
     A            CMADDR         1          TEXT('Add Replace')
     A                                      COLHDG('Add Replace')
     A            CMIGNO         1          TEXT('Ignor Component')
     A                                      COLHDG('Ignor Component')
     A            CMALER         1          TEXT('Ignore COB error')
     A                                      COLHDG('Ignor COB error')
     A            CMAIMD         1          TEXT('Allow immed run')
     A                                      COLHDG('Allow immed run')
     A            CMPAR0        10          TEXT('Parm 0')
     A                                      COLHDG('Parm 0')
     A            CMPAR1        10          TEXT('Parm 1')
     A                                      COLHDG('Parm 1')
     A            CMPAR2        10          TEXT('Parm 2')
     A                                      COLHDG('Parm 2')
     A            CMPAR3        10          TEXT('Parm 3')
     A                                      COLHDG('Parm 3')
     A            CMPAR4        10          TEXT('Parm 4')
     A                                      COLHDG('Parm 4')
     A            CMPAR5        10          TEXT('Parm 5')
     A                                      COLHDG('Parm 5')
     A            CMPAR6        10          TEXT('Parm 6')
     A                                      COLHDG('Parm 6')
     A            CMPAR7        10          TEXT('Parm 7')
     A                                      COLHDG('Parm 7')
     A            CMPAR8        10          TEXT('Parm 8')
     A                                      COLHDG('Parm 8')
     A            CMPAR9        10          TEXT('Parm 9')
     A                                      COLHDG('Parm 9')
     A            CMSUCC         1          TEXT('Sucessful')
     A                                      COLHDG('Sucessful')
     A            CMLRTI         6          TEXT('Last run time')
     A                                      COLHDG('Last run time')
     A            CMLRDT         6          TEXT('Last run date')
     A                                      COLHDG('Last run date')
     A            CMQUEU        10          TEXT('SPLF Outq')
     A                                      COLHDG('SPLF Outq')
     A            CMQULI        10          TEXT('SPLF Outq lib')
     A                                      COLHDG('SPLF Outq lib')
