      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE FRB Codes File')                              *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/A5FRBCPP - FRB Codes File                                 *
      *                                                               *
      *  (c) Finastra International Limited 2023                      *
      *                                                               *
      *  Last Amend No. BA5015  *CREATE    Date 16Aug23               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  BA5015 - Grading of Loans                                    *
      *                                                               *
      *****************************************************************
     A          R A5FRBCP0                  TEXT('(c) Finastra International +
     A                                      Limited 2023')
      *
     A            GFRBC          5S 0       TEXT('FRB CODE')
     A                                      COLHDG('FRB CODE')
      *
     A            GDESC         30A         TEXT('FRB DESCRIPTION')
     A                                      COLHDG('FRB DESCRIPTION')
