      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MX Customer Posting Summary')
      *****************************************************************
      *                                                               *
      *  Midas - Meridian Export Module                               *
      *                                                               *
      *  PF/MXCPSSPD - Customer Posting Summary                       *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 25Nov05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *  Prev Amend No. 187908             Date 20Dec00               *
      *                 CMX003  *CREATE    Date 05Nov00               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  187908 - Truncation on total field BCEQ in CPYFRMQRYF        *
      *  CMX003 - Meridian Export Enhancements - Phase 2              *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R MXCPSSP0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
      * Begin /CSD027/
     A**********  CNUM      R                                                                 CSD027
     A            CNUM           6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            TRATA          5A         TEXT('Transaction Type')
     A*                                                                 /*Start of 187908*/
     A            TBCEQ         17P 0       TEXT('Total Base Currency Eq. of -
     A                                      Posting Amount')
     A            TCNTPS         7P 0       TEXT('Total Count of Postings')
     A************BCEQ      R               TEXT('Total Base Currency Eq. of -
     A************                          Posting Amount')
     A************CNTPST         5P 0       TEXT('Total Count of Postings')
     A*                                                                 /* End  of 187908*/
