      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MX Saved TTCHGPD')
      *****************************************************************
      *                                                               *
      *  Midas - Meridian Export Module                               *
      *                                                               *
      *  PF/MXSRETCPD - Saved TTCHGPD                                 *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *  Last Amend No. CMX002  *CREATE    Date 26Sep00               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CMX002 - Meridian Export Enhancements - Phase 1              *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R TTCHGPDF                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            RECI      R
     A            TBRI      R
     A            TBID      R
     A            TBTN      R
     A            CCY3      R               REFFLD(CCY1)
     A                                      TEXT('Charge currency')
     A            AMT3      R               REFFLD(AMT1)
     A                                      TEXT('Charge amount')
     A            TTP3      R               REFFLD(TRAT)
     A                                      TEXT('Charge trans. type')
     A            TTGEND         5S 0
                                            TEXT('Transaction Generation Date')
                                            COLHDG('Trans' 'Gen' 'Date')
     A            TTCSOM         5S 0
                                            TEXT('Current Start of Month Date')
                                            COLHDG('Start' 'of Month' 'Date')
     A          K TTGEND
     A          K TBID
     A          K TBTN
