      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FD API forward rates error indicators')
      *****************************************************************
      *                                                               *
      *  Midas - Fixed Data Module                                    *
      *                                                               *
      *  PF/FDEFWRTPD - API Error Definition File for                 *
      *                 Forward Rates                                 *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *  Prev Amend No. CSD006             Date 04Oct00               *
      *                 CAP059             Date 04Oct00               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CAP005  *CREATE    Date 17Oct98               *
      *                                    Date ddmmmyy               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD006 - MDF Changes.                                        *
      *  CAP059 - Conversion of Forward Rates into Modular APIs       *
      *  CAP005 - Conversion of Citydealer Rates upload to use APIs   *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R FDFWRTD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
 
      ** Action code
     A            DDACTNOK  R               TEXT('Action code OK flag')
                                            COLHDG('Action' 'Code' 'OK flag')
                                            REFFLD(OKFLAG)
 
      ** Currency
     A            DDCCYOK   R               TEXT('Currency OK flag')
                                            COLHDG('Ccy' 'OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Days 1
     A            DDDYS1OK  R               TEXT('Days 1 OK flag')
                                            COLHDG('Days' '1 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 1
     A            DDRTE1OK  R               TEXT('Rate 1 OK flag')
                                            COLHDG('Rate' '1 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 2
     A            DDSFW1OK  R               TEXT('Sign 1 OK Flag')
                                            COLHDG('Sign' '1 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 2
     A            DDDYS2OK  R               TEXT('Days 2 OK flag')
                                            COLHDG('Days' '2 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 2
     A            DDRTE2OK  R               TEXT('Rate 2 OK flag')
                                            COLHDG('Rate' '2 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 2
     A            DDSFW2OK  R               TEXT('Sign 2 OK Flag')
                                            COLHDG('Sign' '2 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 3
     A            DDDYS3OK  R               TEXT('Days 3 OK flag')
                                            COLHDG('Days' '3 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 3
     A            DDRTE3OK  R               TEXT('Rate 3 OK flag')
                                            COLHDG('Rate' '3 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      *
      ** Sign 3
     A            DDSFW3OK  R               TEXT('Sign 3 OK Flag')
                                            COLHDG('Sign' '3 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 4
     A            DDDYS4OK  R               TEXT('Days 4 OK flag')
                                            COLHDG('Days' '4 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 4
     A            DDRTE4OK  R               TEXT('Rate 4 OK flag')
                                            COLHDG('Rate' '4 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 4
     A            DDSFW4OK  R               TEXT('Sign 4 OK Flag')
                                            COLHDG('Sign' '4 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 5
     A            DDDYS5OK  R               TEXT('Days 5 OK flag')
                                            COLHDG('Days' '5 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 5
     A            DDRTE5OK  R               TEXT('Rate 5 OK flag')
                                            COLHDG('Rate' '5 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 5
     A            DDSFW5OK  R               TEXT('Sign 5 OK Flag')
                                            COLHDG('Sign' '5 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 6
     A            DDDYS6OK  R               TEXT('Days 6 OK flag')
                                            COLHDG('Days' '6 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 6
     A            DDRTE6OK  R               TEXT('Rate 6 OK flag')
                                            COLHDG('Rate' '6 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 6
     A            DDSFW6OK  R               TEXT('Sign 6 OK Flag')
                                            COLHDG('Sign' '6 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 7
     A            DDDYS7OK  R               TEXT('Days 7 OK flag')
                                            COLHDG('Days' '7 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 7
     A            DDRTE7OK  R               TEXT('Rate 7 OK flag')
                                            COLHDG('Rate' '7 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 7
     A            DDSFW7OK  R               TEXT('Sign 7 OK Flag')
                                            COLHDG('Sign' '7 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 8
     A            DDDYS8OK  R               TEXT('Days 8 OK flag')
                                            COLHDG('Days' '8 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 8
     A            DDRTE8OK  R               TEXT('Rate 8 OK flag')
                                            COLHDG('Rate' '8 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 8
     A            DDSFW8OK  R               TEXT('Sign 8 OK Flag')
                                            COLHDG('Sign' '8 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 9
     A            DDDYS9OK  R               TEXT('Days 9 OK flag')
                                            COLHDG('Days' '9 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 9
     A            DDRTE9OK  R               TEXT('Rate 9 OK flag')
                                            COLHDG('Rate' '9 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 9
     A            DDSFW9OK  R               TEXT('Sign 9 OK Flag')
                                            COLHDG('Sign' '9 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 10
     A            DDDY10OK  R               TEXT('Days 10 OK flag')
                                            COLHDG('Days' '10 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 10
     A            DDRT10OK  R               TEXT('Rate 10 OK flag')
                                            COLHDG('Rate' '10 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 10
     A            DDSF10OK  R               TEXT('Sign 10 OK Flag')
                                            COLHDG('Sign' '10 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 11
     A            DDDY11OK  R               TEXT('Days 11 OK flag')
                                            COLHDG('Days' '11 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 11
     A            DDRT11OK  R               TEXT('Rate 11 OK flag')
                                            COLHDG('Rate' '11 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 11
     A            DDSF11OK  R               TEXT('Sign 11 OK Flag')
                                            COLHDG('Sign' '11 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 12
     A            DDDY12OK  R               TEXT('Days 12 OK flag')
                                            COLHDG('Days' '12 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 12
     A            DDRT12OK  R               TEXT('Rate 12 OK flag')
                                            COLHDG('Rate' '12 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 12
     A            DDSF12OK  R               TEXT('Sign 12 OK Flag')
                                            COLHDG('Sign' '12 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 13
     A            DDDY13OK  R               TEXT('Days 13 OK flag')
                                            COLHDG('Days' '13 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 13
     A            DDRT13OK  R               TEXT('Rate 13 OK flag')
                                            COLHDG('Rate' '13 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 13
     A            DDSF13OK  R               TEXT('Sign 13 OK Flag')
                                            COLHDG('Sign' '13 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 14
     A            DDDY14OK  R               TEXT('Days 14 OK flag')
                                            COLHDG('Days' '14 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 14
     A            DDRT14OK  R               TEXT('Rate 14 OK flag')
                                            COLHDG('Rate' '14 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 14
     A            DDSF14OK  R               TEXT('Sign 14 OK Flag')
                                            COLHDG('Sign' '14 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 15
     A            DDDY15OK  R               TEXT('Days 15 OK flag')
                                            COLHDG('Days' '15 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 15
     A            DDRT15OK  R               TEXT('Rate 15 OK flag')
                                            COLHDG('Rate' '15 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 15
     A            DDSF15OK  R               TEXT('Sign 15 OK Flag')
                                            COLHDG('Sign' '15 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 16
     A            DDDY16OK  R               TEXT('Days 16 OK flag')
                                            COLHDG('Days' '16 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 16
     A            DDRT16OK  R               TEXT('Rate 16 OK flag')
                                            COLHDG('Rate' '16 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 16
     A            DDSF16OK  R               TEXT('Sign 16 OK Flag')
                                            COLHDG('Sign' '16 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 17
     A            DDDY17OK  R               TEXT('Days 17 OK flag')
                                            COLHDG('Days' '17 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 17
     A            DDRT17OK  R               TEXT('Rate 17 OK flag')
                                            COLHDG('Rate' '17 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 17
     A            DDSF17OK  R               TEXT('Sign 17 OK Flag')
                                            COLHDG('Sign' '17 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 18
     A            DDDY18OK  R               TEXT('Days 18 OK flag')
                                            COLHDG('Days' '18 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 18
     A            DDRT18OK  R               TEXT('Rate 18 OK flag')
                                            COLHDG('Rate' '18 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 18
     A            DDSF18OK  R               TEXT('Sign 18 OK Flag')
                                            COLHDG('Sign' '18 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 19
     A            DDDY19OK  R               TEXT('Days 19 OK flag')
                                            COLHDG('Days' '19 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 19
     A            DDRT19OK  R               TEXT('Rate 19 OK flag')
                                            COLHDG('Rate' '19 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 19
     A            DDSF19OK  R               TEXT('Sign 19 OK Flag')
                                            COLHDG('Sign' '19 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 20
     A            DDDY20OK  R               TEXT('Days 20 OK flag')
                                            COLHDG('Days' '20 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 20
     A            DDRT20OK  R               TEXT('Rate 20 OK flag')
                                            COLHDG('Rate' '20 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 20
     A            DDSF20OK  R               TEXT('Sign 20 OK Flag')
                                            COLHDG('Sign' '20 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 21
     A            DDDY21OK  R               TEXT('Days 21 OK flag')
                                            COLHDG('Days' '21 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 21
     A            DDRT21OK  R               TEXT('Rate 21 OK flag')
                                            COLHDG('Rate' '21 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 21
     A            DDSF21OK  R               TEXT('Sign 21 OK Flag')
                                            COLHDG('Sign' '21 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 22
     A            DDDY22OK  R               TEXT('Days 22 OK flag')
                                            COLHDG('Days' '22 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 22
     A            DDRT22OK  R               TEXT('Rate 22 OK flag')
                                            COLHDG('Rate' '22 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 22
     A            DDSF22OK  R               TEXT('Sign 22 OK Flag')
                                            COLHDG('Sign' '22 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 23
     A            DDDY23OK  R               TEXT('Days 23 OK flag')
                                            COLHDG('Days' '23 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 23
     A            DDRT23OK  R               TEXT('Rate 23 OK flag')
                                            COLHDG('Rate' '23 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 23
     A            DDSF23OK  R               TEXT('Sign 23 OK Flag')
                                            COLHDG('Sign' '23 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 24
     A            DDDY24OK  R               TEXT('Days 24 OK flag')
                                            COLHDG('Days' '24 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 24
     A            DDRT24OK  R               TEXT('Rate 24 OK flag')
                                            COLHDG('Rate' '24 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 24
     A            DDSF24OK  R               TEXT('Sign 24 OK Flag')
                                            COLHDG('Sign' '24 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
 
      ** Days 25
     A            DDDY25OK  R               TEXT('Days 25 OK flag')
                                            COLHDG('Days' '25 OK' 'flag')
                                            REFFLD(OKFLAG)
 
      ** Rate 25
     A            DDRT25OK  R               TEXT('Rate 25 OK flag')
                                            COLHDG('Rate' '25 OK' 'flag')
                                            REFFLD(OKFLAG)
      *
      *                                              Begin /CAP059/
      ** Sign 25
     A            DDSF25OK  R               TEXT('Sign 25 OK Flag')
                                            COLHDG('Sign' '25 OK' 'Flag')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP059/
      *                                              Begin /CSD006/
      ** Data Feed Request Identifier
     A            DDDFRIOK       1          TEXT('Data Feed Request Id')
                                            COLHDG('Data Feed' 'Request Id' +
                                                   'OK')
      ** Data Feed Timestamp OK
     A            DDDFTSOK       1          TEXT('Data Feed Timestamp OK')
                                            COLHDG('Data Feed' 'Timestamp' +
                                                   'OK')
      *                                              End   /CSD006/
