      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas IBLC 2002 A/C Keys for Lending')                 *
      *****************************************************************
      *                                                               *
      *  Midas - IBLC 2002 Module                                     *
      *                                                               *
      *  LF/ILLEKEY  - Lending Account Keys Loans/Facilities/Fees     *
      *                                                               *
      *  (c) Finastra International Limited 2005                      *
      *                                                               *
      *  Last Amend No. CSD103             Date 10Aug20               *
      *  Prev Amend No. MD046248           Date 27Oct17               *
      *                 AR1056323          Date 14Nov12               *
      *                 CLE134             Date 01Aug12               *
      *                 CLE148             Date 23Jul12               *
      *                 CER049             Date 06Dec10               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *                 CPK027             Date 18Apr07               *
      *                 243499             Date 09Nov06               *
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CLE042             Date 06Sep05               *
      *                 CER001             Date 25Apr05               *
      *                 ULX043             Date 11Sep01               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD103 - LIBOR Deregulation - Common Layer/Standing Data     *
      *           (Recompile)                                         *
      *  MD046248 - Finastra Rebranding                               *
      *  AR1056323 - Revert back changes of CLE134 for LKEY1DP and    *
      *              LKEYFED (Recompile)                              *
      *  CLE134 - Past Due Call Loan Processing (Recompile)           *
      *  CLE148 - Alpha Loan Reference (Recompile)                    *
      *  CER049 - Stamp Tax (Recompile)                               *
      *  CPK027 - Error in 243499 - LKOLNO should now be 6A           *
      *  243499 - Recompile due to added field in LKEYFED             *
      *  CLE042 - Extended Loan Sub Type (Recompile)                  *
      *  CER001 - LUX Upgrade to MidasPlus (Recompile only)           *
      *  ULX043 - IBLC 2002 Reporting                                 *
      *                                                               *
      *****************************************************************
      *
     A          R LKEY1DPF                  PFILE(LKEY1DP)
     A                                      TEXT('(C) Finastra +
     A                                      International Banking +
     A                                      Limited 2005')
      *
      ***  KEY List
      *
     A          K BRCA
     A          K ECCY
     A          K AKEY
      *
     A          R LKEY2DPF                  PFILE(LKEY2DP)
     A                                      TEXT('(C) Finastra +
     A                                      International Banking +
     A                                      Limited 2005')
      *
      ***  KEY List
      *
     A          K BRCA
     A          K ECCY
     A          K AKEY
      *
     A          R LKEYFEDF                  PFILE(LKEYFED)
     A                                      TEXT('(C) Finastra +
     A                                      International Banking +
     A                                      Limited 2005')
      *
      ***  KEY List
      *
     A          K LKBRCD
     A          K LKECCY
     A          K LKAKEY
      *
