      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IMMXM32                                                   *
/*EXI *  TEXT('Midas FF Comms & Charges Reversal File')
     A*****************************************************************
     A*                                                               *
     A*  Midas   FINANCIAL FUTURES AND OPTIONS MODULE                 *
     A*                                                               *
     A*  LF/CCREVL0 -  Comms and Charges Reversal File                *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. 222165             Date 26May06               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  222165 - Fix to avoid reversal of comms & charges twice.     *
     A*                                                               *
     A*****************************************************************
     A                                      UNIQUE
     A*
     A          R CCREVPDF                  PFILE(CCREVPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
     A          K TRNR
