      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas FF Close out details for MIDAS/Q')
     A*****************************************************************
     A*                                                               *
     A*  Midas   FINANCIAL FUTURES AND OPTIONS MODULE
     A*                                                               *
     A*  LF/CLOSTTM  -  CLOSE OUT TRANSACTIONS (MIDASQ)               *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. E03643             Date 22Feb93               *
      *                 000000             Date DDMmmYY               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     A*    E03643 - RECOMPILE                                         *
     A*           - Commissions, though calculated correctly on       *
     A*           - a trade basis for accounting purposes are not     *
     A*           - reported correctly by individual closeout.        *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A          R CLOSTTF                   PFILE(CLOSTT)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A          K TNBR
     A          K CLON
