      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas FF Jrnl images - user Defined entries')
     A*****************************************************************
     A*                                                               *
     A*  Midas   FINANCIAL FUTURES AND OPTIONS MODULE
     A*                                                               *
     A*  LF/JRNIM1  -  JOURNAL IMAGES : USER DEFINED ENTRIES  ( ER )  *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. 212082             Date  17Jun03              *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. E00000             Date  DDMMMYY              *
      *---------------------------------------------------------------*
      *  212082 - JRNIMD Changed - LF Recompiled                      *
      *                                                               *
     A*****************************************************************
     A          R QJORDJE                   PFILE(JRNIMD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K JOSEQN                    DESCEND
     A          S JOCODE                    CMP(EQ 'U')
