      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXI *  TEXT('Midas FF Cust/broker positions')                       *
/*EXS *  LF_IMMXM32                                                   *
/*EXI *  DTAMBRS(*ALL)                                                *
      *****************************************************************
      *                                                               *
      *  Midas   FINANCIAL FUTURES AND OPTIONS MODULE                 *
      *                                                               *
      *  LF/POSTNC  -  CUSTOMER/BROKER POSITIONS                      *
      *                                                               *
      *  (c) Finastra International Limited 2017                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *                 MD042652           DATE  06Feb17              *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  MD042652  -  FFC0800 FAILED IN COB                           *
      *                                                               *
      ********************************************************************
     A          R POSTNCDF                  PFILE(POSTNCD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2017')
     A          K CBCD
