      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas FF Cust/broker pos. requiring margin')
     A*****************************************************************
     A*                                                               *
     A*  Midas   FINANCIAL FUTURES AND OPTIONS MODULE                 *
     A*                                                               *
     A*  LF/POSTNC5  -  CUSTOMER/BROKER POSITIONS REQUIRING MARGIN    *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 Patch D ---------------------------------------*
      * Midas DBA 3.01 -----------------------------------------------*
      *  Prev Amend No. 163444             Date 08OCT99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*                 CFF004             Date 11SEP96               *
     A*                 FUJI-FF0021        DATE  28AUG92              *
     A*                                                               *
     A*---------------------------------------------------------------*
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*  163444  -  Re-compiled over changed physical file.           *
     A*  CFF004  -  Inc. in size of Price Fields - RECOMPILE ONLY.    *
     A*  FUJI-FF0021 - NEW INITIAL MARGIN RECONCILIATION REPORT       *
     A*                                                               *
     A*****************************************************************
     A          R POSTNCDF                  PFILE(POSTNCD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*
     A          K BRCA
     A          K ISCY
     A          K CBCD
     A          K ISTT
     A          K YRNO
     A          K MTHN
     A          K PCAL
     A          K STRP
     A          S TOTM                      CMP(NE 0)
