      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_RB                                                        *
/*EXI *  TEXT('Midas FF Market Prices                 ALL')
     A*****************************************************************
     A*                                                               *
     A*  Midas   FINANCIAL FUTURES AND OPTIONS MODULE
     A*                                                               *
     A*  LF/PRICS1  -  MARKET PRICES                                  *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CAP183             Date 05Jan06               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  Prev Amend No.  CFF004            DATE  11SEP96              *
     A*                  E20526            DATE  03MAY90              *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  CAP183 - Conversion of Market Prices Input into modular      *
      *           structure to use APIs (Recompile)                   *
     A*  CFF004  -  Inc. in size of Price Fields - RECOMPILE ONLY.    *
     A*  E20526  -  RECOMPILED OVER CHANGED FILE PRICSD               *
     A*                                                               *
     A*****************************************************************
     A          R PRICSDF                   PFILE(PRICSD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K ISTT
     A          K YRNO
     A          K MTHN
     A          K PCAL
     A          K STRP
