      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas FF Transaction Settlement Details')
     A*****************************************************************
     A*                                                               *
     A*  Midas   FINANCIAL FUTURES AND OPTIONS MODULE                 *
     A*                                                               *
     A*  LF/TRSET2  -  TRANSACTION SETTLEMENT DETAILS                 *
     A*                                                               *
     A*  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
     A*  Last Amend No. CGP001             Date 23May03               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
     A*  CGP001 - Global Processing (Recompile)                       *
     A*                                                               *
     A*****************************************************************
     A          R TRSETDF                   PFILE(TRSETD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K TNBR
     A          S TNBR                      CMP(GT 0)
