      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas RE Cheque book details')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Retail Module                                    *
     A*                                                               *
     A*  PF/CHQBKPD  - Cheque Book Details                            *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CRE019             Date 15Mar04               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CRT001  *CREATE    Date 28Feb95               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CRE019 - Cheque Processing and Maintenance                   *
     A*  CRT001 - Retail Teller System                                *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
      *                                                               *
     A                                      REF(MFRFL)
     A          R CHQBKPDF                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *                                                                  *
     A            RECID     R
     A            ACNO      R
     A            GCQI      R
     A            SCQN      R               REFFLD(CQNR)
     A                                      TEXT('Starting Cheque No.')
     A                                      COLHDG('Starting' +
     A                                             'Cheque No.')
     A            NOCQ      R
     A            ECQN      R               REFFLD(CQNR)
     A                                      TEXT('Ending Cheque No.')
     A                                      COLHDG('Ending' +
     A                                             'Cheque No.')
     A            DISS      R               REFFLD(ISDT)
     A                                      TEXT('Date Issued')
     A                                      COLHDG('Date ' +
     A                                             'Issd ')
     A            DCOL      R               REFFLD(ISDT)
     A                                      TEXT('Date Collected')
     A                                      COLHDG('Date ' +
     A                                             'Collct ')
     A            BRCA      R
     A            LCD       R
     A            CHTP      R
     A            TNLU      R
     A            CQPS      R
     A**Start of change CRE019
     A            CHAM          13P 0       TEXT('Charge Amount')
     A                                      COLHDG('Charge Amount')
     A            CHAC          10S 0       TEXT('Charge Account')
     A                                      COLHDG('Charge Account')
     A            OUTR           1A         TEXT('Out of Range Ind')
     A                                      COLHDG('Out of Range Ind')
     A            OEDT           5P 0       TEXT('Original Entry Date')
     A                                      COLHDG('Original Entry Date')
     A            CHTT           5S 0       TEXT('Charge Trans. Type')
     A                                      COLHDG('Charge Trans. Type')
     A**End of change CRE019
      *
     A          K ACNO
     A          K SCQN
      *
      ********************************************************************
