      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas RE Bureau De Change Rates Control Table')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Retail Module                                        *
     A*                                                               *
     A*  PF/REBDCCPD - Bureau De Change Control Table                 *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CRT001  *CREATE    Date 28Feb95               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     A*  CRT001 - Retail Teller System.                               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A*
     A                                      REF(MFRFL)
     A*
     A          R REBDCCD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A
     A            FCODE     R               REFFLD(FNCD)
     A                                      TEXT('Function code')
     A                                      COLHDG('Function code')
     A            NAC       R               REFFLD(ZZ002)
     A                                      TEXT('Non account currency')
     A                                      COLHDG('Non account currency')
     A            ACC       R               REFFLD(ZZ002)
     A                                      TEXT('Account currency')
     A                                      COLHDG('Account currency')
     A*
     A          K FCODE
