/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas RE CS Bulk Cheques Details File')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Retail Module                                        *
     A*                                                               *
     A*  PF/RECIBDPD - Bulk Cheques Details File                      *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
     A*  LAST AMEND NO. DDB026  *CREATE    DATE 25Dec03               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  DDB026 - Bulk Cheques                                        *
     A*                                                               *
     A*****************************************************************
     A*
     A                                      REF(MFRFL)
     A          R RECIBDD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
      *
     A            ICREF         12A
     A                                      TEXT('Cashier Ref')
     A                                      COLHDG('Cashier' +
     A                                             'Ref')
     A            IMSTY          4A
     A                                      TEXT('Message Type')
     A                                      COLHDG('Message' +
     A                                             'Type')
     A            IBRCA          3A
     A                                      TEXT('Branch')
     A                                      COLHDG('Branch')
     A            IACCT         13A
     A                                      TEXT('Account')
     A                                      COLHDG('Account')
     A            IBREF          3A
     A                                      TEXT('Batch Ref')
     A                                      COLHDG('Batch' +
     A                                             'Ref')
     A            ITRCD          3A
     A                                      TEXT('Transaction Code')
     A                                      COLHDG('Transaction' +
     A                                             'Code')
     A            ISPCD          3A
     A                                      TEXT('SP Code')
     A                                      COLHDG('SP Code')
     A            ICCCY          3A
     A                                      TEXT('Cheque CCY')
     A                                      COLHDG('Cheque' +
     A                                             'CCY')
     A            IACCY          3A
     A                                      TEXT('Account CCY')
     A                                      COLHDG('Account' +
     A                                             'CCY')
     A            IAMNT         15A
     A                                      TEXT('Amount')
     A                                      COLHDG('Amount')
     A            IVLDT          6A
     A                                      TEXT('Value Date')
     A                                      COLHDG('Value' +
     A                                             'Date')
     A            IREF          15A
     A                                      TEXT('Reference')
     A                                      COLHDG('Reference')
     A            INARR         35A
     A                                      TEXT('Narrative')
     A                                      COLHDG('Narrative')
     A            INCHQ          2A
     A                                      TEXT('No Chqs')
     A                                      COLHDG('No Chqs')
     A            ITRID          4A
     A                                      TEXT('Tran ID')
     A                                      COLHDG('Tran' +
     A                                             'ID')
     A            ICHCY          3A
     A                                      TEXT('Charge CCY')
     A                                      COLHDG('Charge' +
     A                                             'CCY')
     A            ICHAM         12A
     A                                      TEXT('Charge Amount')
     A                                      COLHDG('Charge' +
     A                                             'Amount')
     A            FILLER        43A
      *
     A            IMSGD       5110A
     A                                      TEXT('Message Details')
     A                                      COLHDG('Message' +
     A                                             'Details')
     A            ITLID          3A
     A                                      TEXT('Teller ID')
     A                                      COLHDG('Teller ID')
