      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_NM                                                        *
/*EXI *  TEXT('Midas RE Cash Management Sweeps Requested')
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  PF/RECMSRPD - Cash Management Sweeps Requested               *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2002            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CRE008  *CREATE    Date 19Feb02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CRE008 - Cash Management                                     *
      *                                                               *
      *****************************************************************
      *
     A          R RECMSRD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2002')
      *
     A            SRHIER         9S 0       TEXT('Hierarchy ID')
     A                                      COLHDG('Hierarchy' +
     A                                             'ID')
     A            SRHISN        10A         TEXT('Hierarchy Shortname')
     A                                      COLHDG('Hierarchy' +
     A                                             'Shortname')
     A            SRLINK         9S 0       TEXT('Link ID')
     A                                      COLHDG('Link' +
     A                                             'ID')
     A            SRREAS        50A         TEXT('Reason for Sweep')
     A            SRUSR         10A         TEXT('User')
     A            SRTIME         6S 0       TEXT('Time')
