      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_15                                                        *
/*EXI *  TEXT('Midas RE Security Password file - Trailer')
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  PF/REOSECPT - Security Password - Trailer                    *
      *                                                               *
      *  (c) Finastra International Limited 2005                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CRE023  *CREATE    Date 29Jul05               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CRE023 - 2 O'clock Flag Upgrade to MidasPlus                 *
      *                                                               *
      *****************************************************************
     A          R REOSECT0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2005')
      *---------------------------------------------------------------------
     A            GRECI          1A         TEXT('Record ID')
     A            GTKEY          8A         TEXT('Tkey')
     A            GNORE          5P         TEXT('No. of recs.')
     A            GZA03         18A         TEXT('Spare ')
      *---------------------------------------------------------------------
