      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas RE Reverse Sweeping/Target Balancing Details')
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  PF/RERSTDPD - Reverse Sweeping/Target Balancing - Details    *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2002            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      *  Prev Amend No. CGL029             Date 01Sep03               *
      *                 CRE008  *CREATE    Date 19Feb02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CRE008 - Cash Management                                     *
      *                                                               *
      *****************************************************************
      *
      * Start of change CGL029
     A                                      REF(MFRFL)
      * End of change CGL029
     A          R RERSTDD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2002')
      *
     A            RDHIER         9S 0       TEXT('Hierarchy ID')
     A                                      COLHDG('Hierarchy ID')
     A            RDLINK         9S 0       TEXT('Link ID')
     A                                      COLHDG('Link ID')
     A            RDPRCD         5P 0       TEXT('Processing Date')
     A                                      COLHDG('Processing' +
     A                                             'Date')
     A            RDSNUM         2S 0       TEXT('Sequence Number')
     A                                      COLHDG('Sequence Number')
     A            RDHISN        10A         TEXT('Hierarchy Shortname')
     A                                      COLHDG('Hierarchy' +
     A                                             'Shortname')
     A            RDCBRC         3A         TEXT('Child A/c Branch Code')
     A                                      COLHDG('Child A/c' +
     A                                             'Branch Code')
      * Begin /CSD027/
     A**********  RDCCUS         6S 0       TEXT('Child A/c Customer No.')                    CSD027
     A            RDCCUS         6A         TEXT('Child A/c Customer No.')
      * End /CSD027/
     A                                      COLHDG('Child A/c' +
     A                                             'Cust No.')
     A            RDCCCY         3A         TEXT('Child A/c Currency')
     A                                      COLHDG('Child A/c' +
     A                                             'Ccy')
     A**Start of change CGL029
     A**********  RDCACD         4S 0       TEXT('Child A/c Account Code')                    CGL029
     A**********                            COLHDG('Child A/c' +                              CGL029
     A**********                                   'A/c Code')                                CGL029
     A            QQCACD    R               REFFLD(ACODQQ)
     A**End of change CGL029
     A            RDCASN         2S 0       TEXT('Child A/c Sequence No.')
     A                                      COLHDG('Child A/c' +
     A                                             'Seq No.')
     A            RDCCAT         1A         TEXT('Child A/c Category')
     A                                      COLHDG('Child A/c' +
     A                                             'Category')
     A            RDPBRC         3A         TEXT('Parent A/c Branch Code')
     A                                      COLHDG('Parent A/c' +
     A                                             'Branch Code')
      * Begin /CSD027/
     A**********  RDPCUS         6S 0       TEXT('Parent A/c Customer No.')                   CSD027
     A            RDPCUS         6A         TEXT('Parent A/c Customer No.')
      * End /CSD027/
     A                                      COLHDG('Parent A/c' +
     A                                             'Cust No.')
     A            RDPCCY         3A         TEXT('Parent A/c Currency')
     A                                      COLHDG('Parent A/c' +
     A                                             'Ccy')
     A**Start of change CGL029
     A**********  RDPACD         4S 0       TEXT('Parent A/c Account Code')                   CGL029
     A**********                            COLHDG('Parent A/c' +                             CGL029
     A**********                                   'A/c Code')                                CGL029
     A            QQPACD    R               REFFLD(ACODQQ)
     A**End of change CGL029
     A            RDPASN         2S 0       TEXT('Parent A/c Sequence No.')
     A                                      COLHDG('Parent A/c' +
     A                                             'Seq No.')
     A            RDSPTD         1A         TEXT('Shadow Posted')
     A                                      COLHDG('Shadow Posted')
      *
     A**Start of change CGL029
     A            RDCACD    R               REFFLD(ACOD)
     A                                      TEXT('Child A/c Account Code')
     A                                      COLHDG('Child A/c' +
     A                                             'A/c Code')
     A            RDPACD    R               REFFLD(ACOD)
     A                                      TEXT('Parent A/c Account Code')
     A                                      COLHDG('Parent A/c' +
     A                                             'A/c Code')
     A**End of change CGL029
