      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas RE Reverse Sweeping/Target Balancing Items')
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  PF/RERSTIPD - Reverse Sweeping/Target Balancing - Items      *
      *                                                               *
      *  (c) Finastra International Limited 2002                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CRE008  *CREATE    Date 19Feb02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CRE008 - Cash Management                                     *
      *                                                               *
      *****************************************************************
      *
     A          R RERSTID0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2002')
      *
     A            RIHIER         9S 0       TEXT('Hierarchy ID')
     A                                      COLHDG('Hierarchy ID')
     A            RILINK         9S 0       TEXT('Link ID')
     A                                      COLHDG('Link ID')
     A            RIPRCD         5P 0       TEXT('Processing Date')
     A                                      COLHDG('Processing Date')
     A            RISNUM         2S 0       TEXT('Sequence Number')
     A                                      COLHDG('Sequence Number')
     A            RIXRFN        10S 0       TEXT('Extension File +
     A                                           Ref. No.')
     A                                      COLHDG('Extension File' +
     A                                             'Ref. No.')
      *
