      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas IBLC 2002 Standing Orders Extended File')
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  PF/RESOX1PD   - IBLC Standing Orders Extended File Layout    *
      *                                                               *
      *  (c) Finastra International Limited 2005                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CER001  *CREATE    Date 25Apr05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CER001 - LUX Upgrade to MidasPlus                            *
      *                                                               *
      *****************************************************************
      *
     A                                      UNIQUE
      *
     A          R STANDSDL                  TEXT('(c) Finastra International +
     A                                      Limited 2005')
      *
     A            SOSTOR         5S 0       TEXT('Standing Order Ref Number')
     A                                      COLHDG('Standing' 'Order Ref' 'Numb-
     A                                      er')
      *
     A            SODOPC         3S 0       TEXT('Debit IBLC Operation Code')
     A                                      COLHDG('Debit IBLC' 'Operation' 'Co-
                                            de')
      *
     A            SODCOC         2A         TEXT('Debit Country Code')
     A                                      COLHDG('Debit' 'Country' 'Code')
      *
     A            SODIFC         2A         TEXT('Debit Identification Code')
     A                                      COLHDG('Debit' 'Identification' 'Co-
                                            de')
      *
     A            SODIDE         9A         TEXT('Debit Identification')
     A                                      COLHDG('Debit' 'Identification')
      *
     A            SOCOPC         3S 0       TEXT('Credit IBLC Operation Code')
     A                                      COLHDG('Credit IBLC' 'Operation' 'C-
                                            ode')
      *
     A            SOCCOC         2A         TEXT('Credit Country Code')
     A                                      COLHDG('Credit' 'Country' 'Code')
      *
     A            SOCIFC         2A         TEXT('Credit Identification Code')
     A                                      COLHDG('Credit' 'Identification' 'C-
                                            ode')
      *
     A            SOCIDE         9A         TEXT('Credit Identification')
     A                                      COLHDG('Credit' 'Identification')
      *
      ***  Key List
      *
     A          K SOSTOR
      *
