/*STD *: PFBASE                                                     : *
/*EXI *  TEXT('Midas RE T&N Accounts - STRAN format            DP')
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  PF/RESTR1PD - STRAN format 1                                 *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2009            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      *  Last Amend No. CRE015  *CREATE    Date 18Dec09               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CRE015 - Retail Term and Notice Accounts                     *
      *                                                               *
      *****************************************************************
     A          R RESTR1D0                  TEXT('(c) Misys International +
     A                                           Banking Systems Ltd. 2009')
      *
     A            E7RECI         1A
     A            E7CNUM         6A
     A            E7CCY          3A
     A            E7ACOD        10S 0
     A            E7ACSQ         2S 0
     A            E7ONE          1A
     A            E7X            1A
     A            ZZ1004         4A
     A            E7ACNO        10S 0
     A            E7RUND         5P 0
     A            E7WOLD         5P 0
     A            E7NARR        16A
     A            ZZ1019        19A
     A            E7INTT         2S 0
     A            E7INTS         5S 0
     A            E7DRCR         1A
     A            E7TIME         6S 0
     A            ZZ1008         8A
     A            E7RECO         5A
     A            ZZ1002         2A
     A            E7SPTA         3A
     A            ZZ1018        18A
     A            E7ATYP         1A
     A            E7RVLD         5P 0
     A            E7BITF         1A
     A            ZZ1009         9A
     A            E7OLDR         5P 0
     A            ZZ1006         6A
     A            E7INRT        11P 7
     A            E7BRIS         2S 0
     A            E7WRIS        11P 7
     A            ZZ1031        31A
     A            E7WRUN         5P 0
     A            E7TRNO         5P 0
     A            E7NATN         5P 0
