      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas CB Failed COB component messages')
     A*
     A*****************************************************************
     A*                                                               *
     A*  Midas - Close of Business Processing
     A*                                                               *
     A*  PF/CBAUDTPD  FAILED CLOSE OF BUSINESS                        *
     A*               COMPONENT MESSAGES FILE                         *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. LN0989             Date 21Nov90               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     A*  LN0989 - ADD NEW FIELDS FOR ADDITIONAL COB ERROR             *
     A*           INFORMATION                                         *
     A*****************************************************************
     A*
     A                                      REF(MFRFL)
     A          R CBAUDTP0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            CCOT      R
     A            CSEQ      R
     A            CSTI      R
     A            CSDE      R
     A            CETI      R
     A            CEDE      R
     A*                                                      /*LN0989*/
     A            JOJOB     R
     A            JOUSER    R
     A            JONBR     R
     A*                                                      /*LN0989*/
