      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas CB COB returned data')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Close of Business Processing
     A*                                                               *
     A*  PF/CBCOBIPD -  AO C.O.B. Returned Data   Physical file       *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. S01495             DATE 01OCT94               *
     A*  PREV AMEND NO. S01375             DATE 22APR92               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  S01495 - COB Enhancements                                    *
     A*  S01375 - Automatic Close of Business                         ****
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A          R @COBIF                    TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            ADAUTO        10          TEXT('Auto C.O.B. key')
     A                                      COLHDG('Auto' +
     A                                             'C.O.B.' +
     A                                             'Key')
     A*********              Start of Change               /S01495/
     A************ADNDSO         5          TEXT('Next Day Set Up Option')
     A            ADNDSO         5          TEXT('This is now a redundant fld')
     A                                      COLHDG('Next Day Set' +
     A                                             'Up Option')
     A************ADICIN         5          TEXT('Input Cycle Initiation OP')
     A            ADICIN         5          TEXT('This is now a redundant fld')
     A                                      COLHDG('Input Cycle' +
     A                                             'Initiation' +
     A                                             'Option')
     A************ADPDPO        10          TEXT('Prompt Display Option')
     A            ADPDPO        10          TEXT('This is now a redundant fld')
     A*                      End of Change                 /S01495/
     A                                      COLHDG('Prompt' +
     A                                             'Display' +
     A                                             'Option')
     A            ADTSFO         5          TEXT('Term save of RCV to ?')
     A                                      COLHDG('Term save' +
     A                                             'of RCV to ?')
     A            ADNSSO         5          TEXT('NDSU save of DB to ?')
     A                                      COLHDG('NDSU save' +
     A                                             'of DB to ?')
     A            ADMSGS        10          TEXT('Input Cycle Msgq status')
     A                                      COLHDG('Input Cycle' +
     A                                             'Msgq status')
     A            ADSASP         2S 0       TEXT('Savefile ASP Option')
     A                                      COLHDG('Savefile' +
     A                                             'ASP' +
     A                                             'Option')
     A            ADCSAV         4          TEXT('Clear Savefiles Option')
     A                                      COLHDG('Clear Savefiles' +
     A                                             'Option')
     A            ADSSAV         4          TEXT('Submit Save Savefile jobs')
     A                                      COLHDG('Submit Save' +
     A                                             'Savefile' +
     A                                             'Jobs')
     A            ADTDSF         5          TEXT('Todays Savefile name')
     A                                      COLHDG('Todays' +
     A                                             'Savefile name')
     A            ADCOBT         4          TEXT('Auto C.O.B. flag')
     A                                      COLHDG('Auto' +
     A                                             'C.O.B.' +
     A                                             'Type')
     A            ADLDWK         3          TEXT('Last Day of Week')
     A                                      COLHDG('Last Day' +
     A                                             'of Week')
     A            ADCBRT        10          TEXT('COB Run type')
     A                                      COLHDG('COB Run' +
     A                                             'type')
     A            ADCBRO         5          TEXT('COB Rcv save option')
     A                                      COLHDG('COB Rcv' +
     A                                             'save option')
     A            ADCBDO         5          TEXT('COB DB save option')
     A                                      COLHDG('COB DB' +
     A                                             'save option')
     A            ADCBCF         4          TEXT('COB Clear savefiles opt.')
     A                                      COLHDG('COB Clear' +
     A                                             'savefiles opt.')
     A            ADCBMD         7          TEXT('COB new run date')
     A                                      COLHDG('COB new' +
     A                                             'run date')
     A            ADDBRN         5  0       TEXT('COB new run day no.')
     A                                      COLHDG('COB new run' +
     A                                             'day no.')
     A            ADCBDN         5          TEXT('COB DB savefile name')
     A                                      COLHDG('COB DB' +
     A                                             'savefile name')
     A*=====================================================================
