      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas SM Migration report - not found and failed')
      *****************************************************************
      *                                                               *
      *  Midas - Implementation module                                *
      *                                                               *
      *  PRTF/SM000013P1 - Migration report - not found and failed    *
      *                                                               *
      *  (c) Finastra International Limited 2010                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. BUG27793 *CREATE   Date 10Jun10               *
      *                 XXXXXX             Date DDMmmYY               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  BUG27793 - Make migration muli-streamed.                     *
      *                                                               *
      *****************************************************************
      *
     A          R MAINH                     TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2010')
     A                                      SKIPB(2)
     A                                      SPACEA(2)
      *
     A                                     5'SM000013P1'
     A                                    22'Migration Report - Not Found and +
     A                                       Failed'
     A                                    80'Date:'
     A                                    86DATE
     A                                      EDTWRD('  /  /  ')
     A                                    95'Time:'
     A                                   101TIME
     A                                      EDTWRD('  :  :  ')
     A                                   121'Page:'
     A                                   126PAGNBR
     A                                      EDTCDE(3)
     A                                      SPACEA(2)
     A                                     2'Status'
     A                                    13'Object'
     A                                    25'Type'
     A                                    35'Text'
     A          R DTL1
     A                                       SPACEA(1)
     A            S13STS         9         2
     A            S13OBJ        10        13
     A            S13TYP         8        25
     A            S13TXT        50        35
     A            S08NP1        69        43
      *
      * No records.
     A          R NORECS
     A                                      SPACEB(2)
     A                                    48'***  No details to report  ***'
      * Report trailer.
     A          R TRAILP
     A                                      SPACEB(2)
     A                                    51'***  End of report  ***'
