      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas SM Report of reference users')                   *
      *****************************************************************
      *                                                               *
      *  Midas - Implementation module                                *
      *                                                               *
      *  SM000033P1 - Report of reference users                       *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2011            *
      *                                                               *
      *  Last Amend No. CBF005   *CREATE   Date 04Jul11               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CBF005 - BF Infrastructure: Single Security User Maintenance *
      *           Profile                                             *
      *                                                               *
      *****************************************************************
      *
     A          R FHDR                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2011')
     A                                      SKIPB(2)
      *
     A                                     5'SM000033P1'
     A                                    35'Report of Reference Users'
     A                                    80'Date:'
     A                                    86DATE
     A                                      EDTWRD('  /  /  ')
     A                                    95'Time:'
     A                                   101TIME
     A                                      EDTWRD('  :  :  ')
     A                                   121'Page:'
     A                                   126PAGNBR
     A                                      EDTCDE(3)
     A                                      SPACEA(2)
      *
     A                                     5'Ref. User'
     A                                    20'User'
     A                                    35'Status'
     A                                      SPACEA(1)
      *
     A          R FDTL
     A            PREFU         10         5
     A            PUSER         10        20
     A            PRECI          1        35
     A                                      SPACEA(1)
      *
     A          R FTLR
     A                                      SPACEB(2)
     A                                    51'*** End of report ***'
