      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas ED Previous days SE book positions')
      *****************************************************************
      *                                                               *
      *   Midas - Midas Export Data Module                            *
      *                                                               *
      *   LF/EDPSBHL1 - ED Previous Days Book Position                *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSE065             Date 08Nov04               *
      *  Prev Amend No. CAS006             Date 21Jan03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CED006  *CREATE    Date 31Jul97               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  CSE065 - Const. Yield Amort. on Mortgage backed assets       *
      *           (Recompile)                                         *
      *  CAS006 - Hedge Accounting Phase B (Recompile)                *
      *   CED006  -  ED Enhancements                                  *
      *                                                               *
      *****************************************************************
     A          R BKPHDDF                   PFILE(EDPSBHPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A          K BHSC
     A          K BHBA
     A          K BHBK
     A          K BHMK
     A          K BHTV
