      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MR Conversion Factors File')
      *****************************************************************
      *                                                               *
      *  Midas - MidasPlus Reporting Module                           *
      *                                                               *
      *  PF/MRCNVFPD - Conversion Factors                             *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2004            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CMR001  *CREATE    Date 16Aug04               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CMR001 - MidasPlus Reporting                                 *
      *                                                               *
      *****************************************************************
      *
     A          R MRCNVFD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2004')
      *
     A            G4RSNO         1          TEXT('Reporting Set Number')
     A                                      COLHDG('Reporting' +
     A                                             'Set Number' )
     A            G4RSCD         4          TEXT('Reporting Code')
     A                                      COLHDG('Reporting' +
     A                                             'Code' )
      *
     A            CONVF1         6S 3       TEXT('Conversion Factor 1')
     A                                      COLHDG('Conversion' 'Factor 1' )
     A            CONVF2         6S 3       TEXT('Conversion Factor 2')
     A                                      COLHDG('Conversion' 'Factor 2' )
