      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_NMSN                                                      *
/*EXI *  TEXT('Midas MR Transaction Events')
/*ADD *  ADDPFM FILE(MRTREVPD) MBR(TDL) SHARE(*NO)                    *
/*ADD *  ADDPFM FILE(MRTREVPD) MBR(TLE) SHARE(*NO)                    *
/*ADD *  ADDPFM FILE(MRTREVPD) MBR(DL) SHARE(*NO)                     *
/*ADD *  ADDPFM FILE(MRTREVPD) MBR(LE) SHARE(*NO)                     *
      *****************************************************************
      *                                                               *
      *  Midas - MidasPlus Reporting Module                           *
      *                                                               *
      *  PF/MRTREVPD - Transaction Events                             *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2004            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CMR001  *CREATE    Date 16Aug04               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CMR001 - MidasPlus Reporting                                 *
      *                                                               *
      *****************************************************************
      *
     A          R MRTREVD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2004')
      *
     A            EXTDAT         5P 0       TEXT('Midas Run date of Extract')
     A                                      COLHDG('Extract Date')
     A            EXVCD          5P 0       TEXT('Event Control Date')
     A                                      COLHDG('Event Control Date')
     A            EXCAFI         1A         TEXT('Calendar/Financial')
     A                                      COLHDG('Calendar/Financial')
     A            EXPERT         1A         TEXT('Period Type')
     A                                      COLHDG('Period Type')
     A            EXCY           2S 0       TEXT('Calendar Year')
     A                                      COLHDG('Calendar Year')
     A            EXCM           2S 0       TEXT('Calendar Month')
     A                                      COLHDG('Calendar Month')
     A            EXMOD          2A         TEXT('Module')
     A                                      COLHDG('Module')
     A            EXSUB          4A         TEXT('Sub-Module')
     A                                      COLHDG('Sub-Module')
     A            EXTRID        20A         TEXT('Transaction ID')
     A                                      COLHDG('Transaction ID')
     A            EXSEQ          3S 0       TEXT('Sequence Number')
     A                                      COLHDG('Sequence Number')
      *
     A            EXREVT         1A         TEXT('Reconcile Event')
     A                                      COLHDG('Reconcile Event')
     A            EXMETP         4A         TEXT('Midas Event Type')
     A                                      COLHDG('Midas Event Type')
     A            EXEVDC         1A         TEXT('Event Day Code')
     A                                      COLHDG('Event Day Code')
     A            EXEVAT         1A         TEXT('Event Amount Type')
     A                                      COLHDG('Event Amt Type')
     A            EXEVAM        18P 3       TEXT('Event Amount')
     A                                      COLHDG('Event Amt')
     A            EXINOI         1A         TEXT('In/Out Indicator')
     A                                      COLHDG('In/Out Indicator')
     A            EXEVCY         3A         TEXT('Event Currency')
     A                                      COLHDG('Event Ccy')
     A            EXEVDT         5P 0       TEXT('Event Date')
     A                                      COLHDG('Event Date')
     A            EXEVD0         8A         TEXT('Event Date-DS0')
     A                                      COLHDG('Event Dte-DS0')
     A            EXEVD1         8A         TEXT('Event Date-DS1')
     A                                      COLHDG('Event Dte-DS1')
     A            EXEVD2         8A         TEXT('Event Date-DS2')
     A                                      COLHDG('Event Dte-DS2')
     A            EXEVD3         8A         TEXT('Event Date-DS3')
     A                                      COLHDG('Event Dte-DS3')
     A            EXEVD4         8A         TEXT('Event Date-DS4')
     A                                      COLHDG('Event Dte-DS4')
     A            EXEVD5         8A         TEXT('Event Date-DS5')
     A                                      COLHDG('Event Dte-DS5')
     A            EXEVD6         8A         TEXT('Event Date-DS6')
     A                                      COLHDG('Event Dte-DS6')
     A            EXEVD7         8A         TEXT('Event Date-DS7')
     A                                      COLHDG('Event Dte-DS7')
     A            EXEVD8         8A         TEXT('Event Date-DS8')
     A                                      COLHDG('Event Dte-DS8')
     A            EXEVD9         8A         TEXT('Event Date-DS9')
     A                                      COLHDG('Event Dte-DS9')
