      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas RE Transaction charges screen format')           *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Retail Module
     A*                                                               *
     A*  RE0220FM - TRANSACTION CHARGES - SCREEN FORMAT               *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      *  Last Amend No. CER049             Date 06Dec10               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CAAA03             Date 16Apr04               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*                 112563             Date 10Feb97               *
     A*                 S01413             Date 13Apr93               *
     A*                 050153             DATE 30JUN93               *
     A*                 S01253                  17APR90               *
     A*                 S01199                  09MAR89               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  CER049 - Stamp Tax                                           *
      *  CAAA03 - Webfacing Changes                                   *
     A*  112563 - Header and footer changes required for GUI          *
     A*           Multilanguage support.                              *
     A*  050153 - Amend display file to remove tags                   *
     A*           H040@005 to H040@025.                               *
     A*  S01413 - Retail 3 Incorporation                              *
     A*  S01253 - Recompiled for Multilanguage Screens                *
     A*  S01199 - HELP System.                                    *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*         /////////////////////////////////////////             *
     A*        // WARNING: When creating this display //              *
     A*       //   file, take options RSTDSP(*YES)   //               *
     A*      //                       SHARE (*YES)  //                *
     A*     /////////////////////////////////////////                 *
     A*                                                               *
     A*****************************************************************
     A*                                                    /*S01199*/
     A*                                                    /*S01199*/
     A                                      CHGINPDFT
     A                                      PRINT(MPRINT)
     A                                      INDARA
     A*                                                    /*S01199*/
     A*                                                    /*S01199*/
     A          R RE0220F1                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                      KEEP
     A                                      CF10
     A                                      CF12
     A                                      CF03
     A*                                                    /*S01199*/
     A**********             START OF CHANGE               /050153/
     A*                      END OF CHANGE                 /050153/
     A*                                                    /*S01199*/
     A*/COPY WNCPYSRC,RE0220FM17
     A            SRUNA          7A  B 01 02DSPATR(PR)
     A            SID            2A  B 01 10DSPATR(PR ND)
     A            SPID           6A  B 01 13DSPATR(PR ND)
     A**                                             Begin /112563/
     A                                  1 22'RE0220A'
     A**                                             End   /112563/
     A                                 01 32'TRANSACTION CHARGES'
     A                                      DSPATR(UL HI)
     A            STIME          8A  B 01 65DSPATR(PR)
     A                                 01 74'WID'
     A            SWSID          3A  B 01 78DSPATR(PR)
     A*/COPY WNCPYSRC,RE0220FM01
     A                                 04 18'Transaction type'
     A            STTYP          5A  B 04 35DSPATR(HI)
     A*/COPY WNCPYSRC,RE0220FM02
     A  01                                  DSPATR(RI)
     A N01                                  DSPATR(UL)
     A*/COPY WNCPYSRC,RE0220FM03
     A                                 04 42'Currency'
     A            STCCY          3A  B 04 51DSPATR(HI)
     A*/COPY WNCPYSRC,RE0220FM04
     A  02                                  DSPATR(RI)
     A N02                                  DSPATR(UL)
     A*/COPY WNCPYSRC,RE0220FM05
     A                                 04 57'Action'
     A            SACTN          1A  B 04 64DSPATR(HI)
     A*/COPY WNCPYSRC,RE0220FM06
     A  89                                  DSPATR(RI)
     A N89                                  DSPATR(UL)
     A*/COPY WNCPYSRC,RE0220FM18
     A                                      CHECK(FE)
     A*/COPY WNCPYSRC,RE0220FM19
     A            ERCD          79A  O 21 02
     A  88                                  DSPATR(ND)
      ** Start of change CAAA03
     A**********                            DSPATR(HI RI)                                     CAAA03
     A                                      DSPATR(HI)
     A N88                                  DSPATR(RI)
      ** End of change CAAA03
     A            ERMSG         79A  O 22 02
     A  88                                  DSPATR(ND)
      ** Start of change CAAA03
     A**********                            DSPATR(HI RI)                                     CAAA03
     A                                      DSPATR(HI)
     A N88                                  DSPATR(RI)
      ** End of change CAAA03
     A**                                             Begin /112563/
     A***********                      24 06'F3 - end of job'
     A***********                      24 29'F12 - initial screen'
     A***********                      24 56'F10 - deletion'
     A                                 24 02'F3=Exit'
     A                                 24 11'F12=Initial screen'
     A                                 24 31'F10=Delete'
     A**                                             End   /112563/
     A          R RE0220F2
     A                                      HOME
     A                                      CF10
     A                                      CF12
     A                                      CF03
     A*                                                    /*S01199*/
     A*/COPY WNCPYSRC,RE0220FM20
     A*                                                    /*S01199*/
     A            SRUNA          7A  B 01 02DSPATR(PR)
     A            SID            2A  B 01 10DSPATR(PR ND)
     A            SPID           6A  B 01 13DSPATR(PR ND)
     A**                                             Begin /112563/
     A                                  1 22'RE0220B'
     A**                                             End   /112563/
     A                                 01 32'TRANSACTION CHARGES'
     A                                      DSPATR(UL HI)
     A            STIME          8A  B 01 65DSPATR(PR)
     A                                 01 74'WID'
     A            SWSID          3A  B 01 78DSPATR(PR)
     A*/COPY WNCPYSRC,RE0220FM07
     A                                 04 18'Transaction type'
     A            STTYP          5A  B 04 35DSPATR(PR HI)
     A                                 04 42'Currency'
     A            STCCY          3A  B 04 51DSPATR(PR HI)
     A                                 04 57'Action'
     A            SACTN          1A  B 04 64DSPATR(PR HI)
     A*/COPY WNCPYSRC,RE0220FM08
     A                                 08 18'Title'
     A N89        STTNM         30A  O 08 35DSPATR(HI)
     A                                 10 18'Charge - amount'
     A            SCDHAM        14A  B 10 35
     A  04                                  DSPATR(RI)
     A N04                                  DSPATR(UL)
     A*/COPY WNCPYSRC,RE0220FM09
     A  83                                  DSPATR(PC)
     A*/COPY WNCPYSRC,RE0220FM10
     A                                      DSPATR(HI)
     A                                 10 50'D/C'
     A            SDCAM          1A  B 10 54DSPATR(HI)
     A  05                                  DSPATR(RI)
     A N05                                  DSPATR(UL)
     A                                 11 18'Charge - percent'
     A            SCHPC         14A  B 11 35DSPATR(HI)
     A  06                                  DSPATR(RI)
     A N06                                  DSPATR(UL)
     A                                 11 50'D/C'
     A            SDCPC          1A  B 11 54DSPATR(HI)
     A  07                                  DSPATR(RI)
     A N07                                  DSPATR(UL)
     A                                 13 18'Rebateable?(Y/N)'
     A            SREBI          1A  B 13 35DSPATR(HI)
     A  08                                  DSPATR(RI)
     A N08                                  DSPATR(UL)
     A                                      CHECK(FE)
      ** Start of change CER049
     A  57                             15 18'Stamp Tax Liable? (Y/N)'
     A  57        SSTLB          1A  B 15 42DSPATR(HI)
     A  57 11                               DSPATR(RI)
     A  57N11                               DSPATR(UL)
      ** End of change CER049
     A            ERCD          79A  O 21 02
     A  88                                  DSPATR(ND)
      ** Start of change CAAA03
     A**********                            DSPATR(HI RI)                                     CAAA03
     A                                      DSPATR(HI)
     A N88                                  DSPATR(RI)
      ** End of change CAAA03
     A            ERMSG         79A  O 22 02
     A  88                                  DSPATR(ND)
      ** Start of change CAAA03
     A**********                            DSPATR(HI RI)                                     CAAA03
     A                                      DSPATR(HI)
     A N88                                  DSPATR(RI)
      ** End of change CAAA03
     A            DSCHDT        17A  O 23 64
     A  87                                  DSPATR(ND)
      ** Start of change CAAA03
     A**********                            DSPATR(HI RI)                                     CAAA03
     A                                      DSPATR(HI)
     A N87                                  DSPATR(RI)
      ** End of change CAAA03
     A**                                             Begin /112563/
     A***********                      24 06'F3 - end of job'
     A***********                      24 29'F12 - initial screen'
     A***********                      24 56'F10 - deletion'
     A                                 24 02'F3=Exit'
     A                                 24 11'F12=Initial screen'
     A                                 24 31'F10=Delete'
     A**                                             End   /112563/
     A          R RE0220F3
     A                                      HOME
     A                                      CF10
     A                                      CF12
     A                                      CF03
     A*                                                    /*S01199*/
     A*/COPY WNCPYSRC,RE0220FM21
     A*                                                    /*S01199*/
     A            SRUNA          7A  B 01 02DSPATR(PR)
     A            SID            2A  B 01 10DSPATR(PR ND)
     A            SPID           6A  B 01 13DSPATR(PR ND)
     A**                                             Begin /112563/
     A                                  1 22'RE0220C'
     A**                                             End   /112563/
     A                                 01 32'TRANSACTION CHARGES'
     A                                      DSPATR(UL HI)
     A            STIME          8A  B 01 65DSPATR(PR)
     A                                 01 74'WID'
     A            SWSID          3A  B 01 78DSPATR(PR)
     A*/COPY WNCPYSRC,RE0220FM11
     A                                 04 18'Transaction type'
     A            STTYP          5A  B 04 35
     A*/COPY WNCPYSRC,RE0220FM12
     A  01                                  DSPATR(RI)
     A N01N84                               DSPATR(UL)
     A                                      DSPATR(HI)
     A  84                                  DSPATR(PR)
     A*/COPY WNCPYSRC,RE0220FM13
     A                                 04 42'Currency'
     A            STCCY          3A  B 04 51
     A*/COPY WNCPYSRC,RE0220FM14
     A  02                                  DSPATR(RI)
     A N02N84                               DSPATR(UL)
     A  84                                  DSPATR(PR)
     A                                      DSPATR(HI)
     A*/COPY WNCPYSRC,RE0220FM15
     A                                 04 57'Action'
     A            SACTN          1A  B 04 64
     A*/COPY WNCPYSRC,RE0220FM16
     A N84                                  DSPATR(UL)
     A  84                                  DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      CHECK(FE)
     A*/COPY WNCPYSRC,RE0220FM22
     A                                 08 18'Title'
     A N02        STTNM         30A  O 08 35DSPATR(HI)
     A                                 10 18'Charge - amount'
     A            SCDHAM        14A  B 10 35
     A  83                                  DSPATR(PC)
     A                                      DSPATR(PR HI)
     A                                 10 50'D/C'
     A            SDCAM          1A  B 10 54DSPATR(PR HI)
     A                                 11 18'Charge - percent'
     A            SCHPC         14A  B 11 35DSPATR(PR HI)
     A                                 11 50'D/C'
     A            SDCPC          1A  B 11 54DSPATR(PR HI)
     A                                 13 18'Rebateable?(Y/N)'
     A            SREBI          1A  B 13 35DSPATR(PR HI)
      ** Start of change CER049
     A  57                             15 18'Stamp Tax Liable? (Y/N)'
     A  57        SSTLB          1A  B 15 42DSPATR(PR HI)
      ** End of change CER049
     A            ERCD          79A  O 21 02
     A  88                                  DSPATR(ND)
      ** Start of change CAAA03
     A**********                            DSPATR(HI RI)                                     CAAA03
     A                                      DSPATR(HI)
     A N88                                  DSPATR(RI)
      ** End of change CAAA03
     A            ERMSG         79A  O 22 02
     A  88                                  DSPATR(ND)
      ** Start of change CAAA03
     A**********                            DSPATR(HI RI)                                     CAAA03
     A                                      DSPATR(HI)
     A N88                                  DSPATR(RI)
      ** End of change CAAA03
     A            DSCHDT        17A  O 23 64
     A  87                                  DSPATR(ND)
      ** Start of change CAAA03
     A**********                            DSPATR(HI RI)                                     CAAA03
     A                                      DSPATR(HI)
     A N87                                  DSPATR(RI)
      ** End of change CAAA03
     A**                                             Begin /112563/
     A***********                      24 06'F3 - end of job'
     A***********                      24 29'F12 - initial screen'
     A***********                      24 56'F10 - deletion'
     A                                 24 02'F3=Exit'
     A                                 24 11'F12=Initial screen'
     A                                 24 31'F10=Delete'
     A**                                             End   /112563/
