      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas RE Cash Management Browser')
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  RE103001DF - Cash Management Browser                         *
      *                                                               *
      *  (c) Finastra International Limited 2002                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CRE008  *CREATE    Date 01Jul02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CRE008 - Cash Management                                     *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A                                      INDARA
     A                                      PRINT(MPRINT)
     A                                      CA03
 
     A          R RE103001F0                TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2002')
     A                                      OVERLAY
 
     A            #0USER    R        O  1  2REFFLD(USER)
     A                                  1 13'RE103001DF'
     A            #0RUND    R        O  1 74REFFLD(RUNA)
 
     A            #0WSID    R        O  2  2REFFLD(JOJOB)
     A                                  2 30'Cash Management Browser'
     A                                      DSPATR(HI)
     A                                  2 73TIME
 
     A          R RE103001F1                TEXT('Enquiry Screen Footer')
     A                                      OVERLAY
 
     A                                 24  2'F3=Exit'
 
     A          R RE103001F2                TEXT('No Record to Display')
     A                                      OVERLAY
 
     A                                 10  2'Cash Management Initialisation'
     A            DDPARM        80     12  1
