      *****************************************************************
/*STD *  DSPFBASE                                                     *
/**********EXI****TEXT('Midas*RE*Set*Off*2'O*Clock*flag')**************                       CSD101
/*EXI *  TEXT('Midas RE Set Off 2''O Clock flag')                     *                       CSD101
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  RE2004DF - Set Off 2'O Clock Flag                            *
      *                                                               *
      *  (c) Finastra International Limited 2005                      *
      *                                                               *
      *  Last Amend No. CSD101             Date 07Dec18               *
      *  Prev Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CRE023  *CREATE    Date 29Jul05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD101 - Password Encryption                                 *
      *  MD046248 - Finastra Rebranding                               *
      *  CRE023 - 2 O'clock Flag Upgrade to MidasPlus                 *
      *                                                               *
      *****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      PRINT(MPRINT)
      ****************************************************************
      * SCREEN-1                                                     *
      ****************************************************************
     A          R RE2004S1
     A                                      CF03
     A                                  1 65TIME
     A                                  1 74'WID'
     A            WSID           2A  O  1 78
      ** Start of change CSD101
     A**********  SMSID          8A  B  8 47DSPATR(HI)                                        CSD101
     A**********                       10 25'ENTER USER PASSWORD :'                           CSD101
     A**********  MPSWD          8A  B 10 47DSPATR(ND)                                        CSD101
     A                                  8 14'ENTER USER ID       :'
     A            SMSID          8A  B  8 37DSPATR(HI)
     A                                 10 14'ENTER USER PASSWORD :'
     A            MPSWD        128   B 10 37TEXT('Password')
     A                                      CNTFLD(32)
     A                                      CHECK(LC)
     A                                      DSPATR(ND)
      ** End of change CSD101
     A            ERRMSG        30A  O 19 26DSPATR(HI)
     A                                 22 33'Press F3 to end'
      ** Start of change CSD101
     A**********                        3 30'SET OFF 2 O CLOCK FLAG'                          CSD101
     A                                  3 30'SET OFF 2 O''CLOCK FLAG'
      ** End of change CSD101
     A                                      DSPATR(UL)
      ** Start of change CSD101
     A**********                        8 25'ENTER USER ID       :'                           CSD101
      ** End of change CSD101
