      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas PM Bank Industry Investment Policy    PW')       *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Management Module                      *
     A*                                                               *
     A*  PF/PMBDIPPD - PM BANK INDUSTRY INVESTMENT POLICY             *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      *  Last Amend No. CER059             Date 19Jul10               *
      *  Prev Amend No. CER020             Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 S01486             Date 11Aug94               *
     A*                 000000             Date                       *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER020 - Enhanced Rollover Window: Upgrade FGE089            *
      *           to Midas Plus                                       *
     A*  S01486 - Portfolio Management Upgrade to R10.                *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*           C R E A T I O N     P A R A M E T E R S             *
     A*
     A*****************************************************************
     A                                      REF(MFRFL)
     A***********                                    Begin /S01486/
     A**********R*PMBDIPP0
     A          R PMBDIPP0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A***********                                    End   /S01486/
     A            PWRECI    R               REFFLD(RECI)
     A            PWDLUP    R               REFFLD(DLUP)
     A            PWMLUP    R               REFFLD(MLUP)
     A            PWYLUP    R               REFFLD(YLUP)
     A            PWTLUP    R               REFFLD(TLUP)
     A            PWCHTP    R               REFFLD(CHTP)
     A            PWLCD     R               REFFLD(LCD)
     A            PWTNLU    R               REFFLD(TNLU)
     A            PWPOLC    R               REFFLD(POLC)
     A            PWLIND    R               REFFLD(LIND)
     A            PWLING    R               REFFLD(LING)
     A            PWMINR    R               REFFLD(MINR)
     A            PWMAXR    R               REFFLD(MAXR)
      **Start of change CER020
     A            PWLOIC    R               REFFLD(FTAG)
     A                                      TEXT('Local Industry Code +
     A                                           - Alpha')
     A                                      COLHDG('Local Ind' +
     A                                             'Code')
      **End of change CER020
     A*
     A          K PWPOLC
