      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas PM Bank Country Investment Policy     PX')
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Management Module                      *
     A*                                                               *
     A*  PF/PMBRIPPD - PM BANK COUNTRY INVESTMENT POLICY              *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. S01486             DATE 11AUG94               *
     A*  PREV AMEND NO. 000000             DATE                       *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
     A*  S01486 - Portfolio Management Upgrade to R10.                *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*           C R E A T I O N     P A R A M E T E R S             *
     A*
     A*****************************************************************
     A                                      REF(MFRFL)
     A***********                                    Begin /S01486/
     A**********R*PMBRIPP0
     A          R PMBRIPP0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A***********                                    End   /S01486/
     A            PXRECI    R               REFFLD(RECI)
     A            PXDLUP    R               REFFLD(DLUP)
     A            PXMLUP    R               REFFLD(MLUP)
     A            PXYLUP    R               REFFLD(YLUP)
     A            PXTLUP    R               REFFLD(TLUP)
     A            PXCHTP    R               REFFLD(CHTP)
     A            PXLCD     R               REFFLD(LCD)
     A            PXTNLU    R               REFFLD(TNLU)
     A            PXPOLC    R               REFFLD(POLC)
     A            PXCCOD    R               REFFLD(CCOD)
     A            PXCCDG    R               REFFLD(CCDG)
     A            PXMINR    R               REFFLD(MINR)
     A            PXMAXR    R               REFFLD(MAXR)
     A*
     A          K PXPOLC
