      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas PM Cashflow Day Totals Trailer        QK')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Management Module                      *
     A*                                                               *
     A*  PF/PMCFDYPA - PM CASHFLOW DAY TOTALS  AUDIT                  *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. 093981             Date 10Oct95               *
      *                 S01486             Date 11Aug94               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     A*  093981 - Move file into the DMLIB as used in enquiries       *
     A*  S01486 - Portfolio Management Upgrade to R10.                *
     A*                                                               *
     A*****************************************************************
     A*           C R E A T I O N     P A R A M E T E R S             *
     A*
     A*****************************************************************
     A                                      REF(MFRFL)
     A***********                                    Begin /S01486/
     A          R PMCFDYZ0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A***********                                    End   /S01486/
      *                                              Begin /S01486/
     A            QKRECI    R               REFFLD(RECI)
     A            QKNORE    R               REFFLD(NORE)
     A**********  QKRECI         1A                                       S01486
     A**********                            COLHDG('Rec' +                S01486
     A**********                            'Id')                         S01486
     A**********                            TEXT('Record Id')             S01486
     A**********  QKNORE         5  0                                     S01486
     A**********                            COLHDG('No of' +              S01486
     A**********                            'Records' +                   S01486
     A**********                            'On file')                    S01486
     A**********                            TEXT('Number of records on fi+S01486
     A**********                            le')                          S01486
     A                                      EDTCDE(L )
      *                                              End   /S01486/
