      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas PM Extract Forward Trade Actions')
      *****************************************************************
      *                                                               *
      *  Midas - Portfolio Management Module                          *
      *                                                               *
      *  PF/PMFTACPD - PM Extract Forward Trade Actions               *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CPM005             Date 10Jun96               *
      *                 S01124             Date 10JUN96               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CPM005 - Private Banking Phase 2                             *
      *           Focus Group Changes upgraded to DBA                 *
      *  S01124 - PBFG/3 - DISPLAY OF UNREALISED P&L ON FORWARD SE    *
      *                    TRADE                                      *
      *                                                               *
      *****************************************************************
     A*
     A*                                              Begin /CPM005/
     A**********R PMFTACD0
     A*********** FKCNUM         6S 0       TEXT('Customer Number')
     A*********** FKPTFR         4          TEXT('Portfolio Reference')
     A*********** FKTDSS        10          TEXT('Security Short Name')
     A*********** FKVDAT         5P 0       TEXT('Value Date')
     A*********** FKCDAT         5P 0       TEXT('Date Trade Made Complete')
     A*********** FKTDTP         2          TEXT('Trade Type')
     A*********** FKNOML        15P 0       TEXT('Nominal')
     A*********** FKAPNU        15P 0       TEXT('Change to Ap Numerator')
     A*********** FKFXPL        15P 0       TEXT('FX Profit & Loss')
     A                                      REF(MFRFL)
     A          R PMFTACD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      * Begin /CSD027/
     A**********  FKCNUM    R               REFFLD(CNUM)                                      CSD027
     A            FKCNUM         6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            FKPTFR    R               REFFLD(PTFR)
     A            FKTDSS    R               REFFLD(TDSS)
     A            FKVDAT    R               REFFLD(VDAT)
     A            FKCDAT    R               REFFLD(CDAT)
     A                                      TEXT('Date Trade Made +
     A                                      Complete')
     A                                      COLHDG('Date Trd Com')
     A            FKTDTP    R               REFFLD(TDTP)
     A            FKNOML    R               REFFLD(AMNP)
     A                                      TEXT('Nominal')
     A                                      COLHDG('Nom')
     A            FKAPNU    R               REFFLD(AMNP)
     A                                      TEXT('Change to AP +
     A                                      Numerator')
     A                                      COLHDG('Chg AP Num')
     A            FKFXPL    R               REFFLD(AMNP)
     A                                      TEXT('FX Profit & Loss')
     A                                      COLHDG('FX Prf Loss')
     A*                                              End   /CPM005/
