      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas PM Start of Business Pool portfolio Definit')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Management Module                          *
     A*                                                               *
     A*  PF/PMSBPDPD - START OF BUSINESS POOL PORTFOLIO               *
     A*            DEFINITION DETAILS                                 *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 093981             Date 10Oct95               *
     A*                 094402             Date 24OCT95               *
     A*                 CPK002             DATE 10MAY95               *
     A*                 S01486             DATE 11AUG94               *
     A*                 049421             DATE 19OCT93               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*  093981 - Move file into the DMLIB as used in enquiries       *
     A*  094402 - Standardise creation parameters                     *
     A*  CPK002 - Remove TEXT keyword as it prevents compilation      *
     A*  S01486 - Portfolio Management Upgrade to R10.                *
     A*  049421 - HEADER BOX STANDARDISATION                          *
     A*                                                               *
     A*   WRITTEN FOR SAR 91/08 - POOL SECURITIES TRANSACTIONS        *
     A*                                                               *
     A*****************************************************************
     A*           C R E A T I O N     P A R A M E T E R S             *
     A*
     A***TEXT(*SRCMBRTXT)*OPTION(*NOSOURCE**NOLIST)*SYSTEM(*LCL)*******   094402
     A***WAITRCD(60)*SHARE(*YES)*DLTPCT(*NONE)*ALWUPD(*YES)************   094402
     A***ALWDLT(*YES)*LVLCHK(*NO)*AUT(*USE*)***************************   094402
     A*: WAITRCD(60) SHARE(*YES) DLTPCT(*NONE) LVLCHK(*NO)          : *
     A*:    AUT(*USE ) TEXT(*SRCMBRTXT)                             : *
     A********************************************************************
     A          R PMPPTDD0                  FORMAT(PMPPTDPD)
      *                                              Begin /CPK002/
     A***********                           TEXT('(c) MKI +
     A***********                           INTERNATIONAL +
     A***********                           LIMITED 1991,1994')
      *                                              End   /CPK002/
     A*
     A          K ORPCNU
     A          K ORPPTF
