      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas PM Valuation Group Headings          PB')
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Management Module                      *
     A*                                                               *
     A*  PF/PMVLGHPD - PM VALUATION GROUP HEADINGS                    *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01486             Date 11Aug94               *
      *                 000000             Date                       *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     A*  S01486 - Portfolio Management Upgrade to R10.                *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*           C R E A T I O N     P A R A M E T E R S             *
     A*
     A*****************************************************************
     A                                      REF(MFRFL)
     A***********                                    Begin /S01486/
     A**********R*PMVLGHP0
     A          R PMVLGHP0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A***********                                    End   /S01486/
     A            PBRECI    R               REFFLD(RECI)
     A            PBDLUP    R               REFFLD(DLUP)
     A            PBMLUP    R               REFFLD(MLUP)
     A            PBYLUP    R               REFFLD(YLUP)
     A            PBTLUP    R               REFFLD(TLUP)
     A            PBCHTP    R               REFFLD(CHTP)
     A            PBLCD     R               REFFLD(LCD)
     A            PBTNLU    R               REFFLD(TNLU)
     A            PBVALG    R               REFFLD(VALG)
     A            PBVLGS    R               REFFLD(VLGS)
     A            PBVLGT    R               REFFLD(VLGT)
     A*
     A          K PBVALG
