      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas PM Valid portfolio definition details')
      *****************************************************************
      *                                                               *
      *  Midas - Portfolio Management Module                          *
      *                                                               *
      *  PF/PMVPFDMPD - Valid Portfolio Definition Details            *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      *  Prev Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CPB001             Date 13Dec99               *
      *                 CAP033  *CREATE    Date 28Apr99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CPB001 - New PB Customer processing.                         *
      *           Add 3 new fields: - Replication Flag.               *
      *                             - Management Type.                *
      *                             - Investment Profile Code.        *
      *  CAP033 - Conversion of PM inputs into modular structure to   *
      *           use as APIs.                                        *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R PMVPFDMD0                 TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            P1PNRECI  R               REFFLD(RECI)
     A            P1PNDLUP  R               REFFLD(DLUP)
     A            P1PNMLUP  R               REFFLD(MLUP)
     A            P1PNYLUP  R               REFFLD(YLUP)
     A            P1PNTLUP  R               REFFLD(TLUP)
     A            P1PNCHTP  R               REFFLD(CHTP)
     A            P1PNLCD   R               REFFLD(LCD)
     A            P1PNTNLU  R               REFFLD(TNLU)
      * Begin /CSD027/
     A**********  P1PNCNUM  R               REFFLD(CNUM)                                      CSD027
     A            P1PNCNUM       6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            P1PNPTFR  R               REFFLD(PTFR)
     A            P1PNPTFN  R               REFFLD(PTFN)
     A            P1PNPTCY  R               REFFLD(PTCY)
     A            P1PNPCDP  R               REFFLD(PCDP)
     A            P1PNDPOP  R               REFFLD(DPOP)
     A            P1PNDPCL  R               REFFLD(DPCL)
     A            P1PNPTFT  R               REFFLD(PTFT)
     A            P1PNMNGI  R               REFFLD(MNGI)
     A            P1PNVLFQ  R               REFFLD(VLFQ)
     A            P1PNVLDM  R               REFFLD(VLDM)
     A            P1PNVLND  R               REFFLD(VLND)
     A            P1PNS1VR  R               REFFLD(S11VR)
     A            P1PNS2VR  R               REFFLD(S12VR)
     A            P1PNS3VR  R               REFFLD(S13VR)
     A            P1PNS4VR  R               REFFLD(S14VR)
     A            P1PNS5VR  R               REFFLD(S15VR)
     A            P1PNS6VR  R               REFFLD(S16VR)
     A            P1PNS7VR  R               REFFLD(S17VR)
     A            P1PNS8VR  R               REFFLD(S18VR)
     A            P1PNPOLC  R               REFFLD(POLC)
     A            P1PNIPIN  R               REFFLD(IPIN)
     A            P1PNCYIN  R               REFFLD(CYIN)
     A            P1PNYPIN  R               REFFLD(YPIN)
     A            P1PNNPIN  R               REFFLD(NPIN)
     A            P1PNPDGS  R               REFFLD(PDGS)
     A            P1PNPDGF  R               REFFLD(PDGF)
     A            P1PNBCGY  R               REFFLD(BCGY)
     A            P1PNBCGD  R               REFFLD(BCGD)
     A            P1PNCSCY  R               REFFLD(CSCY)
     A            P1PNCSDP  R               REFFLD(CSDP)
     A**Start of change CGL029
     A**********  P1PNCUSA  R               REFFLD(CUSA)                                      CGL029
     A            P1PNCUSAQQ    12A
     A**End of change CGL029
     A            P1PNCUSB  R               REFFLD(BRCA)
     A                                      TEXT('Customer Settlement Branch')
     A                                      COLHDG('Cust' +
     A                                             'Setl' +
     A                                             'Brch')
     A            P1PNWSI1  R               REFFLD(WSTI)
     A            P1PNCASF  R               REFFLD(CASF)
     A            P1PNCASD  R               REFFLD(CASD)
     A            P1PNCASN  R               REFFLD(CASN)
     A            P1PNCFGC  R               REFFLD(CFGC)
     A            P1PNXPTN  R               REFFLD(XPTN)
     A            P1PNRPYP  R               REFFLD(RPYP)
     A            P1PNTYSM  R               REFFLD(TYSM)
     A            P1PNADPP  R               REFFLD(ADPP)
     A            P1PNPSDT  R               REFFLD(PSDT)
     A            P1PNPMNG  R               REFFLD(PMNG)
     A            P1PNDCDL  R               REFFLD(DCDL)
     A            P1PNACSQ  R               REFFLD(ACSQ)
     A                                      TEXT('FF Margin A/C Sequence')
     A                                      COLHDG('FF' +
     A                                             'Mg' +
     A                                             'A/C')
     A            P1PNS9VR  R               REFFLD(S11VR)
     A                                      TEXT('Instrument Summary Section')
     A                                      COLHDG('Ins' +
     A                                             'Sum' +
     A                                             'Req')
     A            P1PNS0VR  R               REFFLD(S11VR)
     A                                      TEXT('Currency Summary Section')
     A                                      COLHDG('Ccy' +
     A                                             'Sum' +
     A                                             'Req')
     A            P1PNPRFC  R               REFFLD(PRFC)
     A                                      TEXT('Profit Centre')
     A            P1PNFRNT  R               REFFLD(FOTRNID)
     A            P1PNAFRT  R               REFFLD(FOTRNID)
     A                                      TEXT('Associated Front +
     A                                            Office Transaction Id')
     A                                      COLHDG('Associated' +
     A                                             'Front Office' +
     A                                             'Transaction Id')
     A            P1PNREPA  R               REFFLD(RPRLOC)
      ** Timestamp
     A            P1PNTMST  R               REFFLD(TIMESTMP)
     A*                                              Begin /CPB001/
     A            P1PNREPI       1          TEXT('Replication Flag')
     A                                      COLHDG('Replication' +
     A                                             'Flag')
     A            P1PNMGTP       3S 0       TEXT('Management Type')
     A                                      COLHDG('Management' +
     A                                             'Type')
     A            P1PNINTP       3S 0       TEXT('Investment Profile Code')
     A                                      COLHDG('Investment' +
     A                                             'Profile' +
     A                                             'Code')
     A*                                              End   /CPB001/
     A**Start of change CGL029
     A            P1PNCUSA      18A
     A**End of change CGL029
