      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas RE Outward clearing file')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Retail Module                                        *
     A*                                                               *
     A*  LF/OTCLR    - Outward Clearing File                          *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. 091241             DATE 17JUL95               *
     A*  PREV AMEND NO. CRT001  *CREATE    DATE 28FEB95               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
     A*  091241 - Recompiled.                                         *
     A*  CRT001 - Retail Teller System                                *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A****************
     A*  HEADER RECORD
     A****************
     A          R OTCLRPHF                  PFILE(OTCLRPH)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K RECI
     A          K *NONE
     A          K RBCD
     A          K TNCY
      *
      ****************
      *  DETAIL RECORD
      ****************
     A          R OTCLRPDF                  PFILE(OTCLRPD)
     A          K RECI
     A          K TLBC
     A          K RBCD
     A          K TNCY
     A          K CQNF
      *
      *****************
      *  TRAILER RECORD
      *****************
     A          R OTCLRPZF                  PFILE(OTCLRPZ)
     A          K RECI
     A          K *NONE
     A          K RBCD
     A          K TNCY
      *
