      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IMNM                                                      *
/*EXI *  MBR(MIC ) DTAMBRS((RECMEXPD (MIC )))                         *
/*EXI *  TEXT('Midas RE Cash Management Exceptions')
/*XAIA* ADDLFM FILE(RECMEXL1) MBR(MPUR) DTAMBRS((RECMEXPD (MPUR)))    *
/*XAIB* ADDLFM FILE(RECMEXL1) MBR(MASC) DTAMBRS((RECMEXPD (MASC)))    *
/*XAIC* ADDLFM FILE(RECMEXL1) MBR(M1  ) DTAMBRS((RECMEXPD (M1  )))    *
/*XAID* ADDLFM FILE(RECMEXL1) MBR(M1PC) DTAMBRS((RECMEXPD (M1PC)))    *
/*XAIE* ADDLFM FILE(RECMEXL1) MBR(M5  ) DTAMBRS((RECMEXPD (M5  )))    *
/*XAIF* ADDLFM FILE(RECMEXL1) MBR(M5PC) DTAMBRS((RECMEXPD (M5PC)))    *
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  LF/RECMEXL1 - Cash Management Exceptions                     *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2002            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CRE008  *CREATE    Date 19Feb02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CRE008 - Cash Management                                     *
      *                                                               *
      *****************************************************************
     A          R RECMEXD0                  PFILE(RECMEXPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2002')
      *
     A          K EXHISN
     A          K EXLINK
      *
