      *****************************************************************   CCB003
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *   CCB003
/*EXI *  TEXT('Midas RE Retail History Update Report Extract LF')
      *****************************************************************   CCB003
      *                                                               *   CCB003
      *  Midas - Retail Module                                        *   CCB003
      *                                                               *   CCB003
      *  LF/REHISXL0 - RE Retail History Update Report Extract Logical*   CCB003
      *                                                               *   CCB003
      *  (c) Finastra International Limited 2001                      *
      *                                                               *   CCB003
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      *                 CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CCB003  *CREATE    Date : 01oCT9              *
      *                                                               *   CCB003
      *---------------------------------------------------------------*   CCB003
      *                                                               *   CCB003
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CCB003 - COB Performance Enhancements - Task Split           *
      *                                                               *   CCB003
      *****************************************************************   CCB003
     A          R REHISXD0                  PFILE(REHISXPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A          K BRCA
     A          K CNUM
     A          K CCY
     A          K ACOD
     A          K ACSQ
     A          K VALD
