      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas RE Sweep details file by CR retail (239413)')    *
      *****************************************************************
      *                                                               *
      *  MIDAS - RETAIL MODULE                                        *
      *                                                               *
      *  LF/RESWEPLA - Sweep detaol file by CR a/c of origin retail   *
      *                Account number (CRAN)                          *
      *                                                               *
      *  (C) Misys International Banking Systems Ltd. 2011            *
      *                                                               *
      *  Last Amend No. CGL196  *Create    Date 07Oct20               *
      *  Prev Amend No. XXXXXX             Date ddmmmyy               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGL196 - Account Mapping Stopped Cheques Processing          *
      *                                                               *
      *****************************************************************
     A          R RESWEPD0                  PFILE(RESWEPPD)
     A                                      TEXT('(C) Finastra Ltd 2020')
      *
     A          K CRAN
      *
     A          S CRAN                      COMP(NE 0)
