      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas RE Sweep Details')
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  LF/RESWEPL5 - Sweep Detail File by CR A/C of Origin          *
      *                Retail Number                                  *
      *                                                               *
      *  (c) Finastra International Limited 2007                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      *  Prev Amend No. CRE401             Date 26Nov09               *
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *                 253689 (B          Date 09Apr08               *
      *                 249968             Date 11Sep07               *
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CRE401 - 4-Eyes Checking Gaps - Sweeps (Recompile)           *
      *  253689 - Added a selection for field RECI (BUG17640)         *
      *  249968 - To Access SWEEP Accounting File using Debit Retail  *
      *           Account and Sequence nos.                           *
      *                                                               *
      *****************************************************************
     A          R RESWEPD0                  PFILE(RESWEPPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2007')
      *
     A          K CCUS
     A          K CCYC
     A          K CSCA
     A          K CACD
     A          K CBRC
     A** Start of change 253689
     A          S RECI                      COMP(EQ 'D')
     A** End of change 253689
      *
