      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas RE Retail/taxes JLF (REACR - ACCNTBX0)')         *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Retail Module
     A*                                                               *
     A*  JLF/RETAXJL - RETAIL / TAXES (REACR - ACCNTBXC)              *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. CER050             Date 16Jun19               *
      *  Prev Amend No. MD046248           Date 27Oct17               *
      *                 CGL165             Date 17Feb15               *
      *                 CER055             Date 06Dec10               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027             Date 05Dec05               *
      *                 CGL029             Date 01Sep03               *
      *                 208221             Date 11Dec02               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 CDE002             Date 17Dec99               *
      * Midas DBA 3.05 -----------------------------------------------*
      *                 CPB002             Date 24Aug00               *
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CFT004             Date 10Nov99               *
     A*                 CAP035             DATE 30JUN99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*                 CRE001             Date 18Feb97               *
     A*                 S01413 *CREATE     Date 13Apr93               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  CER050 - Annualised Percentage Rate (Recompile)              *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL165 - Dual Withholding Tax (Recompile)                    *
      *  CER055 - Penalty Interest on Exceeding Overdraft Limit       *
      *           (Recompile)                                         *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
     A*  208221 - Add fields for Margin Base Rates (Recompiled)       *
      *  CDE002 - Recompiled for Retail Accnt. Margin History update  *
     A*  CPB002 - Meridian DBA Middleware Replication Customization.  *
     A*           Recompiled over amended REACRD.                     *
     A*  CFT004 - Straight Through Processing Phase 2                 *
     A*         - International Bank Account Numbers(Recompile)       *
     A*  CAP035 - Conversion of Midas inputs to modular API structure *
     A*           Recompiled over amended ACCNTBXC.                   *
     A*  CRE001 - Overdraft Interest Calculations                     *
     A*         - Recompiled over changes in PF/ACCNTBXC & PF/REACRD  *
     A*  S01413 - Retail 3 Incorporation                              *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A          R RETAXJF                   JFILE(REACRD ACCNTBXC)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A          J                           JOIN(1 2)
     A                                      JFLD(CUST ATCNUM)
     A                                      JFLD(ACCY ATCCY)
     A                                      JFLD(ACOD ATACOD)
     A                                      JFLD(ASEQ ATACSQ)
     A                                      JFLD(BRCA ATBRCA)
     A            #JRECI                    JREF(1)
     A                                      RENAME(RECI)
     A            #JCUST                    JREF(1)
     A                                      RENAME(CUST)
     A            #JACCY                    JREF(1)
     A                                      RENAME(ACCY)
     A            #JACOD                    JREF(1)
     A                                      RENAME(ACOD)
     A            #JASEQ                    JREF(1)
     A                                      RENAME(ASEQ)
     A            #JBRCA                    JREF(1)
     A                                      RENAME(BRCA)
     A            #JCINW                    JREF(1)
     A                                      RENAME(CINW)
     A            #JITAX                    JREF(2)
     A                                      RENAME(ATITAX)
      * Begin /CSD027/
     A**********  ATCNUM         6S 0       JREF(2)                                           CSD027
     A            ATCNUM                    JREF(2)
      * End /CSD027/
     A          K #JBRCA
     A          K #JCUST
     A          K #JACCY
     A          K #JACOD
     A          K #JASEQ
