/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas RE Zero Bal/Swep Hierarchi Details - EXTnMST')
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  LF/REZSHDJ1 - Zero Balancing/Sweeping Hierarchies            *
      *              - External = Yes and Master Account = No         *
      *                                                               *
      *  (c) Finastra International Limited 2002                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CGL029             Date 01Sep03               *
      *                 214360  *CREATE    Date 03Feb03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  214360 - Cash Management Deferred Posting  (CRE008)          *
      *                                                               *
      *****************************************************************
     A          R REZSHDD0                  JFILE(RECMHDPD REZSHDPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2002')
      *
     A          J                           JOIN(1 2)
     A                                      JFLD(CDHIER ZDHIER)
      *
     A            CDHIER
     A            CDHISN
     A            CDDESC
     A            CDHTYP
     A            CDBRCA
     A            CDDEFR
     A            CDRVDT
     A            CDINBU
     A            CDAUBU
     A            CDLCDT
     A            CDNODH
     A            CDNODN
     A            CDPRSQ
     A            ZDEXTL
     A            ZDMAST
      *
     A          K CDHISN
      *
     A          S ZDEXTL                    COMP(EQ 'Y')
     A            ZDMAST                    COMP(EQ 'N')
