      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  DTAMBRS((RTHH RTHH) (RACTRF RACTRF) (RACTRG RACTRG) (RTZZ    *
/*EXI *  RACT))                                                       *
/*EXI *  TEXT('Midas RE RETAIL ACCOUNT ACTIVITY - By Co.')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Retail Module
     A*                                                               *
     A*  LF/SRACTL1 RETAIL ACCOUNT ACTIVITY - BY COMPANY  (SORT)      *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      *  Prev Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 S01413             Date 13Apr93               *
      *                 E12715             Date 19Apr88               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *   E12715
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
     A*  S01413 - Recompiled for Retail 3 Incorporation               *
     A*  E12715 - Previously if the logical file was created          *   E12715
     A*           fron the creation paramenters (using CRTOBJ)        *   E12715
     A*           it was created with all the data members. The       *   E12715
     A*           creation paramenters have now been amended so       *   E12715
     A*           that each logical based on RTZZ will only be        *   E12715
     A*           based over the associated member within RTZZ.       *   E12715
     A*                                                               *
     A*****************************************************************
     A          R RTHHF                     PFILE(RTHH)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K RECI
     A          K *NONE
     A          R RACTRFF                   PFILE(RACTRF)
     A          K *NONE
     A          K CMPYM
     A          K ACOC
     A          K CCY
     A          K CNUM
     A          K ACOD
     A          K ACSQ
     A          K RECI
     A          K *NONE
     A          R RACTRGF                   PFILE(RACTRG)
     A          K *NONE
     A          K CMPYM
     A          K ACOC
     A          K CCY
     A          K CNUM
     A          K ACOD
     A          K ACSQ
     A          K RECI
     A          K *NONE
     A          R RTZZF                     PFILE(RTZZ)
     A          K RECI
     A          K *NONE
