/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas RE Teller Controls')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Retail Module                                        *
     A*                                                               *
     A*  LF/TTRNM2L2 - Teller Controls                                *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. CRT003  *CREATE    DATE 22JUL96               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
     A*  CRT003 - Cashier Interface.                                  *
     A*                                                               *
     A*****************************************************************
     A*
     A          R TTRNTM2F                  PFILE(TTRNTM2)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K TLBC
      *
     A          S RECI                      COMP(EQ 'D')
     A          S TBRI                      COMP(EQ 'T')
     A          S TWID                      COMP(NE '          ')
