      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE Buy/sell position file')
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *  PF/BSPOSPD - Buy/Sell Position File                          *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *  Last Amend No. CSE006  *CREATE    Date 20APR99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSE006 - *CREATE                                             *
      *           Repurchase Agreements (REPOS) enhancements.         *
      *                                                               *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R BSPOSD0                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            BSRECI         1          TEXT('Record Status Indicator')
     A                                      COLHDG('Record Status'      +
     A                                             'Indicator')
     A            BSBCH          3          TEXT('Branch')
     A                                      COLHDG('Branch')
     A            BSBOK          2          TEXT('Book')
     A                                      COLHDG('Book')
     A            BSSEN         10          TEXT('Security Shortname')
     A                                      COLHDG('Security'            +
     A                                             'Short Name')
     A            BSPRF          6          TEXT('Buy/Sell trade         +
     A                                            Reference')
     A                                      COLHDG('Buy/Sell trade'      +
     A                                             'Reference')
     A            BSTD1          5  0       TEXT('Buy/Sell 1st           +
     A                                            Trade trade Date')
     A                                      COLHDG('Buy/Sell 1st'        +
     A                                             'Trade trade Date')
     A            BSTD2          5  0       TEXT('Buy-Sell 2nd           +
     A                                            Trade trade Date')
     A                                      COLHDG('Buy/Sell 2nd'        +
     A                                             'Trade trade Date')
     A            BSVD1          5  0       TEXT('Buy/Sell 1st           +
     A                                            Trade value Date')
     A                                      COLHDG('Buy/Sell 1st'        +
     A                                             'Trade value Date')
     A            BSVD2          5  0       TEXT('Buy/Sell 2nd           +
     A                                            Trade value Date')
     A                                      COLHDG('Buy/Sell 2nd Trade'  +
     A                                             'value Date')
     A            BSPL          15  0       TEXT('Buy/Sell Profit/Loss')
     A                                      COLHDG('Buy/Sell Profit/Loss')
     A            BSOPL         15  0       TEXT('Unamortised Profit       +
     A                                            /Loss')
     A                                      COLHDG('Unamortised Profit'      +
     A                                             '/Loss')
     A            BSAPL         15  0       TEXT('Amortised Profit         +
     A                                            /Loss')
     A                                      COLHDG('Amortised Profit'        +
     A                                             '/Loss')
     A            BSLATD         6  0       TEXT('Last Amortised to        +
     A                                            Date')
     A                                      COLHDG('Last Amortised'          +
     A                                             'to Date')
      *
