      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_NM                                                        *
/*EXI *  TEXT('Midas SE Customer Valuations')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Securities Trading Module
     A*                                                               *
     A*  PF/CVALSD - CUSTOMER VALUATIONS                              *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  Prev Amend No. E27790             Date 28AUG91               *
     A*                 S01117             Date 03JAN89               *
     A*                 E18359             DATE 16MAY89               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*  E27790 - INCLUDE SEQUENCE NO. AS FOR R10. RCF                *  *E20604
     A*  S01117 - RELEASE 10 (MULTIBRANCHING)                         *
     A*  E18359 - ADD THE ADDPFM COMMAND TO THE CREATION PARAMETERS   *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R CVALSDF                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            RECI      R
     A*                                                    /S01117/
     A*********** CVBR      R
     A            CVBA      R
     A*                                                    /S01117/
      * Begin /CSD027/
     A**********  CVCN      R                                                                 CSD027
     A            CVCN           6A
     A                                      TEXT('Customer')
     A                                      COLHDG('Customer')
      * End /CSD027/
      *                                              Begin /E27790/
     A            CVSEQ     R
      *                                              End   /E27790/
