      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE EXTEL Hdr Rec I-FTA Equity Grps')
     A********************************************************************
     A**                                                                **
     A*  Midas - Securities Trading Module
     A**                                                                **
     A**     PF/EXTF4I - HEADER I - FTA EQUITY GROUPS                   **
     A**                                                                **
     A**   (c) Finastra International Limited 2001                      *
     A**                                                                **
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A**     PREV AMEND NO. 00               DATE 00/00/00              **
     A**                                                                **
     A********************************************************************
     A*                                                                  *
     A*      Description of Amendment                                    *
     A*      MD046248 - Finastra Rebranding                              *
     A*                                                                  *
     A*      No. 000000    Text:                                         *
     A*                                                                  *
     A********************************************************************
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A********************************************************************
     A*
     A                                      REF(MFRFL)
     A*
     A          R EXTF4IF                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            F1SCP     R
     A            XRTYP     R
     A            XFDAT     R
     A            XFSN      R
     A            X2YDT     R
     A*
     A            I1        R
     A            I2        R
     A            I3        R
     A            I4        R
     A            I5        R
     A            I6        R
     A            I7        R
     A            I8        R
     A            I9        R
     A            I10       R
     A            I11       R
     A            I12       R
     A            I13       R
     A            I14       R
     A            I15       R
     A            I16       R
     A            I17       R
     A            I18       R
     A            I19       R
     A            I20       R
     A            I21       R
     A            I22       R
     A            I23       R
     A            I24       R
     A            I25       R
     A            I26       R
     A            I27       R
     A            I28       R
     A            I29       R
     A            I30       R
     A            I31       R
     A            I32       R
     A            I33       R
     A            I34       R
     A            I35       R
     A            I36       R
     A            I37       R
     A            I38       R
     A            I39       R
     A            I40       R
     A            I41       R
     A            I42       R
     A            I43       R
     A            I44       R
     A            I45       R
     A            I46       R
     A            I47       R
     A            I48       R
     A            I49       R
     A            I50       R
     A            I51       R
     A            I52       R
     A            I53       R
     A            I54       R
     A            I55       R
     A            I56       R
     A            I57       R
     A            I58       R
     A            I59       R
     A            I60       R
     A            I61       R
     A            I62       R
     A            I63       R
     A            I64       R
     A            I65       R
     A            I66       R
     A            I67       R
     A            I68       R
     A            I69       R
     A            I70       R
     A            I71       R
     A            I72       R
     A            I73       R
     A            I74       R
     A            I75       R
     A            I76       R
     A            I77       R
     A            I78       R
     A            I79       R
     A            I80       R
     A            I81       R
     A            I82       R
     A            I83       R
     A            I84       R
     A            I85       R
     A            I86       R
     A            I87       R
     A            I88       R
     A            I89       R
     A            I90       R
     A            I91       R
     A            I92       R
     A            I93       R
     A            I94       R
     A            I95       R
     A            I96       R
     A            I97       R
     A            I98       R
     A            I99       R
     A            I100      R
     A            I101      R
     A            I102      R
     A            I103      R
     A            I104      R
     A            I105      R
     A            I106      R
     A            I107      R
     A            I108      R
     A            I109      R
     A            I110      R
     A            I111      R
     A            I112      R
     A            I113      R
     A            I114      R
     A            I115      R
     A            I116      R
     A            I117      R
     A            I118      R
     A            I119      R
     A            I120      R
     A            I121      R
     A            I122      R
     A            I123      R
     A            I124      R
     A            I125      R
     A            I126      R
     A            I127      R
     A            I128      R
     A            I129      R
     A            I130      R
     A            I131      R
     A            I132      R
     A            I133      R
     A            I134      R
     A            I135      R
     A            I136      R
     A            I137      R
     A            I138      R
     A            I139      R
     A            I140      R
     A            I141      R
     A            I142      R
     A            I143      R
     A            I144      R
     A            I145      R
     A            I146      R
     A            I147      R
     A            I148      R
     A            I149      R
     A            I150      R
     A            I151      R
     A            I152      R
     A            I153      R
     A            I154      R
     A            I155      R
     A            I156      R
     A            I157      R
     A            I158      R
     A            I159      R
     A            I160      R
     A            I161      R
     A            I162      R
     A            I163      R
     A            I164      R
     A            I165      R
     A            I166      R
     A            I167      R
     A            I168      R
     A            I169      R
     A            I170      R
     A            I171      R
     A            I172      R
     A            I173      R
     A            I174      R
     A            I175      R
     A            I176      R
     A            I177      R
     A            I178      R
     A            I179      R
     A            I180      R
     A            I181      R
     A            I182      R
     A            I183      R
     A            I184      R
     A            I185      R
     A            I186      R
     A            I187      R
     A            I188      R
     A            I189      R
     A            I190      R
     A            I191      R
     A            I192      R
     A            I193      R
     A            I194      R
     A            I195      R
     A            I196      R
     A            I197      R
     A            I198      R
     A            I199      R
     A            I200      R
     A            I201      R
     A            I202      R
     A            I203      R
     A            I204      R
     A            I205      R
     A            I206      R
     A            I207      R
     A            I208      R
     A            I209      R
     A            I210      R
     A            I211      R
     A            I212      R
     A            I213      R
     A            I214      R
     A            I215      R
     A            I216      R
     A            I217      R
     A            I218      R
     A            I219      R
     A            I220      R
     A            I221      R
     A            I222      R
     A            I223      R
     A            I224      R
     A            I225      R
     A            I226      R
     A            I227      R
     A            I228      R
     A            I229      R
     A            I230      R
     A            I231      R
     A            I232      R
     A            I233      R
     A            I234      R
     A            I235      R
     A            I236      R
     A            I237      R
     A            I238      R
     A            I239      R
     A            I240      R
     A            I241      R
     A            I242      R
     A            I243      R
     A            I244      R
     A            I245      R
     A            I246      R
     A            I247      R
     A            I248      R
     A            I249      R
     A            I250      R
     A            I251      R
     A            I252      R
     A            I253      R
     A            I254      R
     A            I255      R
     A            I256      R
     A            I257      R
     A            I258      R
     A            I259      R
     A            I260      R
     A            I261      R
     A            I262      R
     A            I263      R
     A            I264      R
     A            I265      R
     A            I266      R
     A            I267      R
     A            I268      R
     A            I269      R
     A            I270      R
     A            I271      R
     A            I272      R
     A            I273      R
     A            I274      R
     A            I275      R
     A            I276      R
     A            I277      R
     A            I278      R
     A            I279      R
     A            I280      R
     A            I281      R
     A            I282      R
     A            I283      R
     A            I284      R
     A            I285      R
     A            I286      R
     A            I287      R
     A            I288      R
     A            I289      R
     A            I290      R
     A            I291      R
     A            I292      R
     A            I293      R
     A            I294      R
     A            I295      R
     A            I296      R
     A            I297      R
     A            I298      R
     A            I299      R
     A            I300      R
     A            I301      R
     A            I302      R
     A            I303      R
     A            I304      R
     A            I305      R
     A            I306      R
     A            I307      R
     A            I308      R
     A            I309      R
     A            I310      R
     A            I311      R
     A            I312      R
     A            I313      R
     A            I314      R
     A            I315      R
     A            I316      R
     A            I317      R
     A            I318      R
     A            I319      R
     A            I320      R
     A            I321      R
     A            I322      R
     A            I323      R
     A            I324      R
     A            I325      R
     A            I326      R
     A            I327      R
     A            I328      R
     A            I329      R
     A            I330      R
     A            I331      R
     A            I332      R
     A            I333      R
     A            I334      R
     A            I335      R
     A            I336      R
     A            I337      R
     A            I338      R
     A            I339      R
     A            I340      R
     A            I341      R
     A            I342      R
     A            I343      R
     A            I344      R
     A            I345      R
     A            I346      R
