      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE EXTEL Hdr Rec L-FTA Equity Grps')
     A********************************************************************
     A**                                                                **
     A*  Midas - Securities Trading Module
     A**                                                                **
     A**     PF/EXTF4L - HEADER L - FTA EQUITY GROUPS                   **
     A**                                                                **
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A**                                                                **
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A**     LAST AMEND NO. 00               DATE 00/00/00              **
     A**                                                                **
     A********************************************************************
     A*                                                                  *
     A*      Description of Amendment                                    *
     A*                                                                  *
     A*      No. 000000    Text:                                         *
     A*                                                                  *
     A********************************************************************
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A********************************************************************
     A*
     A                                      REF(MFRFL)
     A*
     A          R EXTF4LF                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            F1SCP     R
     A            XRTYP     R
     A            XFDAT     R
     A            XFSN      R
     A            X2YDT     R
     A*
     A            L1        R
     A            L2        R
     A            L3        R
     A            L4        R
     A            L5        R
     A            L6        R
     A            L7        R
     A            L8        R
     A            L9        R
     A            L10       R
     A            L11       R
     A            L12       R
     A            L13       R
     A            L14       R
     A            L15       R
     A            L16       R
     A            L17       R
     A            L18       R
     A            L19       R
     A            L20       R
     A            L21       R
     A            L22       R
     A            L23       R
     A            L24       R
     A            L25       R
     A            L26       R
     A            L27       R
     A            L28       R
     A            L29       R
     A            L30       R
     A            L31       R
     A            L32       R
     A            L33       R
     A            L34       R
     A            L35       R
     A            L36       R
     A            L37       R
     A            L38       R
     A            L39       R
     A            L40       R
     A            L41       R
     A            L42       R
     A            L43       R
     A            L44       R
     A            L45       R
     A            L46       R
     A            L47       R
     A            L48       R
     A            L49       R
     A            L50       R
     A            L51       R
     A            L52       R
     A            L53       R
     A            L54       R
     A            L55       R
     A            L56       R
     A            L57       R
     A            L58       R
     A            L59       R
     A            L60       R
     A            L61       R
     A            L62       R
     A            L63       R
     A            L64       R
     A            L65       R
     A            L66       R
     A            L67       R
     A            L68       R
     A            L69       R
     A            L70       R
     A            L71       R
     A            L72       R
     A            L73       R
     A            L74       R
     A            L75       R
     A            L76       R
     A            L77       R
     A            L78       R
     A            L79       R
     A            L80       R
     A            L81       R
     A            L82       R
     A            L83       R
     A            L84       R
     A            L85       R
     A            L86       R
     A            L87       R
     A            L88       R
     A            L89       R
     A            L90       R
     A            L91       R
     A            L92       R
     A            L93       R
     A            L94       R
     A            L95       R
     A            L96       R
     A            L97       R
     A            L98       R
     A            L99       R
     A            L100      R
     A            L101      R
     A            L102      R
     A            L103      R
     A            L104      R
     A            L105      R
     A            L106      R
     A            L107      R
     A            L108      R
     A            L109      R
     A            L110      R
     A            L111      R
     A            L112      R
     A            L113      R
     A            L114      R
     A            L115      R
     A            L116      R
     A            L117      R
     A            L118      R
     A            L119      R
     A            L120      R
     A            L121      R
     A            L122      R
     A            L123      R
     A            L124      R
     A            L125      R
     A            L126      R
     A            L127      R
     A            L128      R
     A            L129      R
     A            L130      R
     A            L131      R
     A            L132      R
     A            L133      R
     A            L134      R
     A            L135      R
     A            L136      R
     A            L137      R
     A            L138      R
     A            L139      R
     A            L140      R
     A            L141      R
     A            L142      R
     A            L143      R
     A            L144      R
     A            L145      R
     A            L146      R
     A            L147      R
     A            L148      R
     A            L149      R
     A            L150      R
     A            L151      R
     A            L152      R
     A            L153      R
     A            L154      R
     A            L155      R
     A            L156      R
     A            L157      R
     A            L158      R
     A            L159      R
     A            L160      R
     A            L161      R
     A            L162      R
     A            L163      R
     A            L164      R
