      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE - EXTEL New Database')
      ********************************************************************
      *                                                                  *
     A*  Midas - Securities Trading Module
      *                                                                  *
      *      PF/NEXCDBP - NEW EXTEL DATABASE                             *
      *                    - PACKED VERSION                              *
      *                                                                  *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                                  *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *      LAST AMEND NO. 00               DATE 00/00/00               *
      *                                                                  *
      *------------------------------------------------------------------*
      *                                                                  *
      *    Description of Amendment.                                     *
      *    No. 00     Text:                                              *
      *                                                                  *
      *                                                                  *
      *                                                                  *
     A********************************************************************
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
      ********************************************************************
      *
     A                                      REF(MFRFL)
      *
     A          R NEXCDBPF                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            A1SCP     R
     A            A1RCIP    R
     A            A1LDIP    R
     A            A3P       R
     A            A4P       R
     A            A5P       R
     A            A6P       R
     A            A7P       R
     A            A8P       R
     A            A9P       R
     A            A10P      R
     A            A11P      R
     A            A12P      R
     A            A13P      R
      *
     A            A2SCP     R
     A            A2RCIP    R
     A            AS1P      R
     A            AS2P      R
     A            AS3P      R
     A            AS4P      R
     A            AS5P      R
     A            AS6P      R
     A            AS7P      R
     A            AS8P      R
     A            AS9P      R
     A            AS10P     R
     A            AS11P     R
     A            AS12P     R
     A            AS13P     R
     A            AS16P     R
     A            AS17P     R
     A            AS14P     R
      *
     A            B1SCP     R
     A            B1RCIP    R
     A            B1P       R
     A            B2P       R
     A            B3P       R
     A            B4P       R
     A            B5P       R
     A            B6P       R
     A            B7P       R
     A            B8P       R
     A            B9P       R
     A            B10P      R
     A            B11P      R
      *
     A            B2SCP     R
     A            B2RCIP    R
     A            BS1P      R
     A            BS2P      R
     A            BS3P      R
     A            BS4P      R
     A            BS5P      R
     A            BS6P      R
     A            BS7P      R
     A            BS8P      R
     A            BS9P      R
     A            BS10P     R
     A            BS11P     R
      *
     A            C1SCP     R
     A            C1RCIP    R
     A            C1P       R
     A            C2P       R
     A            C3P       R
     A            C17P      R
     A            C4P       R
     A            C5P       R
     A            C6P       R
     A            C7P       R
     A            C8P       R
     A            C9P       R
     A            C10P      R
     A            C11P      R
     A            C12P      R
     A            C13P      R
     A            C14P      R
     A            C15P      R
     A            C16P      R
      *
     A            C2SCP     R
     A            C2RCIP    R
     A            CS1P      R
     A            CS2P      R
     A            CS3P      R
     A            CS4P      R
     A            CS5P      R
     A            CS6P      R
     A            CS7P      R
     A            CS8P      R
     A            CS9P      R
     A            CS10P     R
     A            CS11P     R
     A            CS12P     R
      *
     A            D1SCP     R
     A            D1RCIP    R
     A            D1P       R
     A            D2P       R
     A            D3P       R
     A            D4P       R
     A            D5P       R
     A            D6P       R
     A            D7P       R
     A            D8P       R
     A            DS5P      R
     A            DS6P      R
     A            DS1P      R
     A            DS2P      R
     A            DS3P      R
     A            DS4P      R
     A            DS7P      R
     A            DS8P      R
      *
     A            D2SCP     R
     A            D2RCIP    R
     A            D9P       R
     A            D10P      R
     A            D11P      R
     A            D12P      R
     A            D13P      R
     A            D14P      R
     A            DS13P     R
     A            DS14P     R
     A            DS9P      R
     A            DS10P     R
     A            DS11P     R
     A            DS12P     R
     A            DS15P     R
     A            DS16P     R
      *
     A            D3SCP     R
     A            D3RCIP    R
     A            D15P      R
     A            D16P      R
     A            D17P      R
     A            D18P      R
     A            D19P      R
     A            D20P      R
     A            DS21P     R
     A            DS22P     R
     A            DS17P     R
     A            DS18P     R
     A            DS19P     R
     A            DS20P     R
     A            DS23P     R
     A            DS24P     R
      *
     A            D4SCP     R
     A            D4RCIP    R
     A            D21P      R
     A            D22P      R
     A            D23P      R
     A            D24P      R
     A            D25P      R
     A            D26P      R
     A            DS29P     R
     A            DS30P     R
     A            DS25P     R
     A            DS26P     R
     A            DS27P     R
     A            DS28P     R
     A            DS31P     R
     A            DS32P     R
      *
     A            D5SCP     R
     A            D5RCIP    R
     A            D27P      R
     A            D28P      R
     A            D29P      R
     A            D30P      R
     A            D31P      R
     A            D32P      R
     A            DS37P     R
     A            DS38P     R
     A            DS33P     R
     A            DS34P     R
     A            DS35P     R
     A            DS36P     R
     A            DS39P     R
     A            DS40P     R
      *
     A            D6SCP     R
     A            D6RCIP    R
     A            D33P      R
     A            D34P      R
     A            D35P      R
     A            D36P      R
     A            D37P      R
     A            D38P      R
     A            D39P      R
     A            D40P      R
     A            D41P      R
     A            D42P      R
     A            DS41P     R
     A            DS42P     R
     A            DS43P     R
     A            DS44P     R
     A            DS45P     R
     A            DS46P     R
      *
     A            D7SCP     R
     A            D7RCIP    R
     A            D43P      R
     A            D44P      R
     A            D45P      R
     A            D46P      R
     A            D47P      R
     A            D48P      R
     A            D49P      R
     A            D50P      R
     A            DS47P     R
     A            DS48P     R
     A            DS49P     R
     A            DS50P     R
     A            DS51P     R
     A            DS52P     R
      *
     A            D8SCP     R
     A            D8RCIP    R
     A            D51P      R
     A            D52P      R
     A            D53P      R
     A            D54P      R
     A            D55P      R
     A            D56P      R
     A            D57P      R
     A            D58P      R
     A            DS53P     R
     A            DS54P     R
     A            DS55P     R
     A            DS56P     R
     A            DS57P     R
     A            DS58P     R
      *
     A            D9SCP     R
     A            D9RCIP    R
     A            D59P      R
     A            D60P      R
     A            D61P      R
     A            D62P      R
     A            D63P      R
     A            D64P      R
     A            D65P      R
     A            D66P      R
     A            DS59P     R
     A            DS60P     R
     A            DS61P     R
     A            DS62P     R
     A            DS63P     R
     A            DS64P     R
      *
     A            DASCP     R
     A            DARCIP    R
     A            D67P      R
     A            D68P      R
     A            D69P      R
     A            D70P      R
     A            D71P      R
     A            D72P      R
     A            D73P      R
     A            D74P      R
     A            DS65P     R
     A            DS66P     R
     A            DS67P     R
     A            DS68P     R
     A            DS69P     R
     A            DS70P     R
      *
     A            DBSCP     R
     A            DBRCIP    R
     A            D75P      R
     A            D76P      R
     A            D77P      R
     A            D78P      R
     A            D79P      R
     A            D80P      R
     A            D81P      R
     A            D82P      R
     A            D83P      R
     A            D84P      R
      *
     A            DCSCP     R
     A            DCRCIP    R
     A            DS71P     R
     A            DS72P     R
     A            DS73P     R
     A            DS74P     R
     A            DS75P     R
     A            DS76P     R
     A            DS77P     R
      *
     A            E1SCP     R
     A            E1RCIP    R
     A            E1P       R
     A            E2P       R
     A            E3P       R
     A            E4P       R
     A            ES1P      R
     A            ES2P      R
     A            ES3P      R
     A            ES4P      R
     A            ES5P      R
     A            ES6P      R
     A            ES7P      R
     A            ES8P      R
     A            ES9P      R
     A            ES10P     R
     A            ES11P     R
     A            ES12P     R
     A            ES13P     R
      *
     A            F1SCP     R
     A            F1RCIP    R
     A            F1P       R
     A            F2P       R
     A            F11P      R
     A            F3P       R
     A            F4P       R
     A            F5P       R
     A            F6P       R
     A            F7P       R
     A            F8P       R
     A            F9P       R
     A            F10P      R
      *
     A            F2SCP     R
     A            F2RCIP    R
     A            FS1P      R
     A            FS2P      R
     A            FS3P      R
     A            FS4P      R
     A            FS5P      R
     A            FS6P      R
     A            FS7P      R
     A            FS8P      R
     A            FS9P      R
     A            FS10P     R
     A            FS11P     R
     A            FS12P     R
     A            FS13P     R
     A            FS14P     R
     A            FS15P     R
     A            FS16P     R
     A            FS17P     R
     A            FS18P     R
     A            FS19P     R
     A            FS20P     R
     A            FS21P     R
     A            FS22P     R
     A            FS23P     R
     A            FS24P     R
     A            FS25P     R
     A            FS26P     R
     A            FS27P     R
     A            FS28P     R
     A            FS29P     R
     A            FS30P     R
     A            FS31P     R
     A            FS32P     R
      *
     A            G1SCP     R
     A            G1RCIP    R
     A            G1P       R
     A            G2P       R
     A            G3P       R
     A            G4P       R
     A            G5P       R
     A            G6P       R
     A            G7P       R
      *
     A            H1SCP     R
     A            H1RCIP    R
     A            H1P       R
     A            H2P       R
     A            H3P       R
     A            H4P       R
     A            H5P       R
     A            H6P       R
     A            H7P       R
     A            H8P       R
     A            H10P      R
     A            H11P      R
      *
     A            H2SCP     R
     A            H2RCIP    R
     A            HS1P      R
     A            HS2P      R
     A            HS3P      R
     A            HS4P      R
     A            HS5P      R
     A            HS6P      R
     A            HS7P      R
     A            HS8P      R
     A            HS9P      R
      *
     A            J1SCP     R
     A            J1RCIP    R
     A            J1P       R
     A            J2P       R
     A            J3P       R
     A            J4P       R
     A            J5P       R
     A            J6P       R
     A            J7P       R
     A            JS1P      R
     A            JS2P      R
      *
     A            K1SCP     R
     A            K1RCIP    R
     A            K1P       R
     A            K2P       R
     A            K3P       R
     A            K4P       R
     A            K5P       R
     A            K6P       R
     A            K7P       R
     A            K8P       R
     A            K9P       R
     A            K10P      R
     A            K11P      R
     A            K12P      R
     A            K13P      R
     A            K14P      R
     A            K15P      R
     A            K16P      R
     A            K17P      R
     A            K18P      R
     A            K19P      R
     A            K20P      R
     A            K21P      R
     A            K22P      R
     A            K23P      R
     A            K24P      R
     A            K25P      R
     A            K26P      R
     A            K27P      R
     A            K28P      R
     A            KS1P      R
      *
     A            K2SCP     R
     A            K2RCIP    R
     A            KS2P      R
     A            KS3P      R
     A            KS4P      R
     A            KS5P      R
     A            KS6P      R
     A            KS7P      R
     A            KS8P      R
     A            KS9P      R
     A            KS10P     R
     A            KS11P     R
     A            KS12P     R
     A            KS13P     R
     A            KS14P     R
     A            KS15P     R
     A            KS16P     R
     A            KS17P     R
     A            KS18P     R
     A            KS19P     R
     A            KS20P     R
     A            KS21P     R
     A            KS22P     R
     A            KS23P     R
      *
     A            L1SCP     R
     A            L1RCIP    R
     A            L1P       R
     A            L2P       R
     A            L3P       R
     A            L4P       R
     A            L5P       R
     A            L6P       R
     A            L7P       R
     A            L8P       R
     A            L9P       R
     A            L10P      R
     A            L11P      R
     A            L12P      R
     A            L13P      R
     A            L14P      R
     A            L15P      R
     A            L16P      R
     A            L17P      R
     A            L18P      R
     A            L19P      R
     A            L20P      R
     A            L21P      R
     A            LS1P      R
     A            LS2P      R
     A            LS3P      R
      *
     A            R1SCP     R
     A            R1RCIP    R
     A            R1P       R
     A            R2P       R
     A            R76P      R
      *
     A            R2SCP     R
     A            R2RCIP    R
     A            R3P       R
     A            R4P       R
     A            R5P       R
     A            R6P       R
     A            R7P       R
     A            R8P       R
     A            R9P       R
     A            R10P      R
     A            R11P      R
     A            R12P      R
     A            R13P      R
     A            R14P      R
     A            R15P      R
     A            R16P      R
     A            R17P      R
     A            R18P      R
     A            R19P      R
     A            R77P      R
     A            R78P      R
      *
     A            R3SCP     R
     A            R3RCIP    R
     A            R20P      R
     A            R21P      R
     A            R22P      R
     A            R23P      R
     A            R24P      R
     A            R25P      R
     A            R26P      R
     A            R79P      R
      *
     A            R4SCP     R
     A            R4RCIP    R
     A            R27P      R
     A            R28P      R
     A            R29P      R
     A            R30P      R
     A            R31P      R
     A            R32P      R
     A            R33P      R
     A            R34P      R
     A            R35P      R
     A            R36P      R
     A            R37P      R
     A            R38P      R
     A            R39P      R
     A            R40P      R
     A            R41P      R
     A            R42P      R
     A            R43P      R
     A            R44P      R
     A            R45P      R
     A            R46P      R
     A            R47P      R
     A            R48P      R
     A            R49P      R
     A            R50P      R
     A            R51P      R
     A            R52P      R
     A            R53P      R
     A            R54P      R
     A            R55P      R
     A            R56P      R
     A            R57P      R
     A            R58P      R
     A            R59P      R
     A            R60P      R
     A            R61P      R
     A            R62P      R
     A            R63P      R
     A            R80P      R
     A            R81P      R
      *
     A            R5SCP     R
     A            R5RCIP    R
     A            R64P      R
     A            R65P      R
     A            R66P      R
     A            R67P      R
     A            R68P      R
     A            R69P      R
     A            R70P      R
     A            R71P      R
     A            R72P      R
     A            R73P      R
     A            R74P      R
     A            R75P      R
     A            R82P      R
     A            R83P      R
      *
     A            R6SCP     R
     A            R6RCIP    R
     A            RS1P      R
     A            RS2P      R
     A            RS3P      R
     A            RS4P      R
     A            RS5P      R
     A            RS6P      R
     A            RS7P      R
     A            RS8P      R
     A            RS9P      R
     A            RS10P     R
     A            RS11P     R
     A            RS12P     R
     A            RS13P     R
     A            RS14P     R
     A            RS15P     R
     A            RS16P     R
     A            RS17P     R
     A            RS18P     R
     A            RS19P     R
     A            RS20P     R
     A            RS21P     R
     A            RS22P     R
     A            RS23P     R
