      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE Corporate Actions - Rights')
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *  PF/SECORGPD - Corporate Actions - Rights                     *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CSE007             Date 14Oct97               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSE007 - Corporate Actions                                   *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A*
     A          R SECORGD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*
     A            MFRECI    R               REFFLD(RECI)
     A*
     A            MFLCD     R               REFFLD(LCD)
     A            MFCHTP    R               REFFLD(CHTP)
     A            MFLUID    R               REFFLD(USER)
     A*
     A            MFCORF    R               REFFLD(ERRF)
     A                                      TEXT('Reference Number')
     A                                      COLHDG('Reference' 'Number')
     A*
     A            MFOPTN    R               REFFLD(NUM2)
     A                                      TEXT('Option Number')
     A                                      COLHDG('Option' 'Number')
     A            MFNSEC    R               REFFLD(SESN)
     A                                      TEXT('New Security Shortname')
     A                                      COLHDG('New' 'Security' 'Shortname')
     A            MFRIMP    R               REFFLD(PRIC)
     A                                      TEXT('Rights Market Price')
     A                                      COLHDG('Rights' 'Market' 'Price')
     A            MFNSHA    R               REFFLD(REXCHG)
     A                                      TEXT('Number of New Shares')
     A                                      COLHDG('Number of' 'New' 'Shares')
     A            MFOSHA    R               REFFLD(REXCHG)
     A                                      TEXT('Number of Old Shares')
     A                                      COLHDG('Number of' 'Old' 'Shares')
     A            MFADRE    R               REFFLD(IND)
     A                                      TEXT('Add/Replace')
     A                                      COLHDG('Add/replace' 'Indicator')
     A            MFDMLT    R               REFFLD(AMAM)
     A                                      TEXT('Denomination Multiplier')
     A                                      COLHDG('Denomination' 'Multiplier')
     A            MFDIVR    R               REFFLD(NUMI)
     A                                      TEXT('Dividend Right')
     A                                      COLHDG('Dividend Right')
     A            MFDFNR    R               REFFLD(IND)
     A                                      TEXT('Default for no reply')
     A                                      COLHDG('Default' 'for no' 'reply')
     A            MFRNDN    R               REFFLD(IND)
     A                                      TEXT('Rounding')
     A                                      COLHDG('Rounding')
     A            MFRNDS    R               REFFLD(IND)
     A                                      TEXT('Rounding Settlement in cash')
     A                                      COLHDG('Rounding' 'Settl.' 'cash')
     A            MFCOMP    R               REFFLD(PRIC)
     A                                      TEXT('Compensation Price')
     A                                      COLHDG('Compensation' 'Price')
     A            MFOPT1    R               REFFLD(IND)
     A                                      TEXT('Customer Option 1')
     A                                      COLHDG('Customer' 'Option 1')
     A            MFNAR1    R               REFFLD(NARC1)
     A                                      TEXT('Option Narrative 1')
     A                                      COLHDG('Option' 'Narrative 1')
     A            MFOPT2    R               REFFLD(IND)
     A                                      TEXT('Customer Option 2')
     A                                      COLHDG('Customer' 'Option 2')
     A            MFNAR2    R               REFFLD(NARC1)
     A                                      TEXT('Option Narrative 2')
     A                                      COLHDG('Option' 'Narrative 2')
     A            MFOPT3    R               REFFLD(IND)
     A                                      TEXT('Customer Option 3')
     A                                      COLHDG('Customer' 'Option 3')
     A            MFNAR3    R               REFFLD(NARC1)
     A                                      TEXT('Option Narrative 3')
     A                                      COLHDG('Option' 'Narrative 3')
     A            MFOPT4    R               REFFLD(IND)
     A                                      TEXT('Customer Option 4')
     A                                      COLHDG('Customer' 'Option 4')
     A            MFNAR4    R               REFFLD(NARC1)
     A                                      TEXT('Option Narrative 4')
     A                                      COLHDG('Option' 'Narrative 4')
     A            MFOPT5    R               REFFLD(IND)
     A                                      TEXT('Customer Option 5')
     A                                      COLHDG('Customer' 'Option 5')
     A            MFNAR5    R               REFFLD(NARC1)
     A                                      TEXT('Option Narrative 5')
     A                                      COLHDG('Option' 'Narrative 5')
     A            MFOPT6    R               REFFLD(IND)
     A                                      TEXT('Customer Option 6')
     A                                      COLHDG('Customer' 'Option 6')
     A            MFNAR6    R               REFFLD(NARC1)
     A                                      TEXT('Option Narrative 6')
     A                                      COLHDG('Option' 'Narrative 6')
     A            MFOPT7    R               REFFLD(IND)
     A                                      TEXT('Customer Option 7')
     A                                      COLHDG('Customer' 'Option 7')
     A            MFNAR7    R               REFFLD(NARC1)
     A                                      TEXT('Option Narrative 7')
     A                                      COLHDG('Option' 'Narrative 7')
     A            MFOPSH    R               REFFLD(NARR)
     A                                      TEXT('Option Shortname')
     A                                      COLHDG('Option' 'Shortname')
     A            MFTXT1    R               REFFLD(BEQ5N)
     A                                      TEXT('Narrative 1')
     A                                      COLHDG('Narrative 1')
     A            MFTXT2    R               REFFLD(BEQ5N)
     A                                      TEXT('Narrative 2')
     A                                      COLHDG('Narrative 2')
     A            MFTXT3    R               REFFLD(BEQ5N)
     A                                      TEXT('Narrative 3')
     A                                      COLHDG('Narrative 3')
     A            MFTXT4    R               REFFLD(BEQ5N)
     A                                      TEXT('Narrative 4')
     A                                      COLHDG('Narrative 4')
     A            MFSUBF    R               REFFLD(DATE )
     A                                      TEXT('Subscription From')
     A                                      COLHDG('Subscription' 'From')
     A            MFSUBT    R               REFFLD(DATE )
     A                                      TEXT('Subscription To')
     A                                      COLHDG('Subscription' 'To')
     A            MFAVOP    R               REFFLD(IND)
     A                                      TEXT('Average Price Option')
     A                                      COLHDG('Average' 'Price' 'Option')
     A            MFSBRS    R               REFFLD(SECS)
     A                                      TEXT('Subscription Right Shortname')
     A                                      COLHDG('Subs. Right' 'Shortname')
     A            MFSBRP    R               REFFLD(PRIC)
     A                                      TEXT('Subscription Right Price')
     A                                      COLHDG('Subs. Right' 'Price')
     A            MFREXD    R               REFFLD(DATE )
     A                                      TEXT('Right Exercise Ex-date')
     A                                      COLHDG('Right' 'Exercise' 'Ex-date')
     A            MFREXA    R               REFFLD(DATE )
     A                                      TEXT('Right Exercise Alloc. Date')
     A                                      COLHDG('Right' 'Ex. Alloc' 'Date')
     A            MFREAT    R               REFFLD(OPTN)
     A                                      TEXT('Rights Corporate Action Type')
     A                                      COLHDG('Rights' 'Corp. Act.' 'Type')
     A            MFRNNS    R               REFFLD(REXCHG)
     A                                      TEXT('Rights - Nber of New Shares')
     A                                      COLHDG('Rights' 'Nber' 'New Shares')
     A            MFRNRI    R               REFFLD(REXCHG)
     A                                      TEXT('Rights - Nber of Rights')
     A                                      COLHDG('Rights' 'Nber of' 'Rights')
     A            MFRMLT    R               REFFLD(AMAM)
     A                                      TEXT('Rights - Denomination Mult.')
     A                                      COLHDG('Rights' 'Denom.' 'Mult.')
     A            MFRDIV    R               REFFLD(NUMI)
     A                                      TEXT('Rights - Dividend Right')
     A                                      COLHDG('Rights' 'Dividend' 'Right')
     A            MFRTRF    R               REFFLD(DATE)
     A                                      TEXT('Rights - Trading From Date')
     A                                      COLHDG('Rights' 'Trading' 'Frm Dte')
     A            MFRTRT    R               REFFLD(DATE)
     A                                      TEXT('Rights - Trading To Date')
     A                                      COLHDG('Rights' 'Trading' 'To Date')
