      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE Corporate Actions - Reply Handling Hist.')
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *  PF/SECORHPD - Corporate Actions - Reply Handling History     *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CSE007             Date 27Nov97               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CSE007 - Corporate Actions                                   *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A*
     A          R SECORHD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*
     A            MPRECI    R               REFFLD(RECI)
     A*
     A            MPLCD     R               REFFLD(LCD)
     A            MPCHTP    R               REFFLD(CHTP)
     A            MPLUID    R               REFFLD(USER)
     A*
     A            MPCORF    R               REFFLD(ERRF)
     A                                      TEXT('Reference Number')
     A                                      COLHDG('Reference' 'Number')
     A            MPCOTP    R               REFFLD(ERTE)
     A                                      TEXT('Customer/Book Indicator')
     A                                      COLHDG('Cust/Book' 'Indicator')
     A            MPBOOK    R               REFFLD(BOKC)
      * Begin /CSD027/
     A**********  MPCNUM    R               REFFLD(CNUM)                                      CSD027
     A            MPCNUM         6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            MPRHRE    R               REFFLD(OPTN)
     A                                      TEXT('Reply Option')
     A                                      COLHDG('Reply' 'Option')
     A            MPRHTI    R               REFFLD(TIME)
     A                                      TEXT('Reply Time')
     A                                      COLHDG('Reply' 'Time')
     A            MPRHDT    R               REFFLD(RUND)
     A                                      TEXT('Reply Date')
     A                                      COLHDG('Reply' 'Date')
     A            MPRHNA    R               REFFLD(NAGR)
     A                                      TEXT('Reply Method')
     A                                      COLHDG('Reply' 'Method')
     A            MPRHCA    R               REFFLD(TAX5)
     A                                      TEXT('Reply Cash %')
     A                                      COLHDG('Reply' 'Cash %')
     A            MPRHCN    R               REFFLD(AMAM)
     A                                      TEXT('Reply Nominal')
     A                                      COLHDG('Reply' 'Nominal')
     A            MPRHN1    R               REFFLD(CTXT)
     A                                      TEXT('Reply Narrative 1')
     A                                      COLHDG('Reply' 'Narr 1')
     A            MPRHN2    R               REFFLD(CTXT)
     A                                      TEXT('Reply Narrative 2')
     A                                      COLHDG('Reply' 'Narr 2')
     A            MPRHN3    R               REFFLD(CTXT)
     A                                      TEXT('Reply Narrative 3')
     A                                      COLHDG('Reply' 'Narr 3')
     A            MPRHBA    R               REFFLD(IND)
     A                                      TEXT('Block Position')
     A                                      COLHDG('Block' 'Position')
     A            MPRHBF    R               REFFLD(RUND)
     A                                      TEXT('Blocked From Date')
     A                                      COLHDG('Blocked' 'From' 'Date')
     A            MPRHBE    R               REFFLD(RUND)
     A                                      TEXT('Blocked End Date')
     A                                      COLHDG('Blocked' 'End' 'Date')
     A            MPRHLV    R               REFFLD(IND)
     A                                      TEXT('Reply Level Indicator')
     A                                      COLHDG('Reply' 'Level' 'Indicator')
     A*
