      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE Customer Charge Groups Trailer')
     A********************************************************************
     A*                                                                  *
     A*      Midas  SECURITIES TRADING MODULE                            *
     A*                                                                  *
     A*      SECUGRPA  - CUSTOMER CHARGE GROUPS TRAILER                  *
     A*                                                                  *
     A*     (c) Finastra International Limited 2001                      *
     A*                                                                  *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  PREV AMEND NO. S01496             DATE 06JUN94                  *
     A*                 S10984             DATE 20JAN93                  *
     A*                                                                  *
     A********************************************************************
     A*                                                                  *
     A*  MD046248 - Finastra Rebranding                                  *
     A*  S01496  -  Jyske enhancements                                   *
     A*  S10984  -  JYSZRH: CUSTOMER GROUP FOR SE CHARGES                *
     A*                                                                  *
     A********************************************************************
     A                                      REF(MFRFL)
     A          R SECUGRZ0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            CGRECI    R               REFFLD(RECI)
     A            CGNORE    R               REFFLD(NORE)
