      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE Depot Movements - Extension Details')
      *****************************************************************
      *                                                               *
      *  Midas - Security Trading Module                              *
      *                                                               *
      *  PF/SEDPX1PD   - Depot Movements - Extension Details File     *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2005            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CER001  *CREATE    Date 25Apr05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CER001 - LUX Upgrade to Midas Plus                           *
      *                                                               *
      *****************************************************************
     A          R DPTMVDF6                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. 2005')
     A            WNDPSS        10A         TEXT('SECURITY SHORTNAME')
     A            WNDPRN         6A         TEXT('REFERENCE')
     A            WNOPTP         3S 0       TEXT('OPERATION TYPE')
     A            WNEXCF         1S 0       TEXT('EXCESS COLLATERAL FLAG')
     A            WNTIME         6S 0       TEXT('TRANSACTION TIME')
     A                                      COLHDG('TRANSACTION TIME')
     A            WNCABR         1A         TEXT('TO BE EXCLUDED FROM CAB')
     A                                      COLHDG('TO BE EXCLUD. CAB')
     A            WNEXFL         1A         TEXT('EXTRACTED FLAG')
     A                                      COLHDG('EXTRACTED FLAG')
     A            WNCNBR         6A         TEXT('Counterparty Number')
     A                                      COLHDG('Counterparty' 'Number')
     A          K WNDPSS
     A          K WNDPRN
