      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_15WF                                                      *
/*EXI *  TEXT('Midas SE Early Redemptions - References')
     A********************************************************************
     A*                                                                  *
     A*      Midas  SECURITIES TRADING MODULE                            *
     A*                                                                  *
     A*      SEERRFPD  - EARLY REDEMPTIONS - REFERENCES                  *
     A*                                                                  *
      *  (c) Finastra International Limited 2001                      *
     A*                                                                  *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01496             Date 06Jun94               *
      *                 S10978             Date 23Feb93               *
     A*                                                                  *
     A********************************************************************
     A*                                                                  *
      *  MD046248 - Finastra Rebranding                               *
     A*  S01496 - Jyske enhancements                                     *
     A*  S10978 - JYSZUR: EARLY REDEMPTIONS                              *
     A*                                                                  *
     A********************************************************************
      *                                              Begin /S01496/
     A************************************* REF(SEERFRF)
     A                                      REF(MFRFL)
     A          R SEERRFD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*
     A*********** VARECI    R               REFFLD(RECI)
     A*
     A*********** VALCD     R               REFFLD(LCD)
     A*********** VACHTP    R               REFFLD(CHTP)
     A*********** VALUID    R               REFFLD(LUID)
     A*
     A*********** VAERRF    R               REFFLD(ERRF)
     A*
     A*********** VAJOBN    R               REFFLD(JOBN)
     A*********** VAUSER    R               REFFLD(USER)
     A*********** VAJNBR    R               REFFLD(JNBR)
     A*
     A*********** VASESN    R               REFFLD(SESN)
     A*********** VAEREX    R               REFFLD(EREX)
     A*********** VAERRD    R               REFFLD(ERRD)
     A*********** VAERAD    R               REFFLD(ERAD)
     A*********** VAFAID    R               REFFLD(FAID)
     A*********** VAERST    R               REFFLD(ERST)
     A*********** VACORF    R               REFFLD(CORF)
     A*
     A*********** VAERPD    R               REFFLD(ERPD)
     A*********** VAREDP    R               REFFLD(REDP)
     A*********** VARNAR    R               REFFLD(RNAR)
     A*
     A*********** VACFRI    R               REFFLD(CFRI)
     A*********** VACFSI    R               REFFLD(CFSI)
     A*********** VAPOSI    R               REFFLD(POSI)
     A*********** VAEVNI    R               REFFLD(EVNI)
     A*********** VAPM04    R               REFFLD(PM04)
     A*
     A            VARECI    R               REFFLD(RECI)
     A*
     A            VALCD     R               REFFLD(LCD)
     A            VACHTP    R               REFFLD(CHTP)
     A            VALUID    R               REFFLD(USER)
     A*
     A            VAERRF    R               REFFLD(ERRF)
     A*
      *                                              Begin /S01496/
     A**********  VAJOBN    R               REFFLD(LJOB)                  S01496
     A            VAJOBN    R               REFFLD(JOJOB)
     A                                      TEXT('Locked by Job Name')
     A                                      COLHDG('Locked' 'Job' 'Name')
      *                                              End   /S01496/
      *                                              Begin /S01496/
     A**********  VAUSER    R               REFFLD(LUSR)                  S01496
     A            VAUSER    R               REFFLD(USER)
     A                                      TEXT('Locked by User Identifier')
     A                                      COLHDG('Locked' 'User' 'Ident.')
      *                                              End   /S01496/
     A            VAJNBR    R               REFFLD(JONBR)
     A*
     A            VASESN    R               REFFLD(SESN)
      *                                              Begin /S01496/
     A**********  VAEREX    R               REFFLD(EREX)                  S01496
     A            VAEREX    R               REFFLD(RUND)
     A                                      TEXT('Early Redemption Ex-Date')
     A                                      COLHDG('ER' 'Ex-Date')
      *                                              End   /S01496/
      *                                              Begin /S01496/
     A**********  VAERRD    R               REFFLD(ERRD)                  S01496
     A            VAERRD    R               REFFLD(RUND)
     A                                      TEXT('ER Redemption Date')
     A                                      COLHDG('ER' 'Remdpt' 'Date')
      *                                              End   /S01496/
      *                                              Begin /S01496/
     A**********  VAERAD    R               REFFLD(ERAD)                  S01496
     A            VAERAD    R               REFFLD(RUND)
     A                                      TEXT('ER Last Allocation Date')
     A                                      COLHDG('Last' 'Alloc.' 'Date')
      *                                              End   /S01496/
      *                                              Begin /S01496/
     A**********  VAFAID    R               REFFLD(FIAI)                  S01496
     A            VAFAID    R               REFFLD(IND)
     A                                      TEXT('Final Allocation Indicator')
     A                                      COLHDG('Fin' 'Alloc' 'Ind')
      *                                              End   /S01496/
     A            VAERST    R               REFFLD(ERST)
     A            VACORF    R               REFFLD(CORF)
     A*
     A**********  VAERPD    R               REFFLD(ERPD)                  S01496
     A            VAERPD    R               REFFLD(PDTT)
      *                                              Begin /S01496/
     A*********** VAREDP    R               REFFLD(REDP)
     A            VAREDP    R               REFFLD(NOMR)
     A                                      TEXT('Redemption Price')
     A                                      COLHDG('Redemption' 'Price')
      *                                              End   /S01496/
      *                                              Begin /S01496/
     A*********** VARNAR    R               REFFLD(ERNA)
     A            VARNAR    R               REFFLD(NARR)
     A                                      TEXT('Redemption Narrative')
     A                                      COLHDG('Redemption' 'Narrative')
      *                                              End   /S01496/
     A*
     A            VACFRI    R               REFFLD(DCFR)
      *                                              Begin /S01496/
     A*********** VACFSI    R               REFFLD(CFSI)
     A            VACFSI    R               REFFLD(IND)
     A                                      TEXT('Confirmation Status Indic.')
     A                                      COLHDG('Conf' 'Sts' 'Ind')
      *                                              End   /S01496/
      *                                              Begin /S01496/
     A**********  VAPOSI    R               REFFLD(PSEI)                  S01496
     A            VAPOSI    R               REFFLD(IND)
     A                                      TEXT('Position Settlement Indic.')
     A                                      COLHDG('Pos' 'Set' 'Ind')
      *                                              End   /S01496/
      *                                              Begin /S01496/
     A**********  VAEVNI    R               REFFLD(EVNI)                  S01496
     A            VAEVNI    R               REFFLD(IND)
     A                                      TEXT('Trade/Depot Mvmnt event ind')
     A                                      COLHDG('Trades/' 'Dep Mvt' 'Ev Ind')
      *                                              End   /S01496/
      *                                              Begin /S01496/
     A**********  VAPM04    R               REFFLD(PM04)                  S01496
     A            VAPM04    R               REFFLD(IND)
     A                                      TEXT('PM0400 Dailly Trans Indic.')
     A                                      COLHDG('PM0400' 'Trans' 'Ind')
      *                                              End   /S01496/
      *                                              End   /S01496/
