      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE API depot movement invalid defn file')        *
      *****************************************************************
      *                                                               *
      *  Midas - SE Application Program Interface Module              *
      *                                                               *
      *  PF/SEIDPMVPD - Invalid Depot Movement Transaction.           *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CSW210             Date 04May10               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CGL035             Date 01Mar05               *
      *                 CGL029             Date 01Sep03               *
      *                 CSE039             Date 09Jul03               *
      *                 CSE045             Date 24Mar03               *
      * Midas Release 4.01.01 ----------------------------------------*
      *                 207006             Date 18Jun02               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CSE015             Date 06Dec99               *
      *                 CSE017             Date 20Oct99               *
      *                 CSE012             Date 16Aug99               *
      *                 CPB001             Date 23Aug99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CAP003  *CREATE    Date 26May98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSW210 - SWIFT 2010 Changes                                  *
      *  CGL035 - EUSD Upgrade to Midasplus                           *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CSE039 - Auto-settle of trades.                              *
      *  CSE045 - API for Extended Settlement for Trade Input and     *
      *           Depot Movement                                      *
      *  207006 - Add Counterparty & Market Centre to SSI             *
      *  CSE015 - Forward Valued Depot Movements                      *
      *  CSE017 - Cum/Ex Indicator on Depot Movements                 *
      *  CSE012 - SE Depot Movement Narratives.                       *
      *  CPB001 - 'Private Banking' Module                            *
      *  CAP003 - Conversion of SE inputs into modular structure to   *
      *           use as APIs.                                        *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R SEIDPMVD0                 TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
      ** Message contents
      *
     A            FOFFID    R               REFFLD(FOTRNID)
     A                                      TEXT('Front Office Id')
     A            RPRLOC    R               REFFLD(RPRLOC)
     A                                      TEXT('Repair Location')
      *
      ** Action Code
     A            DDACTN         1A         TEXT('Action code')
      *
      ** Security
     A            DDDPSS        10A         TEXT('Security Shortname')
      *
      ** Reference
     A            DDDPRN         6A         TEXT('Reference')
      *
      ** Depot
     A            DDDEPOT       10A         TEXT('Depot')
      *
      ** Date
     A            DDDATE         6A         TEXT('Movement Date')
      *
      ** Booking Branch
     A            DDDPBA         3A         TEXT('Branch')
      *
      ** Originating Branch
     A            DDORBR         3A         TEXT('Originating Branch')
      *
      ** Book
     A            DDDPBK         2A         TEXT('Book')
      *
     A**Start of change CGL035
     A            DDOPDT         6A         TEXT('Original Purchase Date')
     A                                      COLHDG('Original ' +
     A                                      'Purchase Date')
     A**End of change CGL035
      ** Beneficiary Customer
     A            DDDPBN        10A         TEXT('Customer')
      *
      ** Nominal Amount
     A            DDDPNA        12A         TEXT('Nominal')
      *
      ** Narrative
     A            DDDPNR        35A         TEXT('Narrative')
      *
      ** Price
     A            DDMKTP        16A         TEXT('Price')
     A**Start of change CGL035
     A            DDFSPR        16A         TEXT('Fiscal Price')
     A                                      COLHDG('Fiscal Price')
     A**End of change CGL035
      *
      ** Profit Centre
     A            DDDPPC         4A         TEXT('Profit Centre')
      *
      ** Customer Delivery / Withdrawal Indicator
     A            DDCWDI         1A         TEXT('Delivery/Withdrawal Ind')
      *
      ** Portfolio Reference
     A            DDPTFR         4A         TEXT('Portfolio Reference')
     A**Start of change CGL035
     A            DDOPIN        14A         TEXT('Original Purchase Interest')
     A                                      COLHDG('Original ' +
     A                                      'Purchase Interest')
     A**End of change CGL035
      *
      ** Average Yield
     A            DDCYLD        12A         TEXT('Average Yield')
      *
      ** Charge Code
     A            DDDCHC         2A         TEXT('Charge Code')
      *
      ** Charge Settlement type/Method
     A            DDDCSE         2A         TEXT('Settlement type')
      *
      ** Charge Currency
     A            DDDCCE         3A         TEXT('Charge Currency')
      *
      ** Charge Account
     A**Start of change CGL029
     A**********  DDDCAT        12A         TEXT('Charge Account')                            CGL029
     A            QQDCAT        12A
     A**End of change CGL029
      *
      ** Charge Amount
     A            DDDCHA        14A         TEXT('Charge Amount')
      *
      ** Charge Acc Branch
     A            DDDCAB         3A         TEXT('Charge Account Branch')
      *
      ** Movement Type
     A            DDDPMV         2A         TEXT('Movement Type')
      ** Timestamp
     A            DDTSTMP   R               REFFLD(TIMESTMP)
      *                                              Begin /CPB001/
      ** Movement Subtype
     A            DDMSTP         2A         TEXT('Movement Subtype')
      *
      ** Accrued Indicator
     A            DDACIN         1A         TEXT('Accrued Indicator')
      *
      ** Purchased Interst
     A            DDPINT        15A         TEXT('Purchased Interest')
      *
      ** Replication Indicator
     A            DDREPI         1A         TEXT('Replication Indicator')
      *                                              End   /CPB001/
      *                                              Begin /CSE012/
      ** Narrative 2
     A            DDDPNR2   R               REFFLD(DPNR)
     A                                      COLHDG('Narrative 2')
      *
      ** Narrative 3
     A            DDDPNR3   R               REFFLD(DPNR)
     A                                      COLHDG('Narrative 3')
      *
      ** Narrative 4
     A            DDDPNR4   R               REFFLD(DPNR)
     A                                      COLHDG('Narrative 4')
      *
      ** Narrative 5
     A            DDDPNR5   R               REFFLD(DPNR)
     A                                      COLHDG('Narrative 5')
      *                                              End   /CSE012/
      *                                              Begin /CSE017/
     A            DDDPIN    R               REFFLD(ADVI)
     A                                      COLHDG(' Cum/Ex' +
     A                                             'Indicator')
     A            DDDPAP    R               REFFLD(ADVI)
     A                                      COLHDG(' Print ' +
     A                                             ' Advice' +
     A                                             'Indicator')
      *                                              End   /CSE017/
      *                                              Begin /CSE015/
     A            DDDMTD         6A         TEXT('Trade Date')
     A                                      COLHDG('Trade' +
     A                                             'Date')
      *                                              End   /CSE015/
 
     A**Start of change 207006
     A            DDCPTY        10A         TEXT('Counterparty')
     A                                      COLHDG('Counterparty')
      *
     A            DDMRKT         2A         TEXT('Market Centre')
     A                                      COLHDG('Market Centre')
     A**End of change 207006
      **Start of change CSE045
     A            DSGMES         1A         TEXT('Settlement Message Request')
     A                                      COLHDG('Settlmt Msg' 'Request')
      *
     A            DS1522         1A         TEXT('ISO15022 Message indicator')
     A                                      COLHDG('ISO15022' 'Message Ind')
      *
     A            DSINST         3A         TEXT('Instruction Type')
     A                                      COLHDG('Instr' 'Type')
      *
     A            DSINSS         5A         TEXT('Instruction sub-type')
     A                                      COLHDG('Instruct' 'Sub-type')
      *
     A            DSEUCL        10A         TEXT('Euroclear/Clearstream code')
     A                                      COLHDG('Euroclear/' 'Clearstream')
      *
     A            DSSAFA         6A         TEXT('Safekeeping Account')
     A                                      COLHDG('Safekeeping' 'Account')
      *
     A            DSFIND         1A         TEXT('Free or Against payment Ind')
     A                                      COLHDG('Free or' 'Against')
      *
     A            DSPRIC        10A         TEXT('Price')
     A                                      COLHDG('Price')
      *
     A            DSTRTT         4A         TEXT('Time of Transaction')
     A                                      COLHDG('Time of' 'Transaction')
      *
     A            DSTDER        35A         TEXT('Exchange Rate')
     A                                      COLHDG('Exchange Rate')
      *
     A            DSRPTY         1A         TEXT('Requested Priority')
     A                                      COLHDG('Requested' 'Priority')
      *
     A            DSITRA        15A         TEXT('Accrued Interest')
     A                                      COLHDG('Accrued Interest')
      *
     A            DSGDEL         1A         TEXT('Guaranteed Delivery')
     A                                      COLHDG('Guaranteed' 'Delivery')
      *
     A            DSSROL         4A         TEXT('Sender''s Role')
     A                                      COLHDG('Sender''s' 'Role')
      *
     A            DSFCOD         1A         TEXT('Fungibility Code')
     A                                      COLHDG('Fungibility' 'Code')
      *
     A            DSROUC         6A         TEXT('Destination of Confirmation')
     A                                      COLHDG('Destination of' +
     A                                             'Confirmation')
      *
     A            DSROTC        12A         TEXT('Destination of Confirmation')
     A                                      COLHDG('Destination of' +
     A                                             'Confirm (BIC)')
      *
     A            DSGMEC         1A         TEXT('Confirmation Message Request')
     A                                      COLHDG('Confirm Msg' 'Request')
      *
     A            DSSTST         4A         TEXT('Stamp Status')
     A                                      COLHDG('Stamp' 'Status')
      *
     A            DSSIOR         1A         TEXT('Registration Override')
     A                                      COLHDG('Regist' 'Over')
      *
     A            DSTRRM         4A         TEXT('Transaction Report Marker')
     A                                      COLHDG('Transact' 'Report Marker')
      *
     A            DSCHID        30A         TEXT('Charity Identifier')
     A                                      COLHDG('Charity Identifier')
      *
     A            DSAFPN        10A         TEXT('A/c for Payment')
     A                                      COLHDG('A/c for Payment')
      *
     A            DSAFPL        35A         TEXT('A/c for Payment (detail)')
     A                                      COLHDG('A/c for Payment' '(detail)')
      *
     A            DSAWIA         1A         TEXT('A/c with Institution (Tag)')
     A                                      COLHDG('A/c with' 'Institution' +
     A                                             '(Tag)')
      *
     A            DSAWIN        10A         TEXT('A/c with Institution (Cust)')
     A                                      COLHDG('A/c with Institution' +
     A                                             '(Customer Number)')
      *
     A            DSAWIL        35A         TEXT('A/c with Institution (detl)')
     A                                      COLHDG('A/c with Institution' +
     A                                             '(detail)')
      *
     A            DSBOFA         1A         TEXT('Beneficiary of Money (Tag)')
     A                                      COLHDG('Beneficiary' 'of Money' +
     A                                             '(Tag)')
      *
     A            DSBOFN        10A         TEXT('Beneficiary of Money (Cust)')
     A                                      COLHDG('Beneficiary of' +
     A                                             'Money (Cust No)')
      *
     A            DSBOF1        35A         TEXT('Beneficiary of Money (Line1)')
     A                                      COLHDG('Beneficiary of' +
     A                                             'Money (Line 1)')
      *
     A            DSBOF2        35A         TEXT('Beneficiary of Money (Line2)')
     A                                      COLHDG('Beneficiary of' +
     A                                             'Money (Line 2)')
      *
     A            DSSRL1        35A         TEXT('Sender to Receiver Info(Ln1)')
     A                                      COLHDG('Sender to Receiver' +
     A                                             'Information (Line 1)')
      *
     A            DSSRL2        35A         TEXT('Sender to Receiver Info(Ln2)')
     A                                      COLHDG('Sender to Receiver' +
     A                                             'Information (Line 2)')
      *
     A            DSSRL3        35A         TEXT('Sender to Receiver Info(Ln3)')
     A                                      COLHDG('Sender to Receiver' +
     A                                             'Information (Line 3)')
      *
     A            DSFIN1        35A         TEXT('Further Information (line 1)')
     A                                      COLHDG('Further Information' +
     A                                             '(line 1)')
      *
     A            DSFIN2        35A         TEXT('Further Information (line 2)')
     A                                      COLHDG('Further Information' +
     A                                             '(line 2)')
      *
     A            DSRED1        35A         TEXT('Registration Details (line1)')
     A                                      COLHDG('Registration Details' +
     A                                             '(line 1)')
      *
     A            DSRED2        35A         TEXT('Registration Details (line2)')
     A                                      COLHDG('Registration Details' +
     A                                             '(line 2)')
      *
     A            DSNAL1        35A         TEXT('Narrative (Line 1)')
     A                                      COLHDG('Narrative (Line 1)')
      *
     A            DSNAL2        35A         TEXT('Narrative (Line 2)')
     A                                      COLHDG('Narrative (Line 2)')
      *
     A            DSCTYN        10A         TEXT('Counterparty Safekeeping A/c')
     A                                      COLHDG('Counterparty' +
     A                                             'Safekeeping A/c')
      *
     A            DSCTYL        35A         TEXT('Counterparty Safekeeping A/c')
     A                                      COLHDG('Counter Safekeeping' +
     A                                             'A/c (Detail)')
      *
     A            DSIPYN        10A         TEXT('Instructing Party''/Counter')
     A                                      COLHDG('Instructing Party''/' +
     A                                             'Counterparty')
      *
     A            DSIPYL        35A         TEXT('Instructing Party''/Counter')
     A                                      COLHDG('Instructing Party''/' +
     A                                             'Counter (Detail)')
      *
     A            DSINVE        10A         TEXT('Investor')
     A                                      COLHDG('Investor')
      *
     A            DSSKAN        10A         TEXT('Safekeeping A/c')
     A                                      COLHDG('Safekeeping A/c')
      *
     A            DSSKAL        35A         TEXT('Safekeeping A/c (Line)')
     A                                      COLHDG('Safekeeping A/c' +
     A                                             '(Line)')
      *
     A            DSCCTN        12A         TEXT('Clearing Correspondent')
     A                                      COLHDG('Clearing' 'Correspondent')
      *
     A            DSDCTL         6A         TEXT('Deliverer''s Instruct Party')
     A                                      COLHDG('Deliverer''s' 'Ins Party')
      *
     A            DSRSSA         1A         TEXT('Receive of Securities (Tag)')
     A                                      COLHDG('Receiver of' +
     A                                             'Securities' '(Tag)')
      *
     A            DSRSSN        10A         TEXT('Receive of Securities (Cust)')
     A                                      COLHDG('Receiver of' +
     A                                             'Securities (Cust)')
      *
     A            DSRSS1        35A         TEXT('Receiver of Securities (Ln1)')
     A                                      COLHDG('Receiver of' +
     A                                             'Securities (Line 1)')
      *
     A            DSRSS2        35A         TEXT('Receiver of Securities (Ln2)')
     A                                      COLHDG('Receiver of' +
     A                                             'Securities (Line 2)')
      *
     A            DSRSS3        35A         TEXT('Receiver of Securities (Ln3)')
     A                                      COLHDG('Receiver of' +
     A                                             'Securities (Line 3)')
      *
     A            DSRSS4        35A         TEXT('Receiver of Securities (Ln4)')
     A                                      COLHDG('Receiver of' +
     A                                             'Securities (Line 4)')
      *
     A            DSDSSA         1A         TEXT('Deliverer of Secur (Tag)')
     A                                      COLHDG('Deliverer' +
     A                                             'of Secur' '(Tag)')
      *
     A            DSDSSN        10A         TEXT('Deliverer of Secur (Cust)')
     A                                      COLHDG('Deliverer of' +
     A                                             'Secur (Cust)')
      *
     A            DSDSS1        35A         TEXT('Deliverer Securities (Ln1)')
     A                                      COLHDG('Deliverer of' +
     A                                             'Securities (Ln 1)')
      *
     A            DSDSS2        35A         TEXT('Deliverer Securities (Ln2)')
     A                                      COLHDG('Deliverer of' +
     A                                             'Securities (Ln 2)')
      *
     A            DSDSS3        35A         TEXT('Deliverer Securities (Ln3)')
     A                                      COLHDG('Deliverer of' +
     A                                             'Securities (Ln 3)')
      *
     A            DSDSS4        35A         TEXT('Deliverer Securities (Ln4)')
     A                                      COLHDG('Deliverer of' +
     A                                             'Securities (Ln 4)')
      *
     A            DSBSSA         1A         TEXT('Bene Securities (Tag)')
     A                                      COLHDG('Bene of' 'Securities' +
     A                                             '(Tag)')
      *
     A            DSBSSN        10A         TEXT('Bene Securities (Customer)')
     A                                      COLHDG('Bene Securities' +
     A                                             '(Customer)')
      *
     A            DSBSS1        35A         TEXT('Beneficiary Securities (Ln1)')
     A                                      COLHDG('Beneficiary' +
     A                                             'Securities (Ln 1)')
      *
     A            DSBSS2        35A         TEXT('Beneficiary Securities (Ln2)')
     A                                      COLHDG('Beneficiary' +
     A                                             'Securities (Ln 2)')
      *
     A            DSIMMD1       12A         TEXT('Intermediary 1')
     A                                      COLHDG('Intermediary 1')
      *
     A            DSIMSA1       20A         TEXT('Intermediary 1 A/C')
     A                                      COLHDG('Intermediary 1 A/C')
      *
     A            DSIMMD2       12A         TEXT('Intermediary 2')
     A                                      COLHDG('Intermediary 2')
      *
     A            DSIMSA2       20A         TEXT('Intermediary 2 A/C')
     A                                      COLHDG('Intermediary 2 A/C')
      *
     A            DSIMMD3       12A         TEXT('Intermediary 3')
     A                                      COLHDG('Intermediary 3')
      *
     A            DSIMSA3       20A         TEXT('Intermediary 3 A/C')
     A                                      COLHDG('Intermediary 3 A/C')
      *
     A            DSIMMD4       12A         TEXT('Intermediary 4')
     A                                      COLHDG('Intermediary 4')
      *
     A            DSIMSA4       20A         TEXT('Intermediary 4 A/C')
     A                                      COLHDG('Intermediary 4 A/C')
      *
     A            DSIMMD5       12A         TEXT('Intermediary 5')
     A                                      COLHDG('Intermediary 5')
      *
     A            DSIMSA5       20A         TEXT('Intermediary 5 A/C')
     A                                      COLHDG('Intermediary 5 A/C')
      *
     A            DSIMMD6       12A         TEXT('Intermediary 6')
     A                                      COLHDG('Intermediary 6')
      *
     A            DSIMSA6       20A         TEXT('Intermediary 6 A/C')
     A                                      COLHDG('Intermediary 6 A/C')
      *
     A            DSIMMD7       12A         TEXT('Intermediary 7')
     A                                      COLHDG('Intermediary 7')
      *
     A            DSIMSA7       20A         TEXT('Intermediary 7 A/C')
     A                                      COLHDG('Intermediary 7 A/C')
      *
     A            DSIMMD8       12A         TEXT('Intermediary 8')
     A                                      COLHDG('Intermediary 8')
      *
     A            DSIMSA8       20A         TEXT('Intermediary 8 A/C')
     A                                      COLHDG('Intermediary 8 A/C')
      *
     A            DSIMMD9       12A         TEXT('Intermediary 9')
     A                                      COLHDG('Intermediary 9')
      *
     A            DSIMSA9       20A         TEXT('Intermediary 9 A/C')
     A                                      COLHDG('Intermediary 9 A/C')
      *
     A            DSPSET        12A         TEXT('Place of Settlement')
     A                                      COLHDG('Place of Settlement')
      *
     A            DSNAC1        35A         TEXT('Narrative for Cash Parties 1')
     A                                      COLHDG('Narrative for' +
     A                                             'Cash Parties 1')
      *
     A            DSNAC2        35A         TEXT('Narrative for Cash Parties 2')
     A                                      COLHDG('Narrative for' +
     A                                             'Cash Parties 2')
      **End of change CSE045
      ** Start of CSE039
      *
     A            DSNOTM         7A         TEXT('Notification Method')
     A                                      COLHDG('Notification' '   Method')
      *
     A            DSMSGK        40A         TEXT('Message Key')
     A                                      COLHDG('Message Key')
      *
      ** End of CSE039
      *
     A**Start of change CGL029
     A            DDDCAT        18A         TEXT('Charge Account')
     A**End of change CGL029
     A**Start of Change CSW210
     A            DSDIDN        10A         TEXT('Debtor - Identification')
     A                                      COLHDG('Debtor ' +
     A                                             '- Identification')
     A            DSDAD1        35A         TEXT('Debtor - Address 1')
     A                                      COLHDG('Debtor - Address 1')
     A            DSDAD2        35A         TEXT('Debtor - Address 2')
     A                                      COLHDG('Debtor - Address 2')
     A            DSDAD3        35A         TEXT('Debtor - Address 3')
     A                                      COLHDG('Debtor - Address 3')
     A            DSDAD4        35A         TEXT('Debtor - Address 4')
     A                                      COLHDG('Debtor - Address 4')
     A            DSDLIN        35A         TEXT('Debtor - Account Line')
     A                                      COLHDG('Debtor ' +
     A                                            '- Account Line')
     A            DSQFIN        10A         TEXT('Qualified Foreign +
     A                                            Intermediary')
     A                                      COLHDG('Qualified Foreign ' +
     A                                             'Intermediary')
     A            DSPCLR        10A         TEXT('Place of Clearing')
     A                                      COLHDG('Place of Clearing')
     A**End of Change CSW210
