      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Bank of England Securities Extra Data invalid')
      *****************************************************************
      *                                                               *
      *  Midas - Bank of England                                      *
      *                                                               *
      *  PF/SEISECSX0 - Bank of England securities Extra Data valid   *
      *                                                               *
      *  (C) Midas Kapiti International Limited, 2000                 *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. LLN018   *CREATE   DATE 17Apr01               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  Amendment  Details                                           *
      *  ------------------                                           *
      *  LLN018 - Upgrade BoE to APIs and addition of 2 new fields    *
      *           on ICD.
      *                                                               *
      *****************************************************************
      *
     A                                      REF(MFRFL)
     A          R SEISECSD0                 TEXT('(c) Midas Kapiti +
     A                                      International Limited 2001')
     A            LISESN        10A         TEXT('Security Short Name')
     A                                      COLHDG('Security' 'Short Name')
     A            LIGTEE         2A         TEXT('Guarantee Code')
     A                                      COLHDG('Guarantee' 'Code')
     A            LIQUAL         1A         TEXT('Qualifying Flag')
     A                                      COLHDG('Qualifying' 'Flag')
     A            LIAFRT    R               REFFLD(FOTRNID)
     A                                      TEXT('Associated Front +
     A                                            Office Transaction Id')
     A                                      COLHDG('Associated' +
     A                                             'Front Office' +
     A                                             'Transaction Id')
     A            LIREPA    R               REFFLD(RPRLOC)
     A            LITMST    R               REFFLD(TIMESTMP)
