     A*****************************************************************
     A**                                                             **
     A*  Midas - Securities Trading Module                           **
     A**                                                             **
     A**     PF/SERECNPP                                             **
     A**                                                             **
      *  (c) Finastra International Limited 2001                     **
     A**                                                             **
     A**     LAST AMEND NO. DUG507         DATE 04Apr18              **
     A**                                                             **
     A**-------------------------------------------------------------**
     A**                                                             **
     A**     DUG507 - GL & SE Reconciliation Report                  **
     A**            - Applied DUG420 from R4 to FBM                  **
     A**                                                             **
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
/*CRTA*: CRTPF                                                      : *
/*CRTA*: FILE(**********/**********) SRCFILE(**********/**********) : *
/*CRTA*: SRCMBR(*FILE) GENLVL(20) FILETYPE(*DATA) MBR(*FILE)        : *
/*CRTA*: EXPDATE(*NONE) MAXMBRS(1) MAINT(*IMMED) FRCACCPTH(*NO)     : *
/*CRTA*: SIZE(*NOMAX) ALLOCATE(*NO) CONTIG(*NO)                     : *
/*CRTA*: UNIT(*ANY) FRCRATIO(*NONE) WAITFILE(*IMMED)                : *
/*CRTA*: WAITRCD(60) SHARE(*YES) DLTPCT(*NONE) LVLCHK(*NO)          : *
/*CRTA*:    AUT(*USE ) TEXT(*SRCMBRTXT)                             : *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R SERECNP0
     A            BRANCH         3A
     A            ISSR      R
     A            NMCY      R
     A            ACOD      R
     A            SITP      R
     A            SESN      R
     A            BHBK      R
     A            NPSN      R
     A            LAVP      R
     A            PAMT          15P 0
     A            USAMT         15P 0
     A            USEQ           1A
     A          K NMCY
     A          K ACOD
     A          K ISSR
     A          K USEQ
