      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_RU                                                        *
/*EXI *  TEXT('Midas SE Request of statement - status/reference')
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *  PF/SERSTRPD - Midas SE Request of SE Statement -             *
      *                Status/Reference code.                         *
      *                                                               *
      *  (c) Finastra International Limited 2003                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSE040  *CREATE    Date 05Feb03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSE040 - Securities Statement Processing.                    *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R SERSTRD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2003')
      *
     A            RRDATE         5S 0       TEXT('Input Date')
     A                                      COLHDG('Input' 'Date')
      *
     A            RRRSEQ         5S 0       TEXT('Request Sequence')
     A                                      COLHDG('Request' 'Sequence')
      *
     A            RRCSEQ         3S 0       TEXT('Code Sequence')
     A                                      COLHDG('Code' 'Sequence')
      *
     A            RRSTAT         4          TEXT('Status Code')
     A                                      COLHDG('Status' 'Code')
     A            RRSSTA         4          TEXT('Sub Status Code')
     A                                      COLHDG('Sub' 'Status' 'Code')
      *
     A            RRREAS         4          TEXT('Reason Code')
     A                                      COLHDG('Reason' 'Code')
     A            RRSREA         4          TEXT('Sub Reason Code')
     A                                      COLHDG('Sub' 'Reason' 'Code')
      *
     A            RRSESN        10          TEXT('Security Shortname')
     A                                      COLHDG('Security' 'Shortname')
      *
     A            RRREFC         4          TEXT('Reference Code')
     A                                      COLHDG('Reference' 'Code')
     A            RRREFE        16          TEXT('Reference')
     A                                      COLHDG('Reference')
