      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas Safe Custody Fees Accrued         SD')
     A*****************************************************************
     A*                                                               *
     A*      Midas - Portfolio Management Module                  *
     A*                                                               *
     A*  PF/SESCFAPD - Safe Custody Fees Accrued                      *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  Prev Amend No. S01464  *CREATE    Date 04APR94               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*  S01464 - Safe Custody Fees                                   *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A                                      UNIQUE
     A          R SESCFAP0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            SDRECI    R               REFFLD(RECI)
     A            SDDLUP    R               REFFLD(DLUP)
     A            SDMLUP    R               REFFLD(MLUP)
     A            SDYLUP    R               REFFLD(YLUP)
     A            SDTLUP    R               REFFLD(TLUP)
     A            SDCHTP    R               REFFLD(CHTP)
     A            SDLCD     R               REFFLD(LCD)
     A            SDTNLU    R               REFFLD(TNLU)
      * Begin /CSD027/
     A**********  SDCNUM    R               REFFLD(CNUM)                                      CSD027
     A            SDCNUM         6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            SDPTFR    R               REFFLD(PTFR)
     A            SDCFAC    R               REFFLD(CFAC)
     A            SDCSCY    R               REFFLD(CSCY)
     A            SDOSAJ    R               REFFLD(OSAJ)
     A            SDOSAS    R               REFFLD(OSAS)
     A            SDBRCA    R               REFFLD(BRCA)
     A          K SDBRCA
     A          K SDCNUM
     A          K SDPTFR
