      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE Statement production requests')
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *  PF/SESTPRPD - Midas SE Statement Production Requests         *
      *                                                               *
      *  (c) Finastra International Limited 2003                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSE040             Date 08Jan03               *
      *                                    Date DDMmmYY               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSE040 - Securities Statement Processing                     *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R SESTPRD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2003')
      *---------------------------------------------------------------------
      *
     A            SPDATE         5S 0       TEXT('Request Date')
     A                                      COLHDG('Request' 'Date')
     A            SPRSEQ         7S 0       TEXT('Request Sequence')
     A                                      COLHDG('Request' 'Sequence')
      *
     A            SPPRTY         1          TEXT('Priority')
     A                                      COLHDG('Priority')
     A            SPNOTF         1          TEXT('Delivery Notification')
     A                                      COLHDG('Delivery' 'Notification')
      *
     A            SPSNDR         3          TEXT('Sending Branch')
     A                                      COLHDG('Sending' 'Branch')
      *
     A            SPORIG         3          TEXT('Originating Branch')
     A                                      COLHDG('Originating' 'Branch')
      *
     A            SPCUST         6          TEXT('Safekeeping Customer')
     A                                      COLHDG('Safekeeping' 'Customer')
      *
     A            SPTYPE         2          TEXT('Type of Statement')
     A                                      COLHDG('Type of' 'Statement')
      *
     A            SPFREQ         1          TEXT('Frequency')
     A                                      COLHDG('Frequency')
      *
     A            SPRECP        11          TEXT('Recipient')
     A                                      COLHDG('Recipient')
      *
     A            SPMSTD         5S 0       TEXT('Midas Start Date')
     A                                      COLHDG('Midas' 'Start' 'Date')
     A            SPSTTM         6S 0       TEXT('Start Time')
     A                                      COLHDG('Start' 'Time')
     A            SPDAYM         2S 0       TEXT('Day in Month')
     A                                      COLHDG('Day' 'in' 'Month')
      *
     A            SPMETD         5S 0       TEXT('Midas End Date')
     A                                      COLHDG('Midas' 'End' 'Date')
     A            SPENTM         6S 0       TEXT('End Time')
     A                                      COLHDG('End' 'Time')
      *
     A            SPNSTD         5S 0       TEXT('Next Statement Date')
     A                                      COLHDG('Next' 'Statement' 'Date')
     A            SPNSTT         6S 0       TEXT('Next Statement Time')
     A                                      COLHDG('Next' 'Statement' 'Time')
      *
     A            SPSESN        10          TEXT('Security Shortname')
     A                                      COLHDG('Security' 'Shortname')
      *
     A            SPNWRK        10          TEXT('Network')
     A                                      COLHDG('Network')
      *
     A            SPR549        16          TEXT('Related MT549 Message')
     A                                      COLHDG('Related' 'MT549 Msg')
      *
     A            SPCANC        16          TEXT('Message to Cancel')
     A                                      COLHDG('Message' 'to Cancel')
      *
      *---------------------------------------------------------------------
     A            SPLCD     R               REFFLD(LCD)
     A            SPCHTP    R               REFFLD(CHTP)
     A            SPUSER        10          TEXT('Last User')
     A                                      COLHDG('Last User')
      *---------------------------------------------------------------------
      * Front Office transaction Id
     A            SPFRNT    R               REFFLD(FOTRNID)
      * Associated Front Office transaction Id
     A            SPAFRT    R               REFFLD(FOTRNID)
      * Repair Location
     A            SPREPA    R               REFFLD(RPRLOC)
      * Timestamp
     A            SPTMST    R               REFFLD(TIMESTMP)
      *=====================================================================
