      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE DPMV - Valid File - LU Window')
      *****************************************************************
      *                                                               *
      *  Midas - Security Trading Module                              *
      *                                                               *
      *  PF/SEVDMLX1PD - Valid Depot Movements Extended Details       *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2005            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CER001  *CREATE    Date 25Apr05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CER001 - LUX Upgrade to MidasPlus                            *
      *                                                               *
      *****************************************************************
     A          R SEVDMLXD6                 TEXT('(C) Misys International +
     A                                      Banking Systems Ltd. 2005')
     A            #6LXWNFOTR    20A         TEXT('Front Office Transaction Id')
     A            #6LXWNDPSS    10A         TEXT('Security Shortname')
     A            #6LXWNDPRN     6A         TEXT('Reference')
     A            #6LXWNOPTP     3S 0       TEXT('Operation Type')
     A            #6LXWNEXCF     1S 0       TEXT('Excess Collateral Flag')
     A            #6LXWNTIME     6S 0       TEXT('Transaction Time')
     A            #6LXWNCABR     1A         TEXT('To Be Excluded in CAB')
     A            #6LXWNEXFL     1A         TEXT('Extracted Flag')
     A            #6LXWNCNBR     6A         TEXT('Counterparty Number')
     A            #6LXWNTMES      Z         TEXT('Timestamp')
