      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE  Customer Limits - Detail')
     A********************************************************************
     A*
     A*  Midas - Securities Trading Module
     A*                                                                  *
     A*    PF/SLIMH  -  CUSTOMER LIMITS - DETAIL                         *
     A*                                                                  *
      *  (c) Finastra International Limited 2001                      *
     A*                                                                  *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 00                 Date 00/00/00              *
     A*                                                                  *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *                                                               *
     A********************************************************************
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R SLIMHF                    TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            RECI      R
      * Begin /CSD027/
     A**********  CSTL      R                                                                 CSD027
     A            CSTL           6A
     A                                      TEXT('Customer for limit')
     A                                      COLHDG('Cust')
      * End /CSD027/
     A            BOKH      R
     A            LVLH      R
     A            ETYH      R
     A            LMTH      R
     A            LLMH      R
     A            SLMH      R
     A            CLMP      R
     A            CLMS      R
     A            EXDH      R
     A            RVFH      R
     A            RVDH      R
     A            RDMH      R
     A            LCD       R
     A            CHTP      R
     A            TNLU      R
     A          K CSTL
     A          K BOKH
     A          K LVLH
     A          K ETYH
