      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE Security Non-Diary Events Audit')             *
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *    PF/SNDEVA  -  SECURITY NON-DIARY EVENTS  - AUDIT           *
      *                                                               *
      *    (c) Finastra International Limited 2001                    *
      *                                                               *
      *  Last Amend No. 247420             Date 22May20               *
      *  Prev Amend No. MD046248           Date 27Oct17               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                                    Date 00/00/00              *
      *                                                               *
      *                                                               *
      * 247420 - Increase length of field NORE from NORE(5,0) to      *
      *          SNNORE(7,10).  Applied fix 23039.                    *
      * MD046248 - Finastra Rebranding                                *
      *****************************************************************
      *                                                               *
      *  C R E A T I O N     P A R A M E T E R S                      *
      *                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R SNDEVAF                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            TNLU      R
      ** Start of change 247420
      **********  NORE      R
     A            SNNORE         7P 0       TEXT('Number of records in file')
     A                                      COLHDG('No. of' +
     A                                      'Records' +
     A                                      'on file')
      * End of change 247420

