000100200318      *****************************************************************
000200200318/*STD *  PFBASE                                                       *
000300200318/*EXS *  PF_STD                                                       *
000400200318/*EXI *  TEXT('Midas SE Security Non-Diary Events Audit')             *
000500200318     A********************************************************************
000600200318     A*
000700200318     A*  Midas - Securities Trading Module
000800200318     A*                                                                  *
000900200318     A*    PF/SNDEVA  -  SECURITY NON-DIARY EVENTS  - AUDIT              *
001000200318     A*                                                                  *
001100200318      *  (c) Misys International Banking Systems Ltd. 2001            *
001200200525     A*                                                               *
001300200604     A*  Last Amend No. 247420             Date 22May20               *
001400200318      *  Last Amend No. 247420             Date 23Jul07               *
001500200318      * Midas Release 4 --------------- Base -------------------------*
001600200318      * Midas DBA 3.00 ---------------- Base -------------------------*
001700200318      *  Prev Amend No.                    Date                       *
001800200318     A*                                                               *
001900200318      * 247420 - Increase length of field NORE from NORE(5,0) to      *
002000200318      *          SNNORE(7,10).  Applied fix 23039.                    *
002100200318     A********************************************************************
002200200318     A*
002300200318     A*  C R E A T I O N     P A R A M E T E R S                      *
002400200318     A*                                                               *
002500200318     A*****************************************************************
002600200318     A                                      REF(MFRFL)
002700200318     A          R SNDEVAF                   TEXT('(c) Misys International +
002800200318     A                                      Banking Systems Ltd. +
002900200318     A                                      2001')
003000200318     A            TNLU      R
003100200318      ** Start of change 247420
003200200318     A**********  NORE      R
003300200318     A            SNNORE         7P 0       TEXT('Number of records in file')
003400200318     A                                      COLHDG('No. of' +
003500200318     A                                      'Records' +
003600200318     A                                      'on file')
003700200318      * End of change 247420
