      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE Standard Settlement Instructions')
     A********************************************************************
     A*                                                               *
     A*  Midas - Securities Trading Module                            *
     A*                                                               *
     A*   LF/STDSED  -  STANDARD SETTLEMENT INSTRUCTIONS              *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      *  Prev Amend No. CGL029             Date 01Sep03               *
      *                 CSE039             Date 30Jan03               *
      *                 CSE034             Date 16Apr02               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 CSE028             Date 06Jun01               *
      * Midas DBA 3.04 -----------------------------------------------*
      *                 185733             Date 01Nov00               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CEU005             Date 30Jan98               *
      *                  S01117            Date 08Nov90               *
     A*                  S01175            DATE 01/07/88                 *
     A*                                                                  *
     A********************************************************************
      *                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CSE039 - Auto-Settlement of Trade                            *
      *  CSE034 - Standing Settlement Instructions improvements       *
      *  CSE028 - Standing Settlement Instructions Enhancement.       *
      *   185733 - Addition of Depot A/C number for MG0565            *
      *            (CSE023 - Treaty Withholding Tax)                  *
     A*   CEU005 - EMU SE Settlement Ccy Conversion                      *
     A*   S01117 - RELEASE 10 - MULTIBRANCHING                           *
     A********************************************************************
     A                                      REF(MFRFL)
     A          R STDSEDF                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            RECI      R
     A*                                                  /S01117/
     A*********** SBRH      R
     A            SBRA      R
     A*                                                  /S01117/
      * Begin /CSD027/
     A**********  CSTM      R                                                                 CSD027
     A            CSTM           6A
     A                                      TEXT('Customer')
     A                                      COLHDG('Cust.               ' +
     A                                      'No.')
      * End /CSD027/
     A            CYSI      R
     A            ITSI      R
     A            SRSM      R
     A**Start of change CGL029
     A**********  SRAC      R                                                                 CGL029
     A            SRACQQ        12A
     A**End of change CGL029
     A*                                                  /S01117/
     A**********  SRBR      R
     A            SRAB      R
     A*                                                  /S01117/
     A            SRCB      R
     A            SPSM      R
     A**Start of change CGL029
     A**********  SPAT      R                                                                 CGL029
     A            SPATQQ        12A
     A**End of change CGL029
     A*                                                  /S01117/
     A**********  SPBR      R
     A            SPBA      R
     A*                                                  /S01117/
     A            SPCB      R
     A            SPFA      R
     A            SPSI      R
     A            SPCP      R
     A            SPCS      R
     A            SCLP      R
     A            SCLS      R
     A            SCLH      R
      * Begin /CSD027/
     A**********  SDTO      R                                                                 CSD027
     A**********  SDFO      R                                                                 CSD027
     A**********  SDTT      R                                                                 CSD027
     A            SDTO           6A
     A                                      TEXT('Deliver To - Ours')
     A                                      COLHDG('Deliver             ' +
     A                                      '  To                ' +
     A                                      'Ours')
     A            SDFO           6A
     A                                      TEXT('Deliver From - Ours')
     A                                      COLHDG('Deliver             ' +
     A                                      ' From               ' +
     A                                      'Ours')
     A            SDTT           6A
     A                                      TEXT('Deliver To - Theirs')
     A                                      COLHDG('Deliver             ' +
     A                                      '   To               ' +
     A                                      'Theirs')
      * End /CSD027/
     A            SFAT      R
      * Begin /CSD027/
     A**********  SDFT      R                                                                 CSD027
     A            SDFT           6A
     A                                      TEXT('Deliver From - Theirs')
     A                                      COLHDG('Deliver             ' +
     A                                      '  From              ' +
     A                                      'Theirs')
      * End /CSD027/
     A*****                  S01175
     A            SFAF      R
     A*****                  S01175
     A            LCD       R
     A            CHTP      R
     A            TNLU      R
     A*                                            Begin /CEU005/
     A            SCCY      R               REFFLD(CYSI)
     A                                      TEXT('Settlement Ccy')
     A            ERII      R               REFFLD(SCLH)
     A                                      TEXT('Include ERI in +
     A                                              field 72')
     A*                                            End   /CEU005/
     A**Start of change 185733
     A            SKAC          20A         TEXT('Safekeeping A/C')
     A                                      COLHDG('Safekeeping A/C')
     A**End of change 185733
     A**Start of Change CSE028
     A            SIBK           2A         TEXT('Book Code')
     A                                      COLHDG('Book Code')
     A            SPTFR          4A         TEXT('Portfolio Reference')
     A                                      COLHDG('Portfolio Reference')
     A            SNEW           1A         TEXT('ISO15022 Messages Ind.')
     A                                      COLHDG('ISO15022 Messages' +
     A                                             'Ind.')
     A            STFDM          1A         TEXT('Trade Settlement to be +
     A                                           used for Depot Movement')
     A                                      COLHDG('Trade Settlement to ' +
     A                                             'to used for Depot' +
     A                                             'Movement')
     A**End of Change CSE028
     A
     A**Start of CSE034
     A            SMKT           2A         TEXT('Market Centre')
     A                                      COLHDG('Market Centre')
     A**End of CSE034
      * Start of change CSE039
     A            SASI           1A         TEXT('Auto-Settle Indicator')
     A                                      COLHDG('Auto-Settle' +
     A                                             'Indicator')
      * End of change CSE039
     A**Start of change CGL029
     A            SRAC          18A
     A            SPAT          18A
     A**End of change CGL029
     A*                                                  /S01117/
     A**********K SBRH
     A          K SBRA
     A*                                                  /S01117/
     A          K CSTM
     A**Start of Change CSE028
     A          K SIBK
     A**End of Change CSE028
     A          K CYSI
     A          K ITSI
     A**Start of Change CSE028
     A          K SPTFR
     A**End of Change CSE028
