      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE Trades Extension File 1')                     *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Securities Trading Module
     A*                                                               *
     A*  PF/TRADSDX1 - TRADES EXTENSION FILE 1                        *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. AR1048651          Date 08Feb13               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      *                 CSE028             Date 06Jun01               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CAP003             Date 03Jun98               *
      *                 CSW098             Date 24Mar98               *
     A*                 CSW003             DATE 24JAN96               *
     A*                 S01401             DATE 15JUN93               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  AR1048651 - TRADSDX1 global replication (Child:AR1048654)    *
      *  CSE028 - Standing Settlement Instructions Enhancement.       *
     A*  CAP003 - Conversion of Midas inputs into modular structure   *
     A*           to use as APIs.                                     *
     A*  CSW098 - SWIFT 98 changes. Add new field T1SIOR.             *
     A*  CSW003 - MT5xx Message Generation - Phase 2                  *
     A*  S01401 - MT5xx SWIFT Messages Feature:                       *
     A*          - New File.                                          *
     A*                                                               *
     A*****************************************************************
      *
      **Start of change AR1048651
     A          R TRADSDD1                  FORMAT(GZTRADSDX1)
     A**********                            REF(MFRFL)                                     AR1048651
      *****************************************************************                    AR1048651
     A**********R TRADSDD1                  TEXT('(c) Misys International +                AR1048651
     A**********                            Banking Systems Ltd. +                         AR1048651
     A**********                            2001')                                         AR1048651
      *****************************************************************                    AR1048651
     A**********  T1TDRF    R               REFFLD(TDRF)                                   AR1048651
     A**********  T1CONG    R               REFFLD(M5CONG)                                 AR1048651
     A**********  T1RCDG    R               REFFLD(RCDG)                                   AR1048651
     A**********  T1LSWS    R               REFFLD(M5LSWS)                                 AR1048651
     A**********  T1LSSC    R               REFFLD(LSSC)                                   AR1048651
     A**********  T1GMES    R               REFFLD(GMES)                                   AR1048651
     A**********  T1INST    R               REFFLD(M5INST)                                 AR1048651
     A**********  T1INSS    R               REFFLD(INSS)                                   AR1048651
     A**********  T1EUCL    R               REFFLD(M5EUCL)                                 AR1048651
     A**********  T1SAFA    R               REFFLD(SAFA)                                   AR1048651
     A**********  T1RPTY    R               REFFLD(RPTY)                                   AR1048651
     A**********  T1GMEC    R               REFFLD(GMEC)                                   AR1048651
     A**********  T1FID1    R               REFFLD(FID1)                                   AR1048651
     A**********  T1CCID    R               REFFLD(CCID)                                   AR1048651
     A**********  T1TRTT    R               REFFLD(M5TRTT)                                 AR1048651
     A**********  T1GDEL    R               REFFLD(GDEL)                                   AR1048651
     A**********  T1FCOD    R               REFFLD(M5FCOD)                                 AR1048651
     A**********  T1FTID    R               REFFLD(FTID)                                   AR1048651
     A**********  T1SROL    R               REFFLD(SROL)                                   AR1048651
     A**********  T1SCMG    R               REFFLD(SCMG)                                   AR1048651
     A*****                                          Begin /CSW003/
     A**********  T1WHEN    R               REFFLD(WHEN)                                   AR1048651
     A**********                            TEXT('To/From Indicator')                      AR1048651
     A**********                            COLHDG('  To/From' +                           AR1048651
     A**********                                   'Indicator')                            AR1048651
     A*****                                          End   /CSW003/
      *                                              Begin /CSW098/
     A**********  T1SIOR    R               REFFLD(ACST)                                   AR1048651
     A**********                            TEXT('Standard Instructions'+                  AR1048651
     A**********                                 ' Override')                              AR1048651
     A**********                            COLHDG('Standard'+                             AR1048651
     A**********                                 'Inst Ovride')                            AR1048651
      *                                              End   /CSW098/
      *                                              Begin /CAP003/
     A**********  T1FRNT    R               REFFLD(FOTRNID)                                AR1048651
     A**********  T1AFRT    R               REFFLD(FOTRNID)                                AR1048651
     A**********                            TEXT('Associated Front +                       AR1048651
     A**********                                  Office Transaction Id')                  AR1048651
     A**********                            COLHDG('Associated' +                          AR1048651
     A**********                                   'Front Office' +                        AR1048651
     A**********                                   'Transaction Id')                       AR1048651
     A**********  T1REPA    R               REFFLD(RPRLOC)                                 AR1048651
      ***Timestamp*****************************************************                    AR1048651
     A**********  T1TMST    R               REFFLD(TIMESTMP)                               AR1048651
      *                                              End   /CAP003/
     A**Start of Change CSE028
     A**********  T1NEW          1A         TEXT('ISO15022 Messages Ind.')                 AR1048651
     A**********                            COLHDG('ISO15022 Messages' +                   AR1048651
     A**********                                   'Ind.')                                 AR1048651
      *****************************************************************                    AR1048651
     A**********  T1STMP         4A         TEXT('Stamp Status')                           AR1048651
     A**********                            COLHDG('Stamp Status')                         AR1048651
      *****************************************************************                    AR1048651
     A**********  T1CHID        30A         TEXT('Charity Identifier')                     AR1048651
     A**********                            COLHDG('Charity Identifier')                   AR1048651
      *****************************************************************                    AR1048651
     A**********  T1TRRM         4A         TEXT('Transaction Report Marker')              AR1048651
     A**********                            COLHDG('Transaction Report' +                  AR1048651
     A**********                                   'Marker')                               AR1048651
     A**End of Change CSE028
      **End of change AR1048651
