      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE Amended Trades awaiting Telexes')
     A********************************************************************
     A*                                                                  *
     A*  Midas - Securities Trading Module
     A*                                                                  *
     A*    PF/TRATXD  -   TRADES AMENDED BUT AWAITING AUTHORISATION      *
     A*                   FOR TELEX PROCESSING                           *
     A*                                                                  *
      *  (c) Finastra International Limited 2001                      *
     A*                                                                  *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      *                 CGL035             Date 01Mar05               *
      *                 CGL029             Date 01Sep03               *
      *                 CAS006             Date 21Jan03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      *                 CSE023             Date 12Jul00               *
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CAP051             Date 16Nov99               *
      *                 CPB001             Date 01Jun99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*                 CAP003             Date 17May98               *
     A*                 CSE007             Date 02Feb98               *
     A*                 CEU005             Date 30JAN98                  *
     A*                   CAC002           Date 15SEP96                  *
     A*                   S01486           Date 06JUN94                  *
     A*                 052254             Date 22DEC93               *
     A*                   E31114           DATE 31OCT91                  *
     A*                   S01269           DATE 08NOV90                  *
     A*                                                                  *
     A********************************************************************
     A*                                                                  *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL035 - EUSD Upgrade to Midasplus (Recompile)               *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CAS006 - Hedge Accounting Phase B (Recompile)                *
      *  CSE023 - Treaty Withholding Tax (Recompiled)                 *
     A*  CAP051 - Automatic Authorisation (SE Trades Part)            *
     A*           Recompiled due to changes in TRADSD.                *
     A*  CPB001 - Meridian DBA Middleware Replication Customization.  *
     A*           Recompiled due to changes in TRADSD.                *
     A*  CAP003 - Midas APIs phase 2 (recompile over changed format)  *
     A*  CSE007 - Corporate Actions - Just Recompile                     *
     A*  CEU005 - EMU SE Settlement Ccy Conversion (RECOMPILE)           *
     A*  CAC002 - Profit Centre Accounting Development Phase 2:       *
     A*           Recompiled due to changes in TRADSD                 *
     A*  S01486 - Portfolio Management Upgrade (RECOMPILE)               *
     A*  052254 - RECOMPILED as CURRENT FACTOR amended from 9,8          *
     A*           to 10,9                                                *
     A*  E31114 - RECOMPILED FOR MULTIBRANCHING                          *
     A*  S01269 - NEW FILE FOR TRADE AUTHORISATION                       *
     A*                                                                  *
     A********************************************************************
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A          R TRADSDF                   FORMAT(TRADSD)
