      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE User Depot Positions - Detail')
     A********************************************************************
     A*
     A*  Midas - Securities Trading Module
     A*                                                                  *
     A*    PF/UDEPPD  -  USER DEPOT POSITIONS - DETAIL                   *
     A*                                                                  *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                                  *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      *  Prev Amend No. CGP007             Date 09Nov04               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 S01117             Date 03Jan89               *
     A*                   S01158           Date 09May88               *
     A*                                                                  *
     A*----------------------------------------------------------------  *
     A*                                                                  *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*     CGP007 - Depot Positions Global View                      *
     A*     S01117  -  MULTI BRANCHING                                   *
     A*     S01158  -  POST INCORPORATION DEVELOPMENT FIX                *
     A*                                                                  *
     A********************************************************************
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
      *                                     Start of Change CGP007
     A          R UDEPPDF                   FORMAT(GZUDEPPD)
     A**********                            REF(MFRFL)
     A**********R UDEPPDF                   TEXT('(c) Misys International +
     A**********                            Banking Systems Ltd. +
     A**********                            2001')
     A**********  RECI      R
     A**********                                           /S01117/
     A*********** UDBR      R
     A**********  UDBA      R
     A**********                                           /S01117/
     A**********  UDSN      R
     A**********  UDPT      R
     A**********  UDBK      R
     A**********  UDMK      R
     A**********  UDDT      R
     A**********  UECN      R
     A**********  UDNT      R
     A**********  UDNV      R
     A**********  UDNS      R
     A**********  UNRT      R
     A**********  UNRV      R
     A**********  UDTP      R
     A**********  UDTS      R
     A**********  UDPV      R
     A**********  UDSV      R
     A**********  USNT      R
     A**********  USNR      R
     A**********  USNV      R
     A**********  USRV      R
     A**********                                           /S01158/
     A**********  UNSI      R
     A**********                                           /S01158/
     A**********  TNLU      R
      *                                     End of Change CGP007
