      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas SC Switchable features available report')
      *****************************************************************
      *                                                               *
      *  Midas - System Control Module                                *
      *                                                               *
      *  DSPF/SCC0441DF - Menu for Switchable Features Information    *
      *                  File.                                        *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CSC007  *CREATE    Date 08May98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSC007 - New suite of programs and files to permit           *
      *           insertion of switchable features via passwords.     *
      *                                                               *
      *****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(MPRINT)
     A                                      CA03(03)
     A  11                                  CA10(10)
     A                                      CA12(12)
     A          R SCC0441DF
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A                                      PUTOVR
     A            SUSER         10A  O  1  2TEXT('User')
     A                                  1 13'SCC0441'
     A                                  1 31'Switchable Features'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  2 33'Information File'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A            SDATE          7A  O  1 72TEXT('Run date, DDMMYY')
     A            SWSID         10A  O  2  2TEXT('WS Name')
     A                                  2 71TIME
     A            OPT1           1A  B 08 22
     A  87                                  DSPATR(PR)
     A N02                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 08 25'1. Switchable Feature -
     A                                      Number'
     A            OPT2           1A  B 10 22
     A  87                                  DSPATR(PR)
     A N02                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 10 25'2. Primary Module'
     A
     A  01        OPT3           1A  B 12 22
     A  87                                  DSPATR(PR)
     A  01N02                               OVRDTA
     A  01                                  DSPATR(HI)
     A  01                             12 25'3. Release/Interim -
     A                                      release'
     A*
     A N11                             23  2'F3=Exit, F12=Previous-
     A                                       screen'
     A  11                             23  2'F3=Exit, F12=Previous-
     A                                       screen'
     A  02        MSGFLD        80A    24  1
     A                                      DSPATR(HI)
     A  02                                  OVRDTA
