      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_SN                                                        *
/*EXI *  TEXT('Midas FT Transaction Type Codes')
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTTRNTPD - Transaction Type Codes                         *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *  Last Amend No. CFT009  *CREATE    Date 05Jun00               *
      *  Prev Amend No. xxxxxx             Date ddmmmyy               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CFT009 - Funds Transfer Fees and Charges                     *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R FTTRNTD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            TRTYPE    R               REFFLD(CKEN)
     A                                      TEXT('Transaction Type')
     A                                      COLHDG('Transaction Type')
     A            TRNDSC    R               REFFLD(RPNA)
     A                                      TEXT('Transaction Description')
     A                                      COLHDG('Transaction Desc')
     A            RCVINT    R               REFFLD(CHSN)
     A                                      TEXT('Available for Rcv / Int Chgs')
     A                                      COLHDG('Available for' +
     A                                      'Rec / Int Chgs')
     A            PAYGEN    R               REFFLD(CHSN)
     A                                      TEXT('Payment Advice Gen Flag')
     A                                      COLHDG('Pay Advice Gen Flag')
     A            COREDL    R               REFFLD(CHSN)
     A                                      TEXT('Core Delivered')
     A                                      COLHDG('Core Delivered')
