      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_NM                                                        *
/*EXI *  TEXT('Midas MA OD bureau header/details')
      *****************************************************************
      *                                                               *
      *  Midas - Microfiche/Optical Disk Archiving Module             *
      *                                                               *
      *   PF/MAOPTDPD - OPTICAL DISK BUREAU (HEADER/DETAIL)           *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *   LAST AMEND NO. 065368               DATE   12JAN94          *
      *   PREV AMEND NO. S01382               DATE   11AUG92          *
      *                                                               *
      *****************************************************************
      *                                                               *
      *   065368 - PF/MAOPTDPD SHOULD RESIDE IN DP LIBRARY, THEREFORE *
      *            SOURCE SHOULD BE MOVED FROM MADDSSRCDM TO          *
      *            MADDSSRCDP.                                        *
      *   S01382 - OPTICAL DISK REPORTING                             *
      *            REPORT DETAIL FIELD ENLARGED AND RENAMED.          *
      *            MAXIMUM MEMBERS CHANGED TO *NOMAX.                 *
      *                                                               *
      *****************************************************************
      *                                    Start of change /S01382/
     A                                      REF(MFRFL)
      *                                      End of change /S01382/
     A          R MAOPTDD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *---------------------------------------------------------------------
     A            MACCHR         1          TEXT('Control Character')
     A                                      COLHDG('Control Character')
      *                                    Start of change /S01382/
     A************MARDTL       132          TEXT('Report Detail')
     A            ODRDTL    R               TEXT('Report Detail')
      *                                      End of change /S01382/
     A                                      COLHDG('Report Detail')
     A            F00021        21          TEXT('HEADER Detail Extention')
     A                                      COLHDG('HEADER Detail' +
     A                                      'Extention')
      *=====================================================================
      * ++++++  MAOPTHD0    TEXT(=== HEADER layout ====)
      *---------------------------------------------------------------------
      *                                    Start of change /S01382/
      *           HEADID         4          TEXT('Header id *$*$')
      *           AST1           1          TEXT('Separator *')
      *           RPT           10          TEXT('Report name')
      *           AST2           1          TEXT('Separator *')
      *           USER          10          TEXT('User')
      *           AST3           1          TEXT('Separator *')
      *           JOB           10          TEXT('Job name')
      *           AST4           1          TEXT('Separator *')
      *           JOBN           6          TEXT('Job number')
      *           AST5           1          TEXT('Separator *')
      *           MRUN           5          TEXT('Midas run date NNNNN')
      *           AST6           1          TEXT('Separator *')
      *           MDATE          7          TEXT('Midas day 00AAA00')
      *           AST7           1          TEXT('Separator *')
      *           MDATE2         8          TEXT('Midas day DD/MM/YY')
      *           AST8           1          TEXT('Separator *')
      *           SPLF           4          TEXT('Spool file number')
      *           AST9           1          TEXT('Separator *')
      *           RLVL           1          TEXT('Report Level')
      *           AST10          1          TEXT('Separator *')
      *           ENTY           3          TEXT('Entity')
      *           AST11          1          TEXT('Separator *')
      *           PNAM          10          TEXT('Print file name')
      *           AST12          1          TEXT('Separator *')
      *
      *********** MARTP5         5          TEXT('Header record ID')
      *********** MAARID        10          TEXT('Archive ID')
      *********** MA@1           1          TEXT('Separator 01')
      ***********-----------
      *********** MARNAM        10          TEXT('Report name')
      *********** MA@2           1          TEXT('Separator 02')
      ***********-----------
      *********** MAADSC        30          TEXT('Archive Description')
      *********** MA@3           1          TEXT('Separator 03')
      ***********-----------
      *********** MADEPT         3          TEXT('Archive Dept')
      *********** MA@4           1          TEXT('Separator 04')
      ***********-----------
      *********** MAADAT         7          TEXT('Archive Date')
      *********** MA@5           1          TEXT('Separator 05')
      ***********-----------
      *********** MAMDAT         5S 0       TEXT('Archive Date Nbr')
      *********** MA@6           1          TEXT('Separator 06')
      ***********-----------
      *********** MARSFX        10          TEXT('Print File Name')
      *********** MA@7           1          TEXT('Separator 07')
      ***********-----------
      *********** MAFMTP        10          TEXT('Forms Type')
      *********** MA@8           1          TEXT('Separator 08')
      ***********-----------
      *********** MAPLEN         3S 0       TEXT('Page Length')
      *********** MA@9           1          TEXT('Separator 09')
      ***********-----------
      *********** MALPI          1S 0       TEXT('Lines per Inch')
      *********** MA@10          1          TEXT('Separator 10')
      ***********-------------------
      *********** MAPFTX        50          TEXT('Print File Text')
      *                                      End of change /S01382/
      *
      *=====================================================================
