      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MA DSPOUTQ layout file for archiving')
     A**************************************************************
     A*                                                            *
     A*  Midas - Report ARCHIVING Module
     A*                                                            *
     A*           PF/MAOUTQPD  -   Dummy Physical File for use     *
     A*                              with ARCHIVING                *
     A*                                                            *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                            *
     A*                                                            *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *     LAST AMEND NO. S00000             DATE   ddMMMyy       *
      *     PREV AMEND NO. S00000             DATE   ddMMMyy       *
      *                                                            *
      **************************************************************
      *  S00000 - xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx           *
      *                                                            *
     A**************************************************************
     A*
     A*
     A          R MAOUTQD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            OUTQ         132          TEXT('LOG FILE SIZE')
     A*****************************************************************
