      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MA Yesterdays optical disk refs')                *
     A**************************************************************
     A*                                                            *
     A*  Midas - Microfiche/Optical Disk Archiving Module
     A*                                                            *
     A*   PF/MAOWKYPD - OPTICAL DISK ENTRY REFERENCES (YESTERDAY)  *
     A*                                                            *
      *  (c) Finastra International Limited 2001                      *
     A*                                                            *
     A*                                                            *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01382             Date 17Aug92               *
     A*                                                            *
     A**************************************************************
     A*                                                            *
      *  MD046248 - Finastra Rebranding                               *
     A*     S01382 - OPTICAL DISK DEVELOPMENT                      *
     A*              RECOMPILED OVER AMENDED VERSION OF MAOWRKPD   *
     A*                                                            *
     A**************************************************************
      *  C R E A T I O N     P A R A M E T E R S
      *
      ****************************************************************
     A          R MAOWRKD0                  FORMAT(MAOWRKPD)
