      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas FD Valid MDF Interest Rates received today')
      *****************************************************************
      *                                                               *
      *  Midas - FD Module                                            *
      *                                                               *
      *  PRTF/FD0587P1 - Valid MDF Transactions received today        *
      *                  Deposit Rates                                *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. AR851109           Date 06Mar15               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4.01 -------------------------------------------*
      *                 196570  *CREATE    Date 12Nov01               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  AR851109 - Cannot enter -ve rates. Applied for MD033488.     *
      *  196570 - Patch for Market Data Feed: enhanced MDF reporting  *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
      ** Report Header Record Format
      *
     A          R HEADP1                    TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A                                      SKIPB(3)
     A                                     6'Reference FD0587P1'
     A            BJURPT    R             37REFFLD(URPT)
     A                                   101'DATE'
     A            BJMRDT    R            106REFFLD(MRDT)
     A                                   119'PAGE'
     A                                   124PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(1)
      *
     A                                   101'TIME'
     A                                   106TIME
     A                                      EDTWRD('  :  :  ')
     A                                      SPACEA(1)
      *
     A                                    35'MDF - Valid Deposit Rates receive+
     A                                      d today'
     A                                      SPACEA(1)
      *
     A                                    35'----------------------------------+
     A                                      -------'
      *
      ** Detail Record Format
      *
     A          R HEADP2
     A                                     7'Currency Code:'
     A                                      SPACEB(2)
     A            PCCY           3A       +2
     A                                    +4'Rate Identifier:'
     A            PRATID        20A       +2
     A                                    +4'Timestamp:'
     A            PTMSTP        19A       +2
     A                                      SPACEA(1)
     A                                     7'Data Feed Request:'
     A            PDFRID        32A       +2
     A                                      SPACEA(1)
     A                                    36'Rate received from MDF'
     A                                      SPACEA(1)
     A                                    33'Borrow'
     A                                   +12'Lend'
     A                                      SPACEA(1)
      *
      ** Detail Record Format
      *
     A          R DETAIL
     A                                    11'Overnight'
     A**Start of change AR851109
     A**********  PNBR01        11S 7     29EDTWRD('    .       ')                          AR851109
     A**********  PNLE01        11S 7     47EDTWRD('    .       ')                          AR851109
     A            PNBR01        12        29
     A            PNLE01        12        47
     A**End of change AR851109
     A                                      SPACEA(1)
     A                                    11'Tommorow/Next'
     A**Start of change AR851109
     A**********  PNBR02        11S 7     29EDTWRD('    .       ')                          AR851109
     A**********  PNLE02        11S 7     47EDTWRD('    .       ')                          AR851109
     A            PNBR02        12        29
     A            PNLE02        12        47
     A**End of change AR851109
     A                                      SPACEA(1)
     A                                    11'Spot/Next'
     A**Start of change AR851109
     A**********  PNBR03        11S 7     29EDTWRD('    .       ')                          AR851109
     A**********  PNLE03        11S 7     47EDTWRD('    .       ')                          AR851109
     A            PNBR03        12        29
     A            PNLE03        12        47
     A**End of change AR851109
     A                                      SPACEA(1)
     A                                    11'1 Week'
     A**Start of change AR851109
     A**********  PNBR04        11S 7     29EDTWRD('    .       ')                          AR851109
     A**********  PNLE04        11S 7     47EDTWRD('    .       ')                          AR851109
     A            PNBR04        12        29
     A            PNLE04        12        47
     A**End of change AR851109
     A                                      SPACEA(1)
     A                                    11'2 Weeks'
     A**Start of change AR851109
     A**********  PNBR05        11S 7     29EDTWRD('    .       ')                          AR851109
     A**********  PNLE05        11S 7     47EDTWRD('    .       ')                          AR851109
     A            PNBR05        12        29
     A            PNLE05        12        47
     A**End of change AR851109
     A                                      SPACEA(1)
     A                                    11'3 Weeks'
     A**Start of change AR851109
     A**********  PNBR06        11S 7     29EDTWRD('    .       ')                          AR851109
     A**********  PNLE06        11S 7     47EDTWRD('    .       ')                          AR851109
     A            PNBR06        12        29
     A            PNLE06        12        47
     A**End of change AR851109
     A                                      SPACEA(1)
     A                                    11'1 Month'
     A**Start of change AR851109
     A**********  PNBR07        11S 7     29EDTWRD('    .       ')                          AR851109
     A**********  PNLE07        11S 7     47EDTWRD('    .       ')                          AR851109
     A            PNBR07        12        29
     A            PNLE07        12        47
     A**End of change AR851109
     A                                      SPACEA(1)
     A                                    11'2 Months'
     A**Start of change AR851109
     A**********  PNBR08        11S 7     29EDTWRD('    .       ')                          AR851109
     A**********  PNLE08        11S 7     47EDTWRD('    .       ')                          AR851109
     A            PNBR08        12        29
     A            PNLE08        12        47
     A**End of change AR851109
     A                                      SPACEA(1)
     A                                    11'3 Months'
     A**Start of change AR851109
     A**********  PNBR09        11S 7     29EDTWRD('    .       ')                          AR851109
     A**********  PNLE09        11S 7     47EDTWRD('    .       ')                          AR851109
     A            PNBR09        12        29
     A            PNLE09        12        47
     A**End of change AR851109
     A                                      SPACEA(1)
     A                                    11'6 Months'
     A**Start of change AR851109
     A**********  PNBR10        11S 7     29EDTWRD('    .       ')                          AR851109
     A**********  PNLE10        11S 7     47EDTWRD('    .       ')                          AR851109
     A            PNBR10        12        29
     A            PNLE10        12        47
     A**End of change AR851109
     A                                      SPACEA(1)
     A                                    11'9 Months'
     A**Start of change AR851109
     A**********  PNBR11        11S 7     29EDTWRD('    .       ')                          AR851109
     A**********  PNLE11        11S 7     47EDTWRD('    .       ')                          AR851109
     A            PNBR11        12        29
     A            PNLE11        12        47
     A**End of change AR851109
     A                                      SPACEA(1)
     A                                    11'1 Year'
     A**Start of change AR851109
     A**********  PNBR12        11S 7     29EDTWRD('    .       ')                          AR851109
     A**********  PNLE12        11S 7     47EDTWRD('    .       ')                          AR851109
     A            PNBR12        12        29
     A            PNLE12        12        47
     A**End of change AR851109
     A                                      SPACEA(1)
     A                                    11'2 Years'
     A**Start of change AR851109
     A**********  PNBR13        11S 7     29EDTWRD('    .       ')                          AR851109
     A**********  PNLE13        11S 7     47EDTWRD('    .       ')                          AR851109
     A            PNBR13        12        29
     A            PNLE13        12        47
     A**End of change AR851109
     A                                      SPACEA(1)
     A                                    11'3 Years'
     A**Start of change AR851109
     A**********  PNBR14        11S 7     29EDTWRD('    .       ')                          AR851109
     A**********  PNLE14        11S 7     47EDTWRD('    .       ')                          AR851109
     A            PNBR14        12        29
     A            PNLE14        12        47
     A**End of change AR851109
     A                                      SPACEA(1)
     A                                    11'4 Years'
     A**Start of change AR851109
     A**********  PNBR15        11S 7     29EDTWRD('    .       ')                          AR851109
     A**********  PNLE15        11S 7     47EDTWRD('    .       ')                          AR851109
     A            PNBR15        12        29
     A            PNLE15        12        47
     A**End of change AR851109
     A                                      SPACEA(1)
     A                                    11'5 Years'
     A**Start of change AR851109
     A**********  PNBR16        11S 7     29EDTWRD('    .       ')                          AR851109
     A**********  PNLE16        11S 7     47EDTWRD('    .       ')                          AR851109
     A            PNBR16        12        29
     A            PNLE16        12        47
     A**End of change AR851109
     A                                      SPACEA(1)
     A                                    11'6 Years'
     A**Start of change AR851109
     A**********  PNBR17        11S 7     29EDTWRD('    .       ')                          AR851109
     A**********  PNLE17        11S 7     47EDTWRD('    .       ')                          AR851109
     A            PNBR17        12        29
     A            PNLE17        12        47
     A**End of change AR851109
     A                                      SPACEA(1)
     A                                    11'7 Years'
     A**Start of change AR851109
     A**********  PNBR18        11S 7     29EDTWRD('    .       ')                          AR851109
     A**********  PNLE18        11S 7     47EDTWRD('    .       ')                          AR851109
     A            PNBR18        12        29
     A            PNLE18        12        47
     A**End of change AR851109
     A                                      SPACEA(1)
     A                                    11'8 Years'
     A**Start of change AR851109
     A**********  PNBR19        11S 7     29EDTWRD('    .       ')                          AR851109
     A**********  PNLE19        11S 7     47EDTWRD('    .       ')                          AR851109
     A            PNBR19        12        29
     A            PNLE19        12        47
     A**End of change AR851109
     A                                      SPACEA(1)
     A                                    11'9 Years'
     A**Start of change AR851109
     A**********  PNBR20        11S 7     29EDTWRD('    .       ')                          AR851109
     A**********  PNLE20        11S 7     47EDTWRD('    .       ')                          AR851109
     A            PNBR20        12        29
     A            PNLE20        12        47
     A**End of change AR851109
     A                                      SPACEA(1)
     A                                    11'10 Years'
     A**Start of change AR851109
     A**********  PNBR21        11S 7     29EDTWRD('    .       ')                          AR851109
     A**********  PNLE21        11S 7     47EDTWRD('    .       ')                          AR851109
     A            PNBR21        12        29
     A            PNLE21        12        47
     A**End of change AR851109
      *
      ** Report Trailer
      *
     A          R TRAILP1
     A                                    51
     A                                      '***  END OF REPORT  ***'
     A                                      SPACEB(3)
      *
