      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_AU60                                                      *
/*EXI *  TEXT('Midas A/C Keys Audit Report for FF')
     A********************************************************************
     A*                                                                  *
     A*  Midas General Ledger Module                         *
     A*                                                                  *
     A*      PRTF/GL0053AU - Account Keys Audit Report For Futures       *
     A*                      And Options                                 *
     A*                                                                  *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                                  *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*      LAST AMEND NO. XXXXXX            DATE DDMMMYY               *
     A*                                                                  *
     A********************************************************************
     A*                                                                  *
     A*      XXXXXX - XXXXXXXXXXXXXXXXXXXXXXXX                           *
     A*                                                                  *
     A********************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                         *
     A*                                                                  *
     A********************************************************************
     A*
     A          R FIRST                     TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*
     A                                 03  6'REFERENCE GL0053AU'
     A            BJURPT        53A    03 37
     A                                 03100'DATE'
     A            BJMRDT         7A    03105
     A                                 03119'PAGE'
     A            PAGE           4S 0  03124EDTCDE(Z)
     A*
     A                                 05 39'ACCOUNT KEYS AUDIT '
     A                                 05 58'REPORT FOR FUTURES AND'
     A                                 05 80' OPTIONS'
     A*
     A          R DBERROR
     A                                 20 20'* DATABASE IN ERROR *'
     A*
     A                                 21 44'File'
     A                                 21 55':-'
     A            DBFILE         8     21 59
     A*
     A                                 22 44'Key'
     A                                 22 55':-'
     A            DBKEY         29     22 59
     A*
     A                                 23 44'In Program'
     A                                 23 55':-'
     A            DBPGM         10     23 59
     A*
     A                                 24 44'At point'
     A                                 24 55':-'
     A            DBASE          3S 0  24 59
     A*
     A          R LAST
     A                                 30 56'*** END OF REPORT ***'
     A*
