      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_AU60                                                      *
/*EXI *  TEXT('Transfer Events-Summarised Equation Events Reports')
      *****************************************************************
      *                                                               *
      *  MIDAS - General Ledger Module                                *
      *                                                               *
      *  PRTF/GL000539P1 - Transfer Events Summarised Equation Reports*
      *                                                               *
      *  @ Misys International Banking Systems Ltd. 2006              *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Last Amend No. BUG12221           Date 20Oct06               *
      *  Prev Amend No. BUG12141           Date 05Oct06               *
      *                 CRE026  *CREATE    Date 24May06               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  BUG12221 - Make the report more user-friendly and remove     *
      *             redundant details                                 *
      *  BUG12141 - Word Equation should not appear on Consumer       *
      *             banking audit reports                             *
      *  CRE026 - Consumer Banking                                    *
      *                                                               *
      *****************************************************************
     A          R R_HDR
     A                                      SKIPB(001)
     A                                      SPACEA(001)
     A                                     1
     A                                      'REFERENCE'
     A            R_PGMNM       10A  O    11
     A            R_RPTTL       53A  O    40
     A                                   +16
     A                                      'DATE'
     A            R_DATE         7A  O    +1
     A                                    +2
     A                                      'PAGE'
     A                                    +1
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A*           R_PAGE         4S 0O    +1
     A                                    41
     A**********                            'Consumer Banking - Summarised Equa-            BUG12141
     A**********                            tion Events Report'                             BUG12141
     A                                      'Consumer Banking - Summarised-                 BUG12141
     A                                       Sub-ledger Events Report'                      BUG12141
     A                                      SPACEB(002)
     A                                    40
     A**********                            '-----------------------------------           BUG12141
     A**********                            -------------------'                           BUG12141
     A                                      '------------------------------                BUG12141
     A                                      --------------------------'                    BUG12141
     A                                      SPACEB(001)
     A                                     3
     A                                      'Branch'
     A                                      SPACEB(003)
     A**Start of Change BUG12221
     A**********                          +3                                                BUG12221
     A**********                            'Application'                                   BUG12221
     A**********                          +2                                                BUG12221
     A**********                            'Deal No.'                                      BUG12221
     A**********                          +3                                                BUG12221
     A**********                            'Customer'                                      BUG12221
     A**********                          +2                                                BUG12221
     A**********                            'Type/Sub'                                      BUG12221
     A**********                          +1                                                BUG12221
     A**********                            'Loan/Dep.'                                     BUG12221
     A**********                          +1                                                BUG12221
     A**********                            'CCY'                                           BUG12221
     A**********                          +2                                                BUG12221
     A**********                            'DATE'                                          BUG12221
     A**********                          +3                                                BUG12221
     A**********                            'Pay/Rec'                                       BUG12221
     A**********                          +2                                                BUG12221
     A**********                            'Nostro'                                        BUG12221
     A**********                          +9                                                BUG12221
     A**********                            'Rate'                                          BUG12221
     A**********                         +16                                                BUG12221
     A**********                            'Amount'                                        BUG12221
     A**********                           3                                                BUG12221
     A**********                            '------'                                        BUG12221
     A**********                            SPACEB(001)                                     BUG12221
     A**********                          +3                                                BUG12221
     A**********                            '-----------'                                   BUG12221
     A**********                          +2                                                BUG12221
     A**********                            '--------'                                      BUG12221
     A**********                          +3                                                BUG12221
     A**********                            '--------'                                      BUG12221
     A**********                          +2                                                BUG12221
     A**********                            '--------'                                      BUG12221
     A**********                          +1                                                BUG12221
     A**********                            '---------'                                     BUG12221
     A**********                          +1                                                BUG12221
     A**********                            '---'                                           BUG12221
     A**********                          +2                                                BUG12221
     A**********                            '----'                                          BUG12221
     A**********                          +3                                                BUG12221
     A**********                            '-------'                                       BUG12221
     A**********                          +2                                                BUG12221
     A**********                            '------'                                        BUG12221
     A**********                          +9                                                BUG12221
     A**********                            '----'                                          BUG12221
     A**********                         +16                                                BUG12221
     A**********                            '------'                                        BUG12221
     A**********R R_SUBHDR                                                                  BUG12221
     A**********                            SPACEB(001)                                     BUG12221
     A**********                            SPACEA(001)                                     BUG12221
     A**********                           1                                                BUG12221
     A**********                            'Branch:'                                       BUG12221
     A**********  R_BRNCHSH      3A  O     8                                                BUG12221
     A**********                          +1                                                BUG12221
     A**********                            'Deal No.'                                      BUG12221
     A**********  R_DLNSH       15A  O    +0                                                BUG12221
     A**********                          +2                                                BUG12221
     A**********                            'Customer:'                                     BUG12221
     A**********  R_CUSNSH       6A  O    +0                                                BUG12221
     A**********                          +1                                                BUG12221
     A**********                            'Event Type:'                                   BUG12221
     A**********  R_ETYPSH       4A  O    +0                                                BUG12221
     A**********                          +1                                                BUG12221
     A**********                            'Desc:'                                         BUG12221
     A**********  R_EDSCSH      20A  O    +0                                                BUG12221
     A**********                          +4                                                BUG12221
     A**********                            'Event CCY:'                                    BUG12221
     A**********  R_ECCYSH       3A  O    +0                                                BUG12221
     A**********                          +3                                                BUG12221
     A**********                            'Event Date:'                                   BUG12221
     A**********  R_EDTESH       7A  O    +0                                                BUG12221
     A**********                                                                            BUG12221
     A**********R R_DTL                                                                     BUG12221
     A**********                            SPACEB(001)                                     BUG12221
     A**********  R_BRNCHD       4A  O     8                                                BUG12221
     A**********  R_APPCD        2A  O    17                                                BUG12221
     A**********  R_DLND        13A  O    23                                                BUG12221
     A**********  R_CUSND        6A  O    40                                                BUG12221
     A**********  R_TYPD         1A  O    +3                                                BUG12221
     A**********  R_STYPD        1A  O    +2                                                BUG12221
     A**********  R_LNDEPD       1A  O    +5                                                BUG12221
     A**********  R_CCYD         3A  O    +7                                                BUG12221
     A**********  R_DATD         7A  O    +2                                                BUG12221
     A**********  R_PAYRD        1A  O    +2                                                BUG12221
     A**********  R_NOSTD        6A  O    +4                                                BUG12221
     A**********  R_RATED       11S 7O    +3                                                BUG12221
     A**********                            EDTCDE(Z)                                       BUG12221
     A**********  R_EAMTD       15S 0O    +4                                                BUG12221
     A**********                            EDTCDE(1)                                       BUG12221
     A*
     A**********R R_STOTAL                                                                  BUG12221
     A**********                            SPACEB(002)                                     BUG12221
     A**********                          71                                                BUG12221
     A**********                            'Weight.Av.Rate:'                               BUG12221
     A**********  R_WARATET     13S 8O    92                                                BUG12221
     A**********                            EDTCDE(Z)                                       BUG12221
     A**********  R_EAMTT       15S 0O   109                                                BUG12221
     A**********                            EDTCDE(1)                                       BUG12221
     A*
     A                                    +1                                                BUG12221
     A                                      'Nostro'                                        BUG12221
     A                                    +2                                                BUG12221
     A                                      'App'                                           BUG12221
     A                                    +1                                                BUG12221
     A                                      'Deal No.'                                      BUG12221
     A                                    +6                                                BUG12221
     A                                      'Customer'                                      BUG12221
     A                                    +5                                                BUG12221
     A                                      'Event'                                         BUG12221
     A                                    +1                                                BUG12221
     A                                      'Type/'                                         BUG12221
     A                                    +1                                                BUG12221
     A                                      'Description'                                   BUG12221
     A                                   +10                                                BUG12221
     A                                      'CCY'                                           BUG12221
     A                                    +1                                                BUG12221
     A                                      'Event'                                         BUG12221
     A                                    +3                                                BUG12221
     A                                      'Pay/'                                          BUG12221
     A                                    +5                                                BUG12221
     A                                      'Rate'                                          BUG12221
     A                                   +13                                                BUG12221
     A                                      'Amount'                                        BUG12221
     A                                     3                                                BUG12221
     A                                      '(Main/'                                        BUG12221
     A                                      SPACEB(001)                                     BUG12221
     A                                   +27                                                BUG12221
     A                                      '(Event/'                                       BUG12221
     A                                    +6                                                BUG12221
     A                                      'Type'                                          BUG12221
     A                                    +2                                                BUG12221
     A                                      'Sub'                                           BUG12221
     A                                   +28                                                BUG12221
     A                                      'Date'                                          BUG12221
     A                                    +4                                                BUG12221
     A                                      'Rec'                                           BUG12221
     A                                     3                                                BUG12221
     A                                      'Sub)'                                          BUG12221
     A                                      SPACEB(001)                                     BUG12221
     A                                   +29                                                BUG12221
     A                                      'Transaction)'                                  BUG12221
     A                                     3                                                BUG12221
     A                                      '------'                                        BUG12221
     A                                      SPACEB(001)                                     BUG12221
     A                                    +1                                                BUG12221
     A                                      '------'                                        BUG12221
     A                                    +2                                                BUG12221
     A                                      '---'                                           BUG12221
     A                                    +1                                                BUG12221
     A                                      '--------'                                      BUG12221
     A                                    +6                                                BUG12221
     A                                      '------------'                                  BUG12221
     A                                    +1                                                BUG12221
     A                                      '-----'                                         BUG12221
     A                                    +1                                                BUG12221
     A                                      '-----'                                         BUG12221
     A                                    +1                                                BUG12221
     A                                      '-----------'                                   BUG12221
     A                                   +10                                                BUG12221
     A                                      '---'                                           BUG12221
     A                                    +1                                                BUG12221
     A                                      '-----'                                         BUG12221
     A                                    +3                                                BUG12221
     A                                      '----'                                          BUG12221
     A                                    +5                                                BUG12221
     A                                      '----'                                          BUG12221
     A                                   +13                                                BUG12221
     A                                      '------'                                        BUG12221
     A*                                                                                     BUG12221
     A          R R_DTLA                                                                    BUG12221
     A                                      SPACEB(001)                                     BUG12221
     A            R_BRNCHSH      3A  O     3                                                BUG12221
     A                                    +0                                                BUG12221
     A                                      '/'                                             BUG12221
     A            R_NOSTD        7A  O    10                                                BUG12221
     A            R_APPCD        2A  O    18                                                BUG12221
     A            R_DLND        13A  O    22                                                BUG12221
     A            R_CUSNSH       6A  O    36                                                BUG12221
     A                                    +0                                                BUG12221
     A                                      '/'                                             BUG12221
     A            R_ETYPSH       4A  O    49                                                BUG12221
     A            R_TYPD         1A  O    55                                                BUG12221
     A            R_STYPD        1A  O    57                                                BUG12221
     A            R_EDSCSH      20A  O    61                                                BUG12221
     A            R_ECCYSH       3A  O    82                                                BUG12221
     A            R_EDTESH       7A  O    86                                                BUG12221
     A            R_PAYRD        1A  O    95                                                BUG12221
     A            R_RATED       13A  O    97                                                BUG12221
     A            R_EAMTD       21A  O   111                                                BUG12221
     A*                                                                                     BUG12221
     A          R R_STOTAL                                                                  BUG12221
     A                                      SPACEB(002)                                     BUG12221
     A                                    82                                                BUG12221
     A                                      'Weight.Av.Rate:'                               BUG12221
     A            R_WARATET     13A       97                                                BUG12221
     A            R_EAMTT       21A      111                                                BUG12221
     A*                                                                                     BUG12221
     A          R R_DTLB                                                                    BUG12221
     A                                      SPACEB(001)                                     BUG12221
     A            R_BRNCHD       4A  O     3                                                BUG12221
     A            R_CUSND        6A  O    36                                                BUG12221
     A*                                                                                     BUG12221
     A**End of Change BUG12221
     A          R R_NORECFMT
     A                                      SPACEB(002)
     A                                    53
     A                                      '*** NO DETAILS TO REPORT ***'
     A                                      SPACEB(003)
     A*
     A          R R_ENDRPT
     A                                      SPACEB(002)
     A                                    54
     A                                      '***** END OF REPORT *****'
     A                                      SPACEB(003)
