      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas GL Account Postings Printer File')
      *****************************************************************
      *                                                               *
      *  Midas - Security Profile Facility                            *
      *                                                               *
      *  PRTF/GL0090P1 - Account Postings Printer File                *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.01 -----------------------------------------------*
      *  Prev Amend No. CGL007 *Create     Date 26Mar99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CGL007 - Account Postings Enquiry                            *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
      ***  First heading line
      *
     A          R HEADER1
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A                                      SKIPB(003)
     A                                     6'REFERENCE GL0090P1'
     A            BJURPT    R             35REFFLD(URPT)
     A                                    92'DATE'
     A            BJMRDT    R             97REFFLD(MRDT)
     A                                   107'PAGE'
     A                                   112PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(002)
      *
     A                                    50'ACCOUNT POSTINGS ENQUIRY'
     A                                      SPACEA(001)
     A                                    50'------------------------'
     A                                      SPACEA(001)
      *
     A                                     5'Branch'
     A                                    13'Customer'
     A                                    23'Currency'
     A                                    32'Account'
     A**Start of change CGL029
     A**********                          40'Account'                                         CGL029
     A**********                          51'Retail Account'                                  CGL029
     A**********                          67'Customer'                                        CGL029
     A**********                          79'Posting'                                         CGL029
     A**********                          88'Value'                                           CGL029
     A**********                          97'D/C'                                             CGL029
     A**********                         103'Posting Amount'                                  CGL029
     A                                    46'Account'
     A                                    57'Retail Account'
     A                                    73'Customer'
     A                                    85'Posting'
     A                                    94'Value'
     A                                   103'D/C'
     A                                   109'Posting Amount'
     A**End of change CGL029
     A                                      SPACEA(001)
     A                                    13'Number'
     A                                    32'Code'
     A**Start of change CGL029
     A**********                          40'Seq Number'                                      CGL029
     A**********                          54'Number'                                          CGL029
     A**********                          67'Shortname'                                       CGL029
     A**********                          79'Date'                                            CGL029
     A**********                          88'Date'                                            CGL029
     A                                    46'Seq Number'
     A                                    60'Number'
     A                                    73'Shortname'
     A                                    85'Date'
     A                                    94'Date'
     A**End of change CGL029
     A                                      SPACEA(001)
     A                                    62'Transaction'
     A                                    82'Posting Narrative'
     A                                      SPACEA(002)
      *
      ** Print details
      *
     A          R DETAIL1
      *
     A            RBRCH     R              6REFFLD(BRCA)
     A            RCNUM     R             14REFFLD(AENB)
     A            RCCY      R             24REFFLD(CCY)
     A**Start of change CGL029
      **********                                                                              CGL029
     A**********  RACOD     R             31REFFLD(ACODA)                                     CGL029
     A**********  RACSQ     R             42REFFLD(ACSQA)                                     CGL029
     A**********  RRACN     R             52REFFLD(IMAC)                                      CGL029
     A**********  RCSNM     R             67REFFLD(CSSN)                                      CGL029
     A**********  RPSDT     R             79REFFLD(DMY7)                                      CGL029
     A**********  RVALD     R             88REFFLD(DMY7)                                      CGL029
     A**********  RDC       R             98REFFLD(RDDRCR)                                    CGL029
     A**********  RPAMT     R            103REFFLD(ZZ016)                                     CGL029
     A            RACOD         10A       31
     A            RACSQ     R             48REFFLD(ACSQA)
     A            RRACN     R             58REFFLD(IMAC)
     A            RCSNM     R             73REFFLD(CSSN)
     A            RPSDT     R             85REFFLD(DMY7)
     A            RVALD     R             94REFFLD(DMY7)
     A            RDC       R            104REFFLD(RDDRCR)
     A            RPAMT     R            109REFFLD(ZZ016)
     A**End of change CGL029
     A                                      SPACEA(001)
     A            RTRAN     R             62REFFLD(OTRF)
     A            RPNAR     R             82REFFLD(PNAR)
     A                                      SPACEA(001)
      *
      ** Print footer
      *
     A          R FOOTING1                  SPACEB(003)
      *
     A                                     5'Selection :'
     A                                      SPACEA(001)
     A            RSBRCH    R              6REFFLD(BRCA)
     A            RSCNUM    R             14REFFLD(AENB)
     A            RSCCY     R             24REFFLD(CCY)
     A**Start of change CGL029
     A**********  RSACOD    R             31REFFLD(ACODA)                                     CGL029
     A**********  RSACSQ    R             42REFFLD(ACSQA)                                     CGL029
     A**********  RSRACN    R             52REFFLD(IMAC)                                      CGL029
     A**********  RSCSNM    R             67REFFLD(CSSN)                                      CGL029
     A**********  RSPSDT    R             79REFFLD(DMY7)                                      CGL029
     A**********  RSVALD    R             88REFFLD(DMY7)                                      CGL029
     A**********  RSDC      R             98REFFLD(RDDRCR)                                    CGL029
     A**********  RSPAMT    R            103REFFLD(ZZ016)                                     CGL029
     A            RSACOD        10A       31
     A            RSACSQ    R             48REFFLD(ACSQA)
     A            RSRACN    R             58REFFLD(IMAC)
     A            RSCSNM    R             73REFFLD(CSSN)
     A            RSPSDT    R             85REFFLD(DMY7)
     A            RSVALD    R             94REFFLD(DMY7)
     A            RSDC      R            104REFFLD(RDDRCR)
     A            RSPAMT    R            109REFFLD(ZZ016)
     A**End of change CGL029
     A                                      SPACEA(001)
     A            RSTRAN    R             62REFFLD(OTRF)
