      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas GL Deleted batch report')                        *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  PRTF/GL0123PM - Deleted batch report                         *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *                                                               *
      *  Last Amend No. LUC110             Date 22Jan19               *
      *  Prev Amend No. CGL135A            Date 10Jul13               *
      *                 AR1065437          Date 23Jan13               *
      *                 263682             Date 03Aug12               *
      *                 CER059             Date 19Jul10               *
      *                 BUG23742           Date 09May09               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CGL029             Date 01Sep03               *
      *                 CGL013             Date 29Mar02               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      * Midas DBA 3.03 -----------------------------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CGL008             DATE 09Mar99               *
      *                 CEU013             DATE 02Apr98               *
      *                 S01408             DATE 13Aug96               *
      *                 076559             DATE 27SEP94               *
      *                 S01413             DATE 13APR93               *
      *                 S10736                  09SEP92               *
      *                 E38270                  06JUL92               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  LUC110 - Extended Narratives (Upgrade NUC002 to FBM 2.1)     *
      *           Use core hook GL0123PM07                            *
      *           Use core hook GL0123PM17                            *
      *           Addition of hook LUC110_047                         *
      *           Addition of hook LUC110_048                         *
      *  CGL135A - Accounting Rules Process                           *
      *            Added hook: CGL135_033                             *
      *  AR1065437 - Extra fields on PEA Audit Report                 *
      *  263682 - Account sequence is overlapped by the account code. *
      *           Adjust the position of fields                       *
      *         - Applied for AR568860                                *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  BUG23742 - Improper handling of Ext Narr from Batch Interface*
      *             Input                                             *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CGL013 - MT94x Messages Generation                           *
      *  CGL008 - Security on Journal Entry                           *
      *  CEU013 - EMU Account Postings Narrative                      *
      *  S01408 - Core Hook GL0123PM03 Added                          *
      *         - Core Hook GL0123PM02 Added                          *
      *         - Core Hook GL0123PM01 Added                          *
      *  076559 - INCLUDE BRANCH NAME ON PAGE HEADING                 *
      *  S01413 - Retail 3 Incorporation                              *
      *  S10736 - Management Accounts                                 *
      *  E38270 - No branch should be shown when single branching     *
      *                                                               *
      *****************************************************************
     A                                      INDARA
     A*********             Start of Change                /*S01413*/
     A                                      REF(MFRFL)
     A*********             End of Change                  /*S01413*/
      *=========================================================================
     A          R $APAGHDR
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*/COPY WNCPYSRC,GL0123PM08
     A                                      SKIPB(3)
     A*/COPY WNCPYSRC,GL0123PM09
      *.........................................................................
     A                                     2'REFERENCE'
     A            $APGM         10        12TEXT('*PROGRAM')
     A            $AURPT        53        46TEXT('User Report Title')
     A                                   111'DATE'
     A            $AMRDT         7       116TEXT('Midas Rundate')
     A                                   124'PAGE'
     A                                   129PAGNBR
     A                                      EDTCDE(3)
     A            $AREPT        53        46TEXT('Report Title')
     A                                      SPACEB(2)
      *                                     Start of change /076559/
     A*/COPY WNCPYSRC,GL0123PM10
     A                                    95'BRANCH'
     A            $BRCA     R            102REFFLD(BRCA)
     A*/COPY WNCPYSRC,GL0123PM11
      *                                       End of change /076559/
     A            $AUNDL        53        46TEXT('Underline')
     A                                      SPACEB(1)
      * 'Hidden' internal version of *COMPANY NAME
     A  99N99     $ACMP         40         1SPACEB(1)
      * 'Hidden' internal version of Command text 1
     A  99N99     $ACTX1        78         1SPACEB(1)
      * 'Hidden' internal version of Command text 2
     A  99N99     $ACTX2        78         1SPACEB(1)
      *=========================================================================
     A          R $DKEYHDR                  TEXT('Batch number')
     A                                      SPACEB(2)
      *.........................................................................
     A                                     2'Batch................:'
     A            $DBTNB         3        25TEXT('Batch number')
     A                                    29'Status...:'
     A            $DBSTS        10        40TEXT('Batch status')
     A*                                                           /Start S01408/
     A*/COPY WNCPYSRC,GL0123PM01
     A*                                                           /End   S01408/
     A                                    90'Description:'
     A            $DBDSC        30       103TEXT('batch description Screen')
     A*                                    /E38270/
     A**********                           3'Branch...............:'
     A**********                            SPACEB(1)
     A**********  $DBCDP         3        26TEXT('Branch Code (Print)')
     A**********  $DBNMD        30        31TEXT('Branch name (display)')
      *                                              Begin /CGL008/
     A*N80*******                          3'Branch...............:'
     A N80                                 2'Branch...............:'
      *                                              End   /CGL008/
     A N80                                  SPACEB(1)
      *                                              Begin /CGL008/
     A*N80******* $DBCDP         3        26TEXT('Branch Code (Print)')
     A*N80******* $DBNMD        30        31TEXT('Branch name (display)')
     A N80        $DBCDP         3        25TEXT('Branch Code (Print)')
     A N80        $DBNMD        30        29TEXT('Branch name (display)')
      *                                              End   /CGL008/
     A*                                    /E38270/
     A*                                                           /Start S01408/
     A*/COPY WNCPYSRC,GL0123PM02
     A*                                                           /End   S01408/
     A                                    90'Total: Input......:'
     A*********             Start of Change                /*S01413*/
     A  80                                  SPACEB(1)
     A*********             End of Change                  /*S01413*/
     A            $DFMA2        23       110TEXT('Formatted amount 2')
     A                                     2'Department...........:'
     A                                      SPACEB(1)
     A            $DDCDP         3        25TEXT('Department Code (Print)')
     A            $DDNDS        30        29TEXT('Department name (display)')
     A*                                                           /Start S01408/
     A*/COPY WNCPYSRC,GL0123PM03
     A*                                                           /End   S01408/
     A                                    97'Calculated.:'
     A            $DFMAM        23       110TEXT('Formatted amount')
     A*                                    /E38270/
     A*N79******                           3'Multiple Branch Batch:'
      *                                              Begin /CGL008/
     A*N80*******                          3'Multiple Branch Batch:'
     A N80                                 2'Multiple Branch Batch:'
      *                                              End   /CGL008/
     A*                                    /E38270/
     A                                      SPACEB(1)
     A*                                    /E38270/
     A*N79******  $DMBIP         1        26TEXT('Multiple Branch Ind Print')
      *                                               Begin /CGL008/
     A*N80******* $DMBIP         1        26TEXT('Multiple Branch Ind Print')
     A N80        $DMBIP         1        25TEXT('Multiple Branch Ind Print')
      *                                               End   /CGL008/
     A*                                    /E38270/
     A                                    90'Items: Input......:'
     A*********             Start of Change                /*S01413*/
     A  80                                  SPACEB(1)
     A*********             End of Change                  /*S01413*/
     A            $DIINP         3  0    130TEXT('Items Input (Print)')
     A                                      EDTCDE(3)
     A                                     2'Terminal.............:'
     A                                      SPACEB(1)
     A            $DTIDP        10        25TEXT('Terminal I.D. (Print)')
     A*/COPY WNCPYSRC,GL0123PM04
     A                                    97'Calculated.:'
     A            $DICLP         3  0    130TEXT('Items Calculated (Print)')
     A                                      EDTCDE(3)
      *                                              Begin /CGL008/
     A N22                                 2'Last Insert User.....:'
     A                                      SPACEB(1)
     A N22        $DUSRI        10        25
     A N22                                 2'Last Amend User......:'
     A                                      SPACEB(1)
     A N22        $DUSRA        10        25
      *                                              End   /CGL008/
      **Start of change AR1065437
     A  98                                53'Journal Entry Type......:'
     A  98        ZQJETP         1A  O    79TEXT('Journal Entry Type')
     A  98                                 2'Booking Date.........:'
     A                                      SPACEB(1)
     A  98        ZQBDTE         7A  O    25TEXT('Booking Date')
     A  98                                53'Prevent Transfer to Sys.:'
     A  98        ZQPTRS         1A  O    79TEXT('Prevent Transfer to +
     A                                            System')
      **End of change AR1065437
     A*                                    /E38270/
     A**********                           2'Item        Account number    Bran-
     A**********                            ch        Amount                   -
     A**********                              Narrative                 Type   -
     A**********                                 Retail Number   Nostro'
     A*********             Start of Change                /*S01413*/
     A*N80*****                            2'Item        Account number    Bran-
     A*********                             ch        Amount                   -
     A*********                               Narrative                 Type   -
     A*********                                  Retail Number   Nostro'
     A*/COPY WNCPYSRC,GL0123PM13
     A**Start of change CGL029
     A*N80N51***                           2'Item        Account number    Bran-              CGL029
     A**********                            ch        Amount                   -              CGL029
     A**********                             Narrative              Type       -              CGL029
     A**********                                    Retail A/C  Nostro'                       CGL029
     A N80N51                              2'Item           Account number     -
     A                                        Branch        Amount             -
     A                                             Narrative              Type -
      **Start of change 263682
     A**********                                          Retail A/C  Nostro'                 263682
     A                                             Retail A/C  Nostro'
      **End of change 263682
     A**End of change CGL029
     A                                      SPACEB(2)
     A**80*****                            2'Item        Account number        -
     A*********                                       Amount                   -
     A*********                               Narrative                 Type   -
     A*********                                  Retail Number   Nostro'
     A**Start of change CGL029
     A**80N51***                           2'Item        Account number        -              CGL029
     A**********                                      Amount                   -              CGL029
     A**********                             Narrative              Type       -              CGL029
     A**********                                    Retail A/C  Nostro'                       CGL029
     A*********             End of Change                  /*S01413*/
     A  80N51                              2'Item           Account number     -
     A                                                      Amount             -
     A                                             Narrative              Type -
      **Start of change 263682
     A**********                                          Retail A/C  Nostro'                 263682
     A                                             Retail A/C  Nostro'
      **End of change 263682
     A**End of change CGL029
     A                                      SPACEB(2)
     A**********                           2'----      ------------------  -----
     A**********                            --   --------------------   --------
     A**********                            -----------------------    ------- -
     A**********                               ----------------  ------'
     A*********             Start of Change                /*S01413*/
     A*N80*****                            2'----      ------------------  -----
     A*********                             --   --------------------   --------
     A*********                             -----------------------    ------- -
     A*********                                ----------------  ------'
     A**Start of change CGL029
     A*N80N51***                           2'----      ------------------  -----              CGL029
     A**********                            --   --------------------   --------              CGL029
     A**********                            ----------------------  ----- -                   CGL029
     A**********                                         ----------  ------'                  CGL029
     A N80N51                              2'----      -------------------------
     A                                        ------   --------------------   --
     A                                      ----------------------------  ------
      **Start of change 263682
     A**********                                          ----------  ------'                 263682
     A                                             ----------  ------'
      **End of change 263682
     A**End of change CGL029
     A                                      SPACEB(1)
     A**80*****                            2'----      ------------------      -
     A*********                                  --------------------   --------
     A*********                             -----------------------    ------- -
     A*********                                ----------------  ------'
     A**Start of change CGL029
     A**80N51***                           2'----      ------------------      -              CGL029
     A**********                                 --------------------   --------              CGL029
     A**********                            ----------------------  ----- -                   CGL029
     A**********                                         ----------  ------'                  CGL029
     A  80N51                              2'----      -------------------------
     A                                                 --------------------   --
     A                                      ----------------------------  ------
      **Start of change 263682
     A**********                                          ----------  ------'                 263682
     A                                             ----------  ------'
      **End of change 263682
     A**End of change CGL029
     A                                      SPACEB(1)
     A*                                    /E38270/
     A**Start of change CGL029
     A**80*51***                           2'Item        Account number        -              CGL029
     A**********                                      Amount                   -              CGL029
     A**********                             Narrative              Type  No of-              CGL029
     A**********                             Items  Retail A/C  Nostro'                       CGL029
      **Start of change 263682
     A  80 51                            107 'No of'
     A                                      SPACEB(1)
      **End of change 263682
     A  80 51                              2'Item           Account number     -
     A                                                      Amount             -
     A                                             Narrative              Type -
      **Start of change 263682
     A**********                             No of Items  Retail A/C  Nostro'                 263682
     A                                      Items  Retail A/C  Nostro'
      **End of change 263682
     A**End of change CGL029
     A                                      SPACEB(2)
     A**Start of change CGL029
     A**80*51***                           2'----      ------------------      -              CGL029
     A**********                                 --------------------   --------              CGL029
     A**********                            ----------------------  ----- -                   CGL029
     A**********                            -----------  ----------  ------'                  CGL029
     A  80 51                              2'----      -------------------------
     A                                                 --------------------   --
     A                                      ----------------------------  ------
     A                                       -----------  ----------  ------'
     A**End of change CGL029
     A                                      SPACEB(1)
     A**Start of change CGL029
     A*N80*51***                           2'Item        Account number    Bran-              CGL029
     A**********                            ch        Amount                   -              CGL029
     A**********                             Narrative              Type  No of-              CGL029
     A**********                             Items  Retail A/C  Nostro'                       CGL029
      **Start of change 263682
     A N80 51                            107'No of'
     A                                      SPACEB(1)
      **End of change 263682
     A N80 51                              2'Item           Account number     -
     A                                        Branch        Amount             -
     A                                             Narrative              Type -
      **Start of change 263682
     A**********                             No of Items  Retail A/C  Nostro'                 263682
     A                                       Items Retail A/C  Nostro'
      **End of change 263682
     A**End of change CGL029
     A                                      SPACEB(2)
     A**Start of change CGL029
     A*N80*51***                           2'----      ------------------  -----              CGL029
     A**********                            --   --------------------   --------              CGL029
     A**********                            ----------------------  ----- -                   CGL029
     A**End of change CGL029
     A*/COPY WNCPYSRC,GL0123PM14
     A**Start of change CGL029
     A**********                            -----------  ----------  ------'                  CGL029
     A N80 51                              2'----      -------------------------
     A                                        ------   --------------------   --
     A                                      ----------------------------  ------
      **Start of change 263682
     A**********                             -----------  ----------  ------'                 263682
     A                                       ----  ----------  ------'
      **End of change 263682
     A**End of change CGL029
     A                                      SPACEB(1)
     A*********             End of Change                  /*S01413*/
     A                                     4' '
     A                                      SPACEB(1)
      * 'Hidden' internal version of Batch Status (Display)
     A  99N99     $DBSTD         6         1SPACEB(1)
      * 'Hidden' internal version of Reversal/void indicator
     A  99N99     $DREVI         1         1SPACEB(1)
      *=========================================================================
     A          R $ECOLHDG                  TEXT('Detail line headings         -
     A                                                                         -
     A                                                      ')
     A                                      SPACEB(1)
      *.........................................................................
      * Dummy field to keep format
     A  99N99                              1' '
      *=========================================================================
     A          R $EDTLRCD                  TEXT('Detail line.')
     A                                      SPACEB(1)
      *.........................................................................
     A            $EBINB         3  0      2TEXT('Batch item no.')
     A                                      EDTCDE(4)
     A            $ECUST         6        12TEXT('Customer number')
     A            $ECYCD         3        19TEXT('Currency code')
     A**Start of change CGL029
     A**********  $EACCD         4        23TEXT('Account code')                              CGL029
     A            $EACCD        10        23TEXT('Account code')
     A**End of change CGL029
      **Start of change 263682
     A**********  $EACSN         2        28TEXT('Account sequence number')                   263682
     A            $EACSN         2        34TEXT('Account sequence number')
      **End of change 263682
     A*                                    /E38270/
     A**********  $EIBCA         3        33TEXT('Input Branch Code - Alpha')
     A*/COPY WNCPYSRC,GL0123PM15
      **Start of change 263682
     A*N80******  $EIBCA         3        33TEXT('Input Branch Code - Alpha')                 263682
     A N80        $EIBCA         3        38TEXT('Input Branch Code - Alpha')
      **End of change 263682
     A*                                    /E38270/
      **Start of change 263682
     A**********  $EPAMP        18        41TEXT('Posting Amount (Print)')                    263682
     A**********  $EDCIN         1        60TEXT('Debit/credit indicator')                    263682
      */COPY WNCPYSRC,LUC110_047
     A            $EPAMP        18        47TEXT('Posting Amount (Print)')
     A            $EDCIN         1        66TEXT('Debit/credit indicator')
      **End of change 263682
     A*********             Start of Change                /*S01413*/
     A*********   $ENRTV        30        64TEXT('Narrative')
      **Start of change 263682
     A*********   $ENRTV        30        63TEXT('Narrative')                                 263682
     A            $ENRTV        30        70TEXT('Narrative')
      */COPY WNCPYSRC,LUC110_048
      **End of change 263682
     A*********   $ETRTY         5        99TEXT('Transaction type')
      **Start of change 263682
     A**********  $ETRTY         5        95TEXT('Transaction type')                          263682
     A**51******  $ENITM    R            104REFFLD(NOITMS)                                    263682
     A            $ETRTY         5       101TEXT('Transaction type')
     A  51        $ENITM    R            107REFFLD(NOITMS)
      **End of change 263682
     A                                      EDTCDE(4)
     A*N79*****   $ERACN        10  0    113TEXT('Retail account number')
      **Start of change 263682
     A*N79******  $ERACN        10  0    114TEXT('Retail account number')                     263682
     A N79        $ERACN        10  0    113TEXT('Retail account number')
      **End of change 263682
     A*********             End of Change                  /*S01413*/
      **Start of change 263682
     A**********  $ENOCD         5       128TEXT('Nostro Code')                               263682
     A            $ENOCD         5       125TEXT('Nostro Code')
      **End of change 263682
     A*/COPY WNCPYSRC,GL0123PM07
     A N78                                 2' '
     A                                      SPACEB(1)
     A N77                                12'Cheque:'
     A N77        $ECQNB         8        20TEXT('Cheque number')
     A N76                                30'Assoc. Customer:'
     A N76        $EACNB         6        47TEXT('Assoc. Customer number')
     A N75                                55'Value Date:'
     A N75        $EVDTP         8        67TEXT('Value Date (Print)')
     A N74                                77'SWIFT:'
     A N74        $ESWCR        16        84TEXT('Swift common reference')
     A*/COPY OFCPYSRCZ,CGL135_033                                                            CGL135A
     A N73                                12'Customer Name......:'
     A                                      SPACEB(1)
     A N73        $EDCNM        20        33TEXT('Display Customer Name')
     A N72                                55'Account Name...........:'
     A N72        $EDACN        20        80TEXT('Display Account Name')
     A N71                               103'Book Code:'
     A N71        $EBKCD         2       114TEXT('Book Code')
     A*                                                      /*S10736*/
     A N63                               117'Void:'
     A N63        $ERVDI         1       123TEXT('Reverse/Void Indicator')
     A*                                                      /*S10736*/
     A N70                                12'O''ride:'
     A                                      SPACEB(1)
     A N70        $ERINO         1        20TEXT('Retail ind.: Override')
     A            $EIEMP        80        22TEXT('Item error message-print')
     A*                                                      /*CEU013*/
      **Start of change AR1065437
     A  98                                12'Base Currency Rate.:'
     A                                      SPACEB(1)
     A  98        ZQBCRT        14A  O    33TEXT('Base Currency Rate')
     A  98                                55'Base Ccy Rate Ind . . .:'
     A  98        ZQBCIN         1A  O    80TEXT('Base Ccy Rate +
     A                                            Indicator')
      **End of change AR1065437
     A N66                                12'Original Ccy/Amount:'
     A                                      SPACEB(1)
     A N66        $EOCCY         3        33TEXT('Original Currency')
     A N66        $EOAMT        23        37TEXT('Original Amount')
     A*                                                      /*CEU013*/
      *
      ** Start of Change CGL013
      *
     A  31                                12'Additional Information:'
     A                                      SPACEB(1)
     A  31                                70'ERI Information Indicator:'
     A  31        $EAERI         1        97TEXT('Add Info Line 1')
      *
     A  31        $EADI1        65        17TEXT('Add Info Line 1')
     A                                      SPACEB(1)
     A  31 32     $EADI2        65        17TEXT('Add Info Line 2')
     A                                      SPACEB(1)
     A  31 33     $EADI3        65        17TEXT('Add Info Line 3')
     A                                      SPACEB(1)
     A  31 34     $EADI4        65        17TEXT('Add Info Line 4')
     A                                      SPACEB(1)
     A  31 35     $EADI5        65        17TEXT('Add Info Line 5')
     A                                      SPACEB(1)
     A  31 36     $EADI6        65        17TEXT('Add Info Line 6')
     A                                      SPACEB(1)
      *
      ** End of Change CGL013
      *
      **Start of change BUG23742
      *
     A  48                                12'Multicash Narrative:'
     A                                      SPACEB(1)
     A  48 18     $EEX1         65        17TEXT('Multicash Nar 1')
     A                                      SPACEB(1)
     A  48 19     $EEX2         65        17TEXT('Multicash Nar 2')
     A                                      SPACEB(1)
     A  48 20     $EEX3         65        17TEXT('Multicash Nar 3')
     A                                      SPACEB(1)
     A  48 21     $EEX4         65        17TEXT('Multicash Nar 4')
     A                                      SPACEB(1)
     A  48 23     $EEX5         65        17TEXT('Multicash Nar 5')
     A                                      SPACEB(1)
     A  48 24     $EEX6         65        17TEXT('Multicash Nar 6')
     A                                      SPACEB(1)
     A  48 25     $EEX7         65        17TEXT('Multicash Nar 7')
     A                                      SPACEB(1)
     A  48 26     $EEX8         65        17TEXT('Multicash Nar 8')
     A                                      SPACEB(1)
     A  48 27     $EEX9         65        17TEXT('Multicash Nar 9')
     A                                      SPACEB(1)
     A  48 28     $EEX10        65        17TEXT('Multicash Nar 10')
     A                                      SPACEB(1)
     A  48 29     $EEX11        65        17TEXT('Multicash Nar 11')
     A                                      SPACEB(1)
     A  48 37     $EEX12        65        17TEXT('Multicash Nar 12')
     A                                      SPACEB(1)
     A  48 38     $EEX13        65        17TEXT('Multicash Nar 13')
     A                                      SPACEB(1)
     A  48 39     $EEX14        65        17TEXT('Multicash Nar 14')
     A                                      SPACEB(1)
     A  48 40     $EEX15        65        17TEXT('Multicash Nar 15')
     A                                      SPACEB(1)
     A  48 41     $EEX16        65        17TEXT('Multicash Nar 16')
     A                                      SPACEB(1)
     A  48 42     $EEX17        65        17TEXT('Multicash Nar 17')
     A                                      SPACEB(1)
     A  48 43     $EEX18        65        17TEXT('Multicash Nar 18')
     A                                      SPACEB(1)
     A  48 44     $EEX19        65        17TEXT('Multicash Nar 19')
     A                                      SPACEB(1)
     A  48 45     $EEX20        65        17TEXT('Multicash Nar 20')
     A                                      SPACEB(1)
     A  48 46     $EEX21        65        17TEXT('Multicash Nar 21')
     A                                      SPACEB(1)
     A  48 47     $EEX22        65        17TEXT('Multicash Nar 22')
     A                                      SPACEB(1)
      *
      **End of change BUG23742
      *
     A*/COPY WNCPYSRC,GL0123PM12
     A N69        $EWNFF       131         2TEXT('Window Function Field')
     A                                      SPACEB(1)
     A N68        $EWNF1       131         2TEXT('Window Function Field 1')
     A                                      SPACEB(1)
     A N67        $EWNF2       131         2TEXT('Window Function Field 2')
     A                                      SPACEB(1)
     A*/COPY WNCPYSRC,GL0123PM06
     A                                    12'-----------------------------------
     A                                      ------------------------------------
     A                                      -------------------'
     A                                      SPACEB(1)
      * 'Hidden' internal version of Batch number
     A  99N99     $EBTNB         3         1SPACEB(1)
      * 'Hidden' internal version of Nostro number (Item)
     A  99N99     $ENNBI         2         1SPACEB(1)
      * 'Hidden' internal version of Retail ind.: Error
     A  99N99     $ERINE         1         1SPACEB(1)
      * 'Hidden' internal version of Posting amount
     A  99N99     $EPTAM        13  0      1SPACEB(1)
      * 'Hidden' internal version of Posting date
     A  99N99     $EPTDT         5  0      1SPACEB(1)
      * 'Hidden' internal version of Value date
     A  99N99     $EVLDT         5  0      1SPACEB(1)
     A*/COPY WNCPYSRC,GL0123PM16
      * 'Hidden' internal version of Narrative code
     A  99N99     $ENVCD         2         1SPACEB(1)
      * 'Hidden' internal version of Narrative description
     A  99N99     $ENRDC        30         1SPACEB(1)
     A*/COPY WNCPYSRC,GL0123PM17
      * 'Hidden' internal version of Account type
     A  99N99     $EACTY         1         1SPACEB(1)
      * 'Hidden' internal version of Customer originated ind.
     A  99N99     $ECOIN         1         1SPACEB(1)
      * 'Hidden' internal version of Spread Factor
     A  99N99     $ESPFC         8  0      1SPACEB(1)
     A**'Hidden'*internal*version*of*Reverse/Void*Indicator /*S10736*/
     A**99N99*****$ERVDI*********1*********1SPACEB(1)****** /*S10736*/
     A***************************************************** /*S10736*/
      * 'Hidden' internal version of Profit centre
     A  99N99     $EPRCN         4         1SPACEB(1)
      * 'Hidden' internal version of Branch Code (Batch Headr)
     A  99N99     $EBCBH         3         1SPACEB(1)
      * 'Hidden' internal version of Retail advice printed
     A  99N99     $ERADP         1         1SPACEB(1)
      * 'Hidden' internal version of Shadow post indicator
     A  99N99     $ESHPI         1         1SPACEB(1)
      * 'Hidden' internal version of Relative rec no of memos
     A  99N99     $ERRNM         5  0      1SPACEB(1)
      * 'Hidden' internal version of Retail Number Entered
     A  99N99     $ERNBE         1         1SPACEB(1)
      * 'Hidden' internal version of Retail Ac Referral Cond.
     A  99N99     $ERARC        10         1SPACEB(1)
      * 'Hidden' internal version of Transaction (Sub - Type)
     A  99N99     $ETSTY        10         1SPACEB(1)
     A*/COPY WNCPYSRC,GL0123PM05
      *=========================================================================
     A          R $HENDRPT                  TEXT('End of report')
     A                                      SPACEB(2)
      *.........................................................................
     A                                    62'*** END OF REPORT ***'
      *=========================================================================
