      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_AU60                                                      *
/*EXI *  TEXT('Midas GL File Control Audit report')
     A********************************************************************
     A**                                                                **
     A*  Midas   GENERAL LEDGER MODULE
     A**                                                                **
     A**     GL0930AU - AUDIT REPORT FOR FILE CONTROL PROGRAM           **
     A**                                                                **
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A**                                                                **
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A**     LAST AMEND NO. XXXXXX           DATE DDMMMYY               **
     A**                                                                **
     A**--------------------------------------------------------------- **
     A**                                                                **
     A**     XXXXXX - XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX             **
     A**                                                                **
     A*****************************************************************
     A                                      INDARA
      *=========================================================================
     A          R TITLE
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                      SKIPB(3)
     A                                     7'REFERENCE'
     A                                    17'GL0930'
     A            BANKT         53        37
     A                                   101'DATE'
     A            DATEA          7       106
     A                                   119'PAGE'
     A                                   124PAGNBR
     A                                      EDTCDE(3)
     A                                      SPACEA(2)
     A                                    49'GENERATION OF AUDIT REPORTS - AUD+
     A                                      IT'
     A                                      SPACEA(1)
     A                                    49'----------------------------------+
     A                                      -'
     A                                      SPACEA(2)
     A          R DBERRF
     A                                     5'DATABASE ERROR OCCURRED ON '
     A            DBCAUS        23        32
     A                                      SPACEA(2)
     A          R CALERRF
     A                                     5'ERROR ON CALL TO PROGRAM '
     A            PGM           10        30
     A                                      SPACEA(2)
     A          R FCERRF
     A                                     5'FILE CONTROLS OUT OF BALANCE FOR'
     A            FCCAUS        10        38
     A                                    48'- SEE REPORTS FOR DETAILS'
     A                                      SPACEA(2)
     A          R FOOTER
     A                                     5'ALL AUDIT REPORTS RAN SUCCESSFULLY'
     A                                      SPACEA(2)
     A          R ENDF
     A                                      SPACEB(2)
     A                                    56'***END OF REPORT***'
