      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas Generate Extension File')
     A*****************************************************************
     A*                                                               *
     A*  Midas   Retail Module
     A*                                                               *
     A*  PRTF/GL3271ZP - GENERATE EXTENSION FILE                      *
     A*                                                               *
     A*  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  PREV AMEND NO. S01413 *CREATE     DATE 13APR93               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  MD046248 - Finastra Rebranding                               *
     A*  S01413 - Retail 3 Incorporation                              *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR DOCUMENT HEADER
     A**---------------------------------------------------------------
     A*
     A          R HEADAU
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A                                      SKIPB(3)
     A                                     5'Reference'
     A                                    15'GL3271ZP'
     A            RRURPT        53        38
     A                                   101'Date'
     A            RRMRDT         7       106
     A                                   119'Page'
     A                                   124PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(2)
     A                                    53'GENERATE EXTENSION FILE'
     A                                      SPACEA(1)
     A                                    53'-----------------------'
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR CONTROL REPORT
     A**---------------------------------------------------------------
     A*
     A          R CONTROL
     A                                     5'PF/ACCNTBXC'
     A                                      SPACEB(3)
     A                                    40'-------- PROGRAM -------'
     A                                      SPACEA(2)
     A                                     5'Number of records Generated'
     A            RRWRIT         7  0     49EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A**---------------------------------------------------------------
     A**   FORMAT FOR DATABASE ERROR MESSAGE
     A**---------------------------------------------------------------
     A*
     A          R ERRORAU                   TEXT('DATABASE ERROR MSG')
     A                                      SPACEB(3)
     A                                    20'***********************   D A T A -
     A                                        B A S E   E R R O R   ***********-
     A                                      **********'
     A                                      SPACEA(3)
     A                                    20'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                      SPACEA(1)
     A                                    20'*'
     A                                    98'*'
     A                                      SPACEA(1)
     A                                    20'*'
     A                                    98'*'
     A                                    30'File name :'
     A            DBFILE        10        66
     A                                      SPACEA(1)
     A                                    20'*'
     A                                    98'*'
     A                                      SPACEA(1)
     A                                    20'*'
     A                                    98'*'
     A                                    30'Key :'
     A            DBKEY         29        66
     A                                      SPACEA(1)
     A                                    20'*'
     A                                    98'*'
     A                                      SPACEA(1)
     A                                    20'*'
     A                                    98'*'
     A                                    30'Program name :'
     A            DBPGM         10        66
     A                                      SPACEA(1)
     A                                    20'*'
     A                                    98'*'
     A                                      SPACEA(1)
     A                                    20'*'
     A                                    98'*'
     A                                    30'At :'
     A            DBASE          3  0     66
     A                                      SPACEA(1)
     A                                    20'*'
     A                                    98'*'
     A                                      SPACEA(1)
     A                                    20'*'
     A                                    98'*'
     A                                      SPACEA(1)
     A                                    20'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                      SPACEA(1)
     A*
