      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_AU60                                                      *
/*EXI *  TEXT('Midas DL IR FRA Revaluation Report AUDIT')
     A*****************************************************************
     A*                                                               *
     A*  Midas - FRA/IRS Module
     A*                                                               *
     A*  DL1950AU - FRA Revaluation Report AUDIT                      *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CAS006             Date 21Jan03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  Prev Amend No. S01328             Date 04Feb91               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  CAS006 - Hedge Accounting Phase B                            *
     A*  S01328 - FRA/IRS Revaluation - New Print File.               *
     A*                                                               *
     A*****************************************************************
      *
     A                                      REF(MFRFL)
     A                                      INDARA
      *
      *------------------*
      ***  Report Header *
      *------------------*
      *
     A          R HEADAU                    TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A                                      SKIPB(3)
     A                                     7'REFERENCE DL1950AU'
     A            BJURPT    R             37REFFLD(BJURPT SDBANKPD)
     A                                   101'DATE'
     A            BJMRDT    R            106REFFLD(BJMRDT SDBANKPD)
     A                                   119'PAGE'
     A                                   124PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(1)
      *
     A                                   101'TIME'
     A                                   106TIME
     A                                      EDTWRD('  :  :  ')
     A                                      SPACEA(1)
      *
     A                                    48'FRA REVALUATION REPORT - AUDIT'
     A                                      SPACEA(1)
      *
     A                                    48'------------------------------'
     A                                      SPACEA(3)
      *
      *-----------------*
      ***  File Control *
      *-----------------*
      *
     A          R CONTROL
     A                                    58'CALCULATED'
     A                                      SPACEA(1)
     A                                    58'----------'
     A                                      SPACEA(3)
      *
     A*/COPY WNCPYSRC,DL1950AU02
     A**Start of change CAS006
     A**01******                           6'FILE - FRA DEALS FILE +                          CAS006
     A**********                            - LF/DLFRDLL1'                                    CAS006
     A**02******                           6'FILE - FRA DEALS FILE +                          CAS006
     A**********                            - LF/DLFRDLL2'                                    CAS006
     A**03******                           6'FILE - FRA DEALS FILE +                          CAS006
     A**********                            - LF/DLFRDLL3'                                    CAS006
     A**04******                           6'FILE - FRA DEALS FILE +                          CAS006
     A**********                            - LF/DLFRDLL4'                                    CAS006
     A**05******                           6'FILE - FRA DEALS FILE +                          CAS006
     A**********                            - LF/DLFRDLL5'                                    CAS006
     A  01N25                              6'FILE - FRA DEALS FILE +
     A                                      - LF/DLFRDLL1'
     A  02N25                              6'FILE - FRA DEALS FILE +
     A                                      - LF/DLFRDLL2'
     A  03N25                              6'FILE - FRA DEALS FILE +
     A                                      - LF/DLFRDLL3'
     A  04N25                              6'FILE - FRA DEALS FILE +
     A                                      - LF/DLFRDLL4'
     A  05N25                              6'FILE - FRA DEALS FILE +
     A                                      - LF/DLFRDLL5'
     A  01 25                              6'FILE - FRA DEALS FILE +
     A                                      - LF/DLFRDLLA'
     A  02 25                              6'FILE - FRA DEALS FILE +
     A                                      - LF/DLFRDLLB'
     A  03 25                              6'FILE - FRA DEALS FILE +
     A                                      - LF/DLFRDLLC'
     A  04 25                              6'FILE - FRA DEALS FILE +
     A                                      - LF/DLFRDLLD'
     A  05 25                              6'FILE - FRA DEALS FILE +
     A                                      - LF/DLFRDLLE'
      **End of change CAS006
     A*/COPY WNCPYSRC,DL1950AU01
      *
     A                                     6'----------------------+
     A                                      -------------'
     A                                      SPACEB(1)
      *
     A                                    10'NUMBER OF RECORDS INPUT:'
     A                                      SPACEB(3)
     A            RNORE          5  0     59EDTCDE(3)
     A                                      SPACEA(3)
      *
      *---------------*
      ***  No Details *
      *---------------*
      *
     A          R NODTLS
     A                                    52'*** NO DETAILS TO REPORT ***'
     A                                      SPACEB(3)
      *
      *-------------------*
      ***  Database Error *
      *-------------------*
      *
     A          R DBERROR
     A                                    47'DATABASE ERROR'
     A                                      SPACEB(2)
     A            DBASE          3  0     62
     A                                    66'IN PROGRAM'
     A            DBPGM         10        77
     A                                      SPACEA(2)
     A                                    47'FILE'
     A            DBFILE         8        52
     A                                    61'KEY'
     A            DBKEY         29        65
