      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STMT60                                                    *
/*EXI *  TEXT('Midas DL Deposit statements with cheques.')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Dealing Module                                       *
     A*                                                               *
     A*  DL9020P1 - DEPOSIT STATEMENTS WITH CHEQUES.                  *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 30Nov05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  Prev Amend No. S01390             Date 05Aug92               *   AUS006
     A*                 AUS006             Date 18Dec90               *   AUS006
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*      S01390  -  Release 10 Changes for Australianisation      *
     A*      AUS006  -  AUSTRALIAN PRODUCT - INTEREST HISTORY         *   AUS006
     A*                                                               *
     A*****************************************************************
     A*/COPY WNCPYSRC,DL9020P101
     A          R ALIGN                     SKIPB(05)
     A*/COPY WNCPYSRC,DL9020P102
     A***********                                    Begin /S01390/
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A***********                                    End   /S01390/
     A*/COPY WNCPYSRC,DL9020P115
     A                                     2'********************'
     A                                    22'********************'
     A                                      SPACEA(01)
     A                                     2'********************'
     A                                    22'**********'
     A                                      SPACEA(01)
     A                                    28'************'
     A                                      SPACEA(01)
     A                                     2'********************'
     A                                    33'******'
     A                                      SPACEA(01)
     A                                     2'**********'
     A                                    70'**********'
     A                                      SPACEA(04)
     A*/COPY WNCPYSRC,DL9020P116
     A                                     2'********************'
     A                                    22'************'
     A                                      SPACEA(02)
     A                                     3'****'
     A                                    10'*********'
     A                                    25'******'
     A                                    40'*******'
     A                                    54'****'
     A                                    62'****'
     A*/COPY WNCPYSRC,DL9020P103
     A                                    70'********'
     A                                      SKIPB(52)
     A                                    11'************'
     A                                      SPACEA(02)
     A                                    15'********************'
     A                                    35'****************'
     A*/COPY WNCPYSRC,DL9020P124
     A                                    67'**CANCELLED**'
     A*/COPY WNCPYSRC,DL9020P125
     A                                      SPACEA(01)
     A                                    15'********************'
     A                                    35'****************'
     A                                      SPACEA(01)
     A                                    15'********************'
     A                                    35'****************'
     A*/COPY WNCPYSRC,DL9020P126
     A                                      SPACEA(02)
     A                                    14'********************'
     A                                    34'**********'
     A                                      SPACEA(01)
     A                                    14'********************'
     A                                    34'**********'
     A                                      SPACEA(01)
     A                                    14'********************'
     A                                    34'**********'
     A                                      SPACEA(01)
     A                                    14'********************'
     A                                    34'**********'
     A*/COPY WNCPYSRC,DL9020P104
     A*
     A          R CUHEAD                    SKIPB(05)
     A            TITLT         40         2
     A                                      SPACEA(01)
     A***********                                    Begin /S01390/
     A*********** BRNM          30         2
     A  88        A8BRNM        30         2
     A***********                                    End   /S01390/
     A                                      SPACEA(01)
     A*/COPY WNCPYSRC,DL9020P105
     A                                    28'DATE:'
     A***********                                    Begin /S01390/
     A*********** RUNA           7        33
     A            BJMRDT         7        33
     A*/COPY WNCPYSRC,DL9020P106
     A***********                                    End   /S01390/
     A                                      SPACEA(01)
     A***********                                    Begin /S01390/
     A*********** CRNM          20         2
     A*/COPY WNCPYSRC,DL9020P113
     A            BBCRNM        20         2
     A***********                                    End   /S01390/
     A*/COPY WNCPYSRC,DL9020P107
      * Begin /CSD027/
     A**********  CNUM           6  0     33                                                  CSD027
     A            CNUM           6A       33
      * End /CSD027/
     A*/COPY WNCPYSRC,DL9020P108
     A                                      SPACEA(01)
     A***********                                    Begin /S01390/
     A*********** CTWN          10         2
     A            BBCRTN        10         2
     A***********                                    End   /S01390/
     A*/COPY WNCPYSRC,DL9020P109
     A                                    70'PAGE:'
     A            PAGE           5  0     75EDTCDE(Z)
     A*/COPY WNCPYSRC,DL9020P110
     A                                      SPACEA(04)
     A*/COPY WNCPYSRC,DL9020P114
     A                                     2'STATEMENT OF'
     A            CCY            3        15
     A                                    19'DEPOSIT ACCOUNT'
     A                                      SPACEA(02)
     A                                     3'DATE'
     A                                    10'NARRATIVE'
     A                                    25'AMOUNT'
     A                                    40'BALANCE'
     A*/COPY WNCPYSRC,DL9020P117
     A                                    54'RATE'
     A                                    62'DAYS'
     A                                    70'INTEREST'
     A*/COPY WNCPYSRC,DL9020P118
     A*
     A          R DLHEAD                    SPACEB(01)
     A                                    10'DEAL'
     A            DLNO           6  0     15
     A                                      SPACEA(01)
     A            TERMA         12        10
     A                                      SPACEA(01)
     A*
     A          R DETLIN
     A            EDATE          7         2
     A            NARR          11        10
     A            PAMT          13        22
     A            PBAL          13        37
     A*/COPY WNCPYSRC,DL9020P119
     A            RATE           7  5     52EDTCDE(4)
     A            DAYS           3  0     62EDTCDE(4)
     A            PINT          13        67
     A                                      SPACEA(01)
     A*
     A*/COPY WNCPYSRC,DL9020P111
     A          R CSTTOT                    SKIPB(52)
     A***********                                    Begin /S01390/
     A*********** RUNA           7         6
     A            BJMRDT         7         6
     A***********                                    End   /S01390/
     A                                      SPACEA(02)
     A            AMTA1T        36        15
     A*/COPY WNCPYSRC,DL9020P120
     A            TOTT          13        67
     A*/COPY WNCPYSRC,DL9020P121
     A                                      SPACEA(01)
     A            AMTA2T        36        15
     A                                      SPACEA(01)
     A            AMTA3T        36        15
     A*/COPY WNCPYSRC,DL9020P127
     A                                      SPACEA(02)
     A            CNA1T         30        14
     A                                      SPACEA(01)
     A            CNA2T         30        14
     A                                      SPACEA(01)
     A            CNA3T         30        14
     A                                      SPACEA(01)
     A            CNA4T         30        14
     A*
     A*/COPY WNCPYSRC,DL9020P122
     A          R DCONT                     SKIPB(43)
     A                                    74'CONT;'
     A                                      SKIPB(52)
     A*/COPY WNCPYSRC,DL9020P123
     A                                    11'************'
     A                                      SPACEA(02)
     A                                    15'**STATEMENT CONTINUE'
     A                                    35'D ON NEXT*******'
     A*/COPY WNCPYSRC,DL9020P128
     A                                    67'**CANCELLED**'
     A*/COPY WNCPYSRC,DL9020P129
     A                                      SPACEA(01)
     A                                    15'**PAGE; THIS CHEQUE '
     A                                    35'IS CANCELLED****'
     A                                      SPACEA(01)
     A                                    15'**AND CARRIED TO NEX'
     A                                    35'T PAGE.*********'
     A*/COPY WNCPYSRC,DL9020P130
     A                                      SPACEA(02)
     A                                    14'********************'
     A                                    34'**********'
     A                                      SPACEA(01)
     A                                    14'********************'
     A                                    34'**********'
     A                                      SPACEA(01)
     A                                    14'********************'
     A                                    34'**********'
     A                                      SPACEA(01)
     A                                    14'********************'
     A                                    34'**********'
     A*
     A          R CANSMT                    SKIPB(43)
     A                                    14'STATEMENT CANCELLED DUE TO ERROR;'
     A                                    48'SEE EXCEPTION REPORT.'
     A                                      SKIPB(52)
     A                                    11'************'
     A                                      SPACEA(02)
     A                                    15'********************'
     A                                    35'****************'
     A*/COPY WNCPYSRC,DL9020P131
     A                                    67'**CANCELLED**'
     A*/COPY WNCPYSRC,DL9020P132
     A                                      SPACEA(01)
     A                                    15'********************'
     A                                    35'****************'
     A                                      SPACEA(01)
     A                                    15'********************'
     A                                    35'****************'
     A*/COPY WNCPYSRC,DL9020P133
     A                                      SPACEA(02)
     A                                    14'********************'
     A                                    34'**********'
     A                                      SPACEA(01)
     A                                    14'********************'
     A                                    34'**********'
     A                                      SPACEA(01)
     A                                    14'********************'
     A                                    34'**********'
     A                                      SPACEA(01)
     A                                    14'********************'
     A                                    34'**********'
     A*/COPY WNCPYSRC,DL9020P112
