      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_AU60                                                      *
/*EXI *  TEXT('Midas DL Loan statements audit report.')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Dealing Module                           *
     A*                                                               *
     A*      DL9015AU - LOAN STATEMENTS AUDIT REPORT                  *
     A*                                                               *
     A*  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Ament No. MD046248           DATE 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*      Prev Amend No. S01390             DATE 05AUG92           *   AUS006
     A*                     AUS006             DATE 18DEC90           *   AUS006
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
     A*      S01390  -  Release 10 Changes for Australianisation      *
     A*      AUS006  -  AUSTRALIAN PRODUCT - INTEREST HISTORY         *   AUS006
     A*                                                               *
     A*****************************************************************
     A          R AUDIT                     SKIPB(02)
     A***********                                    Begin /S01390/
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A***********                          2'DL9015P3'
     A*********** TITL          53        27
     A                                     2'DL9015AU'
     A            BJURPT        53        27
     A***********                                    End   /S01390/
     A                                   100'PAGE:'
     A            PAGE3          5  0    106EDTCDE(Z)
     A***********                                    Begin /S01390/
     A*********** RUNA           7       115
     A            BJMRDT         7       115
     A***********                                    End   /S01390/
     A                                      SPACEA(02)
     A            TIME           6  0    115EDTWRD('  :  :  ')
     A                                      SPACEA(01)
     A                                    53'LOAN STATEMENT AUDIT REPORT'
     A***********                                    Begin /S01390/
     A***********                           UNDERLINE
     A                                      SPACEA(01)
     A                                    53'---------------------------'
     A***********                                    End   /S01390/
     A                                      SPACEA(03)
     A                                    10'TOTAL STATEMENTS PROCESSED       :'
     A            STLT           5  0     45EDTCDE(3)
     A                                      SPACEA(02)
     A                                    10'TOTAL STATEMENTS WITHOUT ERROR   :'
     A            STLA           5  0     45EDTCDE(3)
     A                                      SPACEA(02)
     A                                    10'TOTAL STATEMENTS IN ERROR        :'
     A            STLE           5  0     45EDTCDE(3)
     A                                      SPACEA(02)
     A***********                                    Begin /S01390/
     A***********                         50'*** E N D   O F   R E P O R T ***'
     A***********                           SPACEB(04)
     A*
     A          R DBERR                     TEXT('EXTRACT DATA BASE ERROR')
     A*
     A                                       SPACEB(3)
     A                                    44'DATABASE ERROR'
     A            DBASE          3  0     59
     A                                    65'FILE'
     A            DBFILE         8        70SPACEA(1)
     A                                    44'KEY'
     A            DBKEY         29        48
     A*
     A          R NODETL                    SPACEB(3)
     A                                    56'*** NO DETAILS TO REPORT ***'
     A***********                                    End   /S01390/
