      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas EM INITIAL FILE SET UP DISPLAY FILE')
     A*****************************************************************
     A*  Midas  EXPOSURE MANAGEMENT ENQUIRY MODULE         *
     A*                                                               *
     A*    EM0002FM - INITIAL FILE SET UP                             *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*    PREV AMEND NO. S01253           DATE 17APR90               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  MD046248 - Finastra Rebranding                               *
     A*    S01253  -  RECOMPILED FOR MULTILANGUAGE SCREENS.           *
     A*                                                               *
     A*****************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      CHGINPDFT             PRINT(MPRINT)
     A                                      INDARA
     A          R EMC00FM                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A                                      CF03
     A            ID             1A  I 01 02DFT('A')
     A                                      DSPATR(PR ND)
     A                                 01 22'EXPOSURE MANAGEMENT FILE SETUP'
     A                                      DSPATR(UL)
     A            TIME           8A  O 01 65
     A                                 01 75'WID'
     A            WID            3A  O 01 78
     A                                 04 11'ENTER THE REQUIRED SIZE FOR THE F-
     A                                      OLLOWING FILES:'
     A                                 07 16'E.M. LIMITS  (EMLIM)'
     A  45                                  DSPATR(RI)
     A            EMLIM          5A  B 07 56DSPATR(HI)
     A                                 09 16'E.M. EXPOSURE AT C.O.B. (EMDEX)'
     A  46                                  DSPATR(RI)
     A            EMDEX          5A  B 09 56DSPATR(HI)
     A                                 11 16'E.M. ON-LINE EXPOSURE  (EMCEX)'
     A  47                                  DSPATR(RI)
     A            EMCEX          5A  B 11 56DSPATR(HI)
     A                                 22 01'INVALID FILE SIZE ENTERED, PLEASE-
     A                                       REKEY                            -
     A                                                  '
     A  48                                  DSPATR(HI)
     A  01                                  DSPATR(ND)
     A  48                                  DSPATR(RI)
     A                                 24 06'PRESS ENTER TO CONTINUE OR CMD/3 -
     A                                      TO CANCEL'
