      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas PM Valuation Group Maintenance')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Management Module                      *
     A*                                                               *
     A*  DSPF/PM0020DF - VALUATION GROUP MAINTENANCE                  *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. S01486             DATE 11AUG94               *
     A*  PREV AMEND NO. 056584             DATE 07JUL93               *
     A*                 S01355             DATE 08JUN92               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
     A*  S01486 - Portfolio Management Upgrade to R10.                *
     A*  056584 - R3 HELP SYSTEM                                      *
     A*---------------------------------------------------------------*
     A*      RSTDSP(*YES)                                             *
     A*      SHARE(*YES)                                              *
     A*           C R E A T I O N     P A R A M E T E R S             *
     A*
     A*****************************************************************
     A                                      VLDCMDKEY(45 'ANY VALID KEY')
     A                                      PRINT(MPRINT)
     A                                      INDARA
      *>>S01355*<< Release 3 incorporation
     A*                                              BEGIN /S01486/
     A*                                              END   /S01486/
     A                                      CA03
     A**=====================================================================
     A**
     A** FORMAT PM0020F1 **
     A*                                              Begin /S01486/
     A**********R PM0020F1                  TEXT('HEADER FORMAT')
     A          R PM0020F1                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*                                              END   /S01486/
     A                                      OVERLAY
     A                                      BLINK
      *>>S01355*<< Release 3 incorporation
     A*                                              BEGIN /S01486/
     A*                                              END   /S01486/
      *>>S01355*<< Release 3 incorporation
     A*                                              BEGIN /S01486/
     A*                                              END   /S01486/
      *>>S01355*<< Release 3 incorporation
     A* >>> 056584 >>>
     A*                                              BEGIN /S01486/
     A*                                              END   /S01486/
     A* <<< 056584 <<<
      *>>S01355*<< Release 3 incorporation
     A*                                              BEGIN /S01486/
     A*                                              END   /S01486/
     A*                                              Begin /S01486/
     A**********                        1 10'VALUATION GROUP MAINTENANCE'
     A**********                            DSPATR(HI)
     A**********  WSID          10A  O  1 52TEXT('WORK STATION ID')
     A**********  DDRUNA         7A  O  1 63
     A**********                        1 72TIME
     A            USID          10A  O  1  2
     A                                  1 13'PM0020'
     A                                  1 26'VALUATION GROUPS MAINTENANCE'
     A                                      DSPATR(HI UL)
     A            BJMRDT         7A  O  1 72
     A            WSID          10A  O  2  2
     A                                  2 71TIME
     A*                                              End   /S01486/
     A                                  3  3'Action Code'
     A            DDACTN         1A  B  3 15
     A N31                                  DSPATR(HI)
     A N30N31                               DSPATR(UL)
     A  30                                  DSPATR(PR)
     A  31                                  DSPATR(PC RI)
     A            DDDELT         7      3 72TEXT('RECORD DELETED?')
     A                                      DSPATR(HI BL)
     A                                  4  3'Valuation Group'
     A            DDVALG         3A  B  4 19
     A N32                                  DSPATR(HI)
     A N30N32                               DSPATR(UL)
     A  30                                  DSPATR(PR)
     A  32                                  DSPATR(PC RI)
     A                                  4 40'Review From'
     A  30                                  DSPATR(ND)
     A            DDPKEY         3A  B  4 52TEXT('REVIEW FROM KEY')
     A                                      DSPATR(HI UL)
     A  30                                  DSPATR(PR ND)
     A                                  5  2'                                  -
     A                                                                         -
     A                                              '
     A                                      DSPATR(UL)
     A*======================================================================
     A**
     A** FORMAT PM0020E2
     A**
     A          R PM0020E2                  SFL
     A                                      SFLMSGRCD(24)
     A            DDSFKY                    SFLMSGKEY
     A            DDPGMQ                    SFLPGMQ
     A**
     A**
     A** FORMAT PM0020F2
     A**
     A          R PM0020F2                  SFLCTL(PM0020E2)
     A                                      SFLSIZ(0024)
     A                                      SFLPAG(0001)
     A                                      SFLDSPCTL
     A                                      SFLDSP
     A N55                                  SFLEND
     A                                      SFLINZ
     A            DDPGMQ                    SFLPGMQ
     A*
     A            DDINFO        76A  O 23  1
     A**=====================================================================
     A** FORMAT PM0020S0 **
     A          R PM0020S0                  SFL
     A            DDACTN         1A  B  9  2
     A N34                                  DSPATR(HI)
     A N34                                  DSPATR(UL)
     A  34                                  DSPATR(PC RI)
     A                                      AUTO(RA)
     A            DDSTAT         1A  O  9  7TEXT('STATUS')
     A                                      DSPATR(BL HI)
     A            DDVALG         3A  O  9 11TEXT('VALUATION GROUP')
     A                                      DSPATR(HI)
     A            DDVLGT        20A  O  9 19TEXT('VALUATION GROUP TITLE')
     A                                      DSPATR(HI)
     A            DDVLGS         2A  O  9 43TEXT('VALUATION GROUP SEQUENCE')
     A                                      DSPATR(HI)
     A** FORMAT PM0020C0 **
     A          R PM0020C0                  SFLCTL(PM0020S0)
     A                                      SFLSIZ(0013)
     A                                      SFLPAG(0012)
     A                                      OVERLAY
     A                                      BLINK
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A N50N51                               SFLCLR
     A  52                                  SFLEND
     A                                      CA12
     A N52                                  ROLLUP(25)
     A N53                                  ROLLDOWN(26)
      *>>S01355*<< Release 3 incorporation
     A* >>> 056584 >>>
     A*                                              Begin /S01486/
     A*                                              End   /S01486/
     A* <<< 056584 <<<
      *>>S01355*<< Release 3 incorporation
     A*                                              Begin /S01486/
     A*                                              End   /S01486/
      *>>S01355*<< Release 3 incorporation
     A*                                              Begin /S01486/
     A*                                              End   /S01486/
     A*                                              Begin /S01486/
     A************                      1 10'VALUATION GROUP MAINTENANCE'
     A************                          DSPATR(HI)
     A************WSID          10A  O  1 52TEXT('WORKSTATION ID')
     A************DDRUNA         7A  O  1 63
     A************                      1 72TIME
     A            USID          10A  O  1  2
     A                                  1 13'PM0020'
     A                                  1 26'VALUATION GROUPS MAINTENANCE'
     A                                      DSPATR(HI UL)
     A            BJMRDT         7A  O  1 72
     A            WSID          10A  O  2  2
     A                                  2 71TIME
     A*                                              End   /S01486/
     A                                  4 40'Review From'
     A            DDPKEY         3A  B  4 52TEXT('REVIEW FROM KEY')
     A                                      DSPATR(HI UL)
     A                                  5  2'                                  -
     A                                                                         -
     A                                              '
     A                                      DSPATR(UL)
     A                                  7 10'Group'
     A                                  7 19'Group Title'
     A                                  7 43'Seq'
     A**=====================================================================
     A** FORMAT PM0020F3 **
     A          R PM0020F3                  TEXT('CLEAR SCREEN')
     A                                  1  2' '
     A**=====================================================================
     A**
     A** FORMAT PM0020F4 **
     A          R PM0020F4                  TEXT('HEADER FORMAT')
     A                                      OVERLAY
     A                                      CA10
     A                                      CA12
      *>>S01355*<< Release 3 incorporation
     A*                                              Begin /S01486/
     A*                                              End   /S01486/
      *>>S01355*<< Release 3 incorporation
     A*                                              Begin /S01486/
     A*                                              End   /S01486/
      *>>S01355*<< Release 3 incorporation
     A*                                              Begin /S01486/
     A*                                              End   /S01486/
     A                                  7  3'Valuation Group Title'
     A            DDVLGT        20A  B  7 29
     A N36                                  DSPATR(HI)
     A  35                                  DSPATR(PR)
     A  36                                  DSPATR(PC RI)
     A N35N36                               DSPATR(UL)
     A                                  8  3'Valuation Group Sequence'
     A            DDVLGS         2A  B  8 29
     A N37                                  DSPATR(HI)
     A  35                                  DSPATR(PR)
     A  37                                  DSPATR(PC RI)
     A N35N37                               DSPATR(UL)
     A**
     A*======================================================================
     A** FORMAT PM0020S1 **
     A          R PM0020S1                  SFL
     A  54                                  SFLNXTCHG
     A*
     A            DDVLGI         2A  B 11 09TEXT('LANGUAGE INDICATOR')
     A N38                                  DSPATR(HI)
     A N35N38                               DSPATR(UL)
     A  35                                  DSPATR(PR)
     A  38                                  DSPATR(PC RI)
     A*
     A            DDVLGN        20A  B 11 22TEXT('VALUATION GROUP NARRATIVE')
     A N39                                  DSPATR(HI)
     A N35N39                               DSPATR(UL)
     A  35                                  DSPATR(PR)
     A  39                                  DSPATR(PC RI)
     A            DDVLKK         2A  H
     A            DDVLNK        20A  H
     A*
     A** FORMAT PM0020C1 **
     A          R PM0020C1                  SFLCTL(PM0020S1)
     A                                      SFLSIZ(0011)
     A                                      SFLPAG(0010)
     A                                      OVERLAY
     A                                      BLINK
     A N55                                  SFLDSP
     A N55                                  SFLDSPCTL
     A  55                                  SFLCLR
     A  56                                  SFLEND
     A                                      CA10
     A                                      CA12
     A N56                                  ROLLUP(25)
      *>>S01355*<< Release 3 incorporation
     A* >>> 056584 >>>
     A*                                              Begin /S01486/
     A*                                              End   /S01486/
     A* <<< 056584 <<<
      *>>S01355*<< Release 3 incorporation
     A* >>> 056584 >>>
     A*                                              Begin /S01486/
     A*                                              End   /S01486/
     A* <<< 056584 <<<
      *>>S01355*<< Release 3 incorporation
     A* >>> 056584 >>>
     A*                                              Begin /S01486/
     A*                                              End   /S01486/
     A* <<< 056584 <<<
      *>>S01355*<< Release 3 incorporation
     A* >>> 056584 >>>
     A*                                              Begin /S01486/
     A*                                              End   /S01486/
     A* <<< 056584 <<<
      *>>S01355*<< Release 3 incorporation
     A*                                              Begin /S01486/
     A*                                              End   /S01486/
     A            SFLRRN         4S 0H      SFLRCDNBR
     A*
     A                                  7  3'Valuation Group Title'
     A            DDVLGT        20A  B  7 29
     A N36                                  DSPATR(HI)
     A  35                                  DSPATR(PR)
     A  36                                  DSPATR(PC RI)
     A N35N36                               DSPATR(UL)
     A                                  8  3'Valuation Group Sequence'
     A            DDVLGS         2A  B  8 29
     A N37                                  DSPATR(HI)
     A  35                                  DSPATR(PR)
     A  37                                  DSPATR(PC RI)
     A N35N37                               DSPATR(UL)
     A                                 10 06'Language'
     A                                 10 20'Valuation Group Narrative'
