      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas PM Notepad maintenance')
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Management Module                      *
     A*                                                               *
     A*  DSPF/PM0600DF - NOTEPAD MAINTENANCE                          *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. CPM005             DATE 20JUN96               *
     A*  PREV AMEND NO. S01486             DATE 11AUG94               *
     A*                 073957             DATE 29NOV94               *
     A*                 056584             DATE 20OCT93               *
     A*                 059472             DATE 03AUG93               *
     A*                 S01313             DATE 03JUN91               *
     A*                 32447              DATE 26NOV91               *
     A*                 B7934              DATE 25SEP91               *
     A*                 R10043             DATE 20SEP90               *
     A*                 R10042             DATE 19SEP90               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
     A*  CPM005 - Private Banking Phase II                            *
     A*           Focus Group Changes Upgraded to DBA                 *
     A*           PBFG/6 - ADDITIONAL CUSTOMER DETAILS                *
     A*  S01486 - Portfolio Management Upgrade to R10.                *
     A*  073957 - PM Instruction manual changes                       *
     A*  056584 - RELEASE 3 HELP                                      *
     A*  059472 - RECOMPILE DUE TO HELP AREA CHANGES                  *
     A*  S01313 - CHANGED FOR PORTFOLIO PERFORMANCE                   *
     A*  32447  - ALLOW PORTFOLIO EXTRA VALUATION REQUEST ONLY IF     *
     A*           CUSTOMER HAS PORTFOLIO DIFFERENT THAN 9997 9998     *
     A*           9999                                                *
     A*  B7934  - Allow user to indicate whether customer or          *
     A*           portfolio extra valuation statement to be           *
     A*           requested.                                          *
     A*  R10043 - Add 'Extra Valuation Statement' command key.        *
     A*  R10042 - Display Customer subfile on whole screen if         *
     A*           Portfolio subfile is not to be displayed.           *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A                                      VLDCMDKEY(49 'ANY VALID KEY')
     A                                      PRINT(MPRINT)
     A                                      INDARA
     A**** START 059472
     A**** START 056584
     A**** END 059472
      *                                              Begin /S01486/
      *                                              End   /S01486/
     A**** END 056584
     A                                      CA03
     A                                      CA12
     A*>>B7934>>
     A***S01313***                          CA21
     A*<<B7934<<
     A* /* R10043 BEGIN */
     A* /* 32447  BEGIN */
     A**************************************CA22
     A*N60*******                           CA22                          CPM005
     A* /* 32447  END */
     A* /* R10043 END */
     A**46*******                           CA01                          CPM005
     A**46*******                           CA02                          CPM005
     A*
     A**47*******                           CA05                          CPM005
     A*
     A*****************************************************************
     A**   CLEAR BUFFER SCREEN
     A**---------------------------------------------------------------
     A*
     A**************                                 Begin /S01486/
     A**********R*PM0600F0
     A          R PM0600F0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A***********                                    End   /S01486/
     A                                  1  2' '
     A*
     A*****************************************************************
     A**   HEADER
     A**---------------------------------------------------------------
     A*
     A          R PM0600F1
     A                                      OVERLAY
      *                                              Begin /S01486/
     A*********                         1 15'CUSTOMER / PORTFOLIO NOTEPAD'
     A*********                             DSPATR(HI)
     A*********   WSID          10A  O  1 52TEXT('WORK STATION ID')
     A*********   DDRUNA         7A  O  1 63
     A*********                         1 72TIME
     A            USER          10A  O  1  2
     A                                  1 13'PM0600'
     A                                  1 20'CUSTOMER / PORTFOLIO NOTEPAD'
     A                                      DSPATR(HI)
     A            DDRUNA         7A  O  1 72
      *
     A            WKSTN         10A  O  2  2
     A                                  2 71TIME
     A*********                         2  4'Customer Number'
     A*********   DDCNUM         6A  O  2 21
     A*********                             DSPATR(HI)
     A*********                         2 30'Name'
     A*********   DDCRNM        20A  O  2 36
     A*********                             DSPATR(HI)
     A                                  3  4'Customer Number'
     A            DDCNUM         6A  O  3 21
     A                                      DSPATR(HI)
     A                                  3 30'Name'
     A            DDCRNM        20A  O  3 36
     A                                      DSPATR(HI)
      *                                              End   /S01486/
     A*
     A*****************************************************************
     A**   PORTFOLIO
     A**---------------------------------------------------------------
     A*
     A          R PM0600F2
     A                                      OVERLAY
     A                                 12  1'-----------------------------------
     A                                      -----------------------------------
     A                                      ------------'
     A                                      DSPATR(HI)
     A                                 13  4'Portfolio Reference'
     A            DDPTFR         4A  O 13 25
     A                                      DSPATR(HI)
     A                                 13 32'Narrative'
     A            DDPTFN        20A  O 13 43
     A                                      DSPATR(HI)
     A*
     A*****************************************************************
     A**   FOOTER
     A**---------------------------------------------------------------
     A*
     A          R PM0600F3
     A                                      OVERLAY
     A            DDINF1        78A  O 23  1
     A            DDINF2        78A  O 24  1
     A*
     A*****************************************************************
     A**   CUSTOMER SUBFILE
     A**---------------------------------------------------------------
     A*
     A          R PM0600S0                  SFL
     A            DDRRN          2  0O  4  3TEXT('LINE NUMBER')
     A            DDNTPD        70A  B  4  7TEXT('NOTEPAD DETAILS')
     A                                      CHECK(LC)
     A*
     A*
     A          R PM0600C0                  SFLCTL(PM0600S0)
     A                                      SFLSIZ(0008)
     A                                      SFLPAG(0007)
     A                                      OVERLAY
     A  41                                  SFLDSP
     A  41                                  SFLDSPCTL
     A N41                                  SFLDLT
     A  43                                  SFLCLR
     A  44                                  SFLEND
     A N44                                  ROLLUP(25)
     A**** START 059472
     A**** START 056584
      *                                              Begin /S01486/
     A*                                     BEGIN /073957/
     A*                                     END /073957/
      *                                              End   /S01486/
     A**** END   056584
     A**** START 056584
     A*                                     BEGIN /073957/
     A*                                     END /073957/
     A**** END   056584
     A**** END 059472
     A            SFLNR0         2S 0H      SFLRCDNBR(CURSOR)
     A*
     A* /* R10042 BEGIN */
     A*****************************************************************
     A**   CUSTOMER SUBFILE - full screen
     A**---------------------------------------------------------------
     A*
     A          R PM0600S2                  SFL
     A            DDRRN          2  0O  4  3TEXT('LINE NUMBER')
     A            DDNTPD        70A  B  4  7TEXT('NOTEPAD DETAILS')
     A                                      CHECK(LC)
     A*
     A*
     A          R PM0600C2                  SFLCTL(PM0600S2)
     A                                      SFLSIZ(0019)
     A                                      SFLPAG(0018)
     A                                      OVERLAY
     A  41                                  SFLDSP
     A  41                                  SFLDSPCTL
     A N41                                  SFLDLT
     A  43                                  SFLCLR
     A  44                                  SFLEND
     A N44                                  ROLLUP(25)
     A**** START 059472
     A**** START 056584
     A*                                              Begin /S01486/
     A*                                     BEGIN /073957/
     A*                                     END /073957/
     A*                                              End   /S01486/
     A**** END   056584
     A**** START 056584
     A*                                              Begin /S01486/
     A*                                     BEGIN /073957/
     A*                                     END /073957/
     A*                                              End   /S01486/
     A**** END   056584
     A**** END 059472
     A            SFLNR0         2S 0H      SFLRCDNBR(CURSOR)
     A*
     A* /* R10042 END */
     A*****************************************************************
     A**   PORTFOLIO SUBFILE
     A**---------------------------------------------------------------
     A*
     A          R PM0600S1                  SFL
     A            DDRRN          2  0O 15  3TEXT('LINE NUMBER')
     A            DDNTPD        70A  B 15  7TEXT('NOTEPAD DETAILS')
     A                                      CHECK(LC)
     A*
     A*
     A          R PM0600C1                  SFLCTL(PM0600S1)
     A                                      SFLSIZ(0008)
     A                                      SFLPAG(0007)
     A                                      OVERLAY
     A  42                                  SFLDSP
     A  42                                  SFLDSPCTL
     A N42                                  SFLDLT
     A  43                                  SFLCLR
     A  45                                  SFLEND
     A N45                                  ROLLUP(25)
     A**** START 059472
     A**** START 056584
     A*                                              Begin /S01486/
     A*                                     BEGIN /073957/
     A*                                     END /073957/
     A*                                              End   /S01486/
     A**** END   056584
     A**** START 056584
     A*                                              Begin /S01486/
     A*                                     BEGIN
     A*                                     END /073957/
     A*                                              End   /S01486/
     A**** END   056584
     A**** AND 059472
     A            SFLNR1         2S 0H      SFLRCDNBR(CURSOR)
     A*
