      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas PM Holdings Scroll Screen')
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Management Module                      *
     A*                                                               *
     A*  DSPF/PM0675DF - DELETED CUSTOMER POSITION/TRANSACTION SUMMARY*
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. 101496             DATE 28MAR96               *
      *                 S01486             DATE 11AUG94               *
     A*                 073957             DATE 30NOV94               *
     A*                 056584             DATE 20OCT93               *
     A*                 038430             DATE 22AUG93               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  CGL029 - Increase Account Code to 10 digits                  *
     A*  101496 - Title being overwritten                             *
     A*  S01486 - Portfolio Management Upgrade to R10.                *
     A*  073957 - Changes for PM instruction manual.                  *
     A*  056584 - RELEASE 3 HELP                                      *
     A*  038430 - CREATED FOR ENHANCEMENTS TO CUSTOMER INSERTION      *
     A*           / DELETION PROCESSING                               *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A                                      VLDCMDKEY(60 'ANY VALID KEY')
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/MPRINT)
      *>>056584*<< Release 3 incorporation
     A*                                              Begin /S01486/
     A*                                              End   /S01486/
     A                                      CA03
     A                                      CA11
     A                                      CA12
     A  52                                  ROLLUP(50)
     A  53                                  ROLLDOWN(51)
     A*
     A** HEADER FORMAT
     A***********                                    Begin /S01486/
     A**********R*PM0675F1
     A          R PM0675F1                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A***********                                    End   /S01486/
     A                                      OVERLAY
     A                                      PUTOVR
     A*                                              Begin /S01486/
     A***********                       1 10'POSITIONS EXISTING WHEN CUSTOMER +
     A***********                           DELETED'
     A*********** WSID          10A  O  1 52TEXT('WORKSTATION ID')
     A*********** DDRUNA         7A  O  1 63TEXT('RUN DATE')
     A***********                       1 72TIME
     A**
     A***********                       2  2'Customer'
     A*********** DDCNUM         6A  O  2 11TEXT('CUSTOMER NUMBER')
     A***********                           DSPATR(HI)
     A*********** DDCRNM        20A  O  2 19TEXT('CUSTOMER REPORT NAME')
     A***********                           DSPATR(HI)
     A***********                       3  2'Reference'
     A*********** DDPTFR         4A  O  3 13TEXT('PORTFOLIO REFERENCE')
     A***********                           DSPATR(HI)
     A*********** DDPTFN        20A  O  3 19TEXT('PORTFOLIO NARRATIVE')
     A***********                           DSPATR(HI)
     A***********                       4  2'Currency'
     A*********** DDCCY          3A  O  4 14TEXT('PORTFOLIO CURRENCY')
     A***********                           DSPATR(HI)
     A***********                       4 19'Portfolio Type'
     A*********** DDPTYP         2A  O  4 35TEXT('PORTFOLIO TYPE')
     A***********                           DSPATR(HI)
     A***********                       5  2'-----------------------------------
     A***********                           ------------------------------------
     A***********                           ---------'
     A            USER          10A  O  1  2
     A                                  1 13'PM0675'
     A            DDTITR         5A  O  1 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A***********                                    Begin /101496/
     A***********                       1 20'POSITIONS EXISTING WHEN CUSTOMER +
     A                                  1 26'POSITIONS EXISTING WHEN CUSTOMER +
     A***********                                    End   /101496/
     A                                      DELETED'
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDRUNA         7A  O  1 72
      *
     A            WKSTN         10A  O  2  2
     A                                  2 71TIME
     A                                  3  2'Customer'
     A            DDCNUM         6A  O  3 11TEXT('CUSTOMER NUMBER')
     A                                      DSPATR(HI)
     A            DDCRNM        20A  O  3 19TEXT('CUSTOMER REPORT NAME')
     A                                      DSPATR(HI)
     A                                  4  2'Reference'
     A            DDPTFR         4A  O  4 13TEXT('PORTFOLIO REFERENCE')
     A                                      DSPATR(HI)
     A            DDPTFN        20A  O  4 19TEXT('PORTFOLIO NARRATIVE')
     A                                      DSPATR(HI)
     A                                  5  2'Currency'
     A            DDCCY          3A  O  5 14TEXT('PORTFOLIO CURRENCY')
     A                                      DSPATR(HI)
     A                                  5 19'Portfolio Type'
     A            DDPTYP         2A  O  5 35TEXT('PORTFOLIO TYPE')
     A                                      DSPATR(HI)
     A                                  6  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A*                                              End   /S01486/
     A**
     A** SUBFILE 1 - NARRATIVE DETAILS
     A**
     A          R PM0675S1
     A                                      SFL
     A*                                              Begin /S01486/
     A*********** DDSTAT         1A  O  8  2TEXT('CURRENCY 1')
     A***********                           DSPATR(HI)
     A*********** DDCCY1         3A  O  8  4TEXT('CURRENCY 1')
     A***********                           DSPATR(HI)
     A*********** DDTOG1        36A  O  8  8TEXT('NARRATIVE')
     A***********                           DSPATR(HI)
     A*********** DDMKTP        10A  O  8 45TEXT('MARKET PRICE')
     A***********                           DSPATR(HI)
     A*********** DDMKFX         9A  O  8 56TEXT('MARKET FX RATE')
     A***********                           DSPATR(HI)
     A*********** DDMVPC        15A  O  8 66TEXT('MARKET VALUE')
     A***********                           DSPATR(HI)
     A*********** DDCCY2         3A  O  9  4TEXT('CURRENCY 2')
     A***********                           DSPATR(HI)
     A*********** DDTOG2        36A  O  9  8TEXT('DETAILS')
     A***********                           DSPATR(HI)
     A*********** DDFOPR        10A  O  9 45TEXT('FOLIO PRICE')
     A***********                           DSPATR(HI)
     A*********** DDFXRA         9A  O  9 56TEXT('FOLIO FX RATE')
     A***********                           DSPATR(HI)
     A*********** DDAIPC        15A  O  9 66TEXT('ACCRUED INTEREST')
     A***********                           DSPATR(HI)
     A            DDSTAT         1A  O  9  2TEXT('CURRENCY 1')
     A                                      DSPATR(HI)
     A            DDCCY1         3A  O  9  4TEXT('CURRENCY 1')
     A                                      DSPATR(HI)
     A**Start of change CGL029
     A**********  DDTOG1        36A  O  9  8TEXT('NARRATIVE')                                 CGL029
     A            DDTOG1        42A  O  9  8TEXT('NARRATIVE')
     A**End of change CGL029
     A                                      DSPATR(HI)
     A            DDMKTP        10A  O  9 45TEXT('MARKET PRICE')
     A                                      DSPATR(HI)
     A            DDMKFX         9A  O  9 56TEXT('MARKET FX RATE')
     A                                      DSPATR(HI)
     A            DDMVPC        15A  O  9 66TEXT('MARKET VALUE')
     A                                      DSPATR(HI)
     A            DDCCY2         3A  O 10  4TEXT('CURRENCY 2')
     A                                      DSPATR(HI)
     A**Start of change CGL029
     A**********  DDTOG2        36A  O 10  8TEXT('DETAILS')                                   CGL029
     A            DDTOG2        42A  O 10  8TEXT('DETAILS')
     A**End of change CGL029
     A                                      DSPATR(HI)
     A            DDFOPR        10A  O 10 45TEXT('FOLIO PRICE')
     A                                      DSPATR(HI)
     A            DDFXRA         9A  O 10 56TEXT('FOLIO FX RATE')
     A                                      DSPATR(HI)
     A            DDAIPC        15A  O 10 66TEXT('ACCRUED INTEREST')
     A                                      DSPATR(HI)
     A*                                              End   /S01486/
     A**
     A          R PM0675C1                  SFLCTL(PM0675S1)
     A*                                              Begin /S01486/
     A***********                           SFLSIZ(0007)
     A***********                           SFLPAG(0007)
     A                                      SFLSIZ(0006)
     A                                      SFLPAG(0006)
     A*                                              End   /S01486/
     A                                      OVERLAY
     A N55                                  SFLDSP
     A N55                                  SFLDSPCTL
     A  55                                  SFLCLR
      *>>056584*<< Release 3 incorporation
     A*                                              Begin /S01486/
     A*                                     BEGIN /073957/
     A*                                     END /073957/
     A*                                              End   /S01486/
      *>>056584*<< Release 3 incorporation
     A*                                              Begin /S01486/
     A*                                     BEGIN /073957/
     A*                                     END /073957/
     A*                                              End   /S01486/
      *>>056584*<< Release 3 incorporation
     A*                                              Begin /S01486/
     A*                                     BEGIN /073957/
     A*                                     END /073957/
     A*                                              End   /S01486/
      *>>056584*<< Release 3 incorporation
     A*                                              Begin /S01486/
     A*                                     BEGIN /073957/
     A*                                     END /073957/
     A*                                              End   /S01486/
      *>>056584*<< Release 3 incorporation
     A*                                              Begin /S01486/
     A*                                     BEGIN /073957/
     A*                                     END /073957/
     A*                                              End   /S01486/
      *>>056584*<< Release 3 incorporation
     A*                                              Begin /S01486/
     A*                                     BEGIN /073957/
     A*                                     END /073957/
     A*                                              End   /S01486/
      *>>056584*<< Release 3 incorporation
     A*                                              Begin /S01486/
     A*                                     BEGIN /073957/
     A*                                     END /073957/
     A*                                              End   /S01486/
      *>>056584*<< Release 3 incorporation
     A*                                              Begin /S01486/
     A*                                     BEGIN /073957/
     A*                                     END /073957/
     A*                                              End   /S01486/
      *>>056584*<< Release 3 incorporation
     A*                                              Begin /S01486/
     A*                                     BEGIN /073957/
     A*                                     END /073957/
     A*                                              End   /S01486/
     A*                                              Begin /S01486/
     A***********                       6  2'Sts'
     A***********                       6  8'Nominal Amount'
     A***********                       6 26'   Narrative        Mkt Price +
     A***********                            Mkt FX Rate Market Value'
     A***********                       7  8'  Other Amount'
     A***********                       7 27'   Details       Folio Price   +
     A***********                            FX Rate    Accrued Int'
     A                                  7  2'Sts'
     A                                  7  8'Nominal Amount'
     A                                  7 26'   Narrative        Mkt Price +
     A                                       Mkt FX Rate Market Value'
     A                                  8  8'  Other Amount'
     A                                  8 27'   Details       Folio Price   +
     A                                       FX Rate    Accrued Int'
     A*                                              End   /S01486/
     A**
     A** SUBFILE 2 - NARRATIVE DETAILS - WINDOW RIGHT
     A**
     A          R PM0675S2
     A                                      SFL
     A*                                              Begin /S01486/
     A*********** DDSTAT         1A  O  8  2TEXT('CURRENCY 1')
     A***********                           DSPATR(HI)
     A*********** DDTOG3        31A  O  8  4TEXT('NARRATIVE')
     A***********                           DSPATR(HI)
     A*********** DDMVIC        15A  O  8 36TEXT('MARKET VALUE')
     A***********                           DSPATR(HI)
     A*********** DDMKTY        11A  O  8 52TEXT('MARKET YIELD')
     A***********                           DSPATR(HI)
     A*********** DDMTPL        15A  O  8 64TEXT('MARKET P & L')
     A***********                           DSPATR(HI)
     A**
     A*********** DDTOG4        31A  O  9  4TEXT('DETAILS')
     A***********                           DSPATR(HI)
     A*********** DDAIIC        15A  O  9 36TEXT('ACCRUED INTEREST')
     A***********                           DSPATR(HI)
     A*********** DDFOLY        11A  O  9 52TEXT('FOLIO YIELD')
     A***********                           DSPATR(HI)
     A*********** DDEXPL        15A  O  9 64TEXT('EXCHANGE RATE P & L')
     A***********                           DSPATR(HI)
     A            DDSTAT         1A  O  9  2TEXT('CURRENCY 1')
     A                                      DSPATR(HI)
     A**Start of change CGL029
     A**********  DDTOG3        31A  O  9  4TEXT('NARRATIVE')                                 CGL029
     A            DDTOG3        37A  O  9  4TEXT('NARRATIVE')
     A**End of change CGL029
     A                                      DSPATR(HI)
     A            DDMVIC        15A  O  9 36TEXT('MARKET VALUE')
     A                                      DSPATR(HI)
     A            DDMKTY        11A  O  9 52TEXT('MARKET YIELD')
     A                                      DSPATR(HI)
     A            DDMTPL        15A  O  9 64TEXT('MARKET P & L')
     A                                      DSPATR(HI)
     A**
     A**Start of change CGL029
     A**********  DDTOG4        31A  O 10  4TEXT('DETAILS')                                   CGL029
     A            DDTOG4        37A  O 10  4TEXT('DETAILS')
     A**End of change CGL029
     A                                      DSPATR(HI)
     A            DDAIIC        15A  O 10 36TEXT('ACCRUED INTEREST')
     A                                      DSPATR(HI)
     A            DDFOLY        11A  O 10 52TEXT('FOLIO YIELD')
     A                                      DSPATR(HI)
     A            DDEXPL        15A  O 10 64TEXT('EXCHANGE RATE P & L')
     A                                      DSPATR(HI)
     A*                                              End   /S01486/
     A*
     A          R PM0675C2                  SFLCTL(PM0675S2)
     A*                                              Begin /S01486/
     A***********                           SFLSIZ(0007)
     A***********                           SFLPAG(0007)
     A                                      SFLSIZ(0006)
     A                                      SFLPAG(0006)
     A*                                              End   /S01486/
     A                                      OVERLAY
     A N55                                  SFLDSP
     A N55                                  SFLDSPCTL
     A  55                                  SFLCLR
      *>>056584*<< Release 3 incorporation
     A*                                              Begin /S01486/
     A*                                     BEGIN /073957/
     A*                                     END /073957/
     A*                                              End   /S01486/
      *>>056584*<< Release 3 incorporation
     A*                                              Begin /S01486/
     A*                                     BEGIN /073957/
     A*                                     END /073957/
     A*                                              End   /S01486/
      *>>056584*<< Release 3 incorporation
     A*                                              Begin /S01486/
     A*                                     BEGIN /073957/
     A*                                     END /073957/
     A*                                              End   /S01486/
      *>>056584*<< Release 3 incorporation
     A*                                              Begin /S01486/
     A*                                     BEGIN /073957/
     A*                                     END /073957/
     A*                                              End   /S01486/
      *>>056584*<< Release 3 incorporation
     A*                                              Begin /S01486/
     A*                                     BEGIN /073957/
     A*                                     END /073957/
     A*                                              End   /S01486/
     A*                                              Begin /S01486/
     A*                                     BEGIN /073957/
     A*                                     END /073957/
     A*                                              End   /S01486/
      *>>056584*<< Release 3 incorporation
     A*                                              Begin /S01486/
     A*                                     BEGIN /073957/
     A*                                     END /073957/
     A*                                              End   /S01486/
     A*                                              Begin /S01486/
     A***********                       6  2'Sts'
     A***********                       6 11'Narrative'
     A***********                       6 25'Transaction /   Mkt Value   Mkt +
     A***********                             Yield     Market P & L'
     A**
     A***********                       7 12'Details'
     A***********                       7 25'Security Ref    Interest   Folio +
     A***********                             Yield       FX P & L'
     A                                  7  2'Sts'
     A                                  7 11'Narrative'
     A                                  7 25'Transaction /   Mkt Value   Mkt +
     A                                        Yield     Market P & L'
     A**
     A                                  8 12'Details'
     A                                  8 25'Security Ref    Interest   Folio +
     A                                        Yield       FX P & L'
     A*                                              End   /S01486/
     A*
     A** FORMAT PM0675F2
     A          R PM0675F2
     A                                      OVERLAY
     A                                 23  1'F3=Exit  F11=Window'
     A N54                             23 21'right '
     A  54                             23 21'left '
     A                                 23 28'F12=Previous  Rollup / Rolldown'
