      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas PM Request Performance Dataset Refresh')
      *****************************************************************
      *                                                               *
      *  Midas - Portfolio Management Module                          *
      *                                                               *
      *  DSPF/PM6000DF - PM Request Performance Dataset Refresh       *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Last Amend No. CPM005             Date 10Jul96               *
      *  Prev Amend No. S01124             Date 03Jun94               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CPM005 - Private Banking Phase II                            *
      *           Focus Group Changes Upgraded to DBA                 *
      *  S01124 - PBFG/4 - Simple Performance Dataset Save & Query    *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A                                      VLDCMDKEY(49 'ANY VALID KEY')
     A                                      PRINT(MPRINT)
     A                                      INDARA
     A                                      CA03
     A                                      CA22
      *                                              Begin /CPM005/
     A                                      CA12
      *                                              End   /CPM005/
     A*
     A*======================================================================
     A** FORMAT PM6000C0
     A*======================================================================
      *                                              Begin /CPM005/
     A**********R PM6000F1
     A          R PM6000F1                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *                                              End   /CPM005/
     A*
     A                                      OVERLAY
      *                                              Begin /CPM005/
     A**********                        1  6'REQUEST REFRESH OF PERFORMANCE DAT-
     A**********                            ASET'
     A**********                            DSPATR(HI)
     A**********  WSID          10A  O  1 49TEXT('WORK STATION ID')
     A**********  DDRUNA         7A  O  1 62
     A**********                        1 72TIME
     A            USER          10A  O  1  2
     A                                  1 13'PM6000'
     A                                  1 25'REQUEST REFRESH OF PERFORMANCE DAT-
     A                                      ASET'
     A                                      DSPATR(HI UL)
     A            BJMRDT         7A  O  1 72
     A            WSID          10A  O  2  2
     A                                  2 72TIME
      *                                              End   /CPM005/
     A*
     A                                  4 19'Date of Last Refresh'
     A                                      DSPATR(HI)
     A            DDDLRD         7A  O  4 40
     A*
     A                                  5 19'Requested by User'
     A                                      DSPATR(HI)
     A            DDDLRU        10A  O  5 40
     A*
     A                                 10  5'A T T E N T I O N :'
     A                                      DSPATR(HI)
     A  11                                  DSPATR(BL)
     A                                 10 27'When user press <ENTER> on current-
     A                                       screen,'
     A                                      DSPATR(HI)
     A  11                                  DSPATR(BL)
     A*
     A                                 12 27'the submitted processing can take -
     A                                      between'
     A                                      DSPATR(HI)
     A  11                                  DSPATR(BL)
     A*
     A                                 14 27'5 to 10 hours |'
     A                                      DSPATR(HI)
     A  11                                  DSPATR(BL)
     A*
     A  12                             18  2'Press F22 to confirm submit of bat-
     A                                      ch'
     A  12                                  DSPATR(HI)
     A*
     A  13                             22  2'Performance Dataset Refresh Reques-
     A                                      ted'
     A  13                                  DSPATR(HI)
     A*
      *                                              Begin /CPM005/
     A**********                       23  2'F3=Exit  Enter=Refresh Dataset'
     A                                 23  2'F3=Exit  F12=Previous Screen  +
     A                                       Enter=Refresh Dataset'
      *                                              End   /CPM005/
     A                                      DSPATR(HI)
     A*
     A*======================================================================
     A** FORMAT PM6000S0
     A*======================================================================
     A          R PM6000S0                  SFL
     A                                      SFLMSGRCD(24)
     A            DDSFKY                    SFLMSGKEY
     A            DDPGMQ                    SFLPGMQ
     A*======================================================================
     A** FORMAT PM6000C0
     A*======================================================================
     A          R PM6000C0                  SFLCTL(PM6000S0)
     A                                      SFLSIZ(0024)
     A                                      SFLPAG(0001)
     A                                      SFLDSPCTL
     A                                      SFLDSP
     A                                      OVERLAY
     A  40
     AON40                                  SFLEND
     A                                      SFLINZ
     A            DDPGMQ                    SFLPGMQ
