      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SM Branches to be converted')                    *
      *****************************************************************
      *                                                               *
      *  Midas - Implementation module                                *
      *                                                               *
      *  SMBRCCVTL1 -  Midas SM Branches to be converted keyed by     *
      *                Old Branch                                     *
      *                                                               *
      *  (c) Finastra International Limited 2011                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. AR800209           Date 08Jul11               *
      *                                                               *
      *---------------------------------------------------------------*
      *  MD046248 - Finastra Rebranding                               *
      *  AR800209 - Database migration from a previous Midas Release  *
      *             to Midas Plus 1.4                                 *
      *                                                               *
      *****************************************************************
     A          R SMBRCCVTD0                PFILE(SMBRCCVTPD)
      *
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2011')
     A          K BCOLDB
