      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas RN Country Codes - US')
      *****************************************************************
      *                                                               *
      *  MidasPlus - FRS Regulatory Reporting Interface               *
      *                                                               *
      *   RNCTYUPD - Country Codes - US                               *
      *                                                               *
      *   (c) Finastra International Limited 2006                     *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. BUG11157 *CREATE   Date 06Apr06               *
      *                                    Date                       *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *   BUG11157 - Add new field CPRTYRES US counterparty residence *
      *              to customer extension file.                      *
      *                                                               *
      *****************************************************************
 
     A                                      UNIQUE
 
     A          R RNCTYUD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2006')
      *
     A            COUNTRY        2          TEXT('Country Code')
     A                                      COLHDG('Country' 'Code')
     A            CODESC       128          TEXT('Country Code Description')
     A                                      COLHDG('Country Code' +
     A                                             'Description')
 
     A          K COUNTRY
