      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas EMU Dealing Base Ccy Convrsn dets - update')
      *****************************************************************
      *                                                               *
      *  Midas - E.M.U. Module                                        *
      *                                                               *
      *  LF/EUDBCEL0 - Base Currency for Dealing Conversion Details   *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Last Amend No. CEU009  *CREATE    Date 11Feb98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CEU009 - EMU Base Currency for Dealing Conversion            *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A          R EUDBCED0                  PFILE(EUDBCEPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K BCDE
      *
      ***  Example /COPY.
     A*/COPY WNCPYSRC,MMnnnnLx01
      *
