      *****************************************************************
/*STD *  DSPFDFRWN                                                    *
/*EXI *  TEXT('Midas SE EUCLID Transmission Screen')
     A********************************************************************
     A*                                                                  *
     A*  Midas - Securities Trading Module
     A*                                                                  *
     A*  EUCLIDWAIT  -  EUCLID TRANSMISSION SCREEN                       *
     A*                                                                  *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                                  *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CAAA02             Date 16Jul03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  PREV AMEND NO. S01253             DATE 09NOV90                  *
     A*                 S01190             DATE 15/02/89                 *
     A*                                                                  *
     A********************************************************************
     A*                                                                  *
      *  CAAA02 - Remove use of LOCK keyword to enable WebFacing      *
      *           to process screens.                                 *
     A*  S01253  -  RECOMPILED FOR MULTILANGUAGE SCREENS                 *
     A*  S01190  -  EUCLID FIX/UPGRADE                                   *
     A*                                                                  *
     A********************************************************************
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A***RSTDSP(*YES)*DFRWRT(*YES)*CHRID(*DEVD)*SHARE(*YES)********** *S01190
     A*****************************************************************
     A                                      CHGINPDFT
     A                                      PRINT(MPRINT)
     A          R EUCLIDF1                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*
      ** Start of CAAA02
     A******************                    LOCK
      ** End   of CAAA02
     A                                      SLNO(1)
     A                                      OVERLAY
     A                                      PUTRETAIN
     A                                  3 03'           '
     A                                      DSPATR(RI)
     A                                  3 16'   '
     A                                      DSPATR(RI)
     A                                  3 24'   '
     A                                      DSPATR(RI)
     A                                  3 29'           '
     A                                      DSPATR(RI)
     A                                  3 42'   '
     A                                      DSPATR(RI)
     A                                  3 55'           '
     A                                      DSPATR(RI)
     A                                  3 68'          '
     A                                      DSPATR(RI)
     A                                  4 03'           '
     A                                      DSPATR(RI)
     A                                  4 16'   '
     A                                      DSPATR(RI)
     A                                  4 24'   '
     A                                      DSPATR(RI)
     A                                  4 29'           '
     A                                      DSPATR(RI)
     A                                  4 42'   '
     A                                      DSPATR(RI)
     A                                  4 55'           '
     A                                      DSPATR(RI)
     A                                  4 68'           '
     A                                      DSPATR(RI)
     A                                  5 03'   '
     A                                      DSPATR(RI)
     A                                  5 16'   '
     A                                      DSPATR(RI)
     A                                  5 24'   '
     A                                      DSPATR(RI)
     A                                  5 29'   '
     A                                      DSPATR(RI)
     A                                  5 42'   '
     A                                      DSPATR(RI)
     A                                  5 59'   '
     A                                      DSPATR(RI)
     A                                  5 68'   '
     A                                      DSPATR(RI)
     A                                  5 76'   '
     A                                      DSPATR(RI)
     A                                  6 03'        '
     A                                      DSPATR(RI)
     A                                  6 16'   '
     A                                      DSPATR(RI)
     A                                  6 24'   '
     A                                      DSPATR(RI)
     A                                  6 29'   '
     A                                      DSPATR(RI)
     A                                  6 42'   '
     A                                      DSPATR(RI)
     A                                  6 59'   '
     A                                      DSPATR(RI)
     A                                  6 68'   '
     A                                      DSPATR(RI)
     A                                  6 76'   '
     A                                      DSPATR(RI)
     A                                  7 03'        '
     A                                      DSPATR(RI)
     A                                  7 16'   '
     A                                      DSPATR(RI)
     A                                  7 24'   '
     A                                      DSPATR(RI)
     A                                  7 29'   '
     A                                      DSPATR(RI)
     A                                  7 42'   '
     A                                      DSPATR(RI)
     A                                  7 59'   '
     A                                      DSPATR(RI)
     A                                  7 68'   '
     A                                      DSPATR(RI)
     A                                  7 76'   '
     A                                      DSPATR(RI)
     A                                  8 03'   '
     A                                      DSPATR(RI)
     A                                  8 16'   '
     A                                      DSPATR(RI)
     A                                  8 24'   '
     A                                      DSPATR(RI)
     A                                  8 29'   '
     A                                      DSPATR(RI)
     A                                  8 42'   '
     A                                      DSPATR(RI)
     A                                  8 59'   '
     A                                      DSPATR(RI)
     A                                  8 68'   '
     A                                      DSPATR(RI)
     A                                  8 76'   '
     A                                      DSPATR(RI)
     A                                  9 03'           '
     A                                      DSPATR(RI)
     A                                  9 16'           '
     A                                      DSPATR(RI)
     A                                  9 29'           '
     A                                      DSPATR(RI)
     A                                  9 42'           '
     A                                      DSPATR(RI)
     A                                  9 55'           '
     A                                      DSPATR(RI)
     A                                  9 68'           '
     A                                      DSPATR(RI)
     A                                 10 03'           '
     A                                      DSPATR(RI)
     A                                 10 16'           '
     A                                      DSPATR(RI)
     A                                 10 29'           '
     A                                      DSPATR(RI)
     A                                 10 42'           '
     A                                      DSPATR(RI)
     A                                 10 55'           '
     A                                      DSPATR(RI)
     A                                 10 68'          '
     A                                      DSPATR(RI)
     A          R EUCLIDF2
      ** Start of CAAA02
     A******************                    LOCK
      ** End   of CAAA02
     A                                      INZRCD
     A                                      CLRL(13)
     A                                      SLNO(11)
     A                                      OVERLAY
     A            MSG1          80   O  4 12
     A            MSG2          80   O  7 12
     A            MSG3          80   O 10 12
     A                                  2 12TIME
