      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas SE Securities maintenance')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Securities Trading Module                            *
     A*                                                               *
     A*  DSPF/SE0040DF - SECURITY DETAILS MAINTENANCE                 *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CGL031             Date 05Jul04               *
      *                 CAS006             Date 21Jan03               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 192054             Date 27Jun01               *
      * Midas DBA 3.05 -----------------------------------------------*
      *                 CSD006             DATE 14May01               *
      *                 CAP060             DATE 14May01               *
      *                 183604             Date 08Mar00               *
      * Midas DBA 3.03 -----------------------------------------------*
     A*                 102342             DATE 10MAY96               *
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CSE011             Date 26Aug99               *
      *                 CPB001             DATE 27Sep99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CPL002             DATE 08Mar99               *
     A*                 155622             Date 23Feb99               *
     A*                 CEU017             Date 03Avr98               *
     A*                 CSE007             Date 19Jan98               *
     A*                 CEU018             DATE 29APR98               *
     A*                 CSE005             DATE 12DEC96               *
     A*                 104633             DATE 17JUL96               *
     A*                 S01408             DATE 01MAR96               *
     A*                 S01401             DATE 15JUN93               *
     A*                 S01397             DATE 15SEP92               *
     A*                 S01117             DATE 15NOV90               *
     A*                 S01220             DATE 09NOV90               *
     A*                 E23282             DATE 14AUG90               *
     A*                 E22048             DATE 17MAY90               *
     A*                 S01253             DATE 09NOV90               *
     A*                 E19031             DATE 14SEP89               *
     A*                 E16770             DATE 14SEP89               *
     A*                 E16302             DATE 14SEP89               *
     A*                 S01199             DATE 04/08/89              *
     A*                 S01186             DATE 11/11/88              *
     A*                 S01176             DATE 08/07/88              *
     A*                 E13820             DATE 20/06/88              *
     A*                 S01158             DATE 09/05/88              *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL031 - Taxation on Savings Income                          *
      *  CAS006 - Hedge Accounting Phase B                            *
      *  192054 - If private banking module is on, the ISIN number    *
      *           must be displayed.                                  *
     A*  CSD006 - Market Data Feeds                                   *
     A*  CAP060 - Midas APIs, Security Prices Full API                *
     A*  183604 - Industry Code and Market Center must be mandatory   *
     A*           Rating Code must be validated against new table     *
     A*           PBRATIPD when new PB Module is switched ON.         *
     A*         - Integrate 'Instrument/Investment Type'              *
     A*  102342 - Securities maintenance - Depot references           *
     A*           On screen one it is possible to enter a Telekurs    *
     A*           reference for a security, and on the investment     *
     A*           type details a depot reference can be made to pick  *
     A*           up the Telekurs reference automatically. This works *
     A*           fine for a new security, however, if you            *
     A*           subsequently amend the Telekurs number, the system  *
     A*           does not update the depot reference.                *
     A*           In order to protect the defaulted Depot references  *
     A*           indicator had to be freed up. Indicators 01 02 05   *
     A*           have been used because they were assosiated with    *
     A*           function keys 03, 05, & 12.                         *
      *  CSE011 - Securities Trading Duplicate Security Codes         *
      *           Check.                                              *
      *  CPB001  - 'Private Banking' Module                           *
     A*  CPL002 - Midas-Plato Interface                               *
     A*  155622 - Do not display F5 and F12 narratives when program   *
     A*           called from one of the Corporate Action programs.   *
     A*  CEU017 - Securities Redenomination Euro Changes              *
     A*           Same coding than CSE007                             *
     A*  CSE007 - Corporate Actions                                   *
     A*  CEU018 - SE Decimals on Nominal amounts (display and valida- *
     A*           tion of field SNMDP)                                *
     A*  CSE005 - Effect of holidays on FRN Coupon Dates.             *
     A*  104633 - GUI Amendments to DSPF with non-standard footers    *
     A*  S01408 - Addition of core hook SE0040DF01                    *
     A*           Addition of core hook SE0040DF02                    *
     A*  S01401 - MT5xx SWIFT Messages Feature:                       *
     A*          - New fields SISIN AND SSWTP added to Screen.        *
     A*  S01397 - Rel 10 Incorporation of BNZ SARs A46008 and A46013. *
     A*          - Fields added for New Zealand Bond Formula.         *
     A*  S01117 - MULTIBRANCHING                                      *
     A*  S01220 - AMENDED FOR STRATEGIC RISK MANAGEMENT RELEASE 2     *
     A*  E23282 - FIELDS SHOULD NOT BE UNDERLINED ON ENQUIRE/DELETE   *
     A*  E22048 - ALLOW AMEND ON MARKET CENTRE.                       *
     A*  S01253 - RECOMPILED FOR MULTILANGUAGE SCREENS                *
     A*  E19031 - CF12 USED TO GET BACK TO PREVIOUS SCREEN            *   E19031
     A*  E16770 - 'RATING' FIELD SHOULD ALLOW LOWER CASE LETTERS      *   E16770
     A*  E16302 - SECURITIES REPORT NAME NOT SHOWN CORRECTLY ON       *   E16302
     A*           ENQUIRIES.                                          *   E16302
     A*  S01199 - HELP SYSTEM.                                    *       S01199
     A*  S01186 - MATY. DATE AND IND NOT UNDERLINED                   *   S01186
     A*  S01176 - SECURITIES TRADING 3.1 (AUSTRALIA)                  *
     A*  E13820 - POST INCORPORATION DEVELOPMENT FIX TO               *
     A*           PROTECT FIELDS FOR COMPLETE SECURITIES.             *
     A*  S01158 - POST INCORPORATION DEVELOPMENT FIX                  *
     A*                                                               *
     A*****************************************************************
     A*         /////////////////////////////////////////             *
     A*        // WARNING: When creating this display //              *
     A*       //   file, take options RSTDSP(*YES)   //               *
     A*      //                       SHARE (*YES)  //                *
     A*     /////////////////////////////////////////                 *
     A*                                                               *
     A*****************************************************************
      *
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT(MPRINT)
     A*                                                    /*S01199*/
     A*                                                    /*S01199*/
     A*                                              Begin /102342/
     A************                          CF03(01 'End of job')
     A************                          CF05(05 'Initial screen')
     A                                      CF03
     A                                      CF05
     A*                                              End   /102342/
     A*                                                    /*S01199*/
     A*                                                    /*S01199*/
     A*                                              Begin /S01117/
     A**********R SE0040F1
     A          R SE0040F1                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*                                              End   /S01117/
     A*                                            /S01176/
     A*                                            /EM0032/
     A**48N46N47*                           CF12(17 'Restore details')
     A*                                              Begin /102342/
     A****N46N47***                         CF12(17 'Restore details')
     A    N46N47                            CF12
     A*                                              End   /102342/
     A*                                            /EM0032/
     A*                                            /S01176/
     A  46                                  CF10(04 'Delete')
     A  47                                  ROLLUP(07 'Rollup requested')
     A*                                              Begin /S01117/
     A*                                                    /*S01199*/
     A*                                                    /*S01199*/
      *                                              Begin /CSD006/
      *                                              End   /CSD006/
     A*/COPY WNCPYSRC,SE0040DF46
      *                                              Begin /S01401/
      *                                              End   /S01401/
     A*                                              End   /S01117/
      *                                              Begin /CEU018/
      *                                              End   /CEU018/
      *                                              Begin /CPL002/
      *                                              End   /CPL002/
     A                                  1 30'SECURITIES INPUT'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  1 51TIME
     A            RUNA           7A  O  1 61
     A                                  1 71'WSID'
     A            WSID           3A  O  1 76
     A                                  3  2'Action Code'
     A            SACTN          1A  B  3 15
     A N50N41                               DSPATR(UL)
     A                                      DSPATR(HI)
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A  03
     AO 41                                  DSPATR(PR)
     A*                                                    /S01158/
     A***                               3 19'Security Shortname'
     A***         SSESN         10A  B  3 42
     A                                  3 18'Security Shortname'
     A            SSESN         10A  B  3 40
     A*                                                    /S01158/
     A N51N41                               DSPATR(UL)
     A                                      DSPATR(HI)
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A  03
     AO 41                                  DSPATR(PR)
     A*                                                    /S01158/
     A***                               4 19'Security Report Name'
     A***         SSRPN         20A  B  4 42
     A                                  4 18'Security Report Name'
     A***         SSRPN         20A  B  4 40     /S01158/  /S01176/
     A*                                                    /S01158/
     A*                                                    /S01176/
     A*                                                    /E16302/
     A*N46N47     SSRPN         20A  B  4 40
     A            SSRPN         20A  B  4 40
     A*                                                    /E16302/
     A*                                                    /S01176/
     A N53                                  DSPATR(UL)
     A                                      DSPATR(HI)
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A  03                                  DSPATR(PR)
     A*                                                    /S01158/
     A*                                                    /E16302/
     A**46
     A*O 47        SRNME         41A  B  4 40
     A*N53                                  DSPATR(UL)
     A****                                  DSPATR(HI)
     A**03                                  DSPATR(PR)
     A*                                                    /E16302/
     A***                               5 19'Security Full Name- 1'
     A***         SSFN1         30A  B  5 42DSPATR(UL HI)
     A**03                                  DSPATR(PR)
     A***                               6 37'- 2'
     A***         SSFN2         30A  B  6 42DSPATR(UL HI)
     A                                  5 18'Security Full Name- 1'
     A            SSFN1         30A  B  5 40DSPATR(UL HI)
     A  03                                  DSPATR(PR)
     A                                  6 36'- 2'
     A            SSFN2         30A  B  6 40DSPATR(UL HI)
     A*                                                    /S01158/
     A  03                                  DSPATR(PR)
     A*                                              Begin /CAP060/
     A                                  7 15'SE Price Front Office Id'
     A N75                                  DSPATR(ND)
     A            SSSPID        20A  B  7 40
     A N92                                  DSPATR(UL)
     A                                      DSPATR(HI)
     A  92                                  DSPATR(RI PC)
     A  03                                  DSPATR(PR)
     A N75                                  DSPATR(ND)
     A*                                              End   /CAP060/
     A*                                                     /S01176/
     A*****                             8  3'Issuer'
     A                                  8  2'Issuer'
     A*****       SISSR         10A  B  8 33
     A            SISSR         10A  B  8 32
     A*                                                     /S01176/
     A N62                                  DSPATR(UL)
     A                                      DSPATR(HI)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A  03                                  DSPATR(PR)
     A                                  8 45'New Issue?'
     A            NEWISS         1A  B  8 70
     A N63                                  DSPATR(UL)
     A                                      DSPATR(HI)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A  03                                  DSPATR(PR)
     A*                                                     /S01176/
     A*****                             9  3'Incomplete Indicator'
     A                                  9  2'Incomplete Indicator'
     A*****       SINCS          1A  B  9 33
     A            SINCS          1A  B  9 32
     A*                                                     /S01176/
     A N52N44                               DSPATR(UL)
     A                                      DSPATR(HI)
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A  03
     AO 44                                  DSPATR(PR)
     A                                  9 45'Partly Paid'
     A            SPPDI          1A  B  9 70
     A N61N45                               DSPATR(UL)
     A                                      DSPATR(HI)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A  03
     AO 45                                  DSPATR(PR)
     A*                                                    /S01176/
     A*****                            10  3'Investment Type'
     A                                 10  2'Investment Type'
     A*****       SSITP          3A  B 10 33
     A            SSITP          3A  B 10 32
     A**N55N44*****                          DSPATR(UL)
     A N55N41                               DSPATR(UL)
     A*                                                    /S01176/
     A                                      DSPATR(HI)
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A  03
     A*                                                    /S01176/
     A*O*44********                          DSPATR(PR)
     AO 41                                  DSPATR(PR)
     A*                                                    /S01176/
     A                                 10 45'Trade Basis Override'
     A            TBSOVR         1A  B 10 70
     A N68N41                               DSPATR(UL)
     A                                      DSPATR(HI)
     A  68                                  DSPATR(RI)
     A  68                                  DSPATR(PC)
     A  03
     AO 41                                  DSPATR(PR)
     A*                                            /S01176/
     A*****                            11  3'Quality Indicator'
     A                                 11  2'Rating'
     A*****       SQLTY          3A  B 11 33DSPATR(UL HI)
     A*/COPY WNCPYSRC,SE0040DF23
      *                                     Start of change /183604/
     A*****       SQLTY          3A  B 11 32DSPATR(UL HI)
     A            SQLTY          3A  B 11 32
     A N74                                  DSPATR(UL)
     A                                      DSPATR(HI)
     A  74                                  DSPATR(RI)
     A  74                                  DSPATR(PC)
      *                                       End of change /183604/
     A*/COPY WNCPYSRC,SE0040DF24
     A*****                                                /E16770/
     A                                      CHECK(LC)
     A*****                                                /E16770/
     A*                                                    /S01176/
     A  03                                  DSPATR(PR)
     A                                 11 45'Market Indicator'
     A            SMKTI          1A  B 11 70
     A N59                                  DSPATR(UL)
     A                                      DSPATR(HI)
     A  59                                  DSPATR(RI)
     A  59                                  DSPATR(PC)
     A  03                                  DSPATR(PR)
     A*                                                    /S01176/
     A*****                            12  3'Stock Denominations'
     A*/COPY WNCPYSRC,SE0040DF25
     A                                 12  2'Trade Denomination '
     A*****       SSDNM          7M  B 12 33
     A            SSDNM          7M  B 12 32
     A*                                                    /S01176/
     A*/COPY WNCPYSRC,SE0040DF07
      *                                     Start of change /CSE007/
     A*N64N44***                            DSPATR(UL)
     A N64N44N99
     AON64N03 99                            DSPATR(UL)
      *                                       End of change /CSE007/
     A                                      DSPATR(HI)
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A*/COPY WNCPYSRC,SE0040DF38
      *                                     Start of change /CSE007/
     A**03******
     A*O*44*****                             DSPATR(PR)
     A  03N99
     AO 44N99
     AO 03 99                               DSPATR(PR)
      *                                       End of change /CSE007/
     A*/COPY WNCPYSRC,SE0040DF08
     A                                 12 45'Early Repayments?'
     A            SERPY          1A  B 12 70
     A N65                                  DSPATR(UL)
     A                                      DSPATR(HI)
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A  03                                  DSPATR(PR)
     A*                                                    /S01176/
     A*****                            13  3'Value Date Default'
     A                                 13  2'Value Date Default'
     A*****       SVDFT          3A  B 13 33
     A            SVDFT          3A  B 13 32
     A*                                                    /S01176/
     A N66                                  DSPATR(UL)
     A                                      DSPATR(HI)
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A  03                                  DSPATR(PR)
     A                                 13 45'Ex Date Default'
     A            SEDFT          3A  B 13 70
     A N67                                  DSPATR(UL)
     A                                      DSPATR(HI)
     A  67                                  DSPATR(RI)
     A  67                                  DSPATR(PC)
     A  03                                  DSPATR(PR)
     A*                                                    /S01176/
     A*****                            14  3'Nominal Currency'
     A                                 14  2'Nominal Currency'
     A*****       SNMCY          3A  B 14 33
     A            SNMCY          3A  B 14 32
     A*N54N44****                           DSPATR(UL)
     A N54N41                               DSPATR(UL)
     A*                                                    /S01176/
     A                                      DSPATR(HI)
     A  54                                  DSPATR(RI)
     A  54                                  DSPATR(PC)
     A  03
     A*                                                    /S01176/
     A*O*44*****                             DSPATR(PR)
     AO 41                                  DSPATR(PR)
     A*                                                    /S01176/
     A                                 14 45'Value Currency'
     A            SVLCY          3A  B 14 70
     A*/COPY WNCPYSRC,SE0040DF09
     A*                                                    /S01158/
     A*N57N41****                           DSPATR(UL)
      *                                     Start of change /CSE007/
     A*N57N44****                           DSPATR(UL)
     A***********                                          /S01158/
     A**********                            DSPATR(HI)
     A**57******                            DSPATR(RI)
     A**57******                            DSPATR(PC)
     A**03******
     A**********                                           /S01158/
     A*O*44*****                             DSPATR(PR)
      *                                       End of change /CSE007/
     A**41***                               DSPATR(PR)
     A*                                                    /S01158/
      *                                     Start of change /CSE007/
     A N57N44N99
     AON57N03 99                            DSPATR(UL)
     A                                      DSPATR(HI)
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(PC)
     A  03N99
     AO 44N99
     AO 03 99                               DSPATR(PR)
      *                                       End of change /CSE007/
     A*/COPY WNCPYSRC,SE0040DF10
     A*                                                    /S01176/
     A*****                            15  3'Sector'
     A                                 15  2'Sector'
     A*****       SSSEC          2A  B 15 33DSPATR(UL HI)
     A            SSSEC          2A  B 15 32DSPATR(UL HI)
     A*                                                    /S01176/
     A  03                                  DSPATR(PR)
     A                                 15 45'Multi-currency?'
     A            SMLTI          1A  B 15 70
     A N58                                  DSPATR(UL)
     A                                      DSPATR(HI)
     A  58                                  DSPATR(RI)
     A  58                                  DSPATR(PC)
     A  03                                  DSPATR(PR)
     A*                                                    /S01176/
     A*****                            16  3'Industry Code'
     A                                 16  2'Industry Code'
     A*****       SSIDY          3A  B 16 33
     A            SSIDY          3A  B 16 32
     A*                                                    /S01176/
     A N56                                  DSPATR(UL)
     A                                      DSPATR(HI)
     A  56                                  DSPATR(RI)
     A  56                                  DSPATR(PC)
     A  03                                  DSPATR(PR)
     A                                 16 45'Country of Risk'
     A            SSCOR          2A  B 16 70
     A N60                                  DSPATR(UL)
     A                                      DSPATR(HI)
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A  03                                  DSPATR(PR)
     A*                                                    /S01176/
     A*****                            17  3'Statutory Returns Code'
     A                                 17  2'Statutory Returns Code'
     A*****       SSRET          5A  B 17 33DSPATR(UL HI)
     A*/COPY WNCPYSRC,SE0040DF36
     A            SSRET          5A  B 17 32DSPATR(UL HI)
     A*                                                    /S01176/
     A*/COPY WNCPYSRC,SE0040DF37
     A  03                                  DSPATR(PR)
     A*/COPY WNCPYSRC,SE0040DF32
     A                                 17 45'Sedol (Extel) Reference'
      *                                              Begin /CSE011/
     A*********** SSREF          7A  B 17 70DSPATR(UL HI)
     A            SSREF          7A  B 17 70DSPATR(HI)
     A  71                                  DSPATR(RI PC)
     A N71N03                               DSPATR(UL)
      *                                              End   /CSE011/
     A  03                                  DSPATR(PR)
     A*                                                    /S01176/
     A*****                            18  3'Telekurs (Valoren) Reference'
     A                                 18  2'Telekurs (Valoren) Reference'
     A*****       STVRF          6A  B 18 33DSPATR(UL HI)
      *                                              Begin /CSE011/
     A*********** ST2RF         12A  B 18 32DSPATR(UL HI)
     A            ST2RF         12A  B 18 32DSPATR(HI)
     A  72                                  DSPATR(RI PC)
     A N72N03                               DSPATR(UL)
      *                                              End   /CSE011/
     A*                                                    /S01176/
     A*/COPY WNCPYSRC,SE0040DF34
     A  03                                  DSPATR(PR)
     A                                 18 45'Cusip Number'
      *                                              Begin /CSE011/
     A*********** SCSPN          9A  B 18 70DSPATR(UL HI)
     A            SCSPN          9A  B 18 70DSPATR(HI)
     A  73                                  DSPATR(RI PC)
     A N73N03                               DSPATR(UL)
      *                                              End   /CSE011/
     A  03                                  DSPATR(PR)
     A*/COPY WNCPYSRC,SE0040DF33
      *                                              Begin /S01401/
     A                                 19 02'ISIN/COMMON Code'
     A*/COPY WNCPYSRC,SE0040DF43
     A**Start of change 192054
     A N14
     A**End of change 192054
     A N40                                  DSPATR(ND)
     A*/COPY WNCPYSRC,SE0040DF44
     A            SISIN         12A  B 19 32DSPATR(HI)
     A  35                                  DSPATR(RI PC)
     A*/COPY WNCPYSRC,SE0040DF45
     A  03
     A**Start of change 192054
     A*ON40*****                             DSPATR(PR)                                       192054
     AON40N14                               DSPATR(PR)
     A N14
     A N40                                  DSPATR(ND)
     A*N35N03*40                            DSPATR(UL)                                        192054
     A N35N03 14
     AON35N03 40                            DSPATR(UL)
     A**End of 192054
      *
     A*/COPY WNCPYSRC,SE0040DF26
     A                                 19 45'SWIFT Security Type Code'
     A N40                                  DSPATR(ND)
     A            SSWTP          3A  B 19 70DSPATR(HI)
     A  86                                  DSPATR(RI PC)
     A  03
     AON40                                  DSPATR(PR)
     A N40                                  DSPATR(ND)
     A N86N03 40                            DSPATR(UL)
      *                                              End   /S01401/
     A*/COPY WNCPYSRC,SE0040DF41
      **                                            Start  /CEU018/
     A                                 20  2'Nominal Decimal Places'
     A N84                                  DSPATR(ND)
     A            SNMDP          1A  B 20 32DSPATR(HI)
     A  85                                  DSPATR(RI PC)
     A  03
     AO 44
     AO 83
     AON84                                  DSPATR(PR)
     A N84                                  DSPATR(ND)
     A N83N44
     AAN85N03 84                            DSPATR(UL)
      *                                              End   /CEU018/
     A**Start of change CGL031
     A                                 20 45'Subject to European Tax?'
     A N87                                  DSPATR(ND)
     A            SSETX          1A  B 20 70DSPATR(HI)
     A N87                                  DSPATR(ND)
     A  88                                  DSPATR(RI PC)
     A N88                                  DSPATR(UL)
     A  47                                  DSPATR(PR)
     A**End of change CGL031
      **                                            Start  /CPL002/
     A                                 21  2'Plato:Instrument Class Code'
     A N70                                  DSPATR(ND)
     A            SICCD         16A  B 21 32DSPATR(HI)
     A                                      CHECK(LC)
     A  03
     AON70                                  DSPATR(PR)
     A N70                                  DSPATR(ND)
     A    N03 70                            DSPATR(UL)
     A                                 21 49'Debt Instrument Name'
     A N70                                  DSPATR(ND)
     A            SDINM         10A  B 21 70DSPATR(HI)
     A                                      CHECK(LC)
     A  03
     AON70                                  DSPATR(PR)
     A N70                                  DSPATR(ND)
     A    N03 70                            DSPATR(UL)
     A                                 22  2'      Reporting Group'
     A N70                                  DSPATR(ND)
     A            SRGCD          8A  B 22 32DSPATR(HI)
     A                                      CHECK(LC)
     A  03
     AON70                                  DSPATR(PR)
     A N70                                  DSPATR(ND)
     A    N03 70                            DSPATR(UL)
     A                                 22 49'Pricing Group'
     A N70                                  DSPATR(ND)
     A            SPGCD          8A  B 22 70DSPATR(HI)
     A                                      CHECK(LC)
     A  03
     AON70                                  DSPATR(PR)
     A N70                                  DSPATR(ND)
     A    N03 70                            DSPATR(UL)
      *                                              End   /CPL002/
     A*/COPY WNCPYSRC,SE0040DF27
     A  09        ERRMSG        76A  O 23  2DSPATR(RI)
      **                                            Start  /104633/
     A**46**                           24  2'Press F3 to end job, F5 for Initi-
     A******                                al Screen or F10 to Delete.'
     A  46                             24  2'F3=Exit'
     A  46                             24 12'F5=Initial Screen   F10=Delete'
      **                                            End    /104633/
     A*                                                    /S01176/
     A*N46*******                      24  2'Press Cmd/1 to end job or Cmd/5 fo-
     A***********                           r Initial Screen.'
     A*                                                    /EM0032/
     A*N46N48                          24  2'Press Cmd/1 to end job or Cmd/5 fo-
     A*                                     r Initial Screen.'
     A*N46 48                          24  2'Press Cmd/1 to end job or Cmd/5 fo-
      **                                            Start  /104633/
     A*N46**                           24  2'Press F3 to end job or F5 for Ini-
     A******                                               /EM0032/
     A******                                tial Screen, or Cmd/12 Prev. D-
     A******                                etails.'
     A N46                             24  2'F3=Exit'
      **                                            Start  /155622/
     A*N46**                           24 12'F5=Initial Screen   F12=Previous'
     A N46N93                          24 12'F5=Initial Screen   F12=Previous'
      **                                            End    /155622/
      **                                            End    /104633/
     A*                                                    /S01176/
     A  42                              1  7'''CANCELLED'''
     A  43                              1  7'''MATURED'''
     A          R SE0040F2
     A*            14:19:59    SENB        REL-R08M00  5714-UT1
     A*
     A*/COPY WNCPYSRC,SE0040DF01
     A*
     A                                      CHANGE(49 'Record amended')
     A*                                                    /E19031/
     A*********                             CF02(02 'Previous screen')
     A*                                              Begin /102342/
     A*********                             CF12(02 'Previous screen')
     A                                      CF12
     A*                                              End   /102342/
     A*                                                    /E19031/
     A*                                                    /S01176/
     A**50*****                             ROLLUP(07 'Rollup requested')
     A**50*****                             ROLLDOWN(08 'Rolldown requested')
     A  47                                  ROLLUP(07 'Rollup requested')
     A  47                                  ROLLDOWN(08 'Rolldown requested')
     A*                                                    /S01176/
     A*                                              Begin /S01117/
     A*                                                    /*S01199*/
     A*******************                              /*S01220 START*/
     A*******************                              /*S01220 END*/
     A*******************                              /*S01220 START*/
     A*******************                              /*S01220 END*/
     A*                                                    /*S01199*/
     A*                                                /*S01220 START*/
      *                                          Begin /*S01397*/
      *                                          End   /*S01397*/
      *                                          Begin /*S01397*/
      *                                          End   /*S01397*/
     A*                                                /*S01220 END*/
     A***********                                    Begin /CSE005/
     A***********                                    End   /CSE005/
      *                                              Begin /CSD006/
      *                                              End   /CSD006/
     A*                                                /*S01220 START*/
     A*                                                /*S01220 END*/
      *                                              Begin /S01397/
      *                                              End   /S01397/
     A*                                              End  /S01117/
     A                                  1 30'SECURITIES INPUT'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  1 51TIME
     A            RUNA           7A  O  1 61
     A                                  1 71'WSID'
     A            WSID           3A  O  1 76
     A                                  3  3'Security Shortname'
     A            SSESN         10A  O  3 27DSPATR(HI)
     A  10                              4  3'Coupon Rate'
     A  10        SCPNR         13M  B  4 27
     A*/COPY WNCPYSRC,SE0040DF39
     A*                                                    /S01158/
     A**16N83N20                            DSPATR(UL)
     A  16N83N39                            DSPATR(UL)
     A*                                                    /S01158/
     A  83                                  DSPATR(PC)
     A  83                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  03
     A*                                                    /S01158/
     AO 39                                  DSPATR(PR)
     A**20                                  DSPATR(PR)
     A*                                                    /S01158/
     A*/COPY WNCPYSRC,SE0040DF40
     A  10                              4 45'Base Rate Code'
     A  10        SBASC          2A  B  4 65
     A  16N84 21                            DSPATR(UL)
     A  84                                  DSPATR(PC)
     A  84                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  03
     AON21                                  DSPATR(PR)
     A  12                              5  3'Initial Dividend Date'
     A  10                              5  3'Base Rate/Spread'
     A  12        SIDIV          6M  B  5 27
     A  16N51                               DSPATR(UL)
     A  51                                  DSPATR(PC)
     A  51                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  03                                  DSPATR(PR)
     A  10        SBASS         12M  B  5 27
     A  16N85 21                            DSPATR(UL)
     A  85                                  DSPATR(PC)
     A  85                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  03
     AON21                                  DSPATR(PR)
     A  12                              5 38'Next Expected Dividend'
     A  10                              5 45'Spread Indicator'
     A  10        SSPRI          1A  B  5 65
     A  16N86 21                            DSPATR(UL)
     A  86                                  DSPATR(PC)
     A  86                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  03
     AON21                                  DSPATR(PR)
     A  12        SNEXD         14M  B  5 65
     A  16N14                               DSPATR(UL)
     A  14                                  DSPATR(PC)
     A  14                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  03                                  DSPATR(PR)
     A*                                              /*S01220 START*/
      *                                          Begin /S01397/
     A**06*34*****                      6  3'Roll Fwd Dividend Y/N'
     A**06*34*****SRFDI          1A  B  6 27
     A  12 34                           6  3'Roll Fwd Dividend Y/N'
     A  12 34     SRFDI          1A  B  6 27
      *                                          End   /S01397/
     A                                      VALUES('Y' 'N')
     A  16N42 34                            DSPATR(UL)
     A  42 34                               DSPATR(PC)
     A  42 34                               DSPATR(RI)
     A     34                               DSPATR(HI)
     A  03 34                               DSPATR(PR)
     A*                                              /*S01220 END*/
     A  10                              6  3'Minimum Coupon'
     A  10        SMCPN         12M  B  6 27
     A N20
     AA 16N87 21                            DSPATR(UL)
     A  87                                  DSPATR(PC)
     A  87                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  03
     AO 20
     AON21                                  DSPATR(PR)
     A*/COPY WNCPYSRC,SE0040DF03
     A  10                              6 45'Maturity Date'
     A  10        SMATY2         6M  B  6 65
     A*/COPY WNCPYSRC,SE0040DF11
     A*                                            /S01176/
     A*N20N40**
      *                                     Start of change /CSE007/
     A*N39N40***
     A**********                                   /S01176/
     A*A*16N88**                             DSPATR(UL)
     A**88******                            DSPATR(PC)
     A**88******                            DSPATR(RI)
     A**********                            DSPATR(HI)
     A**03******
      *                                       End of change /CSE007/
     A*                                            /S01176/
     A*O*20
      *                                     Start of change /CSE007/
     A*O*39*38*18
     A**********                                   /S01176/
     A*O*40*****                             DSPATR(PR)
     A**********                                   /S01176/
     A N39N40
     AA 16N88N99
     AO 99N40
     AA 16N88N03
     AA 99                                  DSPATR(UL)
     A  88                                  DSPATR(PC)
     A  88                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  03N99
     AO 39 38 18
     AAN99
     AO 40N99
     AO 03 99
     AO 40 99                               DSPATR(PR)
      *                                       End of change /CSE007/
     A*/COPY WNCPYSRC,SE0040DF04
     A  38 10                           6 59'/Ind'
     A  38 10     SMDTI2         1A  B  6 73
     A  16N37N39                            DSPATR(UL)
     A  37                                  DSPATR(PC)
     A  37                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  38 39 18
     AON38
     AO 03                                  DSPATR(PR)
     A*                                          /S01176/
     A  10                              7  3'Longterm Maturity Ind.'
     A  10        SLTMI          1A  B  7 27
     A  16N89                               DSPATR(UL)
     A  89                                  DSPATR(PC)
     A  89                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  03                                  DSPATR(PR)
     A  10                              7 45'Day Basis'
     A  10        SDYBS2         1M  B  7 65
     A*/COPY WNCPYSRC,SE0040DF12
     A*                                                    /S01158/
     A**16N64N20                            DSPATR(UL)
      *                                     Start of change /CSE007/
     A**16N64N39***                         DSPATR(UL)
     A*************                                        /S01158/
     A**64*********                         DSPATR(PC)
     A**64*********                         DSPATR(RI)
     A*************                         DSPATR(HI)
     A**03*********
     A*************                                        /S01158/
     A*O*39********                          DSPATR(PR)
      *                                       End of change /CSE007/
     A**20                                  DSPATR(PR)
     A*                                                    /S01158/
      *                                     Start of change /CSE007/
     A  16N64N39
     AAN99
     AON03 99
     AA 16N64 99                            DSPATR(UL)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  03
     AO 39N99                               DSPATR(PR)
      *                                       End of change /CSE007/
     A*/COPY WNCPYSRC,SE0040DF13
     A  10                              8  3'Divisor Basis'
     A*/COPY WNCPYSRC,SE0040DF05
     A  15                              8  4'Maturity Date'
     A*
     A*                                                    /S01158/
     A* 15-TRADE BASIS IS D - PROTECT FIELD IF COMPLETE
     A*                                                    /S01158/
     A*                                                    /S01176/
     A**15        SMATY1         6M  B  8 19
     A  15        SMATY1         6M  B  8 27
     A*/COPY WNCPYSRC,SE0040DF14
     A*                                                    /S01176/
     A*                                                    /S01158/
     A**16N31N40                            DSPATR(UL)     /S01158/
     A*                                                    /S01186/
     A**16N31N20                            DSPATR(UL)
      *                                     Start of change /CSE007/
     A**16N31N20***
     A*O*16N31N47**
     A*AN48N18*****                          DSPATR(UL)
     A*************                                        /S01186/
     A*************                                        /S01158/
     A**31*********                         DSPATR(PC)
     A**31*********                         DSPATR(RI)
     A*************                         DSPATR(HI)
     A**03*********
      *                                       End of change /CSE007/
     A*                                          /S01158/  /S01176/
     A**40                                  DSPATR(PR)
     A**20                                  DSPATR(PR)
     A*                                          /S01158/
      *                                     Start of change /CSE007/
     A*ON38*20*****
     A*O*38*20*18**                          DSPATR(PR)
     A  16N31N20
     AAN99
     AO 16N31N47
     AAN48N18N99
     OO 16N31 99
     A N40N03                               DSPATR(UL)
     A  31                                  DSPATR(PC)
     A  31                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  03
     AON38 20N99
     AO 38 20 18
     AAN99
     AO 40 99                               DSPATR(PR)
      *                                       End of change /CSE007/
     A*                                            /S01176/
     A*/COPY WNCPYSRC,SE0040DF06
     A  38 15                           8 18'/ Ind'
     A  38 15     SMDTI1         1A  B  8 36
     A*                                                    /S01186/
     A**16N37N20                            DSPATR(UL)
     A  16N37N20
     AO 16N37N47
     AAN48N18                               DSPATR(UL)
     A*                                                    /S01186/
     A  37                                  DSPATR(PC)
     A  37                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  38 20 18
     AON38
     AO 03                                  DSPATR(PR)
     A*                                          /S01176/
     A*                                          /S01158/  /S01176/
     A  10        SDVBS2         1M  B  8 27
     A*/COPY WNCPYSRC,SE0040DF15
     A*                                                    /S01158/
     A**16N65N20                            DSPATR(UL)
      *                                     Start of change /CSE007/
     A**16N65N39*****                       DSPATR(UL)
     A***************                                      /S01158/
     A**65***********                       DSPATR(PC)
     A**65***********                       DSPATR(RI)
     A***************                       DSPATR(HI)
     A**03***********
     A***************                                      /S01158/
     A*O*39**********                        DSPATR(PR)
      *                                       End of change /CSE007/
     A**20                                  DSPATR(PR)
     A*                                                    /S01158/
     A*                                                    /S01176/
      *                                     Start of change /CSE007/
     A  16N65N39
     AAN99
     AO 99 16N55
     AAN65                                  DSPATR(UL)
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  03
     AO 39N99                               DSPATR(PR)
      *                                       End of change /CSE007/
     A*/COPY WNCPYSRC,SE0040DF16
     A**15                              8 32'Day Basis'
     A  15                              8 41'Day Basis'
     A**15        SDYBS1         1M  B  8 44
     A  15        SDYBS1         1M  B  8 53
     A*/COPY WNCPYSRC,SE0040DF17
     A*                                                    /S01176/
      *                                     Start of change /CSE007/
     A**16N32N20***                         DSPATR(UL)
     A**32*********                         DSPATR(PC)
     A**32*********                         DSPATR(RI)
     A*************                         DSPATR(HI)
     A**03*********
      *                                       End of change /CSE007/
      *                                                    /E13820/
     A**20********                          DSPATR(PR)
      *                                     Start of change /CSE007/
     A*O*39*******                           DSPATR(PR)
     A  16N32N20
     AAN99
     AO 99 16N32                            DSPATR(UL)
     A  32                                  DSPATR(PC)
     A  32                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  03
     AO 39N99                               DSPATR(PR)
      *                                       End of change /CSE007/
     A*/COPY WNCPYSRC,SE0040DF18
      *                                                    /E13820/
     A  10                              8 45'Interest Adj.'
     A*                                                    /S01176/
     A**15                              8 51'Divisor Basis'
     A  15                              8 58'Divisor Basis'
     A*                                                    /S01176/
     A  10        SIADJ          4M  B  8 65
     A  16N66                               DSPATR(UL)
     A                                      DSPATR(HI)
     A  66                                  DSPATR(PC)
     A  66                                  DSPATR(RI)
     A  03                                  DSPATR(PR)
     A*                                                    /S01176/
     A**15        SDVBS1         1M  B  8 67
     A  15        SDVBS1         1M  B  8 73
     A*/COPY WNCPYSRC,SE0040DF19
     A*                                                    /S01176/
      *                                     Start of change /CSE007/
     A**16N35N20***                         DSPATR(UL)
     A**35*********                         DSPATR(PC)
     A**35*********                         DSPATR(RI)
     A*************                         DSPATR(HI)
     A**03*********
      *                                       End of change /CSE007/
      *                                                    /E13820/
     A**20********                          DSPATR(PR)
      *                                     Start of change /CSE007/
     A*O*39********                          DSPATR(PR)
     A  16N35N20
     AAN99
     AO 99 16N35                            DSPATR(UL)
     A  35                                  DSPATR(PC)
     A  35                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  03
     AO 39N99                               DSPATR(PR)
      *                                       End of change /CSE007/
      *                                                    /E13820/
     A*                                          /S01176/
     A*/COPY WNCPYSRC,SE0040DF20
      **Start of Change CAS006
     A*N19*15***                       11  3'Contingent Liab. Ind.'                           CAS006
     A*N19*15***  SCNLI1         1A  B 11 27                                                  CAS006
     A N19 15                          16  3'Contingent Liab. Ind.'
     A N19 15     SCNLI1         1A  B 16 27
      **End of Change CAS006
     A  16N36N20                            DSPATR(UL)
     A  36                                  DSPATR(PC)
     A  36                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  19
     AON19 20
     AO 03                                  DSPATR(PR)
     A*                                              Begin /CSD006/
     A                                 12  3'Data Src'
     A N91                                  DSPATR(ND)
     A            SCSPDS        32A  B 12 12
     A N92                                  DSPATR(UL)
     A                                      DSPATR(HI)
     A  92                                  DSPATR(PC RI)
     A  03                                  DSPATR(PR)
     A N91                                  DSPATR(ND)
     A*                                              End   /CSD006/
      **Start of Change CAS006
     A**10******                       11  3'Contingent Liab. Ind.'                           CAS006
     A**10******  SCNLI2         1A  B 11 27                                                  CAS006
     A  10                             16  3'Contingent Liab. Ind.'
     A  10        SCNLI2         1A  B 16 27
      **End of Change CAS006
     A  16N36N39                            DSPATR(UL)
     A  36                                  DSPATR(PC)
     A  36                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  39
     AO 03                                  DSPATR(PR)
     A*                                          /S01176/
     A  10                              9  3'Initial Date'
     A  10        SITLD          6M  B  9 27
     A  16N67                               DSPATR(UL)
     A  67                                  DSPATR(PC)
     A  67                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  03                                  DSPATR(PR)
     A  10                              9 45'First Coupon'
     A  10        SFCPN          6M  B  9 65
     A  16N68                               DSPATR(UL)
     A  68                                  DSPATR(PC)
     A  68                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  03                                  DSPATR(PR)
      **Start of Change CAS006
     A**13******                       10  3'Initial Payment'                                 CAS006
     A**13******  SSINP         16M  B 10 27                                                  CAS006
     A  13                             11  3'Initial Payment'
     A  13        SSINP         16M  B 11 27
      **End of Change CAS006
     A*                                                    /S01158/
     A**16N29                               DSPATR(UL)
     A  16N29N39                            DSPATR(UL)
     A*                                                    /S01158/
     A  29                                  DSPATR(PC)
     A  29                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A*                                                    /S01158/
     A**03                                  DSPATR(PR)
     A  03
     AO 39                                  DSPATR(PR)
     A*                                                    /S01158/
      **Start of Change CAS006
     A**13******                       10 45'Fully Paid Price'                                CAS006
     A**13******  SSFPP         16M  B 10 65                                                  CAS006
     A  13                             11 45'Fully Paid Price'
     A  13        SSFPP         16M  B 11 65
      **End of Change CAS006
     A*                                                    /S01158/
     A**16N30                               DSPATR(UL)
     A  16N30N39                            DSPATR(UL)
     A*                                                    /S01158/
     A  30                                  DSPATR(PC)
     A  30                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A*                                                    /S01158/
     A**03                                  DSPATR(PR)
     A  03
     AO 39                                  DSPATR(PR)
     A*                                                    /S01158/
     A*                                                    /S01158/
     A*  FIELDS FOR PROCESSING TYPE 9                      /S01176/
     A*
      **Start of Change CAS006
     A  02                             10  2'Credit Risk Spread'
     A  02        #2CCRK        13A  B 10 27
     A  39                                  DSPATR(PR)
     A N39N95N97                            DSPATR(UL)
     A  95
     AO 97                                  DSPATR(PC)
     A  95
     AO 97                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  02                             10 45'Liquidity Premium'
     A  02        #2CLQP        13A  B 10 66
     A  39                                  DSPATR(PR)
     A N39N96N97                            DSPATR(UL)
     A  96
     AO 97                                  DSPATR(PC)
     A  96
     AO 97                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A**38******                       11 45'Risk Customer'                                   CAS006
     A**38******  SRSKC         10A  B 11 65                                                  CAS006
     A  38                             16 54'Risk Customer'
     A  38        SRSKC         10A  B 16 68
      **End of Change CAS006
     A  16N50                               DSPATR(UL)
     A  50                                  DSPATR(PC)
     A  50                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A N38
     AO 03                                  DSPATR(PR)
     A  38                             12 45'Drawer'
     A  38        SDRWR         10A  B 12 65
     A  16                                  DSPATR(UL HI)
     A N38
     AO 03                                  DSPATR(PR)
     A*                                            /S01176/
     A***********                                    Begin /CSE005/
      **Start of Change CAS006
     A**90******                       11 45'Business Day Convention'                         CAS006
     A**90******  SBCNV          1A  B 11 71                                                  CAS006
     A  90                             15 53'Business Day Convention'
     A  90        SBCNV          1A  B 15 77
      **End of Change CAS006
     A  90N55                               DSPATR(HI)
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A  03                                  DSPATR(PR)
     A  90N44                          12  3'Last/Next Coupon'
     A  90N44     SLCPN          6M  O 12 21DSPATR(HI)
     A  90N44                          12 28'/'
     A  90N44     SNCD           6M  O 12 30DSPATR(HI)
     A***********                                    End   /CSE005/
     A**10                             12  2'Coupon/Rate Days & Inds'
     A  10                             13  2'Coupon/Rate Days & Inds'
     A  16                                  DSPATR(UL)
     A**12                             12  3'Dividend Payment Dates'
     A  12                             13  3'Dividend Payment Dates'
     A  16                                  DSPATR(UL)
     A**11                             12 26'1'
     A  11                             13 26'1'
     A**11        SCD01          4M  B 12 29
     A  11        SCD01          4M  B 13 29
     A  16N52                               DSPATR(UL)
     A  52                                  DSPATR(PC)
     A  52                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
     A**10        SCR01          1A  B 12 34
     A  10        SCR01          1A  B 13 34
     A  16N69                               DSPATR(UL)
     A  69                                  DSPATR(PC)
     A  69                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
     A**11                             12 37'2'
     A  11                             13 37'2'
     A**11        SCD02          4M  B 12 40
     A  11        SCD02          4M  B 13 40
     A  16N53                               DSPATR(UL)
     A  53                                  DSPATR(PC)
     A  53                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
     A**10        SCR02          1A  B 12 45
     A  10        SCR02          1A  B 13 45
     A  16N70                               DSPATR(UL)
     A  70                                  DSPATR(PC)
     A  70                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
     A**11                             12 49'3'
     A  11                             13 49'3'
     A**11        SCD03          4M  B 12 52
     A  11        SCD03          4M  B 13 52
     A  16N54                               DSPATR(UL)
     A  54                                  DSPATR(PC)
     A  54                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
     A**10        SCR03          1A  B 12 57
     A  10        SCR03          1A  B 13 57
     A  16N71                               DSPATR(UL)
     A  71                                  DSPATR(PC)
     A  71                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
     A**11                             12 60'4'
     A  11                             13 60'4'
     A**11        SCD04          4M  B 12 63
     A  11        SCD04          4M  B 13 63
     A  16N55                               DSPATR(UL)
     A  55                                  DSPATR(PC)
     A  55                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
     A**10        SCR04          1A  B 12 68
     A  10        SCR04          1A  B 13 68
     A  16N72                               DSPATR(UL)
     A  72                                  DSPATR(PC)
     A  72                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
     A**11                             12 71'5'
     A  11                             13 71'5'
     A**11        SCD05          4M  B 12 74
     A  11        SCD05          4M  B 13 74
     A  16N56                               DSPATR(UL)
     A  56                                  DSPATR(PC)
     A  56                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
     A**10        SCR05          1A  B 12 79
     A  10        SCR05          1A  B 13 79
     A  16N73                               DSPATR(UL)
     A  73                                  DSPATR(PC)
     A  73                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
     A**11                             13  4'6'
     A  11                             14  4'6'
     A**11        SCD06          4M  B 13  7
     A  11        SCD06          4M  B 14  7
     A  16N57                               DSPATR(UL)
     A  57                                  DSPATR(PC)
     A  57                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
     A**10        SCR06          1A  B 13 12
     A  10        SCR06          1A  B 14 12
     A  16N74                               DSPATR(UL)
     A  74                                  DSPATR(PC)
     A  74                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
     A**11                             13 15'7'
     A  11                             14 15'7'
     A**11        SCD07          4M  B 13 18
     A  11        SCD07          4M  B 14 18
     A  16N58                               DSPATR(UL)
     A  58                                  DSPATR(PC)
     A  58                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
     A**10        SCR07          1A  B 13 23
     A  10        SCR07          1A  B 14 23
     A  16N75                               DSPATR(UL)
     A  75                                  DSPATR(PC)
     A  75                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
     A**11                             13 26'8'
     A  11                             14 26'8'
     A**11        SCD08          4M  B 13 29
     A  11        SCD08          4M  B 14 29
     A  16N59                               DSPATR(UL)
     A  59                                  DSPATR(PC)
     A  59                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
     A**10        SCR08          1A  B 13 34
     A  10        SCR08          1A  B 14 34
     A  16N76                               DSPATR(UL)
     A  76                                  DSPATR(PC)
     A  76                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
     A**11                             13 37'9'
     A  11                             14 37'9'
     A**11        SCD09          4M  B 13 40
     A  11        SCD09          4M  B 14 40
     A  16N60                               DSPATR(UL)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
     A**10        SCR09          1A  B 13 45
     A  10        SCR09          1A  B 14 45
     A  16N77                               DSPATR(UL)
     A  77                                  DSPATR(PC)
     A  77                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
     A**11                             13 48'10'
     A  11                             14 48'10'
     A**11        SCD10          4M  B 13 52
     A  11        SCD10          4M  B 14 52
     A  16N61                               DSPATR(UL)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
     A**10        SCR10          1A  B 13 57
     A  10        SCR10          1A  B 14 57
     A  16N78                               DSPATR(UL)
     A  78                                  DSPATR(PC)
     A  78                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
     A**11                             13 59'11'
     A  11                             14 59'11'
     A**11        SCD11          4M  B 13 63
     A  11        SCD11          4M  B 14 63
     A  16N62                               DSPATR(UL)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
     A**10        SCR11          1A  B 13 68
     A  10        SCR11          1A  B 14 68
     A  16N79                               DSPATR(UL)
     A  79                                  DSPATR(PC)
     A  79                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
     A**11                             13 70'12'
     A  11                             14 70'12'
     A**11        SCD12          4M  B 13 74
     A  11        SCD12          4M  B 14 74
     A  16N63                               DSPATR(UL)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
     A**10        SCR12          1A  B 13 79
     A  10        SCR12          1A  B 14 79
     A*                                            /S01176/
     A  16N80                               DSPATR(UL)
     A  80                                  DSPATR(PC)
     A  80                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A***********                                    Begin /CSE005/
     A**03                                  DSPATR(PR)
     A  03
     AON45                                  DSPATR(PR)
     A***********                                    End   /CSE005/
      **Start of Change CAS006
     A**10******                       15  5'Rate Change Frequency'                           CAS006
     A**10******  SRCFQ          1A  B 15 28                                                  CAS006
     A  10                             15  3'Rate Change Frequency'
     A  10        SRCFQ          1A  B 15 26
      **End of Change CAS006
     A  16N81 21                            DSPATR(UL)
     A  81                                  DSPATR(PC)
     A  81                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  03
     AON21                                  DSPATR(PR)
      **Start of Change CAS006
     A**10******                       15 46'Next Change Date'                                CAS006
     A**10******  SNCHD          6M  B 15 66                                                  CAS006
     A  10                             15 28'Next Change Date'
     A  10        SNCHD          6M  B 15 45
      **End of Change CAS006
     A  16N82 21                            DSPATR(UL)
     A  82                                  DSPATR(PC)
     A  82                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  03
     AON21                                  DSPATR(PR)
     A*                                              /*S01220 START*/
     A*/COPY WNCPYSRC,SE0040DF28
      **Start of Change CAS006
     A**33******                       16  5'Issue Amount'                                    CAS006
     A**33******  SISSA         11M  B 16 27                                                  CAS006
     A  33                             16 46'Issue Amount'
     A  33        SISSA         11M  B 16 60
      **End of Change CAS006
     A N43 33                               DSPATR(UL)
     A  43 33                               DSPATR(RI)
     A  43 33                               DSPATR(PC)
     A     33                               DSPATR(HI)
     A  03                                  DSPATR(PR)
     A*                                              /*S01220 END*/
     A*/COPY WNCPYSRC,SE0040DF29
     A                                 17  5'Settlement Depots'
     A                                      DSPATR(UL)
     A                                 17 25'1'
     A            SCSNM1        10A  O 17 27DSPATR(HI)
     A                                 17 46'Security Reference'
     A*FIELD RENAMED BY S01176
     A************SD1SR          9A  B 17 66
     A            SDASR         12A  B 17 66
     A*                                              Begin /102342/
     A*N22********                          DSPATR(UL)
     A N22N01                               DSPATR(UL)
     A*                                              End   /102342/
     A  22                                  DSPATR(PC)
     A  22                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A*                                              Begin /102342/
     A**03********                          DSPATR(PR)
     A  03
     AO 01                                  DSPATR(PR)
     A*                                              End   /102342/
     A                                 18 25'2'
     A            SCSNM2        10A  O 18 27DSPATR(HI)
     A                                 18 46'Security Reference'
     A*FIELD RENAMED BY S01176
     A************SD2SR          9A  B 18 66
     A            SDCSR         12A  B 18 66
     A N23                                  DSPATR(UL)
     A  23                                  DSPATR(PC)
     A  23                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  03                                  DSPATR(PR)
     A                                 19 25'3'
     A            SCSNM3        10A  O 19 27DSPATR(HI)
     A                                 19 46'Security Reference'
     A*FIELD RENAMED BY S01176
     A************SD3SR          9A  B 19 66
     A            SDDSR         12A  B 19 66
     A*                                              Begin /102342/
     A*N24********                          DSPATR(UL)
     A N24N05                               DSPATR(UL)
     A*                                              End   /102342/
     A  24                                  DSPATR(PC)
     A  24                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A*                                              Begin /102342/
     A**03********                          DSPATR(PR)
     A  03
     AO 05                                  DSPATR(PR)
     A*                                              End   /102342/
     A*/COPY WNCPYSRC,SE0040DF35
     A                                 20  5'Market Centre'
     A            SSMCC          2A  B 20 23
     A***********                                          /S01158/
     A**16N25                               DSPATR(UL)
     A**16N25N39*                           DSPATR(UL)                  /E22048/
     A*                                                   START /E23282/
     A**16N25*******************************DSPATR(UL)                    E23282
     A  16N25N03                            DSPATR(UL)
     A*                                                     END /E23282/
     A***********                                                       /E22048/
     A*                                                    /S01158/
     A  25                                  DSPATR(PC)
     A  25                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A*                                                    /S01158/
     A**03                                  DSPATR(PR)
     A**03*******                                                       /E22048
     A*O39*******                           DSPATR(PR)                  /E22048/
     A  03                                  DSPATR(PR)
     A***********                                                       /E22048/
     A*                                                    /S01158/
     A            SMKTN         20A  O 20 27DSPATR(HI)
     A                                 20 49'Convertible Ind'
     A            SSCVI          1A  B 20 66
     A*/COPY WNCPYSRC,SE0040DF21
     A*                                                   START /E23282/
     A*N26*48*******************************DSPATR(UL)                    E23282
      *                                     Start of change /CSE007/
     A*N26*48N03***                         DSPATR(UL)
     A*************                                         END /E23282/
     A**26*********                         DSPATR(PC)
     A**26*********                         DSPATR(RI)
     A*************                         DSPATR(HI)
     A**03*********
     A*ON48********                          DSPATR(PR)
     A N26 48N03
     AAN99
     AON26N03 99                            DSPATR(UL)
     A  26                                  DSPATR(PC)
     A  26                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  03
     AON48N99                               DSPATR(PR)
      *                                       End of change /CSE007/
     A*/COPY WNCPYSRC,SE0040DF22
     A                                 21  5'Price Basis'
     A            SSPBS          1A  B 21 23
     A*                                                   START /E23282/
     A*N27*48*******************************DSPATR(UL)                    E23282
     A N27 48N03                            DSPATR(UL)
     A*                                                     END /E23282/
     A  27                                  DSPATR(PC)
     A  27                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  03
     AON48                                  DSPATR(PR)
     A                                 21 27'Trade Basis'
     A            SSTBS          1A  B 21 45CHGINPDFT
     A                                      DSPATR(HI PR)
     A                                 21 49'Yield Basis'
     A            SSYBS          2A  B 21 66
     A*                                                   START /E23282/
     A*N28*48*******************************DSPATR(UL)                    E23282
     A N28 48N03                            DSPATR(UL)
     A*                                                     END /E23282/
     A  28                                  DSPATR(PC)
     A  28                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A  03
     AON48                                  DSPATR(PR)
      *                                              Begin /S01397/
     A  06                             22  2'Compounding Frequency'
     A  06        SCMFQ          2A  B 22 24
     A N41N46N03
     AAN47                                  DSPATR(UL)
     A  41                                  DSPATR(PC RI)
     A                                      DSPATR(HI)
     A  03
     A  46
     AO 47                                  DSPATR(PR)
     A  06                             22 27'Discount Basis'
     A  06        SDSCB          1A  B 22 45
     A N42N46N03
     AAN47                                  DSPATR(UL)
     A  42                                  DSPATR(PC RI)
     A                                      DSPATR(HI)
     A  03
     AO 46
     AO 47                                  DSPATR(PR)
     A  06                             22 49'Discount Last Coupon'
     A  06        SDSLC          1A  B 22 70
     A N43N46N03
     AAN47                                  DSPATR(UL)
     A  43                                  DSPATR(PC RI)
     A                                      DSPATR(HI)
     A  03
     AO 46
     AO 47                                  DSPATR(PR)
      *                                              End   /S01397/
     A  09        ERRMSG        76A  O 23  2DSPATR(RI)
      **                                            Start  /104633/
     A******                           24  3'Press F3 to end job, F12 for Previ-
     A******                                ous Screen or F5 for Initial Screen-
     A******                                '
     A                                 24  2'F3=Exit'
      **                                            Start  /155622/
     A******                           24 12'F5=Initial Screen   F12=Previous'
     A N93                             24 12'F5=Initial Screen   F12=Previous'
      **                                            End    /155622/
      **                                            End    /104633/
     A          R SE0040F3
     A*            14:19:59    SENB        REL-R08M00  5714-UT1
     A*
     A*/COPY WNCPYSRC,SE0040DF02
     A*
     A*                                                    /E19031/
     A********                              CF02(02 'Previous screen')
     A*                                              Begin /102342/
     A********                              CF12(02 'Previous screen')
     A                                      CF12
     A*                                              End   /102342/
     A*                                                    /E19031/
     A*                                                    /S01176/
     A**50****                              ROLLDOWN(08 'Rolldown requested')
     A  47                                  ROLLDOWN(08 'Rolldown requested')
     A*                                                    /S01176/
     A*                                              Begin /S01117/
     A*                                                    /*S01199*/
     A*                                                    /*S01199*/
     A*                                              Begin /CPB001/
     A*                                              End   /CPB001/
     A*                                              Begin /183604/
     A*                                              End   /183604/
     A*                                              End   /S01117/
     A                                  1 30'SECURITIES INPUT'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  1 51TIME
     A            RUNA           7A  O  1 61
     A                                  1 71'WSID'
     A            WSID           3A  O  1 76
     A                                  4 11'Security Shortname'
     A            SSESN         10A  O  4 32DSPATR(HI)
     A                                  4 44'New Issue Information'
     A                                  6 10'Issue Date'
     A            SISSD          6M  B  6 40
     A*                                                   START /E23282/
     A*N51**********************************DSPATR(UL)                    E23282
     A N51N03                               DSPATR(UL)
     A*                                                     END /E23282/
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A                                      DSPATR(HI)
     A  03                                  DSPATR(PR)
     A                                  7 10'Issue Price'
     A            SISSP         16M  B  7 40
     A*                                                   START /E23282/
     A*N52**********************************DSPATR(UL)                    E23282
     A N52N03                               DSPATR(UL)
     A*                                                     END /E23282/
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A                                      DSPATR(HI)
     A  03                                  DSPATR(PR)
     A                                  8 10'Lead Manager'
     A            SLMGR         10A  B  8 40
     A*                                                   START /E23282/
     A*N53**********************************DSPATR(UL)                    E23282
     A N53N03                               DSPATR(UL)
     A*                                                     END /E23282/
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A                                      DSPATR(HI)
     A  03                                  DSPATR(PR)
     A*/COPY WNCPYSRC,SE0040DF30
     A                                  9 10'Issue Amount'
     A            SISSA         11M  B  9 40
     A*                                                   START /E23282/
     A*N54**********************************DSPATR(UL)                    E23282
     A N54N03                               DSPATR(UL)
     A*                                                     END /E23282/
     A  54                                  DSPATR(RI)
     A  54                                  DSPATR(PC)
     A                                      DSPATR(HI)
     A*                                              /*S01220 START*/
     A**03********                          DSPATR(PR)
     A  34
     AO 03                                  DSPATR(PR)
     A*                                              /*S01220 END*/
     A*/COPY WNCPYSRC,SE0040DF31
     A                                 10 10'Total Underwritten'
     A*/COPY WNCPYSRC,SE0040DF42
     A            STOTU         11M  B 10 40
     A*                                                   START /E23282/
     A*N55**********************************DSPATR(UL)                    E23282
     A N55N03                               DSPATR(UL)
     A*                                                     END /E23282/
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A                                      DSPATR(HI)
     A  03                                  DSPATR(PR)
     A                                 11 10'Allocation Requested'
     A            SALRQ         11M  B 11 40
     A*                                                   START /E23282/
     A*N56**********************************DSPATR(UL)                    E23282
     A N56N03                               DSPATR(UL)
     A*                                                     END /E23282/
     A  56                                  DSPATR(RI)
     A  56                                  DSPATR(PC)
     A                                      DSPATR(HI)
     A  03                                  DSPATR(PR)
     A                                 12 10'Allocation Received'
     A            SALRC         11M  B 12 40
     A*                                                   START /E23282/
     A*N57**********************************DSPATR(UL)                    E23282
     A N57N03                               DSPATR(UL)
     A*                                                     END /E23282/
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(PC)
     A                                      DSPATR(HI)
     A  03                                  DSPATR(PR)
     A                                 13 10'Management Fees Due'
     A            SMGFD         12M  B 13 40
     A*                                                   START /E23282/
     A*N58**********************************DSPATR(UL)                    E23282
     A N58N03                               DSPATR(UL)
     A*                                                     END /E23282/
     A  58                                  DSPATR(RI)
     A  58                                  DSPATR(PC)
     A                                      DSPATR(HI)
     A  03                                  DSPATR(PR)
     A                                 14 10'Management Fees Received'
     A            SMGRC         12M  B 14 40
     A*                                                   START /E23282/
     A*N59**********************************DSPATR(UL)                    E23282
     A N59N03                               DSPATR(UL)
     A*                                                     END /E23282/
     A  59                                  DSPATR(RI)
     A  59                                  DSPATR(PC)
     A                                      DSPATR(HI)
     A  03                                  DSPATR(PR)
     A                                 15 10'Underwriting Fees Due'
     A            SUNFD         12M  B 15 40
     A*                                                   START /E23282/
     A*N60**********************************DSPATR(UL)                    E23282
     A N60N03                               DSPATR(UL)
     A*                                                     END /E23282/
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A                                      DSPATR(HI)
     A  03                                  DSPATR(PR)
     A                                 16 10'Underwriting Fees Received'
     A            SUNFR         12M  B 16 40
     A*                                                   START /E23282/
     A*N61**********************************DSPATR(UL)                    E23282
     A N61N03                               DSPATR(UL)
     A*                                                     END /E23282/
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                      DSPATR(HI)
     A  03                                  DSPATR(PR)
     A                                 17 10'Fee Currency'
     A            SFECY          3A  B 17 40
     A*                                                   START /E23282/
     A*N62**********************************DSPATR(UL)                    E23282
     A N62N03                               DSPATR(UL)
     A*                                                     END /E23282/
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                      DSPATR(HI)
     A  03                                  DSPATR(PR)
      **                                            Start  /CPB001/
     A                                 19 10'Principal Paying agent'
     A N25                                  DSPATR(ND)
     A            SPPAG          6A  B 19 40
     A  26                                  DSPATR(RI PC)
     A N26N04                               DSPATR(UL)
     A                                      DSPATR(HI)
     A N25                                  DSPATR(ND)
     A  04                                  DSPATR(PR)
     A*
     A                                 19 50'Guarantor'
     A N25                                  DSPATR(ND)
     A            SGUAR          6A  B 19 70
     A  27                                  DSPATR(RI PC)
     A N27N04                               DSPATR(UL)
     A                                      DSPATR(HI)
     A N25                                  DSPATR(ND)
     A  04                                  DSPATR(PR)
     A*
     A                                 20 10'Weighting Code'
     A N25                                  DSPATR(ND)
     A            SWEIC          2A  B 20 40
     A  28                                  DSPATR(RI PC)
     A N28N04                               DSPATR(UL)
     A                                      DSPATR(HI)
     A N25                                  DSPATR(ND)
     A  04                                  DSPATR(PR)
     A*
     A                                 20 50'Nature of Account'
     A N25                                  DSPATR(ND)
     A            SNATU          3A  B 20 70
     A  29                                  DSPATR(RI PC)
     A N29N04                               DSPATR(UL)
     A                                      DSPATR(HI)
     A N25                                  DSPATR(ND)
     A  04                                  DSPATR(PR)
      **                                            End    /CPB001/
      **                                            Start  /183604/
     A                                 21 10'PB Instrument Type'
     A N25                                  DSPATR(ND)
     A            SPBIT          3A  B 21 40
     A  30                                  DSPATR(RI PC)
     A N30N31N04                            DSPATR(UL)
     A                                      DSPATR(HI)
     A N25                                  DSPATR(ND)
     A  31
     AO 04                                  DSPATR(PR)
     A*
      **                                            End    /183604/
     A  09        ERRMSG        76A  O 23  2DSPATR(RI)
      **                                            Start  /104633/
     A******                           24  3'Press F3 to end job, F12 for previ-
     A******                                ous Screen or F5 for Initial Screen-
     A******                                '
     A                                 24  2'F3=Exit'
     A                                 24 12'F5=Initial Screen   F12=Previous'
      **                                            End    /104633/
