      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas SE Trades Awaiting Authoriztn Maint.')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Securities Trading Module                            *
     A*                                                               *
     A***DSPF/SE0190DF*-*TRADES*AUTHORISATION*BY*RE-ENTRY**************   081086
     A*  DSPF/SE0190DF - TRADES AWAITING AUTHORISATION                *   081086
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. 104199             DATE 25NOV96               *
     A*  PREV AMEND NO. 104633             DATE 18JUL96               *
     A*                 092728             DATE 06JUL95               *
     A*                 084981             DATE 19APR95               *
     A*                 084562             DATE 11APR95               *
     A*                 084925             DATE 15MAR95                  *
     A*                 081086             DATE 07MAR95               *
     A*                 079034             DATE 06DEC94               *
     A*                 S01117             DATE 22FEB91               *
     A*                 S01269             DATE 03JUL90               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
     A*  104199  -  Add program name to DSPF for GUI identification      *
     A*  104633  - GUI Amendments to DSPF with non-standard footers   *
     A*  092728  - Remove fixe 084562 which cause problem during 1st  *
     A*            call of pgm - reset the subfile using RESET code   *
     A*            in RPG program instead.                            *
     A*  084981  - Allow more than one selection in a subfile         *
     A*  084562  - Changed to blank out a subfile message that remains*
     A*            on screen even after program is exited.            *
     A*  084925  - Hold the details of the trade currency as hidden   *
     A*            fields on the subfile.                             *
     A*            They is used later in program for validating       *
     A*            Authorisation limits.                              *
     A*  081086  -  Correct name in header box, and specify correct   *
     A*             help tag, as the Global Help Tag currently goes to*
     A*             Trade Authorisation by Re-entry help text         *
     A*  079034  -  Add message handling subfile processing           *
     A*  S01117  -  MULTIBRANCHING                                    *
     A*  S01269  -  NEW SCREEN FOR TRADE AUTHORISATION                *
     A*                                                               *
     A*****************************************************************
     A                                      PRINT(MPRINT)
     A*                                              Begin /081086/
     A*                                               End  / 081086/
     A                                      CF03(03 'End of job')
     A          R SE0190S2                  OVERLAY
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                      ROLLUP(07 'Rollup requested')
     A*                                              Begin /084981/
     A***********                           ROLLDOWN(08 'Rollup requested')
     A*                                              End   /084981/
     A*                                              Begin /S01117/
     A*                                              End   /S01117/
      *                                                         /104199/
     A                                  1  6'SE0190'
      *                                                         /104199/
     A                                  1 24'TRADES AWAITING AUTHORISATION'
     A                                      DSPATR(HI UL)
     A            BJMRDT         7A  O  1 55
     A                                  1 63TIME
     A                                  1 72'WID'
     A            WSID           3A  O  1 77
     A*                                              Begin /084981/
     A***********                       3 52'REVIEW FROM TRADE :'
     A*********** CTRAD          6   I  3 73DSPATR(HI UL PC)
     A***********                       5  6'SECURITY'
     A***********                       5 19'TRADE REF/TYPE'
     A***********                       5 34'COUNTERVALUE'
     A***********                       5 50'NOMINAL'
     A***********                       5 62'NOM.CCY'
     A***********                       5 70'VALUE DATE'
     A***********                       6  3'LAST ACT. TYPE'
     A***********                           DSPATR(UL)
     A***********                       6 19'LAST ACT.USER'
     A***********                           DSPATR(UL)
     A***********                       6 33'LAST ACT DATE'
     A***********                           DSPATR(UL)
     A***********                       6 48'LAST ACT TIME'
     A***********                           DSPATR(UL)
     A***********                       6 62'       '
     A***********                           DSPATR(UL)
     A***********                       6 70'          '
     A***********                           DSPATR(UL)
     A*                                              End   /084981/
     A          R SE0190S3                  SFL
     A  09                                  SFLNXTCHG
      *                                    Start of change /084925/
      * Hold number of dec. places of currency as hidden fld
      * also multiply/divide indicator
     A            TNBDP          1  0H
     A            TMDIN          1   H
      *                                      End of change /084925/
     A            SELF           1   B  8  2DSPATR(HI)
     A N20                                  DSPATR(UL)
     A  20                                  DSPATR(RI PC)
     A            TDSS          10   O  8  5DSPATR(HI)
     A*********   A6MDIN         1   B  8 18DSPATR(ND PR)               084925
     A            TDRF           6   O  8 20DSPATR(HI)
     A                                  8 27'/'
     A                                      DSPATR(HI)
     A            TDTP           2   O  8 29DSPATR(HI)
     A            TCTR13        13   O  8 34DSPATR(HI)
     A            NOML13        13   O  8 49DSPATR(HI)
     A            TNMC           3   O  8 65DSPATR(HI)
     A            TDVDD          7   O  8 72DSPATR(HI)
     A            TATYPL         9   O  9  5DSPATR(HI)
     A            TAUSRD        10   O  9 19DSPATR(HI)
     A            TADTD          7   O  9 36DSPATR(HI)
     A            TATML          8   O  9 50DSPATR(HI)
     A                                 10  2' '
     A          R SFLCTLR                   SFLCTL(SE0190S3)
     A                                      OVERLAY
     A*                                              Begin /084981/
     A***********                           SFLSIZ(4)
     A                                      SFLSIZ(5)
     A*                                              End   /084981/
     A                                      SFLPAG(4)
     A                                      SFLDSP
     A                                      SFLDSPCTL
     A  01                                  SFLCLR
     A  67                                  SFLEND
     A*                                              Begin /084562/
     A*                                              Begin /092728/
     A*N69********                          SFLMSG(' ')
     A*                                                End /092728/
     A*                                                End /084562/
     A  69                                  SFLMSGID(CPF5203 QCPFMSG)
     A N12                                  ROLLUP(07)
     A*                                              Begin /084981/
     A*N12*******                           ROLLDOWN(08)
     A*                                              End   /084981/
     A            DSPREC         4  0H      SFLRCDNBR
     A*                                              Begin /084981/
     A                                  3 52'REVIEW FROM TRADE :'
     A            CTRAD          6   I  3 73DSPATR(HI UL PC)
     A                                  5  6'SECURITY'
     A                                  5 19'TRADE REF/TYPE'
     A                                  5 34'COUNTERVALUE'
     A                                  5 50'NOMINAL'
     A                                  5 62'NOM.CCY'
     A                                  5 70'VALUE DATE'
     A                                  6  3'LAST ACT. TYPE'
     A                                      DSPATR(UL)
     A                                  6 19'LAST ACT.USER'
     A                                      DSPATR(UL)
     A                                  6 33'LAST ACT DATE'
     A                                      DSPATR(UL)
     A                                  6 48'LAST ACT TIME'
     A                                      DSPATR(UL)
     A                                  6 62'       '
     A                                      DSPATR(UL)
     A                                  6 70'          '
     A                                      DSPATR(UL)
     A*                                              End   /084981/
     A          R TRAIL                     OVERLAY
     A  80        ERRMSG        80     22  1DSPATR(RI)
      **                                            Start  /104633/
     A******                           23  2'F3-EXIT, ROLLUP, ROLLDOWN'
     A                                 23  2'F3=Exit   Rollup/Rolldown'
      **                                            End    /104633/
     A          R NORECS                    OVERLAY
     A*                                              Begin /084981/
     A                                  3 52'REVIEW FROM TRADE :'
     A            CTRAD          6   I  3 73DSPATR(HI UL PC)
     A                                  5  6'SECURITY'
     A                                  5 19'TRADE REF/TYPE'
     A                                  5 34'COUNTERVALUE'
     A                                  5 50'NOMINAL'
     A                                  5 62'NOM.CCY'
     A                                  5 70'VALUE DATE'
     A                                  6  3'LAST ACT. TYPE'
     A                                      DSPATR(UL)
     A                                  6 19'LAST ACT.USER'
     A                                      DSPATR(UL)
     A                                  6 33'LAST ACT DATE'
     A                                      DSPATR(UL)
     A                                  6 48'LAST ACT TIME'
     A                                      DSPATR(UL)
     A                                  6 62'       '
     A                                      DSPATR(UL)
     A                                  6 70'          '
     A                                      DSPATR(UL)
     A*                                              End   /084981/
     A                                 12 22'NO TRADES ARE AWAITING +
     A                                      AUTHORISATION'
     A                                      DSPATR(RI)
     A*                                              Begin /079034/
     A          R SE0190S4                  TEXT('Program messages')
     A                                      SFL
     A                                      SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            PROGRM                    SFLPGMQ
      *
     A          R SE0190C4                  TEXT('Program messages')
     A                                      SFLCTL(SE0190S4)
     A                                      OVERLAY
     A                                      SFLPAG(01)
     A                                      SFLSIZ(50)
     A                                      SFLINZ
     A                                      SFLDSP
     A                                      SFLDSPCTL
     A  71                                  SFLCLR
     A  70
     AON70                                  SFLEND
     A            PROGRM                    SFLPGMQ
     A*                                              End   /079034/
