      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas SE Positions by Issuer Enquiry')
     A********************************************************************
     A*                                                                  *
     A*  Midas - Securities Trading Module
     A*                                                                  *
     A*   SE0265DF - POSITIONS BY ISSUER ENQUIRY                         *
     A*                                                                  *
      *  (c) Finastra International Limited 2001                      *
     A*                                                                  *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CAC005             Date 23Nov98               *
      *                 112563             Date 21Jan97               *
      *                  S01117             Date 27Nov90              *  *
     A*                  E23188             DATE 10AUG90                 *
     A*                  E23189             DATE 06AUG90                 *
     A*                  S01253             DATE 17APR90                 *
     A*                  S01199             DATE 03/08/89                *
     A*                  S01179             DATE 21/10/88                *
     A*                                                                  *
     A*------------------------------------------------------------------*
     A*                                                                  *
      *  MD046248 - Finastra Rebranding                               *
      *   CAC005 - Profit Centre Accounting                           *
     A*   112563  -  Header and footer changes required for GUI          *
     A*              Multilanguage support.                              *
     A*   S01117  -  MULTIBRANCHING                                      *
     A*   E23188  -  Cursor not at input field after roll-up/down.       *
     A*   E23189  -  'F5:clear screen' not 'F5:refresh screen'.          *
     A*   S01253  -  RECOMPILED FOR MULTILANGUAGE SCREENS                *
     A*   S01199 - HELP SYSTEM.                                          *
     A*   S01179  -  AS400 CONVERSION                                    *
     A*              (REPLACE 4TGAID KEYWORD WITH FUNCTION KEYS AND      *
     A*              INDICATORS AS IT IS NOT SUPPORTED ON THE AS/400)    *
     A*                                                                  *
     A********************************************************************
     A*         /////////////////////////////////////////
     A*        // WARNING: When creating this display //
     A*       //   file, take options RSTDSP(*YES)   //
     A*      //                       SHARE (*YES)  //
     A*     /////////////////////////////////////////
     A*****************************************************************
     A                                      INDARA
     A                                      CHGINPDFT
     A***********                                                     /S01179/
     A                                      VLDCMDKEY(10 'ANY VALID KEY')
     A*                                              Begin /S01199/
     A*                                              End   /S01199/
     A                                      PRINT(MPRINT)
     A**********                            ROLLUP                     /S01179/
     A**********                            ROLLDOWN                   /S01179/
     A                                      ROLLUP(20)
     A                                      ROLLDOWN(21)
     A                                      CF03
     A                                      CF12
     A                                      CF05
     A                                      CF06
     A                                      CF09
     A*                                              Begin /S01199/
     A*                                              Begin /S01117/
     A*                                              End   /S01117/
     A*                                              End   /S01199/
     A          R SE0265S0                  SFL
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            SELECT         1A  B  7  2DSPATR(HI)
     A*                                              Begin /E23188/
     A*N08**********************************DSPATR(UL)
     A N08                                  DSPATR(UL PC)
     A*                                              End   /E23188/
     A  08                                  DSPATR(PR)
     A            SLINE         77A  O  7  4DSPATR(HI)
     A            SSESN         10A  H
     A            STDBR          3A  H
     A            SPCTN          6A  H
     A            STDBK          2A  H
     A          R SE0265C0                  SFLCTL(SE0265S0)
     A                                      TEXT('SUBFILE CONTROL')
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A                                      OVERLAY
     A**********                            RTGAID(1)                /S01179/
     A N02                                  SFLDSPCTL
     A N02N03                               SFLDSP
     A  02                                  SFLCLR
     A  05                                  SFLEND
     A  06                                  SFLMSG('Roll up or down is beyond +
     A                                      first or last record in file.' 06)
     A            SFLREC         4S 0H      SFLRCDNBR
     A  04                             21 25'*** No Details to display ***'
     A                                      DSPATR(HI)
     A  42        ERMSG         79   O 21  2DSPATR(HI RI)
     A*                                              Begin /E23189/
     A***********                      22  2'Enter F3:end, F12:previous e-
     A***********                           nquiry, F5:refresh screen, F-
     A***********                           6:Shortname'
     A**                                             Begin /112563/
     A***********                      22  2'Enter F3:end, F12:previous e-
     A***********                           nquiry, F5:clear screen, F-
     A***********                           6:Shortname'
     A*                                              End   /E23189/
     A***********                      23  2'Enquiry, F9:initial enquiry, R-
     A***********                           ollup/down:next/previous screen, o-
     A***********                           r enter'
     A***********                      24  2'Issuer'
     A*********** ISSUER        10A  B 24  9DSPATR(HI)
     A                                 22  2'F3=Exit  F12=Previous  F5=Clear  -
     A                                      F6=Shortname Enquiry  F9=Initial -
     A                                      Enquiry'
     A                                 23  2'Issuer'
     A            ISSUER        10A  B 23  9DSPATR(HI)
     A**                                             End   /112563/
     A N41                                  DSPATR(UL)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A**                                             Begin /112563/
     A***********                      24 20', Customer'
     A*********** CUSTMR        10A  B 24 31DSPATR(HI)
     A                                 23 21'Customer'
     A            CUSTMR        10A  B 23 30DSPATR(HI)
     A**                                             End   /112563/
     A N44                                  DSPATR(UL)
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A**                                             Begin /112563/
     A* 07 ******                      24 42',Branch'
     A* 07 ****** BRANCH         3A  B 24 50DSPATR(HI)
      *                                              Begin /CAC005/
     A**07*******                      23 42'Branch'
     A  07                             23 41'Br'
     A**07******* BRANCH         3A  B 23 49DSPATR(HI)
     A  07        BRANCH         3A  B 23 44DSPATR(HI)
      *                                              End   /CAC005/
     A**                                             End   /112563/
     A  07N43                               DSPATR(UL)
     A  07 43                               DSPATR(RI)
     A  07 43                               DSPATR(PC)
     A N07                                  DSPATR(PR)
     A**                                             Begin /112563/
     A***********                      24 54', Book'
     A*********** BOOKIN         2A  B 24 61DSPATR(HI)
      *                                              Begin /CAC005/
     A***********                      23 55'Book'
     A                                 23 48'Bk'
     A*********** BOOKIN         2A  B 23 60DSPATR(HI)
     A            BOOKIN         2A  B 23 51DSPATR(HI)
      *                                              End   /CAC005/
     A**                                             End   /112563/
     A N45                                  DSPATR(UL)
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
      *                                              Begin /CAC005/
     A  61                             23 54'Pctr'
     A  61        PRFC           4A  B 23 59DSPATR(HI)
     A  61N62                               DSPATR(UL)
     A  61 62                               DSPATR(RI PC)
      *                                              End   /CAC005
     A**                                             Begin /112563/
     A***********                      24 64', Ccy'
     A*********** EXPCCY         3A  B 24 70DSPATR(HI)
     A                                 23 65'Ccy'
     A            EXPCCY         3A  B 23 69DSPATR(HI)
     A**                                             End   /112563/
     A N46                                  DSPATR(UL)
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A**                                             Begin /112563/
     A***********                      24 74',U/F'
     A*********** FACTRD         1A  B 24 79DSPATR(HI)
     A                                 23 75'U/F'
     A            FACTRD         1A  B 23 79DSPATR(HI)
     A**                                             End   /112563/
     A N47                                  DSPATR(UL)
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A*
     A          R SE0265F0                  TEXT('TOP OF SCREEN')
     A                                  1  2'POSITIONS BY ISSUER'
     A                                      DSPATR(HI UL)
     A  60                              1 26'Group parent'
     A  60        SPAREN         6A  O  1 39
     A**                                             Begin /112563/
     A                                  1 47'SE0265'
     A**                                             End   /112563/
     A            RUNA           7A  O  1 55
     A                                  1 64TIME
     A                                  1 74'WID'
     A            WSID           3A  O  1 78
     A                                  2  4'Issuer'
     A            SISNO          6A  O  2 11DSPATR(HI)
     A            SIRNM         20A  O  2 24DSPATR(HI)
     A            SIRTN         10A  O  2 45DSPATR(HI)
     A            SFACT         10A  O  2 61DSPATR(HI)
     A            SECCY          3A  O  2 76DSPATR(HI)
     A                                  4  4'Security'
     A                                  4 16'Customer/'
     A                                  4 35'Trade Date'
     A                                  4 50'Security Ccy'
     A                                  4 68'Exposure Ccy'
     A  07                              5  3'Branch'
     A                                  5 10'Market'
      *                                              Begin /CAC005/
     A N61                              5 17'Bk'
     A***********                       5 18'Book'
     A  61                              5 17'Bk/Pctr'
      *                                              End   /CAC005/
     A                                  5 26'Ccy'
     A                                  5 37'Nominal'
     A                                  5 54'Value'
     A                                  5 63'B/V'
     A                                  5 68'Value (000s)'
