      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas SE Customer/Broker Defaults Maint.')
     F****************************************************************
     F*                                                              *
     F*  Midas - Securities Trading Module
     F*                                                              *
     F*  SE3153DF - CUSTOMER/BROKER DETAIL CHARGES FILE MAINTENANCE  *
     F*                                                              *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     F*                                                              *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. 112563            DATE 22JAN97               *
     F*  PREV AMEND NO. S01496            DATE 27OCT94               *
     F*                 S01117            DATE 17APR91               *
     F*                 S01253            DATE 17APR90               *
     F*                 S01199            DATE 03AUG89               *
     F*                 S01176            DATE 18/07/88              *
     F*                                                              *
     F*--------------------------------------------------------------*
     F*                                                              *
     A*  112563 - Header and footer changes required for GUI         *
     A*           Multilanguage support.                             *
     F*  S01496 - Incorporation of Jyske Enhancements (S10984)       *
     F*  S01117  -  MULTI-BRANCHING                                  *
     F*  S01253  -  RECOMPILED FOR MULTILANGUAGE SCREENS             *
     F*  S01199  -   HELP SYSTEM.                                 *
     F*  S01176  -  SECURITIES TRADING 3.1                           *
     F*                                                              *
     F****************************************************************
     A*         /////////////////////////////////////////
     A*        // WARNING: When creating this display //
     A*       //   file, take options RSTDSP(*YES)   //
     A*      //                       SHARE (*YES)  //
     A*     /////////////////////////////////////////
     A*                                                               *
     F******INDICATORS:-                                             *
     F*07*HELP FACILITY REQUIRED                                     *
     F*08 DISCRET IND = 'D' OR 'M' PROTECT CDCCD RBCCD & RDCCD       *
     F*10 SETON WHEN ENQUIRE OR DELETE ACTION CODE ENTERED -         *
     F*   ALL FIELDS APART FROM INITIAL SCREEN PROTECED              *
     F*11 ACTION CODE INVALID (NOT = 'I' 'A' 'E' OR 'D')             *
     F*12 DISCRETIONARY INDICATOR INVALID                            *
     F*13 CUSTOMER NUMBER INVALID                                    *
     F*14 INVESTMENT TYPE INVALID                                    *
     F*15 MARKET CENTRE INVALID                                      *
     F*16 BROKERAGE COMMISSION CODE INVALID                          *
     F*17 CUSTOMER COMMISSION CODE INVALID                           *
     F*18 LOCAL TRANSFER DUTY CODE INVALID                           *
     F*19 PMT CHARGE CODE INVALID                                    *
     F*20 COUPON DIVIDEND CHARGE CODE INVALID                        *
     F*21 RIGHTS/BONUS CHARGE CODE INVALID                           *
     F*22 RECEIPTS/DELIVERIES CHARGE CODE INVALID                    *
     F*65 SETON WHEN SCREEN INPUT ERROR                              *
     F*80 SETON WHEN 'DELETED' TO APPEAR ON DETAIL SCREEN            *
     F*81 SETON WHEN IN DELETE MODE - TO GET CMD/4 PROMPT            *
     A                                      CF03
     A                                      CF12
     A*                                              Begin /S01199/
     A*                                              End   /S01199/
     A                                      PRINT(MPRINT)
     A*                                              Begin /S01199/
     A***                                            Begin /S01117/
     A***                                            End   /S01117/
     A*                                              End   /S01199/
     A          R SE3153F1                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                      PUTOVR
     A***                                            Begin /S01117/
     A*                                      Begin /S01199/
     A*                                      End   /S01199/
     A*                                              Begin /S01496/
     A*                                              End   /S01496/
     A*                                              End   /S01117/
     A**                                             Begin /112563/
     A                                  1  6'SE3153A'
     A**                                             End   /112563/
     A                                 01 25'CUSTOMER/BROKER DEFAULT +
     A                                      CHARGES'
     A                                      DSPATR(HI UL)
     A                                 01 57TIME
     A                                      OVRATR
     A                                 01 66'WID'
     A            WIDDF         10   O 01 70
     A                                 03  2'Action code'
     A            ACODE          1   B 03 15
     A                                      OVRDTA
     A                                      DSPATR(UL)
     A N11                                  DSPATR(HI)
     A  11                                  DSPATR(RI PC)
     A***                                            Begin /S01117/
     A************                     03 25'Discretionary Indicator'
     A*                                              Begin /S01496/
     A***********                      03 24'Classification Indicator'
     A*                                              End   /S01496/
     A*                                              End   /S01117/
     A*                                              Begin /S01496/
     A*********** DISCD          1   B 03 50
     A***********                           OVRDTA
     A***********                           DSPATR(UL)
     A*N12*******                           DSPATR(HI)
     A**12*******                           DSPATR(RI PC)
     A*
     A N55                             03 24'Classification Indicator'
     A N55        DISCD          1   B 03 50
     A                                      OVRDTA
     A N55                                  DSPATR(UL)
     A N55N12                               DSPATR(HI)
     A N55 12                               DSPATR(RI PC)
     A*
     A  55                             03 25'Customer Group'
     A  55        USGRP          2   B 03 49
     A                                      OVRDTA
     A  55                                  DSPATR(UL)
     A  55N12                               DSPATR(HI)
     A  55 12                               DSPATR(RI PC)
     A*                                              End   /S01496/
     A                                 03 54'Customer Number'
     A            CUSTND        10   B 03 71
     A                                      OVRDTA
     A                                      DSPATR(UL)
     A N13                                  DSPATR(HI)
     A  13                                  DSPATR(RI PC)
     A                                 04 25'Investment Type'
     A            INVTYP         3   B 04 48
     A                                      OVRDTA
     A                                      DSPATR(UL)
     A N14                                  DSPATR(HI)
     A  14                                  DSPATR(RI PC)
     A                                 05 25'Market Centre'
     A            MARKC          2   B 05 49CHECK(FE)
     A                                      OVRDTA
     A                                      DSPATR(UL)
     A N15                                  DSPATR(HI)
     A  15                                  DSPATR(RI PC)
     A            ERCOD1        76   O 21  4
     A                                      OVRDTA
     A  65                                  DSPATR(RI)
     A            ERCOD2        76   O 22  4
     A                                      OVRDTA
     A  65                                  DSPATR(RI)
     A**                                             Begin /112563/
     A***********                      23 02'Press F3 to end or +
     A***********                           F12 for initial screen'
     A                                 23 02'F3=Exit  F12=Initial screen'
     A**                                             End   /112563/
     A          R SE3153F2
     A  81                                  CF10
     A                                      PUTOVR
     A***                                            Begin /S01117/
     A*                                      Begin /S01199/
     A*                                      End   /S01199/
     A***                                              End /S01117/
     A**                                             Begin /112563/
     A                                  1  6'SE3153B'
     A**                                             End   /112563/
     A                                 01 25'CUSTOMER/BROKER DEFAULT +
     A                                      CHARGES'
     A                                      DSPATR(HI UL)
     A                                 01 58TIME
     A                                      OVRATR
     A                                 01 67'WID'
     A            WIDDF         10   O 01 71
     A  80                             02 72'DELETED'
     A                                 03 02'Action code'
     A            ACODE          1   O 03 15
     A                                      OVRDTA
     A***                                            Begin /S01117/
     A************                     03 25'Discretionary Indicator'
     A*                                              Begin /S01496/
     A***********                      03 24'Classification Indicator'
     A*                                              End   /S01496/
     A*                                              End   /S01117/
     A*                                              Begin /S01496/
     A*********** DISCD          1   O 03 50
     A***********                           OVRDTA
     A N55                             03 24'Classification Indicator'
     A N55        DISCD          1   O 03 50
     A                                      OVRDTA
     A*
     A  55                             03 25'Customer Group'
     A  55        USGRP          2   O 03 49
     A                                      OVRDTA
     A*                                              End   /S01496/
     A                                 03 54'Customer Number'
     A            CUSTND        10   O 03 71
     A                                      OVRDTA
     A                                 04 25'Investment Type'
     A            INVTYP         3   O 04 48
     A                                      OVRDTA
     A                                 05 25'Market Centre'
     A            MARKC          2   O 05 49
     A                                      OVRDTA
     A                                 08 25'Brokerage Commission Code'
     A            BCCD           2   B 08 59
     A                                      OVRDTA
     A N10                                  DSPATR(UL)
     A  10                                  DSPATR(PR)
     A N16                                  DSPATR(HI)
     A  16                                  DSPATR(RI PC)
     A                                 09 25'Customer Commission Code'
     A            CCCD           2   B 09 59
     A                                      OVRDTA
     A N10                                  DSPATR(UL)
     A  10                                  DSPATR(PR)
     A N17                                  DSPATR(HI)
     A  17                                  DSPATR(RI PC)
     A***************************************************************    *S01176
     A*                                10 25'Local Transfer Duty Code'   *
     A*           LTDCD          2   B 10 59                             *
     A*                                     OVRDTA                       *
     A*N10                                  DSPATR(UL)                   *
     A* 10                                  DSPATR(PR)                   *
     A*N18                                  DSPATR(HI)                   *
     A* 18                                  DSPATR(RI PC)                *
     A*                                11 25'PMT Charge Code'            *
     A*           PMTD           2   B 11 59                             *
     A*                                     OVRDTA                       *
     A*N10                                  DSPATR(UL)                   *
     A* 10                                  DSPATR(PR)                   *
     A*N19                                  DSPATR(HI)                   *
     A* 19                                  DSPATR(RI PC)                *
     A*                                12 25'Coupon Dividend Charge +    *
     A*                                     Code'                        *
     A*           CDCCD          2   B 12 59                             *
     A*                                     OVRDTA                       *
     A*N08                                  DSPATR(UL)                   *
     A* 08                                  DSPATR(PR)                   *
     A*N20                                  DSPATR(HI)                   *
     A* 20                                  DSPATR(RI PC)                *
     A*                                13 25'Rights/Bonus Charge Code'   *
     A*           RBCCD          2   B 13 59                             *
     A*                                     OVRDTA                       *
     A*N08                                  DSPATR(UL)                   *
     A* 08                                  DSPATR(PR)                   *
     A*N21                                  DSPATR(HI)                   *
     A* 21                                  DSPATR(RI PC)                *
     A*                                14 25'Receipts/Deliveries +       *
     A*                                     Charge Code'                 *
     A*           RDCCD          2   B 14 59                             *
     A*                                     OVRDTA                       *
     A*N08                                  DSPATR(UL)                   *
     A* 08                                  DSPATR(PR)                   *
     A*N22                                  DSPATR(HI)                   *
     A* 22                                  DSPATR(RI PC)                *
     A****************************************************************   *S01176
     A                                 10 25'Default Charge Code 1'
     A            SDCC1          2   B 10 59
     A                                      OVRDTA
     A N10                                  DSPATR(UL)
     A  10                                  DSPATR(PR)
     A N18                                  DSPATR(HI)
     A  18                                  DSPATR(RI PC)
     A                                 11 25'Default Charge Code 2'
     A            SDCC2          2   B 11 59
     A                                      OVRDTA
     A N10                                  DSPATR(UL)
     A  10                                  DSPATR(PR)
     A N19                                  DSPATR(HI)
     A  19                                  DSPATR(RI PC)
     A                                 12 25'Commission Rebate'
     A            SCMRP          6   B 12 59
     A                                      OVRDTA
     A N10                                  DSPATR(UL)
     A  10                                  DSPATR(PR)
     A N20                                  DSPATR(HI)
     A  20                                  DSPATR(RI PC)
     A*                                                                   S01176
     A            ERCOD1        76   O 21  4
     A                                      OVRDTA
     A  65                                  DSPATR(RI)
     A            ERCOD2        76   O 22  4
     A                                      OVRDTA
     A  65                                  DSPATR(RI)
     A**                                             Begin /112563/
     A***********                      23 02'Press F3 to end or +
     A***********                           F12 for initial screen'
     A* 81 ******                      23 45'or F10 to delete'
     A                                 23 02'F3=Exit  F12=Initial screen'
     A  81                             23 31'F10=Delete'
     A**                                             End   /112563/
