      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas SE Commercial Paper Prices Input')
     A*            14:53:50    SENB        REL-R08M00  5714-UT1
     A*****************************************************************
     A*                                                               *
     A*  Midas - Securities Trading Module
     A*                                                               *
     A*  DSPF/SE5010DF -  COMMERCIAL PAPER PRICES INPUT               *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01117             Date 14Nov90               *
      *                 E22912             Date 27Jul90               *
     A*                 S01253             DATE 17APR90               *
     A*                 S01199             DATE 03/08/89              *
     A*                 S01179             DATE 21/10/88              *
     A*                 S01176             DATE 08/09/88              *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     A*  S01117 - MULTI-BRANCHING                                     *
     A*  E22912 - F5 USAGE CHANGED TO F12                             *
     A*  S01253 - RECOMPILED FOR MULTILANGUAGE SCREENS                *
     A*  S01199 - HELP SYSTEM.                                    *
     A*  S01179 - AS400 CONVERSION                                    *   S01179
     A*             (REPLACE RTGAID KEYWORD WITH FUNCTION KEYS        *   S01179
     A*             AND INDICATORS AS IT IS NOT SUPPORTED             *   S01179
     A*             ON THE AS400)                                     *   S01179
     A*  S01176 - SECURITIES TRADING 3.1                              *   S01176
     A*                                                               *
     A*****************************************************************
     A*         /////////////////////////////////////////             *
     A*        // WARNING: When creating this display //              *
     A*       //   file, take options RSTDSP(*YES)   //               *
     A*      //                       SHARE (*YES)  //                *
     A*     /////////////////////////////////////////                 *
     A*****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A***********                                                     /S01179/
     A                                      VLDCMDKEY(19 'ANY VALID KEY')
     A*                                              Begin /S01199/
     A*                                              End   /S01199/
     A                                      CA03
     A                                      CA10
     A*                                              Begin /E22912/
     A**************************************CA05
     A N08                                  CA12
     A*                                              End   /E22912/
     A                                      PRINT(MPRINT)
     A                                      INDARA
     A*                                              Begin /S01199/
     A***                                          BEGIN /S01117/
     A***                                            END /S01117/
     A*                                              End   /S01199/
     A          R RECDETLS                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*            16:43:41    SENB        REL-R08M00  5714-UT1
     A                                      OVERLAY
     A                                      RTNDTA
     A                                      PUTOVR
     A                                      BLINK
     A***********                           ROLLUP                      /S01179/
     A***********                           ROLLDOWN                    /S01179/
     A                                      ROLLUP(17)
     A                                      ROLLDOWN(18)
     A************                          RTGAID(01)                  /S01179/
     A***                                            BEGIN /S01117/
     A*                                      Begin /S01199//S01117/
     A*                                      End   /S01199//S01117/
     A*                                              End   /S01117/
     A                                  6  2'No. of Days/Yield Rates 1'
     A            SND01          5A  B  6 30DSPATR(HI)
     A N06N31                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                      OVRDTA
     A                                  6 36'/'
     A            SYR01         16A  B  6 38DSPATR(HI)
     A N06N56                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  56                                  DSPATR(RI)
     A  56                                  DSPATR(PC)
     A                                      OVRDTA
     A            DELT           7A  O  6 72DSPATR(HI)
     A                                      DSPATR(BL)
     A                                      OVRDTA
     A                                  8 14'2'
     A            SND02          5A  B  8 18DSPATR(HI)
     A N06N32                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                      OVRDTA
     A                                  8 24'/'
     A            SYR02         16A  B  8 26DSPATR(HI)
     A N06N57                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                      9 14'3'
     A************SND03          5A  B  9 18DSPATR(HI)
     A                                  8 46'3'
     A            SND03          5A  B  8 49DSPATR(HI)
     A*                                                    /S01176/
     A N06N33                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                      9 24'/'
     A************SYR03         16A  B  9 26DSPATR(HI)
     A                                  8 55'/'
     A            SYR03         16A  B  8 57DSPATR(HI)
     A*                                                    /S01176/
     A N06N58                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  58                                  DSPATR(RI)
     A  58                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     10 14'4'
     A************SND04          5A  B 10 18DSPATR(HI)
     A                                  9 14'4'
     A            SND04          5A  B  9 18DSPATR(HI)
     A*                                                    /S01176/
     A N06N34                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     10 24'/'
     A************SYR04         16A  B 10 26DSPATR(HI)
     A                                  9 24'/'
     A            SYR04         16A  B  9 26DSPATR(HI)
     A*                                                    /S01176/
     A N06N59                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  59                                  DSPATR(RI)
     A  59                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     11 14'5'
     A************SND05          5A  B 11 18DSPATR(HI)
     A                                  9 46'5'
     A            SND05          5A  B  9 49DSPATR(HI)
     A*                                                    /S01176/
     A N06N35                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     11 24'/'
     A************SYR05         16A  B 11 26DSPATR(HI)
     A                                  9 55'/'
     A            SYR05         16A  B  9 57DSPATR(HI)
     A*                                                    /S01176/
     A N06N60                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     12 14'6'
     A************SND06          5A  B 12 18DSPATR(HI)
     A                                 10 14'6'
     A            SND06          5A  B 10 18DSPATR(HI)
     A*                                                    /S01176/
     A N06N36                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     12 24'/'
     A************SYR06         16A  B 12 26DSPATR(HI)
     A                                 10 24'/'
     A            SYR06         16A  B 10 26DSPATR(HI)
     A*                                                    /S01176/
     A N06N61                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     13 14'7'
     A************SND07          5A  B 13 18DSPATR(HI)
     A                                 10 46'7'
     A            SND07          5A  B 10 49DSPATR(HI)
     A*                                                    /S01176/
     A N06N37                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     13 24'/'
     A************SYR07         16A  B 13 26DSPATR(HI)
     A                                 10 55'/'
     A            SYR07         16A  B 10 57DSPATR(HI)
     A*                                                    /S01176/
     A N06N62                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     14 14'8'
     A************SND08          5A  B 14 18DSPATR(HI)
     A                                 11 14'8'
     A            SND08          5A  B 11 18DSPATR(HI)
     A*                                                    /S01176/
     A N06N38                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     14 24'/'
     A************SYR08         16A  B 14 26DSPATR(HI)
     A                                 11 24'/'
     A            SYR08         16A  B 11 26DSPATR(HI)
     A*                                                    /S01176/
     A N06N63                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     15 14'9'
     A************SND09          5A  B 15 18DSPATR(HI)
     A                                 11 46'9'
     A            SND09          5A  B 11 49DSPATR(HI)
     A*                                                    /S01176/
     A N06N39                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     15 24'/'
     A************SYR09         16A  B 15 26DSPATR(HI)
     A                                 11 55'/'
     A            SYR09         16A  B 11 57DSPATR(HI)
     A*                                                    /S01176/
     A N06N64                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     16 14'10'
     A************SND10          5A  B 16 18DSPATR(HI)
     A                                 12 14'10'
     A            SND10          5A  B 12 18DSPATR(HI)
     A*                                                    /S01176/
     A N06N40                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     16 24'/'
     A************SYR10         16A  B 16 26DSPATR(HI)
     A                                 12 24'/'
     A            SYR10         16A  B 12 26DSPATR(HI)
     A*                                                    /S01176/
     A N06N65                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     17 14'11'
     A************SND11          5A  B 17 18DSPATR(HI)
     A                                 12 46'11'
     A            SND11          5A  B 12 49DSPATR(HI)
     A*                                                    /S01176/
     A N06N41                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     17 24'/'
     A************SYR11         16A  B 17 26DSPATR(HI)
     A                                 12 55'/'
     A            SYR11         16A  B 12 57DSPATR(HI)
     A*                                                    /S01176/
     A N06N66                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     18 14'12'
     A************SND12          5A  B 18 18DSPATR(HI)
     A                                 13 14'12'
     A            SND12          5A  B 13 18DSPATR(HI)
     A*                                                    /S01176/
     A N06N42                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     18 24'/'
     A************SYR12         16A  B 18 26DSPATR(HI)
     A                                 13 24'/'
     A            SYR12         16A  B 13 26DSPATR(HI)
     A*                                                    /S01176/
     A N06N67                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  67                                  DSPATR(RI)
     A  67                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     19 14'13'
     A************SND13          5A  B 19 18DSPATR(HI)
     A                                 13 46'13'
     A            SND13          5A  B 13 49DSPATR(HI)
     A*                                                    /S01176/
     A N06N43                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     19 24'/'
     A************SYR13         16A  B 19 26DSPATR(HI)
     A                                 13 55'/'
     A            SYR13         16A  B 13 57DSPATR(HI)
     A*                                                    /S01176/
     A N06N68                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  68                                  DSPATR(RI)
     A  68                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                      8 46'14'
     A************SND14          5A  B  8 49DSPATR(HI)
     A                                 14 14'14'
     A            SND14          5A  B 14 18DSPATR(HI)
     A*                                                    /S01176/
     A N06N44                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                      8 55'/'
     A************SYR14         16A  B  8 57DSPATR(HI)
     A                                 14 24'/'
     A            SYR14         16A  B 14 26DSPATR(HI)
     A*                                                    /S01176/
     A N06N69                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  69                                  DSPATR(RI)
     A  69                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                      9 46'15'
     A************SND15          5A  B  9 49DSPATR(HI)
     A                                 14 46'15'
     A            SND15          5A  B 14 49DSPATR(HI)
     A*                                                    /S01176/
     A N06N45                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                      9 55'/'
     A************SYR15         16A  B  9 57DSPATR(HI)
     A                                 14 55'/'
     A            SYR15         16A  B 14 57DSPATR(HI)
     A*                                                    /S01176/
     A N06N70                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  70                                  DSPATR(RI)
     A  70                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     10 46'16'
     A************SND16          5A  B 10 49DSPATR(HI)
     A                                 15 14'16'
     A            SND16          5A  B 15 18DSPATR(HI)
     A*                                                    /S01176/
     A N06N46                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     10 55'/'
     A************SYR16         16A  B 10 57DSPATR(HI)
     A                                 15 24'/'
     A            SYR16         16A  B 15 26DSPATR(HI)
     A*                                                    /S01176/
     A N06N71                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  71                                  DSPATR(RI)
     A  71                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     11 46'17'
     A************SND17          5A  B 11 49DSPATR(HI)
     A                                 15 46'17'
     A            SND17          5A  B 15 49DSPATR(HI)
     A*                                                    /S01176/
     A N06N47                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     11 55'/'
     A************SYR17         16A  B 11 57DSPATR(HI)
     A                                 15 55'/'
     A            SYR17         16A  B 15 57DSPATR(HI)
     A*                                                    /S01176/
     A N06N72                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  72                                  DSPATR(RI)
     A  72                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     12 46'18'
     A************SND18          5A  B 12 49DSPATR(HI)
     A                                 16 14'18'
     A            SND18          5A  B 16 18DSPATR(HI)
     A*                                                    /S01176/
     A N06N48                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     12 55'/'
     A************SYR18         16A  B 12 57DSPATR(HI)
     A                                 16 24'/'
     A            SYR18         16A  B 16 26DSPATR(HI)
     A*                                                    /S01176/
     A N06N73                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  73                                  DSPATR(RI)
     A  73                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     13 46'19'
     A************SND19          5A  B 13 49DSPATR(HI)
     A                                 16 46'19'
     A            SND19          5A  B 16 49DSPATR(HI)
     A*                                                    /S01176/
     A N06N49                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     13 55'/'
     A************SYR19         16A  B 13 57DSPATR(HI)
     A                                 16 55'/'
     A            SYR19         16A  B 16 57DSPATR(HI)
     A*                                                    /S01176/
     A N06N74                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  74                                  DSPATR(RI)
     A  74                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     14 46'20'
     A************SND20          5A  B 14 49DSPATR(HI)
     A                                 17 14'20'
     A            SND20          5A  B 17 18DSPATR(HI)
     A*                                                    /S01176/
     A N06N50                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     14 55'/'
     A************SYR20         16A  B 14 57DSPATR(HI)
     A                                 17 24'/'
     A            SYR20         16A  B 17 26DSPATR(HI)
     A*                                                    /S01176/
     A N06N75                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  75                                  DSPATR(RI)
     A  75                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     15 46'21'
     A************SND21          5A  B 15 49DSPATR(HI)
     A                                 17 46'21'
     A            SND21          5A  B 17 49DSPATR(HI)
     A*                                                    /S01176/
     A N06N51                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     15 55'/'
     A************SYR21         16A  B 15 57DSPATR(HI)
     A                                 17 55'/'
     A            SYR21         16A  B 17 57DSPATR(HI)
     A*                                                    /S01176/
     A N06N76                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  76                                  DSPATR(RI)
     A  76                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     16 46'22'
     A************SND22          5A  B 16 49DSPATR(HI)
     A                                 18 14'22'
     A            SND22          5A  B 18 18DSPATR(HI)
     A*                                                    /S01176/
     A N06N52                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     16 55'/'
     A************SYR22         16A  B 16 57DSPATR(HI)
     A                                 18 24'/'
     A            SYR22         16A  B 18 26DSPATR(HI)
     A*                                                    /S01176/
     A N06N77                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  77                                  DSPATR(RI)
     A  77                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     17 46'23'
     A************SND23          5A  B 17 49DSPATR(HI)
     A                                 18 46'23'
     A            SND23          5A  B 18 49DSPATR(HI)
     A*                                                    /S01176/
     A N06N53                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     17 55'/'
     A************SYR23         16A  B 17 57DSPATR(HI)
     A                                 18 55'/'
     A            SYR23         16A  B 18 57DSPATR(HI)
     A*                                                    /S01176/
     A N06N78                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  78                                  DSPATR(RI)
     A  78                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     18 46'24'
     A************SND24          5A  B 18 49DSPATR(HI)
     A                                 19 14'24'
     A            SND24          5A  B 19 18DSPATR(HI)
     A*                                                    /S01176/
     A N06N54                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  54                                  DSPATR(RI)
     A  54                                  DSPATR(PC)
     A                                      OVRDTA
     A*                                                    /S01176/
     A************                     18 55'/'
     A************SYR24         16A  B 18 57DSPATR(HI)
     A                                 19 24'/'
     A            SYR24         16A  B 19 26DSPATR(HI)
     A*                                                    /S01176/
     A N06N79                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  79                                  DSPATR(RI)
     A  79                                  DSPATR(PC)
     A                                      OVRDTA
     A                                 19 46'25'
     A            SND25          5A  B 19 49DSPATR(HI)
     A N06N55                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A                                      OVRDTA
     A                                 19 55'/'
     A            SYR25         16A  B 19 57DSPATR(HI)
     A N06N80                               DSPATR(UL)
     A  06                                  DSPATR(PR)
     A  80                                  DSPATR(RI)
     A  80                                  DSPATR(PC)
     A                                      OVRDTA
     A          R KEYINPUT
     A*            11:45:02    SENB        REL-R08M00  5714-UT1
     A                                      OVERLAY
     A                                      BLINK
     A                                      PUTOVR
     A************                          RTGAID(01)                  /S01179/
     A***                                            BEGIN /S01117/
     A*                                      Begin /S01199//S01117/
     A*                                      End   /S01199//S01117/
     A***                                              END /S01117/
     A                                  1 17'COMMERCIAL PAPER PRICES INPUT'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A            RUNA           7A  O  1 55
     A                                  1 64TIME
     A                                  1 74'WID'
     A            WSID           3A  O  1 78
     A                                  2  2'Action Code'
     A            ACTN           1A  B  2 16DSPATR(HI)
     A N05N21                               DSPATR(UL)
     A  05                                  DSPATR(PR)
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A                                      OVRDTA
     A                                  2 21'Currency Code'
     A            SCCY           3A  B  2 39DSPATR(HI)
     A N05N22                               DSPATR(UL)
     A  05                                  DSPATR(PR)
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A                                  3 21'Investment Type'
     A            SINVT          3A  B  3 39DSPATR(HI)
     A N05N23                               DSPATR(UL)
     A  05                                  DSPATR(PR)
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A                                      OVRDTA
     A                                  3 49'Review from'
     A  05                                  DSPATR(ND)
     A                                      OVRATR
     A            PCCY           3A  B  3 62DSPATR(HI)
     A                                      DSPATR(UL)
     A  05                                  DSPATR(PR)
     A  05                                  DSPATR(ND)
     A                                      OVRDTA
     A            PINVT          3A  B  3 67DSPATR(HI)
     A                                      DSPATR(UL)
     A  05                                  DSPATR(PR)
     A  05                                  DSPATR(ND)
     A                                      OVRDTA
     A                                  5  2'                                  -
     A                                                                         -
     A                                              '
     A                                      DSPATR(UL)
     A          R SUBFLREC                  SFL
     A*            14:53:50    SENB        REL-R08M00  5714-UT1
     A            ACTN           1A  I  6  2DSPATR(HI)
     A N21N22N23                            DSPATR(UL)
     A  21
     AO 22
     AO 23                                  DSPATR(RI)
     A  21
     AO 22
     AO 23                                  DSPATR(PC)
     A                                      CHECK(ER)
     A            STAT           1A  O  6  4DSPATR(BL)
     A                                      DSPATR(HI)
     A            SCCY           3A  O  6  9DSPATR(HI)
     A            SINVT          3A  O  6 20DSPATR(HI)
     A          R SUBFLCTL                  SFLCTL(SUBFLREC)
     A*            14:53:50    SENB        REL-R08M00  5714-UT1
     A                                      SFLSIZ(0017)
     A                                      SFLPAG(0017)
     A                                      OVERLAY
     A*N04*********                         ROLLDOWN                    /S01179/
     A*************                         ROLLUP                      /S01179/
     A N04                                  ROLLDOWN(18)
     A                                      ROLLUP(17)
     A                                      BLINK
     A************                          RTGAID(01)                  /S01179/
     A  01                                  SFLDSP
     A  02                                  SFLDSPCTL
     A N01N02                               SFLCLR
     A  03                                  SFLEND
     A*                                              Begin /S01117/
     A*                                      Begin /S01199//S01117/
     A*                                      End   /S01199//S01117/
     A*                                              End   /S01117/
     A                                  1 17'COMMERCIAL PAPER PRICES INPUT'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A            RUNA           7A  O  1 55
     A                                  1 64TIME
     A                                  1 74'WID'
     A            WSID           3A  O  1 78
     A                                  3 49'Review from'
     A            PCCY           3A  B  3 62DSPATR(HI)
     A                                      DSPATR(UL)
     A            PINVT          3A  B  3 67DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  5  2'X    CCY CODE   INV TYPE          -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A          R MESSAGES
     A                                      PUTOVR
     A                                      BLINK
     A            ERRMSG        76     23  2
     A                                      OVRDTA
     A            INFMSG        76     24  2
     A                                      OVRDTA
     A* CLEAR SCREEN **
     A          R CLSCREEN
     A                                  1  2' '
