      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas SE ER Early Redemptions References Maint')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Securities Trading Module                        *
     A*                                                               *
     A*  SE6500DF - Maintain Basic Details of Early Redemptions       *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSE040             Date 13May03               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 CSE016             Date 10Jan01               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 S01496             Date 07Oct94               *
      *                 S10978             Date 24Feb93               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSE040 - Security Statement Production                       *
      *  CSE016 - Extended Security Descriptions                      *
     A*  S01496 - Incorporation of Jyske Enhancements (S10978)        *
     A*  S10978 - JYSZRH: EARLY REDEMPTIONS                           *
     A*                                                               *
     A*****************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A*                                              Begin /S01496/
     A                                      REF(MFRFL)
     A*                                              End   /S01496/
     A*
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      VLDCMDKEY(46 'ANY VALID KEY')
     A                                      INDARA
     A*                                              Begin /S01496/
     A*                                              End   /S01496/
     A                                      PRINT(*LIBL/QSYSPRT)
     A                                      CA03(03 'Exit.')
     A N47                                  CA05(05 'Refresh')
     A N61N47N64                            CA09(09 'Add Mode.')
     A  61N64
     AO 43                                  CA12(12 'Previous.')
     A*=========================================================================
     A          R #SFLNUM                   SFL
     A  84                                  SFLNXTCHG
     A                                      TEXT('Subfile record.')
     A*                                              Begin /S01496/
     A*********** #1SEL          1A  B  7  3TEXT('Selection Field')
     A            #1SEL          1A  B  8  3TEXT('Selection Field')
     A*                                              End   /S01496/
     A  57                                  DSPATR(PR)
     A  62                                  DSPATR(RI PC)
     A  57N62                               DSPATR(ND)
     A N57N62                               DSPATR(UL HI)
     A                                      CHECK(ER)
     A*                                              Begin /S01496/
     A*********** #1REFN         6A  B  7 11TEXT('Reference Number')
     A            #1REFN         6A  B  8 11TEXT('Reference Number')
     A*                                              End   /S01496/
     A N58N61N38                            DSPATR(UL HI)
     A  58
     AO 61                                  DSPATR(PR)
     A  38                                  DSPATR(RI)
     A*                                              Begin /S01496/
     A*********** #1SECN        10A  B  7 20TEXT('Security Shortname')
     A            #1SECN        10A  B  8 20TEXT('Security Shortname')
     A*                                              End   /S01496/
     A N58N61N39                            DSPATR(UL HI)
     A  58
     AO 61                                  DSPATR(PR)
     A  39                                  DSPATR(RI)
     A*                                              Begin /S01496/
     A*********** #1EXDT         6A  B  7 32TEXT('Ex-Date')
     A            #1EXDT         6A  B  8 32TEXT('Ex-Date')
     A*                                              End   /S01496/
     A N63
     AAN59N61N32                            DSPATR(UL HI)
     A  61
     AO 63
     AO 59                                  DSPATR(PR)
     A  32                                  DSPATR(RI)
     A*                                              Begin /S01496/
     A*********** #1RDAT         6A  O  7 43TEXT('Redemption Date')
     A            #1RDAT         6A  O  8 43TEXT('Redemption Date')
     A*                                              End   /S01496/
     A  57N33                               DSPATR(HI)
     A  33                                  DSPATR(RI)
     A*                                              Begin /S01496/
     A*********** #1LASA         6A  B  7 51TEXT('Last Allocation')
     A            #1LASA         6A  B  8 51TEXT('Last Allocation')
     A*                                              End   /S01496/
     A  57                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A  34                                  DSPATR(RI)
     A*                                              Begin /S01496/
     A*********** #1FINA         1A  B  7 60TEXT('Final Allocation')
     A            #1FINA         1A  B  8 60TEXT('Final Allocation')
     A*                                              End   /S01496/
     A  57                                  DSPATR(ND)
     A  57
     AO 63
     AO 61
     AO 68                                  DSPATR(PR)
     A N63N68
     AAN57N61N35                            DSPATR(UL HI)
     A  35                                  DSPATR(RI)
     A*                                              Begin /S01496/
     A*********** #1STAT         1A  O  7 66TEXT('Status')
     A            #1STAT         1A  O  8 66TEXT('Status')
     A*                                              End   /S01496/
     A  57                                  DSPATR(ND)
     A  36                                  DSPATR(RI)
     A*                                              Begin /S01496/
     A*********** #1CORR         6A  B  7 72TEXT('Correct Reference')
     A            #1CORR         6A  B  8 72TEXT('Correct Reference')
     A*                                              End   /S01496/
     A  57N37                               DSPATR(HI)
     A N58N61N37                            DSPATR(UL)
     A  58
     AO 61                                  DSPATR(PR)
     A  37                                  DSPATR(RI)
     A*
     A**Start of change CSE016
     A            #1SRNM        41A  O  9 14TEXT('Security Description')
     A**End of change CSE016
     A            #FIELD       123A  H
     A            #2SEL          1A  H      TEXT('Selection Field')
     A            #2EXDT         6A  H      TEXT('Ex-Date')
     A            #2FINA         1A  H      TEXT('Final Allocation')
     A*=========================================================================
     A          R #CTLNUM                   SFLCTL(#SFLNUM)
     A**Start of change CSE016
     A**********                            SFLSIZ(0016)                  CSE016
     A**********                            SFLPAG(0015)                  CSE016
     A                                      SFLSIZ(0008)
     A                                      SFLPAG(0007)
     A**End of change CSE016
     A                                      TEXT('Subfile control.')
     A                                      OVERLAY
     A  80                                  SFLCLR
     A N80                                  SFLDSPCTL
     A N80 81                               SFLDSP
     A N80 81 30                            SFLEND
     A N30                                  ROLLUP(27 'Next page.')
     A*                                              Begin /S01496/
     A*
     A*                                              End   /S01496/
     A*
     A            #1RRN          4S 0H      SFLRCDNBR
     A*                                              Begin /S01496/
     A***********                       1  2'SE6500'
     A***********                       1 15'EARLY REDEMPTIONS'
     A***********                           DSPATR(HI)
     A*N61N64****                       1 33'MAINTENANCE'
     A***********                           DSPATR(HI)
     A**61N64****                       1 33'ENQUIRY'
     A***********                           DSPATR(HI)
     A**64*******                       1 33'REPORT'
     A***********                           DSPATR(HI)
     A*********** DSPNUM         9A  O  1 52
     A*********** ##MRDT         7A  O  1 63TEXT('Midas Rundate')
     A*********** ##TME          6Y 0O  1 72TEXT('Time')
     A***********                           EDTWRD('  :  :  ')
     A***********                       2  2'Review From: Reference'
     A*********** #REFN          6A  B  2 25
     A*
     A            ##USR     R        O  1  2REFFLD(USER)
     A                                  1 13'SE6500'
     A                                  1 26'EARLY REDEMPTIONS'
     A                                      DSPATR(HI)
     A N61N64                           1 44'MAINTENANCE'
     A                                      DSPATR(HI)
     A  61N64                           1 44'ENQUIRY'
     A                                      DSPATR(HI)
     A  64                              1 44'REPORT'
     A                                      DSPATR(HI)
     A                                  1 67'DATE '
     A            ##MRDT    R        O  1 73REFFLD(RUNA)
     A*
     A            ##JOB     R        O  2  2REFFLD(JOJOB)
     A                                  2 67'TIME '
     A            ##TME          6  0   2 73EDTWRD('  :  :  ')
     A                                  3  2'Review From: Reference'
     A            #REFN          6A  B  3 25
     A*                                              End   /S01496/
     A N56N50                               DSPATR(UL HI)
     A  56                                  DSPATR(PR)
     A  50                                  DSPATR(PC RI)
     A*                                              Begin /S01496/
     A***********                       2 32'Security'
     A*********** #SECN         10A  B  2 41
     A                                  3 32'Security'
     A            #SECN         10A  B  3 41
     A*                                              End   /S01496/
     A N56N51                               DSPATR(UL HI)
     A  56                                  DSPATR(PR)
     A  51                                  DSPATR(PC RI)
     A*                                              Begin /S01496/
     A***********                       2 52'Ex-date'
     A*********** #EXDT          6A  B  2 60
     A                                  3 52'Ex-date'
     A            #EXDT          6A  B  3 60
     A*                                              End   /S01496/
     A N56N52                               DSPATR(UL HI)
     A  56                                  DSPATR(PR)
     A  52                                  DSPATR(PC RI)
     A*                                              Begin /S01496/
     A***********                       2 67'Status'
     A*********** #STAT          1A  B  2 74
     A                                  3 67'Status'
     A            #STAT          1A  B  3 74
     A*                                              End   /S01496/
     A N56N60                               DSPATR(UL HI)
     A  56                                  DSPATR(PR)
     A  60                                  DSPATR(PC RI)
     A*
     A*                                              Begin /S01496/
     A***********                       4  1'Action'
     A***********                       4 11'Ref.'
     A***********                       4 20'Security'
     A***********                       4 32'Ex-Date'
     A***********                       4 43'Redeem'
     A***********                       4 51'Last  Final'
     A***********                       4 64'Status'
     A***********                       4 72'Correct'
     A***********
     A*N61N57N64*                       5  1'(AEPLFXR)'
     A**61N57N64*                       5  1'( E  F  )'
     A**57N64****                       5  1'(       )'
     A**64*******                       5  1'(  P    )'
     A***********                       5 11'Number'
     A***********                       5 20'Shortname'
     A***********                       5 43'Date'
     A***********                       5 51'Allocation'
     A***********                       5 72'Ref.'
     A*
     A                                  5  1'Action'
     A                                  5 11'Ref.'
     A                                  5 20'Security'
     A                                  5 32'Ex-Date'
     A                                  5 43'Redeem'
     A                                  5 51'Last  Final'
     A                                  5 64'Status'
     A                                  5 72'Correct'
     A*
     A N61N57N64                        6  1'(AEPLFXR)'
     A  61N57N64                        6  1'( E  F  )'
     A  57N64                           6  1'(       )'
     A  64                              6  1'(  P    )'
     A                                  6 11'Number'
     A                                  6 20'Shortname'
     A                                  6 43'Date'
     A                                  6 51'Allocation'
     A                                  6 72'Ref.'
     A*                                              End   /S01496/
     A*
     A            #3REFN         6A  H
     A            #3SECN        10A  H
     A            #3EXDT         6A  H
     A            #3STAT         1A  H
     A*=========================================================================
     A          R #MSGRCD                   TEXT('Program messages')
     A*                                              Begin /S01496/
     A***********                           SFL SFLMSGRCD(22)
     A                                      SFL SFLMSGRCD(24)
     A*                                              End   /S01496/
     A            MSGKEY                    SFLMSGKEY
     A            ##PGM                     SFLPGMQ
     A*=========================================================================
     A          R #MSGCTL                   SFLCTL(#MSGRCD)
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0001)
     A                                      TEXT('Program messages')
     A                                      SFLINZ
     A                                      SFLDSP
     A                                      SFLDSPCTL
     A  25
     AON25                                  SFLEND
     A            ##PGM                     SFLPGMQ
     A*=========================================================================
     A          R #CMDTXT1                  TEXT('Command keys.')
     A                                      OVERLAY PUTOVR
     A            ##CTX1        78     23  2TEXT('Command Text 1 - ACT')
     A N25                                  OVRDTA
     A*=========================================================================
     A          R SCREEN                    TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A                                      OVERLAY
     A*                                              Begin /S01496/
     A***********                       1  2'SE6500'
     A***********                       1 15'EARLY REDEMPTIONS MAINTENANCE'
     A***********                           DSPATR(HI)
     A*********** DSPNUM         9A  O  1 52
     A*********** ##MRDT         7A  O  1 63TEXT('Midas Rundate')
     A*********** ##TME          6Y 0O  1 72TEXT('Time')
     A***********                           EDTWRD('  :  :  ')
     A***********                       2  2'Review From: Reference Number'
     A*********** #REFN          6A  O  2 32DSPATR(HI)
     A***********                       2 40'Security'
     A*********** #SECN         10A  O  2 49DSPATR(HI)
     A***********                       2 61'Ex-date'
     A*********** #EXDT          6A  O  2 69DSPATR(HI)
     A***********
     A***********                       4  1'Action'
     A***********                       4 11'Ref.'
     A***********                       4 20'Security'
     A***********                       4 32'Ex-Date'
     A***********                       4 43'Redeem'
     A***********                       4 51'Last  Final'
     A***********                       4 64'Status'
     A***********                       4 72'Correct'
     A***********
     A***********                       5  1'(     )'
     A***********                       5 11'Number'
     A***********                       5 20'Shortname'
     A***********                       5 43'Date'
     A***********                       5 51'Allocation'
     A***********                       5 72'Ref.'
     A*********** #1SEL          1A  O  7  3TEXT('Selection Field')
     A***********                           DSPATR(HI)
     A*********** #1REFN         6A  O  7 11TEXT('Reference Number')
     A***********                           DSPATR(HI)
     A*********** #1SECN        10A  O  7 20TEXT('Security Shortname')
     A***********                           DSPATR(HI)
     A*********** #1EXDT         6A  O  7 32TEXT('Ex-Date')
     A***********                           DSPATR(HI)
     A*********** #1RDAT         6A  O  7 43TEXT('Redemption Date')
     A***********                           DSPATR(HI)
     A*********** #1LASA         6A  O  7 51TEXT('Last Allocation')
     A***********                           DSPATR(HI)
     A*********** #1FINA         1A  O  7 60TEXT('Final Allocation')
     A***********                           DSPATR(HI)
     A*********** #1STAT         1A  O  7 66TEXT('Status')
     A***********                           DSPATR(HI)
     A*********** #1CORR         6A  O  7 72TEXT('Correct Reference')
     A***********                           DSPATR(HI)
     A***********                      10 20'CONFIRM'
     A**40*******                      10 28'REVERSAL'
     A**41*******                      10 28'ALLOCATION'
     A**42*******                      10 28'AUTHORISATION'
     A*********** #1CONF         1A  B 10 42TEXT('Confirmation Field')
     A*
     A            ##USR     R        O  1  2REFFLD(USER)
     A                                  1 13'SE6500'
     A                                  1 26'EARLY REDEMPTIONS MAINTENANCE'
     A                                      DSPATR(HI)
     A                                  1 67'DATE '
     A            ##MRDT    R        O  1 73REFFLD(RUNA)
     A*
     A            ##JOB     R        O  2  2REFFLD(JOJOB)
     A                                  2 67'TIME '
     A            ##TME          6  0   2 73EDTWRD('  :  :  ')
     A*
     A                                  3  2'Review From: Reference Number'
     A            #REFN          6A  O  3 32DSPATR(HI)
     A                                  3 40'Security'
     A            #SECN         10A  O  3 49DSPATR(HI)
     A                                  3 61'Ex-date'
     A            #EXDT          6A  O  3 69DSPATR(HI)
     A*
     A                                  5  1'Action'
     A                                  5 11'Ref.'
     A                                  5 20'Security'
     A                                  5 32'Ex-Date'
     A                                  5 43'Redeem'
     A                                  5 51'Last  Final'
     A                                  5 64'Status'
     A                                  5 72'Correct'
     A*
     A                                  6  1'(     )'
     A                                  6 11'Number'
     A                                  6 20'Shortname'
     A                                  6 43'Date'
     A                                  6 51'Allocation'
     A                                  6 72'Ref.'
     A            #1SEL          1A  O  8  3TEXT('Selection Field')
     A                                      DSPATR(HI)
     A            #1REFN         6A  O  8 11TEXT('Reference Number')
     A                                      DSPATR(HI)
     A            #1SECN        10A  O  8 20TEXT('Security Shortname')
     A                                      DSPATR(HI)
     A            #1EXDT         6A  O  8 32TEXT('Ex-Date')
     A                                      DSPATR(HI)
     A            #1RDAT         6A  O  8 43TEXT('Redemption Date')
     A                                      DSPATR(HI)
     A            #1LASA         6A  O  8 51TEXT('Last Allocation')
     A                                      DSPATR(HI)
     A            #1FINA         1A  O  8 60TEXT('Final Allocation')
     A                                      DSPATR(HI)
     A            #1STAT         1A  O  8 66TEXT('Status')
     A                                      DSPATR(HI)
     A            #1CORR         6A  O  8 72TEXT('Correct Reference')
     A                                      DSPATR(HI)
     A                                 11 20'CONFIRM'
     A  40                             11 28'REVERSAL'
     A  41                             11 28'ALLOCATION'
     A  42                             11 28'AUTHORISATION'
     A            #1CONF         1A  B 11 42TEXT('Confirmation Field')
     A*                                              End   /S01496/
     A N44                                  DSPATR(HI UL)
     A  44                                  DSPATR(RI PC)
     A                                      CHECK(ER)
     A*
     A*=========================================================================
     A          R DETAILS
     A                                      OVERLAY
     A*                                              Begin /S01496/
     A*
     A*                                              End   /S01496/
     A*                                              Begin /S01496/
     A***********                       1  2'SE6500'
     A***********                       1 15'EARLY REDEMPTIONS MAINTENANCE'
     A***********                           DSPATR(HI)
     A*********** DSPNUM         9A  O  1 52
     A*********** ##MRDT         7A  O  1 63TEXT('Midas Rundate')
     A*********** ##TME          6Y 0O  1 72TEXT('Time')
     A***********                           EDTWRD('  :  :  ')
     A*
     A            ##USR     R        O  1  2REFFLD(USER)
     A                                  1 13'SE6500'
     A                                  1 26'EARLY REDEMPTIONS MAINTENANCE'
     A                                      DSPATR(HI)
     A                                  1 67'DATE '
     A            ##MRDT    R        O  1 73REFFLD(RUNA)
     A*
     A            ##JOB     R        O  2  2REFFLD(JOJOB)
     A                                  2 67'TIME '
     A            ##TME          6  0   2 73EDTWRD('  :  :  ')
     A*                                              End   /S01496/
     A*
     A                                  4  4'Reference'
     A            #1REFN         6A  O  4 26TEXT('Reference Number')
     A                                      DSPATR(HI)
     A                                  6  4'Security'
     A            #1SECN        10A  O  6 26TEXT('Security Shortname')
     A                                      DSPATR(HI)
     A            #1SFN1        30A  O  6 38TEXT('Security Full Name')
     A                                      DSPATR(HI)
     A            #1SFN2        30A  O  7 38TEXT('Security Full name')
     A                                      DSPATR(HI)
     A                                  9  4'Ex-Date'
     A            #1EXDT         6A  O  9 26TEXT('Ex-Date')
     A                                      DSPATR(HI)
     A                                 11  4'Redemption Date'
     A            #1RDAT         6A  O 11 26TEXT('Redemption Date')
     A                                      DSPATR(HI)
     A                                 14  4'Payment Date'
     A            #1ERPD         6A  B 14 26TEXT('Payment Date')
     A N65                                  DSPATR(HI)
     A N65N49                               DSPATR(UL)
     A  49                                  DSPATR(PR)
     A  65                                  DSPATR(PC RI)
     A                                 16  4'Redemption Price'
     A            #1REDP        12A  B 16 26TEXT('Redemption Price')
     A N66                                  DSPATR(HI)
     A N66N48                               DSPATR(UL)
     A  48                                  DSPATR(PR)
     A  66                                  DSPATR(PC RI)
     A                                 18  4'Redemption Narrative'
     A*******   /CSE040/  Begin
     A************#1RNAR        35A  B 18 26TEXT('Redemption Narrative')
     A            #1RNAR        33A  B 18 26TEXT('Redemption Narrative')
     A*******   /CSE040/  End
     A N67                                  DSPATR(HI)
     A N67N48                               DSPATR(UL)
     A  48                                  DSPATR(PR)
     A  67                                  DSPATR(PC RI)
     A*
     A*=========================================================================
