      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas SE Unrealized P&L Analysis Rpt Pmpt')
     A*            14:00:23    MNEBUSEII   REL-R08M00  5714-UT1
     A*************************************************************************
     A*                                                                       *
     A*  Midas - Securities Trading Module
     A*                                                                       *
     A*     SEC0902DF - PROMPT FOR UNREALISED P & L ANALYSIS RPT              *
     A*                                                                       *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                                       *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. E39162             DATE 18JUN92               *
     A*  PREV AMEND NO. S01117                  17JAN91               *
     A*                 E23248                  07SEP90               *
     A*                 S01253                  17APR90               *
     A*                 E16600                  27JUL89               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *  *E16600
     A*  E39162 - CHANGE 'PRINT' TO 'PRINT(MPRINT)'.                  *
     A*  S01117 - MULTIBRANCHING                                      *
     A*  E23248 - ALLOW USER TO REQUEST YIELDS ON SE0915              *
     A*  S01253  -  RECOMPILED FOR MULTILANGUAGE SCREENS              *
     A*  E16600 - PROMPT HEADING IN WRONG POSITION.                   *  *E16600
     A*                                                                       *
     A*************************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A*********        START OF CHANGE                     /E39162/
     A*********                             PRINT
     A                                      PRINT(MPRINT)
     A*                END OF CHANGE                       /E39162/
     A                                      CA03(01 'Exit Program')
     A*                                                        /S01117/
     A                                      CF12(12)
     A  11                                  CF10(10)
     A*                                                        /S01117/
     A          R SEC0902D1                 TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                      PUTOVR
     A                                  1 72'WSID'
     A            WSIDL          3A  O  1 78OVRDTA
     A*                                                                 /E16600/
     A************************          3 23'UNREALISED PROFIT AND LOSS ANALYSI-
     A                                  1 23'UNREALISED PROFIT AND LOSS ANALYSI-
     A                                      S'
     A*                                                                 /E16600/
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  8 10'Enter the Date Basis on which the -
     A                                      report is required -'
     A                                 10 25'Trade Date (T)'
     A                                 11 22'or Value Date (V)'
     A                                 12 22'or Both       (B) :'
     A*                                                        /S01117/
     A************OPTION         1A  B 12 44DSPATR(HI)
     A**97********                          DSPATR(RI)
     A*N97********                          DSPATR(UL)
     A            OPTION         1A  B 12 44
     A  97                                  DSPATR(RI PC)
     A N11N13                               DSPATR(UL)
     A  11
     AO 13                                  DSPATR(PR)
     A*                                                        /S01117/
     A                                      OVRDTA
     A                                      OVRATR
     A*                                                  START /E23248/
     A***************************16 10'(Installation Control : Unrealised-E23248
     A*********************************Profit Basis ='                    E23248
     A************UPBS           1A  O 16 60OVRDTA                        E23248
     A*********************************16 62')'                           E23248
     A***************************19 10'Enter to continue, or F3 to end.'  E23248
     A***************************24  2'Invalid entry.  Valid values are T-E23248
     A********************************,V or B'                            E23248
     A                                 14 10'(Installation Control : Unrealised-
     A                                       Profit Basis ='
     A            UPBS           1A  O 14 60OVRDTA
     A                                 14 62')'
     A                                 17 10'Enter the price format for yield -
     A                                      based securities -'
     A                                 19 25'Yield Rate (Y)'
     A                                 20 22'or Percentage (P) :'
     A*                                                        /S01117/
     A************PRTYPE         1A  B 20 44DSPATR(HI)
     A**96********                          DSPATR(RI)
     A*N96********                          DSPATR(UL)
     A            PRTYPE         1A  B 20 44
     A  96                                  DSPATR(RI PC)
     A N11N13                               DSPATR(UL)
     A  11
     AO 13                                  DSPATR(PR)
     A*                                                        /S01117/
     A                                      OVRDTA
     A                                      OVRATR
     A*                                                        /S01117/
     A************                     22 10'Enter to continue, or F3 to end.'
     A N11                             22 10'Enter to Continue, F3 to End +
     A                                      or F12 for Previous screen.'
     A  11                             22 10'Enter to Continue, F3 to End, +
     A                                      F12 for Previous screen or +
     A                                      F10 to Delete.'
     A*                                                        /S01117/
     A                                 23  2'Invalid entry.  Valid values are T-
     A                                      ,V or B'
     A*                                                     END /E23248/
     A                                      DSPATR(HI)
     A N97                                  DSPATR(ND)
     A                                      OVRATR
     A*                                                  START /E23248/
     A                                 24  2'Invalid entry.  Valid values are Y-
     A                                       or P'
     A                                      DSPATR(HI)
     A N96                                  DSPATR(ND)
     A                                      OVRATR
     A*                                                    END /E23248/
