     A*****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('SE Securities Details 2 LUX Display')
      *****************************************************************
      *                                                               *
      *  Misys - Standing Data Module                                 *
      *                                                               *
      *  DSPF/SESEC2LDF - SE Securities Details 2 LUX Display         *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2005            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CER001  *Create    Date 25Apr05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CER001 - LUX Upgrade to MidasPlus                            *
      *                                                               *
      *****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/MFRFL)
     A                                      PRINT(*LIBL/MPRINT)
     A                                      INDARA
     A                                      CF03(03)
     A                                      CA05(05)
      *
     A          R SESEC2LF0
     A                                      TEXT('(c) Misys International Banki-
     A                                      ng Systems Ltd. 2005')
     A                                      CF12(12 'Previous')
     A                                      OVERLAY
     A                                      PUTOVR
     A            SUSER         10A  O  1  2TEXT('User Name')
     A                                  1 13'SESECS7DP'
     A            SJOB          10A  O  2  2TEXT('Workstation Id')
     A                                  1 65'Date:'
     A            BJMRDT         7A  O  1 72
     A                                  2 65'Time:'
     A                                  2 71TIME
     A                                  2 26'European Reporting - Luxembourg'
     A                                      DSPATR(HI)
     A                                 23 40'F12=Previous'
     A                                      COLOR(BLU)
     A                                 23  1'F3=Main Menu'
     A                                      COLOR(BLU)
     A                                 23 15'F5=Refresh'
     A                                      COLOR(BLU)
     A                                 23 27'F10=Delete'
     A                                      COLOR(BLU)
      *
     A                                  5  1'Lump-Sum code ____________________-
     A                                      _______:'
     A            L6LXLUSU       2A  B  5 44OVRDTA
     A N50
     AO 20                                  DSPATR(HI)
     A  50                                  DSPATR(RI)
     A  50N20                               DSPATR(PC)
     A  20                                  DSPATR(PR)
     A N20                                  DSPATR(UL)
      *
     A                                  6  1'Subordinate ______________________-
     A                                      _______:'
     A            L6LXSUBR       1A  B  6 44OVRDTA
     A N51
     AO 20                                  DSPATR(HI)
     A  51                                  DSPATR(RI)
     A  51N20                               DSPATR(PC)
     A  20                                  DSPATR(PR)
     A N20                                  DSPATR(UL)
      *
     A                                  7  1'LMI Circular 96 / 127 ____________-
     A                                      _______:'
     A            L6LXIM93       1A  B  7 44OVRDTA
     A N52
     AO 20                                  DSPATR(HI)
     A  52                                  DSPATR(RI)
     A  52N20                               DSPATR(PC)
     A  20                                  DSPATR(PR)
     A N20                                  DSPATR(UL)
      *
     A                                  8  1'Claims Type ______________________-
     A                                      _______:'
     A            L6LXCLAT       1A  B  8 44OVRDTA
     A N53
     AO 20                                  DSPATR(HI)
     A  53                                  DSPATR(RI)
     A  53N20                               DSPATR(PC)
     A  20                                  DSPATR(PR)
     A N20                                  DSPATR(UL)
      *
     A                                  9  1'Security Type ____________________-
     A                                      _______:'
     A            L6LXSECT       2A  B  9 44OVRDTA
     A N54
     AO 20                                  DSPATR(HI)
     A  54                                  DSPATR(RI)
     A  54N20                               DSPATR(PC)
     A  20                                  DSPATR(PR)
     A N20                                  DSPATR(UL)
      *
     A                                 10  1'Rating Office Code  ______________-
     A                                      _______:'
     A            L6LXROFC       3A  B 10 44OVRDTA
     A N55
     AO 20                                  DSPATR(HI)
     A  55                                  DSPATR(RI)
     A  55N20                               DSPATR(PC)
     A  20                                  DSPATR(PR)
     A N20                                  DSPATR(UL)
      *
     A                                 11  1'Rating Code ______________________-
     A                                      _______:'
     A            L6LXRATC      12A  B 11 44OVRDTA
     A N56
     AO 20                                  DSPATR(HI)
     A  56                                  DSPATR(RI)
     A  56N20                               DSPATR(PC)
     A  20                                  DSPATR(PR)
     A N20                                  DSPATR(UL)
      *
     A                                 12  1'Voting Right in % ________________-
     A                                      _______:'
     A            L6LXVOTR       6A  B 12 44OVRDTA
     A N57
     AO 20                                  DSPATR(HI)
     A  57                                  DSPATR(RI)
     A  57N20                               DSPATR(PC)
     A  20                                  DSPATR(PR)
     A N20                                  DSPATR(UL)
      *
     A                                 13  1'Guarantees to be maintained (Y/N) -
     A                                      _______:'
     A            L6LXER91       1A  B 13 44OVRDTA
     A N70
     AO 20                                  DSPATR(HI)
     A  70                                  DSPATR(RI)
     A  70N20                               DSPATR(PC)
     A  20                                  DSPATR(PR)
     A N20                                  DSPATR(UL)
      *
     A  80                             14  1'Security Code ____________________-
     A                                      _______:'
     A  80        L6LXSECD      15A  B 14 44OVRDTA
     A N58
     AO 20                                  DSPATR(HI)
     A  58                                  DSPATR(RI)
     A  58N20                               DSPATR(PC)
     A  20                                  DSPATR(PR)
     A N20                                  DSPATR(UL)
      *
     A  80                             15  1'Security National Code  __________-
     A                                      _______:'
     A  80        L6LXSNCD       3A  B 15 44OVRDTA
     A N59
     AO 20                                  DSPATR(HI)
     A  59                                  DSPATR(RI)
     A  59N20                               DSPATR(PC)
     A  20                                  DSPATR(PR)
     A N20                                  DSPATR(UL)
      *
     A  80                             16  1'Quoted on "EEE" Regulated Mrkt Ctr-
     A                                      e (Y/N):'
     A  80        L6LXEEEM       1A  B 16 44OVRDTA
     A N60
     AO 20                                  DSPATR(HI)
     A  60                                  DSPATR(RI)
     A  60N20                               DSPATR(PC)
     A  20                                  DSPATR(PR)
     A N20                                  DSPATR(UL)
      *
     A  81                             17  1'Quoted (Y/N) _____________________-
     A                                      _______:'
     A  81        L6LXQUOT       1A  B 17 44OVRDTA
     A N61
     AO 20                                  DSPATR(HI)
     A  61                                  DSPATR(RI)
     A  61N20                               DSPATR(PC)
     A  20                                  DSPATR(PR)
     A N20                                  DSPATR(UL)
      *
     A          R #MSGRCD                   TEXT('Program messages')
     A                                      SFL SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            ##PGM                     SFLPGMQ
      *
     A          R #MSGCTL                   TEXT('Program messages')
     A                                      SFLCTL(#MSGRCD)
     A                                      SFLPAG(01) SFLSIZ(03)
     A                                      SFLINZ SFLDSP SFLDSPCTL
     A N25                                  SFLEND
     A            ##PGM                     SFLPGMQ
