      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas SE Additional SWIFT detail for trade maint')     *
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *  DSPF/SETSSIDSDF - Additional SSI for SWIFT (Trades)          *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. AR580857           Date 21Jul10               *
      *                 AR325342           Date 19May10               *
      *                 CSW210             Date 04May10               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSW206E            Date 24Aug06               *
      *                 CSW206D            Date 24Aug06               *
      * Midas Release 4.01.02 ----------------------------------------*
      *                 209247             Date 08Oct02               *
      * Midas Release 4.01 -------------------------------------------*
      *                 CSE034             Date 30Apr02               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 CSE028  *CREATE    Date 06Jun01               *
      *                                    Date ddmmmyy               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  AR580857 - QFIN label is erroneous                           *
      *  AR325342 - Clearing correspondent field must not be displayed*
      *  CSW210 - SWIFT 2010 Changes                                  *
      *  CSW206E - Change Control for SWIFT 2006 Standard Changes     *
      *  CSW206D - Change Control for SWIFT 2006 Standard Changes     *
      *  209247 - Add Custodian and Safe A/c narrative                *
      *  CSE034 - Standard Settlement Instructions improvements       *
      *  CSE028 - Standing Settlement Instructions Enhancement.       *
      *                                                               *
      *****************************************************************
     A                                      PRINT(MPRINT)
     A                                      CHGINPDFT
     A                                      MSGLOC(24)
     A                                      REF(MFRFL)
     A                                      INDARA
 
     A                                      CF03
     A                                      CF05
     A                                      CF12
 
     A  88                                  ROLLUP(03)
     A  89                                  ROLLDOWN(04)
 
      *-------------------------------------------------------------------*
      **  Screen one for internal customer                                *
      *-------------------------------------------------------------------*
 
     A          R SETSSIDSF1                TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
 
     A                                      OVERLAY PUTOVR
 
     A            #1USER    R        O  1  2REFFLD(USER)
     A                                  1 14'SETSSIDSF1'
     A                                  1 27'SETTLEMENT DETAILS FOR SWIFT'
     A                                      DSPATR(UL HI)
     A                                  1 66'Date:'
     A            #1DATE         7A  O  1 73TEXT('Midas Rundate')
 
     A            #1WID         10A  O  2  2TEXT('Workstation ID')
     A  80                              2 32'(Trade Purchase)'
     A                                      DSPATR(HI)
     A N80                              2 32'  (Trade Sale)  '
     A                                      DSPATR(HI)
     A                                  2 66'Time:'
     A                                  2 72TIME
 
     A                                  4  2'Branch'
     A            #1BRCH         3A  O  4 12DSPATR(HI)
     A                                      OVRDTA
     A  81                              4 18'Customer'
     A  81        #1CUST         6A  O  4 28
     A  81                                  DSPATR(HI)
     A                                      OVRDTA
     A N81                              4 18'Book'
     A N81        #1BOOK         2A  O  4 28
     A N81                                  DSPATR(HI)
     A                                      OVRDTA
     A            #1DESC        20A  O  4 35DSPATR(HI)
     A                                      OVRDTA
 
     A                                  5  2'Currency'
     A            #1CCY          3A  O  5 12DSPATR(HI)
     A                                      OVRDTA
     A**Start of change CSE034
     A                                  5 18'Mkt Centre'
     A            #1MKCT         2A  O  5 30DSPATR(HI)
     A                                      OVRDTA
     A**********                        5 18'Inv. Type'                                       CSE034
     A**********  #1INVT         3A  O  5 28DSPATR(HI)                                        CSE034
     A**********                            OVRDTA                                            CSE034
     A**84******                        5 35'Portfolio'                                       CSE034
     A**84******  #1PORF         4A  O  5 45DSPATR(HI)                                        CSE034
     A**********                            OVRDTA                                            CSE034
     A                                  5 35'Inv. Type'
     A            #1INVT         3A  O  5 45DSPATR(HI)
     A                                      OVRDTA
     A  84                              5 52'Portfolio'
     A  84        #1PORF         4A  O  5 63DSPATR(HI)
     A                                      OVRDTA
     A**End of change CSE034
 
      **Start of change CSW210
     A**********                        8  2'A/c with Institution'                            CSW210
     A**********  #1AWIN        10A  B  8 24DSPATR(HI)                                        CSW210
     A                                 12  2'A/c with Institution'
     A            #1AWIN        10A  B 12 24DSPATR(HI)
      **End of change CSW210
     A N10N82                               DSPATR(UL)
     A  10                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
      **Start of change CSW210
     A**********  #1AWIL        35A  B  8 36DSPATR(HI)                                        CSW210
     A            #1AWIL        35A  B 12 36DSPATR(HI)
      **End of change CSW210
     A N11N82                               DSPATR(UL)
     A  11                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
      **Start of change CSW210
     A**********                        9  2'A/c for Payment'                                 CSW210
     A**********  #1AFPN        10A  B  9 24DSPATR(HI)                                        CSW210
     A                                  8  2'A/c for Payment'
     A            #1AFPN        10A  B  8 24DSPATR(HI)
      **End of change CSW210
     A N12N82                               DSPATR(UL)
     A  12                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
      **Start of change CSW210
     A**********  #1AFPL        35A  B  9 36DSPATR(HI)                                        CSW210
     A            #1AFPL        35A  B  8 36DSPATR(HI)
      **End of change CSW210
     A N13N82                               DSPATR(UL)
     A  13                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
      **Start of change CSW210
     A**********                       10  2'Beneficiary of Money'                            CSW210
     A**********  #1BOFN        10A  B 10 24DSPATR(HI)                                        CSW210
     A                                 13  2'Beneficiary of Money'
     A            #1BOFN        10A  B 13 24DSPATR(HI)
      **End of change CSW210
     A N14N82                               DSPATR(UL)
     A  14                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
      **Start of change CSW210
     A**********  #1BOF1        35A  B 10 36DSPATR(HI)                                        CSW210
     A            #1BOF1        35A  B 13 36DSPATR(HI)
      **End of change CSW210
     A N15N82                               DSPATR(UL)
     A  15                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
      **Start of change CSW210
     A**********  #1BOF2        35A  B 11 36DSPATR(HI)                                        CSW210
     A N98        #1BOF2        35A  B 14 36DSPATR(HI)
      **End of change CSW210
     A N16N82                               DSPATR(UL)
     A  16                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
      **Start of change CSW210
     A**********                       13  2'Sender to Receiver Information'                  CSW210
     A**********  #1SRL1        35A  B 13 36DSPATR(HI)                                        CSW210
     A                                 15  2'Sender to Receiver Information'
     A            #1SRL1        35A  B 15 36DSPATR(HI)
      **End of change CSW210
     A N17N82                               DSPATR(UL)
     A  17                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
      **Start of change CSW210
     A**********  #1SRL2        35A  B 14 36DSPATR(HI)                                        CSW210
     A            #1SRL2        35A  B 16 36DSPATR(HI)
      **End of change CSW210
     A N18N82                               DSPATR(UL)
     A  18                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
      **Start of change CSW210
     A**********  #1SRL3        35A  B 15 36DSPATR(HI)                                        CSW210
     A            #1SRL3        35A  B 17 36DSPATR(HI)
      **End of change CSW210
     A N19N82                               DSPATR(UL)
     A  19                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
      **Start of change CSW210
     A**********                       16  2'Narrative (for Cash Parties)'                    CSW210
     A**********  #1NAC1        35A  B 16 36DSPATR(HI)                                        CSW210
     A                                 18  2'Narrative (for Cash Parties)'
     A            #1NAC1        35A  B 18 36DSPATR(HI)
      **End of change CSW210
     A N20N82                               DSPATR(UL)
     A  20                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
      **Start of change CSW210
     A**********  #1NAC2        35A  B 17 36DSPATR(HI)                                        CSW210
     A            #1NAC2        35A  B 19 36DSPATR(HI)
      **End of change CSW210
     A N21N82                               DSPATR(UL)
     A  21                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
      **Start of change CSW210
     A  98                              9  2'Debtor'
     A  98        @DEBTR1       10A  B  9 24DSPATR(HI)
     A N86N82                               DSPATR(UL)
     A  86                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
     A  98        @DACNT1       35A  B  9 36DSPATR(HI)
     A N87N82                               DSPATR(UL)
     A  87                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
     A  98        @DADDR1       35A  B 10  7DSPATR(HI)
     A N92N82                               DSPATR(UL)
     A  92                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
     A  98        @DADDR2       35A  B 10 44DSPATR(HI)
     A N93N82                               DSPATR(UL)
     A  93                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
     A  98        @DADDR3       35A  B 11  7DSPATR(HI)
     A N94N82                               DSPATR(UL)
     A  94                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
     A  98        @DADDR4       35A  B 11 44DSPATR(HI)
     A N95N82                               DSPATR(UL)
     A  95                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
      **End of change CSW210
 
      *-------------------------------------------------------------------*
      **  Screen one for non-internal customer                            *
      *-------------------------------------------------------------------*
 
     A          R SETSSIDSF2                TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
 
     A                                      OVERLAY PUTOVR
 
     A            #1USER    R        O  1  2REFFLD(USER)
     A                                  1 14'SETSSIDSF2'
     A                                  1 27'SETTLEMENT DETAILS FOR SWIFT'
     A                                      DSPATR(UL HI)
     A                                  1 66'Date:'
     A            #1DATE         7A  O  1 73TEXT('Midas Rundate')
 
     A            #1WID         10A  O  2  2TEXT('Workstation ID')
     A  80                              2 32'(Trade Purchase)'
     A                                      DSPATR(HI)
     A N80                              2 32'  (Trade Sale)  '
     A                                      DSPATR(HI)
     A                                  2 66'Time:'
     A                                  2 72TIME
 
     A                                  4  2'Branch'
     A            #1BRCH         3A  O  4 12DSPATR(HI)
     A                                      OVRDTA
     A                                  4 18'Customer'
     A            #1CUST         6A  O  4 28
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A            #1DESC        20A  O  4 35DSPATR(HI)
     A                                      OVRDTA
 
     A                                  5  2'Currency'
     A            #1CCY          3A  O  5 12DSPATR(HI)
     A                                      OVRDTA
     A**Start of change CSE034
     A                                  5 18'Mkt Centre'
     A            #1MKCT         2A  O  5 30DSPATR(HI)
     A                                      OVRDTA
     A**********                        5 18'Inv. Type'                                       CSE034
     A**********  #1INVT         3A  O  5 28DSPATR(HI)                                        CSE034
     A**********                            OVRDTA                                            CSE034
     A**84******                        5 35'Portfolio'                                       CSE034
     A**84******  #1PORF         4A  O  5 45DSPATR(HI)                                        CSE034
     A**********                            OVRDTA                                            CSE034
     A                                  5 35'Inv. Type'
     A            #1INVT         3A  O  5 45DSPATR(HI)
     A                                      OVRDTA
     A  84                              5 52'Portfolio'
     A  84        #1PORF         4A  O  5 63DSPATR(HI)
     A                                      OVRDTA
     A**End of change CSE034
 
     A                                  8  2'Settlement Message Request'
     A            #2GMES         1A  B  8 34DSPATR(HI)
     A N22N82                               DSPATR(UL)
     A  22                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A                                  9  2'Confirmation Message Request'
     A            #2CONG         1A  B  9 34DSPATR(HI)
     A N23N82                               DSPATR(UL)
     A  23                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A                                 11  2'Instruction type'
     A            #2INST         3A  B 11 34DSPATR(HI)
     A N24N82                               DSPATR(UL)
     A  24                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A                                 11 40'Instruction sub-type'
     A            #2INSS         5A  B 11 63DSPATR(HI)
     A N25N82                               DSPATR(UL)
     A  25                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A                                 12  2'Requested Priority'
     A            #2RPTY         1A  B 12 34DSPATR(HI)
     A N26N82                               DSPATR(UL)
     A  26                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A                                 13  2'Guaranteed Delivery'
     A            #2GDEL         1A  B 13 34DSPATR(HI)
     A N27N82                               DSPATR(UL)
     A  27                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A                                 14  2'Senders Role'
     A            #2SROL         4A  B 14 34DSPATR(HI)
     A N28N82                               DSPATR(UL)
     A  28                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A  83                             15  2'Stamp Status'
     A            #2STMP         4A  B 15 34DSPATR(HI)
     A N29N82 83                            DSPATR(UL)
     A  29                                  DSPATR(PC RI)
     A  82
     AON83                                  DSPATR(PR)
     A N83                                  DSPATR(ND)
     A                                      OVRDTA
 
     A  83                             16  2'Charity Identifier'
     A            #2CHID        30A  B 16 34DSPATR(HI)
     A N30N82 83                            DSPATR(UL)
     A  30                                  DSPATR(PC RI)
     A  82
     AON83                                  DSPATR(PR)
     A N83                                  DSPATR(ND)
     A                                      OVRDTA
 
     A  83                             17  2'Transaction Report Marker'
     A            #2TRRM         4A  B 17 34DSPATR(HI)
     A N31N82 83                            DSPATR(UL)
     A  31                                  DSPATR(PC RI)
     A  82
     AON83                                  DSPATR(PR)
     A N83                                  DSPATR(ND)
     A                                      OVRDTA
 
     A                                 19  2'To be used for Depot Movement'
     A            #2DEPT         1A  O 19 36DSPATR(HI)
 
     A                                 20  4'Settlement against Payment/Free'
     A            #2FIND         1A  B 20 36DSPATR(HI)
     A N32N82N79                            DSPATR(UL)
     A  32                                  DSPATR(PC RI)
     A  79
     AO 82                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 20 39'(To be used for WALK-IN only)'
 
      *-------------------------------------------------------------------*
      **  Screen two for trade purchase                                   *
      *-------------------------------------------------------------------*
 
     A          R SETSSIDSF3                TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
 
     A                                      OVERLAY PUTOVR
 
     A            #1USER    R        O  1  2REFFLD(USER)
     A                                  1 14'SETSSIDSF3'
     A                                  1 27'SETTLEMENT DETAILS FOR SWIFT'
     A                                      DSPATR(UL HI)
     A                                  1 66'Date:'
     A            #1DATE         7A  O  1 73TEXT('Midas Rundate')
 
     A            #1WID         10A  O  2  2TEXT('Workstation ID')
     A                                  2 32'(Trade Purchase)'
     A                                      DSPATR(HI)
     A                                  2 66'Time:'
     A                                  2 72TIME
 
      ** Start of change AR325342
     A**********                        4  2'Clearing Correspondent'                        AR325342
     A N08                              4  2'Clearing Correspondent'
     A**********  #3CCTN        12A  B  4 44DSPATR(HI)                                      AR325342
     A*N33N82***                            DSPATR(UL)                                      AR325342
     A**33******                            DSPATR(PC RI)                                   AR325342
     A**82******                            DSPATR(PR)                                      AR325342
     A            #3CCTN        12A  B  4 44
     A N08                                  DSPATR(HI)
     A N33N82N08                            DSPATR(UL)
     A  33N08                               DSPATR(PC RI)
     A  82
     AO 08                                  DSPATR(PR)
     A  08                                  DSPATR(ND)
      ** End of change AR325342
     A                                      OVRDTA
 
     A                                  6  2'Deliverer of Securities'
     A            #3DRSN        10A  B  6 30DSPATR(HI)
     A N34N82                               DSPATR(UL)
     A  34                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A            #3DRS1        35A  B  6 44DSPATR(HI)
     A N35N82                               DSPATR(UL)
     A  35                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A            #3DRS2        35A  B  7 44DSPATR(HI)
     A N36N82                               DSPATR(UL)
     A  36                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
      * Start of Change 209247
     A  90                              8  2'Deliverer''s Custodian'
      * End of Change 209247
     A            #3DRS3        35A  B  8 44DSPATR(HI)
     A N37N82                               DSPATR(UL)
     A  37                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
      * Start of Change 209247
     A  90                              9  2'             Safe A/C'
      * End of Change 209247
     A            #3DRS4        35A  B  9 44DSPATR(HI)
     A N38N82                               DSPATR(UL)
     A  38                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A                                 11  2'Further Information'
     A            #3FIN1        35A  B 11 44DSPATR(HI)
     A N39N82                               DSPATR(UL)
     A  39                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A            #3FIN2        35A  B 12 44DSPATR(HI)
     A N40N82                               DSPATR(UL)
     A  40                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
      **Start of change CSW210
     A**********                       14  2'Registration Details'                            CSW210
     A**********  #3RED1        35A  B 14 44DSPATR(HI)                                        CSW210
     A*N41N82***                            DSPATR(UL)                                        CSW210
     A**41******                            DSPATR(PC RI)                                     CSW210
     A**82******                            DSPATR(PR)                                        CSW210
     A**********                            OVRDTA                                            CSW210
      **End of change CSW210
 
      **Start of change CSW210
     A**********  #3RED2        35A  B 15 44DSPATR(HI)                                        CSW210
     A*N42N82***                            DSPATR(UL)                                        CSW210
     A**42******                            DSPATR(PC RI)                                     CSW210
     A**82******                            DSPATR(PR)                                        CSW210
     A**********                            OVRDTA                                            CSW210
      **End of change CSW210
 
      **Start of change CSW210
     A**********                       17  2'Narrative'                                       CSW210
     A**********  #3NAS1        35A  B 17 44DSPATR(HI)                                        CSW210
     A                                 14  2'Narrative'
     A            #3NAS1        35A  B 14 44DSPATR(HI)
      **End of change CSW210
     A N43N82                               DSPATR(UL)
     A  43                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
      **Start of change CSW210
     A**********  #3NAS2        35A  B 18 44DSPATR(HI)                                        CSW210
     A            #3NAS2        35A  B 15 44DSPATR(HI)
      **End of change CSW210
     A N44N82                               DSPATR(UL)
     A  44                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
 
      *-------------------------------------------------------------------*
      **  Screen two for trade sale                                       *
      *-------------------------------------------------------------------*
 
     A          R SETSSIDSF4                TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
 
     A                                      OVERLAY PUTOVR
 
     A            #1USER    R        O  1  2REFFLD(USER)
     A                                  1 14'SETSSIDSF4'
     A                                  1 27'SETTLEMENT DETAILS FOR SWIFT'
     A                                      DSPATR(UL HI)
     A                                  1 66'Date:'
     A            #1DATE         7A  O  1 73TEXT('Midas Rundate')
 
     A            #1WID         10A  O  2  2TEXT('Workstation ID')
     A                                  2 34'(Trade Sale)'
     A                                      DSPATR(HI)
     A                                  2 66'Time:'
     A                                  2 72TIME
 
      ** Start of change AR325342
     A**********                        4  2'Clearing Correspondent'                        AR325342
     A N08                              4  2'Clearing Correspondent'
     A**********  #4CCTN        12A  B  4 44DSPATR(HI)                                      AR325342
     A*N45N82***                            DSPATR(UL)                                      AR325342
     A**45******                            DSPATR(PC RI)                                   AR325342
     A**82******                            DSPATR(PR)                                      AR325342
     A            #4CCTN        12A  B  4 44
     A N08                                  DSPATR(HI)
     A N45N82N08                            DSPATR(UL)
     A  45N08                               DSPATR(PC RI)
     A  82
     AO 08                                  DSPATR(PR)
     A  08                                  DSPATR(ND)
      ** End of change AR325342
     A                                      OVRDTA
 
     A                                  5  2'Receiver of Securities'
     A            #4DRSN        10A  B  5 30DSPATR(HI)
     A N46N82                               DSPATR(UL)
     A  46                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A            #4DRS1        35A  B  5 44DSPATR(HI)
     A N47N82                               DSPATR(UL)
     A  47                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A            #4DRS2        35A  B  6 44DSPATR(HI)
     A N48N82                               DSPATR(UL)
     A  48                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
      * Start of Change 209247
     A  90                              7  2'Receiver''s Custodian'
      * End of Change 209247
     A            #4DRS3        35A  B  7 44DSPATR(HI)
     A N49N82                               DSPATR(UL)
     A  49                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
      * Start of Change 209247
     A  90                              8  2'            Safe A/C'
      * End of Change 209247
     A            #4DRS4        35A  B  8 44DSPATR(HI)
     A N50N82                               DSPATR(UL)
     A  50                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A                                  9  2'Beneficiary Securities'
     A            #4BSSN        10A  B  9 30DSPATR(HI)
     A N51N82                               DSPATR(UL)
     A  51                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A            #4BSS1        35A  B  9 44DSPATR(HI)
     A N52N82                               DSPATR(UL)
     A  52                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A            #4BSS2        35A  B 10 44DSPATR(HI)
     A N53N82                               DSPATR(UL)
     A  53                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A                                 11  2'Further Information'
     A            #4FIN1        35A  B 11 44DSPATR(HI)
     A N54N82                               DSPATR(UL)
     A  54                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A            #4FIN2        35A  B 12 44DSPATR(HI)
     A N55N82                               DSPATR(UL)
     A  55                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
      **Start of change CSW210
     A**********                       13  2'Registration Details'                            CSW210
     A**********  #4RED1        35A  B 13 44DSPATR(HI)                                        CSW210
     A*N56N82***                            DSPATR(UL)                                        CSW210
     A**56******                            DSPATR(PC RI)                                     CSW210
     A**82******                            DSPATR(PR)                                        CSW210
     A**********                            OVRDTA                                            CSW210
      **End of change CSW210
 
      **Start of change CSW210
     A**********  #4RED2        35A  B 14 44DSPATR(HI)                                        CSW210
     A*N57N82***                            DSPATR(UL)                                        CSW210
     A**57******                            DSPATR(PC RI)                                     CSW210
     A**82******                            DSPATR(PR)                                        CSW210
     A**********                            OVRDTA                                            CSW210
      **End of change CSW210
 
      **Start of change CSW210
     A**********                       15  2'Narrative'                                       CSW210
     A**********  #4NAS1        35A  B 15 44DSPATR(HI)                                        CSW210
     A                                 13  2'Narrative'
     A            #4NAS1        35A  B 13 44DSPATR(HI)
      **End of change CSW210
     A N58N82                               DSPATR(UL)
     A  58                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
      **Start of change CSW210
     A**********  #4NAS2        35A  B 16 44DSPATR(HI)                                        CSW210
     A            #4NAS2        35A  B 14 44DSPATR(HI)
      **End of change CSW210
     A N59N82                               DSPATR(UL)
     A  59                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
      *-------------------------------------------------------------------*
      **  Screen three (available only if ISO15022 is on)                 *
      *-------------------------------------------------------------------*
 
     A          R SETSSIDSF5                TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
 
     A                                      OVERLAY PUTOVR
 
     A            #1USER    R        O  1  2REFFLD(USER)
     A                                  1 14'SETSSIDSF5'
     A                                  1 27'SETTLEMENT DETAILS FOR SWIFT'
     A                                      DSPATR(UL HI)
     A                                  1 66'Date:'
     A            #1DATE         7A  O  1 73TEXT('Midas Rundate')
 
     A            #1WID         10A  O  2  2TEXT('Workstation ID')
     A  80                              2 32'(Trade Purchase)'
     A                                      DSPATR(HI)
     A N80                              2 32'  (Trade Sale)  '
     A                                      DSPATR(HI)
     A                                  2 66'Time:'
     A                                  2 72TIME
 
     A                                  5 22'SETTLEMENT PARTIES'
     A                                  5 45'SAFEKEEPING ACCOUNT'
 
     A                                  7  2'Intermediary 1'
     A            #5IMMD1       12A  B  7 25DSPATR(HI)
     A N60N82                               DSPATR(UL)
     A  60                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A            #5IMSA1       20A  B  7 45DSPATR(HI)
     A N61N82                               DSPATR(UL)
     A  61                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A                                  8  2'Intermediary 2'
     A            #5IMMD2       12A  B  8 25DSPATR(HI)
     A N62N82                               DSPATR(UL)
     A  62                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A            #5IMSA2       20A  B  8 45DSPATR(HI)
     A N63N82                               DSPATR(UL)
     A  63                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A**Start of change CSW206D
     A**********                        9  2'Intermediary 3'
     A**********  #5IMMD3       12A  B  9 25DSPATR(HI)
     A*N64N82***                            DSPATR(UL)
     A**64******                            DSPATR(PC RI)
     A**82******                            DSPATR(PR)
     A**********                            OVRDTA
 
     A**********  #5IMSA3       20A  B  9 45DSPATR(HI)
     A*N65N82***                            DSPATR(UL)
     A**65******                            DSPATR(PC RI)
     A**82******                            DSPATR(PR)
     A**********                            OVRDTA
 
     A**********                       10  2'Intermediary 4'
     A**********  #5IMMD4       12A  B 10 25DSPATR(HI)
     A*N66N82***                            DSPATR(UL)
     A**66******                            DSPATR(PC RI)
     A**82******                            DSPATR(PR)
     A**********                            OVRDTA
 
     A**********  #5IMSA4       20A  B 10 45DSPATR(HI)
     A*N67N82***                            DSPATR(UL)
     A**67******                            DSPATR(PC RI)
     A**82******                            DSPATR(PR)
     A**********                            OVRDTA
 
     A**********                       11  2'Intermediary 5'
     A**********  #5IMMD5       12A  B 11 25DSPATR(HI)
     A*N68N82***                            DSPATR(UL)
     A**68******                            DSPATR(PC RI)
     A**82******                            DSPATR(PR)
     A**********                            OVRDTA
 
     A**********  #5IMSA5       20A  B 11 45DSPATR(HI)
     A*N69N82***                            DSPATR(UL)
     A**69******                            DSPATR(PC RI)
     A**82******                            DSPATR(PR)
     A**********                            OVRDTA
 
     A**********                       12  2'Intermediary 6'
     A**********  #5IMMD6       12A  B 12 25DSPATR(HI)
     A*N70N82***                            DSPATR(UL)
     A**70******                            DSPATR(PC RI)
     A**82******                            DSPATR(PR)
     A**********                            OVRDTA
 
     A**********  #5IMSA6       20A  B 12 45DSPATR(HI)
     A*N71N82***                            DSPATR(UL)
     A**71******                            DSPATR(PC RI)
     A**82******                            DSPATR(PR)
     A**********                            OVRDTA
 
     A**********                       13  2'Intermediary 7'
     A**********  #5IMMD7       12A  B 13 25DSPATR(HI)
     A*N72N82***                            DSPATR(UL)
     A**72******                            DSPATR(PC RI)
     A**82******                            DSPATR(PR)
     A**********                            OVRDTA
 
     A**********  #5IMSA7       20A  B 13 45DSPATR(HI)
     A*N73N82***                            DSPATR(UL)
     A**73******                            DSPATR(PC RI)
     A**82******                            DSPATR(PR)
     A**********                            OVRDTA
 
     A**********                       14  2'Intermediary 8'
     A**********  #5IMMD8       12A  B 14 25DSPATR(HI)
     A*N74N82***                            DSPATR(UL)
     A**74******                            DSPATR(PC RI)
     A**82******                            DSPATR(PR)
     A**********                            OVRDTA
 
     A**********  #5IMSA8       20A  B 14 45DSPATR(HI)
     A*N75N82***                            DSPATR(UL)
     A**75******                            DSPATR(PC RI)
     A**82******                            DSPATR(PR)
     A**********                            OVRDTA
 
     A**********                       15  2'Intermediary 9'
     A**********  #5IMMD9       12A  B 15 25DSPATR(HI)
     A*N76N82***                            DSPATR(UL)
     A**76******                            DSPATR(PC RI)
     A**82******                            DSPATR(PR)
     A**********                            OVRDTA
 
     A**********  #5IMSA9       20A  B 15 45DSPATR(HI)
     A*N77N82***                            DSPATR(UL)
     A**77******                            DSPATR(PC RI)
     A**82******                            DSPATR(PR)
     A**********                            OVRDTA
 
     A**********                       17  2'Place of Settlement'
     A**********  #5PSET        12A  B 17 25DSPATR(HI)
     A**Start of change CSW206E
     A**********                       10  2'Place of Settlement'                            CSW206E
     A**********  #5PSET        12A  B 10 25DSPATR(HI)                                       CSW206E
     A N85                              9  2'Intermediary 3'
     A N85        #5IMMD3       12A  B  9 25DSPATR(HI)
     A N64N82                               DSPATR(UL)
     A  64                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A N85        #5IMSA3       20A  B  9 45DSPATR(HI)
     A N65N82                               DSPATR(UL)
     A  65                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A N85                             10  2'Intermediary 4'
     A N85        #5IMMD4       12A  B 10 25DSPATR(HI)
     A N66N82                               DSPATR(UL)
     A  66                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A N85        #5IMSA4       20A  B 10 45DSPATR(HI)
     A N67N82                               DSPATR(UL)
     A  67                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A N85                             11  2'Intermediary 5'
     A N85        #5IMMD5       12A  B 11 25DSPATR(HI)
     A N68N82                               DSPATR(UL)
     A  68                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A N85        #5IMSA5       20A  B 11 45DSPATR(HI)
     A N69N82                               DSPATR(UL)
     A  69                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A N85                             12  2'Intermediary 6'
     A N85        #5IMMD6       12A  B 12 25DSPATR(HI)
     A N70N82                               DSPATR(UL)
     A  70                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A N85        #5IMSA6       20A  B 12 45DSPATR(HI)
     A N71N82                               DSPATR(UL)
     A  71                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A N85                             13  2'Intermediary 7'
     A N85        #5IMMD7       12A  B 13 25DSPATR(HI)
     A N72N82                               DSPATR(UL)
     A  72                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A N85        #5IMSA7       20A  B 13 45DSPATR(HI)
     A N73N82                               DSPATR(UL)
     A  73                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A N85                             14  2'Intermediary 8'
     A N85        #5IMMD8       12A  B 14 25DSPATR(HI)
     A N74N82                               DSPATR(UL)
     A  74                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A N85        #5IMSA8       20A  B 14 45DSPATR(HI)
     A N75N82                               DSPATR(UL)
     A  75                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A N85                             15  2'Intermediary 9'
     A N85        #5IMMD9       12A  B 15 25DSPATR(HI)
     A N76N82                               DSPATR(UL)
     A  76                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A N85        #5IMSA9       20A  B 15 45DSPATR(HI)
     A N77N82                               DSPATR(UL)
     A  77                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A N85                             17  2'Place of Settlement'
      **Start of change CSW210
     AON98
      **End of change CSW210
     A N85        #5PSET        12A  B 17 25DSPATR(HI)
      **Start of change CSW210
     AON98
      **End of change CSW210
     A N78N82                               DSPATR(UL)
     A  78                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
     A  85                             10  2'Place of Settlement'
      **Start of change CSW210
     AO 98
      **End of change CSW210
     A  85        #5PSET1       12A  B 10 25DSPATR(HI)
      **Start of change CSW210
     AO 98
      **End of change CSW210
     A**End of change CSW206E
     A**End of change CSW206D
     A N78N82                               DSPATR(UL)
     A  78                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
      **Start of change CSW210
     A  98                             11  2'Registration Details'
     A  98        #5RED1        35A  B 11 25DSPATR(HI)
     A N41N82                               DSPATR(UL)
     A  41                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A  98        #5RED2        35A  B 12 25DSPATR(HI)
     A N42N82                               DSPATR(UL)
     A  42                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
     A  98                             14  2'Place of Clearing'
      **Start of Change AR580857
     A**98******  #5PCL1        10A  B 14 25DSPATR(HI)                                      AR580857
     A  98        #5PCL1        10A  B 14 45DSPATR(HI)
      **End of Change AR580857
     A N56N82                               DSPATR(UL)
     A  56                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
 
      **Start of Change AR580857
     A**98******                       15  2'Qualified Foreign Inst'                        AR580857
     A**98******  #5QFI1        10A  B 15 25DSPATR(HI)                                      AR580857
     A  98                             15  2'Qualified Foreign +
     A                                      Intermediary'
     A  98        #5QFI1        10A  B 15 45DSPATR(HI)
      **End of Change AR580857
     A N57N82                               DSPATR(UL)
     A  57                                  DSPATR(PC RI)
     A  82                                  DSPATR(PR)
     A                                      OVRDTA
      **End of change CSW210
      *-------------------------------------------------------------------*
      ** Screen Footer                                                    *
      *-------------------------------------------------------------------*
 
     A          R SETSSIDSF6                TEXT('Screen Footer')
 
     A                                 23  2'F3=Exit'
     A                                      DSPATR(HI)
     A                                 23 11'F5=Refresh'
     A                                      DSPATR(HI)
     A                                 23 23'F12=Cancel'
     A                                      DSPATR(HI)
     A  88                             23 35'Rollup'
     A                                      DSPATR(HI)
     A  89                             23 43'Rolldown'
     A                                      DSPATR(HI)
 
      *-------------------------------------------------------------------*
      ** Message Subfile Format                                           *
      *-------------------------------------------------------------------*
 
     A          R SETSSIDSS1                TEXT('Program message subfile')
     A                                      SFL SFLMSGRCD(24)
     A            #1SFKY                    SFLMSGKEY
     A            #1PGMQ                    SFLPGMQ
 
      *-------------------------------------------------------------------*
      ** Messafe Subfile Control                                          *
      *-------------------------------------------------------------------*
 
     A          R SETSSIDSC1                TEXT('MSG SUBFILE CONTRL')
     A                                      SFLCTL(SETSSIDSS1)
     A                                      SFLPAG(01) SFLSIZ(50)
     A                                      OVERLAY PUTOVR
     A                                      SFLINZ SFLDSP
     A N96                                  SFLDSPCTL
     A  97                                  SFLEND
     A            #1PGMQ                    SFLPGMQ
 
