/*STD *  PRTFBASE                                                     *
/*EXS *  PR_AU60                                                      *
/*EXI *  TEXT('Midas HF Number of deleted records in extract')
     A*****************************************************************
     A*                                                               *
     A*  Midas - History and Audit Facility Module
     A*                                                               *
     A***PRTF/HF0310P1*-*HAF*Print*Program*****************************   091250
     A*  PRTF/HF0200AU - HAF Print Program                            *   091250
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. 091250             DATE 24FEB95               *
     A*  PREV AMEND NO. S01379             DATE 16SEP92               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  091250 - File renamed to HF0200AU as it is really an audit   *
     A*           report, and changed to standard creation parameters.*
     A*  S01379 - HISTORY AND AUDIT FACILITY                          *
     A*           NEW FILE CREATED FOR SAR                            *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
      *
      **---------------------------------------------------------------
      *
     A          R HF0200F1                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                      SKIPB(3)
      *
     A                                     6'REFERENCE'
     A**                                                              /*091250*/
     A************************************16'HF0200P1'
     A                                    16'HF0200AU'
     A**                                                              /*091250*/
     A            BJURPT    R             37REFFLD(URPT)
     A                                   100'DATE'
     A            BJMRDT    R            105REFFLD(RUNA)
     A                                   119'PAGE'
     A                                   124PAGNBR EDTCDE(Z)
     A                                      SPACEA(3)
      *
     A                                    38'DAILY EXTRACT:OMITTED'
     A                                    60'RECORDS FROM EXTRACTED JOURNAL'
     A                                      SPACEA(1)
     A                                    38'----------------------'
     A                                    60'------------------------------'
     A                                      SPACEA(3)
      *
     A                                    47'PROGRAM TO OMIT'
     A                                    64'NUMBER OMITTED'
     A                                      SPACEA(1)
     A                                    47'---------------'
     A                                    64'--------------'
     A                                      SPACEA(2)
      *
      **---------------------------------------------------------------
      *
     A          R HF0200F2                  TEXT('DETAIL RECORDS')
     A                                      SPACEB(1)
     A            NAME          10A  O    52
     A            COUN           6  0O    65EDTCDE(Z)
      *
      **---------------------------------------------------------------
      *
     A          R HF0200F4                  TEXT('DELETED DOUBLE/KEPT RECS')
     A                                      SPACEB(3)
     A                                    28'NUMBER OF DELETED DOUBLE RECORDS :'
     A            F4DOUB         6  0O    65EDTCDE(Z)
     A                                      SPACEA(2)
     A                                    28'NUMBER OF JE RECORDS KEPT ...... :'
     A            F4KEPT         6  0O    65EDTCDE(Z)
     A                                      SPACEA(1)
      *
      **---------------------------------------------------------------
      *
     A          R HF0200F3                  TEXT('END OF REPORT')
     A                                      SPACEB(2)
     A                                    52'*** END OF REPORT ***'
