      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_AU60                                                      *
/*EXI *  TEXT('Midas RE Determine ZB/Swep Hierarchy Relationships')
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  PRTF/RE100710AU - Determine Zero Balancing/Sweeping Hierarchy*
      *                    Relationships                              *
      *                                                               *
      *  (c) Finastra International Limited 2002                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CRE008  *CREATE    Date 05Mar02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CRE008 - Cash Management                                     *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
      *--------------------------------*
      ***  Report Header Record Format *
      *--------------------------------*
      *
     A          R HEADER                    TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2002')
      *
     A                                      SKIPB(3)
     A                                     6'REFERENCE RE100710AU'
     A            BJURPT    R             37REFFLD(URPT)
     A                                   101'DATE'
     A            BJMRDT    R            106REFFLD(MRDT)
     A                                   119'PAGE'
     A                                   124PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(1)
      *
     A                                   101'TIME'
     A                                   106TIME
     A                                      EDTWRD('  :  :  ')
     A                                      SPACEA(1)
      *
     A                                    47'DETERMINE ZERO BALANCING/SWEEPING +
     A                                      HIERARCHY RELATIONSHIPS - AUDIT '
     A                                      SPACEA(1)
      *
     A                                    47'----------------------------------+
     A                                      -------------------------------'
     A                                      SPACEA(3)
      *---------------*
      *** Run Details *
      *---------------*
      *
     A          R CONTROL
      *
     A                                    47'NUMBER OF RECORDS PROCESSED'
     A            PROCSEQ        9S 0     91 EDTCDE(Z)
     A                                      SPACEA(1)
      *
     A                                    47'NUMBER OF RECORDS ON FILE'
     A            NUM_RCDS      10S 0     90 EDTCDE(Z)
     A  60                               101'* DIFFERENCE *'
      *
