      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_AU60                                                      *
/*EXI *  TEXT('Midas Turnover Commissions Audit List')
     A*****************************************************************
     A*                                                               *
     A*  Midas   Retail Module
     A*                                                               *
     A*  PRTF/RE3117AU - TURNOVER COMMISSIONS AUDIT LIST              *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. S01413 *CREATE     DATE 13APR93               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  S01413 - Release 3 Incorporation                             *
     A*           and changes for Release 10 standards                *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A**
     A**   *************
     A**   AUDIT  HEADER
     A**   *************
     A**
     A          R HEADAU                    SKIPB(3)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                     7'REFERENCE'
     A                                    17'RE3117'
     A            TITL      R             37
     A                                   101'DATE'
     A            RUNA      R            106
     A                                   119'PAGE'
     A            PAGE         004S 0    124EDTCDE(3) SPACEA(2)
     A*
     A                                    42'TURNOVER'
     A                                    51'COMMISSION AUDIT LIST'
     A                                      SPACEA(1)
     A*
     A                                    42'---------'
     A                                    51'--------------------'
     A                                      SPACEA(2)
     A**
     A**   ************
     A**   AUDIT DETAIL
     A**   ************
     A**
     A          R TRATERRF                  SPACEB(1)
     A                                    18'TRANSACTION MISSING'
     A            TRAT      R             38
     A                                    48'SOURCE OF POSTING '
     A            SPOS      R             68
     A          R CCYERR                    SPACEB(1)
     A N70                                33'ACCOUNTS PROCESSED FOR FOLLOWING +
     A                                       CURRENCIES  WHICH ARE'
     A                                      SPACEA(1)
     A N70                                33'NOT MAINTAINED ON RETAIL ACCOUNTS +
     A                                       BY CURRENCY ICD      '
     A                                      SPACEA(2)
     A            CCY       R             48SPACEA(1)
