      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas RE Retail history future overdraft line rpt')
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  PRTF/RE3667P3 - Retail History Future OverDraft Line Report  *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 30Nov05               *
      *                 CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CRE001  *CREATE    Date 18Feb97               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CRE001 - Overdraft Interest Calculations                     *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
      *--------------------------------*
      ***  Report Header Record Format *
      *--------------------------------*
      *
     A          R HEADP3
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A                                      SKIPB(3)
     A                                     7'REFERENCE RE3667P3'
     A            TITL      R             37
     A                                   101'DATE'
     A            RUNA      R            106
     A                                   119'PAGE'
     A            PAGE3        004S 0    124EDTCDE(3) SPACEA(2)
      *
     A                                    40'Retail History '
     A                                    +0'Future '
     A                                    +0'Overdraft Line Report'
     A                                    90'Branch'
     A            BRCA#     R             97REFFLD(BRCA)
     A                                   101'-'
     A            BRNM      R            103
     A                                      SPACEA(1)
      *
     A                                    40'---------------'
     A                                    +0'-------'
     A                                    +0'---------------------'
     A                                      SPACEA(2)
      *
     A                                    35'Account Number'
     A                                    70'Overdraft Line'
     A                                   105'Value Date'
     A                                      SPACEA(1)
      *
     A                                    35'--------------'
     A                                    70'--------------'
     A                                   105'----------'
     A                                      SPACEA(1)
      *--------------------------------*
      ***  Report Detail Record Format *
      *--------------------------------*
      *
     A          R DETLP3                    SPACEB(1)
      *
     A            BRCA           3        35
     A                                    +0'-'
      * Begin /CSD027/
     A**********  CNUM           6  0     +0                                                  CSD027
     A            CNUM           6A       +0
      * End /CSD027/
     A                                    +0'-'
     A            CCY            3        +0
     A                                    +0'-'
     A**Start of change CGL029
     A**********  ACOD           4  0     +0                                                  CGL029
     A            ACOD          10  0     +0
     A**End of change CGL029
     A                                    +0'-'
     A            ACSQ           2  0     +0
     A            ODLN          11  0     70EDTWRD('  .   .   . 0 ')
     A            RHISD          7       105
      *
      *-------------------*
      ***  End Of Branch  *
      *-------------------*
      *
     A          R ENDBP3
     A                                      SPACEB(3)
     A                                    46'*** END OF REPORT FOR'
     A                                    67' BRANCH '
     A            BRCA#     R             75REFFLD(BRCA)
     A                                    78' ***'
      *
      *---------------------------*
      ***  Report Database Error  *
      *---------------------------*
      *
     A          R DBERP3
     A                                      SPACEB(2)
     A                                    19'**********************'
     A                                      SPACEA(1)
      *
     A                                    19'*   DATABASE ERROR   *'
     A                                      SPACEA(1)
      *
     A                                    19'**********************'
