      *****************************************************************
/********PRTFBASE                                                     *                       237730
/*STD *  PRTFPASSTL                                                   *                       237730
/*EXI *  TEXT('Midas RE Retail Account Transfer')
/********PR_STD60                                                     *                       237730
/*XAI *  CHGPRTF FILE(RE4112P1  ) PAGESIZE(36 83) OVRFLW(32)          *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Retail Module                                        *
     A*                                                               *
     A*  PRTF/RE4112P1 - Retail Account Transfer                      *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. 237730             Date 12Jun06               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. 093545             Date 08Sep95               *
     A*  PREV AMEND NO. 092429             DATE 24AUG95               *
     A*                 CRT001  *CREATE    DATE 28FEB95               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  237730 - Print to corresponding teller printer.              *
     A*  093545 - Standardize pagesize of confirmation slips.  Use    *
     A*           36 lines by 83 columns.                             *
     A*  092429 - Include RTS transaction narrative.                  *
     A*  CRT001 - Retail Teller System                                *
     A*                                                               *
     A*****************************************************************
     A*/COPY WNCPYSRC,RE4112P101
     A                                      REF(MFRFL)
      *
      ** Detail print
     A          R DETAIL                    TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A                                      SKIPB(13)
     A            BJMRDT         7        07
     A            TIME           6  0     15
     A                                      EDTWRD('0 :  :  ')
     A            PTLBC          3        24
     A            PTLID          3        29
     A            STTLU          5  0     33
     A                                      SPACEA(1)
     A*                                              Begin /092429/
     A  72
     AO 73                                 5'Operating Instructions:'
     A  72
     AO 73        NARRO         50        30
     A                                      SPACEA(2)
     A*                                              End   /092429/
      *
     A*/COPY WNCPYSRC,RE4112P103
     A            ACNO      R             07
     A            SDANAM        20        18
     A            SCQNF          8        40
     A                                      SPACEA(1)
      *
     A            SCCY1          3        07
     A            OTNAM         22        11
     A                                    33'DR'
     A                                      SPACEA(1)
      *
     A            SCACN         10        07
     A            OCANAM        20        18
     A*/COPY WNCPYSRC,RE4112P102
      *
