      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('UBS GL0720P1 Additional Narrative')                    *
      *****************************************************************
      *                                                               *
      *  UBS - GL Inhouse development                                 *
      *                                                               *
      *  PF/UGL0720PF - UBS GL0720P1 Additional Narrative             *
      *                                                               *
      *  Last Amend No. HUT107               Date 01APR20             *
      *  Prev Amend No. R00165A_UT *CREATE   Date 29Jun11             *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  HUT107    - UPGRADE HUT016 TO FBM 2.1 SP 22                  *
      *              ADDITIONAL 3RD PARTY TRUST INDICATOR             *
      *            - For packaging only                               *
      *  R00165A_UT - Trust Platform                                  *
      *                                                               *
      *****************************************************************
     A          R UGL0720PF0                TEXT('UGL0720PF')
     A            BRCA           3A         TEXT('Branch')
     A                                      COLHDG('Branch')
     A            CCY            3A         TEXT('Currency')
     A                                      COLHDG('Ccy')
     A            ACOD          10A         TEXT('Account Code')
     A                                      COLHDG('Account Code')
     A**********  ACSQ           2A         TEXT('Account Sequence')
     A**********                            COLHDG('Ac Seq')
     A            ANARR         50A         TEXT('Additional Narrative')
     A                                      COLHDG('Additional Narrative')
      *
     A          K BRCA
     A          K CCY
     A          K ACOD
