      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('MIdas/TI Account opening utility - details')
      *****************************************************************
      *                                                               *
      *  Midas - Midas/TI Interface                                   *
      *                                                               *
      *  PF/TIOPACPD - Report for Accounts Opened                     *
      *                For Midas/TI Interface                         *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *  Prev Amend No. CTI099  *CREATE    Date 25Aug99               *
      *                                    Date DDMmmYY               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CTI099 - Utility to open accounts for Midas/TI Interface     *
      *                                                               *
      *****************************************************************
     A          R TIOPACD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *--------------------------------------------------------------
     A            TOACTN         1          TEXT('Action Code')
     A                                      COLHDG('Act.Code')
     A            TOBRCH         3          TEXT('Branch Code')
     A                                      COLHDG('Brch')
     A            TOCUST         6          TEXT('Customer')
     A                                      COLHDG('Cust')
     A            TOCCY          3          TEXT('Currency Code')
     A                                      COLHDG('Ccy')
     A**Start of change CGL029
     A**********  TOACOD         4          TEXT('Account Code')                              CGL029
     A**********                            COLHDG('A/C Code')                                CGL029
     A            QQACOD         4A
     A**End of change CGL029
     A            TOACSQ         2          TEXT('Account Sequence')
     A                                      COLHDG('A/C Seq')
     A            TOANAM        25          TEXT('Account Name')
                                            COLHDG('A/C Name')
     A*
     A            TOTIAC         1          TEXT('TI Account Flag')
     A                                      COLHDG('TI A/C Flag')
     A            TOTIAN         6          TEXT('TI Account Number')
     A                                      COLHDG('TI a/c no.')
     A            TOTIAS         3          TEXT('TI Account Suffix')
     A                                      COLHDG('TI a/c suffix')
     A*
     A
      *
     A**Start of change CGL029
     A            TOACOD        10A         TEXT('Account Code')
     A**End of change CGL029
