      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FC Mandatory Output Insts Physical file')
     A**************************************************************
     A*                                                            *
     A*  Midas - Report Control Facility Module
     A*                                                            *
     A*   PF/FCMOUTPD - MANDATORY OUTPUT INSTRUCTIONS              *
     A*                                                            *
     A*  (c) Finastra International Limited 2001                   *
     A*                                                            *
     A*                                                            *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*     PREV AMEND NO.  0                 DATE   00/00/00      *
     A*                     0                 DATE   00/00/00      *
     A*                                                            *
     A**************************************************************
     /*T: Mandatory Output Insts    Physical file
     Z* CRTPF
      *
     H* Generated by  : Synon/2  Version:  8646
     H* Company    : Report Control Facility Model
     H* System     : Report Control Facility Model
     H* User name  : F6875SY
     H* Date       : 03/04/90 time: 09:01:57
      *  (c) Finastra International Limited 2001                      *
     H*
     A*  MD046248 - Finastra Rebranding                               *
     A*=====================================================================
     M* Maintenance   : *NONE
     A*=====================================================================
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A          R FCMOUTD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            D2RNAM        10          TEXT('Report name')
     A                                      COLHDG('Report' +
     A                                             'name')
     A            D2DFTO        10          TEXT('Default Output Id')
     A                                      COLHDG('Default Output Id')
     A            D2DLS1         8          TEXT('Distribution List part 1')
     A                                      COLHDG('Distribution' +
     A                                             'List part 1')
     A            D2DLS2         8          TEXT('Distribution List part 2')
     A                                      COLHDG('Distribution' +
     A                                             'List part 2')
     A            D2USRO        10          TEXT('User ID For Output')
     A                                      COLHDG('User ID For Output')
     A            D2ARMF         1          TEXT('Archived On Microfiche')
     A                                      COLHDG('Archived On' +
     A                                             'Microfiche')
     A            D2AROD         1          TEXT('Archived On Optical Disk')
     A                                      COLHDG('Archived On' +
     A                                             'Optical Disk')
     A            D2DFTU        10          TEXT('Default User ID')
     A                                      COLHDG('Default User ID')
     A            D2DRQD         1          TEXT('Distribution Required')
     A                                      COLHDG('Distribution' +
     A                                             'Required')
     A            D2TNLU         5  0       TEXT('Transaction No. Last Upd')
     A                                      COLHDG('Transaction' +
     A                                             'No. Last Upd')
     A                                      EDTCDE(4)
     A            D2CHTP         1          TEXT('Type of Last Change')
     A                                      COLHDG('Type of' +
     A                                             'Last Change')
     A            D2LCD          5  0       TEXT('Last Change Date')
     A                                      COLHDG('Last' +
     A                                             'Change Date')
     A                                      EDTCDE(4)
     A*=====================================================================
