      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas MC Select Analysis Basis for Reports')
     A*****************************************************************
     A*                                                               *
     A*  Midas  Management Accounting Module
     A*                                                               *
     A*  MC86PDF - Select 'Analyse By' Criteria                       *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. 112563             DATE 07FEB97               *
     A*  PREV AMEND NO. 054315             DATE 23APR93               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  112563 - Header and footer changes required for GUI          *
     A*           Multilanguage support.                              *
     F*  054315 - Selections Not redisplayed for verification         *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A*
     A                                      PRINT(MPRINT)
      *
     A                                      CA03(03)
     A*                                                         Begin /*054315*/
     A**40*******                           CA12(12)
     A  40                                  CA05(05)
     A                                      CA12(12)
     A*                                                         End   /*054315*/
      *
      *   Format: General headings display
     A          R SELECT                    TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            SUSER         10A  O  1  2TEXT('User ID')
     A                                  1 13'MC86P'
     A            SMRDT          7A  O  1 72TEXT('Run date')
     A            SWSID         10A  O  2  2
     A                               O  2 29'SELECT ''ANALYSE BY'' +
     A                                       CRITERIA'
     A                                      DSPATR(HI)
     A                               O  2 71TIME
     A N40                           O  7 22'No ''Analyse By'' +
     A                                       selections are available'
     A  40                           O  7  8'Enter 0 - 7 to select +
     A                                       and determine hierarchy'
     A  40                           O  8  8'or blank to de-select'
     A  40        TEXT0         32A  O 11  8
     A  40        S0             1A  B 11 45VALUES(' ' '0' '1' '2' +
     A                                      '3' '4' '5' '6' '7')
     A                                      DSPATR(UL)
     A  41        TEXT1         32A  O 12  8
     A  41        S1             1A  B 12 45VALUES(' ' '0' '1' '2' +
     A                                      '3' '4' '5' '6' '7')
     A                                      DSPATR(UL)
     A  31                                  ERRMSGID(GLX0383 *LIBL/GLUSRMSG)
     A  42        TEXT2         32A  O 13  8
     A  42        S2             1A  B 13 45VALUES(' ' '0' '1' '2' +
     A                                      '3' '4' '5' '6' '7')
     A                                      DSPATR(UL)
     A  32                                  ERRMSGID(GLX0383 *LIBL/GLUSRMSG)
     A  43        TEXT3         32A  O 14  8
     A  43        S3             1A  B 14 45VALUES(' ' '0' '1' '2' +
     A                                      '3' '4' '5' '6' '7')
     A                                      DSPATR(UL)
     A  33                                  ERRMSGID(GLX0383 *LIBL/GLUSRMSG)
     A  44        TEXT4         32A  O 15  8
     A  44        S4             1A  B 15 45VALUES(' ' '0' '1' '2' +
     A                                      '3' '4' '5' '6' '7')
     A                                      DSPATR(UL)
     A  34                                  ERRMSGID(GLX0383 *LIBL/GLUSRMSG)
     A  45        TEXT5         32A  O 16  8
     A  45        S5             1A  B 16 45VALUES(' ' '0' '1' '2' +
     A                                      '3' '4' '5' '6' '7')
     A                                      DSPATR(UL)
     A  35                                  ERRMSGID(GLX0383 *LIBL/GLUSRMSG)
     A  46        TEXT6         32A  O 17  8
     A  46        S6             1A  B 17 45VALUES(' ' '0' '1' '2' +
     A                                      '3' '4' '5' '6' '7')
     A                                      DSPATR(UL)
     A  36                                  ERRMSGID(GLX0383 *LIBL/GLUSRMSG)
     A  47        TEXT7         32A  O 18  8
     A  47        S7             1A  B 18 45VALUES(' ' '0' '1' '2' +
     A                                      '3' '4' '5' '6' '7')
     A                                      DSPATR(UL)
     A  37                                  ERRMSGID(GLX0383 *LIBL/GLUSRMSG)
     A  48        TEXT8         32A  O 19  8
     A  48        S8             1A  B 19 45VALUES(' ' '0' '1' '2' +
     A                                      '3' '4' '5' '6' '7')
     A                                      DSPATR(UL)
     A  38                                  ERRMSGID(GLX0383 *LIBL/GLUSRMSG)
     A*                                                         Begin /*054315*/
     A************                   O 23  2'F3 = Exit'
     A**40********                   O 23 12'F12 = Re-display Initial +
     A************                           Values'
     A**                                             Begin /112563/
     A***********                      23  2'Press F3 To Exit,'
     A* 40 ******                      23 20'F5 to Re-display Initial +
     A***********                            Values,'
     A***********                      23 53'F12 for Previous Screen'
     A*                                                         End   /*054315*/
     A                                 23  2'F3=Exit  F12=Previous Screen'
     A  40                             23 32'F5=Re-display Initial Values'
     A**                                             End   /112563/
