      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM15                                                      *
/*EXI *  TEXT('Midas CA All DRS deals files des date/branch')         *
      *****************************************************************
     A*                                                               *
     A*  Midas - Common Applications                                  *
     A*                                                               *
     A*  CACUSDL2 - DRS CATCHALL DEALS FILE KEYED BY                  *
     A*             DESCENDING DATE ORDER THEN BRANCH                 *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *  Last Amend No. CGL165             Date 17Feb15               *
      *  Prev Amend No. CDL096             Date 22Sep14               *
      *                 CDL094             Date 11Jun14               *
      *                 CTI006             Date 31Mar14               *
      *                 CSW212             Date 03May12               *
      *                 CRE073             Date 06Dec10               *
      *                 CER059             Date 19Jul10               *
      *                 BUG25189           Date 27Jul09               *
      *                 BUG24989           Date 23Jul09               *
      *                 CER054             Date 07Apr09               *
      *                 CER048             Date 19May08               *
      *                 CER020             Date 19May08               *
      *                 CER043             Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CDL049             Date 05Jul06               *
      *                 117478             DATE 26May06               *
      *                 233324             Date 02May05               *
      *                 CAS009             Date 04May04               *
      *                 CDL038             Date 10May05               *
      *                 CSD027             Date 05Dec05               *
      *                 CDL033             Date 10Feb05               *
      *                 BUG7411            Date 01Jun05               *
      *                 CDL028             Date 07Feb05               *
      *                 229544             Date 15Sep04               *
      *                 CAS008             Date 16Jun04               *
      *                 BUG3644            Date 12Jul04               *
      *                 CGL014             Date 20Oct03               *
      *                 CDL019             Date 03Feb04               *
      *                 CDL018             Date 03Feb04               *
      *                 CDL017             Date 03Feb04               *
      *                 CDL016             Date 03Feb04               *
      *                 CGL029             Date 01Sep03               *
      *                 217684             Date 12May03               *
      *                 CAS006             Date 21Jan03               *
      *                 CAS005             Date 16Dec02               *
      *                 CAS004             Date 26Jun02               *
      * Midas Release 4.01 -------------------------------------------*
      *                 CAP056             Date 13Mar02               *
      *                 CIR008             Date 13Mar02               *
      *                 CAS001             Date 23Nov01               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      *                 CDL008             Date 02May00               *
      * Midas DBA 3.03 -----------------------------------------------*
      *                 CIR005             Date 21Jan00               *
      * Midas DBA 3.02 -----------------------------------------------*
      *                 175065             Date 16Feb00               *
      *                 CGL011             Date 20Sep99               *
     A*                 CAP051             Date 08Nov99               *
     A*                 CDL007             Date 04Oct99               *
     A*                 CPB001             Date 01Jun99               *
      * Midas DBA 3.01 -----------------------------------------------*
      *                 CDL006             Date 26Apr99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CSW097             Date 20May99               *
      *                 CPL002             Date 08Mar99               *
     A*                 CEU015             Date 19Jun98               *
      *                 CAP002             Date 08May98               *
     A*                 CEU003             Date 05Nov97               *
     A*                 CDL002             Date 17Sep97               *
     A*                 CSW005             Date 01Aug96               *
     A*                 CAC001             Date 01Feb96               *
     A*                 CIR002             Date 13Jun95               *
     A*                 CIR001             Date 13Jun95               *
     A*                 S01444             DATE 05APR95               *
     A*                 S01486             DATE 06JUN94               *
     A*                  S01453     DATE  10DEC93                     *
     A*                  S01440     DATE  24AUG93                     *
     A*                  S01434     DATE  26JUL93                    *
     A*                  S01378     DATE  15OCT92                    *
     A*                  S01392     DATE  20JUL92                    *
     A*                  AUS021     DATE  05AUG92                    *
     A*                  E40909     DATE  07JUL92                    *
     A*                  S01383     DATE  27APR92                    *
     A*                  E26937     DATE  10OCT91                    *
     A*                                                              *
     A*****************************************************************
      *                                                               *
      *  CGL165 - Dual Withholding Tax (Recompile)                    *
      *  CDL096 - Business Day Conventions on MM Deals                *
      *           (Recompile)                                         *
      *  CDL094 - Enhance Receive Settlement Instructions (Recompile) *
      *  CTI006 - Trade Finance BF Midas 2.2 Interface (Recompile)    *
      *  CSW212 - SWIFT 2012 Changes (Recompile)                      *
      *  CRE073 - Interest Rate Rounding (Recompile)                  *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  BUG25189 - MARG field on DLCHISPD contains invalid data after*
      *             the close of business (Recompile)                 *
      *  BUG24989 - Limit Utilisation Enq - Decimal Data error        *
      *             (Recompile)                                       *
      *  CER054 - German Features - Church Tax (Recompile)            *
      *  CER048 - German Features - Taxes (Recompile)                 *
      *  CER020 - Enhanced Rollover Window: Upgrade FGE089 to         *
      *           Midas Plus (Recompile)                              *
      *  CER043 - German Features LF041-00 New Fields and Defaulting  *
      *           (Recompile)                                         *
      *  CDL049 - Addition of a Reference Rate field (recompile)      *
     A*  117478 -  Deal type CI(certificate of deposit issued) is     *
     A*            being reported against the internal customer.      *
     A*            It should be picked up via the counterparty        *
     A*            which on DEALSDC is held in field CHNA.            *
      *  233324 - Add new fields in DEALSDC for EU Tax (Recompile).   *
      *  CAS009 - Effective Interest Rate/Amortised Cost Accounting   *
      *           (Recompile)                                         *
      *  CDL038 - Extended Deal Sub Type (Recompile)                  *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CDL033 - Floating Rate CDs Issued (Recompile)                *
      *  BUG7411- CDL028 fields missing from DLGHISPD (Recompile)     *
      *  CDL028 - Automatic Rate Interpolations (Recompile)           *
      *  229544 - Recompiled due to inserted fields in DLCHISPD.      *
      *  CAS008 - IAS 39 Enhancements (Recompile)                     *
      *  BUG3644 - Serious Error in Collateralised Lending (Recompile)*
      *  CGL014 - Collaterals Processing (Recompile)                  *
      *  CDL019 - Allow Base Rate Changes on Fixed Deposits/Loans     *
      *           (Recompile)                                         *
      *  CDL018 - Multiple Settlement Accounts on Loans/Deposit       *
      *           (Recompile)                                         *
      *  CDL017 - Penalty Fee & Early Maturity of Fixed Term Loan/Dep *
      *           (Recompile)                                         *
      *  CDL016 - Automatic Rollover of Fixed Term Loan/Deposit       *
      *           (Recompile)                                         *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  217684 - Authorisation User Malfunction (Recompile)          *
      *  CAS006 - Hedge Accounting Phase B (Recompile)                *
      *  CAS005 - Enhancements to CAS001, CAS002 and CAS004           *
      *           (Recompile)                                         *
      *  CAS004 - Hedge Accounting Phase A (Recompile)                *
      *  CAP056 - Automatic Authorisation of Interface deals          *
      *           (Recompile)                                         *
      *  CIR008 - FRA/IRS Deals Authorisation (Recompile)             *
      *  CAS001 - Net Present Value (NPV) Accounting                  *
      *           (Recompile)                                         *
      *  CDL008 - Continuous Linked Settlement (Recompiled)           *
      *  CIR005 - FRA/IRS Business Day Conventions. (Recompile)       *
     A*  175065 - Bring DLGHISPD into line with DEALSDG (recompiled)  *
      *  CGL011 - Collateral Processing for Midas. Recompile.         *
     A*  CAP051 - Automatic Authorisation (MM and FX Part)            *
     A*           Recompiled over changed DEALSDB and DEALSDC         *
     A*  CDL007 - Deposit Breakdown Penalty                           *
     A*           Recompiled over changed DEALSDC                     *
     A*  CPB001 - Meridian DBA Middleware Replication Customization.  *
     A*           Recompiled over changed DEALSDB and DEALSDC.        *
      *  CDL006 - Dealing Fiduciary. Recompiled.                      *
     A*  CSW097 - SWIFT 1997 Changes for FRAIRS MT34* and MT36*.      *
     A*           Recompiled over changed DEALSDG.                    *
     A*  CPL002 - Midas-Plato Interface (Recomplied)                  *
     A*  CEU015 - EMU Enhanced Money Market Deal Rollover             *
     A*           Recompiled only.                                    *
      *  CAP002 - Recompiled for converion of Midas inputs to APIs    *
     A*  CEU003 - EMU Dealing Settlement Ccy Conversion (Recompile)   *
     A*  CDL002 - FX Netting - Recompiled Only.                       *
     A*  CSW005 - MG34n and MG36n Message Generation                  *
     A*           Recompiled over changed DEALSDG                     *
     A*  CAC001 - Profit Centre Accounting Development:               *
     A*           Recompiled only.                                    *
     A*  CIR002 - Compounding of Interest.  Recompiled.               *
     A*  CIR001 - Interest Rate Calendars.                            *
     A*    S01444 -  Recompiled - New formats added.                 *
     A*    S01486 -  Portfolio Management Upgrade (RECOMPILE)        *
     A*    S01453 -  MARGIN AND FX POSITIONS/POINTS - RECOMPILE      *
     A*    S01440 -  Recompiled - GCPCAP and GCSCAP added to DEALSDB *
     A*                                                              *
     A*   S01434 -  Recompiled - Enhanced Rollovers                   *
     A*                                                               *
     A*    S01378 -  Facilitates the partial sale of a parcel        *
     A*              of negotiable instruments which have been       *
     A*              previously input to the system as a single      *
     A*              transaction (was MOF53). Recompile logical      *
     A*              because deals physicals (NAB/NAS) have changed. *
     A*                                                               *
     A*  S01392 - RECOMPILED DUE TO JAP.SUB-MODULE INCORPORATION      *
     A*   AUS021 - AUSTRALIAN PRODUCT. Includes two new settlement    *
     A*            formulas for FRAs. Initially includes one for      *
     A*            Australia and one for USA.                         *
     A*            RECOMPILED OVER DEALSDG                            *
     A*                                                               *
     A*  E40909 - Error on treasury bill as purchasing customer was   *
     A*           used to retrieve T-Bill information instead of the  *
     A*           issuer.                                             *
     A*           Use issuer no as key for DEALSDD.                   *
     A*   S01383 - RECOMPILED DUE TO BASIC RATE TAX INCORPORATION    *
     A*   FILE CREATED FOR NEW ENQUIRY DL0121 IN DESCENDING DATE     *
     A*   ORDER                                                      *
     A*****************************************************************
     A          R DEALSDBF                  PFILE(DEALSDB)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K CNUM
     A          K DDAT                      DESCEND
     A          K BRCA
     A          K DLNO
     A          O RECI                      CMP(EQ '*')
     A*
     A          R DEALSDCF                  PFILE(DEALSDC)
     A          K CNUM
     A          K DDAT                      DESCEND
     A          K BRCA
     A          K DLNO
     A          O RECI                      CMP(EQ '*')
     A*
     A*                                                  /* Start of 117478 */
     A          S DTYP                      CMP(NE 'CI')
     A*
     A          R DLSDCFCI                  PFILE(DEALSDC)
     A            RECI      R
     A            DLNO      R
     A            RCDT      R
     A            RCDC      R
     A            BRCA      R
     A            DTYP      R
     A            DLST      R
     A            DDAT      R
     A            VDAT      R
     A            MDAT      R
     A            CDAS      R
     A            BRKC      R
     A            BAGE      R
     A            CCY       R
     A            PCPL      R
     A            INTC      R
     A            ZZ006     R
     A            BRTT      R
     A            BRTE      R
     A            RTSP      R
     A            INTR      R
     A            NOTD      R
     A            RNNA      R
     A            CNUM      R               RENAME(CHNA)
     A            FACT      R
     A            FCNO      R
     A            OPAM      R
     A            BCXR      R
     A            LCXR      R
     A            SDST      R
     A            OSDA      R
     A            TSTN      R
     A            MDST      R
     A            OMDA      R
     A            TMAN      R
     A            RODN      R
     A            RODA      R
     A            RBDN      R
     A            RBDA      R
     A            ICBS      R
     A            IPFR      R
     A            TOTI      R
     A            NIDT      R
     A            IBDT      R
     A            SLID      R
     A            AIPD      R
     A            DLRC      R
     A            IACD      R
     A            AITC      R
     A            AIAN      R
     A            AIAP      R
     A            IPRD      R
     A            IPRM      R
     A            ICTD      R
     A            ZZ009     R
     A            DAVD      R
     A            DASN      R
     A            FACO      R
     A            SPI       R
     A            INTF      R
     A            ZZ008     R
     A            TAXI      R
     A            TAXD      R
     A            TAXM      R
     A            DNSI      R
     A            DSTI      R
     A            CNFI      R
     A            ACEI      R
     A            TLXI      R
     A            ZZ009A    R
     A            F57U      R
     A            LSWC      R
     A            LSWS      R
     A            ZZ002     R
     A            ORED      R
     A            LCD       R
     A            CHTP      R
     A            TNLU      R
     A            DBLN      R
     A            DRID      R
     A            DDMR      R
     A            BOKC      R
     A            LNKDN     R
     A            RSTM      R
     A            RONS      R
     A            RIBN      R
     A            RIBA      R
     A            ROBN      R
     A            ROCN      R
     A            PSTM      R
     A            PONS      R
     A            PIBN      R
     A            PIBA      R
     A            POBN      R
     A            POCN      R
     A            RCRN      R
     A            RCRA      R
     A            RVNO      R
     A            AWBN      R
     A            AWBA      R
     A            BENN      R
     A            BENA      R
     A            DTP1      R
     A            DTP2      R
     A            DTP3      R
     A            DTP4      R
     A            DCHG      R
     A            BTB1      R
     A            BTB2      R
     A            BTB3      R
     A            BTB4      R
     A            BTB5      R
     A            BTB6      R
     A            ORBR      R
     A            PRFC      R
     A            ROBR      R
     A            POBR      R
     A            CVMR      R
     A            NACSG     R
     A            JRDFC     R
     A            JFLID     R
     A            FUID      R
     A          K CNUM
     A          K DDAT                      DESCEND
     A          K BRCA
     A          K DLNO
     A          O RECI                      CMP(EQ '*')
     A          S DTYP                      CMP(EQ 'CI')
     A*                                                    /* End of 117478 */
     A*
     A          R DEALSDDF                  PFILE(DEALSDD)
      **   START OF CHANGE                                 /E40909/
     A**********K CNUM
     A          K ISCN
      **   END OF CHANGE                                   /E40909/
     A          K DDAT                      DESCEND
     A          K BRCA
     A          K DLNO
     A          O RECI                      CMP(EQ '*')
     A*
     A          R DEALSDEF                  PFILE(DEALSDE)
     A          K SCUS
     A          K DDAT                      DESCEND
     A          K BRCA
     A          K DLNO
     A          O RECI                      CMP(EQ '*')
     A*
     A          R DEALSDGF                  PFILE(DEALSDG)
     A          K CNUM
     A          K DDAT                      DESCEND
     A          K BRCA
     A          K DLNO
     A          O RECI                      CMP(EQ '*')
     A*
     A*                                              Begin /S01444/
     A          R DLBHISD0                  PFILE(DLBHISPD)
     A          K CNUM
     A          K DDAT                      DESCEND
     A          K BRCA
     A          K DLNO
     A*
     A          R DLCHISD0                  PFILE(DLCHISPD)
     A          K CNUM
     A          K DDAT                      DESCEND
     A          K BRCA
     A          K DLNO
     A*
     A          R DLDHISD0                  PFILE(DLDHISPD)
     A          K ISCN
     A          K DDAT                      DESCEND
     A          K BRCA
     A          K DLNO
     A*
     A          R DLEHISD0                  PFILE(DLEHISPD)
     A          K SCUS
     A          K DDAT                      DESCEND
     A          K BRCA
     A          K DLNO
     A*
     A          R DLGHISD0                  PFILE(DLGHISPD)
     A          K CNUM
     A          K DDAT                      DESCEND
     A          K BRCA
     A          K DLNO
     A*                                              End   /S01444/
