      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FF Close out data area layout file')
      *****************************************************************
      *                                                               *
      *  Midas - Futures and Options Module                           *
      *                                                               *
      *  PF/FFCODTA - FF Close Out Data Area Layout                   *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Note: Any fix applied to this file may also need to be       *
      *        applied to the core DTAARA source.                     *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.01 -----------------------------------------------*
      *  Prev Amend No. CGL007 *Create     Date 26Mar99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL007 - Account Postings Enquiry                            *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R FFCODTF                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            FFMOD     R               REFFLD(MMOD)
     A                                      TEXT('Module')
     A                                      COLHDG('Module')
     A            FFRTN     R               REFFLD(RTNC)
     A                                      TEXT('Return Code')
     A                                      COLHDG('Return' +
     A                                             'Code')
     A            FFACT     R               REFFLD(ACTN)
     A                                      TEXT('Action')
     A                                      COLHDG('Action')
     A            FFNBR     R               REFFLD(CLON)
     A                                      TEXT('Close Out Number')
     A                                      COLHDG('Close' +
     A                                             'Out' +
     A                                             'No.')
     A            FILLER    R               REFFLD(ZZ050)
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
