      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas CF SWIFT II Data Area')
     A*****************************************************************
     A*                                                               *
     A*       Midas CONFIRMATION MATCHING                         *
     A*                                                               *
     A*       DTAARA/CFSTAT - CONFIRMATION MATCHING MODULE DATA AREA  *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01259             Date 01Nov90               *
      *                 S01184             Date 15Dec89               *
     A*                                        DATE DDMMMYY           *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*       S01184 - CREATED FOR CONFIRMATION MATCHING              *
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     A*       S01259 - INCOMING SWIFT II START & END RRN ADDED        *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  NOTE: Any fix applied to this file may also need to be       *
     A*        applied to the core DTAARA source.                     *
     A*        See also CFTEMP .                                      *
     A*                                                               *
     A* This Source Member gives the Layout of the Module Status      *
     A* Data Area.  The Data Area is 256 Character.  New positions    *
     A* should be added to the end.                                   *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A          R CFSTAT
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            PTIO           3A         TEXT('PREVIOUS TRAM ID OUT +
     A                                      1 - 3')
     A            PTII           3A         TEXT('PREVIOUS TRAM ID IN +
     A                                      4 - 6')
     A            OSRN          10A         TEXT('OUTGOING START RRN +
     A                                      7 - 16')
     A            OERN          10A         TEXT('OUTGOING END RRN +
     A                                      17 - 26')
     A            ISRN          10A         TEXT('INCOMING START RRN +
     A                                      27 - 36')
     A            IERN          10A         TEXT('INCOMING END RRN +
     A                                      37 - 46')
     A            RCVR           1A         TEXT('RECOVER +
     A                                      47 - 47')
     A            SB18           1A         TEXT('CF0180 SUBMITTED +
     A                                      48 - 48')
     A            ST18           6A         TEXT('CF0180 STATUS +
     A                                      49 - 54')
     A            MDNO           5A         TEXT('DATE LAST CLIENT +
     A                                      DOWNLOAD 55 - 59')
     A            MRUN           5A         TEXT('CURRENT MATCH +
     A                                      DATE RUND 60 - 64')
     A*                                                                 /S01259/
     A            I2SR          10A         TEXT('INCOMING SWIFT II START RRN +
     A                                      65 - 74')
     A            I2ER          10A         TEXT('INCOMING SWIFT II END RRN +
     A                                      75 - 84')
     A*                                                                 /S01259/
