      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_15WF                                                      *
/*EXI *  TEXT('Midas Complete deal amendable fields.')
     A****************************************************************
     A*                                                              *
     A*  Midas - Money Market (Dealing)
     A*                                                              *
     A*  MMCDAFPP - COMPLETE DEAL AMENDABLE FIELDS.                  *
     A*             Any change to this file should also be applied   *    079597
     A*             to PF/MMAUDCPP                                   *    079597
     A*                                                              *
     A* (c) Finastra International Limited 2001                      *
     A*                                                              *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  PREV AMEND NO. 079597       DATE   08DEC94                  *
     A*                 E18138       DATE   02/05/89                 *
     A*                 E15947       DATE   23/11/88                 *\
     A*                                                              *
     A****************************************************************
     A*                                                              *
     A*  MD046248 - Finastra Rebranding                              *
     A*  079597  -  Amend header box                                 *
     A*    E18138 - File recreated due to error on E15947            *
     A*             compilation.                                     *
     A*    E15947 - BRANCH CODE REF FIELD IS WRONG. IT SHOULD BE     *
     A*    BRANCH CODE AMENDABLE INDICATOR REF FIELD.                *
     A*                                                              *
     A****************************************************************
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R MMCDAFP0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*
     A            HHRCID    R               REFFLD(RCID)
     A            HHDLTF    R               REFFLD(DLTF)
     A            HHDLUP    R               REFFLD(DLUP)
     A            HHMLUP    R               REFFLD(MLUP)
     A            HHYLUP    R               REFFLD(YLUP)
     A            HHTLUP    R               REFFLD(TLUP)
     A            HHCHTP    R               REFFLD(CHTP)
     A            HHLCD     R               REFFLD(LCD)
     A            HHLUID    R               REFFLD(LUID)
     A*                                                    /E15947/
     A************HHBRCA    R               REFFLD(BRCA)   /E15947/
     A*E15947 BRCA IS WRONG REF FIELD IT SHOULD BE BRNA
     A            HHBRCA    R               REFFLD(BRNA)
     A*END OF FIX E15947                                   /E15947/
     A            HHCNMA    R               REFFLD(CNMA)
     A            HHBKRA    R               REFFLD(BKRA)
     A            HHBKGA    R               REFFLD(BKGA)
     A            HHDLSA    R               REFFLD(DLSA)
     A            HHINTA    R               REFFLD(ITDA)
