      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MM Cash Flows using All-in-Rate')
      *****************************************************************
      *                                                               *
      *  Midas - Money Market Module                                  *
      *                                                               *
      *  PF/MMCFLSPD - Midas MM Cash Flows using All-in-Rate          *
      *                                                               *
      *  (c) Finastra International Limited 2004                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 11Jan06               *
      *                 CAS009  *CREATE    Date 04May04               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CAS009 - Effective Interest Rate/Amortised Cost Accounting   *
      *                                                               *
      *****************************************************************
      *
     A                                      REF(MMCFLWPD)
     A          R MMCFLSD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2004')
      *
     A            MFDLNO    R               REFFLD(MCDLNO)
     A                                      TEXT('Deal Number')
     A                                      COLHDG('Deal' +
     A                                             'Number')
     A            MFDTYP    R               REFFLD(MCDTYP)
     A                                      TEXT('Deal Type')
     A                                      COLHDG('Deal' +
     A                                             'Type')
     A            MFDLST    R               REFFLD(MCDLST)
     A                                      TEXT('Deal Subtype')
     A                                      COLHDG('Deal' +
     A                                             'Subtype')
     A            MFFLDT    R               REFFLD(MCFLDT)
     A                                      TEXT('Cash Flow Date(Midas Day No)')
     A                                      COLHDG('Cash Flow Date' +
     A                                             '(Midas Day No)')
     A            MFDATE    R               REFFLD(MCDATE)
     A                                      TEXT('Cash flow date o/p')
     A                                      COLHDG('Cash Flow date o/p')
     A            MFNDYP    R               REFFLD(MCNDYP)
     A                                      TEXT('No. of Days in Period')
     A                                      COLHDG('No. of Days' +
     A                                             'in Period')
     A            MFNDYY    R               REFFLD(MCNDYY)
     A                                      TEXT('No. of Days in Interest Year')
     A                                      COLHDG('No. of Days' +
     A                                             'in Interest Year')
     A            MFCAMT    R               REFFLD(MCCAMT)
     A                                      TEXT('Cash Flow Amount')
     A                                      COLHDG('Cash Flow' +
     A                                             'Amount')
     A            MFFTYP    R               REFFLD(MCFTYP)
     A                                      TEXT('Cash Flow Type')
     A                                      COLHDG('Cash Flow' +
     A                                             'Type')
     A            MFIRAT    R               REFFLD(MCIRAT)
     A                                      TEXT('Interest Rate')
     A                                      COLHDG('Interest' +
     A                                             'Rate')
     A            MFYLDC    R               REFFLD(MCYLDC)
     A                                      TEXT('Yield Curve')
     A                                      COLHDG('Yield' +
     A                                             'Curve')
     A            MFDSCF    R               REFFLD(MCDSCF)
     A                                      TEXT('Discount Factor')
     A                                      COLHDG('Discount' +
     A                                             'Factor')
     A            MFNPVA    R               REFFLD(MCNPVA)
     A                                      TEXT('NPV Amount')
     A                                      COLHDG('NPV' +
     A                                             'Amount')
     A            MFIOIN    R               REFFLD(MCIOIN)
     A                                      TEXT('Incoming/Outgoing Ind.')
     A                                      COLHDG('Incoming/' +
     A                                             'Outgoing Ind.')
      * Begin /CSD027/
     A**********  MFCNUM    R               REFFLD(MCCNUM)                                    CSD027
     A            MFCNUM         6A                                                           CSD027
     A                                      TEXT('Customer Number')
     A                                      COLHDG('Customer' +
     A                                             'Number')
      * End /CSD027/
     A            MFBRCA    R               REFFLD(MCBRCA)
     A                                      TEXT('Branch Code')
     A                                      COLHDG('Branch' +
     A                                             'Code')
     A            MFCYCD    R               REFFLD(MCCYCD)
     A                                      TEXT('Currency Code')
     A                                      COLHDG('Currency' +
     A                                             'Code')
     A            MFBKCD    R               REFFLD(MCBKCD)
     A                                      TEXT('Book Code')
     A                                      COLHDG('Book' +
     A                                             'Code')
     A            MFADLN    R               REFFLD(MCADLN)
     A                                      TEXT('Associated Deal No.')
     A                                      COLHDG('Associated' +
     A                                             'Deal No.')
     A            MFICBS    R               REFFLD(MCICBS)
     A                                      TEXT('Int. Calc. Basis')
     A                                      COLHDG('Int. Calc.' +
     A                                             'Basis')
     A            MFFSEQ         2S 0       TEXT('Fee Sequence')
     A                                      COLHDG('Fee Sequence')
     A            MFCPAM        13P 0       TEXT('Currency Principal Amount')
     A                                      COLHDG('Currency Principal' +
     A                                       'Amount')
