      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_15WF                                                      *
/*EXI *  TEXT('Midas MM Loan/deposit/CD issued')                      *
     A****************************************************************
     A*                                                              *
     A*  Midas - Money Market (Dealing)
     A*                                                              *
     A*          MMDELDPP - LOAN/DEPOSIT/CD ISSUED                   *
     A*                                                              *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                              *
      *  Last Amend No. CGL165             Date 17Feb15               *
      *  Prev Amend No. CDL096             Date 22Sep14               *
      *                 CDL094             Date 30May14               *
      *                 CRE073             Date 06Dec10               *
      *                 CER059             Date 19Jul10               *
      *                 CER020             Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CDL049             Date 30Mar06               *
      *                 CSD027             Date 05Dec05               *
      *                 CDL038             Date 10May05               *
      *                 CDL033             Date 10Feb05               *
      *                 CGL014             Date 20Oct03               *
      *                 CDL019             Date 03Feb04               *
      *                 CDL018             Date 03Feb04               *
      *                 CDL017             Date 03Feb04               *
      *                 CDL016             Date 03Feb04               *
      *                 CGL029             Date 01Sep03               *
      *                 CGP001             Date 23May03               *
      *                 222727             Date 05Nov03               *
      *                 CAS005             Date 16Dec02               *
      *                 CDL010             Date 02Aug02               *
      * Midas Release 4.01 -------------------------------------------*
      *                 CAS001             Date 23Nov01               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CGL011             Date 20Sep99               *
      *                 CSE006             Date 26Jan00               *
     A*                 CAP051             Date 08Nov99               *
     A*                 CDL007             Date 04Oct99               *
     A*                 CPB001             Date 01Jun99               *
      * Midas DBA 3.01 -----------------------------------------------*
      *                 CDL006             Date 27Apr99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 145001             Date 19Oct98               *
      *                 CEU015             Date 19Jun97               *
     A*                 CAP002             Date 08Oct97               *
     A*                 CEU003             Date 05Nov97               *
     A*                 CAC001             Date 01Feb96               *
     A*                 S01486             Date 06Jun94               *
     A*                 S01434             Date 23Jul93               *
     A*                         S01392    DATE 20JUL92               *
     A*                         E22405    DATE 14AUG90               *
     A*                         S01176    DATE 30/01/89              *
     A*                         S01117    DATE 09/12/88               *   S01165
     A*                         S01177    DATE 02/09/88              *
     A*                         S01165    DATE 16/05/88               *   S01165
     A*                                                              *
     A*---------------------------------------------------------------*
     A*                                                              *
      *  CGL165 - Dual Withholding Tax (Recompile)                    *
      *  CDL096 - Business Day Conventions on MM Deals                *
      *           (Recompile)                                         *
      *  CDL094 - Enhance  Receive Settlement Instructions.           *
      *           Recompiled over amended GZMMDELDPP.                 *
      *  CRE073 - Interest Rate Rounding (Recompile)                  *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER020 - Enhanced Rollover Window: Upgrade FGE089 to         *
      *           Midas Plus (Recompile)                              *
      *  CDL049 - Addition of a Reference Rate field (Recompile)      *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CDL038 - Extended Deal Sub Type                              *
      *  CDL033 - Floating Rate CDs Issued (Recompile)                *
      *  CGL014 - Collaterals Processing (Recompile)                  *
      *  CDL019 - Allow Base Rate Changes on Fixed Deposits/Loans     *
      *           (Recompile)                                         *
      *  CDL018 - Multiple Settlement Accounts on Loans/Deposit       *
      *           (Recompile)                                         *
      *  CDL017 - Penalty Fee & Early Maturity of Fixed Term Loan/Dep *
      *           (Recompile)                                         *
      *  CDL016 - Automatic Rollover of Fixed Term Loan/Deposit       *
      *           (Recompile)                                         *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CGP001 - Global Processing                                   *
      *           - File now shares format with the global layer      *
      *             equivalent.                                       *
      *  222727 - Release 5.0 errors (missing field) (Recompile)      *
      *  CAS005 - Enhancements to CAS001, CAS002 and CAS004           *
     A*  CDL010 - Prevent last user that actioned the trade from      *
     A*           authorising it.                                     *
      *  CAS001 - Net Present Value (NPV) Accounting                  *
      *  CGL011 - Collateral Processing for Midas                     *
      *  CSE006 - Repurchase Agreements (REPOS) enhancement:          *
      *           New field - Transaction Type                        *
     A*  CAP051 - Automatic Authorisation (MM Part)                   *
     A*  CDL007 - Deposit Breakdown Penalty                           *
     A*  CPB001 - Meridian DBA Middleware Replication Customization.  *
     A*           Add Replication Indicator.                          *
      *  CDL006 - Dealing Fiduciary.                                  *
     A*  145001 - CEU015 fix: Add "Original Rollover Amount"          *
     A*           (ORDA) field.                                       *
     A*  CEU015 - EMU Enhanced MM Rollover                            *
     A*           Add "Rollover To/From Ccy" (RTFC) field             *
     A*  CAP002 - Conversion of Midas inputs into modular structure   *
     A*           to use as APIs.                                     *
     A*  CEU003 - EMU Dealing Settlement Ccy Conversion               *
     A*  CAC001 - Profit Centre Accounting Development:               *
     A*           Additional fields for Analytical Accounting module  *
     A*     S01486 - Portfolio Management Upgrade (RECOMPILE)        *
     A*     S01434 - Enhanced Rollover Processing                    *
     A*     S01392 - JAP.SUB-MODULE INCORPORATION (CORE)             *
     A*     E22405 - NEW FIELD FOR COVER MT202                       *
     A*     S01176 - Two new fields (Repo/Pledge Indicator           *
     A*              and Number) have been added to this file.       *
     A*     S01117 - MULTI BRANCHING                                  *   S01165
     A*     S01177 - EXTRA SETTLEMENT FIELDS ADDED                    *
     A*     S01165 - Two new fields (Book code and linked             *   S01165
     A*              reference number) have been added to this file.  *   S01165
     A*                                                              *
     A*                                                              *
     A****************************************************************
      *                                     Start of Change CGP001
     A          R MMDELDP0                  FORMAT(GZMMDELDPP)
      *
      *
     A**********                            REF(MFRFL)
     A**********R MMDELDP0                  TEXT('(c) Misys International +
     A**********                            Banking Systems Ltd. +
     A**********                            2001')
     A**********
     A**********  HKRCID    R               REFFLD(RCID)
     A**********  HKDLTF    R               REFFLD(DLTF)
     A**********  HKDLUP    R               REFFLD(DLUP)
     A**********  HKMLUP    R               REFFLD(MLUP)
     A**********  HKYLUP    R               REFFLD(YLUP)
     A**********  HKTLUP    R               REFFLD(TLUP)
     A**********  HKCHTP    R               REFFLD(CHTP)
     A**********  HKLCD     R               REFFLD(LCD)
     A**********  HKLUID    R               REFFLD(LUID)
     A**********  HKPCDN    R               REFFLD(DLPC)
     A**********  HKDN38    R               REFFLD(DN38)
     A**********  HKDADN    R               REFFLD(DADN)
     A**********  HKBKCD    R               REFFLD(BKCD)
     A**********  HKCCY     R               REFFLD(CCY)
     A**********  HKCYDP    R               REFFLD(CYDP)
     A**********  HKVDYY    R               REFFLD(VDYY)
     A**********  HKVDMM    R               REFFLD(VDMM)
     A**********  HKVDDD    R               REFFLD(VDDD)
     A**********  HKDTYY    R               REFFLD(DTYY)
     A**********  HKDTMM    R               REFFLD(DTMM)
     A**********  HKDTDD    R               REFFLD(DTDD)
     A**********  HKDDLT    R               REFFLD(DDLT)
     A**********  HKDSTS    R               REFFLD(DSTS)
     A**********  HKMTYP    R               REFFLD(MDTY)
     A**********  HKRBSI    R               REFFLD(RBSI)
     A**********  HKTYPE    R               REFFLD(DTPE)
     A**********  HKSTYP    R               REFFLD(DLST)
     A**********  HKCSNM    R               REFFLD(CSNM)
     A**********  HKCNUM    R               REFFLD(CNUM)
     A**********  HKAMNP    R               REFFLD(AMNP)
     A**********  HKINTR    R               REFFLD(INTR)
     A**********                                               /S01117/
     A**********  HKBRCD    R               REFFLD(MBCD)
     A**********  HKBRCA    R               REFFLD(MBCA)
     A**********                                               /S01117/
     A**********  HKDBRC    R               REFFLD(DBRC)
     A**********  HKDDYY    R               REFFLD(DDYY)
     A**********  HKDDMM    R               REFFLD(DDMM)
     A**********  HKDDDD    R               REFFLD(DDDD)
     A**********  HKBRKG    R               REFFLD(BRKG)
     A**********  HKBKCY    R               REFFLD(BKCY)
     A**********  HKBCDP    R               REFFLD(BKDP)
     A**********  HKFEDF    R               REFFLD(FEDF)
     A**********  HKCDRF    R               REFFLD(CDRF)
     A**********  HKPCTN    R               REFFLD(PCTN)
     A**********  HKCDRP    R               REFFLD(CDRP)
     A**********  HKLACT    R               REFFLD(LACT)
     A**********  HKTIME    R               REFFLD(TIME)
     A**********  HKDUSC    R               REFFLD(DUSC)
     A**********  HKAOFR    R               REFFLD(AOFR)
     A**********  HKLDAT    R               REFFLD(DACT)
     A**********  HKSLYY    R               REFFLD(SLYY)
     A**********  HKSLMM    R               REFFLD(SLMM)
     A**********  HKSLDD    R               REFFLD(SLDD)
     A**********  HKROBY    R               REFFLD(ROBY)
     A**********  HKSPRD    R               REFFLD(SPRD)
     A**********  HKIIRT    R               REFFLD(IIRT)
     A**********  HKNIYY    R               REFFLD(NIYY)
     A**********  HKNIMM    R               REFFLD(NIMM)
     A**********  HKNIDD    R               REFFLD(NIDD)
     A**********  HKIPFQ    R               REFFLD(IPFQ)
     A**********  HKICMT    R               REFFLD(ICMT)
     A**********  HKIPDM    R               REFFLD(IPDM)
     A**********  HKCPTI    R               REFFLD(CPTI)
     A**********  HKCNTI    R               REFFLD(CNTI)
     A**********  HKACSQ    R               REFFLD(ACSQ)
     A**********  HKNGVI    R               REFFLD(NGVI)
     A**********  HKMTTI    R               REFFLD(MTTI)
     A**********  HKMTAX    R               REFFLD(MTAX)
     A**********  HKMCDH    R               REFFLD(MCDH)
     A**********  HKIAYY    R               REFFLD(IAYY)
     A**********  HKIAMM    R               REFFLD(IAMM)
     A**********  HKIADD    R               REFFLD(IADD)
     A**********  HKBSRC    R               REFFLD(MRBC)
     A**********  HKDBSR    R               REFFLD(DBSR)
     A**********  HKMDYY    R               REFFLD(MDYY)
     A**********  HKMDMM    R               REFFLD(MDMM)
     A**********  HKMDDD    R               REFFLD(MDDD)
     A**********  HKNTCE    R               REFFLD(NTCE)
     A**********  HKFCLY    R               REFFLD(FCLY)
     A**********  HKIMAT    R               REFFLD(IMAT)
     A**********  HKBRAT    R               REFFLD(BCYR)
     A**********  HKMMDI    R               REFFLD(MMDI)
     A**********  HKDORM    R               REFFLD(DORM)
     A**********  HKORCM    R               REFFLD(ORCM)
     A**********  HKDORI    R               REFFLD(DORI)
     A**********  HKMORI    R               REFFLD(MORI)
     A**********  HKDCPI    R               REFFLD(DCPI)
     A**********  HKMCPI    R               REFFLD(MCPI)
     A**********  HKDOPM    R               REFFLD(DOPM)
     A**********  HKMOPM    R               REFFLD(MOPM)
     A**********  HKDOPI    R               REFFLD(DOPI)
     A**********  HKMOPI    R               REFFLD(MOPI)
     A**********  HKDCRI    R               REFFLD(DCRI)
     A**********  HKMCRI    R               REFFLD(MTDT)
     A**********  HKDFAC    R               REFFLD(DFAC)
     A**********  HKMFAO    R               REFFLD(MFAC)
     A**********  HKSPEC    R               REFFLD(SPEC)
     A**********                                             /S01165/
     A**********  HKBOKC    R               REFFLD(BOKC)
     A**********  HKLNKN    R               REFFLD(LNKDN)
     A**********                                             /S01165/
     A**********                                           /*S01177*/
     A**********  HKRSTM    R               REFFLD(RSTM)
     A**********  HKRONS    R               REFFLD(RONS)
     A**********  HKRIBN    R               REFFLD(RIBN)
     A**********  HKRIBA    R               REFFLD(RIBA)
     A**********  HKROBN    R               REFFLD(ROBN)
     A**********  HKROCN    R               REFFLD(ROCN)
     A**********  HKPSTM    R               REFFLD(PSTM)
     A**********  HKPONS    R               REFFLD(PONS)
     A**********  HKPIBN    R               REFFLD(PIBN)
     A**********  HKPIBA    R               REFFLD(PIBA)
     A**********  HKPOBN    R               REFFLD(POBN)
     A**********  HKPOCN    R               REFFLD(POCN)
     A**********  HKRCRN    R               REFFLD(RCRN)
     A**********  HKRCRA    R               REFFLD(RCRA)
     A**********  HKRVNO    R               REFFLD(RVNO)
     A**********  HKAWBN    R               REFFLD(AWBN)
     A**********  HKAWBA    R               REFFLD(AWBA)
     A**********  HKBENN    R               REFFLD(BENN)
     A**********  HKBENA    R               REFFLD(BENA)
     A**********  HKDTP1    R               REFFLD(DTP1)
     A**********  HKDTP2    R               REFFLD(DTP2)
     A**********  HKDTP3    R               REFFLD(DTP3)
     A**********  HKDTP4    R               REFFLD(DTP4)
     A**********  HKDCHG    R               REFFLD(DCHG)
     A**********  HKBTB1    R               REFFLD(BTB1)
     A**********  HKBTB2    R               REFFLD(BTB2)
     A**********  HKBTB3    R               REFFLD(BTB3)
     A**********  HKBTB4    R               REFFLD(BTB4)
     A**********  HKBTB5    R               REFFLD(BTB5)
     A**********  HKBTB6    R               REFFLD(BTB6)
     A**********                                           /*S01177*/
     A**********                                               /S01117/
     A**********  HKDOPB    R               REFFLD(DOPB)                  S01117
     A**********  HKDORB    R               REFFLD(DORB)                  S01117
     A**********  HKMOPB    R               REFFLD(MOPB)                  S01117
     A**********  HKMORB    R               REFFLD(MORB)                  S01117
     A**********  HKORBR    R               REFFLD(ORBR)
     A**********  HKPRFC    R               REFFLD(PRFC)
     A**********  HKPOBR    R               REFFLD(POBR)
     A**********  HKROBR    R               REFFLD(ROBR)
     A************HKPOBR    R               REFFLD(POBR)                  S01117
     A**********                                               /S01117/
     A**********                                           /S01176/
     A**********  HKDRID    R               REFFLD(DRID)
     A**********  HKDDMR    R               REFFLD(DDMR)
     A**********                                           /S01176/
     A**********                                           /E22405/
     A**********  HKCVMR    R               REFFLD(CVMR)
     A**********                                           /E22405/
     A**********                                           /S01392/
     A**********  HKRDFC    R               REFFLD(JRDFC)
     A**********  HKFLID    R               REFFLD(JFLID)
     A**********  HKFUID    R               REFFLD(FUID)
     A**********                                           /S01392/
     A***********                                    Begin /S01434/
     A**********  HKAURO    R               REFFLD(AURO)
     A**********
     A**********  HKIPDS    R               REFFLD(IPDS)
     A**********
     A**********  HKROFQ    R               REFFLD(ROFQ)
     A**********
     A**********  HKRLDN    R               REFFLD(RLDN)
     A**********
     A**********  HKCNNA    R               REFFLD(CNNA)
     A**********
     A**********  HKIMET    R               REFFLD(IMET)
     A**********
     A**********  HKINSA    R               REFFLD(INSA)
     A**********
     A**********  HKINOS    R               REFFLD(INOS)
     A**********
     A**********  HKWRPI    R               REFFLD(WRPI)
     A***********                                    End   /S01434/
      **********                                     Begin /S01486/
     A**********  HKPTFR    R               REFFLD(PTFR)
      **********                                     End   /S01486/
      **********                                     Begin /CAC001/
     A**********  HKFSRP    R               REFFLD(RTSP)
     A**********                            TEXT('Funding Spread/Rate')
     A**********                            COLHDG('Funding' +
     A**********                                   'Spread' +
     A**********                                   'Rate')
      **********
     A**********  HKFSGN    R               REFFLD(SPIN)
     A**********                            TEXT('Funding Spread Sign')
     A**********                            COLHDG('Funding' +
     A**********                                   'Spread' +
     A**********                                   'Sign')
      **********
     A**********  HKFPRC    R               REFFLD(PRFC)
     A**********                            TEXT('Funding Profit Centre')
     A**********                            COLHDG('Funding' +
     A**********                                   'Profit' +
     A**********                                   'Centre')
      **********                                     End   /CAC001/
     A**********                                     Begin /CEU003/
     A**********  HKSTCY         3          TEXT('Settlement Currency')
     A**********                            COLHDG('Settlement' +
     A**********                                   'Currency')
     A**********  HKIC72         3          TEXT('In Currency in +
     A**********                                 Field 72')
     A**********                            COLHDG('In Currency in' +
     A**********                                   'Field 72')
     A**********  HKISCY         3          TEXT('Interest Currency')
     A**********                            COLHDG('Interest' +
     A**********                                   'Currency')
     A**********  HKII72         3          TEXT('Interest In Ccy in +
     A**********                                 Field 72')
     A**********                            COLHDG('Interest In Ccy' +
     A**********                                   'in Field 72')
     A**********                                     End   /CEU003/
      **********                                     Begin /CAP002/
     A**********  HKDVSD    R               REFFLD(DVSD)
     A**********  HKDDND    R               REFFLD(DDND)
     A**********  HKNIPD    R               REFFLD(NIPD)
     A**********  HKSLID    R               REFFLD(SLID)
     A**********  HKMATD    R               REFFLD(MATD)
     A**********  HKRBAT    R               REFFLD(RBAT)
     A**********  HKRACD         1A         TEXT('Brok. Rate/Amount ind.')
     A**********                            COLHDG('Brok Rate/Amount ind')
     A**********  HKFRNT    R               REFFLD(FOTRNID)
     A**********  HKAFRT    R               REFFLD(FOTRNID)
     A**********                            TEXT('Associated Front +
     A**********                                  Office Transaction Id')
     A**********                            COLHDG('Associated' +
     A**********                                   'Front Office' +
     A**********                                   'Transaction Id')
     A**********  HKREPA    R               REFFLD(RPRLOC)
      **********
      ***Timestamp
     A**********  HKTMST    R               REFFLD(TIMESTMP)
      **********                                     End   /CAP002/
      **********                                     Begin /CEU015/
     A**********  HKRTFC         3          TEXT('Rollover To/From Currency')
     A**********                            COLHDG('Rollover To/From' +
     A**********                                   'Currency')
      **********                                     End   /CEU015/
      **********                                     Begin /145001/
     A**********  HKORDA    R               REFFLD(RBDA)
     A**********                            TEXT('Original Rollover Amount')
     A**********                            COLHDG('Original Rollover' +
     A**********                                   'Amount')
      **********                                     End   /145001/
      **********                                     Begin /CDL006/
     A**********  HKFCGC         2          TEXT('Fiduciary Charge Code')
     A**********                            COLHDG('Fiduciary Charge' +
     A**********                                   'Code')
     A**********  HKFCGD        20          TEXT('Fiduciary Charge Code +
     A**********                            Description')
     A**********                            COLHDG('Fiduciary Charge' +
     A**********                                   'Code Description')
     A**********  HKFCGA        13  0       TEXT('Fiduciary Charge Amount')
     A**********                            COLHDG('Fiduciary' +
     A**********                                   'Charge Amount')
     A**********  HKFCGT         9  0       TEXT('Fiduciary Tax on Charge +
     A**********                            Amount')
     A**********                            COLHDG('Fiduciary Tax on' +
     A**********                                   'Charge Amount')
     A**********  HKFCMC         2          TEXT('Fiduciary Commission code')
     A**********                            COLHDG('Fiduciary Commission' +
     A**********                                   'Code')
     A**********  HKFCMD        20          TEXT('Fiduciary Commission Code +
     A**********                            Description')
     A**********                            COLHDG('Fiduciary Commission' +
     A**********                                   'Code Description')
     A**********  HKFCMA        13  0       TEXT('Fiduciary  +
     A**********                                 Commission Amount')
     A**********                            COLHDG('Fiduciary' +
     A**********                                   'Commission Amount')
     A**********  HKFCMT         9  0       TEXT('Fiduciary Tax on +
     A**********                                 Commission  Amount')
     A**********                            COLHDG('Fiduciary Tax on' +
     A**********                                   'Commission Amount')
     A**********  HKFTST         1A         TEXT('Fiduciary Trust +
     A**********                                 Agreement Status')
     A**********                            COLHDG('Fiduciary Trust' +
     A**********                                   'Agreement Status')
     A**********  HKFRN1        60A         TEXT('Restriction  +
     A**********                                 Narrative 1')
     A**********                            COLHDG('Restriction' +
     A**********                                   'Narrative 1')
     A**********  HKFRN2        60A         TEXT('Restriction  +
     A**********                                 Narrative 2')
     A**********                            COLHDG('Restriction' +
     A**********                                   'Narrative 2')
     A**********  HKFRN3        60A         TEXT('Restriction  +
     A**********                                 Narrative 3')
     A**********                            COLHDG('Restriction' +
     A**********                                   'Narrative 3')
     A**********  HKFRN4        60A         TEXT('Restriction  +
     A**********                                 Narrative 4')
     A**********                            COLHDG('Restriction' +
     A**********                                   'Narrative 4')
      **********                                     End   /CDL006/
      **********                                     Begin /CPB001/
     A**********  HKREPI         1          TEXT('Replication Indicator')
     A**********                            COLHDG('Replication' 'Indicator')
      **********                                     End   /CPB001/
      **********                                     Begin /CDL007/
     A**********  HKOMDT         5P 0       TEXT('Original Maturity Date')
     A**********                            COLHDG('Original' 'Maturity Date')
     A**********  HKPENA        13P 0       TEXT('Penalty Charged')
     A**********                            COLHDG('Penalty' 'Charged')
     A**********  HKBUSR        10A         TEXT('Breakdown User Id')
     A**********                            COLHDG('Breakdown' 'User Id')
     A**********  HKPRIN         1          TEXT('Record Printed')
     A**********                            COLHDG('Record' 'Printed')
      **********                                     End   /CDL007/
      **********                                     Begin /CAP051/
     A**********  HKAUTH         1          TEXT('Automatic Authorisation')
     A**********                            COLHDG('Automatic' 'Authorisation')
      **********                                     End   /CAP051/
      **********                                     Begin /CSE006/
     A**********  HKTRTP         2          TEXT('Transaction Type')
     A**********                            COLHDG('Transaction'          +
     A**********                                   'Type')
      **********                                     End   /CSE006/
      **********                                     Begin /CGL011/
     A**********  HKCOLF         1          TEXT('Collateral Flag')
     A**********                            COLHDG('Collateral Flag')
     A**********  HKCOLA        15P 0       TEXT('Collateral Amount')
     A**********                            COLHDG('Collateral Amount')
      **********                                     End   /CGL011/
      **Start*of change CAS001
     A**********  HKOYLC         5          TEXT('Our/Buy Yield Curve')
     A**********                            COLHDG('Our/Buy' +
     A**********                                   'Yield Curve')
      **End*of*change CAS001
      **Start*of change CDL010
     A**********  HKUSER        10          TEXT('Last Amd/Ins User')
     A**********                            COLHDG('Last Amd/Ins User')
      **End*of*change CDL010
     A**Start*of change CAS005
     A**********  HKLQPR        11P 7       TEXT('Liquidity/Premium Rate')
     A**********                            COLHDG('Liquidity/Premium' +
     A**********                            'Rate')
     A**********  HKLQPS         1A         TEXT('Liquidity/Premium Sign')
     A**********                            COLHDG('Liquidity/Premium' +
     A**********                            'Sign')
     A**End*of*change CAS005
      *                                     End of Change CGP001
