      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_15WF                                                      *
/*EXI *  TEXT('Midas Positions for currency.')
     A****************************************************************
     A*                                                              *
     A*  Midas - Money Market (Dealing)
     A*                                                              *
     A*          MMEPOSPP - POSITION FOR CURRENCY                    *
     A*                                                              *
     A* (c) Finastra International Limited 2001                      *
     A*                                                              *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*          PREV AMEND NO. 000000    DATE   00/00/00            *
     A*                                                              *
     A*--------------------------------------------------------------*
     A*                                                              *
     A*  MD046248 - Finastra Rebranding                              *
     A****************************************************************
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R MMEPOSP0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*
     A            H2RCID    R               REFFLD(RCID)
     A            H2DLTF    R               REFFLD(DLTF)
     A            H2DLUP    R               REFFLD(DLUP)
     A            H2MLUP    R               REFFLD(MLUP)
     A            H2YLUP    R               REFFLD(YLUP)
     A            H2TLUP    R               REFFLD(TLUP)
     A            H2CHTP    R               REFFLD(CHTP)
     A            H2LCD     R               REFFLD(LCD)
     A            H2LUID    R               REFFLD(LUID)
     A            H2CCY     R               REFFLD(CCY)
     A            H2DICM    R               REFFLD(DICM)
     A            H2NBSP    R               REFFLD(NBSP)
     A            H2NIAS    R               REFFLD(NIAS)
     A            H2CCPL    R               REFFLD(CCPL)
     A            H2NDPD    R               REFFLD(NDPD)
     A            H2SPDT    R               REFFLD(FXSP)
     A            H2SPPD    R               REFFLD(STPD)
