      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_15WF                                                      *
/*EXI *  TEXT('Midas Liquidity Exposure File')
     A****************************************************************
     A*                                                              *
     A*  Midas - Money Market (Dealing)
     A*                                                              *
     A*          MMFLIQPP - LIQUIDITY EXPOSURE FILE                  *
     A*                                                              *
     A* (c) Finastra International Limited 2001                      *
     A*                                                              *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*          PREV AMEND NO. 000000    DATE   00/00/00            *
     A*                                                              *
     A*--------------------------------------------------------------*
     A*                                                              *
     A*  MD046248 - Finastra Rebranding                              *
     A****************************************************************
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R MMFLIQP0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*
     A            HQRCID    R               REFFLD(RCID)
     A            HQDLTF    R               REFFLD(DLTF)
     A            HQDLUP    R               REFFLD(DLUP)
     A            HQMLUP    R               REFFLD(MLUP)
     A            HQYLUP    R               REFFLD(YLUP)
     A            HQTLUP    R               REFFLD(TLUP)
     A            HQCHTP    R               REFFLD(CHTP)
     A            HQLCD     R               REFFLD(LCD)
     A            HQLUID    R               REFFLD(LUID)
     A            HQCCY     R               REFFLD(CCY)
     A*
     A            HQLTCE    R               REFFLD(LTCE)
     A            HQLTD1    R               REFFLD(LTD1)
     A            HQLTD2    R               REFFLD(LTD2)
     A            HQLTD3    R               REFFLD(LTD3)
     A            HQLTD4    R               REFFLD(LTD4)
     A            HQLTW1    R               REFFLD(LTW1)
     A            HQLTM1    R               REFFLD(LTM1)
     A            HQLTM2    R               REFFLD(LTM2)
     A            HQLTM3    R               REFFLD(LTM3)
     A            HQLTRM    R               REFFLD(LTRM)
     A            HQLPCE    R               REFFLD(LPCE)
     A            HQLPD1    R               REFFLD(LPD1)
     A            HQLPD2    R               REFFLD(LPD2)
     A            HQLPD3    R               REFFLD(LPD3)
     A            HQLPD4    R               REFFLD(LPD4)
     A            HQLPW1    R               REFFLD(LPW1)
     A            HQLPM1    R               REFFLD(LPM1)
     A            HQLPM2    R               REFFLD(LPM2)
     A            HQLPM3    R               REFFLD(LPM3)
     A            HQLPRM    R               REFFLD(LPRM)
     A*
     A*
     A            HQCFIX    R               REFFLD(CFIX)
     A            HQFXD1    R               REFFLD(FXD1)
     A            HQFXD2    R               REFFLD(FXD2)
     A            HQFXD3    R               REFFLD(FXD3)
     A            HQFXD4    R               REFFLD(FXD4)
     A            HQFXW1    R               REFFLD(FXW1)
     A            HQFXM1    R               REFFLD(FXM1)
     A            HQFXM2    R               REFFLD(FXM2)
     A            HQFXM3    R               REFFLD(FXM3)
     A            HQPDTD    R               REFFLD(TPER)
     A            HQPDD1    R               REFFLD(PDD1)
     A            HQPDD2    R               REFFLD(PDD2)
     A            HQPDD3    R               REFFLD(PDD3)
     A            HQPDD4    R               REFFLD(PDD4)
     A            HQPDW1    R               REFFLD(PDW1)
     A            HQPDM1    R               REFFLD(PDM1)
     A            HQPDM2    R               REFFLD(PDM2)
     A            HQPDM3    R               REFFLD(PDM3)
