      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MM History Deal Header')                         *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *   PF/MMHISTHM   MM HISTORY FILE-LOANS HEADER                  *
      *                                                               *
      *  (c) Finastra International Limited 2005                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027             Date 11Jan06               *
      *                 232928  *CREATE    Date 08Apr05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CLE148 - Alpha Loan Reference                                *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  232928 - Amortise all fees non-linearly, EIR calculation,    *
      *           Non-linear amortisation calculation & adjustment    *
      *                                                               *
      *****************************************************************
      *  C R E A T I O N     P A R A M E T E R S                      *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R HISTSHMF                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2005')
     A            RECI      R
     A            RCDT      R
     A            BRCA      R
      * Begin /CSD027/
     A**********  CNUM      R                                                                 CSD027
     A            CNUM           6A         TEXT('Customer Number')                           CSD027
     A                                      COLHDG('Customer Number')                         CSD027
      * End /CSD027/
      **Start of change CLE148
     A**********  LNRF      R                                                                 CLE148
     A            LNRF           6A
      **End of change CLE148
     A                                      TEXT('Deal Number')
     A                                      COLHDG('Deal'    +
     A                                             'Number')
     A            VDAT      R               REFFLD(VDAT0 )
     A            PRSQ      R
     A            LASN      R               REFFLD(LASN0 )
      * Begin /CSD027/
     A**********  FCUS      R               REFFLD(FCUS0 )                                    CSD027
     A            FCUS           6A         TEXT('Facility customer number')                  CSD027
     A                                      COLHDG('Fclty Cust. Numb.')                       CSD027
      * End /CSD027/
     A            FTYP      R               REFFLD(FTYP0 )
     A            FSEQ      R
     A            PTYP      R
     A            CCY       R
     A            AMTP      R
     A            PRAM      R
     A            BRTT      R
     A            BRTE      R
     A            RTSP      R
     A            SPIN      R
     A            CALC      R
     A            WTIN      R
     A            REPT      R
     A            INTC      R
     A            LTYP      R
     A                                      TEXT('Deal Type')
     A                                      COLHDG('Deal'    +
     A                                             'Type')
     A            SUTP      R
     A                                      TEXT('Deal Sub-type')
     A                                      COLHDG('Deal'    +
     A                                             'Sub-type')
     A            TOTI      R
     A            FCLB      R
     A            ZZ011     R
     A            LCD       R
     A            ZZ001     R
      *
     A            FSRP      R               REFFLD(RTSP)
     A                                      TEXT('Funding Spread/Rate')
     A                                      COLHDG('Funding' +
     A                                             'Spread' +
     A                                             'Rate')
     A            FSGN      R               REFFLD(SPIN)
     A                                      TEXT('Funding Sign')
     A                                      COLHDG('Funding' +
     A                                             'Sign')
      *
     A            TCOF      R               REFFLD(AABC)
     A                                      TEXT('Total Cost of Funds')
     A                                      COLHDG('Total' +
     A                                             'Cost of' +
     A                                             'Funds')
      *
     A            FPRC      R               REFFLD(PRFC)
     A                                      TEXT('Funding Profit Centre')
     A                                      COLHDG('Funding' +
     A                                             'Profit' +
     A                                             'Centre')
      *
     A            CPAM      R
     A            AITC      R
     A            INTR      R
     A            AIAP      R
     A            IPRD      R
      *
     A            ACDA      R               REFFLD(AABC)
     A                                      TEXT('Accrued COF to Control Date')
     A                                      COLHDG('Accrued' +
     A                                             'Cost of Funds' +
     A                                             'to Control Date')
      *
     A            COFR      R               REFFLD(RTSP)
     A                                      TEXT('Cost of Fund Rate')
     A                                      COLHDG('Cost of' +
     A                                             'Fund' +
     A                                             'Rate')
      *
     A            ACAP      R               REFFLD(AABC)
     A                                      TEXT('Accrued COF Adjustmnt Posted')
     A                                      COLHDG('Accrued' +
     A                                             'Cost of Funds' +
     A                                             'Adjustment Posted')
      *
     A            COFD      R               REFFLD(AABC)
     A                                      TEXT('COF Paid/Received to Date')
     A                                      COLHDG('Cost of Funds' +
     A                                             'Paid/Received' +
     A                                             'to Date')
      *
     A            AITN      R               REFFLD(AITC)
     A                                      TEXT('AITC Using Net Treasury +
     A                                      Rate')
     A                                      COLHDG('AITC Using' +
     A                                             'Net Treasury' +
     A                                             'Rate')
     A            AIAN      R               REFFLD(AIAP)
     A                                      TEXT('AIAP Using Net Treasury +
     A                                      Rate')
     A                                      COLHDG('AIAP Using' +
     A                                             'Net Treasury' +
     A                                             'Rate')
     A            IPRN      R               REFFLD(IPRD)
     A                                      TEXT('IPRD Using Net Treasury +
     A                                      Rate')
     A                                      COLHDG('IPRD Using' +
     A                                             'Net Treasury' +
     A                                             'Rate')
     A            FSPRAM    R               REFFLD(PRAM)
     A                                      TEXT('PRAM Using Net Treasury +
     A                                      Rate')
     A                                      COLHDG('PRAM Using' +
     A                                             'Net Treasury' +
     A                                             'Rate')
     A            FSCPAM    R               REFFLD(CPAM)
     A                                      TEXT('CPAM Using Net Treasury +
     A                                      Rate')
     A                                      COLHDG('CPAM Using' +
     A                                             'Net Treasury' +
     A                                             'Rate')
