      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MM Invalid Loans/Deposits/NA Issued')            *
      *****************************************************************
      *                                                               *
      *  Midas - MM ILE Module                                        *
      *                                                               *
      *  PF/MMILDNIPD - Invalid Loans/Deposits/NAs Issued             *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CER059             Date 19Jul10               *
      *                 CER020             Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CDL049             Date 31Mar06               *
      *                 CDL038             Date 10May05               *
      *                 CDL033             Date 10Feb05               *
      *                 BUG7220            Date 10Feb05               *
      *                 CDL020             Date 03Feb04               *
      *                 CDL019             Date 03Feb04               *
      *                 CDL017             Date 03Feb04               *
      *                 CDL016             Date 03Feb04               *
      *                 CGL029             Date 01Sep03               *
      *                 CAS005             Date 16Dec02               *
      * Midas Release 4.01 -------------------------------------------*
      *                 CAS001             Date 23Nov01               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CSE006             Date 26Apr99               *
      *                 CAP051             Date 08Nov99               *
      *                 CDL007             Date 08Oct99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CAP002  *CREATE    Date 08Oct97               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER020 - Enhanced Rollover Window: Upgrade FGE089 to         *
      *           Midas Plus                                          *
      *  CDL049 - Addition of a Reference Rate field                  *
      *  CDL038 - Extended Deal Sub Type                              *
      *  CDL033 - Floating Rate CDs Issued                            *
      *  BUG7220- Added Field Text and Column Heading to DDINSA       *
      *  CDL020 - Apply Base Rate at Value Date                       *
      *  CDL019 - Allow Base Rate Changes on Fixed Deposits/Loans     *
      *  CDL017 - Penalty Fee & Early Maturity of Fixed Term Loan/Dep *
      *  CDL016 - Autumatic Rollover of Fixed Term Loan/Deposit       *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CAS005 - Enhancements to CAS001, CAS002 and CAS004           *
      *  CAS001 - Net Present Value (NPV) Accounting                  *
      *  CSE006 - Repurchase Agreements (REPOS) enhancement:          *
      *           New field - Transaction Type                        *
      *  CAP051 - Automatic Authorisation (MM Part)                   *
      *  CDL007 - Deposit Breakdown Penalty                           *
      *  CAP002 - Conversion of Midas inputs to modular API structure *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R MMILDNID0                 TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A            DDFOTRANIDR               REFFLD(FOTRNID)
     A            DDFOASOCIDR               REFFLD(FOTRNID)
     A                                      TEXT('Associated Front +
     A                                            Office Transaction Id')
     A                                      COLHDG('Associated' +
     A                                             'Front Office' +
     A                                             'Transaction Id')
     A            DDRPRLOCN R               REFFLD(RPRLOC)
     A            DDACTN    R               REFFLD(ACTO)
     A            DDDLNO    R     A         REFFLD(DEAL)
     A            DDTYPE    R               REFFLD(DTPE)
     A            DDSTYP    R               REFFLD(DLST)
     A            DDFEDF    R               REFFLD(FEDF)
     A            DDDADN    R     A         REFFLD(DEAL)
                                            TEXT('Rollover Deal Number')
                                            COLHDG('Rollover' 'Deal' 'Number')
     A            DDDLDT    R     A         REFFLD(CHGD)
                                            TEXT('Deal Date')
                                            COLHDG('Deal' 'Date')
     A            DDBRCA    R               REFFLD(BRCA)
     A            DDBOKC    R               REFFLD(BOKC)
     A            DDLNKN    R     A         REFFLD(LNKDN)
     A            DDBKCD    R               REFFLD(BKCD)
     A            DDBRKG        14A         TEXT('Brokerage Amount')
                                            COLHDG('Brokerage' 'Amount')
     A            DDRACD         1A         TEXT('Brokerage Rate/Amount Flag')
                                            COLHDG('Brkg Rate' '/Amount' 'Flag')
     A            DDCUST    R               REFFLD(CSNM)
     A            DDVDAT    R     A         REFFLD(CHGD)
                                            TEXT('Value Date')
                                            COLHDG('Value' 'Date')
     A            DDMDAT    R     A         REFFLD(CHGD)
                                            TEXT('Maturity Date')
                                            COLHDG('Maturity' 'Date')
     A            DDNTCE    R     A         REFFLD(NTCE)
     A            DDACSQ    R     A         REFFLD(ACSQ)
     A            DDCCY     R               REFFLD(CCY)
     A            DDAMNP        14A         TEXT('Deal Amount')
                                            COLHDG('Deal' 'Amount')
     A            DDBRAT        13A         TEXT('Base Currency Rate')
                                            COLHDG('Base' 'Currency' 'Rate')
     A            DDDRID    R               REFFLD(DRID)
     A            DDDDMR    R               REFFLD(DDMR)
     A            DDBSRC    R               REFFLD(MRBC)
                                            COLHDG('Base' 'Rate' 'Code')
     A            DDSPRT        12A         TEXT('Spread/Rate')
                                            COLHDG('Spread/Rate')
     A            DDICMT    R               REFFLD(ICMT)
     A            DDNGVI    R               REFFLD(NGVI)
     A            DDIPFQ    R               REFFLD(IPFQ)
     A            DDNDAT         6A         TEXT('Next Interest Date')
                                            COLHDG('Next' 'Interest' 'Date')
     A            DDTOTI        14A         TEXT('Total Interest')
                                            COLHDG('Total Interest')
     A            DDIPDM    R     A         REFFLD(IPDM)
     A            DDCPTI    R               REFFLD(CPTI)
     A            DDMTAX    R               REFFLD(MTAX)
     A            DDFUID    R               REFFLD(FUID)
     A            DDFLID    R               REFFLD(JFLID)
     A            DDRDFC    R               REFFLD(JRDFC)
     A            DDCDRF    R               REFFLD(CDRF)
     A            DDCDCH    R               REFFLD(CSNM)
     A                                      TEXT('CD Holder')
     A                                      COLHDG('CD' 'Holder')
     A            DDPRFC    R               REFFLD(PRFC)
     A            DDORBR    R               REFFLD(ORBR)
     A            DDPTFR    R               REFFLD(PTFR)
     A            DDAURO    R               REFFLD(AURO)
     A            DDCNNA    R               REFFLD(CNNA)
     A            DDROFQ    R               REFFLD(ROFQ)
     A            DDRLDN         2A         TEXT('Rollover Day Number')
     A                                      COLHDG('Rollover' 'Day' 'Number')
     A            DDIPDS    R               REFFLD(IPDS)
     A            DDIMET    R               REFFLD(IMET)
     A            DDISCY    R               REFFLD(CCY)
     A                                      TEXT('Interest Settlement Ccy')
     A                                      COLHDG('Int' 'Settl' 'Ccy')
     A**Start of change CGL029
     A**********  DDINSA    R               REFFLD(INSA)                                      CGL029
     A            DDINSA        21A
      **Start of change BUG7220
     A                                      TEXT('Interest Settlement A/C')
     A                                      COLHDG('Interest' 'Settlement A/C')
      **End of change BUG7220
     A**End of change CGL029
     A            DDINOS    R               REFFLD(INOS)
     A            DDII72    R               REFFLD(CCY)
     A                                      TEXT('In Ccy in Field 72')
     A                                      COLHDG('In' 'Ccy' 'Fld 72')
     A            DDFSRP    R   +1A         REFFLD(SPRD)
     A                                      TEXT('Funding Spread/Rate')
     A            DDFSGN    R               REFFLD(IND)
     A                                      TEXT('Funding Spread Sign')
     A            DDFPRC    R               REFFLD(PRFC)
     A                                      TEXT('Funding Profit Centre')
 
      ** Timestamp
     A            DDTMESTMP R               REFFLD(TIMESTMP)
      *                                              Begin /CDL007/
     A            DDPENA        14A         TEXT('Penalty Charged')
     A                                      COLHDG('Penalty' 'Charge')
     A            DDBUSR        10A         TEXT('Breakdown User Id')
     A                                      COLHDG('Breakdown' 'User Id')
      *                                              End   /CDL007/
      *                                              Begin /CAP051/
     A            DDAUTH         1          TEXT('Automatic Authorisation')
     A                                      COLHDG('Automatic' 'Authorisation')
      *                                              End   /CAP051/
      *                                              Begin /CSE006/
     A            IKTRTP         2          TEXT('Transaction Type')
     A                                      COLHDG('Transaction'          +
     A                                             'Type')
      *                                              End   /CSE006/
      **Start of change CAS001
     A            DDOYLC         5          TEXT('Our/Buy Yield Curve')
     A                                      COLHDG('Our/Buy' +
     A                                             'Yield Curve')
      **End of change CAS001
     A**Start of change CAS005
     A            DDLQPR        12A         TEXT('Liquidity/Premium Rate')
     A                                      COLHDG('Liquidity/Premium' +
     A                                      'Rate')
     A            DDLQPS         1A         TEXT('Liquidity/Premium Sign')
     A                                      COLHDG('Liquidity/Premium' +
     A                                      'Sign')
     A**End of change CAS005
      **Start of change CDL016
     A            DDROLI         1A         TEXT('Rollover Indicator')
     A                                      COLHDG('Rollover' 'Indicator')
     A            DDSOFD        20A         TEXT('Source of Funds')
     A                                      COLHDG('Source of Funds')
     A            DDBLKA         1A         TEXT('Blocked Indicator')
     A                                      COLHDG('Blocked' 'Indicator')
      **End of change CDL016
      **Start of change CDL017
     A            DDCAND         6A         TEXT('Cancellation Date')
     A                                      COLHDG('Cancellation' 'Date')
     A            DDPNPR         1A         TEXT('Penalty Pay/Receive')
     A                                      COLHDG('Penalty' 'Pay/Receive')
      **End of change CDL017
      **Start of change CDL019
     A            DDFBRT         1A         TEXT('Fix Base Rate')
     A                                      COLHDG('Fix' 'Base' 'Rate')
      **End of change CDL019
      **Start of change CDL020
     A            DDAIR         12A         TEXT('Actual Interest Rate')
     A                                      COLHDG('Actual' 'Interest Rate')
      **End of change CDL020
      **Start of change CDL033
     A            DDRCDT         6A         TEXT('Rate Change Date')
     A                                      COLHDG('Rate Change Date' )
     A            DDRCFR         1A         TEXT('Rate Change Frequency')
     A                                      COLHDG('Rate Change Frequen')
     A            DDRCDM         2A         TEXT('Rate Change Day')
     A                                      COLHDG('Rate Change Day')
     A            DDSTRT        12A         TEXT('Short Term Rate')
     A                                      COLHDG('Short Term Rate')
     A            DDFXDM         2A         TEXT('Rate Fix Days')
     A                                      COLHDG('Rate Fix Days')
     A            DDFYLD         5A         TEXT('Forward Yield Curve')
     A                                      COLHDG('Forward Yield Curve')
      **End of change CDL033
     A*                                              Begin /CDL038/
     A            DDCLAS         4A         TEXT('Deal Class')
     A                                      COLHDG('Deal' 'Class')
     A*                                              End   /CDL038/
     A**Start of change CDL049
     A            DDRRAT        14A         TEXT('Reference Rate')
     A                                      COLHDG('Reference Rate')
     A**End of change CDL049
      **Start of change CER020
     A            DDISDT         6A         TEXT('Initial Start Date')
     A                                      COLHDG('Initial Start ' +
     A                                             'Date')
      *
     A            DDFMDT         6A         TEXT('Final Maturity +
     A                                          Date')
     A                                      COLHDG('Final Maturity ' +
     A                                             'Date')
      *
     A            DDORDN         6A         TEXT('Original Deal +
     A                                          Number')
     A                                      COLHDG('Original Deal ' +
     A                                             'Number')
      **End of change CER020
