      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MM Invalid NAs Sold')                            *
      *****************************************************************
      *                                                               *
      *  Midas - MM ILE Module                                        *
      *                                                               *
      *  PF/MMINASSPD - Invalid NAs Sold                              *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Last Amend No. CDL038             Date 10May05               *
      *  Prev Amend No. CAP002  *CREATE    Date 08Oct97               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CDL038 - Extended Deal Sub Type                              *
      *  CAP002 - Conversion of MM inputs into modular structure to   *
      *           use as APIs.                                        *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R MMINASSD0                 TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
 
      ** Front Office Transaction Id
     A            FRONTOFFIDR               REFFLD(FOTRNID)
 
      ** Associated Front Office Transaction Id
     A            ASSOCFOID R               REFFLD(FOTRNID)
     A                                      TEXT('Associated Front +
     A                                            Office Transaction Id')
     A                                      COLHDG('Associated' +
     A                                             'Front Office' +
     A                                             'Transaction Id')
 
      ** Deal repair location
     A            REPAIRLOC R               REFFLD(RPRLOC)
 
      ** Action code
     A            DDACTN    R               REFFLD(ACTO)
     A                                      TEXT('Action code')
     A                                      COLHDG('Action' 'code')
 
      ** Deal number
     A            DDDLNO    R     A         REFFLD(DEAL)
     A                                      TEXT('Deal number')
     A                                      COLHDG('Deal' 'number')
 
      ** Deal type
     A            DDMTYP    R               REFFLD(MDTY)
     A                                      TEXT('Deal type')
     A                                      COLHDG('Deal' 'type')
 
      ** Deal subtype
     A            DDSTYP    R               REFFLD(DLST)
     A                                      TEXT('Deal subtype')
     A                                      COLHDG('Deal' 'subtype')
 
      ** Federal funds indicator
     A            DDFEDF    R               REFFLD(FEDF)
     A                                      TEXT('Federal funds indicator')
     A                                      COLHDG('Federal' 'funds' +
     A                                             'indicator')
 
      ** Deal date
     A            DDDLDT    R     A         REFFLD(CHGD)
     A                                      TEXT('Deal date')
     A                                      COLHDG('Deal' 'date')
 
      ** Broker code
     A            DDBKCD    R               REFFLD(BKCD)
     A                                      TEXT('Broker code')
     A                                      COLHDG('Broker' 'code')
 
      ** Brokerage
     A            DDBRKG    R     A         REFFLD(AMNP)
     A                                      TEXT('Brokerage')
     A                                      COLHDG('Brokerage')
 
      ** Sale of Deal No
     A            DDDADN    R               REFFLD(DADN)
     A                                      TEXT('Sale of deal number')
     A                                      COLHDG('Sale of' 'deal number')
 
      ** Issued By
     A            DDISUR    R               REFFLD(CSNM)
     A                                      TEXT('NAB issuer')
     A                                      COLHDG('NAB' 'issuer')
 
      ** Sold to
     A            DDCSNM    R               REFFLD(CSNM)
     A                                      TEXT('Sold to customer')
     A                                      COLHDG('Sold' 'to' 'customer')
 
      ** Value Date
     A            DDVDAT    R     A         REFFLD(CHGD)
     A                                      TEXT('Value date')
     A                                      COLHDG('Value' 'date')
 
      ** Currency
     A            DDCCY     R               REFFLD(CCY)
     A                                      TEXT('Currency')
     A                                      COLHDG('Currency')
 
      ** Face Value
     A            DDFVAL    R     A         REFFLD(FAVL)
     A                                      TEXT('NAB face value')
     A                                      COLHDG('NAB' 'face' 'value')
 
      ** Sale Price
     A            DDAMNP    R     A         REFFLD(AMNP)
     A                                      TEXT('Sale price')
     A                                      COLHDG('Sale' 'price')
 
      ** Yield rate
     A            DDINTR    R   +1A         REFFLD(INTS)
     A                                      TEXT('Yield rate')
     A                                      COLHDG('Yield' 'rate')
 
      ** Book Code
     A            DDBOKC    R     A  B      REFFLD(BOKC)
     A                                      TEXT('Book code')
     A                                      COLHDG('Book' 'code')
 
      ** Linked Ref. No.
     A            DDLNKN    R     A         REFFLD(LNKDN)
     A                                      TEXT('Linked ref. no.')
     A                                      COLHDG('Linked' 'ref.' 'no.')
 
      ** Profit centre
     A            DDPRFC    R               REFFLD(PRFC)
     A                                      TEXT('Profit centre')
     A                                      COLHDG('Profit' 'centre')
 
      ** Orig. Branch
     A            DDORBR    R     A         REFFLD(ORBR)
     A                                      TEXT('Originating branch')
     A                                      COLHDG('Originating' 'branch')
 
      ** Parcel Size
     A            DDPSZE    R     A         REFFLD(PSIZ)
     A                                      TEXT('Parcel size')
     A                                      COLHDG('Parcel' 'size')
 
      ** Timestamp
     A            DDTMESTMP R               REFFLD(TIMESTMP)
     A*                                              Begin /CDL038/
     A            DDCLAS         4A         TEXT('Deal Class')
     A                                      COLHDG('Deal' 'Class')
     A*                                              End   /CDL038/
