      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MM Fiduciary takings format work file')
      *****************************************************************
      *                                                               *
      *  Midas - Money Market Module                                  *
      *                                                               *
      *  PF/MMWFIDTPD - Fiduciary Takings Format Work File            *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2002            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4.01.02 ----------------------------------------*
      *  Prev Amend No. 209905  *CREATE    Date 25Sep02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  209905 - Fiduciary API Enhancement                           *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R MMWFIDTD0                 TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2002')
      *
      **  Detail 01
      *
     A            SFDLNO01       6          TEXT('Deal Number 01')
     A                                      COLHDG('Deal' +
     A                                             'Number 01')
     A            SFCNUM01      10          TEXT('Customer Number 01')
     A                                      COLHDG('Customer' +
     A                                             'Number 01')
     A            SFPTFR01       4          TEXT('Portfolio Reference 01')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 01')
     A            SFAMNT01      15          TEXT('Amount 01')
     A                                      COLHDG('Amount 01')
     A**Start of change CGL029
     A**********  SFACOD01       4          TEXT('Account Code 01')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 01')                                 CGL029
     A            SFACOD01QQ     4A
     A**End of change CGL029
     A            SFACSQ01       2          TEXT('Account Sequence 01')
     A                                      COLHDG('Account' +
     A                                             'Sequence 01')
     A            SFTRAS01       1          TEXT('Trust Agreement 01')
     A                                      COLHDG('Trust Agreement 01')
      *
      **  Detail 02
      *
     A            SFDLNO02       6          TEXT('Deal Number 02')
     A                                      COLHDG('Deal' +
     A                                             'Number 02')
     A            SFCNUM02      10          TEXT('Customer Number 02')
     A                                      COLHDG('Customer' +
     A                                             'Number 02')
     A            SFPTFR02       4          TEXT('Portfolio Reference 02')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 02')
     A            SFAMNT02      15          TEXT('Amount 02')
     A                                      COLHDG('Amount 02')
     A**Start of change CGL029
     A**********  SFACOD02       4          TEXT('Account Code 02')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 02')                                 CGL029
     A            SFACOD02QQ     4A
     A**End of change CGL029
     A            SFACSQ02       2          TEXT('Account Sequence 02')
     A                                      COLHDG('Account' +
     A                                             'Sequence 02')
     A            SFTRAS02       1          TEXT('Trust Agreement 02')
     A                                      COLHDG('Trust Agreement 02')
      *
      **  Detail 03
      *
     A            SFDLNO03       6          TEXT('Deal Number 03')
     A                                      COLHDG('Deal' +
     A                                             'Number 03')
     A            SFCNUM03      10          TEXT('Customer Number 03')
     A                                      COLHDG('Customer' +
     A                                             'Number 03')
     A            SFPTFR03       4          TEXT('Portfolio Reference 03')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 03')
     A            SFAMNT03      15          TEXT('Amount 03')
     A                                      COLHDG('Amount 03')
     A**Start of change CGL029
     A**********  SFACOD03       4          TEXT('Account Code 03')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 03')                                 CGL029
     A            SFACOD03QQ     4A
     A**End of change CGL029
     A            SFACSQ03       2          TEXT('Account Sequence 03')
     A                                      COLHDG('Account' +
     A                                             'Sequence 03')
     A            SFTRAS03       1          TEXT('Trust Agreement 03')
     A                                      COLHDG('Trust Agreement 03')
      *
      **  Detail 04
      *
     A            SFDLNO04       6          TEXT('Deal Number 04')
     A                                      COLHDG('Deal' +
     A                                             'Number 04')
     A            SFCNUM04      10          TEXT('Customer Number 04')
     A                                      COLHDG('Customer' +
     A                                             'Number 04')
     A            SFPTFR04       4          TEXT('Portfolio Reference 04')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 04')
     A            SFAMNT04      15          TEXT('Amount 04')
     A                                      COLHDG('Amount 04')
     A**Start of change CGL029
     A**********  SFACOD04       4          TEXT('Account Code 04')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 04')                                 CGL029
     A            SFACOD04QQ     4A
     A**End of change CGL029
     A            SFACSQ04       2          TEXT('Account Sequence 04')
     A                                      COLHDG('Account' +
     A                                             'Sequence 04')
     A            SFTRAS04       1          TEXT('Trust Agreement 04')
     A                                      COLHDG('Trust Agreement 04')
      *
      **  Detail 05
      *
     A            SFDLNO05       6          TEXT('Deal Number 05')
     A                                      COLHDG('Deal' +
     A                                             'Number 05')
     A            SFCNUM05      10          TEXT('Customer Number 05')
     A                                      COLHDG('Customer' +
     A                                             'Number 05')
     A            SFPTFR05       4          TEXT('Portfolio Reference 05')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 05')
     A            SFAMNT05      15          TEXT('Amount 05')
     A                                      COLHDG('Amount 05')
     A**Start of change CGL029
     A**********  SFACOD05       4          TEXT('Account Code 05')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 05')                                 CGL029
     A            SFACOD05QQ     4A
     A**End of change CGL029
     A            SFACSQ05       2          TEXT('Account Sequence 05')
     A                                      COLHDG('Account' +
     A                                             'Sequence 05')
     A            SFTRAS05       1          TEXT('Trust Agreement 05')
     A                                      COLHDG('Trust Agreement 05')
      *
      **  Detail 06
      *
     A            SFDLNO06       6          TEXT('Deal Number 06')
     A                                      COLHDG('Deal' +
     A                                             'Number 06')
     A            SFCNUM06      10          TEXT('Customer Number 06')
     A                                      COLHDG('Customer' +
     A                                             'Number 06')
     A            SFPTFR06       4          TEXT('Portfolio Reference 06')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 06')
     A            SFAMNT06      15          TEXT('Amount 06')
     A                                      COLHDG('Amount 06')
     A**Start of change CGL029
     A**********  SFACOD06       4          TEXT('Account Code 06')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 06')                                 CGL029
     A            SFACOD06QQ     4A
     A**End of change CGL029
     A            SFACSQ06       2          TEXT('Account Sequence 06')
     A                                      COLHDG('Account' +
     A                                             'Sequence 06')
     A            SFTRAS06       1          TEXT('Trust Agreement 06')
     A                                      COLHDG('Trust Agreement 06')
      *
      **  Detail 07
      *
     A            SFDLNO07       6          TEXT('Deal Number 07')
     A                                      COLHDG('Deal' +
     A                                             'Number 07')
     A            SFCNUM07      10          TEXT('Customer Number 07')
     A                                      COLHDG('Customer' +
     A                                             'Number 07')
     A            SFPTFR07       4          TEXT('Portfolio Reference 07')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 07')
     A            SFAMNT07      15          TEXT('Amount 07')
     A                                      COLHDG('Amount 07')
     A**Start of change CGL029
     A**********  SFACOD07       4          TEXT('Account Code 07')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 07')                                 CGL029
     A            SFACOD07QQ     4A
     A**End of change CGL029
     A            SFACSQ07       2          TEXT('Account Sequence 07')
     A                                      COLHDG('Account' +
     A                                             'Sequence 07')
     A            SFTRAS07       1          TEXT('Trust Agreement 07')
     A                                      COLHDG('Trust Agreement 07')
      *
      **  Detail 08
      *
     A            SFDLNO08       6          TEXT('Deal Number 08')
     A                                      COLHDG('Deal' +
     A                                             'Number 08')
     A            SFCNUM08      10          TEXT('Customer Number 08')
     A                                      COLHDG('Customer' +
     A                                             'Number 08')
     A            SFPTFR08       4          TEXT('Portfolio Reference 08')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 08')
     A            SFAMNT08      15          TEXT('Amount 08')
     A                                      COLHDG('Amount 08')
     A**Start of change CGL029
     A**********  SFACOD08       4          TEXT('Account Code 08')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 08')                                 CGL029
     A            SFACOD08QQ     4A
     A**End of change CGL029
     A            SFACSQ08       2          TEXT('Account Sequence 08')
     A                                      COLHDG('Account' +
     A                                             'Sequence 08')
     A            SFTRAS08       1          TEXT('Trust Agreement 08')
     A                                      COLHDG('Trust Agreement 08')
      *
      **  Detail 09
      *
     A            SFDLNO09       6          TEXT('Deal Number 09')
     A                                      COLHDG('Deal' +
     A                                             'Number 09')
     A            SFCNUM09      10          TEXT('Customer Number 09')
     A                                      COLHDG('Customer' +
     A                                             'Number 09')
     A            SFPTFR09       4          TEXT('Portfolio Reference 09')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 09')
     A            SFAMNT09      15          TEXT('Amount 09')
     A                                      COLHDG('Amount 09')
     A**Start of change CGL029
     A**********  SFACOD09       4          TEXT('Account Code 09')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 09')                                 CGL029
     A            SFACOD09QQ     4A
     A**End of change CGL029
     A            SFACSQ09       2          TEXT('Account Sequence 09')
     A                                      COLHDG('Account' +
     A                                             'Sequence 09')
     A            SFTRAS09       1          TEXT('Trust Agreement 09')
     A                                      COLHDG('Trust Agreement 09')
      *
      **  Detail 10
      *
     A            SFDLNO10       6          TEXT('Deal Number 10')
     A                                      COLHDG('Deal' +
     A                                             'Number 10')
     A            SFCNUM10      10          TEXT('Customer Number 10')
     A                                      COLHDG('Customer' +
     A                                             'Number 10')
     A            SFPTFR10       4          TEXT('Portfolio Reference 10')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 10')
     A            SFAMNT10      15          TEXT('Amount 10')
     A                                      COLHDG('Amount 10')
     A**Start of change CGL029
     A**********  SFACOD10       4          TEXT('Account Code 10')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 10')                                 CGL029
     A            SFACOD10QQ     4A
     A**End of change CGL029
     A            SFACSQ10       2          TEXT('Account Sequence 10')
     A                                      COLHDG('Account' +
     A                                             'Sequence 10')
     A            SFTRAS10       1          TEXT('Trust Agreement 10')
     A                                      COLHDG('Trust Agreement 10')
      *
      **  Detail 11
      *
     A            SFDLNO11       6          TEXT('Deal Number 11')
     A                                      COLHDG('Deal' +
     A                                             'Number 11')
     A            SFCNUM11      10          TEXT('Customer Number 11')
     A                                      COLHDG('Customer' +
     A                                             'Number 11')
     A            SFPTFR11       4          TEXT('Portfolio Reference 11')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 11')
     A            SFAMNT11      15          TEXT('Amount 11')
     A                                      COLHDG('Amount 11')
     A**Start of change CGL029
     A**********  SFACOD11       4          TEXT('Account Code 11')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 11')                                 CGL029
     A            SFACOD11QQ     4A
     A**End of change CGL029
     A            SFACSQ11       2          TEXT('Account Sequence 11')
     A                                      COLHDG('Account' +
     A                                             'Sequence 11')
     A            SFTRAS11       1          TEXT('Trust Agreement 11')
     A                                      COLHDG('Trust Agreement 11')
      *
      **  Detail 12
      *
     A            SFDLNO12       6          TEXT('Deal Number 12')
     A                                      COLHDG('Deal' +
     A                                             'Number 12')
     A            SFCNUM12      10          TEXT('Customer Number 12')
     A                                      COLHDG('Customer' +
     A                                             'Number 12')
     A            SFPTFR12       4          TEXT('Portfolio Reference 12')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 12')
     A            SFAMNT12      15          TEXT('Amount 12')
     A                                      COLHDG('Amount 12')
     A**Start of change CGL029
     A**********  SFACOD12       4          TEXT('Account Code 12')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 12')                                 CGL029
     A            SFACOD12QQ     4A
     A**End of change CGL029
     A            SFACSQ12       2          TEXT('Account Sequence 12')
     A                                      COLHDG('Account' +
     A                                             'Sequence 12')
     A            SFTRAS12       1          TEXT('Trust Agreement 12')
     A                                      COLHDG('Trust Agreement 12')
      *
      **  Detail 13
      *
     A            SFDLNO13       6          TEXT('Deal Number 13')
     A                                      COLHDG('Deal' +
     A                                             'Number 13')
     A            SFCNUM13      10          TEXT('Customer Number 13')
     A                                      COLHDG('Customer' +
     A                                             'Number 13')
     A            SFPTFR13       4          TEXT('Portfolio Reference 13')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 13')
     A            SFAMNT13      15          TEXT('Amount 13')
     A                                      COLHDG('Amount 13')
     A**Start of change CGL029
     A**********  SFACOD13       4          TEXT('Account Code 13')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 13')                                 CGL029
     A            SFACOD13QQ     4A
     A**End of change CGL029
     A            SFACSQ13       2          TEXT('Account Sequence 13')
     A                                      COLHDG('Account' +
     A                                             'Sequence 13')
     A            SFTRAS13       1          TEXT('Trust Agreement 13')
     A                                      COLHDG('Trust Agreement 13')
      *
      **  Detail 14
      *
     A            SFDLNO14       6          TEXT('Deal Number 14')
     A                                      COLHDG('Deal' +
     A                                             'Number 14')
     A            SFCNUM14      10          TEXT('Customer Number 14')
     A                                      COLHDG('Customer' +
     A                                             'Number 14')
     A            SFPTFR14       4          TEXT('Portfolio Reference 14')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 14')
     A            SFAMNT14      15          TEXT('Amount 14')
     A                                      COLHDG('Amount 14')
     A**Start of change CGL029
     A**********  SFACOD14       4          TEXT('Account Code 14')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 14')                                 CGL029
     A            SFACOD14QQ     4A
     A**End of change CGL029
     A            SFACSQ14       2          TEXT('Account Sequence 14')
     A                                      COLHDG('Account' +
     A                                             'Sequence 14')
     A            SFTRAS14       1          TEXT('Trust Agreement 14')
     A                                      COLHDG('Trust Agreement 14')
      *
      **  Detail 15
      *
     A            SFDLNO15       6          TEXT('Deal Number 15')
     A                                      COLHDG('Deal' +
     A                                             'Number 15')
     A            SFCNUM15      10          TEXT('Customer Number 15')
     A                                      COLHDG('Customer' +
     A                                             'Number 15')
     A            SFPTFR15       4          TEXT('Portfolio Reference 15')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 15')
     A            SFAMNT15      15          TEXT('Amount 15')
     A                                      COLHDG('Amount 15')
     A**Start of change CGL029
     A**********  SFACOD15       4          TEXT('Account Code 15')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 15')                                 CGL029
     A            SFACOD15QQ     4A
     A**End of change CGL029
     A            SFACSQ15       2          TEXT('Account Sequence 15')
     A                                      COLHDG('Account' +
     A                                             'Sequence 15')
     A            SFTRAS15       1          TEXT('Trust Agreement 15')
     A                                      COLHDG('Trust Agreement 15')
      *
      **  Detail 16
      *
     A            SFDLNO16       6          TEXT('Deal Number 16')
     A                                      COLHDG('Deal' +
     A                                             'Number 16')
     A            SFCNUM16      10          TEXT('Customer Number 16')
     A                                      COLHDG('Customer' +
     A                                             'Number 16')
     A            SFPTFR16       4          TEXT('Portfolio Reference 16')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 16')
     A            SFAMNT16      15          TEXT('Amount 16')
     A                                      COLHDG('Amount 16')
     A**Start of change CGL029
     A**********  SFACOD16       4          TEXT('Account Code 16')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 16')                                 CGL029
     A            SFACOD16QQ     4A
     A**End of change CGL029
     A            SFACSQ16       2          TEXT('Account Sequence 16')
     A                                      COLHDG('Account' +
     A                                             'Sequence 16')
     A            SFTRAS16       1          TEXT('Trust Agreement 16')
     A                                      COLHDG('Trust Agreement 16')
      *
      **  Detail 17
      *
     A            SFDLNO17       6          TEXT('Deal Number 17')
     A                                      COLHDG('Deal' +
     A                                             'Number 17')
     A            SFCNUM17      10          TEXT('Customer Number 17')
     A                                      COLHDG('Customer' +
     A                                             'Number 17')
     A            SFPTFR17       4          TEXT('Portfolio Reference 17')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 17')
     A            SFAMNT17      15          TEXT('Amount 17')
     A                                      COLHDG('Amount 17')
     A**Start of change CGL029
     A**********  SFACOD17       4          TEXT('Account Code 17')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 17')                                 CGL029
     A            SFACOD17QQ     4A
     A**End of change CGL029
     A            SFACSQ17       2          TEXT('Account Sequence 17')
     A                                      COLHDG('Account' +
     A                                             'Sequence 17')
     A            SFTRAS17       1          TEXT('Trust Agreement 17')
     A                                      COLHDG('Trust Agreement 17')
      *
      **  Detail 18
      *
     A            SFDLNO18       6          TEXT('Deal Number 18')
     A                                      COLHDG('Deal' +
     A                                             'Number 18')
     A            SFCNUM18      10          TEXT('Customer Number 18')
     A                                      COLHDG('Customer' +
     A                                             'Number 18')
     A            SFPTFR18       4          TEXT('Portfolio Reference 18')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 18')
     A            SFAMNT18      15          TEXT('Amount 18')
     A                                      COLHDG('Amount 18')
     A**Start of change CGL029
     A**********  SFACOD18       4          TEXT('Account Code 18')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 18')                                 CGL029
     A            SFACOD18QQ     4A
     A**End of change CGL029
     A            SFACSQ18       2          TEXT('Account Sequence 18')
     A                                      COLHDG('Account' +
     A                                             'Sequence 18')
     A            SFTRAS18       1          TEXT('Trust Agreement 18')
     A                                      COLHDG('Trust Agreement 18')
      *
      **  Detail 19
      *
     A            SFDLNO19       6          TEXT('Deal Number 19')
     A                                      COLHDG('Deal' +
     A                                             'Number 19')
     A            SFCNUM19      10          TEXT('Customer Number 19')
     A                                      COLHDG('Customer' +
     A                                             'Number 19')
     A            SFPTFR19       4          TEXT('Portfolio Reference 19')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 19')
     A            SFAMNT19      15          TEXT('Amount 19')
     A                                      COLHDG('Amount 19')
     A**Start of change CGL029
     A**********  SFACOD19       4          TEXT('Account Code 19')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 19')                                 CGL029
     A            SFACOD19QQ     4A
     A**End of change CGL029
     A            SFACSQ19       2          TEXT('Account Sequence 19')
     A                                      COLHDG('Account' +
     A                                             'Sequence 19')
     A            SFTRAS19       1          TEXT('Trust Agreement 19')
     A                                      COLHDG('Trust Agreement 19')
      *
      **  Detail 20
      *
     A            SFDLNO20       6          TEXT('Deal Number 20')
     A                                      COLHDG('Deal' +
     A                                             'Number 20')
     A            SFCNUM20      10          TEXT('Customer Number 20')
     A                                      COLHDG('Customer' +
     A                                             'Number 20')
     A            SFPTFR20       4          TEXT('Portfolio Reference 20')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 20')
     A            SFAMNT20      15          TEXT('Amount 20')
     A                                      COLHDG('Amount 20')
     A**Start of change CGL029
     A**********  SFACOD20       4          TEXT('Account Code 20')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 20')                                 CGL029
     A            SFACOD20QQ     4A
     A**End of change CGL029
     A            SFACSQ20       2          TEXT('Account Sequence 20')
     A                                      COLHDG('Account' +
     A                                             'Sequence 20')
     A            SFTRAS20       1          TEXT('Trust Agreement 20')
     A                                      COLHDG('Trust Agreement 20')
      *
      **  Detail 21
      *
     A            SFDLNO21       6          TEXT('Deal Number 21')
     A                                      COLHDG('Deal' +
     A                                             'Number 21')
     A            SFCNUM21      10          TEXT('Customer Number 21')
     A                                      COLHDG('Customer' +
     A                                             'Number 21')
     A            SFPTFR21       4          TEXT('Portfolio Reference 21')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 21')
     A            SFAMNT21      15          TEXT('Amount 21')
     A                                      COLHDG('Amount 21')
     A**Start of change CGL029
     A**********  SFACOD21       4          TEXT('Account Code 21')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 21')                                 CGL029
     A            SFACOD21QQ     4A
     A**End of change CGL029
     A            SFACSQ21       2          TEXT('Account Sequence 21')
     A                                      COLHDG('Account' +
     A                                             'Sequence 21')
     A            SFTRAS21       1          TEXT('Trust Agreement 21')
     A                                      COLHDG('Trust Agreement 21')
      *
      **  Detail 22
      *
     A            SFDLNO22       6          TEXT('Deal Number 22')
     A                                      COLHDG('Deal' +
     A                                             'Number 22')
     A            SFCNUM22      10          TEXT('Customer Number 22')
     A                                      COLHDG('Customer' +
     A                                             'Number 22')
     A            SFPTFR22       4          TEXT('Portfolio Reference 22')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 22')
     A            SFAMNT22      15          TEXT('Amount 22')
     A                                      COLHDG('Amount 22')
     A**Start of change CGL029
     A**********  SFACOD22       4          TEXT('Account Code 22')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 22')                                 CGL029
     A            SFACOD22QQ     4A
     A**End of change CGL029
     A            SFACSQ22       2          TEXT('Account Sequence 22')
     A                                      COLHDG('Account' +
     A                                             'Sequence 22')
     A            SFTRAS22       1          TEXT('Trust Agreement 22')
     A                                      COLHDG('Trust Agreement 22')
      *
      **  Detail 23
      *
     A            SFDLNO23       6          TEXT('Deal Number 23')
     A                                      COLHDG('Deal' +
     A                                             'Number 23')
     A            SFCNUM23      10          TEXT('Customer Number 23')
     A                                      COLHDG('Customer' +
     A                                             'Number 23')
     A            SFPTFR23       4          TEXT('Portfolio Reference 23')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 23')
     A            SFAMNT23      15          TEXT('Amount 23')
     A                                      COLHDG('Amount 23')
     A**Start of change CGL029
     A**********  SFACOD23       4          TEXT('Account Code 23')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 23')                                 CGL029
     A            SFACOD23QQ     4A
     A**End of change CGL029
     A            SFACSQ23       2          TEXT('Account Sequence 23')
     A                                      COLHDG('Account' +
     A                                             'Sequence 23')
     A            SFTRAS23       1          TEXT('Trust Agreement 23')
     A                                      COLHDG('Trust Agreement 23')
      *
      **  Detail 24
      *
     A            SFDLNO24       6          TEXT('Deal Number 24')
     A                                      COLHDG('Deal' +
     A                                             'Number 24')
     A            SFCNUM24      10          TEXT('Customer Number 24')
     A                                      COLHDG('Customer' +
     A                                             'Number 24')
     A            SFPTFR24       4          TEXT('Portfolio Reference 24')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 24')
     A            SFAMNT24      15          TEXT('Amount 24')
     A                                      COLHDG('Amount 24')
     A**Start of change CGL029
     A**********  SFACOD24       4          TEXT('Account Code 24')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 24')                                 CGL029
     A            SFACOD24QQ     4A
     A**End of change CGL029
     A            SFACSQ24       2          TEXT('Account Sequence 24')
     A                                      COLHDG('Account' +
     A                                             'Sequence 24')
     A            SFTRAS24       1          TEXT('Trust Agreement 24')
     A                                      COLHDG('Trust Agreement 24')
      *
      **  Detail 25
      *
     A            SFDLNO25       6          TEXT('Deal Number 25')
     A                                      COLHDG('Deal' +
     A                                             'Number 25')
     A            SFCNUM25      10          TEXT('Customer Number 25')
     A                                      COLHDG('Customer' +
     A                                             'Number 25')
     A            SFPTFR25       4          TEXT('Portfolio Reference 25')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 25')
     A            SFAMNT25      15          TEXT('Amount 25')
     A                                      COLHDG('Amount 25')
     A**Start of change CGL029
     A**********  SFACOD25       4          TEXT('Account Code 25')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 25')                                 CGL029
     A            SFACOD25QQ     4A
     A**End of change CGL029
     A            SFACSQ25       2          TEXT('Account Sequence 25')
     A                                      COLHDG('Account' +
     A                                             'Sequence 25')
     A            SFTRAS25       1          TEXT('Trust Agreement 25')
     A                                      COLHDG('Trust Agreement 25')
      *
      **  Detail 26
      *
     A            SFDLNO26       6          TEXT('Deal Number 26')
     A                                      COLHDG('Deal' +
     A                                             'Number 26')
     A            SFCNUM26      10          TEXT('Customer Number 26')
     A                                      COLHDG('Customer' +
     A                                             'Number 26')
     A            SFPTFR26       4          TEXT('Portfolio Reference 26')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 26')
     A            SFAMNT26      15          TEXT('Amount 26')
     A                                      COLHDG('Amount 26')
     A**Start of change CGL029
     A**********  SFACOD26       4          TEXT('Account Code 26')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 26')                                 CGL029
     A            SFACOD26QQ     4A
     A**End of change CGL029
     A            SFACSQ26       2          TEXT('Account Sequence 26')
     A                                      COLHDG('Account' +
     A                                             'Sequence 26')
     A            SFTRAS26       1          TEXT('Trust Agreement 26')
     A                                      COLHDG('Trust Agreement 26')
      *
      **  Detail 27
      *
     A            SFDLNO27       6          TEXT('Deal Number 27')
     A                                      COLHDG('Deal' +
     A                                             'Number 27')
     A            SFCNUM27      10          TEXT('Customer Number 27')
     A                                      COLHDG('Customer' +
     A                                             'Number 27')
     A            SFPTFR27       4          TEXT('Portfolio Reference 27')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 27')
     A            SFAMNT27      15          TEXT('Amount 27')
     A                                      COLHDG('Amount 27')
     A**Start of change CGL029
     A**********  SFACOD27       4          TEXT('Account Code 27')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 27')                                 CGL029
     A            SFACOD27QQ     4A
     A**End of change CGL029
     A            SFACSQ27       2          TEXT('Account Sequence 27')
     A                                      COLHDG('Account' +
     A                                             'Sequence 27')
     A            SFTRAS27       1          TEXT('Trust Agreement 27')
     A                                      COLHDG('Trust Agreement 27')
      *
      **  Detail 28
      *
     A            SFDLNO28       6          TEXT('Deal Number 28')
     A                                      COLHDG('Deal' +
     A                                             'Number 28')
     A            SFCNUM28      10          TEXT('Customer Number 28')
     A                                      COLHDG('Customer' +
     A                                             'Number 28')
     A            SFPTFR28       4          TEXT('Portfolio Reference 28')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 28')
     A            SFAMNT28      15          TEXT('Amount 28')
     A                                      COLHDG('Amount 28')
     A**Start of change CGL029
     A**********  SFACOD28       4          TEXT('Account Code 28')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 28')                                 CGL029
     A            SFACOD28QQ     4A
     A**End of change CGL029
     A            SFACSQ28       2          TEXT('Account Sequence 28')
     A                                      COLHDG('Account' +
     A                                             'Sequence 28')
     A            SFTRAS28       1          TEXT('Trust Agreement 28')
     A                                      COLHDG('Trust Agreement 28')
      *
      **  Detail 29
      *
     A            SFDLNO29       6          TEXT('Deal Number 29')
     A                                      COLHDG('Deal' +
     A                                             'Number 29')
     A            SFCNUM29      10          TEXT('Customer Number 29')
     A                                      COLHDG('Customer' +
     A                                             'Number 29')
     A            SFPTFR29       4          TEXT('Portfolio Reference 29')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 29')
     A            SFAMNT29      15          TEXT('Amount 29')
     A                                      COLHDG('Amount 29')
     A**Start of change CGL029
     A**********  SFACOD29       4          TEXT('Account Code 29')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 29')                                 CGL029
     A            SFACOD29QQ     4A
     A**End of change CGL029
     A            SFACSQ29       2          TEXT('Account Sequence 29')
     A                                      COLHDG('Account' +
     A                                             'Sequence 29')
     A            SFTRAS29       1          TEXT('Trust Agreement 29')
     A                                      COLHDG('Trust Agreement 29')
      *
      **  Detail 30
      *
     A            SFDLNO30       6          TEXT('Deal Number 30')
     A                                      COLHDG('Deal' +
     A                                             'Number 30')
     A            SFCNUM30      10          TEXT('Customer Number 30')
     A                                      COLHDG('Customer' +
     A                                             'Number 30')
     A            SFPTFR30       4          TEXT('Portfolio Reference 30')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 30')
     A            SFAMNT30      15          TEXT('Amount 30')
     A                                      COLHDG('Amount 30')
     A**Start of change CGL029
     A**********  SFACOD30       4          TEXT('Account Code 30')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 30')                                 CGL029
     A            SFACOD30QQ     4A
     A**End of change CGL029
     A            SFACSQ30       2          TEXT('Account Sequence 30')
     A                                      COLHDG('Account' +
     A                                             'Sequence 30')
     A            SFTRAS30       1          TEXT('Trust Agreement 30')
     A                                      COLHDG('Trust Agreement 30')
      *
      **  Detail 31
      *
     A            SFDLNO31       6          TEXT('Deal Number 31')
     A                                      COLHDG('Deal' +
     A                                             'Number 31')
     A            SFCNUM31      10          TEXT('Customer Number 31')
     A                                      COLHDG('Customer' +
     A                                             'Number 31')
     A            SFPTFR31       4          TEXT('Portfolio Reference 31')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 31')
     A            SFAMNT31      15          TEXT('Amount 31')
     A                                      COLHDG('Amount 31')
     A**Start of change CGL029
     A**********  SFACOD31       4          TEXT('Account Code 31')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 31')                                 CGL029
     A            SFACOD31QQ     4A
     A**End of change CGL029
     A            SFACSQ31       2          TEXT('Account Sequence 31')
     A                                      COLHDG('Account' +
     A                                             'Sequence 31')
     A            SFTRAS31       1          TEXT('Trust Agreement 31')
     A                                      COLHDG('Trust Agreement 31')
      *
      **  Detail 32
      *
     A            SFDLNO32       6          TEXT('Deal Number 32')
     A                                      COLHDG('Deal' +
     A                                             'Number 32')
     A            SFCNUM32      10          TEXT('Customer Number 32')
     A                                      COLHDG('Customer' +
     A                                             'Number 32')
     A            SFPTFR32       4          TEXT('Portfolio Reference 32')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 32')
     A            SFAMNT32      15          TEXT('Amount 32')
     A                                      COLHDG('Amount 32')
     A**Start of change CGL029
     A**********  SFACOD32       4          TEXT('Account Code 32')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 32')                                 CGL029
     A            SFACOD32QQ     4A
     A**End of change CGL029
     A            SFACSQ32       2          TEXT('Account Sequence 32')
     A                                      COLHDG('Account' +
     A                                             'Sequence 32')
     A            SFTRAS32       1          TEXT('Trust Agreement 32')
     A                                      COLHDG('Trust Agreement 32')
      *
      **  Detail 33
      *
     A            SFDLNO33       6          TEXT('Deal Number 33')
     A                                      COLHDG('Deal' +
     A                                             'Number 33')
     A            SFCNUM33      10          TEXT('Customer Number 33')
     A                                      COLHDG('Customer' +
     A                                             'Number 33')
     A            SFPTFR33       4          TEXT('Portfolio Reference 33')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 33')
     A            SFAMNT33      15          TEXT('Amount 33')
     A                                      COLHDG('Amount 33')
     A**Start of change CGL029
     A**********  SFACOD33       4          TEXT('Account Code 13')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 33')                                 CGL029
     A            SFACOD33QQ     4A
     A**End of change CGL029
     A            SFACSQ33       2          TEXT('Account Sequence 33')
     A                                      COLHDG('Account' +
     A                                             'Sequence 33')
     A            SFTRAS33       1          TEXT('Trust Agreement 33')
     A                                      COLHDG('Trust Agreement 33')
      *
      **  Detail 34
      *
     A            SFDLNO34       6          TEXT('Deal Number 34')
     A                                      COLHDG('Deal' +
     A                                             'Number 34')
     A            SFCNUM34      10          TEXT('Customer Number 34')
     A                                      COLHDG('Customer' +
     A                                             'Number 34')
     A            SFPTFR34       4          TEXT('Portfolio Reference 34')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 34')
     A            SFAMNT34      15          TEXT('Amount 34')
     A                                      COLHDG('Amount 34')
     A**Start of change CGL029
     A**********  SFACOD34       4          TEXT('Account Code 34')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 34')                                 CGL029
     A            SFACOD34QQ     4A
     A**End of change CGL029
     A            SFACSQ34       2          TEXT('Account Sequence 34')
     A                                      COLHDG('Account' +
     A                                             'Sequence 34')
     A            SFTRAS34       1          TEXT('Trust Agreement 34')
     A                                      COLHDG('Trust Agreement 34')
      *
      **  Detail 35
      *
     A            SFDLNO35       6          TEXT('Deal Number 35')
     A                                      COLHDG('Deal' +
     A                                             'Number 35')
     A            SFCNUM35      10          TEXT('Customer Number 35')
     A                                      COLHDG('Customer' +
     A                                             'Number 35')
     A            SFPTFR35       4          TEXT('Portfolio Reference 35')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 35')
     A            SFAMNT35      15          TEXT('Amount 35')
     A                                      COLHDG('Amount 35')
     A**Start of change CGL029
     A**********  SFACOD35       4          TEXT('Account Code 35')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 35')                                 CGL029
     A            SFACOD35QQ     4A
     A**End of change CGL029
     A            SFACSQ35       2          TEXT('Account Sequence 35')
     A                                      COLHDG('Account' +
     A                                             'Sequence 35')
     A            SFTRAS35       1          TEXT('Trust Agreement 35')
     A                                      COLHDG('Trust Agreement 35')
      *
      **  Detail 36
      *
     A            SFDLNO36       6          TEXT('Deal Number 36')
     A                                      COLHDG('Deal' +
     A                                             'Number 36')
     A            SFCNUM36      10          TEXT('Customer Number 36')
     A                                      COLHDG('Customer' +
     A                                             'Number 36')
     A            SFPTFR36       4          TEXT('Portfolio Reference 36')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 36')
     A            SFAMNT36      15          TEXT('Amount 36')
     A                                      COLHDG('Amount 36')
     A**Start of change CGL029
     A**********  SFACOD36       4          TEXT('Account Code 36')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 36')                                 CGL029
     A            SFACOD36QQ     4A
     A**End of change CGL029
     A            SFACSQ36       2          TEXT('Account Sequence 36')
     A                                      COLHDG('Account' +
     A                                             'Sequence 36')
     A            SFTRAS36       1          TEXT('Trust Agreement 36')
     A                                      COLHDG('Trust Agreement 36')
      *
      **  Detail 37
      *
     A            SFDLNO37       6          TEXT('Deal Number 37')
     A                                      COLHDG('Deal' +
     A                                             'Number 37')
     A            SFCNUM37      10          TEXT('Customer Number 37')
     A                                      COLHDG('Customer' +
     A                                             'Number 37')
     A            SFPTFR37       4          TEXT('Portfolio Reference 37')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 37')
     A            SFAMNT37      15          TEXT('Amount 37')
     A                                      COLHDG('Amount 37')
     A**Start of change CGL029
     A**********  SFACOD37       4          TEXT('Account Code 37')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 37')                                 CGL029
     A            SFACOD37QQ     4A
     A**End of change CGL029
     A            SFACSQ37       2          TEXT('Account Sequence 37')
     A                                      COLHDG('Account' +
     A                                             'Sequence 37')
     A            SFTRAS37       1          TEXT('Trust Agreement 37')
     A                                      COLHDG('Trust Agreement 37')
      *
      **  Detail 38
      *
     A            SFDLNO38       6          TEXT('Deal Number 38')
     A                                      COLHDG('Deal' +
     A                                             'Number 38')
     A            SFCNUM38      10          TEXT('Customer Number 38')
     A                                      COLHDG('Customer' +
     A                                             'Number 38')
     A            SFPTFR38       4          TEXT('Portfolio Reference 38')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 38')
     A            SFAMNT38      15          TEXT('Amount 38')
     A                                      COLHDG('Amount 38')
     A**Start of change CGL029
     A**********  SFACOD38       4          TEXT('Account Code 38')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 38')                                 CGL029
     A            SFACOD38QQ     4A
     A**End of change CGL029
     A            SFACSQ38       2          TEXT('Account Sequence 38')
     A                                      COLHDG('Account' +
     A                                             'Sequence 38')
     A            SFTRAS38       1          TEXT('Trust Agreement 38')
     A                                      COLHDG('Trust Agreement 38')
      *
      **  Detail 39
      *
     A            SFDLNO39       6          TEXT('Deal Number 39')
     A                                      COLHDG('Deal' +
     A                                             'Number 39')
     A            SFCNUM39      10          TEXT('Customer Number 39')
     A                                      COLHDG('Customer' +
     A                                             'Number 39')
     A            SFPTFR39       4          TEXT('Portfolio Reference 39')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 39')
     A            SFAMNT39      15          TEXT('Amount 39')
     A                                      COLHDG('Amount 39')
     A**Start of change CGL029
     A**********  SFACOD39       4          TEXT('Account Code 39')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 39')                                 CGL029
     A            SFACOD39QQ     4A
     A**End of change CGL029
     A            SFACSQ39       2          TEXT('Account Sequence 39')
     A                                      COLHDG('Account' +
     A                                             'Sequence 39')
     A            SFTRAS39       1          TEXT('Trust Agreement 39')
     A                                      COLHDG('Trust Agreement 39')
      *
      **  Detail 40
      *
     A            SFDLNO40       6          TEXT('Deal Number 40')
     A                                      COLHDG('Deal' +
     A                                             'Number 40')
     A            SFCNUM40      10          TEXT('Customer Number 40')
     A                                      COLHDG('Customer' +
     A                                             'Number 40')
     A            SFPTFR40       4          TEXT('Portfolio Reference 40')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 40')
     A            SFAMNT40      15          TEXT('Amount 40')
     A                                      COLHDG('Amount 40')
     A**Start of change CGL029
     A**********  SFACOD40       4          TEXT('Account Code 40')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 40')                                 CGL029
     A            SFACOD40QQ     4A
     A**End of change CGL029
     A            SFACSQ40       2          TEXT('Account Sequence 40')
     A                                      COLHDG('Account' +
     A                                             'Sequence 40')
     A            SFTRAS40       1          TEXT('Trust Agreement 40')
     A                                      COLHDG('Trust Agreement 40')
      *
      **  Detail 41
      *
     A            SFDLNO41       6          TEXT('Deal Number 41')
     A                                      COLHDG('Deal' +
     A                                             'Number 41')
     A            SFCNUM41      10          TEXT('Customer Number 41')
     A                                      COLHDG('Customer' +
     A                                             'Number 41')
     A            SFPTFR41       4          TEXT('Portfolio Reference 41')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 41')
     A            SFAMNT41      15          TEXT('Amount 41')
     A                                      COLHDG('Amount 41')
     A**Start of change CGL029
     A**********  SFACOD41       4          TEXT('Account Code 41')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 41')                                 CGL029
     A            SFACOD41QQ     4A
     A**End of change CGL029
     A            SFACSQ41       2          TEXT('Account Sequence 41')
     A                                      COLHDG('Account' +
     A                                             'Sequence 41')
     A            SFTRAS41       1          TEXT('Trust Agreement 41')
     A                                      COLHDG('Trust Agreement 41')
      *
      **  Detail 42
      *
     A            SFDLNO42       6          TEXT('Deal Number 42')
     A                                      COLHDG('Deal' +
     A                                             'Number 42')
     A            SFCNUM42      10          TEXT('Customer Number 42')
     A                                      COLHDG('Customer' +
     A                                             'Number 42')
     A            SFPTFR42       4          TEXT('Portfolio Reference 42')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 42')
     A            SFAMNT42      15          TEXT('Amount 42')
     A                                      COLHDG('Amount 42')
     A**Start of change CGL029
     A**********  SFACOD42       4          TEXT('Account Code 42')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 42')                                 CGL029
     A            SFACOD42QQ     4A
     A**End of change CGL029
     A            SFACSQ42       2          TEXT('Account Sequence 42')
     A                                      COLHDG('Account' +
     A                                             'Sequence 42')
     A            SFTRAS42       1          TEXT('Trust Agreement 42')
     A                                      COLHDG('Trust Agreement 42')
      *
      **  Detail 43
      *
     A            SFDLNO43       6          TEXT('Deal Number 43')
     A                                      COLHDG('Deal' +
     A                                             'Number 43')
     A            SFCNUM43      10          TEXT('Customer Number 43')
     A                                      COLHDG('Customer' +
     A                                             'Number 43')
     A            SFPTFR43       4          TEXT('Portfolio Reference 43')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 43')
     A            SFAMNT43      15          TEXT('Amount 43')
     A                                      COLHDG('Amount 43')
     A**Start of change CGL029
     A**********  SFACOD43       4          TEXT('Account Code 43')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 43')                                 CGL029
     A            SFACOD43QQ     4A
     A**End of change CGL029
     A            SFACSQ43       2          TEXT('Account Sequence 43')
     A                                      COLHDG('Account' +
     A                                             'Sequence 43')
     A            SFTRAS43       1          TEXT('Trust Agreement 43')
     A                                      COLHDG('Trust Agreement 43')
      *
      **  Detail 44
      *
     A            SFDLNO44       6          TEXT('Deal Number 44')
     A                                      COLHDG('Deal' +
     A                                             'Number 44')
     A            SFCNUM44      10          TEXT('Customer Number 44')
     A                                      COLHDG('Customer' +
     A                                             'Number 44')
     A            SFPTFR44       4          TEXT('Portfolio Reference 44')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 44')
     A            SFAMNT44      15          TEXT('Amount 44')
     A                                      COLHDG('Amount 44')
     A**Start of change CGL029
     A**********  SFACOD44       4          TEXT('Account Code 44')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 44')                                 CGL029
     A            SFACOD44QQ     4A
     A**End of change CGL029
     A            SFACSQ44       2          TEXT('Account Sequence 44')
     A                                      COLHDG('Account' +
     A                                             'Sequence 44')
     A            SFTRAS44       1          TEXT('Trust Agreement 44')
     A                                      COLHDG('Trust Agreement 44')
      *
      **  Detail 45
      *
     A            SFDLNO45       6          TEXT('Deal Number 45')
     A                                      COLHDG('Deal' +
     A                                             'Number 45')
     A            SFCNUM45      10          TEXT('Customer Number 45')
     A                                      COLHDG('Customer' +
     A                                             'Number 45')
     A            SFPTFR45       4          TEXT('Portfolio Reference 45')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 45')
     A            SFAMNT45      15          TEXT('Amount 45')
     A                                      COLHDG('Amount 45')
     A**Start of change CGL029
     A**********  SFACOD45       4          TEXT('Account Code 45')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 45')                                 CGL029
     A            SFACOD45QQ     4A
     A**End of change CGL029
     A            SFACSQ45       2          TEXT('Account Sequence 45')
     A                                      COLHDG('Account' +
     A                                             'Sequence 45')
     A            SFTRAS45       1          TEXT('Trust Agreement 45')
     A                                      COLHDG('Trust Agreement 45')
      *
      **  Detail 46
      *
     A            SFDLNO46       6          TEXT('Deal Number 46')
     A                                      COLHDG('Deal' +
     A                                             'Number 46')
     A            SFCNUM46      10          TEXT('Customer Number 46')
     A                                      COLHDG('Customer' +
     A                                             'Number 46')
     A            SFPTFR46       4          TEXT('Portfolio Reference 46')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 46')
     A            SFAMNT46      15          TEXT('Amount 46')
     A                                      COLHDG('Amount 46')
     A**Start of change CGL029
     A**********  SFACOD46       4          TEXT('Account Code 46')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 46')                                 CGL029
     A            SFACOD46QQ     4A
     A**End of change CGL029
     A            SFACSQ46       2          TEXT('Account Sequence 46')
     A                                      COLHDG('Account' +
     A                                             'Sequence 46')
     A            SFTRAS46       1          TEXT('Trust Agreement 46')
     A                                      COLHDG('Trust Agreement 46')
      *
      **  Detail 47
      *
     A            SFDLNO47       6          TEXT('Deal Number 47')
     A                                      COLHDG('Deal' +
     A                                             'Number 47')
     A            SFCNUM47      10          TEXT('Customer Number 47')
     A                                      COLHDG('Customer' +
     A                                             'Number 47')
     A            SFPTFR47       4          TEXT('Portfolio Reference 47')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 47')
     A            SFAMNT47      15          TEXT('Amount 47')
     A                                      COLHDG('Amount 47')
     A**Start of change CGL029
     A**********  SFACOD47       4          TEXT('Account Code 47')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 47')                                 CGL029
     A            SFACOD47QQ     4A
     A**End of change CGL029
     A            SFACSQ47       2          TEXT('Account Sequence 47')
     A                                      COLHDG('Account' +
     A                                             'Sequence 47')
     A            SFTRAS47       1          TEXT('Trust Agreement 47')
     A                                      COLHDG('Trust Agreement 47')
      *
      **  Detail 48
      *
     A            SFDLNO48       6          TEXT('Deal Number 48')
     A                                      COLHDG('Deal' +
     A                                             'Number 48')
     A            SFCNUM48      10          TEXT('Customer Number 48')
     A                                      COLHDG('Customer' +
     A                                             'Number 48')
     A            SFPTFR48       4          TEXT('Portfolio Reference 48')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 48')
     A            SFAMNT48      15          TEXT('Amount 48')
     A                                      COLHDG('Amount 48')
     A**Start of change CGL029
     A**********  SFACOD48       4          TEXT('Account Code 48')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 48')                                 CGL029
     A            SFACOD48QQ     4A
     A**End of change CGL029
     A            SFACSQ48       2          TEXT('Account Sequence 48')
     A                                      COLHDG('Account' +
     A                                             'Sequence 48')
     A            SFTRAS48       1          TEXT('Trust Agreement 48')
     A                                      COLHDG('Trust Agreement 48')
      *
      **  Detail 49
      *
     A            SFDLNO49       6          TEXT('Deal Number 49')
     A                                      COLHDG('Deal' +
     A                                             'Number 49')
     A            SFCNUM49      10          TEXT('Customer Number 49')
     A                                      COLHDG('Customer' +
     A                                             'Number 49')
     A            SFPTFR49       4          TEXT('Portfolio Reference 49')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 49')
     A            SFAMNT49      15          TEXT('Amount 49')
     A                                      COLHDG('Amount 49')
     A**Start of change CGL029
     A**********  SFACOD49       4          TEXT('Account Code 49')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 49')                                 CGL029
     A            SFACOD49QQ     4A
     A**End of change CGL029
     A            SFACSQ49       2          TEXT('Account Sequence 49')
     A                                      COLHDG('Account' +
     A                                             'Sequence 49')
     A            SFTRAS49       1          TEXT('Trust Agreement 49')
     A                                      COLHDG('Trust Agreement 49')
      *
      **  Detail 50
      *
     A            SFDLNO50       6          TEXT('Deal Number 50')
     A                                      COLHDG('Deal' +
     A                                             'Number 50')
     A            SFCNUM50      10          TEXT('Customer Number 50')
     A                                      COLHDG('Customer' +
     A                                             'Number 50')
     A            SFPTFR50       4          TEXT('Portfolio Reference 50')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 50')
     A            SFAMNT50      15          TEXT('Amount 50')
     A                                      COLHDG('Amount 50')
     A**Start of change CGL029
     A**********  SFACOD50       4          TEXT('Account Code 50')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 50')                                 CGL029
     A            SFACOD50QQ     4A
     A**End of change CGL029
     A            SFACSQ50       2          TEXT('Account Sequence 50')
     A                                      COLHDG('Account' +
     A                                             'Sequence 50')
     A            SFTRAS50       1          TEXT('Trust Agreement 50')
     A                                      COLHDG('Trust Agreement 50')
      *
      **  Detail 51
      *
     A            SFDLNO51       6          TEXT('Deal Number 51')
     A                                      COLHDG('Deal' +
     A                                             'Number 51')
     A            SFCNUM51      10          TEXT('Customer Number 51')
     A                                      COLHDG('Customer' +
     A                                             'Number 51')
     A            SFPTFR51       4          TEXT('Portfolio Reference 51')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 51')
     A            SFAMNT51      15          TEXT('Amount 51')
     A                                      COLHDG('Amount 51')
     A**Start of change CGL029
     A**********  SFACOD51       4          TEXT('Account Code 51')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 51')                                 CGL029
     A            SFACOD51QQ     4A
     A**End of change CGL029
     A            SFACSQ51       2          TEXT('Account Sequence 51')
     A                                      COLHDG('Account' +
     A                                             'Sequence 51')
     A            SFTRAS51       1          TEXT('Trust Agreement 51')
     A                                      COLHDG('Trust Agreement 51')
      *
      **  Detail 52
      *
     A            SFDLNO52       6          TEXT('Deal Number 52')
     A                                      COLHDG('Deal' +
     A                                             'Number 52')
     A            SFCNUM52      10          TEXT('Customer Number 52')
     A                                      COLHDG('Customer' +
     A                                             'Number 52')
     A            SFPTFR52       4          TEXT('Portfolio Reference 52')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 52')
     A            SFAMNT52      15          TEXT('Amount 52')
     A                                      COLHDG('Amount 52')
     A**Start of change CGL029
     A**********  SFACOD52       4          TEXT('Account Code 52')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 52')                                 CGL029
     A            SFACOD52QQ     4A
     A**End of change CGL029
     A            SFACSQ52       2          TEXT('Account Sequence 52')
     A                                      COLHDG('Account' +
     A                                             'Sequence 52')
     A            SFTRAS52       1          TEXT('Trust Agreement 52')
     A                                      COLHDG('Trust Agreement 52')
      *
      **  Detail 53
      *
     A            SFDLNO53       6          TEXT('Deal Number 53')
     A                                      COLHDG('Deal' +
     A                                             'Number 53')
     A            SFCNUM53      10          TEXT('Customer Number 53')
     A                                      COLHDG('Customer' +
     A                                             'Number 53')
     A            SFPTFR53       4          TEXT('Portfolio Reference 53')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 53')
     A            SFAMNT53      15          TEXT('Amount 53')
     A                                      COLHDG('Amount 53')
     A**Start of change CGL029
     A**********  SFACOD53       4          TEXT('Account Code 53')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 53')                                 CGL029
     A            SFACOD53QQ     4A
     A**End of change CGL029
     A            SFACSQ53       2          TEXT('Account Sequence 53')
     A                                      COLHDG('Account' +
     A                                             'Sequence 53')
     A            SFTRAS53       1          TEXT('Trust Agreement 53')
     A                                      COLHDG('Trust Agreement 53')
      *
      **  Detail 54
      *
     A            SFDLNO54       6          TEXT('Deal Number 54')
     A                                      COLHDG('Deal' +
     A                                             'Number 54')
     A            SFCNUM54      10          TEXT('Customer Number 54')
     A                                      COLHDG('Customer' +
     A                                             'Number 54')
     A            SFPTFR54       4          TEXT('Portfolio Reference 54')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 54')
     A            SFAMNT54      15          TEXT('Amount 54')
     A                                      COLHDG('Amount 54')
     A**Start of change CGL029
     A**********  SFACOD54       4          TEXT('Account Code 54')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 54')                                 CGL029
     A            SFACOD54QQ     4A
     A**End of change CGL029
     A            SFACSQ54       2          TEXT('Account Sequence 54')
     A                                      COLHDG('Account' +
     A                                             'Sequence 54')
     A            SFTRAS54       1          TEXT('Trust Agreement 54')
     A                                      COLHDG('Trust Agreement 54')
      *
      **  Detail 55
      *
     A            SFDLNO55       6          TEXT('Deal Number 55')
     A                                      COLHDG('Deal' +
     A                                             'Number 55')
     A            SFCNUM55      10          TEXT('Customer Number 55')
     A                                      COLHDG('Customer' +
     A                                             'Number 55')
     A            SFPTFR55       4          TEXT('Portfolio Reference 55')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 55')
     A            SFAMNT55      15          TEXT('Amount 55')
     A                                      COLHDG('Amount 55')
     A**Start of change CGL029
     A**********  SFACOD55       4          TEXT('Account Code 55')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 55')                                 CGL029
     A            SFACOD55QQ     4A
     A**End of change CGL029
     A            SFACSQ55       2          TEXT('Account Sequence 55')
     A                                      COLHDG('Account' +
     A                                             'Sequence 55')
     A            SFTRAS55       1          TEXT('Trust Agreement 55')
     A                                      COLHDG('Trust Agreement 55')
      *
      **  Detail 56
      *
     A            SFDLNO56       6          TEXT('Deal Number 56')
     A                                      COLHDG('Deal' +
     A                                             'Number 56')
     A            SFCNUM56      10          TEXT('Customer Number 56')
     A                                      COLHDG('Customer' +
     A                                             'Number 56')
     A            SFPTFR56       4          TEXT('Portfolio Reference 56')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 56')
     A            SFAMNT56      15          TEXT('Amount 56')
     A                                      COLHDG('Amount 56')
     A**Start of change CGL029
     A**********  SFACOD56       4          TEXT('Account Code 56')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 56')                                 CGL029
     A            SFACOD56QQ     4A
     A**End of change CGL029
     A            SFACSQ56       2          TEXT('Account Sequence 56')
     A                                      COLHDG('Account' +
     A                                             'Sequence 56')
     A            SFTRAS56       1          TEXT('Trust Agreement 56')
     A                                      COLHDG('Trust Agreement 56')
      *
      **  Detail 57
      *
     A            SFDLNO57       6          TEXT('Deal Number 57')
     A                                      COLHDG('Deal' +
     A                                             'Number 57')
     A            SFCNUM57      10          TEXT('Customer Number 57')
     A                                      COLHDG('Customer' +
     A                                             'Number 57')
     A            SFPTFR57       4          TEXT('Portfolio Reference 57')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 57')
     A            SFAMNT57      15          TEXT('Amount 57')
     A                                      COLHDG('Amount 57')
     A**Start of change CGL029
     A**********  SFACOD57       4          TEXT('Account Code 57')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 57')                                 CGL029
     A            SFACOD57QQ     4A
     A**End of change CGL029
     A            SFACSQ57       2          TEXT('Account Sequence 57')
     A                                      COLHDG('Account' +
     A                                             'Sequence 57')
     A            SFTRAS57       1          TEXT('Trust Agreement 57')
     A                                      COLHDG('Trust Agreement 57')
      *
      **  Detail 58
      *
     A            SFDLNO58       6          TEXT('Deal Number 58')
     A                                      COLHDG('Deal' +
     A                                             'Number 58')
     A            SFCNUM58      10          TEXT('Customer Number 58')
     A                                      COLHDG('Customer' +
     A                                             'Number 58')
     A            SFPTFR58       4          TEXT('Portfolio Reference 58')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 58')
     A            SFAMNT58      15          TEXT('Amount 58')
     A                                      COLHDG('Amount 58')
     A**Start of change CGL029
     A**********  SFACOD58       4          TEXT('Account Code 58')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 58')                                 CGL029
     A            SFACOD58QQ     4A
     A**End of change CGL029
     A            SFACSQ58       2          TEXT('Account Sequence 58')
     A                                      COLHDG('Account' +
     A                                             'Sequence 58')
     A            SFTRAS58       1          TEXT('Trust Agreement 58')
     A                                      COLHDG('Trust Agreement 58')
      *
      **  Detail 59
      *
     A            SFDLNO59       6          TEXT('Deal Number 59')
     A                                      COLHDG('Deal' +
     A                                             'Number 59')
     A            SFCNUM59      10          TEXT('Customer Number 59')
     A                                      COLHDG('Customer' +
     A                                             'Number 59')
     A            SFPTFR59       4          TEXT('Portfolio Reference 59')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 59')
     A            SFAMNT59      15          TEXT('Amount 59')
     A                                      COLHDG('Amount 59')
     A**Start of change CGL029
     A**********  SFACOD59       4          TEXT('Account Code 59')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 59')                                 CGL029
     A            SFACOD59QQ     4A
     A**End of change CGL029
     A            SFACSQ59       2          TEXT('Account Sequence 59')
     A                                      COLHDG('Account' +
     A                                             'Sequence 59')
     A            SFTRAS59       1          TEXT('Trust Agreement 59')
     A                                      COLHDG('Trust Agreement 59')
      *
      **  Detail 60
      *
     A            SFDLNO60       6          TEXT('Deal Number 60')
     A                                      COLHDG('Deal' +
     A                                             'Number 60')
     A            SFCNUM60      10          TEXT('Customer Number 60')
     A                                      COLHDG('Customer' +
     A                                             'Number 60')
     A            SFPTFR60       4          TEXT('Portfolio Reference 60')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 60')
     A            SFAMNT60      15          TEXT('Amount 60')
     A                                      COLHDG('Amount 60')
     A**Start of change CGL029
     A**********  SFACOD60       4          TEXT('Account Code 60')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 60')                                 CGL029
     A            SFACOD60QQ     4A
     A**End of change CGL029
     A            SFACSQ60       2          TEXT('Account Sequence 60')
     A                                      COLHDG('Account' +
     A                                             'Sequence 60')
     A            SFTRAS60       1          TEXT('Trust Agreement 60')
     A                                      COLHDG('Trust Agreement 60')
      *
      **  Detail 61
      *
     A            SFDLNO61       6          TEXT('Deal Number 61')
     A                                      COLHDG('Deal' +
     A                                             'Number 61')
     A            SFCNUM61      10          TEXT('Customer Number 61')
     A                                      COLHDG('Customer' +
     A                                             'Number 61')
     A            SFPTFR61       4          TEXT('Portfolio Reference 61')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 61')
     A            SFAMNT61      15          TEXT('Amount 61')
     A                                      COLHDG('Amount 61')
     A**Start of change CGL029
     A**********  SFACOD61       4          TEXT('Account Code 61')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 61')                                 CGL029
     A            SFACOD61QQ     4A
     A**End of change CGL029
     A            SFACSQ61       2          TEXT('Account Sequence 61')
     A                                      COLHDG('Account' +
     A                                             'Sequence 61')
     A            SFTRAS61       1          TEXT('Trust Agreement 61')
     A                                      COLHDG('Trust Agreement 61')
      *
      **  Detail 62
      *
     A            SFDLNO62       6          TEXT('Deal Number 62')
     A                                      COLHDG('Deal' +
     A                                             'Number 62')
     A            SFCNUM62      10          TEXT('Customer Number 62')
     A                                      COLHDG('Customer' +
     A                                             'Number 62')
     A            SFPTFR62       4          TEXT('Portfolio Reference 62')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 62')
     A            SFAMNT62      15          TEXT('Amount 62')
     A                                      COLHDG('Amount 62')
     A**Start of change CGL029
     A**********  SFACOD62       4          TEXT('Account Code 62')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 62')                                 CGL029
     A            SFACOD62QQ     4A
     A**End of change CGL029
     A            SFACSQ62       2          TEXT('Account Sequence 62')
     A                                      COLHDG('Account' +
     A                                             'Sequence 62')
     A            SFTRAS62       1          TEXT('Trust Agreement 62')
     A                                      COLHDG('Trust Agreement 62')
      *
      **  Detail 63
      *
     A            SFDLNO63       6          TEXT('Deal Number 63')
     A                                      COLHDG('Deal' +
     A                                             'Number 63')
     A            SFCNUM63      10          TEXT('Customer Number 63')
     A                                      COLHDG('Customer' +
     A                                             'Number 63')
     A            SFPTFR63       4          TEXT('Portfolio Reference 63')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 63')
     A            SFAMNT63      15          TEXT('Amount 63')
     A                                      COLHDG('Amount 63')
     A**Start of change CGL029
     A**********  SFACOD63       4          TEXT('Account Code 63')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 63')                                 CGL029
     A            SFACOD63QQ     4A
     A**End of change CGL029
     A            SFACSQ63       2          TEXT('Account Sequence 63')
     A                                      COLHDG('Account' +
     A                                             'Sequence 63')
     A            SFTRAS63       1          TEXT('Trust Agreement 63')
     A                                      COLHDG('Trust Agreement 63')
      *
      **  Detail 64
      *
     A            SFDLNO64       6          TEXT('Deal Number 64')
     A                                      COLHDG('Deal' +
     A                                             'Number 64')
     A            SFCNUM64      10          TEXT('Customer Number 64')
     A                                      COLHDG('Customer' +
     A                                             'Number 64')
     A            SFPTFR64       4          TEXT('Portfolio Reference 64')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 64')
     A            SFAMNT64      15          TEXT('Amount 64')
     A                                      COLHDG('Amount 64')
     A**Start of change CGL029
     A**********  SFACOD64       4          TEXT('Account Code 64')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 64')                                 CGL029
     A            SFACOD64QQ     4A
     A**End of change CGL029
     A            SFACSQ64       2          TEXT('Account Sequence 64')
     A                                      COLHDG('Account' +
     A                                             'Sequence 64')
     A            SFTRAS64       1          TEXT('Trust Agreement 64')
     A                                      COLHDG('Trust Agreement 64')
      *
      **  Detail 65
      *
     A            SFDLNO65       6          TEXT('Deal Number 65')
     A                                      COLHDG('Deal' +
     A                                             'Number 65')
     A            SFCNUM65      10          TEXT('Customer Number 65')
     A                                      COLHDG('Customer' +
     A                                             'Number 65')
     A            SFPTFR65       4          TEXT('Portfolio Reference 65')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 65')
     A            SFAMNT65      15          TEXT('Amount 65')
     A                                      COLHDG('Amount 65')
     A**Start of change CGL029
     A**********  SFACOD65       4          TEXT('Account Code 65')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 65')                                 CGL029
     A            SFACOD65QQ     4A
     A**End of change CGL029
     A            SFACSQ65       2          TEXT('Account Sequence 65')
     A                                      COLHDG('Account' +
     A                                             'Sequence 65')
     A            SFTRAS65       1          TEXT('Trust Agreement 65')
     A                                      COLHDG('Trust Agreement 65')
      *
      **  Detail 66
      *
     A            SFDLNO66       6          TEXT('Deal Number 66')
     A                                      COLHDG('Deal' +
     A                                             'Number 66')
     A            SFCNUM66      10          TEXT('Customer Number 66')
     A                                      COLHDG('Customer' +
     A                                             'Number 66')
     A            SFPTFR66       4          TEXT('Portfolio Reference 66')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 66')
     A            SFAMNT66      15          TEXT('Amount 66')
     A                                      COLHDG('Amount 66')
     A**Start of change CGL029
     A**********  SFACOD66       4          TEXT('Account Code 66')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 66')                                 CGL029
     A            SFACOD66QQ     4A
     A**End of change CGL029
     A            SFACSQ66       2          TEXT('Account Sequence 66')
     A                                      COLHDG('Account' +
     A                                             'Sequence 66')
     A            SFTRAS66       1          TEXT('Trust Agreement 66')
     A                                      COLHDG('Trust Agreement 66')
      *
      **  Detail 67
      *
     A            SFDLNO67       6          TEXT('Deal Number 67')
     A                                      COLHDG('Deal' +
     A                                             'Number 67')
     A            SFCNUM67      10          TEXT('Customer Number 67')
     A                                      COLHDG('Customer' +
     A                                             'Number 67')
     A            SFPTFR67       4          TEXT('Portfolio Reference 67')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 67')
     A            SFAMNT67      15          TEXT('Amount 67')
     A                                      COLHDG('Amount 67')
     A**Start of change CGL029
     A**********  SFACOD67       4          TEXT('Account Code 67')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 67')                                 CGL029
     A            SFACOD67QQ     4A
     A**End of change CGL029
     A            SFACSQ67       2          TEXT('Account Sequence 67')
     A                                      COLHDG('Account' +
     A                                             'Sequence 67')
     A            SFTRAS67       1          TEXT('Trust Agreement 67')
     A                                      COLHDG('Trust Agreement 67')
      *
      **  Detail 68
      *
     A            SFDLNO68       6          TEXT('Deal Number 68')
     A                                      COLHDG('Deal' +
     A                                             'Number 68')
     A            SFCNUM68      10          TEXT('Customer Number 68')
     A                                      COLHDG('Customer' +
     A                                             'Number 68')
     A            SFPTFR68       4          TEXT('Portfolio Reference 68')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 68')
     A            SFAMNT68      15          TEXT('Amount 68')
     A                                      COLHDG('Amount 68')
     A**Start of change CGL029
     A**********  SFACOD68       4          TEXT('Account Code 68')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 68')                                 CGL029
     A            SFACOD68QQ     4A
     A**End of change CGL029
     A            SFACSQ68       2          TEXT('Account Sequence 68')
     A                                      COLHDG('Account' +
     A                                             'Sequence 68')
     A            SFTRAS68       1          TEXT('Trust Agreement 68')
     A                                      COLHDG('Trust Agreement 68')
      *
      **  Detail 69
      *
     A            SFDLNO69       6          TEXT('Deal Number 69')
     A                                      COLHDG('Deal' +
     A                                             'Number 69')
     A            SFCNUM69      10          TEXT('Customer Number 69')
     A                                      COLHDG('Customer' +
     A                                             'Number 69')
     A            SFPTFR69       4          TEXT('Portfolio Reference 69')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 69')
     A            SFAMNT69      15          TEXT('Amount 69')
     A                                      COLHDG('Amount 69')
     A**Start of change CGL029
     A**********  SFACOD69       4          TEXT('Account Code 69')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 69')                                 CGL029
     A            SFACOD69QQ     4A
     A**End of change CGL029
     A            SFACSQ69       2          TEXT('Account Sequence 69')
     A                                      COLHDG('Account' +
     A                                             'Sequence 69')
     A            SFTRAS69       1          TEXT('Trust Agreement 69')
     A                                      COLHDG('Trust Agreement 69')
      *
      **  Detail 70
      *
     A            SFDLNO70       6          TEXT('Deal Number 70')
     A                                      COLHDG('Deal' +
     A                                             'Number 70')
     A            SFCNUM70      10          TEXT('Customer Number 70')
     A                                      COLHDG('Customer' +
     A                                             'Number 70')
     A            SFPTFR70       4          TEXT('Portfolio Reference 70')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 70')
     A            SFAMNT70      15          TEXT('Amount 70')
     A                                      COLHDG('Amount 70')
     A**Start of change CGL029
     A**********  SFACOD70       4          TEXT('Account Code 70')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 70')                                 CGL029
     A            SFACOD70QQ     4A
     A**End of change CGL029
     A            SFACSQ70       2          TEXT('Account Sequence 70')
     A                                      COLHDG('Account' +
     A                                             'Sequence 70')
     A            SFTRAS70       1          TEXT('Trust Agreement 70')
     A                                      COLHDG('Trust Agreement 70')
      *
      **  Detail 71
      *
     A            SFDLNO71       6          TEXT('Deal Number 71')
     A                                      COLHDG('Deal' +
     A                                             'Number 71')
     A            SFCNUM71      10          TEXT('Customer Number 71')
     A                                      COLHDG('Customer' +
     A                                             'Number 71')
     A            SFPTFR71       4          TEXT('Portfolio Reference 71')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 71')
     A            SFAMNT71      15          TEXT('Amount 71')
     A                                      COLHDG('Amount 71')
     A**Start of change CGL029
     A**********  SFACOD71       4          TEXT('Account Code 71')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 71')                                 CGL029
     A            SFACOD71QQ     4A
     A**End of change CGL029
     A            SFACSQ71       2          TEXT('Account Sequence 71')
     A                                      COLHDG('Account' +
     A                                             'Sequence 71')
     A            SFTRAS71       1          TEXT('Trust Agreement 71')
     A                                      COLHDG('Trust Agreement 71')
      *
      **  Detail 72
      *
     A            SFDLNO72       6          TEXT('Deal Number 72')
     A                                      COLHDG('Deal' +
     A                                             'Number 72')
     A            SFCNUM72      10          TEXT('Customer Number 72')
     A                                      COLHDG('Customer' +
     A                                             'Number 72')
     A            SFPTFR72       4          TEXT('Portfolio Reference 72')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 72')
     A            SFAMNT72      15          TEXT('Amount 72')
     A                                      COLHDG('Amount 72')
     A**Start of change CGL029
     A**********  SFACOD72       4          TEXT('Account Code 72')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 72')                                 CGL029
     A            SFACOD72QQ     4A
     A**End of change CGL029
     A            SFACSQ72       2          TEXT('Account Sequence 72')
     A                                      COLHDG('Account' +
     A                                             'Sequence 72')
     A            SFTRAS72       1          TEXT('Trust Agreement 72')
     A                                      COLHDG('Trust Agreement 72')
      *
      **  Detail 73
      *
     A            SFDLNO73       6          TEXT('Deal Number 73')
     A                                      COLHDG('Deal' +
     A                                             'Number 73')
     A            SFCNUM73      10          TEXT('Customer Number 73')
     A                                      COLHDG('Customer' +
     A                                             'Number 73')
     A            SFPTFR73       4          TEXT('Portfolio Reference 73')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 73')
     A            SFAMNT73      15          TEXT('Amount 73')
     A                                      COLHDG('Amount 73')
     A**Start of change CGL029
     A**********  SFACOD73       4          TEXT('Account Code 73')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 73')                                 CGL029
     A            SFACOD73QQ     4A
     A**End of change CGL029
     A            SFACSQ73       2          TEXT('Account Sequence 73')
     A                                      COLHDG('Account' +
     A                                             'Sequence 73')
     A            SFTRAS73       1          TEXT('Trust Agreement 73')
     A                                      COLHDG('Trust Agreement 73')
      *
      **  Detail 74
      *
     A            SFDLNO74       6          TEXT('Deal Number 74')
     A                                      COLHDG('Deal' +
     A                                             'Number 74')
     A            SFCNUM74      10          TEXT('Customer Number 74')
     A                                      COLHDG('Customer' +
     A                                             'Number 74')
     A            SFPTFR74       4          TEXT('Portfolio Reference 74')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 74')
     A            SFAMNT74      15          TEXT('Amount 74')
     A                                      COLHDG('Amount 74')
     A**Start of change CGL029
     A**********  SFACOD74       4          TEXT('Account Code 74')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 74')                                 CGL029
     A            SFACOD74QQ     4A
     A**End of change CGL029
     A            SFACSQ74       2          TEXT('Account Sequence 74')
     A                                      COLHDG('Account' +
     A                                             'Sequence 74')
     A            SFTRAS74       1          TEXT('Trust Agreement 74')
     A                                      COLHDG('Trust Agreement 74')
      *
      **  Detail 75
      *
     A            SFDLNO75       6          TEXT('Deal Number 75')
     A                                      COLHDG('Deal' +
     A                                             'Number 75')
     A            SFCNUM75      10          TEXT('Customer Number 75')
     A                                      COLHDG('Customer' +
     A                                             'Number 75')
     A            SFPTFR75       4          TEXT('Portfolio Reference 75')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 75')
     A            SFAMNT75      15          TEXT('Amount 75')
     A                                      COLHDG('Amount 75')
     A**Start of change CGL029
     A**********  SFACOD75       4          TEXT('Account Code 75')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 75')                                 CGL029
     A            SFACOD75QQ     4A
     A**End of change CGL029
     A            SFACSQ75       2          TEXT('Account Sequence 75')
     A                                      COLHDG('Account' +
     A                                             'Sequence 75')
     A            SFTRAS75       1          TEXT('Trust Agreement 75')
     A                                      COLHDG('Trust Agreement 75')
      *
      **  Detail 76
      *
     A            SFDLNO76       6          TEXT('Deal Number 76')
     A                                      COLHDG('Deal' +
     A                                             'Number 76')
     A            SFCNUM76      10          TEXT('Customer Number 76')
     A                                      COLHDG('Customer' +
     A                                             'Number 76')
     A            SFPTFR76       4          TEXT('Portfolio Reference 76')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 76')
     A            SFAMNT76      15          TEXT('Amount 76')
     A                                      COLHDG('Amount 76')
     A**Start of change CGL029
     A**********  SFACOD76       4          TEXT('Account Code 76')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 76')                                 CGL029
     A            SFACOD76QQ     4A
     A**End of change CGL029
     A            SFACSQ76       2          TEXT('Account Sequence 76')
     A                                      COLHDG('Account' +
     A                                             'Sequence 76')
     A            SFTRAS76       1          TEXT('Trust Agreement 76')
     A                                      COLHDG('Trust Agreement 76')
      *
      **  Detail 77
      *
     A            SFDLNO77       6          TEXT('Deal Number 77')
     A                                      COLHDG('Deal' +
     A                                             'Number 77')
     A            SFCNUM77      10          TEXT('Customer Number 77')
     A                                      COLHDG('Customer' +
     A                                             'Number 77')
     A            SFPTFR77       4          TEXT('Portfolio Reference 77')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 77')
     A            SFAMNT77      15          TEXT('Amount 77')
     A                                      COLHDG('Amount 77')
     A**Start of change CGL029
     A**********  SFACOD77       4          TEXT('Account Code 77')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 77')                                 CGL029
     A            SFACOD77QQ     4A
     A**End of change CGL029
     A            SFACSQ77       2          TEXT('Account Sequence 77')
     A                                      COLHDG('Account' +
     A                                             'Sequence 77')
     A            SFTRAS77       1          TEXT('Trust Agreement 77')
     A                                      COLHDG('Trust Agreement 77')
      *
      **  Detail 78
      *
     A            SFDLNO78       6          TEXT('Deal Number 78')
     A                                      COLHDG('Deal' +
     A                                             'Number 78')
     A            SFCNUM78      10          TEXT('Customer Number 78')
     A                                      COLHDG('Customer' +
     A                                             'Number 78')
     A            SFPTFR78       4          TEXT('Portfolio Reference 78')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 78')
     A            SFAMNT78      15          TEXT('Amount 78')
     A                                      COLHDG('Amount 78')
     A**Start of change CGL029
     A**********  SFACOD78       4          TEXT('Account Code 78')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 78')                                 CGL029
     A            SFACOD78QQ     4A
     A**End of change CGL029
     A            SFACSQ78       2          TEXT('Account Sequence 78')
     A                                      COLHDG('Account' +
     A                                             'Sequence 78')
     A            SFTRAS78       1          TEXT('Trust Agreement 78')
     A                                      COLHDG('Trust Agreement 78')
      *
      **  Detail 79
      *
     A            SFDLNO79       6          TEXT('Deal Number 79')
     A                                      COLHDG('Deal' +
     A                                             'Number 79')
     A            SFCNUM79      10          TEXT('Customer Number 79')
     A                                      COLHDG('Customer' +
     A                                             'Number 79')
     A            SFPTFR79       4          TEXT('Portfolio Reference 79')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 79')
     A            SFAMNT79      15          TEXT('Amount 79')
     A                                      COLHDG('Amount 79')
     A**Start of change CGL029
     A**********  SFACOD79       4          TEXT('Account Code 79')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 79')                                 CGL029
     A            SFACOD79QQ     4A
     A**End of change CGL029
     A            SFACSQ79       2          TEXT('Account Sequence 79')
     A                                      COLHDG('Account' +
     A                                             'Sequence 79')
     A            SFTRAS79       1          TEXT('Trust Agreement 79')
     A                                      COLHDG('Trust Agreement 79')
      *
      **  Detail 80
      *
     A            SFDLNO80       6          TEXT('Deal Number 80')
     A                                      COLHDG('Deal' +
     A                                             'Number 80')
     A            SFCNUM80      10          TEXT('Customer Number 80')
     A                                      COLHDG('Customer' +
     A                                             'Number 80')
     A            SFPTFR80       4          TEXT('Portfolio Reference 80')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 80')
     A            SFAMNT80      15          TEXT('Amount 80')
     A                                      COLHDG('Amount 80')
     A**Start of change CGL029
     A**********  SFACOD80       4          TEXT('Account Code 80')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 80')                                 CGL029
     A            SFACOD80QQ     4A
     A**End of change CGL029
     A            SFACSQ80       2          TEXT('Account Sequence 80')
     A                                      COLHDG('Account' +
     A                                             'Sequence 80')
     A            SFTRAS80       1          TEXT('Trust Agreement 80')
     A                                      COLHDG('Trust Agreement 80')
      *
      **  Detail 81
      *
     A            SFDLNO81       6          TEXT('Deal Number 81')
     A                                      COLHDG('Deal' +
     A                                             'Number 81')
     A            SFCNUM81      10          TEXT('Customer Number 81')
     A                                      COLHDG('Customer' +
     A                                             'Number 81')
     A            SFPTFR81       4          TEXT('Portfolio Reference 81')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 81')
     A            SFAMNT81      15          TEXT('Amount 81')
     A                                      COLHDG('Amount 81')
     A**Start of change CGL029
     A**********  SFACOD81       4          TEXT('Account Code 81')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 81')                                 CGL029
     A            SFACOD81QQ     4A
     A**End of change CGL029
     A            SFACSQ81       2          TEXT('Account Sequence 81')
     A                                      COLHDG('Account' +
     A                                             'Sequence 81')
     A            SFTRAS81       1          TEXT('Trust Agreement 81')
     A                                      COLHDG('Trust Agreement 81')
      *
      **  Detail 82
      *
     A            SFDLNO82       6          TEXT('Deal Number 82')
     A                                      COLHDG('Deal' +
     A                                             'Number 82')
     A            SFCNUM82      10          TEXT('Customer Number 82')
     A                                      COLHDG('Customer' +
     A                                             'Number 82')
     A            SFPTFR82       4          TEXT('Portfolio Reference 82')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 82')
     A            SFAMNT82      15          TEXT('Amount 82')
     A                                      COLHDG('Amount 82')
     A**Start of change CGL029
     A**********  SFACOD82       4          TEXT('Account Code 82')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 82')                                 CGL029
     A            SFACOD82QQ     4A
     A**End of change CGL029
     A            SFACSQ82       2          TEXT('Account Sequence 82')
     A                                      COLHDG('Account' +
     A                                             'Sequence 82')
     A            SFTRAS82       1          TEXT('Trust Agreement 82')
     A                                      COLHDG('Trust Agreement 82')
      *
      **  Detail 83
      *
     A            SFDLNO83       6          TEXT('Deal Number 83')
     A                                      COLHDG('Deal' +
     A                                             'Number 83')
     A            SFCNUM83      10          TEXT('Customer Number 83')
     A                                      COLHDG('Customer' +
     A                                             'Number 83')
     A            SFPTFR83       4          TEXT('Portfolio Reference 83')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 83')
     A            SFAMNT83      15          TEXT('Amount 83')
     A                                      COLHDG('Amount 83')
     A**Start of change CGL029
     A**********  SFACOD83       4          TEXT('Account Code 83')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 83')                                 CGL029
     A            SFACOD83QQ     4A
     A**End of change CGL029
     A            SFACSQ83       2          TEXT('Account Sequence 83')
     A                                      COLHDG('Account' +
     A                                             'Sequence 83')
     A            SFTRAS83       1          TEXT('Trust Agreement 83')
     A                                      COLHDG('Trust Agreement 83')
      *
      **  Detail 84
      *
     A            SFDLNO84       6          TEXT('Deal Number 84')
     A                                      COLHDG('Deal' +
     A                                             'Number 84')
     A            SFCNUM84      10          TEXT('Customer Number 84')
     A                                      COLHDG('Customer' +
     A                                             'Number 84')
     A            SFPTFR84       4          TEXT('Portfolio Reference 84')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 84')
     A            SFAMNT84      15          TEXT('Amount 84')
     A                                      COLHDG('Amount 84')
     A**Start of change CGL029
     A**********  SFACOD84       4          TEXT('Account Code 84')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 84')                                 CGL029
     A            SFACOD84QQ     4A
     A**End of change CGL029
     A            SFACSQ84       2          TEXT('Account Sequence 84')
     A                                      COLHDG('Account' +
     A                                             'Sequence 84')
     A            SFTRAS84       1          TEXT('Trust Agreement 84')
     A                                      COLHDG('Trust Agreement 84')
      *
      **  Detail 85
      *
     A            SFDLNO85       6          TEXT('Deal Number 85')
     A                                      COLHDG('Deal' +
     A                                             'Number 85')
     A            SFCNUM85      10          TEXT('Customer Number 85')
     A                                      COLHDG('Customer' +
     A                                             'Number 85')
     A            SFPTFR85       4          TEXT('Portfolio Reference 85')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 85')
     A            SFAMNT85      15          TEXT('Amount 85')
     A                                      COLHDG('Amount 85')
     A**Start of change CGL029
     A**********  SFACOD85       4          TEXT('Account Code 85')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 85')                                 CGL029
     A            SFACOD85QQ     4A
     A**End of change CGL029
     A            SFACSQ85       2          TEXT('Account Sequence 85')
     A                                      COLHDG('Account' +
     A                                             'Sequence 85')
     A            SFTRAS85       1          TEXT('Trust Agreement 85')
     A                                      COLHDG('Trust Agreement 85')
      *
      **  Detail 86
      *
     A            SFDLNO86       6          TEXT('Deal Number 86')
     A                                      COLHDG('Deal' +
     A                                             'Number 86')
     A            SFCNUM86      10          TEXT('Customer Number 86')
     A                                      COLHDG('Customer' +
     A                                             'Number 86')
     A            SFPTFR86       4          TEXT('Portfolio Reference 86')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 86')
     A            SFAMNT86      15          TEXT('Amount 86')
     A                                      COLHDG('Amount 86')
     A**Start of change CGL029
     A**********  SFACOD86       4          TEXT('Account Code 86')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 86')                                 CGL029
     A            SFACOD86QQ     4A
     A**End of change CGL029
     A            SFACSQ86       2          TEXT('Account Sequence 86')
     A                                      COLHDG('Account' +
     A                                             'Sequence 86')
     A            SFTRAS86       1          TEXT('Trust Agreement 86')
     A                                      COLHDG('Trust Agreement 86')
      *
      **  Detail 87
      *
     A            SFDLNO87       6          TEXT('Deal Number 87')
     A                                      COLHDG('Deal' +
     A                                             'Number 87')
     A            SFCNUM87      10          TEXT('Customer Number 87')
     A                                      COLHDG('Customer' +
     A                                             'Number 87')
     A            SFPTFR87       4          TEXT('Portfolio Reference 87')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 87')
     A            SFAMNT87      15          TEXT('Amount 87')
     A                                      COLHDG('Amount 87')
     A**Start of change CGL029
     A**********  SFACOD87       4          TEXT('Account Code 87')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 87')                                 CGL029
     A            SFACOD87QQ     4A
     A**End of change CGL029
     A            SFACSQ87       2          TEXT('Account Sequence 87')
     A                                      COLHDG('Account' +
     A                                             'Sequence 87')
     A            SFTRAS87       1          TEXT('Trust Agreement 87')
     A                                      COLHDG('Trust Agreement 87')
      *
      **  Detail 88
      *
     A            SFDLNO88       6          TEXT('Deal Number 88')
     A                                      COLHDG('Deal' +
     A                                             'Number 88')
     A            SFCNUM88      10          TEXT('Customer Number 88')
     A                                      COLHDG('Customer' +
     A                                             'Number 88')
     A            SFPTFR88       4          TEXT('Portfolio Reference 88')
     A                                      COLHDG('Portfolio' +
     A                                             'Reference 88')
     A            SFAMNT88      15          TEXT('Amount 88')
     A                                      COLHDG('Amount 88')
     A**Start of change CGL029
     A**********  SFACOD88       4          TEXT('Account Code 88')                           CGL029
     A**********                            COLHDG('Account' +                                CGL029
     A**********                                   'Code 88')                                 CGL029
     A            SFACOD88QQ     4A
     A**End of change CGL029
     A            SFACSQ88       2          TEXT('Account Sequence 88')
     A                                      COLHDG('Account' +
     A                                             'Sequence 88')
     A            SFTRAS88       1          TEXT('Trust Agreement 88')
     A                                      COLHDG('Trust Agreement 88')
     A            SFNARR01      60A         TEXT('Restriction Narr 1')
     A                                      COLHDG('Restriction Narr 1')
     A            SFNARR02      60A         TEXT('Restriction Narr 2')
     A                                      COLHDG('Restriction Narr 2')
     A            SFNARR03      60A         TEXT('Restriction Narr 3')
     A                                      COLHDG('Restriction Narr 3')
     A            SFNARR04      60A         TEXT('Restriction Narr 4')
     A                                      COLHDG('Restriction Narr 4')
      *
     A            WSFOTRANID    20          TEXT('Front Office Id')
     A                                      COLHDG('Front' +
     A                                             'Office Id')
      *
     A            WSFOASOCID    20          TEXT('Associated Front Office Id')
     A                                      COLHDG('Associated Front' +
     A                                             'Office Id')
      *
     A            WSRPRLOCN      1          TEXT('Deal Repair Location')
     A                                      COLHDG('Deal Repair Location')
      *
     A**Start of change CGL029
     A            SFACOD01      10A         TEXT('Account Code 01')
     A            SFACOD02      10A         TEXT('Account Code 02')
     A            SFACOD03      10A         TEXT('Account Code 03')
     A            SFACOD04      10A         TEXT('Account Code 04')
     A            SFACOD05      10A         TEXT('Account Code 05')
     A            SFACOD06      10A         TEXT('Account Code 06')
     A            SFACOD07      10A         TEXT('Account Code 07')
     A            SFACOD08      10A         TEXT('Account Code 08')
     A            SFACOD09      10A         TEXT('Account Code 09')
     A            SFACOD10      10A         TEXT('Account Code 10')
     A            SFACOD11      10A         TEXT('Account Code 11')
     A            SFACOD12      10A         TEXT('Account Code 12')
     A            SFACOD13      10A         TEXT('Account Code 13')
     A            SFACOD14      10A         TEXT('Account Code 14')
     A            SFACOD15      10A         TEXT('Account Code 15')
     A            SFACOD16      10A         TEXT('Account Code 16')
     A            SFACOD17      10A         TEXT('Account Code 17')
     A            SFACOD18      10A         TEXT('Account Code 18')
     A            SFACOD19      10A         TEXT('Account Code 19')
     A            SFACOD20      10A         TEXT('Account Code 20')
     A            SFACOD21      10A         TEXT('Account Code 21')
     A            SFACOD22      10A         TEXT('Account Code 22')
     A            SFACOD23      10A         TEXT('Account Code 23')
     A            SFACOD24      10A         TEXT('Account Code 24')
     A            SFACOD25      10A         TEXT('Account Code 25')
     A            SFACOD26      10A         TEXT('Account Code 26')
     A            SFACOD27      10A         TEXT('Account Code 27')
     A            SFACOD28      10A         TEXT('Account Code 28')
     A            SFACOD29      10A         TEXT('Account Code 29')
     A            SFACOD30      10A         TEXT('Account Code 30')
     A            SFACOD31      10A         TEXT('Account Code 31')
     A            SFACOD32      10A         TEXT('Account Code 32')
     A            SFACOD33      10A         TEXT('Account Code 13')
     A            SFACOD34      10A         TEXT('Account Code 34')
     A            SFACOD35      10A         TEXT('Account Code 35')
     A            SFACOD36      10A         TEXT('Account Code 36')
     A            SFACOD37      10A         TEXT('Account Code 37')
     A            SFACOD38      10A         TEXT('Account Code 38')
     A            SFACOD39      10A         TEXT('Account Code 39')
     A            SFACOD40      10A         TEXT('Account Code 40')
     A            SFACOD41      10A         TEXT('Account Code 41')
     A            SFACOD42      10A         TEXT('Account Code 42')
     A            SFACOD43      10A         TEXT('Account Code 43')
     A            SFACOD44      10A         TEXT('Account Code 44')
     A            SFACOD45      10A         TEXT('Account Code 45')
     A            SFACOD46      10A         TEXT('Account Code 46')
     A            SFACOD47      10A         TEXT('Account Code 47')
     A            SFACOD48      10A         TEXT('Account Code 48')
     A            SFACOD49      10A         TEXT('Account Code 49')
     A            SFACOD50      10A         TEXT('Account Code 50')
     A            SFACOD51      10A         TEXT('Account Code 51')
     A            SFACOD52      10A         TEXT('Account Code 52')
     A            SFACOD53      10A         TEXT('Account Code 53')
     A            SFACOD54      10A         TEXT('Account Code 54')
     A            SFACOD55      10A         TEXT('Account Code 55')
     A            SFACOD56      10A         TEXT('Account Code 56')
     A            SFACOD57      10A         TEXT('Account Code 57')
     A            SFACOD58      10A         TEXT('Account Code 58')
     A            SFACOD59      10A         TEXT('Account Code 59')
     A            SFACOD60      10A         TEXT('Account Code 60')
     A            SFACOD61      10A         TEXT('Account Code 61')
     A            SFACOD62      10A         TEXT('Account Code 62')
     A            SFACOD63      10A         TEXT('Account Code 63')
     A            SFACOD64      10A         TEXT('Account Code 64')
     A            SFACOD65      10A         TEXT('Account Code 65')
     A            SFACOD66      10A         TEXT('Account Code 66')
     A            SFACOD67      10A         TEXT('Account Code 67')
     A            SFACOD68      10A         TEXT('Account Code 68')
     A            SFACOD69      10A         TEXT('Account Code 69')
     A            SFACOD70      10A         TEXT('Account Code 70')
     A            SFACOD71      10A         TEXT('Account Code 71')
     A            SFACOD72      10A         TEXT('Account Code 72')
     A            SFACOD73      10A         TEXT('Account Code 73')
     A            SFACOD74      10A         TEXT('Account Code 74')
     A            SFACOD75      10A         TEXT('Account Code 75')
     A            SFACOD76      10A         TEXT('Account Code 76')
     A            SFACOD77      10A         TEXT('Account Code 77')
     A            SFACOD78      10A         TEXT('Account Code 78')
     A            SFACOD79      10A         TEXT('Account Code 79')
     A            SFACOD80      10A         TEXT('Account Code 80')
     A            SFACOD81      10A         TEXT('Account Code 81')
     A            SFACOD82      10A         TEXT('Account Code 82')
     A            SFACOD83      10A         TEXT('Account Code 83')
     A            SFACOD84      10A         TEXT('Account Code 84')
     A            SFACOD85      10A         TEXT('Account Code 85')
     A            SFACOD86      10A         TEXT('Account Code 86')
     A            SFACOD87      10A         TEXT('Account Code 87')
     A            SFACOD88      10A         TEXT('Account Code 88')
     A**End of change CGL029
