      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas AC ACSTAT data area maintenance')
     A*****************************************************************
     A*                                                               *
     A*  Midas - System Control Module                            *
     A*                                                               *
     A*  AC0009DF - ACSTAT data area maintenance program              *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. 098705             Date 05Feb96               *
      *                 S01491 *C *CREATE  Date 01Oct94               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     A*  098705 - Add resource name field ACRSNM                      *
     A*         - Remove redundant fields ACUSER and ACJOBN           *
     A*         - Screen fields moved - not annotated                 *
     A*  S01491 - Autocall.                                           *
     A*                                                               *
     A*****************************************************************
     A*                                                             : *
     A*
     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      PRINT(MPRINT)
     A*
     A          R AC0009S0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A                                      CA03(03)
     A                                      CA05(05)
     A            WUSER         10   O  1  2TEXT('User ID')
     A                                  1 13'ACC0009'
     A                                  1 27'Autocall data area (ACSTAT)'
     A                                      DSPATR(HI)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A            WJOB          10   O  2  2TEXT('Job ID')
     A                                  2 35'Maintenance'
     A                                      DSPATR(HI)
     A                                  2 71TIME
     A                                      EDTWRD('  :  :  ')
     A                                  4 20'Remote User'
     A            ACRMTS         1A  B  4 50DSPATR(HI)
     A                                  6 20'Midas System'
     A            ACMIDS         2A  B  6 50DSPATR(HI)
     A                                  8 20'Remote Restart Enabled'
     A            ACRMTR         1A  B  8 50DSPATR(HI)
     A*                                             /Begin 098705/
     A************                     10 20'User ID'
     A************ACUSER        10A  B 10 50DSPATR(HI)
     A************                     12 20'Job Number'
     A************ACJOBN         6A  B 12 50DSPATR(HI)
     A*                                             /End   098705/
     A                                 10 20'ECS User ID'
     A            ACECSU        10A  B 10 50DSPATR(HI)
     A                                 12 20'ECS Password'
     A            ACECSP        10A  B 12 50DSPATR(HI)
     A                                 14 20'Client'
     A            ACCLNT        10A  B 14 50DSPATR(HI)
     A                                 16 20'Fallback Pager Flag Y/N'
     A            ACFALB         1A  B 16 50DSPATR(HI)
     A*                                             /Begin 098705/
     A                                 18 20'Autocall Resource Name'
     A            ACRSNM        10A  B 18 50DSPATR(HI)
     A                                 19 20'(i.e. LINxxx)'
     A*
     A            ERMSG         75A  B 22 02DSPATR(HI RI)
     A N20                                  DSPATR(ND)
     A*                                             /End   098705/
     A*
     A                                 23  2'F3=Exit'
     A                                 23 11'F5=Refresh'
