      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas AB FUND API Screen Format Definition File')
      *****************************************************************
      *                                                               *
      *  Midas - Internal Funding Module                              *
      *                                                               *
      *  PF/ABFUNDPD - AB FUND API Screen Format Definition File      *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CDL038             Date 10May05               *
      *                 CDL020             Date 03Feb04               *
      *                 CDL019             Date 16Feb04               *
      *                 CAS004             Date 26Jun02               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *                 CAP042  *CREATE    Date 08Jan01               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CDL038 - Extended Deal Sub Type                              *
      *  CDL020 - Apply Base Rate at Value Date                       *
      *  CDL019 - Allow Base Rate Changes on Fixed Deposits/Loans     *
      *  CAS004 - Hedge Accounting Phase A                            *
      *  CAP042 - Conversion of Internal Funding Deal inputs into     *
      *           modular structure to use as APIs                    *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R ABFUNDD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A            #1ACTN         1A         TEXT('Action Code')
     A                                      COLHDG('Actn' 'Code')
      *
     A            #1DLNO         6A         TEXT('Deal Number #1')
     A                                      COLHDG('Deal' 'Num1')
      *
     A            #1BRC1         3A         TEXT('Branch Code #1')
     A                                      COLHDG('Brch' 'Code1')
      *
     A            #1STP1         2A         TEXT('Deal Sub-type #1')
     A                                      COLHDG('Deal' 'Styp1')
      *
     A            #1BOK1         2A         TEXT('Book Code #1')
     A                                      COLHDG('Book' 'Code1')
      *
     A            #1PRF1         4A         TEXT('Profit Centre #1')
     A                                      COLHDG('Prft' 'Cntr1')
      *
     A            #1DADN         6A         TEXT('Deal Number #2')
     A                                      COLHDG('Deal' 'Num2')
      *
     A            #1BRC2         3A         TEXT('Branch Code #2')
     A                                      COLHDG('Brch' 'Code2')
      *
     A            #1STP2         2A         TEXT('Deal Sub-type #2')
     A                                      COLHDG('Deal' 'Styp2')
      *
     A            #1BOK2         2A         TEXT('Book Code #2')
     A                                      COLHDG('Book' 'Code2')
      *
     A            #1PRF2         4A         TEXT('Profit Centre #2')
     A                                      COLHDG('Prft' 'Cntr2')
      *
     A            #1DDAT         6A         TEXT('Deal Date')
     A                                      COLHDG('Deal' 'Date')
      *
     A            #1VDAT         6A         TEXT('Value Date')
     A                                      COLHDG('Value' 'Date')
      *
     A            #1MDAT         6A         TEXT('Maturity Date')
     A                                      COLHDG('Maturity' 'Date')
      *
     A            #1NTCE         3A         TEXT('Notice Days')
     A                                      COLHDG('Notice' 'Days')
      *
     A            #1CCY          3A         TEXT('Currency Code')
     A                                      COLHDG('Ccy' 'Code')
      *
     A            #1AMNP        16A         TEXT('Principal Amount')
     A                                      COLHDG('Principal' 'Amount')
      *
     A            #1BCXR        16A         TEXT('Base Currency Rate')
     A                                      COLHDG('Base' 'Ccy' 'Rate')
      *
     A            #1BRTT         2A         TEXT('Base Rate Code')
     A                                      COLHDG('Base' 'Rate' 'Code')
      *
     A            #1RTSP        12A         TEXT('Rate/Spread')
     A                                      COLHDG('Rate/' 'Spread')
      *
     A            #1ICBS         1A         TEXT('Interest Calculation Basis')
     A                                      COLHDG('Int ' 'Calc' 'Basis')
      *
     A            #1IPFR         1A         TEXT('Interest Payment Frequency')
     A                                      COLHDG('Int ' 'Pay ' 'Freq')
      *
     A            #1NIDT         6A         TEXT('Next Interest Date')
     A                                      COLHDG('Next' 'Int ' 'Date')
      *
     A            #1TOTI        16A         TEXT('Total Interest')
     A                                      COLHDG('Total' 'Interest')
      *
     A            #1INTF         2A         TEXT('Interest Frequency Day +
     A                                            in Month')
     A                                      COLHDG('Int Freq' 'Day in Month')
      *
     A            #1CPTI         1A         TEXT('Capitalise Interest +
     A                                            Indicator')
     A                                      COLHDG('Cap' 'Int' 'Ind')
      *
     A            #1LNKR         6A         TEXT('Linked Deal Number')
     A                                      COLHDG('Linked' 'Deal' 'Number')
      *
     A            #1ORBR         3A         TEXT('Originating Branch Code')
     A                                      COLHDG('Orig' 'Brch' 'Code')
      *
      **Start of change CAS004
     A            #1OYC1         5          TEXT('Our/Buy Yield Curve 1')
     A                                      COLHDG('Our/Buy' +
     A                                             'Yield Curve 1')
     A            #1OYC2         5          TEXT('Our/Buy Yield Curve 2')
     A                                      COLHDG('Our/Buy' +
     A                                             'Yield Curve 2')
      **End of change CAS004
      *
      **Start of change CDL019
     A            #1FBRT         1A         TEXT('Fix Base Rate')
     A                                      COLHDG('Fix' 'Base' 'Rate')
      **End of change CDL019
      *
      **Start of change CDL020
     A            #1AIR         12A         TEXT('Actual Interest Rate')
     A                                      COLHDG('Actual' 'Interest Rate')
      **End of change CDL020
     A*                                              Begin /CDL038/
     A            #1CLS1         4A         TEXT('Deal Class #1')
     A                                      COLHDG('Deal' 'Class #1')
     A            #1CLS2         4A         TEXT('Deal Class #2')
     A                                      COLHDG('Deal' 'Class #2')
     A*                                              End   /CDL038/
