      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_NM                                                        *
/*EXI *  TEXT('Midas Limits by currency journal.')
     A****************************************************************
     A*                                                              *
     A*  Midas - Money Market (Dealing)
     A*                                                              *
     A*   MMAUDAPP - LIMITS BY CURRENCY JOURNAL                      *
     A*                                                              *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                              *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*   LAST AMEND NO. S01117    DATE   09/12/88                   *
     A*                                                              *
     A****************************************************************
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R QJORDJE                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*
     A            HAENTL    R               REFFLD(JOENTL)
     A            HASEQN    R               REFFLD(JOSEQN)
     A            HACODE    R               REFFLD(JOCODE)
     A            HAENTT    R               REFFLD(JOENTT)
     A            HADATE    R               REFFLD(JODATE)
     A            HATIME    R               REFFLD(JOTIME)
     A            HAJOB     R               REFFLD(JOJOB)
     A            HAUSER    R               REFFLD(JOUSER)
     A            HANBR     R               REFFLD(JONBR)
     A            HAPGM     R               REFFLD(JOPGM)
     A            HAOBJ     R               REFFLD(JOOBJ)
     A            HALIB     R               REFFLD(JOLIB)
     A            HAMBR     R               REFFLD(JOMBR)
     A            HACTRB    R               REFFLD(JOCTRB)
     A            HAFLAG    R               REFFLD(JOFLAG)
     A            HACCID    R               REFFLD(JOCCID)
     A            HARES     R               REFFLD(JORES)
     A            HARCID    R               REFFLD(RCID)
     A            HADLTF    R               REFFLD(DLTF)
     A            HADLUP    R               REFFLD(DLUP)
     A            HAMLUP    R               REFFLD(MLUP)
     A            HAYLUP    R               REFFLD(YLUP)
     A            HATLUP    R               REFFLD(TLUP)
     A            HACHTP    R               REFFLD(CHTP)
     A            HALCD     R               REFFLD(LCD)
     A            HALUID    R               REFFLD(LUID)
     A            HACCY     R               REFFLD(CCY)
     A            HALMIT    R               REFFLD(LMIT)
     A*                                                        /S01117/
     A            HABRC     R               REFFLD(DBRC)
     A*                                                        /S01117/
