      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_NM                                                        *
/*EXI *  TEXT('Midas Complete deals amendable fields.')
     A****************************************************************
     A*                                                              *
     A*  Midas - Money Market (Dealing)                          *
     A*                                                              *
     A*  MMAUDCPP - COMPLETE DEALS AMENDABLE FIELDS JOURNAL          *
     A*                                                              *
     A* (c) Finastra International Limited 2001                      *
     A*                                                              *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  PREV AMEND NO. 079597       DATE   08DEC94                  *
     A*                 S01117       DATE   09/12/88                 *
     A*                                                              *
     A****************************************************************
     A*                                                              *
     A*  MD046248 - Finastra Rebranding                              *
     A*  079597  -  Branch code ref field is wrong - it should refer *
     A*             to Branch Code Amendable Indicator field. Branch *
     A*             Code field also removed to match MMCDAFPP.  See  *
     A*             fix E15947 in MMCDAFPP                           *
     A*
     A****************************************************************
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R QJORDJE                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*
     A            HCENTL    R               REFFLD(JOENTL)
     A            HCSEQN    R               REFFLD(JOSEQN)
     A            HCCODE    R               REFFLD(JOCODE)
     A            HCENTT    R               REFFLD(JOENTT)
     A            HCDATE    R               REFFLD(JODATE)
     A            HCTIME    R               REFFLD(JOTIME)
     A            HCJOB     R               REFFLD(JOJOB)
     A            HCUSER    R               REFFLD(JOUSER)
     A            HCNBR     R               REFFLD(JONBR)
     A            HCPGM     R               REFFLD(JOPGM)
     A            HCOBJ     R               REFFLD(JOOBJ)
     A            HCLIB     R               REFFLD(JOLIB)
     A            HCMBR     R               REFFLD(JOMBR)
     A            HCCTRB    R               REFFLD(JOCTRB)
     A            HCFLAG    R               REFFLD(JOFLAG)
     A            HCCCID    R               REFFLD(JOCCID)
     A            HCRES     R               REFFLD(JORES)
     A            HCRCID    R               REFFLD(RCID)
     A            HCDLTF    R               REFFLD(DLTF)
     A            HCDLUP    R               REFFLD(DLUP)
     A            HCMLUP    R               REFFLD(MLUP)
     A            HCYLUP    R               REFFLD(YLUP)
     A            HCTLUP    R               REFFLD(TLUP)
     A            HCCHTP    R               REFFLD(CHTP)
     A            HCLCD     R               REFFLD(LCD)
     A            HCLUID    R               REFFLD(LUID)
     A*                                              Begin 079597
     A************HCBRCA    R               REFFLD(BRCA)
     A            HCBRCA    R               REFFLD(BRNA)
     A*                                              End   079597
     A            HCCNMA    R               REFFLD(CNMA)
     A            HCBKRA    R               REFFLD(BKRA)
     A            HCBKGA    R               REFFLD(BKGA)
     A            HCDLSA    R               REFFLD(DLSA)
     A            HCINTA    R               REFFLD(ITDA)
     A*                                                        /S01117/
     A*                                              Begin 079597
     A************HCORBA    R               REFFLD(BRCA)
     A*                                              End   079597
     A*                                                        /S01117/
