      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MM Error Inds for Repurchase Agreements-dtl')
      *****************************************************************
      *                                                               *
      *  Midas - Application Program Interface Module                 *
      *                                                               *
      *  PF/MMERPDDPD - API Error Definition File for                 *
      *                 Repurchase Agreements - Details               *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *  Prev Amend No. CSE006  *CREATE    Date 27May99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSE006 - Repurchase Agreements (REPOS) enhancements          *
      *                                                               *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
 
     A          R MMERPDDD0                 TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
 
     A            OKACTN    R               TEXT('Action Code OK Flag')
                                            REFFLD(OKFLAG)
     A            OKSECT    R               TEXT('Security Shortname OK Flag')
                                            REFFLD(OKFLAG)
     A            OKNOML    R               TEXT('Nominal Amount OK Flag')
                                            REFFLD(OKFLAG)
     A            OKVALP    R               TEXT('Value Price OK Flag')
                                            REFFLD(OKFLAG)
     A            OKVDIN    R               TEXT('Value Date Interest OK Flag')
                                            REFFLD(OKFLAG)
     A            OKVDVL    R               TEXT('Value Date Value OK Flag')
                                            REFFLD(OKFLAG)
     A            OKMDIN    R               TEXT('Maturity Date Int OK Flag')
                                            REFFLD(OKFLAG)
     A            OKMDVL    R               TEXT('Maturity Date Value OK Flag')
                                            REFFLD(OKFLAG)
     A            OKORDP    R               TEXT('Our Depot OK Flag')
                                            REFFLD(OKFLAG)
     A            OKCPDP    R               TEXT('Counterparty Depot OK Flag')
                                            REFFLD(OKFLAG)
     A            OKEXCR    R               TEXT('Exchange Rate OK Flag')
                                            REFFLD(OKFLAG)
