      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MM LDNI reg extra data layout file')
      *****************************************************************
      *                                                               *
      *  Midas - Money Market Module                                  *
      *                                                               *
      *  PF/MMLDRXPD - Money Market Regional Extra Data Layout File   *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2005            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CER001  *CREATE    Date 25Apr05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CER001 - Lux Upgrade to MidasPlus                            *
      *                                                               *
      *****************************************************************
 
     A          R MMLDRXD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2005')
 
     A            L6LXLUSU       2A         TEXT('Lump-Sum Code')
     A            L6LXIM93       1A         TEXT('LMI Circular 96 / 127')
     A            L6LXCLAT       1A         TEXT('Claims Type')
     A            L6LXCOAM      15A         TEXT('Correction Amount')
     A            L6LXSUBR       1A         TEXT('Subordinate')
     A            L6LXMOBL      10A         TEXT('Mobilisable Customer')
     A            L6LXRISC       2A         TEXT('Risk Code')
     A            L6LXGUAC       1A         TEXT('Consumer Credit Code')
     A            L6LXIMEX       1A         TEXT('Import / Export Code')
     A            L6LXPPSC       6A         TEXT('Property Sector Code')
