      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MM LDNI Interface Data Format Def. Layout')
      *****************************************************************
      *                                                               *
      *  Midas - Money Market Module                                  *
      *                                                               *
      *  PF/MMLDIFPD - API Money Market Interface Data Format         *
      *                Definition Layout File                         *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *  Prev Amend No. CAP051             Date 02Dec99               *
      *                 CDL007  *CREATE    Date 04Oct99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CAP051 - Automatic Authorisation                             *
      *  CDL007 - Deposit Breakdown Penalty                           *
      *           Addition of file to pass supplemental information   *
      *           from front to back office                           *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
 
     A          R MMLDIFD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
 
     A            BUSR          10          TEXT('Breakdown User Id')
     A                                      COLHDG('Breakdown' 'User ID')
 
     A            AUTH           1          TEXT('Automatic Authorisation')
     A                                      COLHDG('Automatic' 'Authorisation')
 
     A            FILLER        39          TEXT('Filler')
     A                                      COLHDG('Filler')
