      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MM API NASS Format Definition File')
      *****************************************************************
      *                                                               *
      *  Midas - Money Market Module                                  *
      *                                                               *
      *  PF/MMNASSPD - API Incoming Message Definition File for       *
      *                NAs sold                                       *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Last Amend No. CDL038             Date 10May05               *
      *  Prev Amend No. CAP002  *CREATE    Date 13Nov97               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CDL038 - Extended Deal Sub Type                              *
      *  CAP002 - Conversion of MM inputs into modular structure to   *
      *           use as APIs.                                        *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R MMNASSD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
      ** Message contents
      *
      ** Action code
     A            DDACTN    R               REFFLD(ACTO)
 
      ** Deal number
     A            DDDLNO    R     A         REFFLD(DEAL)
 
      ** Deal type
     A            DDMTYP    R               REFFLD(MDTY)
     A                                      TEXT('Deal type')
     A                                      COLHDG('Deal' 'type')
 
      ** Deal subtype
     A            DDSTYP    R               REFFLD(DLST)
 
      ** Federal funds indicator
     A            DDFEDF    R               REFFLD(FEDF)
 
      ** Deal date
     A            DDDLDT    R     A         REFFLD(CHGD)
     A                                      TEXT('Deal date')
     A                                      COLHDG('Deal' 'date')
 
      ** Broker code
     A            DDBKCD    R               REFFLD(BKCD)
 
      ** Brokerage
     A            DDBRKG    R     A         REFFLD(AMNP)
     A                                      TEXT('Brokerage')
     A                                      COLHDG('Brokerage')
 
      ** Sale of Deal No
     A            DDDADN    R               REFFLD(DADN)
     A                                      TEXT('Sale of deal number')
     A                                      COLHDG('Sale of' 'deal number')
 
      ** Issued By
     A            DDISUR    R               REFFLD(CSNM)
     A                                      TEXT('NAB issuer')
     A                                      COLHDG('NAB' 'issuer')
 
      ** Sold to
     A            DDCSNM    R               REFFLD(CSNM)
     A                                      TEXT('Sold to customer')
     A                                      COLHDG('Sold' 'to' 'customer')
 
      ** Value Date
     A            DDVDAT    R     A         REFFLD(CHGD)
     A                                      TEXT('Value date')
     A                                      COLHDG('Value' 'date')
 
      ** Currency
     A            DDCCY     R               REFFLD(CCY)
 
      ** Face Value
     A            DDFVAL    R     A         REFFLD(FAVL)
 
      ** Sale Price
     A            DDAMNP    R     A         REFFLD(AMNP)
     A                                      TEXT('Sale price')
     A                                      COLHDG('Sale' 'price')
 
      ** Yield rate
     A            DDINTR    R   +1A         REFFLD(INTS)
     A                                      TEXT('Yield rate')
     A                                      COLHDG('Yield' 'rate')
 
      ** Book Code
     A            DDBOKC    R     A  B      REFFLD(BOKC)
 
      ** Linked Ref. No.
     A            DDLNKN    R     A         REFFLD(LNKDN)
     A                                      TEXT('Linked reference number')
     A                                      COLHDG('Linked' 'Reference' +
     A                                             'Number')
 
      ** Profit centre
     A            DDPRFC    R               REFFLD(PRFC)
 
      ** Orig. Branch
     A            DDORBR    R     A         REFFLD(ORBR)
 
      ** Parcel Size
     A            DDPSZE    R     A         REFFLD(PSIZ)
     A*                                              Begin /CDL038/
     A            DDCLAS         4A         TEXT('Deal Class')
     A                                      COLHDG('Deal' 'Class')
     A*                                              End   /CDL038/
