      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MM API REPO Format Definition File')
      *****************************************************************
      *                                                               *
      *  Midas - Application Program Interface Module                 *
      *                                                               *
      *  PF/MMRPMCPD - API Incoming Message Definition File for       *
      *                REPO Amendments                                *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *  Last Amend No. CSE006  *CREATE    Date 17Jul99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSE006 - Repurchase Agreement Enhancements                   *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R MMRPMCD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
 
      ** Message contents
      *
      ** Action code
     A            DDACTN       001A
     A                                      TEXT('Action Code')
      *
      ** Deal number
     A            DDDLNO    R     A         REFFLD(DEAL )
     A                                      TEXT('Deal Number')
      *
      ** Value date
     A            DDVDAT    R     A         REFFLD(CHGD )
     A                                      TEXT('Value date')
      *
      ** Deal Amendment Sequence Number
     A            DDCASE         1A
     A                                      TEXT('DEAM Cash/Securities')
      *
      ** Deal Amendment Type
     A            DDTYPE    R               REFFLD(DTPE )
     A                                      TEXT('Deal Amendment Type')
      *
      ** Deal Amendment Amount
     A            DDAMNT    R     A         REFFLD(AMNP )
     A                                      TEXT('Deal Amendment Amount')
      *
      ** Deal Type
     A            DDRTYP        14A
     A                                      TEXT('Deal Type')
