      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Repo Delivery Detail file')
      *****************************************************************
      *                                                               *
      *  Midas - Monet Market Module (Dealing)                        *
      *                                                               *
      *  PF/MMRPDDPD - Repo Delivery Detail file                      *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *  Last Amend No. CSE006  *CREATE    Date 20APR99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSE006 - *CREATE                                             *
      *           Repurchase Agreements (REPOS) enhancements.         *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R MMRPDHD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            DDDLNO         6          TEXT('Deal Number')
     A                                      COLHDG('Deal Number')
     A            DDSECT        10          TEXT('Security Shortname')
     A                                      COLHDG('Security Shortname')
     A            DDNOML        12          TEXT('Nominal')
     A                                      COLHDG('Nominal')
     A            DDVALP        16          TEXT('Value Price')
     A                                      COLHDG('Value Price')
     A            DDVDIN        16          TEXT('Value Date Interest')
     A                                      COLHDG('Value Date'           +
     A                                             'Interest')
     A            DDVDVL        16          TEXT('Value Date Value')
     A                                      COLHDG('Value Date'             +
     A                                             'Value')
     A            DDMDIN        16          TEXT('Maturity Date Interest')
     A                                      COLHDG('Maturity Date'          +
     A                                             'Interest')
     A            DDMDVL        16          TEXT('Maturity Date Value')
     A                                      COLHDG('Maturity Date'          +
     A                                             'Value')
     A            DDORDP        10          TEXT('Our Depot')
     A                                      COLHDG('Our Depot')
     A            DDCPDP        10          TEXT('Counterparty Depot')
     A                                      COLHDG('Counterparty Depot')
     A            DDEXCR        15          TEXT('Exchange Rate')
     A                                      COLHDG('Exchange Rate')
     A            DDACTN         1          TEXT('Action Code')
     A                                      COLHDG('Action Code')
     A            DDDPMV         6          TEXT('Depot Reference')
     A                                      COLHDG('Depot Reference')
      *
