      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IMNMSN                                                    *
/*EXI *  MBR(*NONE)
/*EXI *  TEXT('Midas MC Aggregate balances and movements')            *
      *****************************************************************
      *                                                               *
      *  Midas - Management Accounts module                           *
      *                                                               *
      *  LF/MCAVBLV1 - Aggregate balances and movements               *
      *                                                               *
      ***(C)*Copyright*Misys*International*Banking*Systems,*2005*******                       EML108
      *  (c) Copyright Finastra Systems Technology, Inc. 2020         *                       EML108
      *                                                               *
      *  Last Amend No. EML108             Date 13Jan20               *
      *  Prev Amend No. UMD001             Date 07Jan09               *
      *                 230735 *Create     Date 17Feb05               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  EML108 - Upgrade FMD003 and fixes to FBM2.1SP21              *
      *  UMD001 - Upgrade FMD003 to Midas Plus 1.2.1 SP19             *
      *           Incorporate GEMS 230735                             *
      *  230735 - Average Balances file maintenance from SDACRCPD     *
      *           Back-up file of MCAVBLV1                            *
      *                                                               *
      *****************************************************************
      **Start of change EML108
     A**********R MCAVBLD1                  TEXT('(C) Copyright Misys -                       EML108
     A**********                            Intl Banking Systems 2005')                       EML108
     A          R MCAVBLD1                  TEXT('(c) Finastra +
     A                                      Systems Technology, +
     A                                      Inc. 2020')
      **End of change EML108
     A                                      PFILE(XMCAVBLX0)
      *---------------------------------------------------------------------
     A            M1CGCD                    TEXT('Control Group Code')
     A                                      COLHDG('Control' +
     A                                             'Group Code')
     A            M1RSNO                    TEXT('Report Set')
     A                                      COLHDG('Report' +
     A                                             'set')
     A            M1RSCD                    TEXT('Report Set Code')
     A                                      COLHDG('Report' +
     A                                             'set Code')
     A            M1BRCA                    TEXT('Branch code')
     A                                      COLHDG('Branch' +
     A                                             'code')
     A            M1CCY                     TEXT('Currency code')
     A                                      COLHDG('Curr' +
     A                                             'Code')
     A            M1ACOD                    TEXT('Account code')
     A                                      COLHDG('Account' +
     A                                             'code')
     A            M1CNUM                    TEXT('Customer number')
     A                                      COLHDG('Customer' +
     A                                             'number')
     A            M1ACSQ                    TEXT('Account sequence number')
     A                                      COLHDG('A/c +
     A                                             Seq +
     A                                             No.')
     A            M1CPNB                    TEXT('Current Period Number')
     A                                      COLHDG('Current' +
     A                                             'Period Number')
     A            M1PDDR                    TEXT('Period Total DB Movements')
     A                                      COLHDG('Period Total ' +
     A                                             'Debit Movements')
     A            M1PDCR                    TEXT('Period Total CR Movements')
     A                                      COLHDG('Period Total ' +
     A                                             'Credit Movements')
     A            M1PAGG                    TEXT('ACCghted Per-t-d Balance')
     A                                      COLHDG('Weighted Per-t-d' +
     A                                             'Balance')
     A            M1T1DR                    TEXT('Term 1 DB Movements')
     A                                      COLHDG('Term 1 DB' +
     A                                             'Movements')
     A            M1T1CR                    TEXT('Term 1 CR Movements')
     A                                      COLHDG('Term 1 Credit' +
     A                                             'Movements')
     A            M1T1AG                    TEXT('Weighted Term 1 Balance')
     A                                      COLHDG('Weighted Term 1' +
     A                                             'Balance')
     A            M1T2DR                    TEXT('Term 2 DB Movements')
     A                                      COLHDG('Term 2 DB' +
     A                                             'Movements')
     A            M1T2CR                    TEXT('Term 2 CR Movements')
     A                                      COLHDG('Term 2 CR' +
     A                                             'Movements')
     A            M1T2AG                    TEXT('Weighted Term 2 Balance')
     A                                      COLHDG('Weighted Term 2' +
     A                                             'Balance')
     A            M1YTDR                    TEXT('Yearly DB movements to date')
     A                                      COLHDG('Yearly DB' +
     A                                             'Movements to date')
     A            M1YTCR                    TEXT('Yearly CR Movements to date')
     A                                      COLHDG('Yearly CR' +
     A                                             'Movements to date')
     A            M1YAGG                    TEXT('Weighted Yearly Balance')
     A                                      COLHDG('Weighted Yearly' +
     A                                             'Balance')
     A            M1PDCB                    TEXT('Previous Day Closing Balance')
     A                                      COLHDG('Previous Day ' +
     A                                             'Closing Balance')
     A            M1LMDT                    TEXT('Movement Date')
     A                                      COLHDG('Movement Date')
      *=====================================================================
     A          K M1RSNO
     A          K M1ACOD
     A          K M1RSCD
      *
