000100210907                                            ********************************************************
000101210907/*STD *  LFBASE                                                       *
000102210907/*EXS *  LF_IM                                                        *
000103210907/*EXI *  TEXT('Midas GL Accounts by Account Code')                    *
000104210907      *****************************************************************
000105210907      *                                                               *
000106210907      *  Midas - General Ledger Module                                *
000107210907      *                                                               *
000108210907      *  LF/XXACBRC - Midas GL Accounts by A/c Code                   *
000109210907      *                                                               *
000110210907      *  (c) Finastra International Systems Ltd 2021                  *
000111210907      *                                                               *
000112210907      *  Last Amend No. DRI005  *CREATE    Date 13Apr21               *
000113210907      *                                                               *
000114210907      *****************************************************************
000115210907      *                                                               *
000116210907      *  DRI005 - HO and EDW Extracts                                 *
000117210907      *                                                               *
000118210907      *****************************************************************
000119210907     A          R ACCNTABF                  PFILE(ACCNTAB)
000120210907     A                                      TEXT('(c) Finastra Internation+
000121210907     A                                      al Systems Ltd 2021.')
000122210907      *
000123210907     A          K ACOD
000124210907     A          K CCY
000125210907     A          S RECI                      COMP(EQ 'D')
000126210907      *
