      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GL Accounts LF')                                 *
      *****************************************************************
      *                                                               *
      *  Midas - (Module Name) Module                                 *
      *                                                               *
      ***LF/REAMADV0*-*Logical of ACCNTAB******************************
      *  LF/XXAMADL0 - Logical of ACCNTAB                             *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2008            *
      *                                                               *
      *  Last Amend No. JMI109             Date 22May18               *
      *  Prev Amend No. JMI026  *CREATE    Date 30Apr08               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  JMI109 - G-AML PreProcessor (Upgrade to FB Midas)            *
      *  JMI026 - G-AML PreProcessor                                  *
      *                                                               *
      *****************************************************************
     A          R @AMADY0                   PFILE(ACCNTAB)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2008')
      *
     A            RECI      R
     A            CNUM      R
     A            CCY       R
     A            ACODQQ         4S 0       TEXT('Old Acc. Code')
     A            ACSQ      R
     A            ZZ006     R
     A            BRCA      R
     A            ATYP      R
     A            STYP      R
     A            MFFQ      R
     A            ACST      R
     A            DACO      R
     A            DACC      R
     A            ANAM      R
     A            LDBL      R
     A            CLBL      R
     A            STFQ      R
     A            STDY      R
     A            LSTD      R
     A            NSTD      R
     A            LSTP      R
     A            CFSB      R
     A            LMVD      R
     A            EPLB      R
     A            EPCB      R
     A            YTDB      R
     A            GLBT      R
     A            ADREF1    R
     A            PRFC      R
     A            ZZ004     R
     A            ORED      R
     A            DLIM      R
     A            LRCR      R
     A            RTCB      R
     A            RTLB      R
     A            DITM      R
     A            CITM      R
     A            ADREF2    R
     A            ZZ002     R
     A            CDIR      R
     A            CCIR      R
     A            ACNO      R
     A            RETB      R
     A            ODSC      R
     A            ODLN      R
     A            ODED      R
     A            DIOD      R
     A            FACT      R
     A            FCNO      R
     A            EFAC      R
     A            HELD      R
     A            MINB      R
     A            LACD      R
     A            LISP      R
     A            RRNM      R
     A            DRIB      R
     A            DRIS      R
     A            DRCD      R
     A            DRIC      R
     A            DRIF      R
     A            DRDY      R
     A            NDID      R
     A            LDID      R
     A            LDIA      R
     A            SDAP      R
     A            LPAR      R
     A            DIIE      R
     A            DAIC      R
     A            MADI      R
     A            GADI      R
     A            DDIS      R
     A            DDIA      R
     A            OLDR      R
     A            OLDB      R
     A            OLDS      R
     A            CRIB      R
     A            CRIS      R
     A            CRCD      R
     A            CRIC      R
     A            CRIF      R
     A            CRDY      R
     A            NCID      R
     A            LCID      R
     A            LCIA      R
     A            SCAP      R
     A            LPAP      R
     A            CIIE      R
     A            CAIC      R
     A            MACI      R
     A            GACI      R
     A            CDIS      R
     A            DCIA      R
     A            OLCR      R
     A            OLCB      R
     A            OLCS      R
     A            LCD       R
     A            CHTP      R
     A            TNLU      R
     A            BRTCA     R
     A            NACSG     R
     A            R4ACNT         1          TEXT('RCII ACCOUNT - Y/N')
     A            ENOC      R               TEXT('Extra number of +
     A                                      copies')
     A            EPNO      R               TEXT('Extra statement +
     A                                      page number')
     A            ECFB      R               TEXT('Extra carried +
     A                                      forward bal.')
     A            LTAB           3          TEXT('Link to BRCA')
     A            LTACQQ         4S 0
     A            LTAS           2S 0       TEXT('Link to ACSQ')
     A            HCFB          15P 0       TEXT('Hist. Carried Forward bal.')
     A            PTFR      R
     A            HLEX      R
     A            A5TIAC         1          TEXT('TI Account')
     A            A5TIAN         6          TEXT('TI Account Number')
     A            A5TIAS         3          TEXT('TI Account Suffix')
     A            EUSB           1          TEXT('Statement Balances in Euros')
     A            IBAN          34          TEXT('IBAN')
     A            IBSEQN         3          TEXT('IBAN sequence no')
     A                                      COLHDG('IBAN' 'Seq' 'No')
     A            FRNT          20          TEXT('Front Off Trans ID')
     A            AFRT          20          TEXT('Associated Front +
     A                                            Office Transaction Id')
     A            REPA           1          TEXT('Repair Location')
     A            TMST            Z         TEXT('Timestamp')
     A            REPI           1          TEXT('Replication Indicator')
     A            ACOD          10S         TEXT('Acc. Code')
     A            LTAC          10S         TEXT('Link to ACOD')
     A************FCCU           6S 0       TEXT('Facility Customer')                         JMI109
     A            FCCU           6A         TEXT('Facility Customer')                         JMI109
     A            COLF           1A         TEXT('Collateral Flag')
     A            BCOA          15P 0       TEXT('Blocked Collateral Amount')
     A            COLA          15P 0       TEXT('Collateral Amount')
     A            PFCU           6S 0       TEXT('Previous Facility Customer')
     A            PFTP           3S 0       TEXT('Previous Facility Type')
     A            PFSQ           2S 0       TEXT('Previous Facility Sequence')
     A            A5ACKY        34A         TEXT('SCOLDA Account Key')
     A            A5INTL         1A         TEXT('Internal Flag')
     A            A5TIAB         4A         TEXT('TI Branch Number')
     A            AUTH           1A         TEXT('Automatic Authorisation')
      *
     A          K BRCA
     A          K ACNO
     A          S ACNO                      COMP(NE 0)
     A            ATYP                      COMP(EQ 'R')
      *
