      ********************************************************************
/*STD *  LFBASE                                                          *
/*EXS *  LF_IM                                                           *
      ********************************************************************
      *                                                                  *
      *  Midas - Securities Trading Module                               *
      *                                                                  *
      *  LF/XXCDUDV0 - Customer + Depot Positions - extract file         *
      *                                                                  *
      *  (c) Finastra International Limited 2020                         *
      *                                                                  *
      *  Last Amend No. HUT118  *CREATE  Date  10Dec2020                 *
      *                                                                  *
      ********************************************************************
      *                                                                  *
      *    HUT118 - Position Settlements on-line generation (CSE053)     *
      *                                                                  *
      ********************************************************************
      *
     A          R XXCDUDP0                  PFILE(XXCDUDPP)
     A                                      TEXT('(c) Finastra Ltd 2020')
      *
     A            RECI                      RENAME(CDRECI)
     A            DSBA                      RENAME(CDCSBA)
     A            DSSC                      RENAME(CDCSSC)
     A            DDPT                      RENAME(CDCSCN)
     A            DDTE                      RENAME(CDCSDA)
     A            CDFLAG    R
      *
     A          K DSSC
     A          K DDPT
     A          K DSBA
     A          K DDTE
      *
     A          S CDFLAG                    VALUES('D')
