      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/XXMQCUL0 - Midas SD Log of Midas-Kondor Customer MQ msg   *
      *                                                               *
      *  (c) Finastra Ltd 2023                                        *
      *                                                               *
      *  Last Amend No. DRI008  *Create    Date 30Jun23               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  DRI008 - Midas-Kondor Inteface Customer Details              *
     A*                                                               *
     A*****************************************************************
     A          R XXMQCUD0                  PFILE(XXMQCUTD)
     A                                      TEXT('(c) Finastra Ltd 2023')
     A          K XUREF
      * Select Sent Status = ' '
     A          S XSNTST                    COMP(EQ ' ')
