      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas XX SE Valid Security Diary Events')              *
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading Module                            *
      *                                                               *
      *  LF/XXVSEDL1 - Valid Security Diary Events by Security,       *
      *                 Event Date, Event Type, Book Code and         *
      *                 Timestamp                                     *
      *                                                               *
      *  (c) Finastra International Limited 2020                      *
      *                                                               *
      *  Last Amend No. DUG502 *CREATE      Date 04Dec17              *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  DUG502 - Security Diary Enhancements                         *
      *           Created after core SEVSEDEL1 and added S2SDBRK      *
      *                                                               *
      *****************************************************************
     A          R SEVSEDED0                 PFILE(SEVSEDEPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2020')
      *
     A          K S2SDSN
     A          K S2SDED
     A          K S2SDET
     A          K S2SDBK
     A          K S2TMST
      *
