      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
      *****************************************************************
      *                                                               *
      *  Midas  EXPOSURE MANAGEMENT MODULE                            *
      *                                                               *
      *    PF/IEMTE2E2  -  DEALING TOMORROWS EVENTS DETAIL            *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. DUG503              Date  04Apr18             *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01332              Date  13May91             *
      *                                                               *
      *****************************************************************
      *    DUG503 - UGB FED CARS Upgrade                              *
      *             Apply to FBM from Midas R4                        *
      *             DUG405 - Events by Value Date Reporting I/C       *
      *    S01332 - EM rel 10 enhancements                            *
      *****************************************************************
      *  C R E A T I O N     P A R A M E T E R S                      *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R EMTE2E2F
     A                                      TEXT('(c) Finastra International +
     A                                      Limited  +
     A                                      2001')
     A            RECI      R
     A            MCUN      R
     A            MEVT      R
     A            MEVC      R
     A            MEVA      R
     A            MFCI      R
     A            MDTP      R
     A            SETT      R
      *                                                         /S01332
     A**********  ZZ102     R
     A            BRCA      R
     A            VDAT      R
     A            MDAT      R
     A            ZZ093     R
      *                                                         /S01332
