      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas RE Posting extension')
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  PF/GETT1APD - RTS Posting Extension                          *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CEU024 *CREATE     Date 14Jul98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CEU024 - EMU Retail Teller Support Enhancement               *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
      ** Format Level Entry
      *
     A          R GETT1AD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
      ** Field Level Entry
      *
     A            RFID      R               REFFLD(IMID)
     A                                      TEXT('Extension File Reference +
     A                                      ID')
     A                                      COLHDG('Extension +
     A                                      Ref.ID')
     A            RFNO      R               REFFLD(CHRN)
     A                                      TEXT('Extension File Reference +
     A                                      Number')
     A                                      COLHDG('Extension Number')
     A            OCCY      R
     A            OAMT      R               REFFLD(LDBL)
     A                                      TEXT('Original Amount')
     A                                      COLHDG('Original Amount')
      *
      ** Key Field Level Entry
      *
     A          K RFID
     A          K RFNO
