      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_NM                                                        *
/*EXI *  TEXT('Midas RE Accrual Trailer file')                        *
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  PF/REACRLZZ - RE Accrual Trailer                             *
      *                                                               *
      *  (c) Finastra International Limited 2012                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CRE093  *CREATE    Date 06Aug12               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CRE093 - Tactical COB changes REC3666                        *
      *                                                               *
      *****************************************************************
     A          R REACRLZF                  TEXT('(c) Finastra International +
     A                                      Limited 2012')
 
     A            NORE           5P 0       TEXT('Number of records on file')
     A                                      COLHDG('No of' +
     A                                       'Records' +
     A                                       'On file')
     A                                      EDTCDE(L)
