      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas RE Cash Management Hierarchy Relationships')
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  PF/RECMHRPD - Cash Management Hierarchy Relationships        *
      *                                                               *
      *  (c) Finastra International Limited 2002                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CRE008  *CREATE    Date 19Feb02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CRE008 - Cash Management                                     *
      *                                                               *
      *****************************************************************
      *
     A          R RECMHRD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2002')
      *
     A            HRPHID         9S 0       TEXT('Parent Hierarchy ID')
     A                                      COLHDG('Parent Hierarchy ID')
      *
     A            HRCHID         9S 0       TEXT('Child Hierarchy ID')
     A                                      COLHDG('Child Hierarchy ID')
