      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_NM                                                        *
/*EXI *  TEXT('Midas RE REIACD Extract Driver for CER049 ')           *
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  PF/REIADRPD - Midas RE REIACD Extract Driver for CER049      *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2016            *
      *                                                               *
      *  Last Amend No. MD040278 *Create   Date 18Aug16               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD040278 - Stamp Tax A/C Keys (GLC008131) is not task split. *
      *             Complete rework of the component to allow task    *
      *             split.                                            *
      *                                                               *
      *****************************************************************
     A          R REIADRF                   TEXT('(c) Misys Internatio+
     A                                      nal Banking Systems Ltd. +
     A                                      2016')
     A            GLFERN        10P 0       TEXT('From RRN Number')
     A                                      COLHDG('From' 'RRN' 'Number')
     A            GLTERN        10P 0       TEXT('To RRN Number')
     A                                      COLHDG('To' 'RRN' 'Number')
