      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas RE Interest sub-types detail')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Retail Module
     A*                                                               *
     A*  PF/REINUD - INTEREST SUB-TYPES DETAIL                        *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. BUG9060            Date 21Nov05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01413             Date 13Apr93               *
      *                 S01098             Date 28Jul86               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  BUG9060- Rename field HASH to REHASH since HASH is a reserve *
      *           word in SQL. (Recompile)                            *
     A*  S01413 - Header box standardised                             *
     A*  S01098 - Format to reference master file REINT               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A*                                                                 /S01098/
     A*                                     REF(MFLDREF)
     A*         R REINUDF
     A*                                     TEXT('INTEREST SUB-TYPES DETAIL')
     A*           RECI      R
     A*           ZZ01           1          TEXT('RESERVED')
     A*           ITYP      R
     A*           ISTP      R
     A*           ICCY      R
     A*           RECJ      R
     A*           ZZ03          17          TEXT('RESERVED')
     A*           TNLU      R
     A*           ORED      R
     A*           LCD       R
     A*           CHTP      R
     A*           HASH      R
     A*           INNM      R
     A*           BAL2      R
     A*           RAT2      R
     A*           BRT       R
     A*           ZZ07          20          TEXT('RESERVED')
     A*           INTH      R
     A*           VDTC      R
     A*           VDPC      R
     A*           ZZ04          53          TEXT('SPARE')
     A          R REINTDF                   FORMAT(REINTD)
     A*                                                                 /S01098/
