/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas RE Passbook Update Outgoing Response Message')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Retail Module                                        *
     A*                                                               *
     A*  PF/REPPUOPD - Passbook Update Outgoing Response Message      *
     A*                (Dummy for Data Queue Layout)                  *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CRT002  *CREATE    Date 29Nov95               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     A*  CRT002 - Retail Branch Access.                               *
     A*                                                               *
     A*****************************************************************
     A*
     A                                      REF(MFRFL)
     A          R REPPUOD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A            RMMSTY    R               REFFLD(DPPC)
     A                                      TEXT('Message Type')
     A                                      COLHDG('Msg' +
     A                                             'Type')
      *
     A            ZZ020     R
      *
     A            RMWKID    R               REFFLD(DPPC)
     A                                      TEXT('Workstation Id')
     A                                      COLHDG('Wkstn' +
     A                                             'Id')
      *
     A            RMHMSS    R               REFFLD(ACST)
     A                                      TEXT('Host Message Severity')
     A                                      COLHDG('Host' +
     A                                             'Msg' +
     A                                             'Sev')
      *
     A            RMHMSI    R               REFFLD(DPPC)
     A                                      TEXT('Host Message Id')
     A                                      COLHDG('Host' +
     A                                             'Msg' +
     A                                             'Id')
      *
     A            RMHSMS    R               REFFLD(ENIP)
     A                                      TEXT('Host Message')
     A                                      COLHDG('Host' +
     A                                             'Msg')
      *
     A            ZZ015     R
      *
     A            RMWDAM    R               REFFLD(TRNO)
     A                                      TEXT('Withdrawal Amount')
     A                                      COLHDG('WD' +
     A                                             'Amt')
      *
     A            RMDPAM    R               REFFLD(TRNO)
     A                                      TEXT('Deposit Amount')
     A                                      COLHDG('Dep' +
     A                                             'Amt')
      *
     A            RMINAM    R               REFFLD(TRNO)
     A                                      TEXT('Interest Amount')
     A                                      COLHDG('Int' +
     A                                             'Amt')
      *
     A            RMINSN    R               REFFLD(AGBI)
     A                                      TEXT('Interest Sign')
     A                                      COLHDG('Int' +
     A                                             'Sgn')
      *
     A            RMBALN    R               REFFLD(TRNO)
     A                                      TEXT('Balance')
     A                                      COLHDG('Bal')
      *
     A            RMBLSN    R               REFFLD(AGBI)
     A                                      TEXT('Balance Sign')
     A                                      COLHDG('Bal' +
     A                                             'Sgn')
      *
     A            RMPLNO    R               REFFLD(ACSS)
     A                                      TEXT('Passbook Line Number')
     A                                      COLHDG('PB' +
     A                                            'Lin' +
     A                                             'No')
      *
     A            RMTRPD    R               REFFLD(BBCNUM)
     A                                      TEXT('Transaction Posting Date')
     A                                      COLHDG('Tran' +
     A                                             'Post' +
     A                                             'Date')
      *
     A            ZZ001A    R               REFFLD(ZZ001)
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
      *
     A            RMTRCN    R               REFFLD(CNAA)
     A                                      TEXT('Transaction Code Narr')
     A                                      COLHDG('Tran' +
     A                                             'Code' +
     A                                             'Narr')
      *
     A            RMCQSN    R               REFFLD(TRNO)
     A                                      TEXT('Cheque Serial No.')
     A                                      COLHDG('Chq' +
     A                                             'Ser' +
     A                                             'No.')
