      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas RE Failed Standing Orders Extract')
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  PF/RESTORPD - Failed Standing Orders Extract                 *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      *  Prev Amend No. CGL029             Date 23Mar04               *
      *                 CRE013  *CREATE    Date 28Jul03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase of Midas Account Code from 4 Bytes to 10   *
      *           Bytes. Recompile due to changes in MFRFL.           *
      *  CRE013 - Report of Failed Standing Orders.                   *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R RESTORD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
     A            STOR      R
     A            DRBR      R
      * Begin /CSD027/
     A**********  DCUS      R                                                                 CSD027
     A            DCUS           6A
     A                                      TEXT('Debit customer number')
     A                                      COLHDG('Debit               ' +
     A                                      'Cust.               ' +
     A                                      'Numb.')
      * End /CSD027/
     A            DACD      R
     A            DACS      R
     A            CBRC      R
      * Begin /CSD027/
     A**********  CCUS      R                                                                 CSD027
     A            CCUS           6A
     A                                      TEXT('Credit customer number')
     A                                      COLHDG('Credit              ' +
     A                                      'Customer            ' +
     A                                      'No.')
      * End /CSD027/
     A            CSCA      R               TEXT('CR Account Code')
     A                                      COLHDG('CR A/c Code')
     A            CACD      R               TEXT('CR A/c Seq No.')
     A                                      COLHDG('CR A/c Seq No')
     A            PNAR      R
     A            PCCY      R               REFFLD(CCY)
     A            PAMT      R               REFFLD(AFPY)
     A                                      TEXT('Payment Amount')
     A                                      COLHDG('Payment Amount')
     A            REJC      R               REFFLD(ZZ030)
     A                                      TEXT('Rejection Codes')
     A                                      COLHDG('Rejection Codes')
