      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas RE STANDING ORDERS EXECUTED TODAY')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Retail Module                                    *
     A*                                                               *
     A*  PF/SOEXSO - STANDING ORDERS - EXTRACT - DETAIL               *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      *  Prev Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 S01466             Date 22Mar94               *
      *                 S01413             Date 13Apr93               *
     A*                 LN0386             DATE 18JUN90               *
     A*                 S01117                  11MAR87               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits                  *
     A*  S01466 - BLI Retail Enhancements.                            *
     A*  S01413 - Header box standardised                             *
     A*  LN0386 - Incorporation of HK changes to fiels                *
     A*  S01117 - Multibranching                                      *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R SOEXSOF                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            RECI      R
     A            STOR      R
     A**                                                     /S01117/
     A****        BRCD      R
     A            DRBR      R
     A**                                                     /S01117/
      * Begin /CSD027/
     A**********  DCUS      R                                                                 CSD027
     A            DCUS           6A
     A                                      TEXT('Debit customer number')
     A                                      COLHDG('Debit               ' +
     A                                      'Cust.               ' +
     A                                      'Numb.')
      * End /CSD027/
     A**Start of change CGL029
     A**********  DACO      R               REFFLD(DACO0 )                                    CGL029
     A            DACOQQ    R               REFFLD(ACODQQ)
     A**End of change CGL029
     A            DACS      R
     A            DRAN      R
      * Begin /CSD027/
     A**********  CCUS      R                                                                 CSD027
     A            CCUS           6A
     A                                      TEXT('Credit customer number')
     A                                      COLHDG('Credit              ' +
     A                                      'Customer            ' +
     A                                      'No.')
      * End /CSD027/
     A**Start of change CGL029
     A**********  CACO      R                                                                 CGL029
     A            CACOQQ    R               REFFLD(ACODQQ)
     A**End of change CGL029
     A            CACS      R
     A            CRAN      R               REFFLD(CRAN0 )
     A            CCY       R
     A            PAMT      R
     A            CRNM      R
     A            PNAR      R
     A            PAYR      R
     A            PNAM      R
     A            FPAD      R
     A            SPAD      R
     A            PAYA      R
     A            METH      R
     A**                                                     /S01117/
     A            CBRC      R
     A            PRFC      R
     A**                                                     /LN0386/
     A**********  BRCA      R
     A            BRCA      R               TEXT('Transaction Branch')
     A                                      COLHDG('Trtn' 'brch')
     A**                                                     /LN0386/
     A*********              Start of change               /S01466/
     A            TRAT      R     A         REFFLD(TRAT)
     A                                      TEXT('Transaction Type')
     A*                      End of change                 /S01466/
     A            ZZ042     R
     A****        ZZ052     R
     A**                                                     /S01117/
     A**Start of change CGL029
     A            DACO      R               REFFLD(ACOD)
     A            CACO      R               REFFLD(ACOD)
     A**End of change CGL029
