      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GP Accounts Task Split index')                   *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing module                             *
      *                                                               *
      *  PF/ACTSIXPD - Accounts Task Split driver                     *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2009            *
      *                                                               *
      *  Last Amend No. AR1097467B         Date 17Apr13               *
      *  Prev Amend No. CGO001AA           Date 06Aug12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      *                 CGP013 *Create     Date 20Feb09               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  AR1097467B - Expected 15% COB run optimization not met       *
      *  CGO001AA - COB Restructure - GO COB Optimisation Phase 1     *
      *  CGP013 - Task Split for Accounts Global Update               *
      *                                                               *
      *****************************************************************
      ** Start of Change CGO001AA
     A**********                            REF(GZACCNTAB)                                  CGO001AA
     A**********R ACTSIXPDF                                                                 CGO001AA
      ** Start of Change AR1097467B
     A**********R ACTSDVPDF                 FORMAT(ACTSDVPD)
     A          R ACTSIXPD0
     A            NORE          10S 0       TEXT('No of records to process')
     A                                      COLHDG('No of Records' +
     A                                        'to Process')
      ** End of Change AR1097467B
      **********                                                                            CGO001AA
     A**********  CNUM      R                                                               CGO001AA
     A**********  CCY       R                                                               CGO001AA
     A**********  ACOD      R                                                               CGO001AA
     A**********  ACSQ      R                                                               CGO001AA
     A**********  BRCA      R                                                               CGO001AA
      **********                                                                            CGO001AA
     A**********K CNUM                                                                      CGO001AA
     A**********K CCY                                                                       CGO001AA
     A**********K ACOD                                                                      CGO001AA
     A**********K ACSQ                                                                      CGO001AA
     A**********K BRCA                                                                      CGO001AA
      ** End of Change CGO001AA
