      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GO Bulk Sync of GZSDACUSPD - TS Index File')     *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing module                             *
      *                                                               *
      *  PF/ACUSIXPD - Customer Task Split Index                      *
      *                                                               *
      *  (c) Finastra International Limited 2012                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. MD020205 *CREATE   Date 24Apr13               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  MD020205 - Continuous CoB run time improvement               *
      *                                                               *
      *****************************************************************
     A          R ACUSIXPD0
     A            NORE          10S 0       TEXT('No of records to process')
     A                                      COLHDG('No of Records' +
     A                                        'to Process')
