      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GO Subsystem Data File')                         *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing                                    *
      *                                                               *
      *  GOSBSDPD - Midas GO Subsystem Data File                      *
      *                                                               *
      *  (c) Finastra International Limited 2013                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. MD020696 *CREATE   Date 03Jun13               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  MD020696 - Dashboard doesn't show proper value of Jobs in    *
      *             MSGW status. Use API to get active jobs from sub- *
      *             system instead of using the spooled file from     *
      *             WRKACTJOB *PRINT                                  *
      *                                                               *
      *****************************************************************
      *
     A          R GOSBSDD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2013')
      *
     A            FSUBSYS       10A         TEXT('Subsystem')
     A                                      COLHDG('Subsystem')
     A            FJOBNAM       10A         TEXT('Job Name')
     A                                      COLHDG('Job' 'Name')
     A            FJOBUSR       10A         TEXT('Job User')
     A                                      COLHDG('Job' 'User')
     A            FJOBNBR        6A         TEXT('Job Number')
     A                                      COLHDG('Job' 'Number')
     A            FJOBSTAT       4A         TEXT('Job Status')
     A                                      COLHDG('Job' 'Stat')
      *
