      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_NM                                                        *
/*EXI *  TEXT('Midas GO SD Customer details file task splitdriver')   *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing module                             *
      *                                                               *
      *  PF/SDCUDVPD - Midas GO SD Customer details file task split   *
      *                driver                                         *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2012            *
      *                                                               *
      *  Last Amend No. CGP017 *CREATE     Date 06Aug12               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  CGP017 - Global Layer - GOC0100 Task Split                   *
      *                                                               *
      *****************************************************************
     A          R SDCUDVF                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2012')
 
     A            GLFERN        10P 0       TEXT('From RRN Number')
     A                                      COLHDG('From' 'RRN' 'Number')
     A            GLTERN        10P 0       TEXT('To RRN Number')
     A                                      COLHDG('To' 'RRN' 'Number')
