      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GO SD Customer details file task split index')   *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing module                             *
      *                                                               *
      *  PF/SDCUIXPD - Midas GO SD Customer details file task split   *
      *                index                                          *
      *                                                               *
      *  (c) Finastra International Limited 2012                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CGP017 *CREATE     Date 06Aug12               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGP017 - Global Layer - GOC0100 Task Split                   *
      *                                                               *
      *****************************************************************
     A          R SDCUIXF                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2012')
 
     A            GLFRRN        10P 0       TEXT('From RRN Number')
     A                                      COLHDG('From' 'RRN' 'Number')
     A            GLTRRN        10P 0       TEXT('To RRN Number')
     A                                      COLHDG('To' 'RRN' 'Number')
