     H        1
      *****************************************************************
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas LE Facilities Maintenance Today Report')         *
     F*****************************************************************
     F*                                                               *
     F*  Midas - Customer Lending Module                              *
     F*                                                               *
     F*  LE0300 - FACILITIES INPUT TODAY PRINT                        *
     F*                                                               *
     F*  Function - Checks FCLTY1 for LCD equal to rundate. If so,    *
     F*             outputs the following :                           *
     F*             a) If facility amount changed, output new amount  *
     F*                and previous amount from facility history file.*
     F*                Will show RVCD date if *NE 0 (date RVCD chgd). *
     F*             b) If amount not changed, but RVCD changed today, *
     F*                only one amount shown, and date revolving CR   *
     F*                indicator changed.                             *
     F*             c) If RVCD *GT 0 and LCD equals RUND, date of last*
     F*                change shown when amount changes.              *
     F*                                                               *
     F*  Called by - CLP/LEC0601A                                     *
     F*                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. CSD103             Date 10Aug20               *
      *  Prev Amend No. MD046248           Date 27Oct17               *
      *                 MD020563           Date 21May13               *
      *                 AR1097176          Date 22Mar13               *
      *                 CFC006             Date 06Aug12               *
      *                 CLE148             Date 23Jul12               *
      *                 AR787620           Date 10Jun11               *
      *                 AR750770           Date 28Apr11               *
      *                 AR744372           Date 15Apr11               *
      *                 CER059             Date 19Jul10               *
      *                 CER020             Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *                 248525             Date 15Jun07               *
      *                 246031A            Date 24Apr07               *
      * Midas Plus 1.4 Base ------------------------------------------*
      *                 246031             Date 28Feb07               *
      *                 236008             Date 03Nov06               *
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 BUG12715           Date 27Nov06               *
      *                 242371             Date 20Sep06               *
      *                 242053             Date 20Sep06               *
      *                 242326             Date 16Sep06               *
      *                 CSD031             Date 10Apr06               *
      *                 CSD027A            Date 10May06               *
      *                 BUG11201           Date 10Apr06               *
      *                 CSD027             Date 09Dec05               *
      *                 BUG10505           Date 10Feb06               *
      *                 CLE042             Date 06Sep05               *
      *                 BUG10267           Date 01Feb06               *
      *                 CER001             Date 25Apr05               *
      *                 BUG8943            Date 12Oct05               *
      *                 CLE106             Date 22Feb05               *
      *                 CSW037A            Date 02May05               *
      *                 CLE041             Date 11Oct04               *
      *                 CSD025             Date 11Jan05               *
      *                 CSW037             Date 15Dec04               *
      *                 CSW036             Date 15Dec04               *
      *                 BUG4166            Date 06Sep04               *
      *                 BUG3781            Date 23Jul04               *
      *                 CFX001             Date 20Oct03               *
      *                 CLE025             Date 20Oct03               *
      *                 CLE024             Date 20Oct03               *
      *                 CLE039             Date 20Oct03               *
      *                 CGL029             Date 01Sep03               *
      *                 CLE029             Date 24Sep02               *
      *                 CLE034             Date 05May03               *
      *                 CLE031             Date 03Feb03               *
      *                 CLE028             Date 27Jun02               *
      * Midas Release 4.01.03 ----------------------------------------*
      *                 201127             Date 20Jan03               *
      *                 196066             Date 10Jan03               *
      *                 208458             Date 27Jun02               *
      * Midas Release 4.01 -------------------------------------------*
      *                 CLE015             Date 13Dec01               *
      *                 193603             Date 31Aug01               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 189544             Date 01May01               *
      * Midas DBA 3.05 -----------------------------------------------*
      *                 187663             Date 17Jan01               *
      * Midas DBA 3.04 -----------------------------------------------*
      *                 171784             Date 01Aug00               *S01392
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CLE008             Date 10Dec98               *
      *                 147261             Date 27Jan99               *
      *                 147935             Date 17Dec98               *
      *                 149036             Date 07Dec98               *
      *                 141486             Date 18Feb99               *
      *                 149037             Date 15Feb99               *
      *                 140832             Date 15Feb99               *
      *                 138352             Date 11Feb99               *
      *                 136106             Date 11Feb99               *
      *                 135745 (BT0779)    Date 11Feb99               *
     F*                 CLE005             Date 22May97               *
     F*                 CLE007             Date 22May97               *
     F*                 122653             Date 05Sep97               *
     F*                 CLE006             Date 02Dec96               *
     F*                 CLE004             Date 02Dec96               *
     F*                 S01408             DATE 06SEP96               *  *S01392
     F*                 S01408             DATE 05SEP95               *  *S01392
     F*                 S01408             DATE 25MAY95               *
     F*                 S01408             DATE 13DEC94               *
     F*                 072062             DATE 07OCT94               *
     F*                 059790             DATE 05APR94               *
     F*                 058449             DATE 09MAR94               *
     F*                 060978             DATE 23NOV93               *
     F*                 S01392             DATE 30SEP92               *
     F*                 MOF60              DATE 21FEB92               *
     F*                 BHF064             DATE 17MAY90               *
     F*                 S01194             DATE 02JAN90               *
     F*                 S01117             DATE 21/06/89              *
     F*                                                               *
     F*---------------------------------------------------------------*
      *                                                               *
      *  CSD103 - LIBOR Deregulation - Common Layer/Standing Data     *
      *  MD046248 - Finastra Rebranding                               *
      *  MD020563 - CFC006 issues                                     *
      *  AR1097176 - Accessing AOCOMR0 multiple times slows down the  *
      *              system                                           *
      *  CFC006 - COB Restructure - Remove reports from COB           *
      *  CLE148 - Alpha Loan Reference (Recompile)                    *
      *  AR787620 - Hooks Incorporation                               *
      *             WNCPYSRC,LEH00126                                 *
      *             WNCPYSRC,LEH00090                                 *
      *             WNCPYSRC,LEH00127                                 *
      *             WNCPYSRC,LEH00128                                 *
      *             WNCPYSRC,LEH00091                                 *
      *             WNCPYSRC,LEH00129                                 *
      *             WNCPYSRC,LEH00125                                 *
      *             WNCPYSRC,LEH00094                                 *
      *             WNCPYSRC,LEH00092                                 *
      *             WNCPYSRC,LEH00130                                 *
      *             WNCPYSRC,LEH00095                                 *
      *             WNCPYSRC,LEH00093                                 *
      *             WNCPYSRC,LEH00131                                 *
      *             WNCPYSRC,LEH00096                                 *
      *  AR750770 - New Frequencies on Rollover Types field not dis-  *
      *             played in Facilities Input Today (Child: AR750771)*
      *  AR744372 - The report program attempted WRITE operation to   *
      *             a closed printer file LE0300P1 (Child: AR744373)  *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER020 - Enhanced Rollover Window: Upgrade FGE089 to         *
      *           Midas Plus                                          *
      *  248525 - Dump in LE000020 when Parent Group is 0.            *
      *  246031A- Closing date should be displayed instead of date    *
      *           committed.                                          *
      *  246031 - Print approval date whether facility is tranche     *
      *           or not.                                             *
      *  236008 - When trailer does not match, do not halt COB.       *
      *           Show audit report for information purposes only.    *
      *  BUG12715 - LE0300P2740579-Error in some data in Syndicated   *
      *             Facilities Maintenance Today report               *
      *  242371 - Print 'ALL' instead of 'NONE' for eligible          *
      *           customers of a multi-customer facility.             *
      *  242053 - Apply GEMS 218552.                                  *
      *  242326 - The report program attempted WRITE operation to     *
      *           a closed printer file LE0300P1.                     *
      *  CSD031 - Enhanced Centralised Static Data (Recompile)        *
      *  CSD027A - Conversion Of Customer Number to Alpha             *
      *  BUG11201 - Tried to write to a close file in LE0300          *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  BUG10505-Tried to write to a close file in LE0300            *
      *  CLE042 - Extended Loan Sub Type                              *
      *  BUG10267-No extension field due to SynMan Merger.            *
      *           Indicator 60 should not be use for both             *
      *           CLE106(SYNMAN) and CER001(LUX)                      *
      *  CER001 - LUX Upgrade to MidasPlus                            *
      *           IML Circular 97/138                                 *
      *           Internalize IML/IBLC                                *
      *  BUG8943 - Print Base Rate when CLE035 is switched on.        *
      *  CLE106 - Syndication Manager                                 *
      *  CSW037A- Additional Field extended to 40 chars (recompile)   *
      *  CLE041 - Collateralised Lending Phase 2B                     *
      *  CSD025 - Customer De-Activation                              *
      *  CSW037 - Additional Field Data on MT300/MT320                *
      *  CSW036 - Dual SWIFT BIC held on Client Details               *
      *  BUG4166 - Incorrect format of Penalty field in LE0300P1      *
      *            report if penalty type is defined as 'P'.          *
      *            Applied fix 224715.                                *
      *  BUG3781 - Incorrect customer is being shown in the facility  *
      *            customer.                                          *
      *  CFX001 - FX Margin Trading                                   *
      *  CLE025 - Credit Lines                                        *
      *  CLE024 - Collateralised Lending                              *
      *  CLE039 - General LE Enhancement                              *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CLE029 - Severity Codes.                                     *
      *           Under the core switchable feature CLE029            *
      *  CLE034 - Lending Enhancements Phase 1 Priority 1A            *
      *  CLE031 - Lending Enhancements.                               *
      *  CLE028 - Flat Rate Personal Loans (Rule of 78s)              *
      *  201127 - Reports should show Start Date instead of Approved  *
      *           Date. LE0300P1 changed in O-specs, & corresponding  *
      *           changes were also made in the printer file LE0300P2.*
      *  196066 - Insert/Amend/Authorise user blank when CLE002 is    *
      *           off. Fix is to only display the fields when CLE002  *
      *           (Authorisation) feature is switched on.             *
      *  208458 - Unable to display some fields in LE0300P1 correctly *
      *  CLE015 - Functionality moved from Syndicated Lending to      *
      *           Customer Lending                                    *
      *  193603 - Hash total must take account of negative FAMT       *
     F*  189544 - Amended CR/AG customer to be displayed when CLE005  *
     F*           is switched on.  Also included, date approved, CR/AG*
     F*           exch rate and indicator                             *
      *  187663 - Do not print LE0300P2 if Syndicated Lending         *
      *           Enhancement CLE006 is switched off.                 *
      *  171784 - Report shows negative facility amounts as positive. *
     F*           Add negative sign to edit word of facility amounts. *
      *  CLE008 - Loan administration I.D. Amendments                 *
      *  147261 - Add Assignment or Participation indicator           *
      *  147935 - Addition of insert, authorise and amend user        *
      *           profiles to lending reports                         *
      *  149036 - Recompiled due to changes in LF/FCLTY1              *
      *  141486 - LE0300P1 does not have info of CA's and TR's        *
      *  149037 - LE0300P2 needs clean up.                            *
     F*  140832 - All Participant details not shown on report.        *
      *  138352 - LE0300-facility listed in synd(P2) and regular (P1) *
      *           report                                              *
     F*  136106 - LE0300P2 Printer Problems                           *
     F*  135745 - D/B error in German Returns SAR - change to         *
     F*           WNCPYSRC LE0300CN01 needed to exclude (BT0779)      *
     F*           participant and internal facilities                 *
     F*  CLE005 - Customer Lending Enhancements - Tranche 3           *
     F*  CLE007 - Customer Lending Enhancements - Others              *
     F*  122653 - Recompiled over amended LE0300P2                    *
     F*  CLE006 - Customer Lending Enhancements - Rollovers           *
     F*  CLE004 - Customer Lending Enhancements - Syndications        *
     F*  S01408 - Addition of core hooks LE0300CCP3                   *
     F*  S01408 - Addition of core hooks LE0300CCP1                   *
     F*                                  LE0300CCP2                   *
     F*  S01408 - Addition of core hooks LE0300OOP1                   *
     F*                                  LE0300CCPG                   *
     F*  S01408 - Addition of core hooks LE0300FFPG                   *
     F*                                  LE0300IIPG                   *
     F*                                  LE0300CEIP                   *
     F*                                  LE0300CPDR                   *
     F*                                  LE0300OOPG                   *
     F*  072062 - Report Bill/Telex ind. and Billing days             *
     F*  059790 - Customer may be deleted on same day as facility     *
     F*  058449 - Report incorrectly shows that revolving credit      *
     F*           indicator changed. To fix, initialize ind to zero.  *
     F*  060978 - Previous Facility Amount printed incorrect.         *
     F*  S01392 - JAPANESE SUB MODULE ENHANCEMENTS                    *
     F*  MOF60  - CUSTOMER PROFITABILITY & FEES PROCESSING            *
     F*           REMOVAL OF COMMITMENT FEE DETAILS & INCLUSION       *
     F*           OF PREVIOUS FACILITY AMNT & REVOLVING CREDIT        *
     F*           INDICATOR ON PRINT FILE                             *
     F*  BHF064 - SHOULD PRINT OUT CUSTOMER NUMBER                    *
     F*  S01194 - STANDING DATA CHANGES.                              *
     F*  S01117 - MULTIBRANCHING                                      *
     F*                                                               *
     F*****************************************************************
     F*                                                               *
     F*  C R E A T I O N     P A R A M E T E R S                      *
     F*                                                               *
     F*                                                               *
     F*****************************************************************
     F*CLTY***UP* F     256 12AI     2 DISK                               S01117
     FFCLTY1  IP  E           K        DISK                               S01117
     FLEAGFYJ0IS  E           K        DISK                           U1                      CLE041
     FFCLTYZZ US  F     256            DISK                               S01117
     FLEAGFZPDUF  E                    DISK                                                   CLE041
     F            FCLTYZZF                          KRENAMEAGFCTYZF                           CLE041
     FHISUPD  IF  E           K        DISK                               MOF60
     F************FACHISAF                          KIGNORE        MOF60  060978
     F            HISACTF                           KIGNORE               060978
     FLEAGHSL0IF  E           K        DISK                                                   CLE041
     F*CLINT***IF  F     256  7AI     2 DISK                              S01194
     F*TABLE***IF  F      96 12AI     2 DISK                              S01194
      *                                                                   CLE004
     FLEPARTL3IF  E           K        DISK                               CLE004
      ** Participant Details                                              CLE004
      *                                                                   CLE004
     FLEFCLTLGIF  E           K        DISK                                                   CLE039
      ** LE Facility Extension Detail File                                                    CLE039
      *                                                                                       CLE039
     FLEAGFYL4IF  E           K        DISK                                                   CLE041
     F            LEFCLTD0                          KRENAMEAGFCTYD0                           CLE041
      ** LE Aggregate Facility Extension Detail File                                          CLE041
      *                                                                                       CLE041
     F*E0300P1O   F     132     OF     PRINTER                      S01124S01117
     FLE0300P1O   F     132     OF     PRINTER      KINFDS SPOOL      UC  S01117
     FLE0300P3O   F     132     OG     PRINTER      KINFDS SPOOL3     UC                      CLE041
     FLE0300AUO   F     132     OA     PRINTER      KINFDS SPOOLU         S01117
      *                                                                   CLE004
     F***LE0300P2O   E                    PRINTER      KINFDS SPOOL2     UC            CLE004 CLE039
     FLE0300P2O   E             55     PRINTER      KINFDS SPOOL2     UC                      CLE039
      ** Syndicated Facilities printer file                               CLE004
     F*                                                                   S01408
     F/COPY WNCPYSRC,LE0300FFPG                                           S01408
     F*                                                                   S01408
     FLEFCX2L0UF  E           K        DISK                      A                            CER001
      ** ER Facilities details - LUX Extension File                                           CER001
     F*****************************************************************   MOF60
     F*
     F* ID F  C  H  L    FUNCTION OF INDICATORS
     F**01************FCLTY*-FILE*HEADER****                              S01117
     F* 02                  -DETAIL RECORD 'A', LIVE
     F* 03                  -  "      "     "   REVERSED/CLOSED
     F* 04                  -  "      "     "   EXPIRED
     F* 05                  -  "      "    'B', LIVE
     F* 06                  -  "      "     "   REVERSED/CLOSED
     F* 07                  -  "      "     "   EXPIRED
     F* 08                  - TRAILER
     F**09******      CLIENT FILE- CUSTOMER STANDING DATA RECORD          S01194
     F**10******      TABLE FILE - INST. CONTROL DATA REC.1               S01194
     F**11******        "    "   - CURRENCIES RECORD 1                    S01194
      *       11      Difference in trailer file values.                                      236008
     F*
     F*       12      WORK INDICATOR, LIVE RECORDS
     F*       13      CLE034 is installed                                                     CLE034
     F*       15      SHOW CCY ROLLOVER DETAILS                           CLE015
     F*       16      CLE039 is installed                                                     CLE039
     F*       17      CLE024 is installed                                                     CLE024
     F*       18      CFX001 or CLE025 is installed                                           CFX001
     F*       19      CLE106 installed & Risk Participant                                     CLE106
     F*
     F*       20      FIRST CYCLE INDICATOR
     F*       22      ACTIONED TODAY
     F*       24      INSERTED RECORD
     F*       25      AMENDED RECORD
     F*       26      REVERSED OR CLOSED RECORD
     F*       27      WORK INDICATOR- RECORDS IN CORRECT SEQUENCE
     F********28*      "       "     - FAC/CMMT IND = C                   MOF60
     F********29*     CMMT FEE DETAILS TO BE BLANK ON REPORT              MOF60
     F*       28      CLE005 is ON                                        CLE005
     F*       29      CLE007 is ON                                        CLE007
     F*       30      OUTPUT INDICATOR
     F*       31      FILE CONTROLS BALANCE
     F*       33      MULTIBRANCHING INDICATOR = NO                       S01117
     F*       34      NO INPUT TODAY
     F*       35      0 DECIMAL PLACES
     F*       36      1 DECIMAL PLACES
     F*       37      2 DECIMAL PLACES
     F*       38      3 DECIMAL PLACES
     F*       39      CLE002 is ON                                                            196066
     F********40*     CHAIN TO CLIENT FILE FAILED                         S01194
     F********41*     CHAIN TO TABLE FILE FAILED                          S01194
     F*       43      Print 'ELIGIBLE CUSTOMERS:' in LE0300P1 / Overflow indicator            CLE039
     F*       44      Print column 2 eligible customer details in LE0300P1                    CLE039
     F*       45      Print eligible customers for facility                                   CLE039
     F*       47      Print Customer Group                                                    CLE039
     F*       46      Chain to LEPARTL3                                   CLE004
     F*       48      Print Multi-currency rollover details               CLE004
     F*       49      Participant Loan                                    CLE004
     F*       50      DATE TO BE PRINTED ON REPORT
     F*       51        "          "         "
     F*       52        "          "         "
     F*       53        "          "         "
     F*       54      Print 'ELIGIBLE CUSTOMERS:' in LE0300P2                                 CLE039
     F*       55      Overflow indicator for LE0300P2                                         CLE039
     F*       56      Print column 2 eligible customer details in LE0300P2                    CLE039
     F*       57      End of file indicator for LEFCLTLG                                      CLE024
     F********54******  "          "         "                            MOF60
     F********55******  "          "         "                            MOF60
     F********56******  "          "         "                            MOF60
     F********57******BILLING DAYS "         "                            MOF60
     F*       58      REVIEW DAYNO "         "
     F********59******BASE RATE    "         "                            MOF60
     F********60******BILL DAYNO   "         "                            MOF60
     F*       59      CLE106 installed & Internal Participant                                 CLE106
     F*       60      CLE106 installed & Sub Participant                                      CLE106
     F*       61      CLE008 IS ON-indicator for loan admin i.d           CLE008
     F*       62      ULX004 installed                                                      BUG10267
     F*       65      EDIT INDICATOR FOR FILE CONTROLS
     F*       66      EXCEPTION OUTPUT - FILE CONTROLS
     F********67**********"*******"****-*"NO*INPUT*TODAY"****             S01117
     F*       67      FILE CONTROLS HAS ALREADY BEEN PRINTED              S01117
     F*       70      Database Error                                      CLE004
     F********71******CHAIN FAIL                                    S01117MOF60
     F*       71      End of Report for Branch line for LE0300P2          CLE004
     F*       72      COUNT FOR 'A' FCLTY REC IF OFF, 'B' IF ON           S01117
     F*       74      SOME DETAILS REPORT ON ANY P1 SPOOL                 S01117
     F*       75      SOME DETAILS REPORT ON CURRENT P1 SPOOL             S01117
     F*       76      ORIGINATING BRANCH NOT USED                         S01117
     F*       77      PROFIT CENTRE NOT USED                              S01117
     F*       78      OUTPUT PREVIOUS FCLTY AMT FROM HISTORY FILE         MOF60
     F*       79      REVOLVING CREDIT INDICATOR HAS CHANGED              MOF60
     F*       81      Output Date Committed                               CLE004
     F*       82      Output Closing Date                                 CLE004
     F*       83      Output Last Availability Date                       CLE004
     F*       84      Output Joining Date                                 CLE004
     F*       85      Risk Participant                                    140832
     F*       88      RECORD NOT FOUND ON HISTORY FILE                    MOF60
     F*
     F********98******USED IN ZSYSTM - DATE FORMAT MMDDYY                 MOF60
     F*       98      SYSTEM DATE FORMAT                                  MOF60
     F*       99      USED IN SUBROUTINES
     F*          U7+U8DATABASE ERROR
     F*          U8   FILE CONTROLS OUT OF BALANCE
     F*          L1   LEVEL BREAK ON BRCA                                 S01117
     F*
     F*****************************************************************   MOF60
     F/SPACE 3                                                            MOF60
     F*****************************************************************   MOF60
     F*                                                                   MOF60
     F*  S U B R O U T I N E   I N D E X                                  MOF60
     F*                                                                   MOF60
     F*  DETA   - Detail 'A' Record Processing                            MOF60
     F*  DETB   - Detail 'B' Record Processing                            MOF60
     F*  COUNT  - Subroutine to Count Records Input (A & B)               MOF60
     F*  GLZADD - Subroutine to add an amount (ZZAMT) to the total        MOF60
     F*           (ZZTOTI, ZZTOTD)                                        MOF60
     F*  GLZSUM - Subroutine to Carry Out the Addition for Subroutines    MOF60
     F*           GLZADD, GLZSUB, GLZCMP                                  MOF60
     F*  ZDATE2 - To Convert a Day Number to Date Formats                 MOF60
     F*  TRLR   - Trailer Processing                                      MOF60
     F*  UPDATE - If Controls Balance, Update Trailer Record              MOF60
     F*  *PSSR  - Subroutine to Handle Abnormal Error Conditions          MOF60
     F*                                                                   MOF60
     F*****************************************************************   MOF60
     F/EJECT                                                              MOF60
     E                    ARELIG    133  6                                                    CLE039
      ** Array to contain the Eligible Customers                                              CLE039
      *                                                                                       CLE039
     E                    ACG        20  1                                                    CLE039
      ** Array to contain the Customer Group (per character)                                  CLE039
      *                                                                                       CLE039
     E                    CPY@    1   1 80                                MOF60
     E/COPY ZSRSRC,ZDATE2Z1                                               S01392
      *                                                                   CLE004
     E/COPY ZSRSRC,ZFRPEDZ1                                               CLE004
      ** Arrays to contain the input and output fields.                   CLE004
      *                                                                   CLE004
     E/COPY ZSRSRC,ZEDITZ1                                                CLE004
      ** Arrays to contain the input and output fields.                   CLE004
      *                                                                   CLE004
     E********************CPY@    1   1 80                                MOF60
     E**
     F/EJECT                                                              MOF60
     I*
     I*****FACILITIES FILE - HEADER RECORD                                S01117
     I***********                                                         S01117
     I*CLTY***NS* 01   1 CH                                               S01117
     I***********                             1   1 RECI                  S01117
     I***********                                                         S01117
     I*****FACILITIES FILE - DETAIL RECORD 1                              S01117
     I***********                                                         S01117
     I********NS* 02   1 CD  13 CA                                        S01117
     I*******OR** 03   1 CR  13 CA                                        S01117
     I*******OR**      1 CC  13 CA                                        S01117
     I*******OR** 04   1 CE  13 CA                                        S01117
     I***********                             1   1 RECI                  S01117
     I***********                             2   70CNUM                  S01117
     I***********                             8  100FACT                  S01117
     I***********                            11  120FCNO                  S01117
     I***********                            13  13 RCTP                  S01117
     I***********                            14  160BRCD                  S01117
     I***********                            17  17 FCTI                  S01117
     I***********                            18  20 FCCY                  S01117
     I***********                         P  21  270FAMT                  S01117
     I***********                         P  28  303OVPC                  S01117
     I***********                         P  31  330DTAP                  S01117
     I***********                         P  34  360DTEX                  S01117
     I***********                            37  37 RVCR                  S01117
     I***********                            38  38 SECI                  S01117
     I***********                            39  39 MCCY                  S01117
     I***********                            40  40 MCSI                  S01117
     I***********                            41  41 NACD                  S01117
     I***********                            42  43 CRSK                  S01117
     I***********                         P  44  460DLFS                  S01117
     I***********                         P  47  527NOMR                  S01117
     I***********                         P  53  550RVDT                  S01117
     I***********                            56  56 RVFR                  S01117
     I***********                            57  580RVDY                  S01117
     I***********                            59  93 NAR1                  S01117
     I***********                            94 128 NAR2                  S01117
     I***********                           129 163 NAR3                  S01117
     I***********                           164 198 NAR4                  S01117
     I***********                         P 199 2050MTDH                  S01117
     I***********                         P 206 2120MTDL                  S01117
     I***********                         P 213 2190MTDA                  S01117
     I***********                         P 220 2270QTDA                  S01117
     I***********                         P 228 2350YTDA                  S01117
     I***********                           236 237 ACOF                  S01117
     I***********                           238 240 ORBR                  S01117
     I***********                         P 247 2490ORED                  S01117
     I***********                         P 250 2520LCD                   S01117
     I***********                           253 253 CHTP                  S01117
     I***********                         P 254 2560TNLU                  S01117
     I***********                             1  12 DSA1                  S01117
     I***********                                                         S01117
     I*****FACILITIES FILE - DETAIL RECORD 2                              S01117
     I***********                                                         S01117
     I********NS* 05   1 CD  13 CB                                        S01117
     I*******OR** 06   1 CR  13 CB                                        S01117
     I*******OR**      1 CC  13 CB                                        S01117
     I*******OR** 07   1 CE  13 CB                                        S01117
     I***********                             1   1 RECI                  S01117
     I***********                             2   70CNUM                  S01117
     I***********                             8  100FACT                  S01117
     I***********                            11  120FCNO                  S01117
     I***********                            13  13 RCTP                  S01117
     I***********                            14  14 CMFT                  S01117
     I***********                            15  150CALC                  S01117
     I***********                         P  16  217SPRD                  S01117
     I***********                            22  230BCOD                  S01117
     I***********                         P  24  297BRAT                  S01117
     I***********                         P  30  320STDT                  S01117
     I***********                         P  33  350EDDT                  S01117
     I***********                         P  36  380DUDT                  S01117
     I***********                            39  39 BLFR                  S01117
     I***********                            40  410BLDN                  S01117
     I***********                            42  42 BTIN                  S01117
     I***********                            43  440BLDY                  S01117
     I***********                            45  460SETT                  S01117
     I***********                            47  58 OBAC                  S01117
     I***********                            59  68 TNAC                  S01117
     I***********                         P  69  710SLCD                  S01117
     I***********                         P  72  740ACCD                  S01117
     I***********                         P  75  810ADNP                  S01117
     I***********                         P  82  880PDTD                  S01117
     I***********                         P  89  950AFPD                  S01117
     I***********                         P  96 1020ADJP                  S01117
     I***********                         P 103 1090ADJN                  S01117
     I***********                         P 110 1160TOTD                  S01117
     I***********                         P 117 1230CAMD                  S01117
     I***********                         P 124 1300HFAM                  S01117
     I***********                         P 147 1490RUN0                  S01117
     I***********                         P 150 1520RUN1                  S01117
     I***********                         P 153 1550RUN2                  S01117
     I***********                         P 156 1580RUN3                  S01117
     I***********                         P 159 1610RUN4                  S01117
     I***********                         P 162 1640RUN5                  S01117
     I***********                         P 165 1670RUN6                  S01117
     I***********                         P 168 1700RUN7                  S01117
     I***********                         P 171 1730RUN8                  S01117
     I***********                         P 174 1760RUN9                  S01117
     I***********                         P 177 1830OAM1                  S01117
     I***********                         P 184 1900OAM2                  S01117
     I***********                         P 191 1970OAM3                  S01117
     I***********                         P 198 2040OAM4                  S01117
     I***********                         P 205 2110OAM5                  S01117
     I***********                         P 212 2180OAM6                  S01117
     I***********                         P 219 2250OAM7                  S01117
     I***********                         P 226 2320OAM8                  S01117
     I***********                         P 233 2390OAM9                  S01117
     I***********                         P 240 2460OA10                  S01117
     I***********                         P 247 2490ORED                  S01117
     I***********                         P 250 2520LCD                   S01117
     I***********                           253 253 CHTP                  S01117
     I***********                         P 254 2560TNLU                  S01117
     I***********                             1  12 DSB1                  S01117
     I*                                                                   S01117
     IFCLTYF                                                              S01117
     I***  FACILITIES FILE - DETAILS                                      S01117
     I                                              BRCA  L1              S01117
     I              LCD                             LCDA                  S01117
     I              CHTP                            CHTPA                 S01117
     I              RECI                            RECIA                 S01117
     I              CNUM                            CNUMA                 S01117
     I              FACT                            FACTA                 S01117
     I              FCNO                            FCNOA                 S01117
     ILEPARTD0                                                            CLE004
      ** Participant Details File.                                        CLE004
     I*                                                                   CLE004
     I              PCRF                            PCRF2                 CLE004
     I              PRTR                            PRTR2                                     CLE106
     I*
     I********NS* 08   1 CT                                               S01117
     IFCLTYZZ NS  08   1 CT                                               S01117
     I***  FACILITIES FILE - TRAILER RECORD
     I*
     I                                        1   1 RECI
     I                                    P  17  190NORE
     I                                    P  20  220FLSZ
     I                                    P  23  250NLRB
     I                                    P  26  280NINS
     I                                    P  29  310NDEL
     I                                    P  32  340NLRA
     I                                    P  35  420VLBF
     I                                    P  43  440VLBL
     I                                    P  45  520VRIF
     I                                    P  53  540VRIL
     I                                    P  55  620VRDF
     I                                    P  63  640VRDL
     I                                    P  65  720VRAF
     I                                    P  73  740VRAL
     I                                    P  75  820VLAF
     I                                    P  83  840VLAL
     I                                    P 250 2520LCD
     I                                      253 253 CHTP
     I                                    P 254 2560TNLU
     I*
     I*
     I        NS
     I***  FACILITIES FILE - CATCH-ALL
     I*
     IAGFCLTYF    09                                                                          CLE041
      ** Aggregate Facility File - detail                                                     CLE041
      *                                                                                       CLE041
     I                                              BRCA  L1                                  CLE041
     I              LCD                             LCDA                                      CLE041
     I              CHTP                            CHTPA                                     CLE041
     I              RECI                            RECIA                                     CLE041
     I              CNUM                            CNUMA                                     CLE041
     I              FACT                            FACTA                                     CLE041
     I              FCNO                            FCNOA                                     CLE041
      *                                                                                       CLE041
     IAGFCTYZF                                                                                CLE041
      ** Aggregate Facilities File - Trailer Record                                           CLE041
      *                                                                                       CLE041
     I              RECI                            AGRECI                                    CLE041
     I              NORE                            AGNORE                                    CLE041
     I              NLRB                            AGNLRB                                    CLE041
     I              NINS                            AGNINS                                    CLE041
     I              NDEL                            AGNDEL                                    CLE041
     I              NLRA                            AGNLRA                                    CLE041
     I              VLBF                            AGVLBF                                    CLE041
     I              VLBL                            AGVLBL                                    CLE041
     I              VRIF                            AGVRIF                                    CLE041
     I              VRIL                            AGVRIL                                    CLE041
     I              VRDF                            AGVRDF                                    CLE041
     I              VRDL                            AGVRDL                                    CLE041
     I              VRAF                            AGVRAF                                    CLE041
     I              VRAL                            AGVRAL                                    CLE041
     I              VLAF                            AGVLAF                                    CLE041
     I              VLAL                            AGVLAL                                    CLE041
     I              LCD                             AGLCD                                     CLE041
     I              CHTP                            AGCHTP                                    CLE041
     I              TNLU                            AGTNLU                                    CLE041
     I/COPY WNCPYSRC,LEH00126
     I*
     I****CLIENT*FILE*-*CUSTOMER*STANDING*DATA*RECORD                     S01194
     I*
     I*CLINT***NS  09   1 CD   8 CA                                       S01194
     I**********                              1   1 RECI                  S01194
     I**********                              2   70CNUM                  S01194
     I**********                              8   8 RCDT                  S01194
     I**********                              9  28 CRNM                  S01194
     I**********                             29  38 CTWN                  S01194
     I**********                             39  48 CSNM                  S01194
     I**********                             49  56 CASK                  S01194
     I**********                             57  68 TELX                  S01194
     I**********                             69  80 CSID                  S01194
     I**********                             81  82 ACOC                  S01194
     I**********                             83  83 CBSI                  S01194
     I**********                             84  85 CCTZ                  S01194
     I**********                             86  87 CLOC                  S01194
     I**********                             88  930CPAR                  S01194
     I**********                             97  980LINS                  S01194
     I**********                             99 1010LIND                  S01194
     I**********                          P 102 1040DASU                  S01194
     I**********                          P 105 1070CDIC                  S01194
     I**********                          P 108 1100DADE                  S01194
     I**********                            111 111 CMIN                  S01194
     I**********                            112 112 CTYP                  S01194
     I**********                            113 124 TELF                  S01194
     I**********                            125 133 CHID                  S01194
     I**********                            134 136 CHAB                  S01194
     I**********                          P 250 2520LCD                   S01194
     I**********                            253 253 CHTP                  S01194
     I**********                          P 254 2560TNLU                  S01194
     I*
     I*****CLIENT*FILE*-*CATCHALL                                         S01194
     I*
     I********NS       1NCD                                               S01194
     I**********                              1   1 RECI                  S01194
     I*
     I*****TABLE*FILE*-*INSTALLATION*CONTROL*DATA*RECORD*1.               S01194
     I*
     I*TABLE***NS  10   2 C0   3 C1  12 C1                                S01194
     I*******AND      13 C0                                               S01194
     I**********                              1   1 RECI                  S01194
     I**********                              2   30RECT                  S01194
     I**********                             12  130RCDE                  S01194
     I**********                             14  66 TITL                  S01194
     I**********                             67  67 DATF                  S01194
     I***********                            68  700DFBR                  S01194
     I**********                             74  74 MODI1                 S01194
     I**********                             75  75 MODI2                 S01194
     I**********                             76  76 MODI3                 S01194
     I**********                          P  77  790RUND                  S01194
     I**********                             80  86 RUNA                  S01194
     I**********                             87  870SFLG                  S01194
     I**********                          P  90  920LCD                   S01194
     I**********                             93  93 CHTP                  S01194
     I**********                          P  94  960TNLU                  S01194
     I*
     I*
     I*****TABLE*FILE*-*CURRENCIES*RECORD*1.                              S01194
     I*
     I*TABLE***NS  11   1 CD   2 C2   3 C0                                S01194
     I*******AND      13 C1                                               S01194
     I**********                              1   1 RECI                  S01194
     I**********                              2   30RECT                  S01194
     I**********                             10  12 CCY                   S01194
     I**********                             13  130SREC                  S01194
     I**********                             14  27 CCNM                  S01194
     I**********                          P  28  348SPOT                  S01194
     I**********                             35  37 CCYS                  S01194
     I**********                             38  380CDP                   S01194
     I**********                             39  390TNOT                  S01194
     I**********                             40  40 DCCY                  S01194
     I**********                             41  44 SRC1                  S01194
     I**********                             45  48 SRC2                  S01194
     I**********                             49  520TACC                  S01194
     I**********                             53  560TEQV                  S01194
     I**********                             57  600SWQV                  S01194
     I**********                             61  640TAC4                  S01194
     I**********                             65  680TAC5                  S01194
     I**********                             69  69 HIND                  S01194
     I**********                          P  70  768PART                  S01194
     I**********                             77  780SSNO                  S01194
     I**********                          P  79  858ERLC                  S01194
     I**********                             86  860MDIN                  S01194
     I**********                             87  870MDIA                  S01194
     I**********                             88  880MDIB                  S01194
     I**********                             93  93 CHTP                  S01194
     I**********                          P  94  960TNLU                  S01194
     I*
     I*****TABLE*FILE*-*CATCH-ALL                                         S01194
     I*
     I********NS       1NCD                                               S01194
     I**********                              1   1 RECI                  S01194
     I**********                                                          MOF60
     I*****LOCAL DATA AREA FOR DATABASE ERROR REFERENCES                  MOF60
     I**********                                                          MOF60
     I*LDA********UDS                            256                      MOF60
     I***********                           134 138 DBFILE                S01117
     I***********                           139 167 DBKEY                 S01117
     I***********                           168 175 DBPGM                 S01117
     I***********                           176 177 DBASE                 S01117
     I***********                           134 141 DBFILE         S01117 MOF60
     I***********                           142 170 DBKEY          S01117 MOF60
     I***********                           171 180 DBPGM          S01117 MOF60
     I***********                           181 1830DBASE          S01117 MOF60
     I**                                                                  S01117
     ISPOOL       DS                                                      S01117
     I**   FILE INFORMATION DATA STRUCTURE                                S01117
     I**                                                                  S01117
     I                                       83  92 SFILE                 S01117
     I                                    B 123 1240SFNUM                 S01117
     I**                                                                  S01117
     ISPOOL2      DS                                                      CLE004
      ** File information data structure for LE0300P2                     CLE004
      *                                                                   CLE004
     I                                        9   9 OPEN2                 CLE004
     I                                       83  92 SFILE2                CLE004
     I                                    B 123 1240SFNUM2                CLE004
     I                                    B 188 1890OFLLN2                140832
     I                                    B 367 3680PRTLN2                140832
      *                                                                                       CLE041
     ISPOOL3      DS                                                                          CLE041
      ** File Information Data Structure                                                      CLE041
      *                                                                                       CLE041
     I                                       83  92 SFILE3                                    CLE041
     I                                    B 123 1240SFNUM3                                    CLE041
      *                                                                                       CLE041
     ISPOOLU      DS                                                      S01117
     I**   FILE INFORMATION DATA STRUCTURE                                S01117
     I**                                                                  S01117
     I                                       83  92 SFILEU                S01117
     I                                    B 123 1240SFNUMU                S01117
     I**                                                                  S01117
     I**********  DS                                               S01117 MOF60
     I**********                              1  12 DSA1           S01117 MOF60
     I**********                              1   1 RECIA          S01117 MOF60
     I**********                              2   70CNUMA          S01117 MOF60
     I**********                              8  100FACTA          S01117 MOF60
     I**********                             11  120FCNOA          S01117 MOF60
     I**********                                                   S01117 MOF60
     I**********  DS                                               S01117 MOF60
     I**********                              1  12 DSB1           S01117 MOF60
     I**********                              1   1 RECIB          S01117 MOF60
     I**********                              2   70CNUMB          S01117 MOF60
     I**********                              8  100FACTB          S01117 MOF60
     I**********                             11  120FCNOB          S01117 MOF60
      *                                                                   S01117
     I            DS                                                      MOF60
     I                                        1   50FCLTY                 MOF60
     I                                        1   30HFACT                 MOF60
     I                                        4   50HFCNO                 MOF60
     IPSDS       SDS                                                      MOF60
     I** PROGRAM STATUS DATA STRUCTURE - REQUIRED FOR DUMP                MOF60
     I                                      244 253 JOB                   MOF60
     I                                      254 263 USER                  MOF60
      *                                                                   CLE004
      ** Format amount returned by standard subroutine                    CLE004
     I                                        1  22 ZOUT22                CLE004
     I                                        4  21 ZOUT18                CLE004
     I                                        4  20 ZOUT17                CLE004
     I                                       21  21 ZNEG                  CLE004
     I/COPY ZSRSRC,ZFRPEDZ2                                               CLE004
      **                                                                  MOF60
     IRUNDT     E DSRUNDAT                                                MOF60
      **  DATA AREA RUNDAT                                                MOF60
     I              AGMRDT                          RUNA                  MOF60
     I              AGRDNB                          RUND                  MOF60
     I              AGSUC                           SSF                   MOF60
     I              AGDFF                           DATF                  MOF60
     I              AGMBIN                          MBIN                  MOF60
     I*                                                                   MOF60
     I**                                                                  MOF60
     ILDA       E DSLDA                                                   MOF60
      **  DATA AREA LDA                                                   MOF60
      *                                                                   MOF60
     ISDBRCH    E DSSDBRCHPD                                              S01117
      **  EXTERNAL DS FOR BRANCH CODE DETAILS                             S01117
     I              A8BRNM                          BRNM                  S01194
      **                                                                  S01117
     ISDGELR    E DSSDGELRPD                                              S01117
      **  EXTERNAL DS FOR GENERAL LEDGER DETAILS                          S01117
     I              BKPRCU                          PFCU                  S01194
     I              BKOBRU                          OBRU                  S01194
      *                                                                   S01194
     ISDCUST    E DSSDCUSTPD                                              S01194
      **  EXTERNAL DS FOR CUSTOMER DETAILS                                S01194
     I              BBCRNM                          CRNM                  S01194
     I              QQDFAC                          #DFAC1                                    CGL029
     I*                                                                   S01194
     ISDCURR    E DSSDCURRPD                                              S01194
      **  EXTERNAL DS FOR CURRENCY DETAILS                                S01194
     I              A6NBDP                          CDP                   S01194
      *                                                                   S01194
     ISDBANK    E DSSDBANKPD                                              S01194
      **  EXTERNAL DS FOR BANK DETAILS                                    S01194
     I              BJURPT                          TITL                  S01194
     I*                                                                   S01194
     IDSFDY     E DSDSFDY                                                 S01194
     I* FIRST DS FOR ACCESS PROGRAMS, SHORT DATA STRUCTURE                S01194
     I*                                                                   S01194
     IDSSDY     E DSDSSDY                                                 S01194
     I* SECOND DS FOR ACCESS PROGRAMS, LONG DATA STRUCTURE                S01194
     I*                                                                   S01194
     I*                                                                   S01408
     I***/COPY*WNCPYSRC,LE0300IIPG***                                                  S01408 CFC006
     I/COPY WNCPYSRC,LE0300IIPG                                                             MD020563
     I              'LE0300001'           C         SECTN                                     CFC006
     I*                                                                   S01408
      *                                                                                       CER001
      ** Data structure for key of LEFCX2PD file                                              CER001
      *                                                                                       CER001
     I            DS                                                                          CER001
     I**********                              1   60KCNUM                             CER001 CSD027A
     I                                        1   6 KCNUM                                    CSD027A
     I                                        7   7 WWFIL1                                    CER001
     I                                        8  100KFACT                                     CER001
     I                                       11  11 WWFIL2                                    CER001
     I                                       12  130KFCNO                                     CER001
     I                                        1  13 WWKEY                                     CER001
      **                                                           S01117 MOF60
     I*RUNDT*******DS                                              S01117 MOF60
      ****DATA*AREA*RUNDAT*****************************************S01117 MOF60
     I****************************************1   7 RUNA           S01117 MOF60
     I************************************P***8  100RUND           S01117 MOF60
     I***************************************11  11 SSF            S01117 MOF60
     I***************************************12  12 DATF           S01117 MOF60
     I***************************************13  13 MBIN           S01117 MOF60
     I**                                                           S01117 MOF60
     ISCSARD    E DSSCSARDPD                                              CLE004
      **  Switchable Features File                                        CLE004
      *                                                                   CLE004
     IDSELIG    E DSDSSDY                                                                     CLE039
      ** For Eligible Customers                                                               CLE039
     I              SDY1                            SDY1B                                     CLE039
     I              SDY2                            SDY2B                                     CLE039
     I              SDY3                            SDY3B                                     CLE039
     I              SDY4                            SDY4B                                     CLE039
      *                                                                                       CLE039
     C                     MOVEACPY@      BIS@   80
     C*
     C** PARAMETER LIST FOR PROGRAM 'AOCUSTR0'                            S01194
     C*                                                                   S01194
     C           PLIST1    PLIST                                          S01194
     C                     PARM '*MSG   ' @RTCD                           S01194
     C                     PARM '*KEY   ' @OPTN                           S01194
     C                     PARM           CKEY   10                       S01194
     C                     PARM           KEYSTS  7                       S01194
     C           SDCUST    PARM SDCUST    DSSDY                           S01194
     C*                                                                   S01194
     C** PARAMETER LIST FOR PROGRAM 'AOCURRR0'                            S01194
     C*                                                                   S01194
     C           PLIST2    PLIST                                          S01194
     C                     PARM '*MSG   ' @RTCD                           S01194
     C                     PARM '*KEY   ' @OPTN                           S01194
     C                     PARM           CURKEY  3                    A  S01194
     C           SDCURR    PARM SDCURR    DSSDY                        B  S01194
     C*                                                                   S01194
     C** PARAMETER LIST FOR PROGRAM 'AOBANKR0'                            S01194
     C           PLISTA    PLIST                                          S01194
     C                     PARM '*MSG   ' @RTCD   7                       S01194
     C                     PARM '*FIRST ' @OPTN   7                       S01194
     C           SDBANK    PARM SDBANK    DSFDY                           S01194
     C*                                                                   MOF60
     C** KLIST FOR HISACT FILE                                            MOF60
     C           KEY001    KLIST                                          MOF60
     C                     KFLD           BRCA                            MOF60
     C                     KFLD           CNUMA                           MOF60
     C                     KFLD           FCLTY                           MOF60
      *                                                                   CLE004
      ** KLIST for LEPARTL3                                               CLE004
     C           KPART     KLIST                                          CLE004
     C                     KFLD           BRCA                            CLE004
     C                     KFLD           CNUMA                           CLE004
     C                     KFLD           FACTA                           CLE004
     C                     KFLD           FCNOA                           CLE004
      *                                                                                       CLE024
      ** Key fields for LE Facility Extension File LEFCLTLG                                   CLE024
      *                                                                                       CLE024
     C           KFCLT     KLIST                                                              CLE024
     C                     KFLD           KBRCA   3                                           CLE024
     C                     KFLD           KCNUMA  6                                           CLE024
     C                     KFLD           KFACTA  3                                           CLE024
     C                     KFLD           KFCNOA  2                                           CLE024
     C**                                                                  S01117
     C**   DETERMINE TYPE OF FCLTY RECORD READ                            S01117
     C**                                                                  S01117
     C                     SETOF                     020304               S01117
     C                     SETOF                     050607               S01117
     C**                                                                  S01117
     C           *IN08     IFEQ '0'                                       S01117
     C**                                                                  S01117
     C           RCTP      IFEQ 'A'                                       S01117
     C           RECIA     COMP 'D'                      02               S01117
     C           RECIA     COMP 'R'                      03               S01117
     C  N03      RECIA     COMP 'C'                      03               S01117
     C           RECIA     COMP 'E'                      04               S01117
     C/COPY WNCPYSRC,LE0300C001
     C                     END                                            S01117
     C**                                                                  S01117
     C           RCTPB     IFEQ 'B'                                       S01117
     C           RECIB     COMP 'D'                      05               S01117
     C           RECIB     COMP 'R'                      06               S01117
     C  N06      RECIB     COMP 'C'                      06               S01117
     C           RECIB     COMP 'E'                      07               S01117
     C                     END                                            S01117
     C*                                                                   MOF60
     C***  IF REC TYPE OR ID IS BLANK MEANS ONLY HAVE 'A' REC             MOF60
     C***  (IE NO MATCHING 'B' REC)                                       MOF60
     C***  NB - IF NO 'A' REC FOR A 'B' REC, WON'T APPEAR IN JOINT LF     MOF60
     C*                                                                   MOF60
     C           RCTPB     IFEQ ' '                                       MOF60
     C           RECIB     OREQ ' '                                       MOF60
     C                     SETON                     U7U8LR               MOF60
     C           *LOCK     IN   LDA                                       MOF60
     C                     MOVE *BLANKS   DBKEY                           MOF60
     C                     MOVELCNUMA     KEY1    9                       MOF60
     C                     MOVE FACTA     KEY1                            MOF60
     C                     MOVELKEY1      KEY2                            MOF60
     C                     MOVE FCNOA     KEY2   11                       MOF60
     C                     MOVELKEY2      DBKEY            ************   MOF60
     C                     Z-ADD6         DBASE            * DBERR 06 *   MOF60
     C                     MOVE 'FCLTY   'DBFILE           ************   MOF60
     C                     MOVE 'LE0300  'DBPGM                           MOF60
     C                     OUT  LDA                                       MOF60
     C                     GOTO ENDT                                      MOF60
     C                     END                                            MOF60
     C*                                                                   MOF60
     C                     END                                            S01117
     C*
     C*    FIRST CYCLE PROCESSING
     C*
     C   20                GOTO ENDFC
     C                     SETON                     20
      *                                                                                       196066
      ** Check if SAR is switched ON                                                          196066
      *                                                                                       196066
     C                     MOVE 'N'       CLE002  1                                           196066
     C                     CALL 'AOSARDR0'                                                    196066
     C                     PARM *BLANKS   @RTCD                                               196066
     C                     PARM '*VERIFY' @OPTN                                               196066
     C                     PARM 'CLE002'  @SARD   6                                           196066
     C           SCSARD    PARM SCSARD    DSFDY                                               196066
      *                                                                                       196066
     C           @RTCD     IFEQ *BLANKS                                                       196066
     C                     MOVE 'Y'       CLE002                                              196066
     C                     MOVE '1'       *IN39                                               196066
     C                     END                                                                196066
      *                                                                                       196066
     C           @RTCD     IFNE *BLANKS                                                       196066
     C           @RTCD     ANDNE'*NRF   '                                                     196066
      *                                                                                       196066
      ** Call to program ended in error                                                       196066
      *                                                                                       196066
     C           *LOCK     IN   LDA                                                           196066
     C                     MOVEL'CLE002'  DBKEY            ***************                    196066
     C                     MOVE 'SCSARDPD'DBFILE           * DB ERROR 20 *                    196066
     C                     Z-ADD20        DBASE            ***************                    196066
     C                     MOVEL'LE0300'  DBPGM                                               196066
     C                     OUT  LDA                                                           196066
     C                     SETON                     U7U8LR                                   196066
     C                     EXSR *PSSR                                                         196066
     C                     GOTO ENDT                                                          196066
     C                     ENDIF                                                              196066
      *                                                                   CLE004
      ** Check if SAR is switched ON                                      CLE004
      *                                                                   CLE004
     C                     MOVE 'N'       CLE004  1                       CLE004
     C                     CALL 'AOSARDR0'                                CLE004
     C                     PARM *BLANKS   @RTCD                           CLE004
     C                     PARM '*VERIFY' @OPTN                           CLE004
     C                     PARM 'CLE004'  @SARD   6                       CLE004
     C           SCSARD    PARM SCSARD    DSFDY                           CLE004
      *                                                                   CLE004
     C           @RTCD     IFEQ *BLANKS                                   CLE004
     C                     MOVE 'Y'       CLE004                          CLE004
     C                     END                                            CLE004
      *                                                                   CLE004
     C           @RTCD     IFNE *BLANKS                                   CLE004
     C           @RTCD     ANDNE'*NRF   '                                 CLE004
      *                                                                   CLE004
      ** Call to program ended in error                                   CLE004
      *                                                                   CLE004
     C           *LOCK     IN   LDA                                       CLE004
     C                     MOVEL'CLE004'  DBKEY            ***************CLE004
     C                     MOVE 'SCSARDPD'DBFILE           * DB ERROR 48 *CLE004
     C                     Z-ADD48        DBASE            ***************CLE004
     C                     MOVEL'LE0300'  DBPGM                           CLE004
     C                     OUT  LDA                                       CLE004
     C                     SETON                     U7U8LR               CLE004
     C                     EXSR *PSSR                                     CLE004
     C                     GOTO ENDT                                      CLE004
     C                     ENDIF                                          CLE004
      *                                                                   CLE005
     C                     MOVE 'N'       CLE005  1                       CLE005
     C                     CALL 'AOSARDR0'                                CLE005
     C                     PARM *BLANKS   @RTCD                           CLE005
     C                     PARM '*VERIFY' @OPTN                           CLE005
     C                     PARM 'CLE005'  @SARD   6                       CLE005
     C           SCSARD    PARM SCSARD    DSFDY                           CLE005
      *                                                                   CLE005
     C           @RTCD     IFEQ *BLANKS                                   CLE005
     C                     MOVE 'Y'       CLE005                          CLE005
     C                     MOVE '1'       *IN28                           CLE005
     C                     END                                            CLE005
      *                                                                   CLE005
     C           @RTCD     IFNE *BLANKS                                   CLE005
     C           @RTCD     ANDNE'*NRF   '                                 CLE005
      *                                                                   CLE005
      ** Call to program ended in error                                   CLE005
      *                                                                   CLE005
     C           *LOCK     IN   LDA                                       CLE005
     C                     MOVEL'CLE005'  DBKEY            ***************CLE005
     C                     MOVE 'SCSARDPD'DBFILE           * DB ERROR 49 *CLE005
     C                     Z-ADD49        DBASE            ***************CLE005
     C                     MOVEL'LE0300'  DBPGM                           CLE005
     C                     OUT  LDA                                       CLE005
     C                     SETON                     U7U8LR               CLE005
     C                     EXSR *PSSR                                     CLE005
     C                     GOTO ENDT                                      CLE005
     C                     ENDIF                                          CLE005
      *                                                                   CLE004
     C                     MOVE 'N'       CLE006  1                       CLE006
     C                     SETOF                     11                                      246031A
     C                     CALL 'AOSARDR0'                                CLE006
     C                     PARM *BLANKS   @RTCD                           CLE006
     C                     PARM '*VERIFY' @OPTN                           CLE006
     C                     PARM 'CLE006'  @SARD   6                       CLE006
     C           SCSARD    PARM SCSARD    DSFDY                           CLE006
      *                                                                   CLE006
     C           @RTCD     IFEQ *BLANKS                                   CLE006
     C                     MOVE 'Y'       CLE006                          CLE006
     C                     SETON                     11                                      246031A
     C                     END                                            CLE006
      *                                                                   CLE006
     C           @RTCD     IFNE *BLANKS                                   CLE006
     C           @RTCD     ANDNE'*NRF   '                                 CLE006
      *                                                                   CLE006
      ** Call to program ended in error                                   CLE006
      *                                                                   CLE006
     C           *LOCK     IN   LDA                                       CLE006
     C                     MOVEL'CLE006'  DBKEY            ***************CLE006
     C                     MOVE 'SCSARDPD'DBFILE           * DB ERROR 47 *CLE006
     C                     Z-ADD47        DBASE            ***************CLE006
     C                     MOVEL'LE0300'  DBPGM                           CLE006
     C                     OUT  LDA                                       CLE006
     C                     SETON                     U7U8LR               CLE006
     C                     EXSR *PSSR                                     CLE006
     C                     GOTO ENDT                                      CLE006
     C                     ENDIF                                          CLE006
      *                                                                   CLE007
     C                     MOVE 'N'       CLE007  1                       CLE007
     C                     CALL 'AOSARDR0'                                CLE007
     C                     PARM *BLANKS   @RTCD                           CLE007
     C                     PARM '*VERIFY' @OPTN                           CLE007
     C                     PARM 'CLE007'  @SARD   6                       CLE007
     C           SCSARD    PARM SCSARD    DSFDY                           CLE007
      *                                                                   CLE007
     C           @RTCD     IFEQ *BLANKS                                   CLE007
     C                     MOVE 'Y'       CLE007                          CLE007
     C                     MOVE '1'       *IN29                           CLE007
     C                     END                                            CLE007
      *                                                                   CLE007
     C           @RTCD     IFNE *BLANKS                                   CLE007
     C           @RTCD     ANDNE'*NRF   '                                 CLE007
      *                                                                   CLE007
      ** Call to program ended in error                                   CLE007
      *                                                                   CLE007
     C           *LOCK     IN   LDA                                       CLE007
     C                     MOVEL'CLE007'  DBKEY            ***************CLE007
     C                     MOVE 'SCSARDPD'DBFILE           * DB ERROR 50 *CLE007
     C                     Z-ADD50        DBASE            ***************CLE007
     C                     MOVEL'LE0300'  DBPGM                           CLE007
     C                     OUT  LDA                                       CLE007
     C                     SETON                     U7U8LR               CLE007
     C                     EXSR *PSSR                                     CLE007
     C                     GOTO ENDT                                      CLE007
     C                     ENDIF                                          CLE007
      *                                                                   CLE008
     C                     MOVE 'N'       CLE008  1                       CLE008
     C                     CALL 'AOSARDR0'                                CLE008
     C                     PARM *BLANKS   @RTCD                           CLE008
     C                     PARM '*VERIFY' @OPTN                           CLE008
     C                     PARM 'CLE008'  @SARD   6                       CLE008
     C           SCSARD    PARM SCSARD    DSFDY                           CLE008
      *                                                                   CLE008
     C           @RTCD     IFEQ *BLANKS                                   CLE008
     C                     MOVE 'Y'       CLE008                          CLE008
     C                     MOVE '1'       *IN61                           CLE008
     C                     END                                            CLE008
      *                                                                   CLE008
     C           @RTCD     IFNE *BLANKS                                   CLE008
     C           @RTCD     ANDNE'*NRF   '                                 CLE008
      *                                                                   CLE008
      ** Call to program ended in error                                   CLE008
      *                                                                   CLE008
     C           *LOCK     IN   LDA                                       CLE008
     C                     MOVEL'CLE008'  DBKEY            ***************CLE008
     C                     MOVE 'SCSARDPD'DBFILE           * DB ERROR 51 *CLE008
     C                     Z-ADD51        DBASE            ***************CLE008
     C                     MOVEL'LE0300'  DBPGM                           CLE008
     C                     OUT  LDA                                       CLE008
     C                     SETON                     U7U8LR               CLE008
     C                     EXSR *PSSR                                     CLE008
     C                     GOTO ENDT                                      CLE008
     C                     ENDIF                                          CLE008
      *                                                                   CLE008
     C                     MOVE 'N'       CLE028  1                                           CLE028
     C                     CALL 'AOSARDR0'                                                    CLE028
     C                     PARM *BLANKS   @RTCD                                               CLE028
     C                     PARM '*VERIFY' @OPTN                                               CLE028
     C                     PARM 'CLE028'  @SARD                                               CLE028
     C           SCSARD    PARM SCSARD    DSFDY                                               CLE028
      *                                                                                       CLE028
     C           @RTCD     IFEQ *BLANKS                                                       CLE028
     C                     MOVE 'Y'       CLE028                                              CLE028
     C                     ENDIF                                                              CLE028
      *                                                                                       CLE028
     C           @RTCD     IFNE *BLANKS                                                       CLE028
     C           @RTCD     ANDNE'*NRF   '                                                     CLE028
      *                                                                                       CLE028
      ** Call to program ended in error                                                       CLE028
      *                                                                                       CLE028
     C           *LOCK     IN   LDA                                                           CLE028
     C                     MOVEL'CLE028'  DBKEY                                               CLE028
     C                     MOVE 'SCSARDPD'DBFILE                                              CLE028
     C                     Z-ADD52        DBASE                                               CLE028
     C                     MOVEL'LE0300'  DBPGM                                               CLE028
     C                     OUT  LDA                                                           CLE028
     C                     SETON                     U7U8LR                                   CLE028
     C                     EXSR *PSSR                                                         CLE028
     C                     GOTO ENDT                                                          CLE028
     C                     ENDIF                                                              CLE028
      *                                                                                       CLE028
     C                     MOVE 'N'       CLE031  1                                           CLE031
     C                     CALL 'AOSARDR0'                                                    CLE031
     C                     PARM *BLANKS   @RTCD                                               CLE031
     C                     PARM '*VERIFY' @OPTN                                               CLE031
     C                     PARM 'CLE031'  @SARD                                               CLE031
     C           SCSARD    PARM SCSARD    DSFDY                                               CLE031
      *                                                                                       CLE031
     C           @RTCD     IFEQ *BLANKS                                                       CLE031
     C                     MOVE 'Y'       CLE031                                              CLE031
     C                     MOVE *ON       *IN42                                               CLE031
     C                     END                                                                CLE031
      *                                                                                       CLE031
     C           @RTCD     IFNE *BLANKS                                                       CLE031
     C           @RTCD     ANDNE'*NRF   '                                                     CLE031
      *                                                                                       CLE031
      ** Call to program ended in error                                                       CLE031
      *                                                                                       CLE031
     C           *LOCK     IN   LDA                                                           CLE031
     C                     MOVEL'CLE008'  DBKEY                                               CLE031
     C                     MOVE 'SCSARDPD'DBFILE                                              CLE031
     C                     Z-ADD52        DBASE                                               CLE031
     C                     MOVEL'LE0300'  DBPGM                                               CLE031
     C                     OUT  LDA                                                           CLE031
     C                     SETON                     U7U8LR                                   CLE031
     C                     EXSR *PSSR                                                         CLE031
     C                     ENDIF                                                              CLE031
     C*                                                                   S01408
     C                     MOVE 'N'       CLE034  1                                           CLE034
     C                     MOVE *OFF      *IN13                                               CLE034
     C                     CALL 'AOSARDR0'                                                    CLE034
     C                     PARM *BLANKS   @RTCD                                               CLE034
     C                     PARM '*VERIFY' @OPTN                                               CLE034
     C                     PARM 'CLE034'  @SARD                                               CLE034
     C           SCSARD    PARM SCSARD    DSFDY                                               CLE034
      *                                                                                       CLE034
     C           @RTCD     IFEQ *BLANKS                                                       CLE034
     C                     MOVE 'Y'       CLE034                                              CLE034
     C                     MOVE *ON       *IN13                                               CLE034
     C                     END                                                                CLE034
      *                                                                                       CLE034
     C           @RTCD     IFNE *BLANKS                                                       CLE034
     C           @RTCD     ANDNE'*NRF   '                                                     CLE034
      *                                                                                       CLE034
      ** Call to program ended in error                                                       CLE034
      *                                                                                       CLE034
     C           *LOCK     IN   LDA                                                           CLE034
     C                     MOVEL'CLE034'  DBKEY                                               CLE034
     C                     MOVE 'SCSARDPD'DBFILE                                              CLE034
     C                     Z-ADD53        DBASE                                               CLE034
     C                     MOVEL'LE0300'  DBPGM                                               CLE034
     C                     OUT  LDA                                                           CLE034
     C                     SETON                     U7U8LR                                   CLE034
     C                     EXSR *PSSR                                                         CLE034
     C                     ENDIF                                                              CLE034
      *                                                                                       CLE034
      ** Check if enhancement CLE039 (General LE Enhancements) is on                          CLE039
      *                                                                                       CLE039
     C                     CALL 'AOSARDR0'                                                    CLE039
     C                     PARM *BLANKS   PRTCD   7                                           CLE039
     C                     PARM '*VERIFY' POPTN   7                                           CLE039
     C                     PARM 'CLE039'  PSARD   6                                           CLE039
     C           SCSARD    PARM SCSARD    DSSDY                                               CLE039
      *                                                                                       CLE039
     C           PRTCD     IFNE *BLANKS                                                       CLE039
     C           PRTCD     ANDNE'*NRF   '                                                     CLE039
     C           *LOCK     IN   LDA                                                           CLE039
     C                     MOVEL'LE0300'  DBPGM                                               CLE039
     C                     MOVEL'SCSARDPD'DBFILE                                              CLE039
     C                     MOVEL'CLE039'  DBKEY                                               CLE039
     C                     Z-ADD52        DBASE                                               CLE039
     C                     OUT  LDA                                                           CLE039
     C                     MOVE *ON       *INU7                                               CLE039
     C                     MOVE *ON       *INU8                                               CLE039
     C                     MOVE *ON       *INLR                                               CLE039
     C                     EXSR *PSSR                                                         CLE039
     C                     GOTO ENDT                                                          CLE039
     C                     ENDIF                                                              CLE039
      *                                                                                       CLE039
     C           PRTCD     IFEQ *BLANKS                                                       CLE039
     C                     MOVE 'Y'       CLE039  1                                           CLE039
     C                     MOVE *ON       *IN16                                               CLE039
     C                     ELSE                                                               CLE039
     C                     MOVE 'N'       CLE039                                              CLE039
     C                     MOVE *OFF      *IN16                                               CLE039
     C                     ENDIF                                                              CLE039
      *                                                                                       CLE039
      ** Check if enhancement CLE024 (Collateralised Lending) is on                           CLE024
      *                                                                                       CLE024
     C                     CALL 'AOSARDR0'                                                    CLE024
     C                     PARM *BLANKS   PRTCD                                               CLE024
     C                     PARM '*VERIFY' POPTN                                               CLE024
     C                     PARM 'CLE024'  PSARD                                               CLE024
     C           SCSARD    PARM SCSARD    DSSDY                                               CLE024
      *                                                                                       CLE024
     C           PRTCD     IFNE *BLANKS                                                       CLE024
     C           PRTCD     ANDNE'*NRF   '                                                     CLE024
     C           *LOCK     IN   LDA                                                           CLE024
     C                     MOVEL'LE0300'  DBPGM                                               CLE024
     C                     MOVEL'SCSARDPD'DBFILE                                              CLE024
     C                     MOVEL'CLE024'  DBKEY                                               CLE024
     C                     Z-ADD53        DBASE                                               CLE024
     C                     OUT  LDA                                                           CLE024
     C                     MOVE *ON       *INU7                                               CLE024
     C                     MOVE *ON       *INU8                                               CLE024
     C                     MOVE *ON       *INLR                                               CLE024
     C                     EXSR *PSSR                                                         CLE024
     C                     GOTO ENDT                                                          CLE024
     C                     ENDIF                                                              CLE024
      *                                                                                       CLE024
     C                     MOVE 'N'       CLE024  1                                           CLE024
     C                     MOVE *OFF      *IN17                                               CLE024
     C           PRTCD     IFEQ *BLANKS                                                       CLE024
     C                     MOVE 'Y'       CLE024                                              CLE024
     C                     MOVE *ON       *IN17                                               CLE024
     C                     ENDIF                                                              CLE024
      *                                                                                       CLE024
      ** Check if enhancement CLE025 (Credit Lines) is on                                     CLE025
      **   (Indicator *IN18 is seton if CLE025 or CFX001 is on)                               CLE025
      *                                                                                       CLE025
     C                     CALL 'AOSARDR0'                                                    CLE025
     C                     PARM *BLANKS   PRTCD                                               CLE025
     C                     PARM '*VERIFY' POPTN                                               CLE025
     C                     PARM 'CLE025'  PSARD                                               CLE025
     C           SCSARD    PARM SCSARD    DSSDY                                               CLE025
      *                                                                                       CLE025
     C           PRTCD     IFNE *BLANKS                                                       CLE025
     C           PRTCD     ANDNE'*NRF   '                                                     CLE025
     C           *LOCK     IN   LDA                                                           CLE025
     C                     MOVEL'LE0300'  DBPGM                                               CLE025
     C                     MOVEL'SCSARDPD'DBFILE                                              CLE025
     C                     MOVEL'CLE025'  DBKEY                                               CLE025
     C                     Z-ADD55        DBASE                                               CLE025
     C                     OUT  LDA                                                           CLE025
     C                     MOVE *ON       *INU7                                               CLE025
     C                     MOVE *ON       *INU8                                               CLE025
     C                     MOVE *ON       *INLR                                               CLE025
     C                     EXSR *PSSR                                                         CLE025
     C                     GOTO ENDT                                                          CLE025
     C                     ENDIF                                                              CLE025
      *                                                                                       CLE025
     C           PRTCD     IFEQ *BLANKS                                                       CLE025
     C                     MOVE 'Y'       CLE025  1                                           CLE025
     C                     MOVE *ON       *IN18                                               CLE025
     C                     ELSE                                                               CLE025
     C                     MOVE 'N'       CLE025                                              CLE025
     C                     MOVE *OFF      *IN18                                               CLE025
     C                     ENDIF                                                              CLE025
     C/COPY WNCPYSRC,LEH00090
      *                                                                                       CLE025
      ** Check if enhancement CFX001 (FX Margin Trading) is on                                CFX001
      **   (Indicator *IN18 is seton if CLE025 or CFX001 is on)                               CFX001
      *                                                                                       CFX001
     C                     CALL 'AOSARDR0'                                                    CFX001
     C                     PARM *BLANKS   PRTCD                                               CFX001
     C                     PARM '*VERIFY' POPTN                                               CFX001
     C                     PARM 'CFX001'  PSARD                                               CFX001
     C           SCSARD    PARM SCSARD    DSSDY                                               CFX001
      *                                                                                       CFX001
     C           PRTCD     IFNE *BLANKS                                                       CFX001
     C           PRTCD     ANDNE'*NRF   '                                                     CFX001
     C           *LOCK     IN   LDA                                                           CFX001
     C                     MOVEL'LE0300'  DBPGM                                               CFX001
     C                     MOVEL'SCSARDPD'DBFILE                                              CFX001
     C                     MOVEL'CFX001'  DBKEY                                               CFX001
     C                     Z-ADD54        DBASE                                               CFX001
     C                     OUT  LDA                                                           CFX001
     C                     MOVE *ON       *INU7                                               CFX001
     C                     MOVE *ON       *INU8                                               CFX001
     C                     MOVE *ON       *INLR                                               CFX001
     C                     EXSR *PSSR                                                         CFX001
     C                     GOTO ENDT                                                          CFX001
     C                     ENDIF                                                              CFX001
      *                                                                                       CFX001
     C                     MOVE 'N'       CFX001  1                                           CFX001
     C           PRTCD     IFEQ *BLANKS                                                       CFX001
     C                     MOVE 'Y'       CFX001                                              CFX001
     C                     MOVE *ON       *IN18                                               CFX001
     C                     ENDIF                                                              CFX001
      *                                                                                       CFX001
     C           *LIKE     DEFN NDEL      WNDEL                                               CLE041
     C           *LIKE     DEFN NINS      WNINS                                               CLE041
     C           *LIKE     DEFN NLRA      WNLRA                                               CLE041
     C           *LIKE     DEFN NLRB      WNLRB                                               CLE041
     C           *LIKE     DEFN VLAF      WVLAF                                               CLE041
     C           *LIKE     DEFN VLAL      WVLAL                                               CLE041
     C           *LIKE     DEFN VLBF      WVLBF                                               CLE041
     C           *LIKE     DEFN VLBL      WVLBL                                               CLE041
     C           *LIKE     DEFN VRAF      WVRAF                                               CLE041
     C           *LIKE     DEFN VRAL      WVRAL                                               CLE041
     C           *LIKE     DEFN VRDF      WVRDF                                               CLE041
     C           *LIKE     DEFN VRDL      WVRDL                                               CLE041
     C           *LIKE     DEFN VRIF      WVRIF                                               CLE041
     C           *LIKE     DEFN VRIL      WVRIL                                               CLE041
      *                                                                                       CLE041
     C***/COPY*WNCPYSRC,LE0300CCP1***                                                  S01408 CFC006
     C/COPY WNCPYSRC,LE0300CCP1                                                             MD020563
      *****************************************************************           AR1097176 MD020563
      ***Check*if*CFC006*-*COB*Restructure*-*Remove*reports*from*COB***           AR1097176 MD020563
      ***is*installed**************************************************           AR1097176 MD020563
      *****************************************************************           AR1097176 MD020563
     C**********           CALL 'AOSARDR0'                                        AR1097176 MD020563
     C**********           PARM *BLANKS   PRTCD                                   AR1097176 MD020563
     C**********           PARM '*VERIFY' POPTN                                   AR1097176 MD020563
     C**********           PARM 'CFC006'  PSARD                                   AR1097176 MD020563
     C********** SCSARD    PARM SCSARD    DSSDY                                   AR1097176 MD020563
      *****************************************************************           AR1097176 MD020563
     C********** PRTCD     IFNE *BLANKS                                           AR1097176 MD020563
     C********** PRTCD     ANDNE'*NRF   '                                         AR1097176 MD020563
     C********** *LOCK     IN   LDA                                               AR1097176 MD020563
     C**********           MOVEL'LE0300'  DBPGM                                   AR1097176 MD020563
     C**********           MOVEL'SCSARDPD'DBFILE                                  AR1097176 MD020563
     C**********           MOVEL'CFC006'  DBKEY                                   AR1097176 MD020563
     C**********           Z-ADD66        DBASE                                   AR1097176 MD020563
     C**********           OUT  LDA                                               AR1097176 MD020563
     C**********           MOVE *ON       *INU7                                   AR1097176 MD020563
     C**********           MOVE *ON       *INU8                                   AR1097176 MD020563
     C**********           MOVE *ON       *INLR                                   AR1097176 MD020563
     C**********           EXSR *PSSR                                             AR1097176 MD020563
     C**********           GOTO ENDT                                              AR1097176 MD020563
     C**********           ENDIF                                                  AR1097176 MD020563
      *****************************************************************           AR1097176 MD020563
     C**********           MOVE 'N'       CFC006  1                               AR1097176 MD020563
     C********** PRTCD     IFEQ *BLANKS                                           AR1097176 MD020563
     C**********           MOVE 'Y'       CFC006                                  AR1097176 MD020563
     C**********           ENDIF                                                  AR1097176 MD020563
      *                                                                                       CFC006
      ** Enable output indicator for LE0300P1                                                 CFC006
      *                                                                                       CFC006
     C                     MOVE *ON       *IN97                                               CFC006
     C                     MOVEL'N'       SUPFLG  1                                           CFC006
     C********** CFC006    IFEQ 'Y'                                               AR1097176 MD020563
     C                     CALL 'AOCOMR0'                                                     CFC006
     C                     PARM 'LEC06  ' PNAME  10                                           CFC006
     C                     PARM '*ALL '   PCSEQ   5                                           CFC006
     C                     PARM SECTN     PSCTN  50                                           CFC006
     C                     PARM *BLANKS   PRTCD                                               CFC006
      *                                                                                       CFC006
     C           PRTCD     IFEQ 'Y      '                                                     CFC006
     C                     MOVEL'Y'       SUPFLG                                              CFC006
     C                     MOVE *OFF      *IN97                                               CFC006
     C                     ENDIF                                                              CFC006
     C**********           ENDIF                                                  AR1097176 MD020563
      *                                                                                       CFC006
     C                     MOVE *OFF      *IN80                                               CER020
      *                                                                                       CER020
     C                     CALL 'AOSARDR0'                                                    CER020
     C                     PARM *BLANKS   PRTCD                                               CER020
     C                     PARM '*VERIFY' POPTN                                               CER020
     C                     PARM 'CER020'  PSARD   6                                           CER020
     C           SCSARD    PARM SCSARD    DSFDY                                               CER020
      *                                                                                       CER020
     C           PRTCD     IFEQ *BLANKS                                                       CER020
      *                                                                                       CER020
     C                     MOVE 'Y'       CER020  1                                           CER020
     C                     MOVE *ON       *IN80                                               CER020
      *                                                                                       CER020
     C                     ENDIF                                                              CER020
      *                                                                                       CER020
     C           PRTCD     IFNE *BLANKS                                                       CER020
     C           PRTCD     ANDNE'*NRF   '                                                     CER020
      *                                                                                       CER020
      ** Call to program ended in error                                                       CER020
      *                                                                                       CER020
     C           *LOCK     IN   LDA                                                           CER020
     C                     MOVEL'CER020'  DBKEY                                               CER020
     C                     MOVE 'SCSARDPD'DBFILE                                              CER020
     C                     Z-ADD65        DBASE                                               CER020
     C                     MOVE *ON       *INU7                                               CER020
     C                     MOVE *ON       *INU8                                               CER020
     C                     MOVE *ON       *INLR                                               CER020
     C                     OUT  LDA                                                           CER020
     C                     EXSR *PSSR                                                         CER020
      *                                                                                       CER020
     C                     GOTO ENDT                                                          CER020
      *                                                                                       CER020
     C                     ENDIF                                                              CER020
     C*                                                                   S01408
      *                                                                                       CER001
      ** Define key of LEFCX2PD file                                                          CER001
      *                                                                                       CER001
     C           KEYMX6    KLIST                                                              CER001
     C                     KFLD           KCNUM                                               CER001
     C                     KFLD           KFACT                                               CER001
     C                     KFLD           KFCNO                                               CER001
      ***  Check if CLE029 is set to on.                                  CLE029
      *                                                                   CLE029
     C                     MOVEL'N'       CLE029  1                       CLE029
     C                     MOVE *OFF      *IN40                           CLE029
     C                     CALL 'AOSARDR0'                                CLE029
     C                     PARM *BLANKS   @RTCD                           CLE029
     C                     PARM '*VERIFY' @OPTN                           CLE029
     C                     PARM 'CLE029'  @SARD                           CLE029
      *                                                                   CLE029
     C           @RTCD     IFEQ *BLANKS                                   CLE029
     C                     MOVEL'Y'       CLE029                          CLE029
     C                     MOVE *ON       *IN40                           CLE029
     C                     ENDIF                                          CLE029
      *                                                                   CLE029
     C           @RTCD     IFNE *BLANKS                                   CLE029
     C           @RTCD     ANDNE'*NRF   '                                 CLE029
      *                                                                   CLE029
      ** Call to program ended in error                                   CLE029
      *                                                                   CLE029
     C           *LOCK     IN   LDA                                       CLE029
     C                     MOVEL'CLE029'  DBKEY            ***************CLE029
     C                     MOVE 'SCSARDPD'DBFILE           * DB ERROR 52 *CLE029
     C                     Z-ADD52        DBASE            ***************CLE029
     C                     MOVEL'LE0300'  DBPGM                           CLE029
     C                     OUT  LDA                                       CLE029
     C                     SETON                     U7U8LR               CLE029
     C                     EXSR *PSSR                                     CLE029
     C                     GOTO ENDT                                      CLE029
     C                     ENDIF                                          CLE029
      *                                                                                       CER001
      ** Determine if ULX004 is installed.                                                    CER001
      *                                                                                       CER001
     C                     CALL 'AOSARDR0'                                                    CER001
     C                     PARM *BLANKS   @RTCD                                               CER001
     C                     PARM '*VERIFY' @OPTN                                               CER001
     C                     PARM 'ULX004'  @SARD                                               CER001
     C           SCSARD    PARM SCSARD    DSFDY                                               CER001
     C           @RTCD     IFEQ *BLANKS                                                       CER001
     C                     MOVE 'Y'       ULX004  1                                           CER001
     C**********           MOVE *ON       *IN60                                      CER001 BUG10267
     C                     MOVE *ON       *IN62                                             BUG10267
     C                     ELSE                                                               CER001
     C                     MOVE 'N'       ULX004                                              CER001
     C           @RTCD     IFNE '*NRF    '                                                    CER001
     C           *LOCK     IN   LDA                                                           CER001
     C                     MOVEL'SCSARDPD'DBFILE                                              CER001
     C                     Z-ADD57        DBASE                                               CER001
     C                     MOVEL'ULX004'  DBKEY                                               CER001
     C                     OUT  LDA                                                           CER001
     C                     EXSR *PSSR                                                         CER001
     C                     ENDIF                                                              CER001
     C                     ENDIF                                                              CER001
      *                                                                   CLE029
      ***  Check if CLE106 is set to on.                                                      CLE106
      *                                                                                       CLE106
     C                     MOVEL'N'       CLE106  1                                           CLE106
     C                     CALL 'AOSARDR0'                                                    CLE106
     C                     PARM *BLANKS   @RTCD                                               CLE106
     C                     PARM '*VERIFY' @OPTN                                               CLE106
     C                     PARM 'CLE106'  @SARD                                               CLE106
      *                                                                                       CLE106
     C           @RTCD     IFEQ *BLANKS                                                       CLE106
     C                     MOVEL'Y'       CLE106                                              CLE106
     C                     ENDIF                                                              CLE106
      *                                                                                       CLE106
     C           @RTCD     IFNE *BLANKS                                                       CLE106
     C           @RTCD     ANDNE'*NRF   '                                                     CLE106
      *                                                                                       CLE106
      ** Call to program ended in error                                                       CLE106
     C           *LOCK     IN   LDA                                                           CLE106
     C                     MOVEL'CLE106'  DBKEY            ***************                    CLE106
     C                     MOVE 'SCSARDPD'DBFILE           * DB ERROR 56 *                    CLE106
     C                     Z-ADD56        DBASE            ***************                    CLE106
     C                     MOVEL'LE0300'  DBPGM                                               CLE106
     C                     OUT  LDA                                                           CLE106
     C                     SETON                     U7U8LR                                   CLE106
     C                     EXSR *PSSR                                                         CLE106
     C                     GOTO ENDT                                                          CLE106
     C                     ENDIF                                                              CLE106
      *                                                                                      BUG8943
      ** Determine if Nordea LE Enh. Phase 1 Pty 2 - Income Splits                           BUG8943
      ** is installed                                                                        BUG8943
      *                                                                                      BUG8943
     C                     MOVEL'N'       CLE035  1                                          BUG8943
     C                     MOVE *OFF      *IN14                                              BUG8943
     C                     CALL 'AOSARDR0'                                                   BUG8943
     C                     PARM *BLANKS   @RTCD                                              BUG8943
     C                     PARM '*VERIFY' @OPTN                                              BUG8943
     C                     PARM 'CLE035'  @SARD                                              BUG8943
      *                                                                                      BUG8943
     C           @RTCD     IFEQ *BLANKS                                                      BUG8943
     C                     MOVEL'Y'       CLE035                                             BUG8943
     C                     MOVE *ON       *IN14                                              BUG8943
     C                     ENDIF                                                             BUG8943
      *                                                                                      BUG8943
     C           @RTCD     IFNE *BLANKS                                                      BUG8943
     C           @RTCD     ANDNE'*NRF   '                                                    BUG8943
      *                                                                                      BUG8943
      ** Call to program ended in error                                                      BUG8943
     C           *LOCK     IN   LDA                                                          BUG8943
     C                     MOVEL'CLE035'  DBKEY            ***************                   BUG8943
     C                     MOVE 'SCSARDPD'DBFILE           * DB ERROR 57 *                   BUG8943
     C                     Z-ADD57        DBASE            ***************                   BUG8943
     C                     MOVEL'LE0300'  DBPGM                                              BUG8943
     C                     OUT  LDA                                                          BUG8943
     C                     SETON                     U7U8LR                                  BUG8943
     C                     EXSR *PSSR                                                        BUG8943
     C                     GOTO ENDT                                                         BUG8943
     C                     ENDIF                                                             BUG8943
      **                                                                  S01117
      **   IN THE DATAAREA RUNDAT                                         S01117
      **                                                                  S01117
     C           *NAMVAR   DEFN RUNDAT    RUNDT                           S01117
     C                     IN   RUNDT                                     S01117
     C*    DEFINE LDA                                                     S01117
     C           *NAMVAR   DEFN           LDA                             S01117
     C********** *LOCK     IN   LDA                                S01117 MOF60
     C*
     C*    SET UP DATABASE ERROR REFERENCE
     C*
     C                     MOVE 'LE0300  'DBPGM
     C                     MOVE ' '       BLANKS 29
     C                     MOVE BLANKS    DBKEY
     C***********                                                         MOF60
     C*****ACCESS*ICD-1*FOR*DATE*FORMAT,*DATABASE*ERROR*IF*NOT*FOUND***   MOF60
     C***********                                                         MOF60
     C***  ACCESS BANK DETAILS                                            MOF60
     C*                                                                   MOF60
     C                     CALL 'AOBANKR0'PLISTA                          MOF60
     C**                                                                  MOF60
     C           @RTCD     IFNE *BLANKS                                   MOF60
     C                     SETON                     U7U8LR               MOF60
     C           *LOCK     IN   LDA                                       MOF60
     C                     MOVE *BLANKS   DBKEY                           MOF60
     C                     MOVE '01'      DBASE                           MOF60
     C                     MOVE 'SDBANKPD'DBFILE                          MOF60
     C                     MOVE 'LE0300  'DBPGM                           MOF60
     C                     OUT  LDA                                       MOF60
     C                     GOTO ENDT                                      MOF60
     C                     END                                            MOF60
     C***99*****           SETON                     U7U8LR               MOF60
     C***99*****           MOVE '01'      DBASE                           MOF60
     C***99*****           MOVE 'TABLE'   DBFILE                   S01194 MOF60
     C***99*****           MOVE 'SDBANKPD'DBFILE                   S01194 MOF60
     C***99*****           MOVELZTABKY    DBKEY                           MOF60
     C***99*****           GOTO ENDT                                      MOF60
     C*                                                                   MOF60
     C***  CHECK SYSTEM DATE FORMAT, DDMMYY OR MMDDYY.                    MOF60
     C*                                                                   MOF60
     C           DATF      IFEQ 'M'                                       MOF60
     C                     MOVE '1'       *IN98                           MOF60
     C                     END                                            MOF60
      **                                                                  S01117
      **   ACCESS GENERAL LEDGER DETAILS                                  S01117
      **                                                                  S01117
     C**********           CALL 'AOGELRR0'                                             S01117 CGL029
     C                     CALL 'AOGELRR1'                                                    CGL029
     C                     PARM '*MSG   ' @RTCD                           MOF60
     C                     PARM '*FIRST ' @OPTN                           MOF60
     C********** SDGELR    PARM SDGELR    DSFDY                                        S01117 CGL029
     C           SDGELR    PARM SDGELR    DSSDY                                               CGL029
     C*********************PARM '*MSG   ' @RTCD   7                S01117 MOF60
     C*********************PARM '*FIRST ' @OPTN   7                S01117 MOF60
     C*                                                                   S01117
     C           @RTCD     IFNE *BLANK                                    S01117
     C                     SETON                     U7U8LR               S01117
     C           *LOCK     IN   LDA                                       MOF60
     C                     MOVEL'SDGELRPD'DBFILE           ***************S01117
     C                     MOVE *BLANKS   DBKEY                           MOF60
     C                     MOVEL@OPTN     DBKEY            * DBERROR 05  *S01117
     C                     Z-ADD5         DBASE            ***************S01117
     C                     MOVE 'LE0300  'DBPGM                           MOF60
     C                     OUT  LDA                                       MOF60
     C                     EXSR *PSSR                                     S01117
     C                     GOTO ENDT                                      S01117
     C                     END                                            S01117
     C*
     C*    SETON INDICATOR FOR NO PRINTING, IF MULTIBRANCHING = NO        S01117
     C*                                                                   S01117
     C           MBIN      IFNE 'Y'                                       S01117
     C                     SETON                     3376                 S01117
     C                     ELSE                                           S01117
     C           OBRU      IFNE 'Y'                                       S01117
     C                     SETON                     76                   S01117
     C                     END                                            S01117
     C                     END                                            S01117
      **                                                                  S01117
      **   SETON INDICATOR FOR NO PRINTING, PROFIT CENTRE FIELD           S01117
      **                                                                  S01117
     C           PFCU      IFNE 'Y'                                       S01117
     C                     SETON                     77                   S01117
     C                     END                                            S01117
     C*                                                                   MOF60
     C***  SET OFF A FLAG FOR FILE OPENING PROCESSING                     MOF60
     C*                                                                   MOF60
     C                     MOVE *BLANKS   OPENP1  1                       MOF60
     C                     MOVE *BLANKS   OPENP3  1                                           CLE041
      *                                                                   140832
      ***  Report Work fields.                                            140832
      *                                                                   140832
     C                     Z-ADD0         RQDLN2  30                      140832
     C                     Z-ADD0         DIFLN2  30                      140832
     C*                                                                   S01117
     C*                                                                   S01408
     C/COPY WNCPYSRC,LE0300CEIP                                           S01408
     C*                                                                   S01408
     C           ENDFC     TAG                             ** ENDFC TAG **
     C*
     C*                                                                   S01408
     C/COPY WNCPYSRC,LE0300CCPG                                           S01408
     C*                                                                   S01408
     C                     SETOF                     30
     C                     SETOF                     15                   CLE015
     C***********          SETOF                     242526               S01117
     C*
     C*****IF*HEADER*RECORD*READ****                                      S01117
     C***01******          GOTO ENDT                                      S01117
      ** IF MBIN=YES, AND A LEVEL BREAK,                                  S01117
      ** OPEN LE0300P1                                                    S01117
     C           *INL1     IFEQ '1'                                       S01117
     C           MBIN      ANDEQ'Y'                                       MOF60
     C           *IN09     IFEQ *OFF                                                          CLE041
     C                     CLOSELE0300P1                                  S01117
     C                     MOVE ' '       P1OP                            MOF60
     C                     ELSE                                                               CLE041
     C                     CLOSELE0300P3                                                      CLE041
     C                     MOVE ' '       P3OP                                                CLE041
     C                     ENDIF                                                              CLE041
     C                     SETOF                     75                   S01117
      *                                                                   CLE004
     C***********CLE004    IFEQ 'Y'                                CLE004 187663
     C           CLE006    IFEQ 'Y'                                       187663
     C           OPEN2     ANDEQ'1'                                       CLE004
     C                     CLOSELE0300P2                                  CLE004
     C                     MOVE *OFF      *IN71                           CLE004
     C                     ENDIF                                          CLE004
      *                                                                   CLE004
     C**********           MOVE 'Y'       P1OP    1                       MOF60
     C**********           OPEN LE0300P1                                  MOF60
     C*                                                                   MOF60
     C***  SET ON A FLAG FOR FILE OPENING PROCESSING.                     MOF60
     C***  IF IT IS ON, IT MEANS WE SHOULD OPEN A NEW P1, BUT IT IS       MOF60
     C***  DELAYED TILL MORE DETAILS ARE DUE TO BE PUT OUT.               MOF60
     C***  THIS IS TO PREVENT OUTPUT OF 'NO DETAIL' PAGES.                MOF60
     C*                                                                   MOF60
     C                     MOVE 'Y'       OPENP1                          MOF60
     C                     MOVE 'Y'       OPENP3                                              CLE041
     C*                                                                   MOF60
     C**********           Z-ADD0         PAGE                            MOF60
      ** ENSURE REPORT SPOOL FILE RECORDED BY RCF                         MOF60
     C**********           Z-ADDSFNUM     ZSNUM   60                      MOF60
     C*********************OUT  LDA                                       MOF60
     C**********           CALL 'ZSFILE'                                  MOF60
     C**********           PARM           SEQ                             MOF60
     C**********           PARM BRCA      SENTY   3                       MOF60
     C**********           PARM           SFILE                           MOF60
     C**********           PARM           ZSNUM                           MOF60
     C**********           PARM           ZSERR   1                       MOF60
      *                                                                   S01117
     C************LOCK     IN   LDA                                       MOF60
     C********** ZSERR     IFEQ 'Y'                                       MOF60
      ****ERROR*DURING*ZSFILE*PROCESSING,*RETURN*TO*CALLING*PROGRAM****   MOF60
     C**********           SETON                     U7U8LR               MOF60
     C**********           RETRN                                          MOF60
     C**********           END                                            MOF60
     C**                                                                  S01117
      **                                                                  S01117
      ** GET BRANCH NAME, ONLY WHEN MBIN = 'Y'                            S01117
      **                                                                  S01117
     C           MBIN      IFEQ 'Y'                                       S01117
      *                                                                   S01117
     C**********           CALL 'AOBRCHR0'                                             S01117 CGL029
     C                     CALL 'AOBRCHR1'                                                    CGL029
     C                     PARM '*MSG   ' @RTCD                           MOF60
     C                     PARM '*KEY   ' @OPTN                           MOF60
     C                     PARM BRCA      @DSNB   3                       S01117
     C********** SDBRCH    PARM SDBRCH    DSFDY                                        S01117 CGL029
     C           SDBRCH    PARM SDBRCH    DSSDY                                               CGL029
     C***********          PARM '*MSG   ' @RTCD   7                S01117 MOF60
     C***********          PARM '*KEY   ' @OPTN   7                S01117 MOF60
     C           @RTCD     IFNE *BLANKS                                   S01117
     C           *LOCK     IN   LDA                                       MOF60
     C                     MOVE *BLANKS   DBKEY                           MOF60
     C                     MOVEL@DSNB     DBKEY            ***************S01117
     C                     MOVEL'SDBRCHPD'DBFILE           * DBERROR 12  *S01117
     C                     Z-ADD12        DBASE            ***************S01117
     C                     MOVE 'LE0300  'DBPGM                           MOF60
     C                     OUT  LDA                                       MOF60
     C                     SETON                     U7U8LR               S01117
     C                     EXSR *PSSR                                     S01117
     C                     GOTO ENDT                                      S01117
     C                     END                                            S01117
      *                                                                   S01117
     C                     END                                            S01117
      *                                                                   S01117
     C                     END                                            S01117
     C*
     C/COPY WNCPYSRC,LE0300C005
     C*    IF DETAIL 'A' RECORD READ
     C*
     C   02
     COR 03
     COR 04                EXSR DETA
     C*                                                                   MOF60
     C***  GET OUT IF ERROR                                               MOF60
     C*                                                                   MOF60
     C           *INU7     IFEQ '1'                                       MOF60
     C                     GOTO ENDT                                      MOF60
     C                     END                                            MOF60
     C*
     C*    IF DETAIL 'B' RECORD READ,
     C*
     C   05
     COR 06
     COR 07                EXSR DETB
     C*                                                                   S01408
     C/COPY WNCPYSRC,LE0300CPDR                                           S01408
     C*                                                                   S01408
     C*                                                                   MOF60
     C***  GET OUT IF ERROR                                               MOF60
     C*                                                                   MOF60
     C           *INU7     IFEQ '1'                                       MOF60
     C                     GOTO ENDT                                      MOF60
     C                     END                                            MOF60
     C*
     C*    IF TRAILER RECORD READ
     C*          AND CONTROL CHECKING NOT SUPPRESSED                      S01117
     C*
     C   08                EXSR TRLR
      **                                                                  S01117
      **   IF DETAIL PAGE PRINTED, SET ON APPROPIATE INDICATORS           S01117
      **                                                                  S01117
     C           *IN30     IFEQ '1'                                       S01117
     C                     SETON                     7475                 S01117
     C                     END                                            S01117
     C*
     C*
     C           ENDT      TAG                             ** ENDT TAG **
      *                                                                                       CLE024
      ** Access the Facility Extension detail file                                            CLE024
      *                                                                                       CLE024
     CL0                   MOVE *BLANKS   WXDEA   1                                           CLE039
     CL0                   MOVE *BLANKS   WXPOR   4                                           CLE024
     CL0                   Z-ADD*ZERO     WXLVR   30                                          CLE024
     CL0                   Z-ADD*ZERO     WXALV   30                                          CLE024
     CL0                   Z-ADD*ZERO     WXLVA   30                                          CLE024
     CL0                   Z-ADD*ZERO     WXLVW   30                                          CLE024
     CL0                   MOVE *BLANKS   WXSTC   1                                           CLE024
     CL0                   Z-ADD*ZERO     WXPWF   30                                          CLE024
     CL0                   Z-ADD*ZERO     WXPIS   30                                          CLE024
     CL0                   MOVE *BLANKS   WXOML  130                                          CFX001
     CL0                   MOVE *BLANKS   WXMST   3                                           CFX001
     CL0                   MOVE *BLANKS   WCGRP  20                                           CLE039
     CL0                   MOVEA*BLANKS   ARELIG                                              CLE039
     CL0                   MOVEA*BLANKS   ACG                                                 CLE039
      *                                                                                       CLE024
     CL0                   MOVE BRCA      KBRCA                                               CLE024
     CL0                   MOVE CNUMA     KCNUMA                                              CLE024
     CL0                   MOVE FACTA     KFACTA                                              CLE024
     CL0                   MOVE FCNOA     KFCNOA                                              CLE024
     CL0         *IN09     IFEQ *OFF                                                          CLE041
     CL0         KFCLT     CHAINLEFCLTLG             57                                       CLE024
     CL0                   ELSE                                                               CLE041
     CL0         KFCLT     CHAINLEAGFYL4             57                                       CLE041
     CL0                   ENDIF                                                              CLE041
      *                                                                                       CLE039
      ** If CLE039 is installed...                                                            CLE039
      *                                                                                       CLE039
     CL0         CLE039    IFEQ 'Y'                                                           CLE039
     CL0         *IN30     ANDEQ*ON                                                           CLE039
     CL0                   MOVE *ON       *IN43                                               CLE039
     CL0                   MOVE *OFF      *IN45                                               CLE039
     CL0                   MOVE *OFF      *IN47                                               CLE039
     CL0                   Z-ADD1         WCOLUM  10                                          CLE039
      *                                                                                       CLE039
     CL0         *IN57     IFEQ *OFF                                                          CLE039
     CL0         FCXCGP    IFNE *ZERO                                                         248525
     CL0                   CALL 'LE000020'                                                    CLE039
     CL0                   PARM *BLANKS   PRTCD                                               CLE039
     CL0                   PARM           FCXCGP                                              CLE039
     CL0                   PARM *BLANKS   DSELIG                                              CLE039
     CL0                   ENDIF                                                              248525
     CL0                   ENDIF                                                              CLE039
      *                                                                                       CLE039
      ** Report the Customer Group                                                            CLE039
      *                                                                                       CLE039
     CL0         FCXCGP    IFNE *ZERO                                                         CLE039
     CL0         *IN57     ANDEQ*OFF                                                          CLE041
     CL0                   MOVE FCXCGP    WCGRP                                               CLE039
     CL0                   MOVEAWCGRP     ACG                                                 CLE039
     CL0                   Z-ADD1         I       20                                          CLE039
     CL0         ACG,I     DOWEQ'0'                                                           CLE039
     CL0                   MOVE ' '       ACG,I                                               CLE039
     CL0                   ADD  1         I                                                   CLE039
     CL0                   ENDDO                                                              CLE039
     CL0                   MOVEAACG       WCGRP                                               CLE039
     CL0                   MOVE *ON       *IN45                                               CLE039
     CL0                   MOVE *ON       *IN47                                               CLE039
     CL0         *IN09     IFEQ *OFF                                                          CLE041
     CL0         P1OP      IFEQ 'Y'                                                           CLE041
     CL0                   EXCPTCUSGRP                                                        CLE039
     CL0                   ENDIF                                                              CLE041
     CL0                   ELSE                                                               CLE041
     CL0         P3OP      IFEQ 'Y'                                                           CLE041
     CL0                   EXCPTCUSGR3                                                        CLE041
     CL0                   ENDIF                                                              CLE041
     CL0                   ENDIF                                                              CLE041
     CL0                   MOVE *OFF      *IN47                                               CLE039
     CL0                   ENDIF                                                              CLE039
      *                                                                                       CLE039
     CL0                   MOVE CRNM      WCRNM  20                                           CLE039
     CL0                   MOVE BBCUST    WCUST   6                                           CLE039
     CL0                   Z-ADD1         X       30                                          CLE039
     CL0                   MOVEADSELIG    ARELIG                                              CLE039
      *                                                                                       CLE039
      ** Report the Eligible Customers                                                        CLE039
      *                                                                                       CLE039
     CL0         ARELIG,X  DOWNE*BLANKS                                                       CLE039
     CL0                   MOVE *BLANKS   WECUS  10                                           CLE039
     CL0                   MOVELARELIG,X  WECUS                                               CLE039
      *                                                                                       CLE039
     CL0                   CALL 'AOCUSTR0'                                                    CLE039
     CL0                   PARM *BLANKS   PRTCD                                               CLE039
     CL0                   PARM '*KEY   ' POPTN                                               CLE039
     CL0                   PARM WECUS     PCUST  10                                           CLE039
     CL0                   PARM *BLANKS   PKYST   7                                           CLE039
     CL0         SDCUST    PARM SDCUST    DSSDY                                               CLE039
      *                                                                                       CLE039
     CL0         PRTCD     IFNE *BLANKS                                                       CLE039
     CL0         *LOCK     IN   LDA                                                           CLE039
     CL0                   MOVEL'SDCUSTPD'DBFILE                                              CLE039
     CL0                   MOVELWECUS     DBKEY                                               CLE039
     CL0                   Z-ADD54        DBASE                                               CLE039
     CL0                   OUT  LDA                                                           CLE039
     CL0                   MOVE *ON       *INU7                                               CLE039
     CL0                   MOVE *ON       *INU8                                               CLE039
     CL0                   MOVE *ON       *INLR                                               CLE039
     CL0                   EXSR *PSSR                                                         CLE039
     CL0                   ENDIF                                                              CLE039
      *                                                                                       CLE039
     CL0         WCOLUM    IFEQ 1                                                             CLE039
     C*L0*******           MOVE ARELIG,X  WCUST1  60                                   CLE039 CSD027
     CL0                   MOVE ARELIG,X  WCUST1  6                                           CSD027
     CL0                   MOVELBBCSSN    WCSSN1 10                                           CLE039
     CL0                   MOVELCRNM      WCRNM1 20                                           CLE039
     CL0                   Z-ADD2         WCOLUM                                              CLE039
      *                                                                                       CLE039
     CL0                   ELSE                                                               CLE039
     C*L0*******           MOVE ARELIG,X  WCUST2  60                                   CLE039 CSD027
     CL0                   MOVE ARELIG,X  WCUST2  6                                           CSD027
     CL0                   MOVE BBCSSN    WCSSN2 10                                           CLE039
     CL0                   MOVE CRNM      WCRNM2 20                                           CLE039
     CL0                   Z-ADD1         WCOLUM                                              CLE039
      *                                                                                       CLE039
      ** Continue printing on next page when overflow occurs                                  CLE039
      *                                                                                       CLE039
     CL0         *INOF     IFEQ *ON                                                           CLE039
     CL0         *INOG     OREQ *ON                                                           CLE041
     CL0                   MOVE WCRNM     CRNM                                                CLE039
     CL0                   MOVE WCUST     BBCUST                                              CLE039
     CL0                   MOVE *ON       *IN43                                               CLE039
     CL0         *IN09     IFEQ *OFF                                                          CLE041
     CL0         P1OP      IFEQ 'Y'                                                           CLE041
     CL0                   EXCPTTOTOU1                                                        CLE039
     CL0                   ENDIF                                                              CLE041
     CL0                   ELSE                                                               CLE041
     CL0         P3OP      IFEQ 'Y'                                                           CLE041
     CL0                   EXCPTTOTO31                                                        CLE041
     CL0                   ENDIF                                                              CLE041
     CL0                   ENDIF                                                              CLE041
     CL0                   ENDIF                                                              CLE039
      *                                                                                       CLE039
     CL0                   MOVE *ON       *IN44                                               CLE039
      *                                                                                       242371
      ** If multi-customer and  no specific eligible customer                                 242371
      ** print 'ALL' instead of 'NONE'.                                                       242371
      *                                                                                       242371
     CL0                   MOVE 'NONE'    WNONE   4                                           242371
     CL0         MCSI      IFEQ 'Y'                                                           242371
     CL0         *IN45     ANDEQ*OFF                                                          242371
     CL0                   MOVE 'ALL '    WNONE                                               242371
     CL0                   ENDIF                                                              242371
      *                                                                                       242371
     CL0         *IN09     IFEQ *OFF                                                          CLE041
     CL0         P1OP      IFEQ 'Y'                                                           CLE041
     CL0                   EXCPTELICUS                                                        CLE039
     CL0                   ENDIF                                                              CLE041
     CL0                   ELSE                                                               CLE041
     CL0         P3OP      IFEQ 'Y'                                                           CLE041
     CL0                   EXCPTELICU3                                                        CLE041
     CL0                   ENDIF                                                              CLE041
     CL0                   ENDIF                                                              CLE041
     CL0                   MOVE *OFF      *IN43                                               CLE039
     CL0                   ENDIF                                                              CLE039
      *                                                                                       CLE039
     CL0                   ADD  1         X                                                   CLE039
     CL0                   ENDDO                                                              CLE039
      *                                                                                       CLE039
     CL0                   MOVE WCRNM     CRNM                                                CLE039
     CL0                   MOVE WCUST     BBCUST                                              CLE039
      *                                                                                       CLE039
      ** If WCOLUM is 2, still need to print the customer written in column 1                 CLE039
      ***If**IN45*is*off,*there*are*no*eligible*customers*so*print*'NONE'              CLE039 242371
      ** If *IN45 is off, check if multi-customer, then print 'ALL'                           242371
      ** if multi-customer, if not, print 'NONE'.                                             242371
      *                                                                                       CLE039
     CL0         WCOLUM    IFEQ 2                                                             CLE039
     CL0         *IN45     OREQ *OFF                                                          CLE039
      *                                                                                       CLE039
     CL0         *INOF     IFEQ *ON                                                           CLE039
     CL0         *INOG     OREQ *ON                                                           CLE041
     CL0                   MOVE *ON       *IN43                                               CLE039
     CL0         *IN09     IFEQ *OFF                                                          CLE041
     CL0         P1OP      IFEQ 'Y'                                                           CLE041
     CL0                   EXCPTTOTOU1                                                        CLE039
     CL0                   ENDIF                                                              CLE041
     CL0                   ELSE                                                               CLE041
     CL0         P3OP      IFEQ 'Y'                                                           CLE041
     CL0                   EXCPTTOTO31                                                        CLE041
     CL0                   ENDIF                                                              CLE041
     CL0                   ENDIF                                                              CLE041
     CL0                   ENDIF                                                              CLE039
      *                                                                                       CLE039
     CL0                   MOVE *OFF      *IN44                                               CLE039
     CL0         *IN09     IFEQ *OFF                                                          CLE041
     CL0         P1OP      IFEQ 'Y'                                                           CLE041
     CL0                   EXCPTELICUS                                                        CLE039
     CL0                   ENDIF                                                              CLE041
     CL0                   ELSE                                                               CLE041
     CL0         P3OP      IFEQ 'Y'                                                           CLE041
     CL0                   EXCPTELICU3                                                        CLE041
     CL0                   ENDIF                                                              CLE041
     CL0                   ENDIF                                                              CLE041
     CL0                   ENDIF                                                              CLE039
      *                                                                                       CLE039
     CL0                   MOVE *OFF      *IN43                                               CLE039
      *                                                                                       CLE039
      ** <End> If CLE039 is installed                                                         CLE039
      *                                                                                       CLE039
     CL0                   ENDIF                                                              CLE039
      *                                                                                       CLE024
      ** Print the Collateralised Lending fields                                              CLE024
      *                                                                                       CLE024
     CL0         CLE039    IFEQ 'Y'                                                           CLE039
     CL0         *IN30     ANDEQ*ON                                                           CLE039
     CL0         CLE025    OREQ 'Y'                                                           CLE025
     CL0         *IN30     ANDEQ*ON                                                           CLE025
     CL0         CLE024    OREQ 'Y'                                                           CLE024
     CL0         *IN30     ANDEQ*ON                                                           CLE024
     CL0         CFX001    OREQ 'Y'                                                           CFX001
     CL0         *IN30     ANDEQ*ON                                                           CFX001
      *                                                                                       CLE039
     CL0         CLE039    IFEQ 'Y'                                                           CLE039
     CL0                   MOVELFCXDEA    WXDEA                                               CLE039
     CL0                   ENDIF                                                              CLE039
      *                                                                                       CLE024
     CL0         CLE024    IFEQ 'Y'                                                           CLE024
     CL0                   MOVE FCXPOR    WXPOR                                               CLE024
     CL0                   MOVE FCXLVR    WXLVR                                               CLE024
     CL0                   MOVE FCXALV    WXALV                                               CLE024
     CL0                   MOVE FCXLVA    WXLVA                                               CLE024
     CL0                   MOVE FCXLVW    WXLVW                                               CLE024
     CL0                   MOVE FCXSTC    WXSTC                                               CLE024
     CL0                   MOVE FCXPWF    WXPWF                                               CLE024
     CL0                   MOVE FCXPIS    WXPIS                                               CLE024
     CL0                   ENDIF                                                              CLE024
      *                                                                                       CFX001
     CL0         CFX001    IFEQ 'Y'                                                           CFX001
     CL0         CLE025    OREQ 'Y'                                                           CLE025
     CL0                   MOVE FCXOML    WXOML                                               CFX001
     CL0                   MOVELFCXMST    WXMST                                               CFX001
     CL0                   ENDIF                                                              CFX001
      *                                                                                       CLE039
      ** Write facility extension details to LE0300P1.                                        CLE039
      ** Continue printing on next page when overflow occurs                                  CLE039
      *                                                                                       CLE039
     CL0         *IN09     IFEQ *OFF                                                          CLE041
     CL0         P1OP      IFEQ 'Y'                                                           CLE041
     CL0         *INOF     IFEQ *ON                                                           CLE039
     CL0                   MOVE *ON       *IN43                                               CLE039
     CL0                   EXCPTTOTOU1                                                        CLE039
     CL0                   ENDIF                                                              CLE039
     CL0                   EXCPTXFCLT1                                                        CLE039
      *                                                                                       CLE024
     CL0         *INOF     IFEQ *ON                                                           CLE024
     CL0                   MOVE *ON       *IN43                                               CLE024
     CL0                   EXCPTTOTOU1                                                        CLE024
     CL0                   ENDIF                                                              CLE024
     CL0                   EXCPTXFCLT2                                                        CLE024
      *                                                                                       CLE024
     CL0         *INOF     IFEQ *ON                                                           CLE024
     CL0                   MOVE *ON       *IN43                                               CLE024
     CL0                   EXCPTTOTOU1                                                        CLE024
     CL0                   ENDIF                                                              CLE024
     CL0                   EXCPTXFCLT3                                                        CLE024
      *                                                                                       CLE024
     CL0         *INOF     IFEQ *ON                                                           CLE024
     CL0                   MOVE *ON       *IN43                                               CLE024
     CL0                   EXCPTTOTOU1                                                        CLE024
     CL0                   ENDIF                                                              CLE024
     CL0                   EXCPTXFCLT4                                                        CLE024
      *                                                                                       CLE024
     CL0         *INOF     IFEQ *ON                                                           CLE024
     CL0                   MOVE *ON       *IN43                                               CLE024
     CL0                   EXCPTTOTOU1                                                        CLE024
     CL0                   ENDIF                                                              CLE024
     CL0                   EXCPTXFCLT5                                                        CLE024
      *                                                                                       CFX001
     CL0         *INOF     IFEQ *ON                                                           CFX001
     CL0                   MOVE *ON       *IN43                                               CFX001
     CL0                   EXCPTTOTOU1                                                        CFX001
     CL0                   ENDIF                                                              CFX001
     CL0                   EXCPTXFCLT6                                                        CFX001
     CL0                   ENDIF                                                              CLE041
      *                                                                                       CLE039
     CL0                   ELSE                                                               CLE041
      *                                                                                       CLE041
     CL0         P3OP      IFEQ 'Y'                                                           CLE041
     CL0         *INOG     IFEQ *ON                                                           CLE041
     CL0                   MOVE *ON       *IN43                                               CLE041
     CL0                   EXCPTTOTO31                                                        CLE041
     CL0                   ENDIF                                                              CLE041
     CL0                   EXCPTXFCL31                                                        CLE041
      *                                                                                       CLE041
     CL0         *INOG     IFEQ *ON                                                           CLE041
     CL0                   MOVE *ON       *IN43                                               CLE041
     CL0                   EXCPTTOTO31                                                        CLE041
     CL0                   ENDIF                                                              CLE041
     CL0                   EXCPTXFCL32                                                        CLE041
      *                                                                                       CLE041
     CL0         *INOG     IFEQ *ON                                                           CLE041
     CL0                   MOVE *ON       *IN43                                               CLE041
     CL0                   EXCPTTOTO31                                                        CLE041
     CL0                   ENDIF                                                              CLE041
     CL0                   EXCPTXFCL33                                                        CLE041
      *                                                                                       CLE041
     CL0         *INOG     IFEQ *ON                                                           CLE041
     CL0                   MOVE *ON       *IN43                                               CLE041
     CL0                   EXCPTTOTO31                                                        CLE041
     CL0                   ENDIF                                                              CLE041
     CL0                   EXCPTXFCL34                                                        CLE041
      *                                                                                       CLE041
     CL0         *INOG     IFEQ *ON                                                           CLE041
     CL0                   MOVE *ON       *IN43                                               CLE041
     CL0                   EXCPTTOTO31                                                        CLE041
     CL0                   ENDIF                                                              CLE041
     CL0                   EXCPTXFCL35                                                        CLE041
      *                                                                                       CLE041
     CL0         *INOG     IFEQ *ON                                                           CLE041
     CL0                   MOVE *ON       *IN43                                               CLE041
     CL0                   EXCPTTOTO31                                                        CLE041
     CL0                   ENDIF                                                              CLE041
     CL0                   EXCPTXFCL36                                                        CLE041
     CL0                   ENDIF                                                              CLE041
     CL0                   ENDIF                                                              CLE041
     CL0                   MOVE *OFF      *IN43                                               CLE039
     CL0                   MOVE *OFF      *INOF                                               CLE039
     CL0                   MOVE *OFF      *INOG                                               CLE041
     CL0                   ENDIF                                                              CLE039
     C*                                                                   MOF60
     C***  ENSURE END OF BRANCH OUTPUT                                    MOF60
     C*                                                                   MOF60
     CL1         *IN33     IFEQ '0'                                       MOF60
     CL1         *INU7     ANDEQ'0'                                       MOF60
     CL1         P1OP      ANDEQ'Y'                                       MOF60
     CL1         *IN33     OREQ '0'                                                           CLE041
     CL1         *INU7     ANDEQ'0'                                                           CLE041
     CL1         P3OP      ANDEQ'Y'                                                           CLE041
     CL1         *IN09     ANDEQ*ON                                                           CLE041
     CL1         *IN75     IFEQ '0'                                       138352
     CL1         *IN09     IFEQ *OFF                                                          CLE041
     CL1         P1OP      IFEQ 'Y'                                                           CLE041
     CL1                   EXCPTTOTOU1                                    138352
     CL1                   ENDIF                                                              CLE041
     CL1                   ELSE                                                               CLE041
     CL1         P3OP      IFEQ 'Y'                                                           CLE041
     CL1                   EXCPTTOTO31                                                        CLE041
     CL1                   ENDIF                                                              CLE041
     CL1                   ENDIF                                                              CLE041
     CL1                   ELSE                                           138352
     CL1         *IN09     IFEQ *OFF                                                          CLE041
     CL0         P1OP      IFEQ 'Y'                                                           CLE041
     CL1                   EXCPTTOTOU2                                    MOF60
     CL1                   ENDIF                                                              CLE041
     CL1                   ELSE                                                               CLE041
     CL0         P3OP      IFEQ 'Y'                                                           CLE041
     CL1                   EXCPTTOTO32                                                        CLE041
     CL1                   ENDIF                                                              CLE041
     CL1                   ENDIF                                                              CLE041
     CL0                   MOVE *OFF      *INOF                                               CLE039
     CL1                   MOVE *OFF      *INOG                                               CLE041
     CL1                   ENDIF                                          138352
     C***L1******CLE004    IFEQ 'Y'                                CLE004 187663
     CL1         CLE006    IFEQ 'Y'                                       187663
     CL1         OPEN2     ANDEQ'1'                                       CLE004
     CL1         *IN71     IFEQ *OFF                                      CLE004
     CL1                   WRITEHEADP2                                    CLE004
     CL1                   ENDIF                                          CLE004
     CL1                   WRITETRAIL2                                    CLE004
     CL1                   ENDIF                                          CLE004
     CL1                   END                                            MOF60
      **                                                                  S01117
      **   EXECUTE ERROR ROUTINE IF DATABASE ERROR EXISTS                 S01117
      **                                                                  S01117
     CLR         *INU7     IFEQ '1'                                       S01117
     CLR         *INU8     ANDEQ'1'                                       S01117
     CLR                   EXSR *PSSR                                     S01117
     CLR                   END                                            S01117
      **                                                                  S01117
      **   LAST RECORD PROCESSING                                         S01117
      ** ENSURE TOTALS SPOOL FILE RECORDED BY RCF                         S01117
     CLR                   Z-ADDSFNUMU    ZSNUMU  60                      S01117
     C*R********           OUT  LDA                                S01117 MOF60
     CLR                   CALL 'ZSFILE'                                  S01117
     CLR                   PARM           SEQ     5                       S01117
     C*R*********          PARM *BLANKS   SENTY   3                S01117 MOF60
     CLR                   PARM *BLANKS   SENTY                           MOF60
     CLR                   PARM           SFILEU                          S01117
     CLR                   PARM           ZSNUMU                          S01117
     CLR                   PARM           ZSERR                           S01117
      **                                                                  S01117
     C*R******** *LOCK     IN   LDA                                       MOF60
     CLR         ZSERR     IFEQ 'Y'                                       S01117
      **  ERROR DURING ZSFILE PROCESSING, RETURN TO CALLING PROGRAM       S01117
     CLR                   SETON                     U7U8LR               S01117
     CLR                   RETRN                                          S01117
     CLR                   END                                            S01117
     C**                                                                  S01117
      **                                                                  S01117
      **  OUTPUT THE FILE CONTROL, IF NOT ALREADY OUTPUT                  S01117
     CLR         *IN67     IFNE '1'                                       S01117
     CLR                   SETON                     66                   S01117
     CLR                   EXCPT                                          S01117
     CLR                   SETOF                     66                   S01117
     CLR                   END                                            S01117
      **********                                                   S01117 MOF60
      ***WHEN*LR*INDICATOR*SET*ON*WITHOUT*EXECUTING*THE*FIRST***   S01117 MOF60
      ***CYCLE**                                                   S01117 MOF60
     C*R******** P1OP      IFNE 'Y'                                S01117 MOF60
     C*R********           EXSR #ZZ                                S01117 MOF60
     C*R********           END                                     S01117 MOF60
     C*                                                                   MOF60
     C***  IF NOT MULTIBRANCH, OUTPUT END OF REPORT MESSAGE               MOF60
     C*                                                                   MOF60
     CLR         MBIN      IFEQ 'N'                                       MOF60
     CLR         P1OP      ANDEQ'Y'                                       MOF60
     CLR         MBIN      OREQ 'N'                                                           CLE041
     CLR         P3OP      ANDEQ'Y'                                                           CLE041
     CLR         *IN09     ANDEQ*ON                                                           CLE041
     CLR         *IN75     IFEQ '0'                                       138352
     CLR         *IN09     IFEQ *OFF                                                          CLE041
     CL0         P1OP      IFEQ 'Y'                                                           CLE041
     CLR                   EXCPTTOTOU1                                    138352
     CLR                   ENDIF                                                              CLE041
     CLR                   ELSE                                                               CLE041
     CL0         P3OP      IFEQ 'Y'                                                           CLE041
     CLR                   EXCPTTOTO31                                                        CLE041
     CLR                   ENDIF                                                              CLE041
     CLR                   ENDIF                                                              CLE041
     CLR                   ELSE                                           138352
     CLR         *IN09     IFEQ *OFF                                                          CLE041
     CL0         P1OP      IFEQ 'Y'                                                           CLE041
     CLR                   EXCPTTOTOU3                                    MOF60
     CLR                   ENDIF                                                              CLE041
     CLR                   ELSE                                                               CLE041
     CL0         P3OP      IFEQ 'Y'                                                           CLE041
     CLR                   EXCPTTOTO33                                                        CLE041
     CLR                   ENDIF                                                              CLE041
     CLR                   ENDIF                                                              CLE041
     CLR                   ENDIF                                          138352
     CLR                   END                                            MOF60
     C***LR******CLE004    IFEQ 'Y'                                CLE004 187663
     CLR         CLE006    IFEQ 'Y'                                       187663
     CLR         MBIN      ANDEQ'N'                                       CLE004
     CLR         OPEN2     ANDEQ'1'                                       CLE004
     CLR         *INU7     ANDNE*ON                                       CLE004
     CLR                   WRITETRAIL2                                    CLE004
     CLR                   END                                            CLE004
     C*                                                                   MOF60
     C***  IF ERROR AND P1 OPEN, REPORT IT                                MOF60
     C*                                                                   MOF60
     CLR         P1OP      IFEQ 'Y'                                       MOF60
     CLR         *IN09     ANDEQ*OFF                                                          CLE041
     CLR                   EXCPTTOTOUT                                    MOF60
     CLR                   END                                            MOF60
      *                                                                                       CLE041
     CLR         P3OP      IFEQ 'Y'                                                           CLE041
     CLR         *IN09     ANDEQ*ON                                                           CLE041
     CLR                   EXCPTTOTO3T                                                        CLE041
     CLR                   ENDIF                                                              CLE041
     C***LR******CLE004    IFEQ 'Y'                                CLE004 187663
     CLR         CLE006    IFEQ 'Y'                                       187663
     CLR         OPEN2     ANDEQ'1'                                       CLE004
     CLR         *INU7     ANDEQ*ON                                       CLE004
     CLR                   MOVE *ON       *IN70                           CLE004
     CLR                   WRITETRAIL2                                    CLE004
     CLR                   END                                            CLE004
     C*
     C********************************************************************
     C*
     C*    DETAIL 'A' RECORD PROCESSING
     C*
     C           DETA      BEGSR                           *** DETA ***
     C*
     C                     MOVE *OFF      *IN59                                               CLE106
     C                     MOVE *OFF      *IN60                                               CLE106
     C                     MOVE *OFF      *IN19                                               CLE106
     C***********          SETOF                     22                   MOF60
     C***********          SETOF                     282935               MOF60
     C                     SETOF                     2235                 MOF60
     C                     SETOF                     363738
     C*
     C*    RECORDS D,R,C - CHECK IF ACTIONED TODAY
     C*
     C   02
     COR 03
     C*R*04******LCD       COMP RUND                     22               S01117
     COR 04      LCDA      COMP RUND                     22               S01117
     C*
     C*    EXECUTE SUBROUTINE TO COUNT RECORDS READ
     C*
     C                     SETOF                     72                   S01117
     C                     EXSR COUNT
     C*
     C*
     C*    FOR EACH LIVE RECORD (ID = 'D' OR 'E'), MAINTAIN HASH TOTAL
     C*
     C   02
     COR 04                SETON                     12
     C   12                MOVE BLANKS    ZZAMT
     C   12                MOVE FAMT      ZZAMT
     C           *IN12     IFEQ '1'                                                           193603
     C           FAMT      ANDLT0                                                             193603
     C                     Z-SUBZZAMT     ZZAMT                                               193603
     C                     END                                                                193603
     C   12                Z-ADDLVTOTI    ZZTOTI
     C   12                Z-ADDLVTOTD    ZZTOTD
     C   12                EXSR GLZADD
     C   12                Z-ADDZZTOTI    LVTOTI 150
     C   12                Z-ADDZZTOTD    LVTOTD  30
     C                     SETOF                     12
     C*
     C*    IF NOT ACTIONED TODAY, NO FURTHER PROCESSING
     C*
     C  N22                GOTO ENDA
     C*
     C*    STORE CHANGE TYPE OF 'A' RECORD FOR OUTPUT
     C*
     C***********          MOVE CHTP      ACTN    1                       S01117
     C                     MOVE CHTPA     ACTN    1                       S01117
     C*
     C*****CHAIN*TO*CUSTOMER*FILE*FOR*CUSTOMER*NAME                       S01194
     C*
     C******               MOVELCNUM      CLINKY  7                       S01117
     C**********           MOVE 'A'       CLINKY                          S01194
     C********** CLINKY    CHAINCLINT                40                   S01194
     C                     MOVELCNUMA     CKEY                            S01194
     C                     MOVEL*BLANKS   KEYSTS                          S01194
     C                     CALL 'AOCUSTR0'PLIST1                          S01194
     C           @RTCD     IFNE *BLANKS                                   S01194
     C           RECIA     ANDNE'R'                                       059790
     C                     SETON                     U7U8LR               S01194
     C           *LOCK     IN   LDA                                       MOF60
     C                     MOVE '02'      DBASE                           S01194
     C                     MOVE 'SDCUSTPD'DBFILE                          S01194
     C                     MOVE *BLANKS   DBKEY                           MOF60
     C                     MOVELCKEY      DBKEY                           S01194
     C                     MOVE 'LE0300  'DBPGM                           MOF60
     C                     OUT  LDA                                       MOF60
     C                     GOTO ENDA                                      S01194
     C                     END                                            S01194
      *                                                                                      BUG3781
     C                     MOVE BBCUST    FCCUST  6                                          BUG3781
     C                     MOVE CRNM      FCCRNM 20                                          BUG3781
      *                                                                   141486
     C                     MOVEL*BLANKS   TNAM   20                       141486
     C                     MOVEL*BLANKS   TANM    6                       141486
     C                     MOVEL*BLANKS   TAFT    3                       141486
     C                     MOVEL*BLANKS   TAFN    2                       141486
     C                     MOVEL*BLANKS   RCAXR  14                       189544
     C                     MOVEL*BLANKS   RCMDI   1                       189544
     C                     MOVEL*BLANKS   RCOMD   7                       189544
     C/COPY WNCPYSRC,LEH00127
      *                                                                   CLE029
     C                     MOVEL*BLANKS   RSVCD   9                       CLE029
     C           CLE029    IFEQ 'Y'                                       CLE029
     C           SVCD      IFEQ *BLANKS                                   CLE029
     C           '*MISS'   CAT  'ING*':0  RSVCD                           CLE029
     C                     ELSE                                           CLE029
     C                     MOVELSVCD      RSVCD                           CLE029
     C                     ENDIF                                          CLE029
     C                     ENDIF                                          CLE029
      *                                                                   CLE029
     C***********CLE004    IFEQ 'Y'                                141486 187663
     C********** CLE006    IFEQ 'Y'                                187663 189544
     C           CLE005    IFEQ 'Y'                                       189544
     C           SYIN      ANDNE'Y'                                       141486
     C********** CANM      IFNE 0                                                      141486 CSD027
     C           CANM      IFNE *BLANKS                                                       CSD027
     C           TRCA      ANDEQ'TR'                                      141486
     C                     MOVE *BLANKS   CKEY                            141486
     C                     MOVELCANM      CKEY                            141486
     C                     MOVEL*BLANKS   KEYSTS                          141486
     C                     CALL 'AOCUSTR0'PLIST1                          141486
     C           @RTCD     IFNE *BLANKS                                   141486
     C           RECIA     ANDNE'R'                                       141486
     C           *LOCK     IN   LDA                                       141486
     C                     MOVE '11'      DBASE            ***************141486
     C                     MOVE 'SDCUSTPD'DBFILE           * DB ERROR 11 *141486
     C                     MOVE *BLANKS   DBKEY            ***************141486
     C                     MOVELCKEY      DBKEY                           141486
     C                     MOVE 'LE0300  'DBPGM                           141486
     C                     OUT  LDA                                       141486
     C                     SETON                     U7U8LR               141486
     C                     EXSR *PSSR                                     141486
     C                     GOTO ENDA                                      141486
     C                     ENDIF                                          141486
     C                     MOVELCRNM      TNAM                            141486
     C                     MOVELCANM      TANM                            141486
     C                     MOVELCAFT      TAFT                            141486
     C                     MOVELCAFN      TAFN                            141486
     C/COPY WNCPYSRC,LEH00128
      *                                                                   189544
      ** Format C/A exchange rate                                         189544
      *                                                                   189544
     C                     Z-ADD8         ZADEC                           189544
     C                     MOVEL*BLANKS   ZFIELD                          189544
     C                     MOVE CAXR      ZFIELD                          189544
     C                     EXSR ZEDIT                                     189544
     C                     MOVE ZFIELD    RCAXR  14                       189544
      *                                                                   189544
      * Move cmdi to rcmdi                                                189544
      *                                                                   189544
     C                     MOVELCMDI      RCMDI   1                       189544
      ******************************************************************               189544 246031
      **Format*COMD*to*ddmmyy*******************************************               189544 246031
      ******************************************************************               189544 246031
     C********** COMD      IFGT 0                                                      189544 246031
     C**********           MOVE *ON       *IN81                                        189544 246031
     C**********           Z-ADDCOMD      ZDAYNO                                       189544 246031
     C**********           EXSR ZDATE2                                                 189544 246031
     C**********           MOVE ZADATE    WCOMC   7                                    189544 246031
     C**********           MOVELWCOMC     RCOMD                                        189544 246031
     C**********           ENDIF                                                       189544 246031
      *                                                                   189544
     C                     ENDIF                                          141486
     C                     ENDIF                                          141486
      *                                                                                       246031
      * Format COMD to ddmmyy                                                                 246031
      *                                                                                       246031
     C           COMD      IFGT 0                                                             246031
     C                     MOVE *ON       *IN81                                               246031
     C                     Z-ADDCOMD      ZDAYNO                                              246031
     C                     EXSR ZDATE2                                                        246031
     C                     MOVE ZADATE    WCOMC   7                                           246031
     C                     MOVELWCOMC     RCOMD                                               246031
     C                     ENDIF                                                              246031
     C*                                                                   S01194
     C*    DATABASE ERROR IF LIVE RECORD NOT FOUND
     C*
     C**N40***** RECI      COMP 'D'                  4040                 S01194
     C***40*****           SETON                     U7U8LR               S01194
     C***40*****           MOVE '02'      DBASE                           S01194
     C***40*****           MOVE 'CLINT'   DBFILE                          S01194
     C***40*****           MOVELCLINKY    DBKEY                           S01194
     C***40*****           GOTO ENDA                                      S01194
     C*
     C*****CHAIN*TO*TABLE*FILE*FOR*CCY*DECIMAL*PLACES                     S01194
     C*    OBTAIN CCY DECIMAL PLACES FROM AOCURRR0                        S01194
     C*
     C**********           MOVEL'20      'TABKEY 12                       S01194
     C**********           MOVELFCCY      TKEY    4                       S01194
     C**********           MOVE '1'       TKEY                            S01194
     C**********           MOVE TKEY      TABKEY                          S01194
     C********** TABKEY    CHAINTABLE                41                   S01194
     C                     MOVELFCCY      CURKEY                          S01194
     C                     CALL 'AOCURRR0'PLIST2                          S01194
     C           @RTCD     IFNE *BLANKS                                   S01194
     C                     SETON                     U7U8LR               S01194
     C           *LOCK     IN   LDA                                       MOF60
     C                     MOVE '03'      DBASE                           S01194
     C**********           MOVE 'SDCURRR0'DBFILE                   S01194 MOF60
     C                     MOVE 'SDCURRPD'DBFILE                          MOF60
     C                     MOVE *BLANKS   DBKEY                           MOF60
     C                     MOVELCURKEY    DBKEY                           S01194
     C                     MOVE 'LE0300  'DBPGM                           MOF60
     C                     OUT  LDA                                       MOF60
     C                     GOTO ENDA                                      S01194
     C                     END                                            S01194
     C*
     C*    DATABASE ERROR IF LIVE RECORD NOT FOUND
     C*
     C**N41***** RECI      COMP 'D'                  4141                 S01194
     C***41*****           SETON                     U7U8LR               S01194
     C***41*****           MOVE '03'      DBASE                           S01194
     C***41*****           MOVE 'TABLE'   DBFILE                          S01194
     C***41*****           MOVELTABKEY    DBKEY                           S01194
     C***41*****           GOTO ENDA                                      S01194
     C*
     C*   DETERMINE NO. DECIMAL PLACES                       35=0
     C*                                                      36=1
     C           CDP       COMP 1                      3536  37=2
     C  N35N36   CDP       COMP 3                      3738  38=3
     C*
     C*****SET*INDICATOR*IF*CMMT*FEE*DETAILS*TO*BE*PRINTED******          MOF60
     C***********                                                         MOF60
     C***********FCTI      COMP 'C'                  292928               MOF60
     C*
     C           CLE007    IFEQ 'Y'                                                           208458
     C           SYIN      ANDNE'Y'                                                           208458
     C                     EXSR SRREIN                                                        208458
     C                     EXSR FILCRD                                                        208458
     C                     ENDIF                                                              208458
     C*                                                                   S01408
     C/COPY WNCPYSRC,LE0300CCP2                                           S01408
     C*                                                                   S01408
     C           ULX004    IFEQ 'Y'                                                           CER001
     C**********           Z-ADDCNUMA     KCNUM                                       CER001 CSD027A
     C                     MOVE CNUMA     KCNUM                                              CSD027A
     C                     Z-ADDFACTA     KFACT                                               CER001
     C                     Z-ADDFCNOA     KFCNO                                               CER001
      *                                                                                       CER001
      ** Chian to LEFCX2L0 file for european reporting details                                CER001
      *                                                                                       CER001
     C           KEYMX6    CHAINLEFCX2L0             43                                       CER001
     C           *IN43     IFEQ '1'                                                           CER001
     C**********           Z-ADDCNUMA     VNCNUM                                      CER001 CSD027A
     C                     MOVE CNUMA     VNCNUM                                             CSD027A
     C                     Z-ADDFACTA     VNFACT                                              CER001
     C                     Z-ADDFCNOA     VNFCNO                                              CER001
     C                     MOVE 'N'       VNSUBR                                              CER001
     C                     MOVE *BLANKS   VNMOBL                                              CER001
     C                     WRITEFCLTYMF6                                                      CER001
     C                     ENDIF                                                              CER001
     C                     ENDIF                                                              CER001
      *                                                                   138352
      ** Open Printer File LE0300P2 if not yet opened                     138352
      *                                                                   138352
     C***********CLE004    IFEQ 'Y'                                138352 187663
     C           CLE006    IFEQ 'Y'                                       187663
     C           *IN09     ANDEQ*OFF                                                          CLE041
     C           OPEN2     IFNE '1'                                       138352
     C                     OPEN LE0300P2                                  138352
     C                     Z-ADDSFNUM2    ZSNUM                           138352
     C                     CALL 'ZSFILE'                                  138352
     C                     PARM           SEQ                             138352
     C                     PARM BRCA      SENTY   3                       138352
     C                     PARM           SFILE2                          138352
     C                     PARM           ZSNUM                           138352
     C                     PARM           ZSERR   1                       138352
      *                                                                   138352
      ** Error during ZSFILE processing, return to calling program        138352
      *                                                                   138352
     C           ZSERR     IFEQ 'Y'                                       138352
     C                     SETON                     U7U8LR               138352
     C                     RETRN                                          138352
     C                     ENDIF                                          138352
     C                     ENDIF                                          138352
     C                     ENDIF                                          138352
      *                                                                   138352
     C*
      ** Call routines to format and write to printer file.               CLE004
      *                                                                   CLE004
     C***********CLE004    IFEQ 'Y'                                CLE004 187663
     C           CLE006    IFEQ 'Y'                                       187663
     C           SYIN      ANDEQ'Y'                                       CLE004
     C           OPEN2     ANDEQ'1'                                       CLE004
     C           *IN09     ANDEQ*OFF                                                          CLE041
     C                     EXSR REINP2                                    CLE004
     C                     EXSR FILLP2                                    CLE004
     C                     END                                            CLE004
      *                                                                   CLE004
     C           ENDA      ENDSR                           ** ENDA TAG **
     C*
     C*
     C********************************************************************
     C*
     C*    DETAIL 'B' RECORD PROCESSING
     C*
     C           DETB      BEGSR                           *** DETB ***
     C*
     C/COPY WNCPYSRC,LE0300C002
     C*
     C                     SETOF                     27
     C*
     C*    EXECUTE SUBROUTINE TO COUNT RECORDS READ
     C*
     C                     SETON                     72                   S01117
     C                     EXSR COUNT
     C*
     C*    IF NO INPUT TODAY, NO FURTHER PROCESSING
     C*
     C  N22                GOTO ENDB
     C*                                                                   MOF60
     C***  THIS NEXT BIT IS NEVER EXECUTED AS IF DO NOT HAVE AN 'A'       MOF60
     C***  REC WITH 'B' REC, THE 'B' WON'T GET ON THE JOINT LF.           MOF60
     C***  SIMILARILY, IF DO NOT HAVE A 'B' WITH AN 'A', THEN RECIB       MOF60
     C***  AND RCTPB ARE BLANK, AND SR/DETB WILL NOT BE EXECUTED.         MOF60
     C***  IF AN 'A' OR 'B' REC IS MISSING, THERE IS NOW ERROR            MOF60
     C***  PROCESSING AT THE START OF MAIN PROCESSING.                    MOF60
     C*                                                                   MOF60
     C**********                                                          MOF60
     C*****CHECK FOLLOWS CORRECT 'A' RECORD                               MOF60
     C**********                                                          MOF60
     C**********                                                          MOF60
     C********** DSA1      COMP DSB1                     27               MOF60
     C**********                                                          MOF60
     C*****IF*NOT SAME, DATABASE ERROR                                    MOF60
     C**********                                                          MOF60
     C**N27******          SETON                     U7U8LR               MOF60
     C**N27******          MOVE '04'      DBASE                           MOF60
     C**N27******          MOVE 'FCLTY'   DBFILE                          MOF60
     C***********                                                         MOF60
     C**N27******          MOVELCNUM      KEY1    9                S01117 MOF60
     C**N27******          MOVE FACT      KEY1                     S01117 MOF60
     C**N27******          MOVELCNUMA     KEY1    9                S01117 MOF60
     C**N27******          MOVE FACTA     KEY1                     S01117 MOF60
     C**N27******          MOVELKEY1      KEY2   11                       MOF60
     C**N27******          MOVE FCNO      KEY2                     S01117 MOF60
     C**N27******          MOVE FCNOA     KEY2                     S01117 MOF60
     C**N27******          MOVELKEY2      DBKEY                           MOF60
     C***********                                                         MOF60
     C*****CHECK*C/FEE*INDICATOR*AND*DETERMINE*WHETHER****                MOF60
     C*****C/FEE*DETAILS*TO*BE*PRINTED*******                             MOF60
     C***********                                                         MOF60
     C***28******CMFT      COMP ' '                      29  C/FEE BLANK  MOF60
     C*
     C*    CONVERT DAYNOS TO DATE FORMAT WHERE APPLICABLE
     C/COPY WNCPYSRC,LE0300C003
     C*
     C           DTAP      COMP 0                    50
     C   50                Z-ADDDTAP      ZDAYNO
     C   50                EXSR ZDATE2
     C   50                MOVE ZADATE    DTAPO   7
     C*
     C           DTEX      COMP 0                    51
     C   51                Z-ADDDTEX      ZDAYNO
     C   51                EXSR ZDATE2
     C   51                MOVE ZADATE    DTEXO   7
     C*
     C           DLFS      COMP 0                    52
     C   52                Z-ADDDLFS      ZDAYNO
     C   52                EXSR ZDATE2
     C   52                MOVE ZADATE    DLFSO   7
     C*
     C           RVDT      COMP 0                    53
     C   53                Z-ADDRVDT      ZDAYNO
     C   53                EXSR ZDATE2
     C   53                MOVE ZADATE    RVDTO   7
     C*                                                                                      246031A
     C                     MOVE *BLANKS   WCDTC                                              246031A
     C           CDTE      COMP 0                    63                                      246031A
     C           *IN63     IFEQ '1'                                                          246031A
     C           *IN11     ANDEQ'1'                                                          246031A
     C                     Z-ADDCDTE      ZDAYNO                                             246031A
     C                     EXSR ZDATE2                                                       246031A
     C                     MOVE ZADATE    WCDTC                                              246031A
     C                     ENDIF                                                             246031A
      *                                                                                       CER020
      ** Check if Feature CER020 is ON                                                        CER020
      *                                                                                       CER020
     C           CER020    IFEQ 'Y'                                                           CER020
      *                                                                                       CER020
      ** Initialize fields to BLANKS                                                          CER020
      *                                                                                       CER020
     C                     MOVE *BLANKS   RPEXD                                               CER020
     C                     MOVE *BLANKS   RPNXD                                               CER020
      *                                                                                       CER020
      ** Move file field to printer field                                                     CER020
      *                                                                                       CER020
     C           PEXD      IFNE *ZEROS                                                        CER020
      *                                                                                       CER020
     C                     MOVE PEXD      ZDAYNO                                              CER020
     C                     EXSR ZDATE2                                                        CER020
     C                     MOVE ZADATE    RPEXD                                               CER020
      *                                                                                       CER020
     C                     ENDIF                                                              CER020
      *                                                                                       CER020
     C           PNXD      IFNE *ZEROS                                                        CER020
      *                                                                                       CER020
     C                     MOVE PNXD      ZDAYNO                                              CER020
     C                     EXSR ZDATE2                                                        CER020
     C                     MOVE ZADATE    RPNXD                                               CER020
      *                                                                                       CER020
     C                     ENDIF                                                              CER020
      *                                                                                       CER020
     C                     ENDIF                                                              CER020
      *                                                                                       CER020
     C*
     C***********STDT      COMP 0                    54                   MOF60
     C**N29*54***          Z-ADDSTDT      ZDAYNO                          MOF60
     C**N29*54***          EXSR ZDATE2                                    MOF60
     C**N29*54***          MOVE ZADATE    STDTO   7                       MOF60
     C***********                                                         MOF60
     C***********EDDT      COMP 0                    55                   MOF60
     C**N29*55***          Z-ADDEDDT      ZDAYNO                          MOF60
     C**N29*55***          EXSR ZDATE2                                    MOF60
     C**N29*55***          MOVE ZADATE    EDDTO   7                       MOF60
     C***********                                                         MOF60
     C***********DUDT      COMP 0                    56                   MOF60
     C**N29*56***          Z-ADDDUDT      ZDAYNO                          MOF60
     C**N29*56***          EXSR ZDATE2                                    MOF60
     C**N29*56***          MOVE ZADATE    DUDTO   7                       MOF60
     C***********                                                         MOF60
     C*****CHECK*BILLING DAYS,*BASE*RATE,*DAYNOS.****                     MOF60
     C*****IF*ZERO*ON*FILE,*PRINT*BLANK*ON*REPORT.***                     MOF60
     C***********BLDY      COMP 0                    57                   MOF60
     C           RVDY      COMP 0                    58                   MOF60
     C**N29******BCOD      COMP 0                    59                   MOF60
     C**N29******BLDN      COMP 0                    60                   MOF60
     C*                                                                   MOF60
     C** TO OUTPUT PREVIOUS FACILITY AMOUNT OBTAIN DETAILS FROM LAST      MOF60
     C** RECORD ON HISTORY FILE                                           MOF60
     C*                                                                   MOF60
     C                     Z-ADDFACTA     HFACT                           MOF60
     C                     Z-ADDFCNOA     HFCNO                           MOF60
     C                     MOVE '0'       *IN78                           MOF60
     C           *IN09     IFEQ *OFF                                                          CLE041
     C           KEY001    SETGTHISUPD                                    MOF60
     C           KEY001    REDPEHISUPD                   88               MOF60
     C                     ELSE                                                               CLE041
     C           KEY001    SETGTLEAGHSL0                                                      CLE041
     C           KEY001    REDPELEAGHSL0                 88                                   CLE041
     C                     ENDIF                                                              CLE041
     C** RECORD FOUND ON HISTORY FILE                                     MOF60
     C           *IN88     IFEQ '0'                                       MOF60
     C           FAMT      ANDNEFACFAM                                    060978
     C           *IN09     ANDEQ*OFF                                                          CLE041
     C***********FAMT      ANDNEHAAAMT                             MOF60  060978
     C***********          Z-ADDHAAAMT    PRVAMT 130               MOF60  060978
     C                     Z-ADDFACFAM    PRVAMT 130                      060978
     C                     MOVE '1'       *IN78                           MOF60
     C                     END                                            MOF60
      *                                                                                       CLE041
     C           *IN88     IFEQ *OFF                                                          CLE041
     C           FAMT      ANDNEAIFCAM                                                        CLE041
     C           *IN09     ANDEQ*ON                                                           CLE041
     C                     Z-ADDAIFCAM    PRVAMT                                              CLE041
     C                     MOVE *ON       *IN78                                               CLE041
     C                     ENDIF                                                              CLE041
     C*                                                                   MOF60
     C** IF LAST CHANGE DATE FOR REVOLVING CREDIT INDICATOR IS NOT        MOF60
     C** BLANK THEN OUTPUT THIS DATE FOR REFERENCE.                       MOF60
     C*                                                                   058449
     C                     MOVE '0'       *IN79                           058449
     C*                                                                   058449
     C           RVCD      IFNE 0                                         MOF60
     C                     Z-ADDRVCD      ZDAYNO                          MOF60
     C                     EXSR ZDATE2                                    MOF60
     C                     MOVE ZADATE    RVCDO   7                       MOF60
     C                     MOVE '1'       *IN79                           MOF60
     C                     END                                            MOF60
     C*                                                                   MOF60
     C/COPY WNCPYSRC,LE0300C004
     C*    MAINTAIN COUNT NUMBER FACILITIES PRINTED
     C*
     C           NFAC      ADD  1         NFAC    50
     C*                                                                   MOF60
     C***  OPEN FILE IF NOT OPEN ALREADY                                  MOF60
     C*                                                                   MOF60
     C           OPENP1    IFEQ 'Y'                                       MOF60
     C           MBIN      ANDEQ'Y'                                       MOF60
     C           *IN09     ANDEQ*OFF                                                          CLE041
     C           P1OP      OREQ ' '                                       MOF60
     C           MBIN      ANDNE'Y'                                       MOF60
     C           *IN09     ANDEQ*OFF                                                          CLE041
     C**********                                                                       CLE015 208458
     C**If*CLE007*is*on*populate*the*Currency*Rollover*Details*********                CLE015 208458
     C********** CLE007    IFEQ 'Y'                                                    CLE015 208458
     C**********           EXSR FILCRD                                                 CLE015 208458
     C**********           ENDIF                                                       CLE015 208458
     C                     OPEN LE0300P1                                  MOF60
     C*                                                                   MOF60
     C***  SET OFF A FLAG FOR FILE OPENING PROCESSING                     MOF60
     C*                                                                   MOF60
     C                     MOVE *BLANKS   OPENP1  1                       MOF60
      **                                                                  MOF60
     C                     MOVE 'Y'       P1OP    1                       MOF60
     C*                                                                   MOF60
     C                     Z-ADD0         PAGE                            MOF60
     C** ENSURE REPORT SPOOL FILE RECORDED BY RCF                         MOF60
     C                     Z-ADDSFNUM     ZSNUM   60                      MOF60
     C                     CALL 'ZSFILE'                                  MOF60
     C                     PARM           SEQ                             MOF60
     C                     PARM BRCA      SENTY   3                       MOF60
     C                     PARM           SFILE                           MOF60
     C                     PARM           ZSNUM                           MOF60
     C                     PARM           ZSERR   1                       MOF60
     C*                                                                   MOF60
     C           ZSERR     IFEQ 'Y'                                       MOF60
     C**  ERROR DURING ZSFILE PROCESSING, RETURN TO CALLING PROGRAM       MOF60
     C                     SETON                     U7U8LR               MOF60
     C                     RETRN                                          MOF60
     C                     END                                            MOF60
      *                                                                   CLE004
     C***********CLE004    IFEQ 'Y'                                CLE004 187663
     C           CLE006    IFEQ 'Y'                                       187663
     C           *IN09     ANDEQ*OFF                                                          CLE041
     C           OPEN2     IFNE '1'                                       CLE004
     C                     OPEN LE0300P2                                  CLE004
     C                     Z-ADDSFNUM2    ZSNUM                           CLE004
     C                     CALL 'ZSFILE'                                  CLE004
     C                     PARM           SEQ                             CLE004
     C                     PARM BRCA      SENTY   3                       CLE004
     C                     PARM           SFILE2                          CLE004
     C                     PARM           ZSNUM                           CLE004
     C                     PARM           ZSERR   1                       CLE004
      *                                                                   CLE004
      ** Error during ZSFILE processing, return to calling program        CLE004
      *                                                                   CLE004
     C           ZSERR     IFEQ 'Y'                                       CLE004
     C                     SETON                     U7U8LR               CLE004
     C                     RETRN                                          CLE004
     C                     ENDIF                                          CLE004
     C                     ENDIF                                          CLE004
     C                     ENDIF                                          CLE004
     C*                                                                   MOF60
     C                     END                                            MOF60
      *                                                                                       CLE041
     C           OPENP3    IFEQ 'Y'                                                           CLE041
     C           MBIN      ANDEQ'Y'                                                           CLE041
     C           *IN09     ANDEQ*ON                                                           CLE041
     C           P3OP      OREQ ' '                                                           CLE041
     C           MBIN      ANDNE'Y'                                                           CLE041
     C           *IN09     ANDEQ*ON                                                           CLE041
      *                                                                                       CLE041
     C                     OPEN LE0300P3                                                      CLE041
      *                                                                                       CLE041
      ** Set off a flag for file opening proccessing                                          CLE041
      *                                                                                       CLE041
     C                     MOVE *BLANKS   OPENP3  1                                           CLE041
      *                                                                                       CLE041
     C                     MOVE 'Y'       P3OP    1                                           CLE041
     C                     Z-ADD0         PAGE                                                CLE041
      *                                                                                       CLE041
      ** Ensure report SPOOL3 file recorded by RCF                                            CLE041
      *                                                                                       CLE041
     C                     Z-ADDSFNUM3    ZSNUM   60                                          CLE041
     C                     CALL 'ZSFILE'                                                      CLE041
     C                     PARM           SEQ                                                 CLE041
     C                     PARM BRCA      SENTY                                               CLE041
     C                     PARM           SFILE3                                              CLE041
     C                     PARM           ZSNUM                                               CLE041
     C                     PARM           ZSERR                                               CLE041
      *                                                                                       CLE041
      ** Error during ZSFILE proccessing, return to calling program                           CLE041
      *                                                                                       CLE041
     C           ZSERR     IFEQ 'Y'                                                           CLE041
     C                     SETON                     U7U8LR                                   CLE041
     C                     RETRN                                                              CLE041
     C                     ENDIF                                                              CLE041
     C                     ENDIF                                                              CLE041
     C*
     C*    SET ON INDICATOR FOR OUTPUT TO PRINTER
     C*
     C           SYIN      IFNE 'Y'                                       138352
     C***/COPY*WNCPYSRC,LEH01005***                                                           CFC006
     C/COPY WNCPYSRC,LEH01005                                                               MD020563
     C           SUPFLG    IFNE 'Y'                                                           CFC006
     C                     SETON                     30
     C           CLE007    IFEQ 'Y'                                       CLE015
     C                     SETON                     15                   CLE015
     C                     ENDIF                                          CLE015
     C***/COPY*WNCPYSRC,LEH01006***                                                           CFC006
     C/COPY WNCPYSRC,LEH01006                                                               MD020563
     C                     ENDIF                                                              CFC006
     C                     ENDIF                                          138352
     C*
     C/COPY WNCPYSRC,LE0300CCP3                                           S01408
     C*
     C           ENDB      ENDSR                           ** ENDB TAG **
     C*
     C********************************************************************
     C*
     C*    SUBROUTINE TO COUNT RECORDS INPUT (A & B)
     C*
     C           COUNT     BEGSR                           *** COUNT ***
     C*
     C                     SETOF                     242526               S01117
     C*
     C*    FOR EACH LIVE RECORD (ID = 'D' OR 'E'), MAINTAIN COUNT
     C   02
     COR 04
     COR 05
     COR 07      NROF      ADD  1         NROF    50
     C*
     C*
     C*    IF 'A' RECORD SHOWED NO INPUT TODAY, NO FURTHER PROCESSING
     C*
     C  N22                GOTO ENDSR
     C*
     C*    DETERMINE CHANGE TYPE
     C*
     C***********CHTP      COMP 'I'                      24               S01117
     C**N24******CHTP      COMP 'A'                      25               S01117
     C**N24N25***CHTP      COMP 'R'                      26               S01117
     C**N24N25N26CHTP      COMP 'C'                      26               S01117
     C*                                                                   S01117
     C*    FOR 'A' PART OF RECORD                                         S01117
     C           *IN72     IFEQ '0'                                       S01117
     C           CHTPA     COMP 'I'                      24               S01117
     C  N24      CHTPA     COMP 'A'                      25               S01117
     C  N24N25   CHTPA     COMP 'R'                      26               S01117
     C  N24N25N26CHTPA     COMP 'C'                      26               S01117
     C                     END                                            S01117
     C*                                                                   S01117
     C*    FOR 'B' PART OF RECORD                                         S01117
     C           *IN72     IFEQ '1'                                       S01117
     C           CHTPB     COMP 'I'                      24               S01117
     C  N24      CHTPB     COMP 'A'                      25               S01117
     C  N24N25   CHTPB     COMP 'R'                      26               S01117
     C  N24N25N26CHTPB     COMP 'C'                      26               S01117
     C                     END                                            S01117
     C*
     C*    FOR EACH RECORD AMENDED REVERSED OR CLOSED TODAY,
     C*    CHECK IF ALSO INSERTED TODAY
     C*
     C   25
     COR 26      ORED      COMP RUND                     24
     C*
     C*    MAINTAIN COUNT NUMBER RECORDS INSERTED
     C*
     C   24      NRINS     ADD  1         NRINS   50
     C*
     C*    MAINTAIN COUNT NUMBER RECORDS REVERSED/CLOSED
     C*
     C   26      NRDEL     ADD  1         NRDEL   50
     C*
     C*
     C           ENDSR     ENDSR                           ** ENDSR TAG **
     C*
     C*
     C********************************************************************
     C* SUBROUTINE TO ADD AN AMOUNT (ZZAMT) TO THE TOTAL (ZZTOTI,ZZTOTD)
     C*   IND '99' IS SET BY AN OVERFLOW ERROR
     C*
     CSR         GLZADD    BEGSR                           *** GLZADD ****
     C*
     CSR                   Z-ADDZZAMT     ZZAMT  153     91-DEFINE ZZAMT
     CSR 91                GOTO ZZAEND                     AMT = 0.BYPASS
     C*
     C* SPLIT ZZAMT INTO INTEGER AND DECIMAL FIELDS
     CSR                   Z-ADDZZAMT     ZZAMTI 150       INTEGER FIELD
     CSR                   MOVE ZZAMT     ZZAMTD  30       DECIMAL FIELD
     C* BOTH ZZAMTI AND ZZAMTD CONTAIN A 'SIGN' ZONE NOW
     C*
     CSR                   EXSR GLZSUM
     CSR         ZZAEND    ENDSR                           ** ZZAEND TAG *
     C*
     C********************************************************************
     C* SUBROUTINE TO CARRY OUT THE ADDITION FOR SUBROUTINES -
     C*                        GLZADD, GLZSUB, GLZCMP.
     C*          PARAMETERS PASSED -
     C*                     I/P ZZAMTI ZZAMTD
     C*                     O/P ZZTOTI ZZTOTD ZZNEGD IND 96 IND 99.
     C*
     CSR         GLZSUM    BEGSR                           *** GLZSUM ****
     C*
     CSR                   Z-ADDZZTOTI    ZZTOTI 150       DEFINE ZZTOTI
     CSR                   Z-ADDZZTOTD    ZZTOTD  30       DEFINE ZZTOTD
     CSR                   SETOF                     919293
     CSR                   SETOF                     949599
     C*
     C*    DETERMINE SIGN OF ZZAMTI & D,   92 IF NEG
     CSR         ZZAMTI    COMP 0                      9293
     CSR 93      ZZAMTD    COMP 0                      9293
     CSR 93                GOTO ZZSEND                     ZERO BYPASS
     C*
     C*    DETERMINE SIGN OF ZZTOTI & D, 91 IF NEG.
     CSR         ZZTOTI    COMP 0                      9193
     CSR 93      ZZTOTD    COMP 0                      9193
     C*
     C*    IF ZZTOTAL IS ZERO, RETURN ZZAMOUNT.
     CSR 93                Z-ADDZZAMTI    ZZTOTI
     CSR 93                Z-ADDZZAMTD    ZZTOTD
     CSR 93                GOTO ZZSEND                     ZERO BYPASS
     C*    IF SIGNS DIFFER BYPASS OVERFLOW CHECKS.
     CSR 91N92
     CORN91 92             GOTO ZZOFPS
     C*
     CSR         ZZAMTD    ADD  ZZTOTD    ZZWK2   40
     CSR         ZZWK2     COMP 999                  93    '93' = CARRY
     CSRN93      ZZWK2     COMP -999                   93    INTO INTEGER.
     C*
     CSR 93N92   ZZAMTI    ADD  1         ZZWK3  150       ADD 'CARRY' +VE
     CSR    93 92ZZAMTI    SUB  1         ZZWK3            SUB 'CARRY' -VE
     CSR 93      ZZTOTI    ADD  ZZWK3     ZZWK3
     CSRN93      ZZTOTI    ADD  ZZAMTI    ZZWK3
     C*
     C* IF THE MODULUS OF ZZWK3 IS LT MOD. ZZTOTI THEN O/F HAS OCCURED
     CSRN92      ZZWK3     COMP ZZTOTI                 99  -92 MEANS NOS.
     CSR 92      ZZWK3     COMP ZZTOTI               99     NEGATIVE
     CSRN99                Z-ADDZZWK2     ZZTOTD
     CSRN99                Z-ADDZZWK3     ZZTOTI
     C*
     C* IF O/F ZEROIZE ZZAMT , IND '99' SET AND ZZTOT FIELDS LEFT INTACT.
     CSR 99                Z-ADD0         ZZAMT  153
     CSR                   GOTO ZZSEND
     C*
     C* THE 'SIGNS' ARE DIFFERENT
     CSR         ZZOFPS    TAG                             ** ZZOFPS TAG**
     C* IF ZZAMT WAS NEGATIVE, MAKE IT POS. TO COMP WITH ZZTOT
     C*
     CSR 92                Z-SUBZZAMTI    ZZAMTI 150
     CSR 92                Z-SUBZZAMTD    ZZAMTD  30
     C*
     C* IF ZZTOT WAS NEGATIVE, MAKE IT POS. TO COMP WITH ZZAMT.
     C*
     CSR 91                Z-SUBZZTOTI    ZZTOTI
     CSR 91                Z-SUBZZTOTD    ZZTOTD
     C* BOTH ZZAMT AND ZZTOT ARE NOW POSITIVE.
     C*
     CSR         ZZTOTI    COMP ZZAMTI               93  95
     CSR 95      ZZTOTD    COMP ZZAMTD               93  95
     C*
     C* IF ZZTOT EQ. ZZAMT RETURN ZERO.
     CSR 95                Z-ADD0         ZZTOTI
     CSR 95                Z-ADD0         ZZTOTD
     CSR 95                GOTO ZZSEND
     C*
     C* IF ZZTOT GT. ZZAMT.
     CSR 93      ZZAMTD    COMP ZZTOTD               94
     CSR 93 94   ZZTOTI    SUB  1         ZZTOTI
     CSR 93 94   ZZTOTD    ADD  1000      ZZWK2
     CSR 93      ZZTOTI    SUB  ZZAMTI    ZZTOTI
     CSR 93 94   ZZWK2     SUB  ZZAMTD    ZZTOTD
     CSR 93N94   ZZTOTD    SUB  ZZAMTD    ZZTOTD
     C*
     C*
     C* IF ZZAMT GT. ZZTOT.
     CSRN93      ZZTOTD    COMP ZZAMTD               94
     CSRN93 94   ZZAMTI    SUB  1         ZZWK3  150
     CSRN93 94   ZZAMTD    ADD  1000      ZZWK2
     CSRN93 94   ZZWK3     SUB  ZZTOTI    ZZTOTI
     CSRN93N94   ZZAMTI    SUB  ZZTOTI    ZZTOTI
     CSRN93 94   ZZWK2     SUB  ZZTOTD    ZZTOTD
     CSRN93N94   ZZAMTD    SUB  ZZTOTD    ZZTOTD
     C*
     C* REVERSE SIGN OF ZZTOT IF LARGER I/P FIELDS WERE NEGATIVE
     CSR                   SETOF                     94
     CSR 93 91
     CORN93 92             SETON                     94
     CSR 94                Z-SUBZZTOTI    ZZTOTI
     CSR 94                Z-SUBZZTOTD    ZZTOTD
     C**
     C**   RESTORE SIGN OF ZZAMTI & ZZAMTD IF IT WAS REVERSED.
     CSR 92                Z-SUBZZAMTI    ZZAMTI
     CSR 92                Z-SUBZZAMTD    ZZAMTD
     CSR         ZZSEND    TAG                             ** ZZSEND TAG *
     C**
     C**   IF ZZTOTD IS ZERO, AND ZZTOTI IS NEG. SET UP ZZNEGD.
     CSR                   SETOF                     96
     CSR         ZZTOTD    COMP 0                        91
     CSR 91      ZZTOTI    COMP 0                      96
     CSR 96                MOVE '.000-'   ZZNEGD  5
     CSR                   ENDSR                             ** ENDSR **
     C*
     C********************************************************************
     C*
     C*    TRAILER PROCESSING
     C*
     C           TRLR      BEGSR                           *** TRLR ***
     C*
     C*****IF*NO*FACILITIES*TO*PRINT,*OUTPUT*MESSAGE****                  S01117
     C*
     C           NFAC      COMP 0                        34
     C***34******          SETON                     67OF                 S01117
     C***67******          EXCPT                                          S01117
     C***********          SETOF                     67                   S01117
     C*
     C*    VERIFY TOTAL NUMBER RECORDS ON FILE CONTROLS
     C*
     C           NLRB      ADD  NINS      FCONT   50
     C           FCONT     SUB  NDEL      FCONT
     C           FCONT     COMP NLRA                     31
      *                                                                                       CLE041
     C           CLE025    IFEQ 'Y'                                                           CLE041
     C                     READ LEAGFZPD                 10                                   CLE041
     C                     ENDIF                                                              CLE041
      *                                                                                       CLE041
      ** Verify total number of reocrds on file controls                                      CLE041
      *                                                                                       CLE041
     C           CLE025    IFEQ 'Y'                                                           CLE041
     C           *IN10     ANDEQ*OFF                                                          CLE041
     C           AGNLRB    ADD  AGNINS    WFCONT  50                                          CLE041
     C           WFCONT    SUB  AGNDEL    WFCONT                                              CLE041
     C           WFCONT    COMP AGNLRA                   31                                   CLE041
      *                                                                                       CLE041
     C           NINS      ADD  AGNINS    WNINS                                               CLE041
     C           NDEL      ADD  AGNDEL    WNDEL                                               CLE041
      *                                                                                       CLE041
     C                     ELSE                                                               CLE041
     C                     Z-ADDNINS      WNINS                                               CLE041
     C                     Z-ADDNDEL      WNDEL                                               CLE041
     C                     ENDIF                                                              CLE041
     C*
     C*    IF NOT EQUAL SET SWITCH AND SKIP FURTHER CHECKS
     C*
     C**N31*****           SETON                     U8                                       236008
     C***U8*****           GOTO EXCPT                                                         236008
     C           *IN31     IFEQ '0'                                                           236008
     C                     SETON                     11                                       236008
     C                     ENDIF                                                              236008
     C*
     C*    VERIFY HASH TOTALS ON FILE CONTROLS
     C*
     C*    VALUE LIVE RECORDS BEFORE INPUT:
     C                     Z-ADDVLBF      ZZAMTI
     C                     MOVE VLBL      ZZAMTD
     C                     Z-ADD0         ZZTOTI
     C                     Z-ADD0         ZZTOTD
     C                     EXSR GLZSUM
     C                     Z-ADDVLBF      WVLBF                                               CLE041
     C                     Z-ADDVLBL      WVLBL                                               CLE041
     C           CLE025    IFEQ 'Y'                                                           CLE041
     C           *IN10     ANDEQ*OFF                                                          CLE041
     C                     Z-ADDAGVLBF    ZZAMTI                                              CLE041
     C                     Z-ADDAGVLBL    ZZAMTD                                              CLE041
     C                     EXSR GLZSUM                                                        CLE041
     C                     ADD  AGVLBF    WVLBF                                               CLE041
     C           VLBL      ADD  AGVLBL    WTMP40  40                                          CLE041
     C           WTMP40    IFGT 999                                                           CLE041
     C                     ADD  1         WVLBF                                               CLE041
     C                     ENDIF                                                              CLE041
     C                     MOVE WTMP40    WVLBL                                               CLE041
     C                     ENDIF                                                              CLE041
     C*
     C*    ADD VALUE INSERTIONS:
     C                     Z-ADDVRIF      ZZAMTI
     C                     MOVE VRIL      ZZAMTD
     C                     EXSR GLZSUM
     C                     Z-ADDVRIF      WVRIF                                               CLE041
     C                     Z-ADDVRIL      WVRIL                                               CLE041
     C           CLE025    IFEQ 'Y'                                                           CLE041
     C           *IN10     ANDEQ*OFF                                                          CLE041
     C                     Z-ADDAGVRIF    ZZAMTI                                              CLE041
     C                     Z-ADDAGVRIL    ZZAMTD                                              CLE041
     C                     EXSR GLZSUM                                                        CLE041
     C                     ADD  AGVRIF    WVRIF                                               CLE041
     C           VRIL      ADD  AGVRIL    WTMP40                                              CLE041
     C           WTMP40    IFGT 999                                                           CLE041
     C                     ADD  1         WVRIF                                               CLE041
     C                     ENDIF                                                              CLE041
     C                     MOVE WTMP40    WVRIL                                               CLE041
     C                     ENDIF                                                              CLE041
     C*
     C*    ADD VALUE AMENDMENTS:
     C                     Z-ADDVRAF      ZZAMTI
     C                     MOVE VRAL      ZZAMTD
     C                     EXSR GLZSUM
     C           CLE025    IFEQ 'Y'                                                           CLE041
     C           *IN10     ANDEQ*OFF                                                          CLE041
     C                     Z-ADDAGVRAF    ZZAMTI                                              CLE041
     C                     Z-ADDAGVRAL    ZZAMTD                                              CLE041
     C                     EXSR GLZSUM                                                        CLE041
     C                     ENDIF                                                              CLE041
     C*
     C*    CHANGE SIGN OF VALUE DELETIONS, AND ADD
     C                     Z-SUBVRDF      VRDF
     C                     Z-SUBVRDL      VRDL
     C                     Z-ADDVRDF      ZZAMTI
     C                     MOVE VRDL      ZZAMTD
     C                     EXSR GLZSUM
     C*
     C*    RESTORE SIGN OF VALUE DELETIONS
     C                     Z-SUBVRDF      VRDF
     C                     Z-SUBVRDL      VRDL
      *                                                                                       CLE041
     C                     Z-ADDVRDF      WVRDF                                               CLE041
     C                     Z-ADDVRDL      WVRDL                                               CLE041
     C           CLE025    IFEQ 'Y'                                                           CLE041
     C           *IN10     ANDEQ*OFF                                                          CLE041
     C                     Z-SUBAGVRDF    ZZAMTI                                              CLE041
     C                     Z-SUBAGVRDL    ZZAMTD                                              CLE041
     C                     EXSR GLZSUM                                                        CLE041
     C                     ADD  AGVRDF    WVRDF                                               CLE041
     C           VRDL      ADD  AGVRDL    WTMP40                                              CLE041
     C           WTMP40    IFGT 999                                                           CLE041
     C                     ADD  1         WVRDF                                               CLE041
     C                     ENDIF                                                              CLE041
     C                     MOVE WTMP40    WVRDL                                               CLE041
     C                     ENDIF                                                              CLE041
      *                                                                                       CLE041
     C           CLE025    IFEQ 'Y'                                                           CLE041
     C           *IN10     ANDEQ*OFF                                                          CLE041
      *                                                                                       CLE041
      ** Compare above hash totals with file controls                                         CLE041
      *                                                                                       CLE041
     C           VLAF      ADD  AGVLAF    WVLAF                                               CLE041
     C           VLAL      ADD  AGVLAL    WTMP40                                              CLE041
     C           WTMP40    IFGT 999                                                           CLE041
     C                     ADD  1         WVLAF                                               CLE041
     C                     ENDIF                                                              CLE041
     C                     MOVE WTMP40    WVLAL                                               CLE041
     C           NLRA      ADD  AGNLRA    WNLRA                                               CLE041
     C           NLRB      ADD  AGNLRB    WNLRB                                               CLE041
      *                                                                                       CLE041
     C           ZZTOTI    COMP WVLAF                    31                                   CLE041
     C   31      ZZTOTD    COMP WVLAL                    31                                   CLE041
      *                                                                                       CLE041
      ** If equal,compare with report hash totals                                             CLE041
      *                                                                                       CLE041
     C   31      NROF      COMP WNLRA                    31                                   CLE041
     C   31      LVTOTI    COMP WVLAF                    31                                   CLE041
     C   31      LVTOTD    COMP WVLAL                    31                                   CLE041
      *                                                                                       CLE041
     C                     ELSE                                                               CLE041
     C*
     C*    COMPARE ABOVE HASH TOTALS WITH FILE CONTROLS
     C*
     C           ZZTOTI    COMP VLAF                     31
     C   31      ZZTOTD    COMP VLAL                     31
     C*
     C*    IF EQUAL, COMPARE WITH REPORT HASH TOTALS
     C*
     C   31      NROF      COMP NLRA                     31
     C   31      LVTOTI    COMP VLAF                     31
     C   31      LVTOTD    COMP VLAL                     31
      *                                                                                       CLE041
     C                     Z-ADDNLRA      WNLRA                                               CLE041
     C                     Z-ADDNLRB      WNLRB                                               CLE041
     C                     Z-ADDVLAF      WVLAF                                               CLE041
     C                     Z-ADDVLAL      WVLAL                                               CLE041
     C                     ENDIF                                                              CLE041
     C*
     C**N31*****           SETON                     U8                                       236008
     C           *IN31     IFEQ '0'                                                           236008
     C                     SETON                     11                                       236008
     C                     ENDIF                                                              236008
     C*
     C           EXCPT     TAG                             ** EXCPT TAG **
     C*
     C*    CHECK VALUE FOR EDITING ON REPORT
     C*
     C           VRAF      COMP 0                      65
     C  N65      VRAL      COMP 0                      65
     C   65                Z-SUBVRAL      VRAL
      *                                                                                       CLE041
     C                     Z-ADDVRAF      WVRAF                                               CLE041
     C                     Z-ADDVRAL      WVRAL                                               CLE041
      *                                                                                       CLE041
     C           CLE025    IFEQ 'Y'                                                           CLE041
     C           *IN10     ANDEQ*OFF                                                          CLE041
      *                                                                                       CLE041
      ** Check value for editing on report  for AGFCLTZZ                                      CLE041
      *                                                                                       CLE041
     C           AGVRAF    COMP 0                      65                                     CLE041
     C  N65      AGVRAL    COMP 0                      65                                     CLE041
     C   65                Z-SUBAGVRAL    AGVRAL                                              CLE041
      *                                                                                       CLE041
     C                     ADD  AGVRAF    WVRAF                                               CLE041
     C           VRAL      ADD  AGVRAL    WTMP40                                              CLE041
     C           WTMP40    IFGT 999                                                           CLE041
     C                     ADD  1         WVRAF                                               CLE041
     C                     ENDIF                                                              CLE041
     C                     MOVE WTMP40    WVRAL                                               CLE041
     C                     ENDIF                                                              CLE041
     C*
     C*    EXCEPTION OUTPUT FOR FILE CONTROLS
     C*
     C***********          SETON                     66OF                 S01117
     C                     SETON                     6667                 S01117
     C                     EXCPT
     C                     SETOF                     66
     C                     SETON                     31                                       236008
     C*
     C*    IF FILE CONTROLS BALANCE, UPDATE FACILITY TRAILER
     C*   ALSO CHECK FOR PREVIOUS DATABASE ERROR                          S01117
     C*
     C***31N34*************EXSR UPDATE                                    S01117
     C   31N34NU8          EXSR UPDATE                                    S01117
     C*
     C                     ENDSR
     C*
     C*
     C********************************************************************MOF60
     C***********                                                         MOF60
     C*****ZSYSTM*SR.*TO*CHAIN*TO*THE*INSTALLATION*CONTROL*DATA*RECORD.***MOF60
     C***********                                                         MOF60
     C***********ZSYSTM    BEGSR                           *** ZSYSTM *** MOF60
     C***********                                                         MOF60
     C*****SET*UP*KEY*FOR*INSTALLATION*CONTROL*RECORD.********************MOF60
     C***********          MOVEL'01      'ZTABKY 12                S01194 MOF60
     C***********          MOVE '  10'    ZTABKY                   S01194 MOF60
     C***********ZTABKY    CHAINTABLE                99    ON NOT THERE   MOF60
     C*****ACCESS*BANK*DETAILS*************************************S01194 MOF60
     C***********                                                  S01194 MOF60
     C***********          CALL 'AOBANKR0'PLISTA                   S01194 MOF60
     C***********@RTCD     COMP *BLANKS              9999          S01194 MOF60
     C***********                                                  S01194 MOF60
     C**N99******RECI      COMP 'D'                  9999  ON, DEL S01194 MOF60
     C***********                                                         MOF60
     C*****CHECK*SYSTEM*DATE*FORMAT,*DDMMYY*OR*MMDDYY.********************MOF60
     C***********DATF      COMP 'M'                      98MMDDYY  S01194 MOF60
     C***********BJDFIN    COMP 'M'                      98MMDDYY  S01194 MOF60
     C***********                                                         MOF60
     C***********          ENDSR                                          MOF60
     C***********                                                         MOF60
     C***********                                                         MOF60
     C********************************************************************
     C*
     C*    IF CONTROLS BALANCE, UPDATE TRAILER RECORD
     C*
     C           UPDATE    BEGSR                           *** UPDATE ***
     C*
     C                     Z-ADD0         NINS
     C                     Z-ADD0         NDEL
     C                     Z-ADD0         VRIF
     C                     Z-ADD0         VRIL
     C                     Z-ADD0         VRDF
     C                     Z-ADD0         VRDL
     C                     Z-ADD0         VRAF
     C                     Z-ADD0         VRAL
     C                     Z-ADDNLRA      NLRB
     C                     Z-ADDVLAF      VLBF
     C                     Z-ADDVLAL      VLBL
     C*
     C           CLE025    IFEQ 'Y'                                                           CLE041
     C                     Z-ADD0         AGNINS                                              CLE041
     C                     Z-ADD0         AGNDEL                                              CLE041
     C                     Z-ADD0         AGVRIF                                              CLE041
     C                     Z-ADD0         AGVRIL                                              CLE041
     C                     Z-ADD0         AGVRDF                                              CLE041
     C                     Z-ADD0         AGVRDL                                              CLE041
     C                     Z-ADD0         AGVRAF                                              CLE041
     C                     Z-ADD0         AGVRAL                                              CLE041
     C                     Z-ADDAGNLRA    AGNLRB                                              CLE041
     C                     Z-ADDAGVLAF    AGVLBF                                              CLE041
     C                     Z-ADDAGVLAL    AGVLBL                                              CLE041
     C                     UPDATAGFCTYZF                                                      CLE041
     C                     ENDIF                                                              CLE041
     C*
     C                     ENDSR
     C*
     C*
     C********************************************************************
     C*                                                                   S01117
     C* *PSSR  --- SUBROUTINE TO HANDLE ABNORMAL ERROR CONDITIONS         S01117
     C*                                                                   S01117
     C* CALLED FROM: AFTER ABNORNAL OPERATION OCCURS                      S01117
     C*                                                                   S01117
     C* CALLS: NOTHING                                                    S01117
     C*                                                                   S01117
     C********************************************************************S01117
     C*                                                                   S01117
     C           *PSSR     BEGSR                           ** *PSSR **    S01117
     C*                                                                   S01117
     C           WRUN      IFEQ *BLANKS                                   S01117
     C                     MOVE 'Y'       WRUN    1                       S01117
     C                     DUMP                                           S01117
     C                     END                                            S01117
     C*                                                                   S01117
     C                     ENDSR                           ** *PSSR **    S01117
      *                                                                   CLE004
      /EJECT                                                              CLE004
     C/COPY ZSRSRC,ZFRPEDZ3                                               CLE004
      ** Sub-routine to insert decimal point.                             CLE004
      *                                                                   CLE004
      /EJECT                                                              CLE004
     C**/COPY ZSRSRC,ZEDITZ2                                       CLE004 149037
     C/COPY ZSRSRC,ZEDITZ2L                                               149037
      ** Sub-routine to format rate.                                      CLE004
      *                                                                   CLE004
      /EJECT                                                              CLE004
      *****************************************************************   CLE004
      *  FILLP2 - subroutine to fill up the report details in LE0300P2*   CLE004
      *                                                               *   CLE004
      *  Called by: DETA                                              *   CLE004
      *  Calls: *PSSR                                                 *   CLE004
      *                                                               *   CLE004
      *****************************************************************   CLE004
      *                                                                   CLE004
     C           FILLP2    BEGSR                           *** FILLP2 *** CLE004
      *                                                                   CLE004
     C                     MOVE *ON       *IN71                           CLE004
      *                                                                   CLE004
      ** Format principal amount                                          CLE004
      *                                                                   CLE004
     C                     SELEC                                          CLE004
     C           *IN35     WHEQ *ON                                       CLE004
     C                     Z-ADD0         ZDECS                           CLE004
     C           *IN36     WHEQ *ON                                       CLE004
     C                     Z-ADD1         ZDECS                           CLE004
     C           *IN37     WHEQ *ON                                       CLE004
     C                     Z-ADD2         ZDECS                           CLE004
     C           *IN38     WHEQ *ON                                       CLE004
     C                     Z-ADD3         ZDECS                           CLE004
     C                     ENDSL                                          CLE004
      *                                                                   CLE004
     C                     Z-ADDPRVAMT    ZFLD15                          CLE004
     C                     EXSR ZFRPED                                    CLE004
     C           ZNEG      IFEQ '-'                                       CLE004
     C                     MOVELZOUT18    RPRV0                           CLE004
     C                     ELSE                                           CLE004
     C                     MOVELZOUT17    RPRV0                           CLE004
     C                     ENDIF                                          CLE004
      *                                                                   CLE004
      ** Format Over Line %                                               CLE004
      *                                                                   CLE004
     C                     Z-ADD3         ZADEC                           CLE004
     C                     MOVEL*BLANKS   ZFIELD                          CLE004
     C                     MOVE OVPC      ZFIELD                          CLE004
     C                     EXSR ZEDIT                                     CLE004
     C                     MOVE ZFIELD    ROVPC                           CLE004
      *                                                                                       CLE034
      ** Format Over Line Amount                                                              CLE034
      *                                                                                       CLE034
     C           CLE034    IFEQ 'Y'                                                           CLE034
     C                     Z-ADDOVAM      ZFLD15                                              CLE034
     C                     EXSR ZFRPED                                                        CLE034
     C           ZNEG      IFEQ '-'                                                           CLE034
     C                     MOVELZOUT18    ROVAM                                               CLE034
     C                     ELSE                                                               CLE034
     C                     MOVELZOUT17    ROVAM                                               CLE034
     C                     ENDIF                                                              CLE034
     C                     ENDIF                                                              CLE034
      *                                                                   CLE004
      ** Format Nominal Rate                                              CLE004
      *                                                                   CLE004
     C                     Z-ADD7         ZADEC                           CLE004
     C                     MOVEL*BLANKS   ZFIELD                          CLE004
     C                     MOVE NOMR      ZFIELD                          CLE004
     C                     EXSR ZEDIT                                     CLE004
     C                     MOVE ZFIELD    RNOMR                           CLE004
      *                                                                   CLE004
      ** Format new amount                                                CLE004
      *                                                                   CLE004
     C                     Z-ADDFAMT      ZFLD15                          CLE004
     C                     EXSR ZFRPED                                    CLE004
     C           ZNEG      IFEQ '-'                                       CLE004
     C                     MOVELZOUT18    RFAM0                           CLE004
     C                     ELSE                                           CLE004
     C                     MOVELZOUT17    RFAM0                           CLE004
     C                     ENDIF                                          CLE004
     C                     MOVE RFAM0     RFA20                           CLE004
      *                                                                   CLE004
      ** Convert dates to ddmmmyy format                                  CLE004
      *                                                                   CLE004
     C           RVCD      IFGT 0                                         CLE004
     C                     Z-ADDRVCD      ZDAYNO                          CLE004
     C                     EXSR ZDATE2                                    CLE004
     C                     MOVE ZADATE    RRVCD                           CLE004
     C                     ENDIF                                          CLE004
      *                                                                   CLE004
     C           COMD      IFGT 0                                         CLE004
     C                     MOVE *ON       *IN81                           CLE004
     C                     Z-ADDCOMD      ZDAYNO                          CLE004
     C                     EXSR ZDATE2                                    CLE004
     C                     MOVE ZADATE    WCOMC   7                       CLE004
     C                     ENDIF                                          CLE004
      *                                                                   CLE004
     C           CDTE      IFGT 0                                         CLE004
     C                     MOVE *ON       *IN82                           CLE004
     C*********************Z-ADDCOMD      ZDAYNO                   CLE004 140832
     C                     Z-ADDCDTE      ZDAYNO                          140832
     C                     EXSR ZDATE2                                    CLE004
     C                     MOVE ZADATE    WCDTC   7                       CLE004
     C                     ENDIF                                          CLE004
      *                                                                   CLE004
     C           AVLD      IFGT 0                                         CLE004
     C                     MOVE *ON       *IN83                           CLE004
     C*********************Z-ADDCOMD      ZDAYNO                   CLE004 140832
     C                     Z-ADDAVLD      ZDAYNO                          140832
     C                     EXSR ZDATE2                                    CLE004
     C                     MOVE ZADATE    WAVLC   7                       CLE004
     C                     ENDIF                                          CLE004
      *                                                                   CLE004
     C           JDTE      IFGT 0                                         CLE004
     C                     MOVE *ON       *IN84                           CLE004
     C*********************Z-ADDCOMD      ZDAYNO                   CLE004 140832
     C                     Z-ADDJDTE      ZDAYNO                          140832
     C                     EXSR ZDATE2                                    CLE004
     C                     MOVE ZADATE    WJDTC   7                       CLE004
     C                     ENDIF                                          CLE004
      *                                                                   CLE004
     C           DTAP      IFGT 0                                         CLE004
     C                     MOVE *ON       *IN50                           CLE004
     C                     Z-ADDDTAP      ZDAYNO                          CLE004
     C                     EXSR ZDATE2                                    CLE004
     C                     MOVE ZADATE    RDTAP                           CLE004
     C                     ENDIF                                          CLE004
      *                                                                   CLE004
     C           DTEX      IFGT 0                                         CLE004
     C                     MOVE *ON       *IN51                           CLE004
     C                     Z-ADDDTEX      ZDAYNO                          CLE004
     C                     EXSR ZDATE2                                    CLE004
     C                     MOVE ZADATE    RDTEX                           CLE004
     C                     ENDIF                                          CLE004
      *                                                                   CLE004
      ** Check if Feature CER020 is ON                                                        CER020
      *                                                                                       CER020
     C           CER020    IFEQ 'Y'                                                           CER020
      *                                                                                       CER020
      ** Initialize fields to BLANKS                                                          CER020
      *                                                                                       CER020
     C                     MOVE *BLANKS   RPEXD                                               CER020
     C                     MOVE *BLANKS   RPNXD                                               CER020
      *                                                                                       CER020
      ** Move file field to printer field                                                     CER020
      *                                                                                       CER020
     C           PEXD      IFNE *ZEROS                                                        CER020
      *                                                                                       CER020
     C                     MOVE PEXD      ZDAYNO                                              CER020
     C                     EXSR ZDATE2                                                        CER020
     C                     MOVE ZADATE    RPEXD                                               CER020
      *                                                                                       CER020
     C                     ENDIF                                                              CER020
      *                                                                                       CER020
     C           PNXD      IFNE *ZEROS                                                        CER020
      *                                                                                       CER020
     C                     MOVE PNXD      ZDAYNO                                              CER020
     C                     EXSR ZDATE2                                                        CER020
     C                     MOVE ZADATE    RPNXD                                               CER020
      *                                                                                       CER020
     C                     ENDIF                                                              CER020
      *                                                                                       CER020
     C                     ENDIF                                                              CER020
      *                                                                                       CER020
     C           DLFS      IFGT 0                                         CLE004
     C                     MOVE *ON       *IN52                           CLE004
     C                     Z-ADDDLFS      ZDAYNO                          CLE004
     C                     EXSR ZDATE2                                    CLE004
     C                     MOVE ZADATE    RDLFS                           CLE004
     C                     ENDIF                                          CLE004
      *                                                                   CLE004
     C           RVDT      IFGT 0                                         CLE004
     C                     MOVE *ON       *IN53                           CLE004
     C                     Z-ADDRVDT      ZDAYNO                          CLE004
     C                     EXSR ZDATE2                                    CLE004
     C                     MOVE ZADATE    RRVDT                           CLE004
     C                     ENDIF                                          CLE004
      *                                                                   CLE004
      ** Write Report Header.                                             CLE004
      *                                                                   CLE004
     C                     WRITEHEADP2                                    CLE004
      *                                                                   CLE004
     C                     MOVELACOF      RACOF                           CLE004
     C                     MOVELCRNM      RCNAM                           CLE004
     C                     MOVELBBCUST    RCNUM                           CLE004
     C                     MOVELFCTI      RFCTI                           CLE004
     C                     MOVELFCCY      RFCCY                           CLE004
     C                     MOVELRVCR      RRVCR                           CLE004
     C                     MOVELMCCY      RMCCY                           CLE004
     C                     MOVELCRSK      RCRSK                           CLE004
     C                     MOVELORBR      RORBR                           CLE004
     C                     MOVELMBFC      RMBFC                           CLE004
      *                                                                   CLE004
     C           *IN39     IFEQ '1'                                                           196066
     C                     MOVELIUSR      RIUSR                           147935
     C                     MOVELAUSR      RAUSR                           147935
     C                     MOVELXUSR      RXUSR                           147935
     C                     ENDIF                                                              196066
      *                                                                   147935
     C                     MOVELFACTA     RFACT                           CLE004
     C                     MOVELFCNOA     RFCNO                           CLE004
     C                     MOVELMCSI      RMCSI                           CLE004
     C                     MOVELNACD      RNACD                           CLE004
     C                     MOVELBTIN      RBTIN                           CLE004
     C                     MOVELRVFR      RRVFR                           CLE004
     C                     MOVELORBR      RORBR                           CLE004
     C                     MOVELLAID      RLAID                           CLE008
      *                                                                   CLE004
     C                     MOVELSECI      RSECI                           CLE004
     C                     MOVELNAR1      RNAR1                           CLE004
     C                     MOVELNAR2      RNAR2                           CLE004
     C                     MOVELNAR3      RNAR3                           CLE004
     C                     MOVELNAR4      RNAR4                           CLE004
     C                     Z-ADDBLDY      RBLDY                           CLE004
     C/COPY WNCPYSRC,LEH00091
      *                                                                                     BUG12715
      ** Save current value of indicator 58                                                 BUG12715
      *                                                                                     BUG12715
     C                     MOVE *IN58     WIN58   1                                         BUG12715
     C           RVDY      COMP 0                    58                                     BUG12715
     C                     Z-ADDRVDY      RRVDY                           CLE004
     C                     MOVE ACTN      RACTN                           CLE004
      *                                                                   CLE004
      ** Syndicate details                                                CLE004
      *                                                                   CLE004
     C********** ANUM      IFNE 0                                                      CLE004 CSD027
     C           ANUM      IFNE *BLANKS                                                       CSD027
     C                     MOVE *BLANKS   CKEY                            CLE004
     C                     MOVELANUM      CKEY                            CLE004
     C                     MOVEL*BLANKS   KEYSTS                          CLE004
     C                     CALL 'AOCUSTR0'PLIST1                          CLE004
     C           @RTCD     IFNE *BLANKS                                   CLE004
     C           RECIA     ANDNE'R'                                       CLE004
     C           *LOCK     IN   LDA                                       CLE004
     C                     MOVE '09'      DBASE            ***************CLE004
     C                     MOVE 'SDCUSTPD'DBFILE           * DB ERROR 09 *CLE004
     C                     MOVE *BLANKS   DBKEY            ***************CLE004
     C                     MOVELCKEY      DBKEY                           CLE004
     C                     MOVE 'LE0300  'DBPGM                           CLE004
     C                     OUT  LDA                                       CLE004
     C                     SETON                     U7U8LR               CLE004
     C                     EXSR *PSSR                                     CLE004
     C                     GOTO ENDF                                      CLE004
     C                     END                                            CLE004
     C                     MOVELCRNM      RSNAM                           CLE004
     C                     END                                            CLE004
      *                                                                   CLE004
     C                     MOVELANUM      RANUM                           CLE004
     C                     Z-ADDDICB      RDICB                           CLE004
      *                                                                   CLE004
      ***Output*currency*rollover details if CLE006 is *ON.        CLE006 189544
      ** Output currency rollover details if CLE005 is *ON.               189544
      *                                                                   CLE006
     C********** CLE006    IFEQ 'N'                                CLE006 189544
     C           CLE005    IFEQ 'N'                                       189544
     C                     MOVE *OFF      *IN48                           CLE006
      *                                                                   CLE006
     C                     ELSE                                           CLE006
     C                     MOVE *ON       *IN48                           CLE006
     C                     Z-ADD0         WICTR   20                      CLE006
     C           1         DO   6         WICTR                           CLE006
     C                     Z-ADDWICTR     WINDX   20                      CLE006
     C           WINDX     IFNE 6                                         CLE006
     C           CLE028    OREQ 'Y'                                                           CLE028
     C           CLE028    IFEQ 'Y'                                                           CLE028
     C                     SUBSTDTPX:WINDXWCVAR                                               CLE028
     C                     ELSE                                                               CLE028
     C                     SUBSTDTPS:WINDXWCVAR   1                       CLE006
     C                     ENDIF                                                              CLE028
     C                     SELEC                                          CLE006
     C           WINDX     WHEQ 1                                         CLE006
     C                     CAT  WCVAR:0   RDTPS                           CLE006
     C           WINDX     WHNE 1                                         CLE006
     C                     CAT  WCVAR:1   RDTPS                           CLE006
     C                     ENDSL                                          CLE006
     C                     ENDIF                                          CLE006
     C                     SUBSTRTPS:WINDXWCVAR                           CLE006
     C                     SELEC                                          CLE006
     C           WINDX     WHEQ 1                                         CLE006
     C                     CAT  WCVAR:0   RRTPS                           CLE006
     C           WINDX     WHNE 1                                         CLE006
     C                     CAT  WCVAR:1   RRTPS                           CLE006
     C                     ENDSL                                          CLE006
      *                                                                   CLE006
     C           WINDX     IFGT 1                                         CLE006
     C                     MULT 3         WINDX                           CLE006
     C                     SUB  2         WINDX                           CLE006
     C                     ENDIF                                          CLE006
     C                     SUBSTALCY:WINDXWYVAR   3                       CLE006
     C                     SELEC                                          CLE006
     C           WINDX     WHEQ 1                                         CLE006
     C                     CAT  WYVAR:0   RALC1                           CLE006
     C           WINDX     WHNE 1                                         CLE006
     C                     CAT  WYVAR:1   RALC1                           CLE006
     C                     ENDSL                                          CLE006
     C                     ADD  18        WINDX                           CLE006
     C                     SUBSTALCY:WINDXWYVAR                           CLE006
     C                     SELEC                                          CLE006
     C           WINDX     WHEQ 19                                        CLE006
     C                     CAT  WYVAR:0   RALC2                           CLE006
     C           WINDX     WHNE 19                                        CLE006
     C                     CAT  WYVAR:1   RALC2                           CLE006
     C                     ENDSL                                          CLE006
     C                     ENDDO                                          CLE006
      *                                                                   CLE006
     C                     Z-ADDRLPD      RRLPD                           CLE006
     C                     ENDIF                                          CLE006
      *                                                                   CLE006
     C                     MOVELWCOMC     RCOMD                           CLE006
     C                     MOVELLPBR      RLPBR                           CLE006
     C                     MOVELDFTP      RDFTP                           CLE006
     C                     MOVELDFST      RDFST                           CLE006
     C                     MOVELDFCL      RDFCL                                               CLE042
     C                     MOVELCSEL      RCSEL                           CLE006
      *                                                                   CLE006
     C                     MOVELWCDTC     RCDTE                           CLE006
     C                     MOVELLPTP      RLPTP                           CLE006
     C                     MOVELWAVLC     RAVLD                           CLE006
      *                                                                   CLE004
      ** Format late payment penalty amount.                              CLE004
      *                                                                   CLE004
     C           LPTP      IFEQ 'A'                                                          BUG4166
      *                                                                                      BUG4166
     C                     Z-ADDLPAM      ZFLD15                          CLE004
     C                     EXSR ZFRPED                                    CLE004
     C           ZNEG      IFEQ '-'                                       CLE004
     C                     MOVELZOUT18    RLPA0                           CLE004
     C                     ELSE                                           CLE004
     C                     MOVELZOUT17    RLPA0                           CLE004
     C                     ENDIF                                          CLE004
      *                                                                                      BUG4166
      ** Else, rate was used                                                                 BUG4166
      *                                                                                      BUG4166
     C                     ELSE                                                              BUG4166
      *                                                                                      BUG4166
     C           LPTP      IFEQ 'P'                                                          BUG4166
     C                     Z-ADD7         ZADEC                                              BUG4166
     C                     MOVEL*BLANKS   ZFIELD                                             BUG4166
     C                     MOVE LPAM      ZFIELD                                             BUG4166
     C                     EXSR ZEDIT                                                        BUG4166
     C                     MOVE ZFIELD    RLPA0                                              BUG4166
     C                     ENDIF                                                             BUG4166
     C                     ENDIF                                                             BUG4166
      *                                                                   CLE004
     C********** CANM      IFNE 0                                                      CLE004 CSD027
     C           CANM      IFNE *BLANKS                                                       CSD027
     C                     MOVE *BLANKS   CKEY                            CLE004
     C                     MOVELCANM      CKEY                            CLE004
     C                     MOVEL*BLANKS   KEYSTS                          CLE004
     C                     CALL 'AOCUSTR0'PLIST1                          CLE004
     C           @RTCD     IFNE *BLANKS                                   CLE004
     C           RECIA     ANDNE'R'                                       CLE004
     C           *LOCK     IN   LDA                                       CLE004
     C                     MOVE '10'      DBASE            ***************CLE004
     C                     MOVE 'SDCUSTPD'DBFILE           * DB ERROR 10 *CLE004
     C                     MOVE *BLANKS   DBKEY            ***************CLE004
     C                     MOVELCKEY      DBKEY                           CLE004
     C                     MOVE 'LE0300  'DBPGM                           CLE004
     C                     OUT  LDA                                       CLE004
     C                     SETON                     U7U8LR               CLE004
     C                     EXSR *PSSR                                     CLE004
     C                     GOTO ENDF                                      CLE004
     C                     END                                            CLE004
     C                     MOVELCRNM      RTNAM                           CLE004
     C                     END                                            CLE004
      *                                                                   CLE004
     C                     MOVELTRCA      RTRCA                           CLE004
     C                     MOVE CANM      RCANM                           CLE004
     C                     MOVELACSQ      RACSQ                           CLE004
     C                     Z-ADDCAFT      RCAFT                           CLE004
     C                     Z-ADDCAFN      RCAFN                           CLE004
     C/COPY WNCPYSRC,LEH00129
      *                                                                   CLE004
     C           PRTR      IFNE 'A'                                       CLE004
     C           PRTR      ANDNE*BLANKS                                   140832
     C                     MOVE *ON       *IN49                           CLE004
     C                     ENDIF                                          CLE004
      ** Distinguish between Funding, Internal, Risk & Sub Participants                       CLE106
      *                                                                                       CLE106
     C           CLE106    IFEQ 'Y'                                                           CLE106
     C           PRTR      ANDEQ'I'                                                           CLE106
     C                     MOVE *ON       *IN59                                               CLE106
     C                     ENDIF                                                              CLE106
      *                                                                                       CLE106
     C           CLE106    IFEQ 'Y'                                                           CLE106
     C           PRTR      ANDEQ'S'                                                           CLE106
     C                     MOVE *ON       *IN60                                               CLE106
     C                     ENDIF                                                              CLE106
      *                                                                                       CLE106
      ** Risk Participants have extra details on the Extension File                           CLE106
      *                                                                                       CLE106
     C           CLE106    IFEQ 'Y'                                                           CLE106
     C           PRTR      ANDEQ'R'                                                           CLE106
     C                     MOVE *ON       *IN19                                               CLE106
     C                     ENDIF                                                              CLE106
      *                                                                                       CLE106
     C                     WRITEDETAL1                                    CLE004
      *                                                                                     BUG12715
      ** Restore value of indicator 58                                                      BUG12715
      *                                                                                     BUG12715
     C                     MOVE WIN58     *IN58                                             BUG12715
      *                                                                                       CLE024
      ** Access the facility extension detail file                                            CLE024
      *                                                                                       CLE024
     C                     MOVE *BLANKS   RXDEA                                               CLE039
     C                     MOVE *BLANKS   RXPOR                                               CLE024
     C                     Z-ADD*ZERO     RXLVR                                               CLE024
     C                     Z-ADD*ZERO     RXALV                                               CLE024
     C                     Z-ADD*ZERO     RXLVA                                               CLE024
     C                     Z-ADD*ZERO     RXLVW                                               CLE024
     C                     MOVE *BLANKS   RXSTC                                               CLE024
     C                     Z-ADD*ZERO     RXPWF                                               CLE024
     C                     Z-ADD*ZERO     RXPIS                                               CLE024
     C                     MOVE *BLANKS   RXOMLT 20                                           CFX001
     C                     MOVE *BLANKS   RXOML                                               CFX001
     C                     MOVE *BLANKS   RXMST                                               CFX001
     C                     MOVEA*BLANKS   ARELIG                                              CLE039
     C                     MOVEA*BLANKS   ACG                                                 CLE039
      *                                                                                       CLE024
     C                     MOVE BRCA      KBRCA                                               CLE024
     C                     MOVE CNUMA     KCNUMA                                              CLE024
     C                     MOVE FACTA     KFACTA                                              CLE024
     C                     MOVE FCNOA     KFCNOA                                              CLE024
     C           KFCLT     CHAINLEFCLTLG             57                                       CLE024
      *                                                                                       CLE024
      ** If CLE039 is installed... (for LE0300P2)                                             CLE039
      *                                                                                       CLE039
     C           CLE039    IFEQ 'Y'                                                           CLE039
     C           *IN22     ANDEQ*ON                                                           CLE039
     C                     MOVE *ON       *IN54                                               CLE039
     C                     MOVE *OFF      *IN45                                               CLE039
     C                     MOVE *OFF      *IN47                                               CLE039
     C                     Z-ADD1         WCOLUM                                              CLE039
      *                                                                                       CLE039
     C           *IN57     IFEQ *OFF                                                          CLE039
     C           FCXCGP    IFNE *ZERO                                                         248525
     C                     CALL 'LE000020'                                                    CLE039
     C                     PARM *BLANKS   PRTCD                                               CLE039
     C                     PARM           FCXCGP                                              CLE039
     C                     PARM *BLANKS   DSELIG                                              CLE039
     C                     ENDIF                                                              248525
     C                     ENDIF                                                              CLE039
      *                                                                                       CLE039
      ** Report the Customer Group                                                            CLE039
      *                                                                                       CLE039
     C           FCXCGP    IFNE *ZERO                                                         CLE039
     C                     MOVE FCXCGP    RCGRP                                               CLE039
     C                     MOVEARCGRP     ACG                                                 CLE039
     C                     Z-ADD1         I                                                   CLE039
     C           ACG,I     DOWEQ'0'                                                           CLE039
     C                     MOVE ' '       ACG,I                                               CLE039
     C                     ADD  1         I                                                   CLE039
     C                     ENDDO                                                              CLE039
     C                     MOVEAACG       RCGRP                                               CLE039
     C                     MOVE *ON       *IN45                                               CLE039
     C                     MOVE *ON       *IN47                                               CLE039
     C                     ENDIF                                                              CLE039
      *                                                                                       CLE039
      ** If multi-customer and  no specific eligible customer                                 242371
      ** print 'ALL' instead of 'NONE'.                                                       242371
     C                     MOVE 'NONE'    RNONE                                               242371
     C           MCSI      IFEQ 'Y'                                                           242371
     C           *IN45     ANDEQ*OFF                                                          242371
     C                     MOVE 'ALL '    RNONE                                               242371
     C                     ENDIF                                                              242371
      *
     C                     Z-ADD1         X       30                                          CLE039
     C                     MOVEADSELIG    ARELIG                                              CLE039
      *                                                                                       CLE039
      ** Report the Eligible Customers                                                        CLE039
      *                                                                                       CLE039
     C           ARELIG,X  DOWNE*BLANKS                                                       CLE039
     C                     MOVE *BLANKS   WECUS                                               CLE039
     C                     MOVELARELIG,X  WECUS                                               CLE039
      *                                                                                       CLE039
     C                     CALL 'AOCUSTR0'                                                    CLE039
     C                     PARM *BLANKS   PRTCD                                               CLE039
     C                     PARM '*KEY   ' POPTN                                               CLE039
     C                     PARM WECUS     PCUST                                               CLE039
     C                     PARM *BLANKS   PKYST                                               CLE039
     C           SDCUST    PARM SDCUST    DSSDY                                               CLE039
      *                                                                                       CLE039
     C           PRTCD     IFNE *BLANKS                                                       CLE039
     C           *LOCK     IN   LDA                                                           CLE039
     C                     MOVEL'SDCUSTPD'DBFILE                                              CLE039
     C                     MOVELWECUS     DBKEY                                               CLE039
     C                     Z-ADD53        DBASE                                               CLE039
     C                     OUT  LDA                                                           CLE039
     C                     MOVE *ON       *INU7                                               CLE039
     C                     MOVE *ON       *INU8                                               CLE039
     C                     MOVE *ON       *INLR                                               CLE039
     C                     EXSR *PSSR                                                         CLE039
     C                     GOTO ENDF                                                          CLE039
     C                     ENDIF                                                              CLE039
      *                                                                                       CLE039
     C           WCOLUM    IFEQ 1                                                             CLE039
     C                     MOVE ARELIG,X  RCUST1                                              CLE039
     C                     MOVELBBCSSN    RCSSN1                                              CLE039
     C                     MOVELCRNM      RCRNM1                                              CLE039
     C                     Z-ADD2         WCOLUM                                              CLE039
      *                                                                                       CLE039
     C                     ELSE                                                               CLE039
     C                     MOVE ARELIG,X  RCUST2                                              CLE039
     C                     MOVELBBCSSN    RCSSN2                                              CLE039
     C                     MOVELCRNM      RCRNM2                                              CLE039
     C                     Z-ADD1         WCOLUM                                              CLE039
      *                                                                                       CLE039
      ** Continue printing on next page when overflow occurs                                  CLE039
      *                                                                                       CLE039
     C           *IN55     IFEQ *ON                                                           CLE039
     C                     WRITEHEADP2                                                        CLE039
     C                     WRITEHEADCU                                                        CLE039
     C                     MOVE *ON       *IN54                                               CLE039
     C                     MOVE *OFF      *IN55                                               CLE039
     C                     ENDIF                                                              CLE039
      *                                                                                       CLE039
     C                     MOVE *ON       *IN56                                               CLE039
     C                     WRITEDETAL5                                                        CLE039
     C                     MOVE *OFF      *IN54                                               CLE039
     C                     MOVE *OFF      *IN47                                               CLE039
     C                     ENDIF                                                              CLE039
      *                                                                                       CLE039
     C                     ADD  1         X                                                   CLE039
     C                     ENDDO                                                              CLE039
      *                                                                                       CLE039
      ** If WCOLUM is 2, still need to print the customer written in column 1                 CLE039
      ***If**IN45*is*off,*there*are*no*eligible*customers*so*print*'NONE'              CLE039 242371
      ** If *IN45 is off, check if multi-customer, then print 'ALL'                           242371
      ** if multi-customer, if not, print 'NONE'.                                             242371
      *                                                                                       CLE039
     C           WCOLUM    IFEQ 2                                                             CLE039
     C           *IN45     OREQ *OFF                                                          CLE039
      *                                                                                       CLE039
     C           *IN55     IFEQ *ON                                                           CLE039
     C                     WRITEHEADP2                                                        CLE039
     C                     WRITEHEADCU                                                        CLE039
     C                     MOVE *ON       *IN54                                               CLE039
     C                     MOVE *OFF      *IN55                                               CLE039
     C                     ENDIF                                                              CLE039
      *                                                                                       CLE039
     C                     MOVE *OFF      *IN56                                               CLE039
     C                     WRITEDETAL5                                                        CLE039
     C                     MOVE *OFF      *IN54                                               CLE039
     C                     ENDIF                                                              CLE039
      *                                                                                       CLE039
      ** <End> If CLE039 is installed (for LE0300P2)                                          CLE039
      *                                                                                       CLE039
     C                     ENDIF                                                              CLE039
      *                                                                                       CLE039
     C           CLE039    IFEQ 'Y'                                                           CLE039
     C           CLE025    OREQ 'Y'                                                           CLE025
     C           CLE024    OREQ 'Y'                                                           CLE024
     C           CFX001    OREQ 'Y'                                                           CFX001
     C           CLE106    OREQ 'Y'                                                           CLE106
      *                                                                                       CLE039
     C           CLE039    IFEQ 'Y'                                                           CLE039
     C                     MOVELFCXDEA    RXDEA                                               CLE039
     C                     ENDIF                                                              CLE039
      *                                                                                       CLE039
     C           CLE024    IFEQ 'Y'                                                           CLE024
     C                     MOVE FCXPOR    RXPOR                                               CLE024
     C                     MOVE FCXLVR    RXLVR                                               CLE024
     C                     MOVE FCXALV    RXALV                                               CLE024
     C                     MOVE FCXLVA    RXLVA                                               CLE024
     C                     MOVE FCXLVW    RXLVW                                               CLE024
     C                     MOVE FCXSTC    RXSTC                                               CLE024
     C                     MOVE FCXPWF    RXPWF                                               CLE024
     C                     MOVE FCXPIS    RXPIS                                               CLE024
     C                     ENDIF                                                              CLE024
      *                                                                                       CLE024
     C           CFX001    IFEQ 'Y'                                                           CFX001
     C           CLE025    OREQ 'Y'                                                           CLE025
      *                                                                                       CFX001
      ** Format overall margin dealing limit                                                  CFX001
      *                                                                                       CFX001
     C                     Z-ADDFCXOML    ZFLD15                                              CFX001
     C                     EXSR ZFRPED                                                        CFX001
     C           ZNEG      IFEQ '-'                                                           CFX001
     C                     MOVELZOUT18    RXOMLT                                              CFX001
     C                     ELSE                                                               CFX001
     C                     MOVELZOUT17    RXOMLT                                              CFX001
     C                     ENDIF                                                              CFX001
     C                     MOVE RXOMLT    RXOML                                               CFX001
      *                                                                                       CFX001
     C                     MOVELFCXMST    RXMST                                               CFX001
     C                     ENDIF                                                              CFX001
      *                                                                                       CLE106
      ** Risk Participants have extra details on the Extension File                           CLE106
      *                                                                                       CLE106
     C           CLE106    IFEQ 'Y'                                                           CLE106
     C           *IN19     ANDEQ*ON                                                           CLE106
      *                                                                                       CLE106
      ** Default Risk Loan Type / Subtype:                                                    CLE106
     C                     MOVELFCXRLT    RDRTP                                               CLE106
     C                     MOVELFCXRLS    RDRST                                               CLE106
     C                     MOVELFCXRLC    RDRCL                                               CLE042
      *                                                                                       CLE106
      ** Fee Base Rate Code:                                                                  CLE106
      *                                                                                       CLE106
     C                     MOVELFCXFBC    RFBCD                                               CLE106
      *                                                                                       CLE106
      ** Format Fee Base Rate:                                                                CLE106
     C                     MOVEL*BLANKS   ZFIELD                                              CLE106
     C                     MOVE FCXFBR    ZFIELD                                              CLE106
     C                     Z-ADD7         ZADEC                                               CLE106
     C                     EXSR ZEDIT                                                         CLE106
     C                     MOVE ZFIELD    RFBRT                                               CLE106
      *                                                                                       CLE106
      ** Format Fee Spread                                                                    CLE106
     C                     MOVEL*BLANKS   ZFIELD                                              CLE106
     C                     MOVE FCXFSR    ZFIELD                                              CLE106
     C                     Z-ADD7         ZADEC                                               CLE106
     C                     EXSR ZEDIT                                                         CLE106
     C                     MOVE ZFIELD    RFERA                                               CLE106
      *                                                                                       CLE106
      ** Fee Spread Sign (+ or -)                                                             CLE106
     C                     MOVELFCXSRS    RFERS                                               CLE106
      *                                                                                       CLE106
     C                     ENDIF                                                              CLE106
      *                                                                                       CFX001
      ** Continue printing on next page when overflow occurs                                  CLE039
      *                                                                                       CLE039
     C           *IN55     IFEQ *ON                                                           CLE039
     C                     WRITEHEADP2                                                        CLE039
     C                     WRITEHEADCU                                                        CLE039
     C                     MOVE *ON       *IN54                                               CLE039
     C                     MOVE *OFF      *IN55                                               CLE039
     C                     ENDIF                                                              CLE039
      *                                                                                       CLE039
      ** Write the facility extension details to LE0300P2                                     CLE039
      *                                                                                       CLE039
     C                     WRITEDETAL6                                                        CLE039
      *                                                                                       CLE039
     C                     ENDIF                                                              CLE039
      *                                                                   CLE004
      ** Participant details                                              CLE004
      *                                                                   CLE004
     C           PRTR      IFNE 'A'                                       CLE004
     C           PRTR      ANDNE*BLANKS                                   140832
     C***********KPART     CHAINLEPARTL3             46            CLE004 140832
      *                                                                   CLE004
     C************IN46     IFEQ *OFF                               CLE004 140832
     C**********           Z-ADDPMFC      RPMFC                                        CLE004 CSD027
     C                     MOVE PMFC      RPMFC                                               CSD027
     C                     Z-ADDPMFT      RPMFT                           CLE004
     C                     Z-ADDPMFN      RPMFN                           CLE004
     C/COPY WNCPYSRC,LEH00125
      *                                                                   CLE004
     C                     MOVE INUM      RINUM                           CLE004
     C                     MOVELWJDTC     RJDTE                           CLE004
     C***********          MOVELDRTP      RDRTP                    CLE004 140832
     C***********          MOVELDRST      RDRST                    CLE004 140832
      *                                                                   CLE004
      ***Format*Share*amount                                       CLE004 140832
      ***********                                                  CLE004 140832
     C***********          Z-ADDSHAM      ZFLD15                   CLE004 140832
     C***********          EXSR ZFRPED                             CLE004 140832
     C***********ZNEG      IFEQ '-'                                CLE004 140832
     C***********          MOVELZOUT18    RSHA0                    CLE004 140832
     C***********          ELSE                                    CLE004 140832
     C***********          MOVELZOUT17    RSHA0                    CLE004 140832
     C***********          ENDIF                                   CLE004 140832
      *                                                                   CLE004
      ** Format Share Percentage                                          CLE004
      *                                                                   CLE004
     C***********          Z-ADD8         ZADEC                    CLE004 149037
     C                     Z-ADD12        ZADEC                           149037
     C                     MOVEL*BLANKS   ZFIELD                          CLE004
     C                     MOVE SHPC      ZFIELD                          CLE004
     C                     EXSR ZEDIT                                     CLE004
     C                     MOVE ZFIELD    RSHPC                           CLE004
      *                                                                   CLE004
      ** Format Skim Interest Rate                                        CLE004
      *                                                                   CLE004
     C                     Z-ADD7         ZADEC                           CLE004
     C                     MOVEL*BLANKS   ZFIELD                          CLE004
     C                     MOVE SKIR      ZFIELD                          CLE004
     C                     EXSR ZEDIT                                     CLE004
     C                     MOVE ZFIELD    RSKIR                           CLE004
      *                                                                   CLE004
      ** Format Skim Fees Rate                                            CLE004
      *                                                                   CLE004
     C                     MOVEL*BLANKS   ZFIELD                          CLE004
     C                     MOVE SKFR      ZFIELD                          CLE004
     C                     EXSR ZEDIT                                     CLE004
     C                     MOVE ZFIELD    RSKFR                           CLE004
      *                                                                   CLE004
      ** Format Fee Spread                                                CLE004
      *                                                                   CLE004
     C***********          MOVEL*BLANKS   ZFIELD                   CLE004 140832
     C***********          MOVE FERA      ZFIELD                   CLE004 140832
     C***********          EXSR ZEDIT                              CLE004 140832
     C***********          MOVE ZFIELD    RFERA                    CLE004 140832
      *                                                                   CLE004
     C                     MOVELSHTP      RSHTP                           CLE004
     C                     MOVELRCSI      RRCSI                           CLE004
     C                     MOVELPASI      RPASI                           147261
     C***********          MOVELPTAI      RPTAI                    CLE004 140832
      *                                                                   CLE004
     C                     MOVELSKIS      RSKIS                           CLE004
     C                     MOVELSKFS      RSKFS                           CLE004
     C***********          Z-ADDFEBR      RFEBR                    CLE004 140832
     C***********          MOVELFERS      RFERS                    CLE004 140832
     C                     MOVELPRTR      RPRTR                                             BUG12715
      *                                                                   CLE004
     C           CLE031    IFEQ 'Y'                                                           CLE031
     C                     MOVE COAG      RCOAG                                               CLE031
     C                     MOVE FCAG      RFCAG                                               CLE031
     C                     MOVE PHAG      RPHAG                                               CLE031
     C                     MOVE SCAG      RSCAG                                               CLE031
     C                     ENDIF                                                              CLE031
      *                                                                   140832
      ***  Check that sufficient lines remain for the Format. If not,     140832
      ***  write out the Main Headings on a new page.                     140832
      *                                                                   140832
     C                     Z-ADD33        RQDLN2                          140832
     C           OFLLN2    SUB  PRTLN2    DIFLN2                          140832
     C           DIFLN2    IFLE RQDLN2                                    140832
     C                     WRITEHEADP2                                    140832
     C                     WRITEHEADCU                                    140832
     C                     ENDIF                                          140832
     C                     WRITEDETAL2                                    CLE004
     C***********          ENDIF                                   CLE004 140832
      *                                                                   140832
      ** Receipt settlement instructions                                  140832
      *                                                                   140832
     C                     Z-ADDRSTM      RRSTM                           140832
     C                     MOVE RONS      RRONS                           140832
     C**********           Z-ADDROCN      RROCN                                        140832 CSD027
     C**********           Z-ADDROBN      RROBN                                        140832 CSD027
     C                     MOVE ROCN      RROCN                                               CSD027
     C                     MOVE ROBN      RROBN                                               CSD027
     C                     MOVE RIBN      RRIBN                           140832
     C                     MOVE RIBA      RRIBA                           140832
      *                                                                   140832
      ** Payment settlement instructions                                  140832
      *                                                                   140832
     C                     Z-ADDPSTM      RPSTM                           140832
     C                     MOVE PONS      RPONS                           140832
     C                     MOVE CVMR      RCVMR                           140832
     C                     MOVE RVNO      RRVNO                           140832
     C**********           Z-ADDPOCN      RPOCN                                        140832 CSD027
     C**********           Z-ADDPOBN      RPOBN                                        140832 CSD027
     C                     MOVE POCN      RPOCN                                               CSD027
     C                     MOVE POBN      RPOBN                                               CSD027
     C                     MOVELRCRN      RRCRN                           140832
     C                     MOVELRCRA      RRCRA                           140832
     C                     MOVELPIBN      RPIBN                           140832
     C                     MOVELPIBA      RPIBA                           140832
     C                     MOVELAWBN      RAWBN                           140832
     C                     MOVELAWBA      RAWBA                           140832
     C                     MOVELBENN      RBENN                           140832
     C                     MOVELBENA      RBENA                           140832
     C                     MOVELDTP1      RDTP1                           140832
     C                     MOVELDTP2      RDTP2                           140832
     C                     MOVELDTP3      RDTP3                           140832
     C                     MOVELDTP4      RDTP4                           140832
     C                     MOVELDCHG      RDCHG                           140832
     C                     MOVELBTB1      RBTB1                           140832
     C                     MOVELBTB2      RBTB2                           140832
     C                     MOVELBTB3      RBTB3                           140832
     C                     MOVELBTB4      RBTB4                           140832
     C                     MOVELBTB5      RBTB5                           140832
     C                     MOVELBTB6      RBTB6                           140832
      *                                                                                       CLE031
     C           CLE031    IFEQ 'Y'                                                           CLE031
     C                     MOVE SCCY      RRSCY                                               CLE031
     C                     MOVE PSCY      RPSCY                                               CLE031
      *                                                                                       CLE031
     C           REXR      IFEQ 0                                                             CLE031
     C                     MOVE *BLANKS   RREXR                                               CLE031
     C                     ELSE                                                               CLE031
     C                     MOVE *BLANKS   ZFIELD                                              CLE031
     C                     MOVE REXR      ZFIELD                                              CLE031
     C                     Z-ADD8         ZADEC                                               CLE031
     C                     EXSR ZEDIT                                                         CLE031
     C                     MOVE ZFIELD    RREXR                                               CLE031
     C                     ENDIF                                                              CLE031
      *                                                                                       CLE031
     C                     MOVE REXI      RREXI                                               CLE031
      *                                                                                       CLE031
     C           PEXR      IFEQ 0                                                             CLE031
     C                     MOVE *BLANKS   RPEXR                                               CLE031
     C                     ELSE                                                               CLE031
     C                     MOVE *BLANKS   ZFIELD                                              CLE031
     C                     MOVE PEXR      ZFIELD                                              CLE031
     C                     Z-ADD8         ZADEC                                               CLE031
     C                     EXSR ZEDIT                                                         CLE031
     C                     MOVE ZFIELD    RPEXR                                               CLE031
     C                     ENDIF                                                              CLE031
      *                                                                                       CLE031
     C                     MOVE PEXI      RPEXI                                               CLE031
     C                     ENDIF                                                              CLE031
      *                                                                   140832
     C                     WRITEDETAL4                                    140832
     C                     ENDIF                                          CLE004
      *                                                                   CLE004
      *                                                                   140832
     C           PRTR      IFEQ 'A'                                       140832
     C           PRTR      OREQ *BLANKS                                   140832
      *                                                                   140832
     C           SYIN      IFEQ 'Y'                                       140832
     C           KPART     SETLLLEPARTL3                                  140832
     C           KPART     READELEPARTL3                 46               140832
     C           *IN46     DOWEQ*OFF                                      140832
      *                                                                   140832
     C                     MOVELMNUM      RMNUM                           140832
     C                     MOVELINUM      RINUM                           140832
     C                     MOVELDRTP      RDRTP                           140832
     C                     MOVELDRST      RDRST                           140832
     C                     MOVELDRCL      RDRCL                                               CLE042
     C                     MOVELSHTP      RSHTP                           140832
     C**********           Z-ADDFEBR      RFEBR                           140832              CSD103
     C                     MOVE FEBR      RFEBR                                               CSD103
     C                     MOVELFERS      RFERS                           140832
     C                     MOVELPRTR2     RPRTR                                               CLE106
     C                     MOVELSEQN      RSEQN                                               CLE106
      *                                                                   140832
      *  Format Share amount                                              140832
      *                                                                   140832
     C                     Z-ADDSHAM      ZFLD15                          140832
     C                     EXSR ZFRPED                                    140832
     C           ZNEG      IFEQ '-'                                       140832
     C                     MOVELZOUT18    RSHA0                           140832
     C                     ELSE                                           140832
     C                     MOVELZOUT17    RSHA0                           140832
     C                     ENDIF                                          140832
      *                                                                   140832
      ** Format Share Percentage                                          140832
      *                                                                   140832
     C***********          Z-ADD8         ZADEC                    140832 149037
     C                     Z-ADD12        ZADEC                           149037
     C                     MOVEL*BLANKS   ZFIELD                          140832
     C                     MOVE SHPC      ZFIELD                          140832
     C                     EXSR ZEDIT                                     140832
     C                     MOVE ZFIELD    RSHPC                           140832
      *                                                                   140832
      ** Format Fee Spread                                                140832
      *                                                                   140832
     C                     MOVEL*BLANKS   ZFIELD                          140832
     C                     MOVE FERA      ZFIELD                          140832
     C                     Z-ADD7         ZADEC                           149037
     C                     EXSR ZEDIT                                     140832
     C                     MOVE ZFIELD    RFERA                           140832
      *                                                                   140832
     C                     MOVE *BLANKS   CKEY                            140832
     C                     MOVELMNUM      CKEY                            140832
     C                     MOVEL*BLANKS   KEYSTS                          140832
     C                     CALL 'AOCUSTR0'PLIST1                          140832
     C           @RTCD     IFNE *BLANKS                                   140832
     C           RECIA     ANDNE'R'                                       140832
     C           *LOCK     IN   LDA                                       140832
     C                     MOVE '13'      DBASE            ***************140832
     C                     MOVE 'SDCUSTPD'DBFILE           * DB ERROR 13 *140832
     C                     MOVE *BLANKS   DBKEY            ***************140832
     C                     MOVELCKEY      DBKEY                           140832
     C                     MOVE 'LE0300  'DBPGM                           140832
     C                     OUT  LDA                                       140832
     C                     SETON                     U7U8LR               140832
     C                     EXSR *PSSR                                     140832
     C                     GOTO ENDF                                      140832
     C                     ENDIF                                          140832
      *                                                                   140832
     C                     MOVELBBCSSN    RMNAM                           140832
      *                                                                   140832
     C                     MOVE *BLANKS   CKEY                            140832
     C                     MOVELINUM      CKEY                            140832
     C                     MOVEL*BLANKS   KEYSTS                          140832
     C                     CALL 'AOCUSTR0'PLIST1                          140832
     C           @RTCD     IFNE *BLANKS                                   140832
     C           RECIA     ANDNE'R'                                       140832
     C           *LOCK     IN   LDA                                       140832
     C                     MOVE '14'      DBASE            ***************140832
     C                     MOVE 'SDCUSTPD'DBFILE           * DB ERROR 14 *140832
     C                     MOVE *BLANKS   DBKEY            ***************140832
     C                     MOVELCKEY      DBKEY                           140832
     C                     MOVE 'LE0300  'DBPGM                           140832
     C                     OUT  LDA                                       140832
     C                     SETON                     U7U8LR               140832
     C                     EXSR *PSSR                                     140832
     C                     GOTO ENDF                                      140832
     C                     ENDIF                                          140832
      *                                                                   140832
     C                     MOVELBBCSSN    RINAM                           140832
      *                                                                   140832
     C           JDTE      IFGT 0                                         140832
     C                     MOVE *ON       *IN84                           140832
     C                     Z-ADDJDTE      ZDAYNO                          140832
     C                     EXSR ZDATE2                                    140832
     C                     MOVELZADATE    WJDTC                           140832
     C                     MOVELWJDTC     RJDTE                           140832
     C                     ENDIF                                          140832
      *                                                                   140832
     C           PTAI      IFEQ 'R'                                       140832
     C                     MOVE *ON       *IN85                           140832
     C                     ELSE                                           149037
     C                     MOVE *OFF      *IN85                           149037
     C                     ENDIF                                          140832
      *                                                                   140832
      ***  Check that sufficient lines remain for the Format. If not,     140832
      ***  write out the Main Headings on a new page.                     140832
      *                                                                   140832
     C                     Z-ADD34        RQDLN2                          140832
     C           OFLLN2    SUB  PRTLN2    DIFLN2                          140832
     C           DIFLN2    IFLE RQDLN2                                    140832
     C                     WRITEHEADP2                                    140832
     C                     WRITEHEADCU                                    140832
     C                     ENDIF                                          140832
     C                     WRITEDETAL3                                    140832
      *                                                                   140832
      ** Receipt settlement instructions                                  140832
      *                                                                   140832
     C                     Z-ADDRSTM      RRSTM                           140832
     C                     MOVE RONS      RRONS                           140832
     C**********           Z-ADDROCN      RROCN                                        140832 CSD027
     C**********           Z-ADDROBN      RROBN                                        140832 CSD027
     C                     MOVE ROCN      RROCN                                               CSD027
     C                     MOVE ROBN      RROBN                                               CSD027
     C                     MOVE RIBN      RRIBN                           140832
     C                     MOVE RIBA      RRIBA                           140832
      *                                                                   140832
      ** Payment settlement instructions                                  140832
      *                                                                   140832
     C                     Z-ADDPSTM      RPSTM                           140832
     C                     MOVE PONS      RPONS                           140832
     C                     MOVE CVMR      RCVMR                           140832
     C                     MOVE RVNO      RRVNO                           140832
     C**********           Z-ADDPOCN      RPOCN                                        140832 CSD027
     C**********           Z-ADDPOBN      RPOBN                                        140832 CSD027
     C                     MOVE POCN      RPOCN                                               CSD027
     C                     MOVE POBN      RPOBN                                               CSD027
     C                     MOVELRCRN      RRCRN                           140832
     C                     MOVELRCRA      RRCRA                           140832
     C                     MOVELPIBN      RPIBN                           140832
     C                     MOVELPIBA      RPIBA                           140832
     C                     MOVELAWBN      RAWBN                           140832
     C                     MOVELAWBA      RAWBA                           140832
     C                     MOVELBENN      RBENN                           140832
     C                     MOVELBENA      RBENA                           140832
     C                     MOVELDTP1      RDTP1                           140832
     C                     MOVELDTP2      RDTP2                           140832
     C                     MOVELDTP3      RDTP3                           140832
     C                     MOVELDTP4      RDTP4                           140832
     C                     MOVELDCHG      RDCHG                           140832
     C                     MOVELBTB1      RBTB1                           140832
     C                     MOVELBTB2      RBTB2                           140832
     C                     MOVELBTB3      RBTB3                           140832
     C                     MOVELBTB4      RBTB4                           140832
     C                     MOVELBTB5      RBTB5                           140832
     C                     MOVELBTB6      RBTB6                           140832
      *                                                                   140832
     C                     WRITEDETAL4                                    140832
      *                                                                   140832
     C           KPART     READELEPARTL3                 46               140832
     C                     ENDDO                                          140832
     C                     ENDIF                                          140832
     C                     ENDIF                                          140832
      *                                                                   140832
     C                     MOVE RCNAM     CRNM                            CLE004
     C                     MOVE RCNUM     BBCUST                          CLE004
     C                     MOVE RCRSK     CRSK                            CLE004
     C                     MOVE RACOF     ACOF                            CLE004
      *                                                                   CLE004
     C           ENDF      ENDSR                           *** FILLP2 *** CLE004
      *                                                                   CLE004
      /EJECT                                                              CLE004
      *****************************************************************   CLE015
      *  FILCRD - subroutine to fill the currency rollover details in *   CLE015
      *           LE0300P1                                            *   CLE015
      *                                                               *   CLE015
      *  Called by: DETB                                              *   CLE015
      *  Calls:                                                       *   CLE015
      *                                                               *   CLE015
      *****************************************************************   CLE015
      *                                                                   CLE015
     C           FILCRD    BEGSR                           *** FILCRD *** CLE015
      *                                                                   CLE015
      *                                                                                       208458
      ** Format amount                                                                        208458
      *                                                                                       208458
     C                     SELEC                                                              208458
     C           *IN35     WHEQ *ON                                                           208458
     C                     Z-ADD0         ZDECS                                               208458
     C           *IN36     WHEQ *ON                                                           208458
     C                     Z-ADD1         ZDECS                                               208458
     C           *IN37     WHEQ *ON                                                           208458
     C                     Z-ADD2         ZDECS                                               208458
     C           *IN38     WHEQ *ON                                                           208458
     C                     Z-ADD3         ZDECS                                               208458
     C                     ENDSL                                                              208458
      *                                                                   CLE015
     C                     Z-ADD0         WICTR   20                      CLE015
     C           1         DO   6         WICTR                           CLE015
     C                     Z-ADDWICTR     WINDX   20                      CLE015
     C           WINDX     IFNE 6                                         CLE015
     C           CLE028    OREQ 'Y'                                                           CLE028
     C           CLE028    IFEQ 'Y'                                                           CLE028
     C                     SUBSTDTPX:WINDXWCVAR                                               CLE028
     C                     ELSE                                                               CLE028
     C                     SUBSTDTPS:WINDXWCVAR   1                       CLE015
     C                     ENDIF                                                              CLE028
     C                     SELEC                                          CLE015
     C           WINDX     WHEQ 1                                         CLE015
     C**********           CAT  WCVAR:0   DTPS                                         CLE015 208458
     C                     CAT  WCVAR:0   RDTPS1 11                                           208458
     C           WINDX     WHNE 1                                         CLE015
     C**********           CAT  WCVAR:1   DTPS                                         CLE015 208458
     C                     CAT  WCVAR:1   RDTPS1                                              208458
     C                     ENDSL                                          CLE015
     C                     ENDIF                                          CLE015
     C                     SUBSTRTPS:WINDXWCVAR                           CLE015
     C                     SELEC                                          CLE015
     C           WINDX     WHEQ 1                                         CLE015
     C**********           CAT  WCVAR:0   RTPS                                         CLE015 208458
     C**********           CAT  WCVAR:0   RRTPS1 11                                  208458 AR750770
     C                     CAT  WCVAR:0   RRTPS1 41                                         AR750770
     C           WINDX     WHNE 1                                         CLE015
     C           RRTPS1    IFEQ *BLANKS                                                     AR750770
     C                     CAT  WCVAR:0   RRTPS1                                            AR750770
     C                     ELSE                                                             AR750770
     C**********           CAT  WCVAR:1   RTPS                                         CLE015 208458
     C                     CAT  WCVAR:1   RRTPS1                                              208458
     C                     ENDIF                                                            AR750770
     C                     ENDSL                                          CLE015
      *                                                                   CLE015
     C           WINDX     IFGT 1                                         CLE015
     C                     MULT 3         WINDX                           CLE015
     C                     SUB  2         WINDX                           CLE015
     C                     ENDIF                                          CLE015
     C                     SUBSTALCY:WINDXWYVAR   3                       CLE015
     C                     SELEC                                          CLE015
     C           WINDX     WHEQ 1                                         CLE015
     C                     CAT  WYVAR:0   ALC1   23                       CLE015
     C           WINDX     WHNE 1                                         CLE015
     C                     CAT  WYVAR:1   ALC1                            CLE015
     C                     ENDSL                                          CLE015
     C                     ADD  18        WINDX                           CLE015
     C                     SUBSTALCY:WINDXWYVAR                           CLE015
     C                     SELEC                                          CLE015
     C           WINDX     WHEQ 19                                        CLE015
     C                     CAT  WYVAR:0   ALC2   23                       CLE015
     C           WINDX     WHNE 19                                        CLE015
     C                     CAT  WYVAR:1   ALC2                            CLE015
     C                     ENDSL                                          CLE015
     C                     ENDDO                                          CLE015
      *                                                                   CLE015
     C                     Z-ADD0         WICTR   20                                        AR750770
     C           1         DO   15        WICTR                                             AR750770
     C                     Z-ADDWICTR     WNDX    20                                        AR750770
     C           WNDX      IFNE 15                                                          AR750770
     C           CLE028    OREQ 'Y'                                                         AR750770
     C                     SUBSTRTS15:WNDXWCVAR                                             AR750770
     C                     SELEC                                                            AR750770
     C           WNDX      WHEQ 1                                                           AR750770
     C           RRTPS1    IFEQ *BLANKS                                                     AR750770
     C                     CAT  WCVAR:0   RRTPS1                                            AR750770
     C                     ELSE                                                             AR750770
     C                     CAT  WCVAR:1   RRTPS1                                            AR750770
     C                     ENDIF                                                            AR750770
     C           WNDX      WHNE 1                                                           AR750770
     C           RRTPS1    IFEQ *BLANKS                                                     AR750770
     C                     CAT  WCVAR:0   RRTPS1                                            AR750770
     C                     ELSE                                                             AR750770
     C                     CAT  WCVAR:1   RRTPS1                                            AR750770
     C                     ENDIF                                                            AR750770
     C                     ENDSL                                                            AR750770
     C                     ENDIF                                                            AR750770
     C                     ENDDO                                                            AR750770
      *                                                                                     AR750770
     C**********           MOVELWCOMC     COMD                                         CLE015 208458
      *                                                                   CLE015
     C           AVLD      IFGT 0                                         CLE015
     C                     MOVE *ON       *IN83                           CLE015
     C                     Z-ADDAVLD      ZDAYNO                          CLE015
     C                     EXSR ZDATE2                                    CLE015
     C                     MOVE ZADATE    WAVLD   7                       CLE015
     C                     ENDIF                                          CLE015
      *                                                                   CLE015
     C           COMD      IFGT 0                                         CLE015
     C                     MOVE *ON       *IN81                           CLE015
     C                     Z-ADDCOMD      ZDAYNO                          CLE015
     C                     EXSR ZDATE2                                    CLE015
     C                     MOVE ZADATE    WCOMD   7                       CLE015
     C                     ENDIF                                          CLE015
      *                                                                   CLE015
      ** Format late payment penalty amount.                              CLE015
      *                                                                   CLE015
     C           LPTP      IFEQ 'A'                                                          BUG4166
      *                                                                                      BUG4166
     C                     Z-ADDLPAM      ZFLD15                          CLE015
     C                     EXSR ZFRPED                                    CLE015
     C           ZNEG      IFEQ '-'                                       CLE015
     C                     MOVELZOUT18    LPA0   17                       CLE015
     C                     ELSE                                           CLE015
     C                     MOVELZOUT17    LPA0                            CLE015
     C                     ENDIF                                          CLE015
      *                                                                                      BUG4166
      ** Else, rate was used                                                                 BUG4166
      *                                                                                      BUG4166
     C                     ELSE                                                              BUG4166
      *                                                                                      BUG4166
     C           LPTP      IFEQ 'P'                                                          BUG4166
     C                     Z-ADD7         ZADEC                                              BUG4166
     C                     MOVEL*BLANKS   ZFIELD                                             BUG4166
     C                     MOVE LPAM      ZFIELD                                             BUG4166
     C                     EXSR ZEDIT                                                        BUG4166
     C                     MOVE ZFIELD    LPA0                                               BUG4166
     C                     ENDIF                                                             BUG4166
     C                     ENDIF                                                             BUG4166
      *                                                                   CLE015
      ** Get Base Rate in Facility extension file                                            BUG8943
      *                                                                                      BUG8943
     C           CLE035    IFEQ 'Y'                                                          BUG8943
     C                     MOVE BRCA      KBRCA                                              BUG8943
     C                     MOVE CNUMA     KCNUMA                                             BUG8943
     C                     MOVE FACTA     KFACTA                                             BUG8943
     C                     MOVE FCNOA     KFCNOA                                             BUG8943
     C                     MOVE *BLANKS   WXPRT  117                                         BUG8943
     C           KFCLT     CHAINLEFCLTLG             57                                      BUG8943
     C           *IN57     IFEQ *OFF                                                         BUG8943
     C                     MOVE FCXPRT    WXPRT                                              BUG8943
     C                     ENDIF                                                             BUG8943
     C                     ENDIF                                                             BUG8943
      *                                                                                      BUG8943
     C                     ENDSR                           *** FILCRD *** CLE015
      *                                                                   CLE015
      /EJECT                                                              CLE015
      *****************************************************************   CLE004
      *  REINP2 - subroutine to reinitialize report fields.           *   CLE004
      *                                                               *   CLE004
      *  Called by: DETA                                              *   CLE004
      *  Calls: None                                                  *   CLE004
      *                                                               *   CLE004
      *****************************************************************   CLE004
      *                                                                   CLE004
     C           REINP2    BEGSR                           *** REINP2 *** CLE004
      *                                                                   CLE004
     C                     MOVE *OFF      *IN49                           CLE004
     C                     MOVE *OFF      *IN53                           CLE004
     C                     MOVE *OFF      *IN58                           CLE004
     C                     MOVE *OFF      *IN48                           CLE004
     C                     MOVE *OFF      *IN81                           CLE004
     C                     MOVE *OFF      *IN82                           CLE004
     C                     MOVE *OFF      *IN83                           CLE004
     C                     MOVE *OFF      *IN84                           CLE004
     C                     MOVE *OFF      *IN71                           CLE004
      *                                                                   CLE004
     C                     MOVE *BLANKS   RRVCD                           CLE004
     C                     MOVE *BLANKS   RPRV0                           CLE004
     C                     MOVE *BLANKS   ROVPC                           CLE004
     C                     MOVE *BLANKS   RNOMR                           CLE004
     C                     MOVE *BLANKS   RFAM0                           CLE004
     C                     MOVE *BLANKS   RACOF                           CLE004
     C                     MOVE *BLANKS   RCNAM                           CLE004
     C                     MOVE *BLANKS   RCNUM                           CLE004
     C                     MOVE *BLANKS   RFCTI                           CLE004
     C                     MOVE *BLANKS   RFCCY                           CLE004
     C                     MOVE *BLANKS   RDTAP                           CLE004
     C                     MOVE *BLANKS   RRVCR                           CLE004
     C                     MOVE *BLANKS   RMCCY                           CLE004
     C                     MOVE *BLANKS   RCRSK                           CLE004
     C                     MOVE *BLANKS   RRVDT                           CLE004
     C                     MOVE *BLANKS   RORBR                           CLE004
     C                     MOVE *BLANKS   RMBFC                           CLE004
     C                     MOVE *BLANKS   RFACT                           CLE004
     C                     MOVE *BLANKS   RFCNO                           CLE004
     C                     MOVE *BLANKS   RDTEX                           CLE004
     C                     MOVE *BLANKS   RMCSI                           CLE004
     C                     MOVE *BLANKS   RNACD                           CLE004
     C                     MOVE *BLANKS   RBTIN                           CLE004
     C                     MOVE *BLANKS   RRVFR                           CLE004
     C                     MOVE *BLANKS   RORBR                           CLE004
     C                     MOVE *BLANKS   RSECI                           CLE004
     C                     MOVE *BLANKS   RNAR1                           CLE004
     C                     MOVE *BLANKS   RNAR2                           CLE004
     C                     MOVE *BLANKS   RNAR3                           CLE004
     C                     MOVE *BLANKS   RNAR4                           CLE004
     C                     MOVE *BLANKS   RDLFS                           CLE004
     C                     MOVE *BLANKS   RACTN                           CLE004
     C                     MOVE *BLANKS   RSNAM                           CLE004
     C                     MOVE *BLANKS   RANUM                           CLE004
     C                     MOVE *BLANKS   RDTPS                           CLE004
     C                     MOVE *BLANKS   RRTPS                           CLE004
     C                     MOVE *BLANKS   RALC1                           CLE004
     C                     MOVE *BLANKS   RALC2                           CLE004
     C                     MOVE *BLANKS   RCOMD                           CLE004
     C                     MOVE *BLANKS   RLPBR                           CLE004
     C                     MOVE *BLANKS   RDFTP                           CLE004
     C                     MOVE *BLANKS   RDFST                           CLE004
     C                     MOVE *BLANKS   RDFCL                                               CLE042
     C                     MOVE *BLANKS   RCSEL                           CLE004
     C                     MOVE *BLANKS   RCDTE                           CLE004
     C                     MOVE *BLANKS   RLPTP                           CLE004
     C                     MOVE *BLANKS   RAVLD                           CLE004
     C                     MOVE *BLANKS   RLPA0                           CLE004
     C                     MOVE *BLANKS   RTNAM                           CLE004
     C                     MOVE *BLANKS   RTRCA                           CLE004
     C                     MOVE *BLANKS   RCANM                           CLE004
     C                     MOVE *BLANKS   RACSQ                           CLE004
     C                     MOVE *BLANKS   RINUM                           CLE004
     C                     MOVE *BLANKS   RJDTE                           CLE004
     C                     MOVE *BLANKS   RDRTP                           CLE004
     C                     MOVE *BLANKS   RDRST                           CLE004
     C                     MOVE *BLANKS   RDRCL                                               CLE042
     C                     MOVE *BLANKS   RSHA0                           CLE004
     C                     MOVE *BLANKS   RSHPC                           CLE004
     C                     MOVE *BLANKS   RSKIR                           CLE004
     C                     MOVE *BLANKS   RSKFR                           CLE004
     C                     MOVE *BLANKS   RFERA                           CLE004
     C                     MOVE *BLANKS   RSHTP                           CLE004
     C                     MOVE *BLANKS   RRCSI                           CLE004
     C                     MOVE *BLANKS   RPASI                           147261
     C*********************MOVE *BLANKS   RPTAI                    CLE004 140832
     C                     MOVE *BLANKS   RSKIS                           CLE004
     C                     MOVE *BLANKS   RSKFS                           CLE004
     C                     MOVE *BLANKS   RFERS                           CLE004
     C                     MOVE *BLANKS   RLAID                           CLE008
      *                                                                   CLE004
     C**********           Z-ADD0         RFEBR                           CLE004              CSD103
     C                     MOVE *BLANKS   RFEBR                                               CSD103
     C                     Z-ADD0         RCAFT                           CLE004
     C                     Z-ADD0         RCAFN                           CLE004
     C**********           Z-ADD0         RPMFC                                        CLE004 CSD027
     C                     MOVE *BLANKS   RPMFC                                               CSD027
     C                     Z-ADD0         RPMFT                           CLE004
     C                     Z-ADD0         RPMFN                           CLE004
     C                     Z-ADD0         RBLDY                           CLE004
     C                     Z-ADD0         RRVDY                           CLE004
     C                     Z-ADD0         RDICB                           CLE004
     C                     Z-ADD0         RRLPD                           CLE004
     C                     Z-ADD0         RSEQN                                               CLE106
     C                     MOVE *BLANKS   RFBRT                                               CLE106
     C                     MOVE *BLANKS   RPRTR                                               CLE106
     C                     MOVE *BLANKS   RFBCD                                               CLE106
     C/COPY WNCPYSRC,LEH00094
      *                                                                   CLE004
     C           CER020    IFEQ 'Y'                                                           CER020
      *                                                                                       CER020
     C                     MOVE *BLANKS   RPEXD                                               CER020
     C                     MOVE *BLANKS   RPNXD                                               CER020
      *                                                                                       CER020
     C                     ENDIF                                                              CER020
      *                                                                                       CER020
     C                     ENDSR                           *** REINP2 *** CLE004
     C********************************************************************S01117
      /EJECT                                                                                  208458
      *****************************************************************                       208458
      *                                                               *                       208458
      *  SRREIN - Subroutine to reinitialize report fields.           *                       208458
      *                                                               *                       208458
      *  Called By : DETA                                             *                       208458
      *                                                               *                       208458
      *  Calls     : NONE                                             *                       208458
      *                                                               *                       208458
      *****************************************************************                       208458
      *                                                                                       208458
     C           SRREIN    BEGSR                                                              208458
     C                     MOVE *BLANKS   RDTPS1                                              208458
     C                     MOVE *BLANKS   RRTPS1                                              208458
     C                     MOVE *BLANKS   ALC1                                                208458
     C                     MOVE *BLANKS   ALC2                                                208458
     C                     MOVE *BLANKS   WCOMD                                               208458
     C                     MOVE *BLANKS   WAVLD                                               208458
     C                     MOVE *BLANKS   LPA0                                                208458
      *                                                                                       208458
     C                     ENDSR                                                              208458
      *****************************************************************                       208458
     C/COPY ZSRSRC,ZDATE2Z4                                               S01392
     C********************************************************************S01392
     OLE0300P1D  203   30                                                 S01124
     O       AND      N09                                                                     CLE041
     O*******OR**      66                                                 S01117
     O*******OR**      U7 U8                                              S01117
     O       OR        OF
     O       AND      N09                                                                     CLE041
     O***********                        22 'REFERENCE  LE0300'           S01117
     O                                   24 'REFERENCE  LE0300P1'         S01117
     O                         TITL      89
     O                                  104 'DATE'
     O                         RUNA     112
     O                                  122 'PAGE'
     O                         PAGE  Z  127
     O        D  1     30
     O       AND      N09                                                                     CLE041
     O*******OR**      66                                                 S01117
     O       OR        OF
     O       AND      N09                                                                     CLE041
     O*******OR**      U7 U8                                              S01117
     O                                   59 'FACILITIES '
     O                                   76 'MAINTENANCE TODAY'
     O                      N33          86 'BRANCH'                      S01117
     O                      N33BRCA      90                               S01117
     O                      N33          91 '-'                           S01117
     O                      N33BRNM     121                               S01117
     O        D  3     30
     O       AND      N09                                                                     CLE041
     O*******OR**      66                                                 S01117
     O       OR        OF
     O       AND      N09                                                                     CLE041
     O*******OR**      U7 U8                                              S01117
     O                                   59 '-----------'
     O                                   76 '-----------------'
     O        D  2     30
     O       AND      N09                                                                     CLE041
     O       OR        OF                                                                     CLE039
     O       AND      N09                                                                     CLE041
     O                                   13 'CUSTOMER'
     O**********               CRNM      36                                                  BUG3781
     O                         FCCRNM    36                                                  BUG3781
     O**********               CNUM      46                               S01194
     O**********               BBCSSN    46                         S01194BHF064
     O**********               BBCUST    46                                           BHF064 BUG3781
     O                         FCCUST    46                                                  BUG3781
     O                                   67 'FACILITY TYPE'
     O***********              FACT      72                               S01117
     O                         FACTA     72                               S01117
     O                                   79 'NO.'
     O***********              FCNO      83                               S01117
     O                         FCNOA     83                               S01117
     O***********                        94 'BRANCH'                      S01117
     O***********              BRCD      99                               S01117
     O/COPY WNCPYSRC,LEH00092
     O                                  122 'ACTION'
     O                         ACTN     125
     O        D  2     30
     O       AND      N09                                                                     CLE041
     O                                   14 'FCLT/CMMT'
     O                         FCTI      17
     O                                   27 'CCY'
     O                         FCCY      32
     O***********                        46 'AMOUNT'                      MOF60
     O***********      38      FAMT      65 ' ,   ,   , 0 .   '           MOF60
     O***********      37      FAMT      65 '  ,   ,   , 0 .  '           MOF60
     O***********      36      FAMT      65 '   ,   ,   , 0 . '           MOF60
     O***********      35      FAMT      65 ' ,   ,   ,   , 0 '           MOF60
     O                N78                46 'AMOUNT'                      MOF60
     O***********     N78 38   FAMT      65 ' ,   ,   , 0 .   '     MOF60 171784
     O***********     N78 37   FAMT      65 '  ,   ,   , 0 .  '     MOF60 171784
     O***********     N78 36   FAMT      65 '   ,   ,   , 0 . '     MOF60 171784
     O***********     N78 35   FAMT      65 ' ,   ,   ,   , 0 '     MOF60 171784
     O                N78 38   FAMT      65 ' ,   ,   , 0 .   -'          171784
     O                N78 37   FAMT      65 '  ,   ,   , 0 .  -'          171784
     O                N78 36   FAMT      65 '   ,   ,   , 0 . -'          171784
     O                N78 35   FAMT      65 ' ,   ,   ,   , 0 -'          171784
     O                 78                55 'PREVIOUS AMOUNT'             MOF60
     O***********      78 38   PRVAMT    73 ' ,   ,   , 0 .   '     MOF60 171784
     O***********      78 37   PRVAMT    73 '  ,   ,   , 0 .  '     MOF60 171784
     O***********      78 36   PRVAMT    73 '   ,   ,   , 0 . '     MOF60 171784
     O***********      78 35   PRVAMT    73 ' ,   ,   ,   , 0 '     MOF60 171784
     O                 78 38   PRVAMT    73 ' ,   ,   , 0 .   -'          171784
     O                 78 37   PRVAMT    73 '  ,   ,   , 0 .  -'          171784
     O                 78 36   PRVAMT    73 '   ,   ,   , 0 . -'          171784
     O                 78 35   PRVAMT    73 ' ,   ,   ,   , 0 -'          171784
     O                 78                89 'NEW AMOUNT'                  MOF60
     O***********      78 38   FAMT     107 ' ,   ,   , 0 .   '     MOF60 171784
     O***********      78 37   FAMT     107 '  ,   ,   , 0 .  '     MOF60 171784
     O***********      78 36   FAMT     107 '   ,   ,   , 0 . '     MOF60 171784
     O***********      78 35   FAMT     107 ' ,   ,   ,   , 0 '     MOF60 171784
     O                 78 38   FAMT     107 ' ,   ,   , 0 .   -'          171784
     O                 78 37   FAMT     107 '  ,   ,   , 0 .  -'          171784
     O                 78 36   FAMT     107 '   ,   ,   , 0 . -'          171784
     O                 78 35   FAMT     107 ' ,   ,   ,   , 0 -'          171784
     O/COPY WNCPYSRC,LE0300O001
     O*
     O        D  2     30
     O       AND      N09                                                                     CLE041
     O                                   16 'A/C OFFICER'
     O                         ACOF      35
     O                                   51 'OVER LINE %'
     O                         OVPC      63 '0 .   '
     O                 13                92 'OVER LINE AMT'                                   CLE034
     O                 13 38   OVAM     112 ' ,   ,   , 0 .   -'                              CLE034
     O                 13 37   OVAM     112 '  ,   ,   , 0 .  -'                              CLE034
     O                 13 36   OVAM     112 '   ,   ,   , 0 . -'                              CLE034
     O                 13 35   OVAM     112 ' ,   ,   ,   , 0 -'                              CLE034
     O**********                         86 'SECURED'                                   MOF60 CLE034
     O**********               SECI      88                                             MOF60 CLE034
     O                                  123 'SECURED'                                         CLE034
     O                         SECI     125                                                   CLE034
     O        D  1     30
     O       AND      N09                                                                     CLE041
     O**********                         18 'DATE APPROVED'                                   201127
     O                                   15 'START DATE'                                      201127
     O                 50      DTAPO     35
     O                                   52 'DATE EXPIRES'
     O                 51      DTEXO     69
     O                                   88 'NARRATIVE'
     O                         NAR1     125
     O/COPY WNCPYSRC,LE0300O002
     O        D  1     30
     O       AND      N09                                                                     CLE041
     O                         NAR2     125
      *                                                                                       CER020
     O        D  1     30 80                                                                  CER020
     O       AND      N09                                                                   AR744372
     O                                   25 'PREVIOUS EXPIRY DATE'                            CER020
     O                         RPEXD     35                                                   CER020
     O                                   62 'PENULTIMATE EXPIRY DATE'                         CER020
     O                         RPNXD     72                                                   CER020
     O        D  1     30
     O       AND      N09                                                                     CLE041
     O                                   21 'REVOLVING CREDIT'            MOF60
     O                         RVCR      35                               MOF60
     O                 79                58 'DATE REV. CR. IND.'          MOF60
     O                 79                66 'CHANGED'
     O                 79      RVCDO     74
     O***********                        47 'SECURED'                     MOF60
     O***********              SECI      69                               MOF60
     O                         NAR3     125
     O        D  1     30
     O       AND      N09                                                                     CLE041
     O                         NAR4     125
     O        D  2     30
     O       AND      N09                                                                     CLE041
     O                                   19 'MULTI CURRENCY'
     O                         MCCY      35
     O                                   54 'MULTI CUSTOMER'
     O                         MCSI      69
     O*                                                                   S01408
     O/COPY WNCPYSRC,LE0300OOPG                                           S01408
     O*                                                                   S01408
     O        D  2     30
     O       AND      N09                                                                     CLE041
     O                                   20 'COUNTRY OF RISK'
     O                         CRSK      35
     O                                   55 'ALTERNATIVE N/A'
     O                         NACD      69
     O                                   97 'DATE LAST FIN STMT'
     O                 52      DLFSO    111
     O        D  2     30
     O       AND      N09                                                                     CLE041
     O                                   17 'NOMINAL RATE'
     O                         NOMR      35 '  0 .       '
     O***********                        57 'BILLING/TELEX IND'           MOF60
     O***********              BTIN      69                               MOF60
     O***********                        91 'BILLING DAYS'                MOF60
     O***********      57      BLDY     111                               MOF60
     O                                   57 'BILLING/TELEX IND'           072062
     O                         BTIN      69                               072062
     O                                   91 'BILLING DAYS'                072062
     O/COPY WNCPYSRC,LE0300O004
     O                         BLDY     111 '0 '                          072062
     O/COPY WNCPYSRC,LE0300O005
     O        D  2     30
     O       AND      N09                                                                     CLE041
     O                                   16 'REVIEW DATE'
     O                 53      RVDTO     35
     O                                   49 'FREQUENCY'
     O                         RVFR      69
     O                                   85 'DAY NO'
     O                 58      RVDY     111
     O********D**2     30                                                 MOF60
     O***********                        14 'C/FEE IND'                   MOF60
     O***********     N29      CMFT      35                               MOF60
     O***********                        49 'BASE RATE'                   MOF60
     O***********     N29 59   BCOD      69                               MOF60
     O***********                        90 'RATE/SPREAD'                 MOF60
     O***********     N29      SPRD     111 '  0 .       '                MOF60
     O********D**2     30                                                 MOF60
     O***********                        15 'START DATE'                  MOF60
     O***********     N29 54   STDTO     35                               MOF60
     O***********                        48 'END DATE'                    MOF60
     O***********     N29 55   EDDTO     69                               MOF60
     O***********                        93 'NEXT BILL DATE'              MOF60
     O***********     N29 56   DUDTO    111                               MOF60
     O********D**2     30                                                 MOF60
     O***********                        14 'BILL FREQ'                   MOF60
     O***********     N29      BLFR      35                               MOF60
     O***********                        46 'DAY NO'                      MOF60
     O***********     N29 60   BLDN      69                               MOF60
     O********D**2     30                                                 MOF60
     O***********                        20 'SETTLEMENT TYPE'             MOF60
     O***********     N29      SETT      35                               MOF60
     O***********                        44 'OURS'                        MOF60
     O***********     N29      OBAC      69                         S01117MOF60
     O***********     N29      OBAC      65                         S01117MOF60
     O***********     N29N33   CFBR      69                         S01117MOF60
     O***********                        85 'THEIRS'                      MOF60
     O***********     N29      TNAC     111                               MOF60
     O********D**2     30                                                 MOF60
     O***********                        15 'CALC BASIS'                  MOF60
     O***********     N29      CALC      35                               MOF60
     O/COPY WNCPYSRC,LE0300O003
     O*                                                                   S01117
     O        D  2     30                                                 S01117
     O       AND      N09                                                                     CLE041
     O                      N77          17 'PROFIT CENT.'                S01117
     O                      N77PRFC      35                               S01117
     O                      N76          58 'ORIGINATING BRANCH'          S01117
     O                      N76ORBR      69                               S01117
     O********D**1     30                                                 141486
     O        D  2     30                                                 141486
     O       AND      N09                                                                     CLE041
     O                      N33          17 'MULTI BRANCH'                S01117
     O                      N33MBFC      35                               S01117
     O                       61          58 'LOAN ADMINISTRATOR'          CLE008
     O                       61LAID      69                               CLE008
     O        D  2     15                                                 CLE015
     O       AND      N09                                                                     CLE041
     O                       15          18 'DRAWING TYPES'               CLE015
     O**********             15DTPS      35                                            CLE015 208458
     O                       15RDTPS1    35                                                   208458
     O                       15          95 'DEFAULT INTEREST'            CLE015
     O                       15         101 'BASIS'                       CLE015
     O                       15DICB     111                               CLE015
     O        D  2     15                                                 CLE015
     O       AND      N09                                                                     CLE041
     O                       15          19 'ROLLOVER TYPES'              CLE015
     O**********             15RTPS      35                                            CLE015 208458
     O**********             15RRTPS1    35                                          208458 AR750770
     O                       15RRTPS1    65                                                 AR750770
     O                       15          97 'IRREGULAR ROLLOVER'          CLE015
     O                       15         104 'PERIOD'                      CLE015
     O                       15RLPD     111                               CLE015
     O        D  2     15                                                 CLE015
     O       AND      N09                                                                     CLE041
     O                       15          23 'CURRENCY SELECTION'          CLE015
     O                       15CSEL      35                               CLE015
     O                       15          99 'ALLOWABLE CURRENCIES'        CLE015
     O        D  1     15                                                 CLE015
     O       AND      N09                                                                     CLE041
     O                       15ALC1     101                               CLE015
     O        D  1     15                                                 CLE015
     O       AND      N09                                                                     CLE041
     O                       15ALC2     101                               CLE015
     O        D  2     15                                                 CLE015
     O       AND      N09                                                                     CLE041
     O**********             15          19 'DATE COMMITTED'                          CLE015 246031A
     O**********             15WCOMD     35                                           CLE015 246031A
     O                    11 15          17 'CLOSING DATE'                                   246031A
     O                    11 15WCDTC     35                                                  246031A
     O                       15         101 'LAST AVAILABILITY DATE'      CLE015
     O                       15WAVLD    111                               CLE015
     O        D  2     15                                                 CLE015
     O       AND      N09                                                                     CLE041
     O**********             15          14 'BASE RATE'                               CLE015 BUG8943
     O                       15          19 'BASE RATE CODE'                                 BUG8943
     O                       15LPBR      35                               CLE015
     O                       15          60 'LAST PAYMENT PENALTY'        CLE015
     O                       15          65 'TYPE'                        CLE015
     O                       15LPTP      69                               CLE015
     O                       15          85 'AMOUNT'                      CLE015
     O                       15LPA0     111                               CLE015
     O        D  2     15 14                                                                 BUG8943
     O       AND      N09                                                                    BUG8943
     O                       15          14 'BASE RATE'                                      BUG8943
     O                       15WXPRT     35 '  0 .       '                                   BUG8943
     O        D  2     30 28                                              141486
     O       AND      N09                                                                     CLE041
     O                                   20 'TR/CA INDICATOR'             141486
     O                         TRCA      35                               141486
     O        D  2     30 28                                              141486
     O       AND      N09                                                                     CLE041
     O                                   26 'CR AGREEMENT CUSTOMER'       141486
     O                         TNAM      48                               141486
     O                         TANM      56                               141486
     O                                   91 'FCTY TYPE/NO'                141486
     O                         TAFT      96                               141486
     O                         TAFN      99                               141486
     O/COPY WNCPYSRC,LEH00130
     O        D  2     15                                                 CLE015
     O       AND      N09                                                                     CLE041
     O                                   28 'ACCOUNT SEQUENCE NUMBER'     CLE015
     O                       15ACSQ      35                               CLE015
     O*                                                                   147935
     O        D  2     30 28                                              189544
     O       AND      N09                                                                     CLE041
     O                                   18 'APPROVAL DATE'               189544
     O                         RCOMD     35                               189544
     O                                   52 'CR AGREEMENT'                189544
     O                                   66 'EXCHANGE RATE'               189544
     O                         RCAXR     69                               189544
     O                                   92 'EXCH RATE IND'               189544
     O                         RCMDI    111                               189544
     O*                                                                   189544
     O********D* 2     30                                                              147935 196066
     O        D  2     30 39                                                                  196066
     O       AND      N09                                                                     CLE041
     O                                   19 'INSERTING USER'              147935
     O                         IUSR      35                               147935
     O                                   53 'AMENDING USER'               147935
     O                         AUSR      69                               147935
     O                                   95 'AUTHORISING USER'            147935
     O                         XUSR     111                               147935
      *                                                                                       CLE039
     O        E  1     47      CUSGRP                                                         CLE039
     O                                   19 'CUSTOMER GROUP'                                  CLE039
     O                         WCGRP     45                                                   CLE039
     O        E  1     43      ELICUS                                                         CLE039
     O                                   24 'ELIGIBLE CUSTOMERS:'                             CLE039
     O**********      N45                35 'NONE'                                     CLE039 242371
     O                N45      WNONE     35                                                   242371
     O        E  1     45      ELICUS                                                         CLE039
     O                         WCUST1    15                                                   CLE039
     O                         WCSSN1    29                                                   CLE039
     O                         WCRNM1    53                                                   CLE039
     O                 44      WCUST2    85                                                   CLE039
     O                 44      WCSSN2    99                                                   CLE039
     O                 44      WCRNM2   123                                                   CLE039
      *                                                                                       CLE039
     O        E  1     16      XFCLT1                                                         CLE039
     O                                   27 'DRAWDOWN CANNOT EXCEED'                          CLE039
     O                                   37 'AVAILABLE'                                       CLE039
     O                         WXDEA     39                                                   CLE039
      *                                                                                       CLE024
     O        E  1     17      XFCLT2                                                         CLE024
     O                                   14 'PORTFOLIO'                                       CLE024
     O                         WXPOR     19                                                   CLE024
     O                                   60 'REQUIRED LOAN TO VALUE'                          CLE024
     O                                   66 'RATIO'                                           CLE024
     O                         WXLVR     70                                                   CLE024
     O                                   99 'ADVANCE LOAN TO VALUE'                           CLE024
     O                                  105 'RATIO'                                           CLE024
     O                         WXALV    109                                                   CLE024
      *                                                                                       CLE024
     O        E  1     17      XFCLT3                                                         CLE024
     O                                   24 'LOAN TO VALUE RATIO'                             CLE024
     O                                   36 'ALERT LEVEL'                                     CLE024
     O                         WXLVA     40                                                   CLE024
     O                                   97 'LOAN TO VALUE RATIO'                             CLE024
     O                                  111 'WARNING LEVEL'                                   CLE024
     O                         WXLVW    115                                                   CLE024
      *                                                                                       CLE024
     O        E  1     17      XFCLT4                                                         CLE024
     O                                   20 'SUBJECT TO CALL'                                 CLE024
     O                         WXSTC     22                                                   CLE024
     O                                   61 'PERCENTAGE OVER WARNING'                         CLE024
     O                                   76 'FOR FIRST CALL'                                  CLE024
     O                         WXPWF     82                                                   CLE024
      *                                                                                       CLE024
     O        E  1     17      XFCLT5                                                         CLE024
     O                                   62 'PERCENTAGE INCREMENT FOR'                        CLE024
     O                                   78 'SUBSEQUENT CALL'                                 CLE024
     O                         WXPIS     82                                                   CLE024
      *                                                                                       CFX001
     O        E  1     18      XFCLT6                                                         CFX001
     O                                   27 'OVERALL MARGIN DEALING'                          CFX001
     O                                   33 'LIMIT'                                           CFX001
     O                    38   WXOML     65 ' ,   ,   , 0 .   -'                              CFX001
     O                    37   WXOML     65 '  ,   ,   , 0 .  -'                              CFX001
     O                    36   WXOML     65 '   ,   ,   , 0 . -'                              CFX001
     O                    35   WXOML     65 ' ,   ,   ,   , 0 -'                              CFX001
     O                                   98 'MARGIN SCHEDULE TYPE'                            CFX001
     O                         WXMST    102                                                   CFX001
     O********D  2     40 75                                                         CLE029 BUG11201
     O********D  2     30 40                                                         BUG11201 242326
     O        D  2     40 75 30                                                               242326
     O*******AND      N09                                                              CLE041 242053
     O       AND      N09 30                                                                  242053
     O                                   18 'SEVERITY CODE'               CLE029
     O                         RSVCD     43                               CLE029
     O*
     O*                                                                   S01408
     O/COPY WNCPYSRC,LE0300OOP1                                           S01408
     O*                                                                   S01408
     O********D**2     30 60                                                         CER001 BUG10267
     O        D  2     30 62                                                                BUG10267
     O*******AND      N09                                                            BUG10505 CFC006
     O       AND      N09 97                                                                  CFC006
     O                                   16 'SUBORDINATE'                                     CER001
     O                         VNSUBR    35                                                   CER001
     O                                   61 'MOBILISATION CUSTOMER'                           CER001
     O                         VNMOBL    78                                                   CER001
     O********D**2     30 60                                                         CER001 BUG10267
     O        D  2     30 62                                                                BUG10267
     O*******AND      N09                                                            BUG10505 CFC006
     O       AND      N09 97                                                                  CFC006
     O                                   14 'RISK CODE'                                       CER001
     O                         VNDGRI    35                                                   CER001
     O********D**240   U7 U8                                              S01117
     O***********                        51 '*** REFERENCE LE0300'        S01117
     O***********                        71 'DATABASE ERROR AT'           S01117
     O***********              DBASE     74                               S01117
     O********D**      U7 U8                                              S01117
     O***********                        37 'FILENAME'                    S01117
     O***********              DBFILE    43                               S01117
     O***********                        48 'KEY'                         S01117
     O***********              DBKEY     78                               S01117
     O********EF* 17   08 67                                              S01117
     O***********                        71 '***   NO INPUT TODAY'        S01117
     O***********                        77 '***'                         S01117
     O********T* 203   L1   N75                                    S01117 MOF60
     O**********                                                          MOF60
     O*******AND         NU7N33                                    S01117 MOF60
     O*******OR*       LR   N75                                    S01117 MOF60
     O*******AND         NU7 33                                    S01117 MOF60
     O*******OR*       U7 U8                                       S01117 MOF60
     O**********                         24 'REFERENCE  LE0300P1'  S01117 MOF60
     O**********               TITL      89                        S01117 MOF60
     O**********                        104 'DATE'                 S01117 MOF60
     O**********               RUNA     112                        S01117 MOF60
     O**********                        122 'PAGE'                 S01117 MOF60
     O**********               PAGE  Z  127                        S01117 MOF60
     O********T* 1     L1   N75                                    S01117 MOF60
     O*******AND         NU7N33                                    S01117 MOF60
     O*******OR*       LR   N75                                    S01117 MOF60
     O*******AND         NU7 33                                    S01117 MOF60
     O*******OR*       U7 U8                                       S01117 MOF60
     O**********                         59 'FACILITIES '          S01117 MOF60
     O**********                         76 'MAINTENANCE TODAY'    S01117 MOF60
     O**********            N33          86 'BRANCH'               S01117 MOF60
     O**********            N33BRCA      90                        S01117 MOF60
     O**********            N33          91 '-'                    S01117 MOF60
     O**********            N33BRNM     121                        S01117 MOF60
     O********T* 3     L1   N75                                    S01117 MOF60
     O*******AND         NU7N33                                    S01117 MOF60
     O*******OR*       LR   N75                                    S01117 MOF60
     O*******AND         NU7 33                                    S01117 MOF60
     O*******OR*       U7 U8                                       S01117 MOF60
     O**********                         59 '-----------'          S01117 MOF60
     O**********                         76 '-----------------'    S01117 MOF60
     O********T* 240   U7 U8                                       S01117 MOF60
     O        E  240   U7 U8   TOTOUT                                     MOF60
     O       AND          97                                                                  CFC006
     O                                   51 '*** REFERENCE LE0300'        S01117
     O                                   72 'DATABASE ERROR ***'          S01117
      *                                                                   138352
     O        E  203   L1   N75TOTOU1                                     138352
     O       AND         NU7N33                                           138352
     O       AND          97                                                                  CFC006
     O       OR        LR   N75                                           138352
     O*******AND         NU7 33                                                        138352 CFC006
     O       AND       97NU7 33                                                               CFC006
     O*******OR*       43                                                              CLE039 CFC006
     O       OR        43 97                                                                  CFC006
     O                                   24 'REFERENCE  LE0300P1'         138352
     O                         TITL      89                               138352
     O                                  104 'DATE'                        138352
     O                         RUNA     112                               138352
     O                                  122 'PAGE'                        138352
     O                         PAGE  Z  127                               138352
      *                                                                   138352
     O********E* 1     L1   N75TOTOU1                                                  138352 CFC006
     O        E  1     L1 97N75TOTOU1                                                         CFC006
     O       AND         NU7N33                                           138352
     O*******OR*       LR   N75                                                        138352 CFC006
     O       OR        LR 97N75                                                               CFC006
     O       AND         NU7 33                                           138352
     O*******OR*       43                                                              CLE039 CFC006
     O       OR        43 97                                                                  CFC006
     O                                   59 'FACILITIES '                 138352
     O                                   76 'MAINTENANCE TODAY'           138352
     O                      N33          86 'BRANCH'                      138352
     O                      N33BRCA      90                               138352
     O                      N33          91 '-'                           138352
     O                      N33BRNM     121                               138352
      *                                                                   138352
     O********E* 3     L1   N75TOTOU1                                                  138352 CFC006
     O        E  3     L1 97N75TOTOU1                                                         CFC006
     O       AND         NU7N33                                           138352
     O*******OR*       LR   N75                                                        138352 CFC006
     O       OR        LR 97N75                                                               CFC006
     O       AND         NU7 33                                           138352
     O*******OR*       43                                                              CLE039 CFC006
     O       OR        43 97                                                                  CFC006
     O                                   59 '-----------'                 138352
     O                                   76 '-----------------'           138352
      *                                                                   138352
     O********E*23     L1   N75TOTOU1                                                  138352 CFC006
     O        E 23     L1 97N75TOTOU1                                                         CFC006
     O*******AND         NU7N33                                                        138352 CLE039
     O       AND      N43NU7N33                                                               CLE039
     O*******OR*       LR   N75                                                        138352 CFC006
     O       OR        LR 97N75                                                               CFC006
     O*******AND         NU7 33                                                        138352 CLE039
     O       AND      N43NU7 33                                                               CLE039
     O                                   76 '*** NO DETAILS TO REPORT'    138352
     O                                   80 '***'                         138352
     O********E* 2     43      TOTOU1                                                  CLE039 CFC006
     O        E  2     43 97   TOTOU1                                                         CFC006
     O                                   13 'CUSTOMER'                                        CLE039
     O                         CRNM      36                                                   CLE039
     O                         BBCUST    46                                                   CLE039
     O                                   67 'FACILITY TYPE'                                   CLE039
     O                         FACTA     72                                                   CLE039
     O                                   79 'NO.'                                             CLE039
     O                         FCNOA     83                                                   CLE039
     O/COPY WNCPYSRC,LEH00095
     O                                  122 'ACTION'                                          CLE039
     O                         ACTN     125                                                   CLE039
      *                                                                                       CLE039
      *                                                                   138352
     O********T* 326   L1   N75                                    S01117 MOF60
     O*******AND         NU7N33                                    S01117 MOF60
     O*******OR*       LR   N75                                    S01117 MOF60
     O*******AND         NU7 33                                    S01117 MOF60
     O**********                     76 '*** NO DETAILS TO REPORT' S01117 MOF60
     O**********                         80 '***'                  S01117 MOF60
     O********T*3      L1N33NU7                                    S01117 MOF60
     O        E 3      L1N33NU7TOTOU2                                     MOF60
     O       AND          97                                                                  CFC006
     O                                   66 '*** END OF REPORT FOR'       MOF60
     O                                   74 ' BRANCH '                    MOF60
     O                         BRCA      77                               MOF60
     O                                   81 ' ***'                        MOF60
     O********T*3      LR 33NU7                                    S01117 MOF60
     O        E 3      LR 33NU7TOTOU3                                     MOF60
     O       AND          97                                                                  CFC006
     O                                   76 '*** END OF REPORT ***'       S01117
     O*
     O/COPY WNCPYSRC,LEH01007
     OLE0300P3D  203   30 09                                                                  CLE041
     O       OR        OG                                                                     CLE041
     O                                   24 'REFERENCE  LE0300P3'                             CLE041
     O                         TITL      89                                                   CLE041
     O                                  104 'DATE'                                            CLE041
     O                         RUNA     112                                                   CLE041
     O                                  122 'PAGE'                                            CLE041
     O                         PAGE  Z  127                                                   CLE041
     O        D  1     30 09                                                                  CLE041
     O       OR        OG                                                                     CLE041
     O                                   48 'AGGREGATE '                                      CLE041
     O                                   59 'FACILITIES '                                     CLE041
     O                                   76 'MAINTENANCE TODAY'                               CLE041
     O                      N33          86 'BRANCH'                                          CLE041
     O                      N33BRCA      90                                                   CLE041
     O                      N33          91 '-'                                               CLE041
     O                      N33BRNM     121                                                   CLE041
     O        D  3     30 09                                                                  CLE041
     O       OR        OG                                                                     CLE041
     O                 09                48 '----------'                                      CLE041
     O                                   59 '-----------'                                     CLE041
     O                                   76 '-----------------'                               CLE041
     O        D  2     30 09                                                                  CLE041
     O       OR        OG                                                                     CLE041
     O                                   13 'CUSTOMER'                                        CLE041
     O                         FCCRNM    36                                                   CLE041
     O                         FCCUST    46                                                   CLE041
     O                                   67 'FACILITY TYPE'                                   CLE041
     O                         FACTA     72                                                   CLE041
     O                                   79 'NO.'                                             CLE041
     O                         FCNOA     83                                                   CLE041
     O/COPY WNCPYSRC,LEH00093
     O                                  122 'ACTION'                                          CLE041
     O                         ACTN     125                                                   CLE041
     O        D  2     30 09                                                                  CLE041
     O                                   14 'FCLT/CMMT'                                       CLE041
     O                         FCTI      17                                                   CLE041
     O                                   27 'CCY'                                             CLE041
     O                         FCCY      32                                                   CLE041
     O                N78 38   FAMT      65 ' ,   ,   , 0 .   -'                              CLE041
     O                N78 37   FAMT      65 '  ,   ,   , 0 .  -'                              CLE041
     O                N78 36   FAMT      65 '   ,   ,   , 0 . -'                              CLE041
     O                N78 35   FAMT      65 ' ,   ,   ,   , 0 -'                              CLE041
     O                 78                55 'PREVIOUS AMOUNT'                                 CLE041
     O                 78 38   PRVAMT    73 ' ,   ,   , 0 .   -'                              CLE041
     O                 78 37   PRVAMT    73 '  ,   ,   , 0 .  -'                              CLE041
     O                 78 36   PRVAMT    73 '   ,   ,   , 0 . -'                              CLE041
     O                 78 35   PRVAMT    73 ' ,   ,   ,   , 0 -'                              CLE041
     O                 78                89 'NEW AMOUNT'                                      CLE041
     O                 78 38   FAMT     107 ' ,   ,   , 0 .   -'                              CLE041
     O                 78 37   FAMT     107 '  ,   ,   , 0 .  -'                              CLE041
     O                 78 36   FAMT     107 '   ,   ,   , 0 . -'                              CLE041
     O                 78 35   FAMT     107 ' ,   ,   ,   , 0 -'                              CLE041
     O        D  2     30 09                                                                  CLE041
     O                                   16 'A/C OFFICER'                                     CLE041
     O                         ACOF      35                                                   CLE041
     O                                   51 'OVER LINE %'                                     CLE041
     O                         OVPC      63 '0 .   '                                          CLE041
     O                 13                92 'OVER LINE AMT'                                   CLE041
     O                 13 38   OVAM     112 ' ,   ,   , 0 .   -'                              CLE041
     O                 13 37   OVAM     112 '  ,   ,   , 0 .  -'                              CLE041
     O                 13 36   OVAM     112 '   ,   ,   , 0 . -'                              CLE041
     O                 13 35   OVAM     112 ' ,   ,   ,   , 0 -'                              CLE041
     O                                  123 'SECURED'                                         CLE041
     O                         SECI     125                                                   CLE041
     O        D  1     30 09                                                                  CLE041
     O                                   15 'START DATE'                                      CLE041
     O                 50      DTAPO     35                                                   CLE041
     O                                   52 'DATE EXPIRES'                                    CLE041
     O                 51      DTEXO     69                                                   CLE041
     O                                   88 'NARRATIVE'                                       CLE041
     O                         NAR1     125                                                   CLE041
     O        D  1     30 09                                                                  CLE041
     O                         NAR2     125                                                   CLE041
     O        D  1     30 09                                                                  CLE041
     O                                   21 'REVOLVING CREDIT'                                CLE041
     O                         RVCR      35                                                   CLE041
     O                 79                58 'DATE REV. CR. IND.'                              CLE041
     O                 79                66 'CHANGED'                                         CLE041
     O                 79      RVCDO     74                                                   CLE041
     O                         NAR3     125                                                   CLE041
     O        D  1     30 09                                                                  CLE041
     O                         NAR4     125                                                   CLE041
     O        D  2     30 09                                                                  CLE041
     O                                   19 'MULTI CURRENCY'                                  CLE041
     O                         MCCY      35                                                   CLE041
     O                                   54 'MULTI CUSTOMER'                                  CLE041
     O                         MCSI      69                                                   CLE041
     O        D  2     30 09                                                                  CLE041
     O                                   20 'COUNTRY OF RISK'                                 CLE041
     O                         CRSK      35                                                   CLE041
     O                                   55 'ALTERNATIVE N/A'                                 CLE041
     O                         NACD      69                                                   CLE041
     O                                   97 'DATE LAST FIN STMT'                              CLE041
     O                 52      DLFSO    111                                                   CLE041
     O        D  2     30 09                                                                  CLE041
     O                                   17 'NOMINAL RATE'                                    CLE041
     O                         NOMR      35 '  0 .       '                                    CLE041
     O                                   57 'BILLING/TELEX IND'                               CLE041
     O                         BTIN      69                                                   CLE041
     O                                   91 'BILLING DAYS'                                    CLE041
     O                         BLDY     111 '0 '                                              CLE041
     O        D  2     30 09                                                                  CLE041
     O                                   16 'REVIEW DATE'                                     CLE041
     O                 53      RVDTO     35                                                   CLE041
     O                                   49 'FREQUENCY'                                       CLE041
     O                         RVFR      69                                                   CLE041
     O                                   85 'DAY NO'                                          CLE041
     O                 58      RVDY     111                                                   CLE041
     O        D  2     30 09                                                                  CLE041
     O                      N77          17 'PROFIT CENT.'                                    CLE041
     O                      N77PRFC      35                                                   CLE041
     O                      N76          58 'ORIGINATING BRANCH'                              CLE041
     O                      N76ORBR      69                                                   CLE041
     O        D  2     30 09                                                                  CLE041
     O                      N33          17 'MULTI BRANCH'                                    CLE041
     O                      N33MBFC      35                                                   CLE041
     O                       61          58 'LOAN ADMINISTRATOR'                              CLE041
     O                       61LAID      69                                                   CLE041
     O        D  2     15 09                                                                  CLE041
     O                       15          18 'DRAWING TYPES'                                   CLE041
     O                       15RDTPS1    35                                                   CLE041
     O                       15          95 'DEFAULT INTEREST'                                CLE041
     O                       15         101 'BASIS'                                           CLE041
     O                       15DICB     111                                                   CLE041
     O        D  2     15 09                                                                  CLE041
     O                       15          19 'ROLLOVER TYPES'                                  CLE041
     O**********             15RRTPS1    35                                          CLE041 AR750770
     O                       15RRTPS1    65                                                 AR750770
     O                       15          97 'IRREGULAR ROLLOVER'                              CLE041
     O                       15         104 'PERIOD'                                          CLE041
     O                       15RLPD     111                                                   CLE041
     O        D  2     15 09                                                                  CLE041
     O                       15          23 'CURRENCY SELECTION'                              CLE041
     O                       15CSEL      35                                                   CLE041
     O                       15          99 'ALLOWABLE CURRENCIES'                            CLE041
     O        D  1     15 09                                                                  CLE041
     O                       15ALC1     101                                                   CLE041
     O        D  1     15 09                                                                  CLE041
     O                       15ALC2     101                                                   CLE041
     O        D  2     15 09                                                                  CLE041
     O**********             15          19 'DATE COMMITTED'                          CLE041 246031A
     O**********             15WCOMD     35                                           CLE041 246031A
     O                    11 15          17 'CLOSING DATE'                                   246031A
     O                    11 15WCDTC     35                                                  246031A
     O                       15         101 'LAST AVAILABILITY DATE'                          CLE041
     O                       15WAVLD    111                                                   CLE041
     O        D  2     15 09                                                                  CLE041
     O*********              15          14 'BASE RATE'                               CLE041 BUG8943
     O                       15          19 'BASE RAT CODE'                           CLE041 BUG8943
     O                       15LPBR      35                                                   CLE041
     O                       15          60 'LAST PAYMENT PENALTY'                            CLE041
     O                       15          65 'TYPE'                                            CLE041
     O                       15LPTP      69                                                   CLE041
     O                       15          85 'AMOUNT'                                          CLE041
     O                       15LPA0     111                                                   CLE041
     O        D  2     15 14                                                                 BUG8943
     O       AND       09                                                                    BUG8943
     O                       15          14 'BASE RATE'                                      BUG8943
     O                       15WXPRT     35 '  0 .       '                                   BUG8943
     O        D  2     30 28 09                                                               CLE041
     O                                   20 'TR/CA INDICATOR'                                 CLE041
     O                         TRCA      35                                                   CLE041
     O        D  2     30 28 09                                                               CLE041
     O                                   26 'CR AGREEMENT CUSTOMER'                           CLE041
     O                         TNAM      48                                                   CLE041
     O                         TANM      56                                                   CLE041
     O                                   91 'FCTY TYPE/NO'                                    CLE041
     O                         TAFT      96                                                   CLE041
     O                         TAFN      99                                                   CLE041
     O/COPY WNCPYSRC,LEH00131
     O        D  2     15 09                                                                  CLE041
     O                                   28 'ACCOUNT SEQUENCE NUMBER'                         CLE041
     O                       15ACSQ      35                                                   CLE041
      *                                                                                       CLE041
     O        D  2     30 28 09                                                               CLE041
     O                                   18 'APPROVAL DATE'                                   CLE041
     O                         RCOMD     35                                                   CLE041
     O                                   52 'CR AGREEMENT'                                    CLE041
     O                                   66 'EXCHANGE RATE'                                   CLE041
     O                         RCAXR     69                                                   CLE041
     O                                   92 'EXCH RATE IND'                                   CLE041
     O                         RCMDI    111                                                   CLE041
     O        D  2     30 39 09                                                               CLE041
     O                                   19 'INSERTING USER'                                  CLE041
     O                         IUSR      35                                                   CLE041
     O                                   53 'AMENDING USER'                                   CLE041
     O                         AUSR      69                                                   CLE041
     O                                   95 'AUTHORISING USER'                                CLE041
     O                         XUSR     111                                                   CLE041
      *                                                                                       CLE041
     O        E  1     47 09   CUSGR3                                                         CLE041
     O                                   19 'CUSTOMER GROUP'                                  CLE041
     O                         WCGRP     45                                                   CLE041
     O        E  1     43 09   ELICU3                                                         CLE041
     O                                   24 'ELIGIBLE CUSTOMERS:'                             CLE041
     O**********      N45                35 'NONE'                                     CLE041 242371
     O                N45      WNONE     35                                                   242371
     O        E  1     45 09   ELICU3                                                         CLE041
     O                         WCUST1    15                                                   CLE041
     O                         WCSSN1    29                                                   CLE041
     O                         WCRNM1    53                                                   CLE041
     O                 44      WCUST2    85                                                   CLE041
     O                 44      WCSSN2    99                                                   CLE041
     O                 44      WCRNM2   123                                                   CLE041
      *                                                                                       CLE041
     O        E  1     16 09   XFCL31                                                         CLE041
     O                                   27 'DRAWDOWN CANNOT EXCEED'                          CLE041
     O                                   37 'AVAILABLE'                                       CLE041
     O                         WXDEA     39                                                   CLE041
      *                                                                                       CLE041
     O        E  1     17 09   XFCL32                                                         CLE041
     O                                   14 'PORTFOLIO'                                       CLE041
     O                         WXPOR     19                                                   CLE041
     O                                   60 'REQUIRED LOAN TO VALUE'                          CLE041
     O                                   66 'RATIO'                                           CLE041
     O                         WXLVR     70                                                   CLE041
     O                                   99 'ADVANCE LOAN TO VALUE'                           CLE041
     O                                  105 'RATIO'                                           CLE041
     O                         WXALV    109                                                   CLE041
      *                                                                                       CLE041
     O        E  1     17 09   XFCL33                                                         CLE041
     O                                   24 'LOAN TO VALUE RATIO'                             CLE041
     O                                   36 'ALERT LEVEL'                                     CLE041
     O                         WXLVA     40                                                   CLE041
     O                                   97 'LOAN TO VALUE RATIO'                             CLE041
     O                                  111 'WARNING LEVEL'                                   CLE041
     O                         WXLVW    115                                                   CLE041
      *                                                                                       CLE041
     O        E  1     17 09   XFCL34                                                         CLE041
     O                                   20 'SUBJECT TO CALL'                                 CLE041
     O                         WXSTC     22                                                   CLE041
     O                                   61 'PERCENTAGE OVER WARNING'                         CLE041
     O                                   76 'FOR FIRST CALL'                                  CLE041
     O                         WXPWF     82                                                   CLE041
      *                                                                                       CLE041
     O        E  1     17 09   XFCL35                                                         CLE041
     O                                   62 'PERCENTAGE INCREMENT FOR'                        CLE041
     O                                   78 'SUBSEQUENT CALL'                                 CLE041
     O                         WXPIS     82                                                   CLE041
      *                                                                                       CLE041
     O        E  1     18 09   XFCL36                                                         CLE041
     O                                   27 'OVERALL MARGIN DEALING'                          CLE041
     O                                   33 'LIMIT'                                           CLE041
     O                    38   WXOML     65 ' ,   ,   , 0 .   -'                              CLE041
     O                    37   WXOML     65 '  ,   ,   , 0 .  -'                              CLE041
     O                    36   WXOML     65 '   ,   ,   , 0 . -'                              CLE041
     O                    35   WXOML     65 ' ,   ,   ,   , 0 -'                              CLE041
     O                                   98 'MARGIN SCHEDULE TYPE'                            CLE041
     O                         WXMST    102                                                   CLE041
     O        D  2     40 75 09                                                               CLE041
     O       AND       30                                                                     242326
     O                                   18 'SEVERITY CODE'                                   CLE041
     O                         RSVCD     43                                                   CLE041
     O        E  240   U7 U8 09TOTO3T                                                         CLE041
     O                                   51 '*** REFERENCE LE0300'                            CLE041
     O                                   72 'DATABASE ERROR ***'                              CLE041
      *                                                                                       CLE041
     O        E  203   L1 09N75TOTO31                                                         CLE041
     O       AND         NU7N33                                                               CLE041
     O       OR        LR 09N75                                                               CLE041
     O       AND         NU7 33                                                               CLE041
     O       OR        43 09                                                                  CLE041
     O                                   24 'REFERENCE  LE0300P3'                             CLE041
     O                         TITL      89                                                   CLE041
     O                                  104 'DATE'                                            CLE041
     O                         RUNA     112                                                   CLE041
     O                                  122 'PAGE'                                            CLE041
     O                         PAGE  Z  127                                                   CLE041
      *                                                                                       CLE041
     O        E  1     L1 09N75TOTO31                                                         CLE041
     O       AND         NU7N33                                                               CLE041
     O       OR        LR 09N75                                                               CLE041
     O       AND         NU7 33                                                               CLE041
     O       OR        43 09                                                                  CLE041
     O                                   59 'FACILITIES '                                     CLE041
     O                                   76 'MAINTENANCE TODAY'                               CLE041
     O                      N33          86 'BRANCH'                                          CLE041
     O                      N33BRCA      90                                                   CLE041
     O                      N33          91 '-'                                               CLE041
     O                      N33BRNM     121                                                   CLE041
      *                                                                                       CLE041
     O        E  3     L1 09N75TOTO31                                                         CLE041
     O       AND         NU7N33                                                               CLE041
     O       OR        LR 09N75                                                               CLE041
     O       AND         NU7 33                                                               CLE041
     O       OR        43 09                                                                  CLE041
     O                                   59 '-----------'                                     CLE041
     O                                   76 '-----------------'                               CLE041
      *                                                                                       CLE041
     O        E 23     L1 09N75TOTO31                                                         CLE041
     O       AND      N43NU7N33                                                               CLE041
     O       OR        LR 09N75                                                               CLE041
     O       AND      N43NU7 33                                                               CLE041
     O                                   76 '*** NO DETAILS TO REPORT'                        CLE041
     O                                   80 '***'                                             CLE041
     O        E  2     43 09   TOTO31                                                         CLE041
     O                                   13 'CUSTOMER'                                        CLE041
     O                         CRNM      36                                                   CLE041
     O                         BBCUST    46                                                   CLE041
     O                                   67 'FACILITY TYPE'                                   CLE041
     O                         FACTA     72                                                   CLE041
     O                                   79 'NO.'                                             CLE041
     O                         FCNOA     83                                                   CLE041
     O/COPY WNCPYSRC,LEH00096
     O                                  122 'ACTION'                                          CLE041
     O                         ACTN     125                                                   CLE041
      *                                                                                       CLE041
     O        E 3      L1N33NU7TOTO32                                                         CLE041
     O       AND       09                                                                     CLE041
     O                                   66 '*** END OF REPORT FOR'                           CLE041
     O                                   74 ' BRANCH '                                        CLE041
     O                         BRCA      77                                                   CLE041
     O                                   81 ' ***'                                            CLE041
     O        E 3      LR 33NU7TOTO33                                                         CLE041
     O       AND       09                                                                     CLE041
     O                                   76 '*** END OF REPORT ***'                           CLE041
      *                                                                                       CLE041
     O/COPY WNCPYSRC,LEH01008
     OLE0300AUE  203   66                                                 S01117
     O                                   24 'REFERENCE  LE0300AU'         S01117
     O                         TITL      89                               S01117
     O                                  104 'DATE'                        S01117
     O                         RUNA     112                               S01117
     O                                  122 'PAGE'                        S01117
     O                         PAGE1 Z  127                               S01117
     O        E  1     66                                                 S01117
     O                                   59 'FACILITIES '                 S01117
     O                                   76 'MAINTENANCE TODAY'           S01117
     O                                   92 'RUN CONTROLS'                S01117
     O        E  3     66                                                 S01117
     O                                   59 '-----------'                 S01117
     O                                   76 '-----------------'           S01117
     O*                                                                   S01117
     O********EF*217** 08 66                                              S01117
     O        EF 217   66                                                 S01117
     O                                   18 'RUN CONTROLS'
     O                                   65 '------------'
     O                                   84 'REPORT -----------'
     O***********                       102 '---------'                   S01117
     O***********                       124 'FILE CONTROL --------'       S01117
     O                    08            102 '---------'                   S01117
     O                    08            124 'FILE CONTROL --------'       S01117
     O********E**2*    08 66                                              S01117
     O        E  2     66                                                 S01117
     O                                   59 'NUMBER'
     O***********                        84 'VALUE'                       S01117
     O***********                        99 'NUMBER'                      S01117
     O***********                       124 'VALUE'                       S01117
     O                    08             84 'VALUE'                       S01117
     O                    08             99 'NUMBER'                      S01117
     O                    08            124 'VALUE'                       S01117
     O********E**2*    08 66                                              S01117
     O        E  2     66                                                 S01117
     O                                   28 'FACILITIES LISTED IN'
     O                                   40 'THIS REPORT'
     O                         NFAC      59 '   0 '
     O        E  2     08 66
     O                                   28 'RECORDS BEFORE INPUT'
     O                                   34 'CYCLE'
     O**********               NLRB  3   99                                                   CLE041
     O**********               VLBF  Z  121                                                   CLE041
     O**********               VLBL     124                                                   CLE041
     O                         WNLRB 3   99                                                   CLE041
     O                         WVLBF Z  121                                                   CLE041
     O                         WVLBL    124                                                   CLE041
     O        E  2     08 66
     O                                   24 'RECORDS INSERTED'
     O                         NRINS 3   59
     O**********               NINS  3   99                                                   CLE041
     O**********               VRIF  Z  121                                                   CLE041
     O**********               VRIL     124                                                   CLE041
     O                         WNINS 3   99                                                   CLE041
     O                         WVRIF Z  121                                                   CLE041
     O                         WVRIL    124                                                   CLE041
     O        E  1     08 66
     O                                   23 'RECORDS DELETED'
     O                         NRDEL 3   59
     O**********               NDEL  3   99                                                   CLE041
     O**********               VRDF  Z  121                                                   CLE041
     O**********               VRDL     124                                                   CLE041
     O                         WNDEL 3   99                                                   CLE041
     O                         WVRDF Z  121                                                   CLE041
     O                         WVRDL    124                                                   CLE041
     O        E  2     08 66
     O                                   23 'RECORDS AMENDED'
     O**********               VRAF  Z  121                                                   CLE041
     O**********               VRAL     124                                                   CLE041
     O                         WVRAF Z  121                                                   CLE041
     O                         WVRAL    124                                                   CLE041
     O                 65               125 '-'
     O        E  2     08 66
     O                                   27 'RECORDS AFTER INPUT'
     O                                   33 'CYCLE'
     O                         NROF  3   59
     O                         LVTOTIZ   81
     O                         LVTOTD    84
     O**********               NLRA  3   99                                                   CLE041
     O**********               VLAF  Z  121                                                   CLE041
     O**********               VLAL     124                                                   CLE041
     O                         WNLRA 3   99                                                   CLE041
     O                         WVLAF Z  121                                                   CLE041
     O                         WVLAL    124                                                   CLE041
     O**********       U8               128 '***'                                             236008
     O                 11               128 '***'                                             236008
     O********E*23*    08 66 U8                                           S01117
     O        E 23     08 66                                              S01117
     O*******AND***    U8NU7                                                           S01117 236008
     O       AND       11NU7                                                                  236008
     O                                  128 '***   DIFFERENCE   ***'
     O        T  240   U7 U8 LR                                           S01117
     O                                   51 '*** REFERENCE LE0300'        S01117
     O                                   71 'DATABASE ERROR AT'           S01117
     O                         DBASE     75                               S01117
     O********T*       U7 U8 LR                                    S01117 MOF60
     O        T  1     U7 U8 LR                                           MOF60
     O                                   39 'FILENAME'                    S01117
     O                         DBFILE    48                               S01117
     O                                   52 'KEY'                         S01117
     O                         DBKEY     82                               S01117
      *                                                                   S01117
     O********T*23    NU7NU8 LR                                    S01117 138352
     O*******AND*     N74                                          S01117 138352
     O***********                        76 '*** NO DETAILS TO REPORT'117 138352
     O***********                        80 '***'                  S01117 138352
     O********E**2     08 66                                              S01117
     O***********                        68 '***   END OF REPORT'         S01117
     O***********                        74 '***'                         S01117
     O*
     O*CLTY***D**      31N34                                              S01117
     OFCLTYZZ D        31N34                                              S01117
     O                         NLRB      25P
     O                         NINS      28P
     O                         NDEL      31P
     O                         VLBF      42P
     O                         VLBL      44P
     O                         VRIF      52P
     O                         VRIL      54P
     O                         VRDF      62P
     O                         VRDL      64P
     O                         VRAF      72P
     O                         VRAL      74P
** CPY@   **      OBJECT COPYRIGHT
(c) Finastra International Limited 2001
**   ZYDY - YEARS IN DAYS CUMULATIVE, FOUR YEAR SPAN
0366073110961461
**   ZMDY - MONTHS IN DAYS CUMULATIVE THROUGH YEAR
000031059090120151181212243273304334365
**   ZMNM - MONTHS SHORT NAMES
JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC
