     H        1
      *****************************************************************
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas LE Financial loans diary by branch')             *
     F*****************************************************************
     F*                                                               *
     F*  Midas - Customer Lending Module                              *
     F*                                                               *
     F*  LE0691 - PRINT FINANCIAL LOANS DIARY BY BRANCH               *
     F*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *  Last Amend No. CLE154             Date 02Aug12               *
      *  Prev Amend No. CLE134             Date 01Aug12               *
      *                 CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      *                 CSC042             Date 16Feb09               *
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      *                 244589             Date 19Dec06               *
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD031             Date 10Apr06               *
      *                 CLE042             Date 06Sep05               *
      *                 BUG8219            Date 20Aug05               *
      *                 240313             Date 29Jun06               *
      *                 237251             Date 12Feb06               *
      *                 CSD027             Date 09Dec05               *
      *                 BUG8477            Date 16Sep05               *
      *                 BUG8137            Date 11Aug05               *
      *                 BUG6476            Date 13Apr05               *
      *                 CGL014             Date 20Oct03               *
      *                 CGL029             Date 01Sep03               *
      *                 CLE028             Date 27Jun02               *
      * Midas Release 4.01.02 ----------------------------------------*
      *                 204452             Date 02May02               *
      * Midas Release 4.01 -------------------------------------------*
      *                 193701             Date 17Aug01               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.03 -----------------------------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CLE009             Date 26Apr99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 141453             Date 17Feb99               *
     F*                 113735             DATE 13FEB97               *
     F*                 CLE004             DATE 02DEC96               *
     F*                 098642             DATE 27JUN96               *
     F*                 101841             DATE 22MAY96               *
     F*                 100522             DATE 22MAY96               *
     F*                 100373             DATE 22MAY96               *
     F*                 100515             DATE 22MAY96               *
     F*                 093584             DATE 28FEB96               *
     F*                 099357             DATE 29JAN96               *
     F*                 060308             DATE 16OCT95               *
     F*                 S01408             DATE 30AUG95               *
     F*                 S01408             DATE 25JUL95               *
     F*                 055365             DATE 09APR94               *
     F*                 052102             DATE 08OCT93               *
     F*                 E28771             DATE 02APR93               *
     F*                 S01392             DATE 01OCT92               *
     F*                 BH3528             DATE 18SEP92               *
     F*                 BH3493             DATE 11SEP92               *
     F*                 BHF820             DATE 01APR92               *
     F*                 S01339             DATE 29JUL91               *
     F*                 S01270             DATE 29JUL91               *
     F*                                                               *
     F*---------------------------------------------------------------*
     F*                                                               *
      *  CLE154 - Loan Repayment Schedule Enhancement                 *
      *           (Amendable Payment Type)                            *     
      *  CLE134 - Past Due Call Loan Processing                       *
      *  CLE148 - Alpha Loan Reference                                *
      *  CSC042 - COB Performance fix. Only access AOBRCHR0 on change of *
      *           branch rather than every record as input file sorted by*
      *           branch                                                 *
      *           Store CCY details as read from AOCURRR* so that     *
      *           number of calls to AOCURRR* is reduced              *
      *  244589 - Enhance report for syndicated loans.                *
      *  CSD031 - Enhanced Centralised Static Data (Recompile)        *
      *  CLE042 - Extended Loan Sub Type                              *
      *  BUG8219- I/O operation was applied to closed file LE0691P1   *
      *  240313 - Applied fix 239928.                                 *
      *  239928 - Prevent array index out of bounds error from        *
      *           occurring.                                          *
      *  237251 - Interest amount is truncated.                       *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  BUG8477- OCBC 82457 - Discrepancies in reports - M+          *
      *           LE0691/LE0690.                                      *
      *  BUG8137- Array index out of bounds.                          *
      *  BUG6476- Attempted WRITE operation on LE0691P1 while the     *
      *           file was closed.                                    *
      *  CGL014 - Collaterals Processing                              *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CLE028 - Flat Rate Personal Loans (Rule of 78s)              *
      *  204452 - Recompiled due to changed PF/LEFEED.                *
      *  193701 - On Financial Loans Diary Report, multi-currency     *
      *           rollover is shown with description REDRAWING.       *
      *           Change description from REDRAWING to MCCY ROLL.     *
      *  CLE009 - LE I/C Swift Message Generation for Fees            *
      *           Recompiled due to changes in LEFEED                 *
      *  141453 - Recompiled due to changes in PF/LEFEED              *
     F*  113735 - Recompiled due to changes in LVEDS.                 *
     F*  CLE004 - Customer Lending Enhancements - Syndications        *
     F*  098642 - Report LE0691P1 has no details to report.           *
     F*  101841 - Fee currency should be shown on the Financial Loans *
     F*           Diary.                                              *
     F*  100522 - For fee events, if fee calculation type is based    *
     F*           on average amount, output text 'ESTIMATED AVERAGE'  *
     F*           beside the amount.                                  *
     F*           Do not suppress the leading zeros of facility       *
     F*           customer no.                                        *
     F*  100373 - Sequence no. still not always put out. Usually      *
     F*           only would put out sequence no. 1. Print fee        *
     F*           code on report.                                     *
     F*  100515 - Recompile program due to changes in LEFEED.         *
     F*  093584 - Unable to change form length of spool file output   *
     F*           by changing printer file - remove Line specs.       *
     F*  099357 - Error on READE of LEFEED if file is empty - monitor *
     F*           for search argument being higher than highest key   *
     F*           in file, and do not read LEFEED if it is.           *
     F*  060308 - AMEND THE PROGRAM TO OUTPUT 'LOAN FEES DUE' EVENT   *
     F*  S01408 - Addition of hook LE0691OOP1                         *
     F*           Addition of hook LE0691OOP2                         *
     F*  S01408 - Addition of hook LE0691IIPG                         *
     F*           Addition of hook LE0691OPG1                         *
     F*           Addition of hook LE0691OPG2                         *
     F*           Addition of hook LE0691OPG3                         *
     F*  055365 - The ZSFILE call fails due to incomplete parameters. *
     F*  052102 - Open spoolfile LE0691P1 before calling ZSFILE       *
     F*  E28771 - Show account officers name on report                *
     F*  S01392 - JAPANESE SUB MODULE ENHANCEMENTS                    *
     F*  BH3528 - Seq not always put out.                             *
     F*  BH3493 - As part of this error, put out fee sequence to P1.  *
     F*  BHF820 - FIRST CYCLE PROCESSING IMPROVED                     *
     F*  S01339 - Remove Syndicated Loans processing due to Module    *
     F*           Redundancy.                                         *
     F*  S01270 - Customer Profitability and Fees Processing.         *
     F*                                                               *
     F*****************************************************************
     F*                                                               *
     F*  C R E A T I O N     P A R A M E T E R S                      *
     F*                                                               *
     F*                                                               *
     F*****************************************************************
      *
0011 F***LVEDS***IP**F     128 21AI     2 DISK                            100373
     F***LVEDS***IP**F     131 21AI     2 DISK                     100373 CLE004
     F/COPY WNCPYSRC,LE0691F001
     F***LVEDS***IP**F     132 21AI     2 DISK                                         CLE004 CGL014
     F*LVEDS***IP**F*****190 21AI     2 DISK                                           CGL014 CLE042
     F***LVEDS** IP  F     194 21AI     2 DISK                                         CLE042 244589
     F*LVEDS***IP  F     211 21AI     2 DISK                                           244589 CLE154
     FLVEDS   IP  F     212 21AI     2 DISK                                                   CLE154
     F/COPY WNCPYSRC,LE0691F002
     FLEFEED  IF  E           K        DISK                               BH3493
     F/COPY WNCPYSRC,LEH01268
     FLEFCLTLQIF  E           K        DISK                                                   244589
0013 FLE0691AUO   F     132     OA     PRINTER      KINFDS SPOOLU
0013 FLE0691P1O   F     132     OF     PRINTER      KINFDS SPOOL      UC  093584
0013 F*E0691P1O***F     132     OF    LPRINTER      KINFDS SPOOL      UC  093584
      /EJECT
     F*****************************************************************
     F*                                                               *
     F*  F U N C T I O N   O F   I N D I C A T O R S                  *
     F*                                                               *
     F*   01  - LVEDS - HEADER                                        *
     F*   02  - LVEDS - DETAIL                                        *
     F*   03  - LVEDS - TRAILER                                       *
     F*                                                               *
     F*   10  - ALLOW OUTPUT TO BRANCH REPORT                         *
     F*                                                               *
     F*   20  - EVENT CODE ON TALBE                                   *
     F****21**-*FIRST*POSITION*OF*FACILITY/COMMITMENT*REF*=*F**********   S01339
     F*   21  - FIRST POSITION OF FACILITY REF = F                    *   S01339
     F****24**-*OTHER*FEE*CODE*ZERO/BLANK******************************   S01339
     F*   25  - EVENT TYPE = L                                        *
     F****26**-*OTHER*FEE*NOT*ON*SDFEEPD.******************************   S01339
     F****27**-*LOAN/DRAWDOWN*CCY*BLANK*I.E.*FCLTY*OR*COMMITMENT*******   S01339
     F*   27  - LOAN CURRENCY BLANK, I.E. FACILITY                    *   S01339
     F*   28  - CLE004 is switched on                                 *   CLE004
     F*                                                               *
     F*   30  - RECORD COUNT = 2. I.E. - FIRST DETAIL RECORD          *
     F*   31  - NO DETAIL RECORDS HAVE BEEN PRINTED                   *
      *   32  - CLE106 is switched on                                 *                       244589
      *   33  - Record not found                                      *                       244589
     F*   35  - LINE COUNT >= 46. PRINT HEADINGS                      *
     F*   36  - PRINT HEADINGS                                        *
     F*   37  - SETON IF FIRST DETAIL OR FIRST OF NEW EVENT DATE      *
     F*   38  - WITHHOLDING TAX INDICATOR = Y                         *
     F*   39  - AUTO SETTLEMENT INDICATOR = Y                         *
     F*   40  - EVENT AMOUNT < 0                                      *
     F*   41  - REPAYMENT AMOUNT < 0                                  *
     F*   42  - INTEREST AMOUNT < 0                                   *
     F*   43  - AMOUNT NEGATIVE                                       *
     F*                                                               *
     F*   50  - 0 -DECIMAL PLACES                                     *
     F*   51  - 1 -DECIMAL PLACES                                     *
     F*   52  - 2 -DECIMAL PLACES                                     *
     F*   53  - 3 -DECIMAL PLACES                                     *
     F*                                                               *
     F*   60  - IDENTIFIES FIRST LOAN FEE EVENT RECORD                *   S01270
     F*   61  - CONDITIONS OUTPUT OF LOAN FEE HEADER                  *   S01339
     F*                                                               *
     F****60**-*FIRST*CYCLE*INDICATOR*******************************BHF820  0045
     F*   62  - FIRST CYCLE INDICATOR                                 *     0045
     F*   65  - Print 'No details to report.' on P1                   *   055365
     F*   66  - Primary file is not empty                             *   055365
     F**                                                              *   BHF820
     F*   70  - CONTROLS OUT OF BALANCE                               *
     F*   71  - INTEGER OF HASH = 0                                   *
     F*   72  - INTEGER OF CALCULATED HASH = 0                        *
     F*                                                               *
     F*   80  - CURRENCY NOT ON SDCURRPD -DATABASE ERROR              *
     F*   88  - MBIN = 'Y'                                            *
     F*                                                               *
     F* 90-99 - USED IN STANDARD SUBROUTINES                          *
     F*                                                               *
     F*   L4  - CHANGE OF BRANCH                                      *
     F*   L3  - CHANGE OF ACCOUNT OFFICER                             *
     F*   L2  - CHANGE OF EVENT DATE                                  *
     F*   L1  - CHANGE OF EVENT CODE                                  *
     F*                                                               *
     F*   U8  - FILE CONTROLS OUT OF BALANCE                          *
     F* U7&U8 - DATABASE ERROR                                        *
     F*                                                               *
     F*****************************************************************
      /EJECT
     E********************FSQ        99  2 0             FEE SEQUENBH3528 100373
     E/COPY ZSRSRC,ZDATE2Z1                                               S01392
0063 E**********          ETYP    7   7  1               EVENT CODES                          CLE028
0064 E**********          N       7   7  1 0             NUMERIC FOR ABOVE                    CLE028
     E                    ETYP    8   8  1                                                    CLE028
     E                    N       8   8  1 0                                                  CLE028
0065 E********************ENAR    1   7 12               EVENT NARRATIVES S01339
0066 E********************UDL     1   7 12               UNDERLINE ABOVE  S01339
0065 E**********          ENAR    1   8 17               EVENT NARRATIVES              S01339 CLE028
0066 E**********          UDL     1   8 17               UNDERLINE ABOVE               S01339 CLE028
     E**********          ENAR    1   9 17                                             CLE028 CGL014
     E**********          UDL     1   9 17                                             CLE028 CGL014
     E                    ENAR    1  13 26                                                    CGL014
     E                    UDL     1  13 26                                                    CGL014
     E                    CPY@    1   1 80               COPYRIGHT ARRAY
     E                    AASS    1   3 10                                CLE004
     E                    CURR      150  3               Currency                             CSC042
     E                    #CDP      150  1 0             Decimal Places                       CSC042
     E                    #CDC      150  1               Dealing CCY                          CSC042
     E                    #CTX      150  1 0             Telex/Notice                         CSC042
     E                    ##BR      999  3               Branch Codes                         CSC042
     E                    ##BN      999 30               Branch Names                         CSC042
      /EJECT
     L*LE0691P1*66FL*58OL***                                              093584
0067 I*
     I/COPY WNCPYSRC,LE0691I002
0068 I** LVEDS - HEADER
0069 ILVEDS   NS  01   1 CH
     I/COPY WNCPYSRC,LE0691I003
0070 I                                        1   1 RECI
0071 I*
     I/COPY WNCPYSRC,LE0691I004
0072 I** LVEDS - DETAIL
0073 ILVEDS   NS  02   1 CD
     I/COPY WNCPYSRC,LE0691I005
0074 I                                        1   1 RECI
0075 I                                        2   2 EVNT  L1
0076 I                                        3   8 BWCN
     I**********                              3   80BWCN60                             BH3493 CSD027
     I                                        3   8 BWCN60                                    CSD027
0077 I                                        9   9 CONI
0078 I                                       10  10 CDTI
     I/COPY WNCPYSRC,LE0691I010
0079 I                                       11  12 ACOC  L3
0080 I                                    P  13  150EVND  L2
     I/COPY WNCPYSRC,LE0691I011
0081 I                                       16  210CFREF
0082 I                                       22  22 EVNF
0083 I                                    P  23  290AMNT
0084 I                                       30  35 LDREF
0085 I                                       36  38 CMCY
0086 I                                       39  41 DDCY            27
0087 I                                    P  42  440RFXD
0088 I                                       45  50 AGNT
0089 I                                    P  51  570RPYA
0090 I                                    P  58  640INTA
0091 I                                       65  65 WTXI
0092 I**************************             66  670OFCD            24    S01270
0092 I                                       66  670OFCD                  S01270
0093 I                                       68  75 CASK
     I/COPY WNCPYSRC,LE0691I012
0094 I                                       76  95 CPNM
     I/COPY WNCPYSRC,LE0691I013
0095 I                                       96 105 CTWN
0096 I**********                            106 1110FCNO                                      CSD027
0096 I                                      106 111 FCNO                                      CSD027
0097 I                                      112 112 AUTO
0098 I                                      113 114 LTYP
0099 I                                      115 116 SUTP
0100 I                                      117 119 BRCA  L4
     I                                      129 1310LASN                  100373
     I                                      132 132 GASI                  CLE004
     I                                      133 142 CREF                                      CGL014
     I                                      143 147 COLT                                      CGL014
     I                                      148 177 DESC                                      CGL014
     I                                      178 178 ENTY                                      CGL014
     I                                      179 181 ENTT                                      CGL014
     I                                      182 182 GNSP                                      CGL014
     I                                    P 183 1900LAMT                                      CGL014
     I                                      191 194 CLAS                                      CLE042
     I                                      195 209 PCRF                                      244589
     I                                      209 210 LPFI                                      244589
     I                                      211 211 INOI                                      244589
     I                                      212 212 REPT                                      CLE154
     I*                                                                   S01408
     I/COPY WNCPYSRC,LE0691IIPG                                           S01408
     I*                                                                   S01408
0101 I***TO*CHECK*IF*FACILITY*OR*COMMITMENT****************************   S01270
0101 I** To enable output of Facility Details                             S01270
0102 I                                       16  16 FC
0103 I                                       17  190FCA
0104 I                                       20  210FCB
0105 I*
     I/COPY WNCPYSRC,LE0691I006
0106 I** LVEDS - TRAILER
0107 ILVEDS   NS  03   1 CT
     I/COPY WNCPYSRC,LE0691I007
0108 I                                        1   1 RECI
0109 I                                    P   2   40NORE
0110 I                                    P   5  120HRWN
0111 I                                    P  13  140HRDC
0112 I*
     I/COPY WNCPYSRC,LE0691I008
0113 I***LVEDS - CATCHALL
0114 ILVEDS   NS
     I/COPY WNCPYSRC,LE0691I009
0115 I                                        1   1 RECI
      *                                                                                       244589
     IFCLTYFMF                                                                                244589
     I              FACT                            FFACT                                     244589
     I              CNUM                            FCNUM                                     244589
     I              FCNO                            FFCNO                                     244589
     I              SYIN                            FSYIN                                     244589
      *                                                                                       244589
0186 I*  DATA STRUCTURES
0187 I            DS
0188 I                                        1  110FDETS
0189 I**********                              1   60FCNO                                      CSD027
0189 I                                        1   6 FCNO                                      CSD027
0190 I                                        7   90FCA
0191 I                                       10  110FCB
     I                                        7  110FCAFCB                BH3493
0193 I*
0194 I** L.D.A.
0195 ILDA        UDS                            256
0196 I                                      134 141 DBFILE
0197 I                                      142 170 DBKEY
0198 I                                      171 180 DBPGM
0199 I                                      181 1830DBASE
     I**
     I**   FILE INFORMATION DATA STRUCTURE
     I**
     ISPOOL       DS
     I                                       83  92 SFILE
     I                                    B 123 1240SFNUM
     I/COPY WNCPYSRC,LE0691I001
     ISPOOLU      DS
     I                                       83  92 SFILEU
     I                                    B 123 1240SFNUMU
     I*                                                                   E28771
     ISDACOF    E DSSDACOFPD                                              E28771
     I*                                                                   E28771
     I**   Account officers                                               E28771
     I*                                                                   E28771
     I              AZACON                          ACON                  E28771
     I**
     I** DATA AREA RUNDAT
     I**
      *                                                                   CLE004
     ISCSARD    E DSSCSARDPD                                              CLE004
      ** SAR File Details Accessed via Access Program AOSARDR0            CLE004
      *                                                                   CLE004
     IDSFDY     E DSDSFDY
     I* FIRST DS FOR ACCESS PROGRAMS, SHORT DATA STRUCTURE
     I*
     IDSSDY     E DSDSSDY
     I* SECOND DS FOR ACCESS PROGRAMS, LONG DATA STRUCTURE
     I*
      **
     IRUNDT       DS
     I                                        1   7 RUNA
     I                                    P   8  100RUND
     I                                       11  11 SSF
     I                                       12  12 DATF
     I                                       13  13 MBIN
      *
     ISDCURR    E DSSDCURRPD
      **   CURRENCY TYPE
     I              A6DLCI                          DCCY
     I              A6TXND                          TNOT
     I              A6NBDP                          CDP
     I*
     I*SDFEE*****E*DSSDFEEPD*******                                       S01270
     I**************AUFENV*********                 NL20                  S01270
     I****EXTERNAL*DS*FOR*FEE*CODE*DETAILS******                          S01270
     I*
      *
     ISDBANK    E DSSDBANKPD
      ** BANK DETAILS
     I              BJURPT                          TITL
      **
     I**
     ISDBRCH    E DSSDBRCHPD
     I              A8BRCD                          BRAA                  055365
     I              A8BRNM                          BRNM
     I**  EXTERNAL DS FOR BRANCH CODES
     I**
      /EJECT
      *****************************************************************
      *                                                               *
      *  Main Processing.                                             *
      *                                                               *
      *****************************************************************
     C*
     C***PARAMETER*LIST*FOR*PROGRAM*'AOFEER0'**********                   S01270
     C***********PLIST1    PLIST                                          S01270
     C***********          PARM '*MSG   ' @RTCD                           S01270
     C***********          PARM '*KEY   ' @OPTN                           S01270
     C***********          PARM           FEEKEY  2                       S01270
     C***********SDFEE     PARM SDFEE     DSFDY                           S01270
     C           PLIST2    PLIST
     C                     PARM           @RTCD
     C                     PARM '*KEY   ' @OPTN
     C                     PARM           CKEY    3
     C           SDCURR    PARM SDCURR    DSSDY
     C*                                                                   E28771
     C           PLIST3    PLIST                                          E28771
     C                     PARM '*MSG   ' @RTCD                           E28771
     C                     PARM '*KEY   ' @OPTN                           E28771
     C                     PARM           ACOKEY  2                       E28771
     C           SDACOF    PARM SDACOF    DSFDY                           E28771
0204 C*
0200 C                     SETOF                     36
0201 C*****N01***          GOTO BY00                                      BHF820
0201 C******60**           GOTO BY00                                 BHF820 0045
     C**********           SETON                     60              BHF820 0045
     C      62             GOTO BY00                                        0045
     C                     SETON                     62                     0045
0202 C*
0203 C**  FIRST CYCLE ONLY
     C**
     C           *ENTRY    PLIST
     C                     PARM           SEQ     5
     C                     PARM           BRNCH   3         BRANCH OR ALL
     C*                                                                   BH3493
     C           FEEKEY    KLIST                                          BH3493
     C                     KFLD           BRCA                            BH3493
     C                     KFLD           BWCN60                          BH3493
     C                     KFLD           FCAFCB                          BH3493
     C                     KFLD           WRK60                           BH3493
     C                     KFLD           FESEQ                           BH3528
      *                                                                                       244589
     C           FCTKEY    KLIST                                                              244589
     C                     KFLD           FCNO                                                244589
     C                     KFLD           FCA                                                 244589
     C                     KFLD           FCB                                                 244589
      *                                                                                       244589
     C*                                                                   BH3493
     C**********           Z-ADD0         WRK60   60                                   BH3493 CLE148
     C                     MOVEL*BLANKS   WRK60   6                                           CLE148
     C                     Z-ADD0         FESEQ   20                      BH3528
     C***********          Z-ADD0         FSQ                      BH3528 100373
     C*                                                                   BH3493
     C                     MOVEACPY@      BIS@   80
     C                     Z-ADD0         ##BNDX  40                                          CSC042
     C           *LIKE     DEFN ##BNDX    B                                                   CSC042
     C           *LIKE     DEFN ##BNDX    ##BSV                                               CSC042
      * Set up index used by ccy arrays                                                       CSC042
     C                     Z-ADD0         ##QNDX                                              CSC042
      *                                                                                       CSC042
0204 C*
0205 C**  SET-UP FOR D.B. ERROR
0206 C                     MOVEL'LE0691  'DBPGM
0207 C                     MOVE ' '       XX     28
0208 C                     MOVE XX        DBKEY
0209 C*
     C*    DEFINE LDA
     C           *NAMVAR   DEFN           LDA
0209 C*
     C           *NAMVAR   DEFN RUNDAT    RUNDT
     C                     IN   RUNDT
     C           MBIN      IFEQ 'Y'
     C                     SETON                     88
     C                     END
     C*                                                                   055365
     C** Turn-off printing of 'No details...' on P1.                      055365
     C** *IN66 = '1', primary file not empty.                             055365
     C*                                                                   055365
     C                     MOVE '0'       *IN65                           055365
     C                     MOVE '1'       *IN66                           055365
0210 C**  ACCESS I/C ONE
0211 C                     EXSR ZSYSTM
     C           *IN99     IFEQ '1'
0213 C                     MOVEL'SDBANKPD'DBFILE
0215 C                     MOVE '01'      DBASE            ** DBASE  01 **
0216 C                     SETON                     U7U8LR
0217 C                     GOTO ENDALL
     C                     END
     C*                                                                   E28771
     C**   Setup narrative for unassigned account officers                E28771
     C*                                                                   E28771
     C                     MOVEL'UNASSIGN'UNASSG 10                       E28771
     C                     MOVE 'ED'      UNASSG                          E28771
      *                                                                   CLE004
      ** Determine if Customer Lending Enhancements - Syndications        CLE004
      ** (CLE004) is installed                                            CLE004
      *                                                                   CLE004
     C                     CALL 'AOSARDR0'                                CLE004
     C                     PARM *BLANKS   @RTCD                           CLE004
     C                     PARM '*VERIFY' @OPTN                           CLE004
     C                     PARM 'CLE004'  PSARD   6                       CLE004
     C           SCSARD    PARM SCSARD    DSFDY                           CLE004
     C                     MOVE 'N'       CLE004  1                       CLE004
     C                     MOVE '0'       *IN28                           CLE004
      *                                                                   CLE004
      ** If feature is on, set up SAR work flag                           CLE004
      *                                                                   CLE004
     C           @RTCD     IFEQ *BLANKS                                   CLE004
     C                     MOVE 'Y'       CLE004                          CLE004
     C                     MOVE '1'       *IN28                           CLE004
     C                     ELSE                                           CLE004
      *                                                                   CLE004
      ** else, database error (return code other than *NRF)               CLE004
      *                                                                   CLE004
     C           @RTCD     IFNE '*NRF   '                                 CLE004
     C                     MOVEL'SCSARDPD'DBFILE           ************   CLE004
     C                     MOVEL'*VERIFY' DBKEY            * DBERR 05 *   CLE004
     C                     Z-ADD5         DBASE            ************   CLE004
     C                     MOVE '1'       *INU7                           CLE004
     C                     MOVE '1'       *INU8                           CLE004
     C                     GOTO ENDALL                                    CLE004
     C                     ENDIF                                          CLE004
      *                                                                   CLE004
     C                     ENDIF                                          CLE004
     C/COPY WNCPYSRC,LEH01269
      *                                                                                       CGL014
      ** Check if Collaterals Processing enhancement is on                                    CGL014
      *                                                                                       CGL014
     C                     CALL 'AOSARDR0'                                                    CGL014
     C                     PARM *BLANKS   @RTCD                                               CGL014
     C                     PARM '*VERIFY' @OPTN                                               CGL014
     C                     PARM 'CGL014'  PSARD                                               CGL014
     C           SCSARD    PARM SCSARD    DSFDY                                               CGL014
      *                                                                                       CGL014
     C           @RTCD     IFNE *BLANKS                                                       CGL014
     C           @RTCD     ANDNE'*NRF   '                                                     CGL014
     C                     MOVEL'SCSARDPD'DBFILE                                              CGL014
     C                     MOVEL'*VERIFY' DBKEY                                               CGL014
     C                     Z-ADD6         DBASE                                               CGL014
     C                     MOVE *ON       *INU7                                               CGL014
     C                     MOVE *ON       *INU8                                               CGL014
     C                     GOTO ENDALL                                                        CGL014
     C                     ENDIF                                                              CGL014
      *                                                                                       CGL014
     C           @RTCD     IFEQ *BLANKS                                                       CGL014
     C                     MOVE 'Y'       CGL014  1                                           CGL014
     C                     MOVE *ON       *IN29                                               CGL014
     C                     ELSE                                                               CGL014
     C                     MOVE 'N'       CGL014                                              CGL014
     C                     MOVE *OFF      *IN29                                               CGL014
     C                     ENDIF                                                              CGL014
      *                                                                                       244589
      ** Check if SynMan is Enabled(CLE106)                                                   244589
      *                                                                                       244589
     C                     CALL 'AOSARDR0'                                                    244589
     C                     PARM *BLANKS   @RTCD                                               244589
     C                     PARM '*VERIFY' @OPTN                                               244589
     C                     PARM 'CLE106'  PSARD                                               244589
     C           SCSARD    PARM SCSARD    DSFDY                                               244589
      *                                                                                       244589
     C           @RTCD     IFNE *BLANKS                                                       244589
     C           @RTCD     ANDNE'*NRF   '                                                     244589
     C                     MOVEL'SCSARDPD'DBFILE                                              244589
     C                     MOVEL'*VERIFY' DBKEY                                               244589
     C                     Z-ADD7         DBASE                                               244589
     C                     MOVE *ON       *INU7                                               244589
     C                     MOVE *ON       *INU8                                               244589
     C                     GOTO ENDALL                                                        244589
     C                     ENDIF                                                              244589
      *                                                                                       244589
     C           @RTCD     IFEQ *BLANKS                                                       244589
     C                     MOVE 'Y'       CLE106  1                                           244589
     C                     MOVE *ON       *IN32                                               244589
     C                     ELSE                                                               244589
     C                     MOVE 'N'       CLE106                                              244589
     C                     MOVE *OFF      *IN32                                               244589
     C                     ENDIF                                                              244589
      *                                                                                       CLE154
      ** Access SAR file to determine if CLE154 is switched ON.                               CLE154
      *                                                                                       CLE154
     C                     CALL 'AOSARDR0'                                                    CLE154
     C                     PARM *BLANKS   @RTCD                                               CLE154
     C                     PARM '*VERIFY' @OPTN                                               CLE154
     C                     PARM 'CLE154'  PSARD                                               CLE154
     C           SCSARD    PARM SCSARD    DSFDY                                               CLE154
      *                                                                                       CLE154
     C           @RTCD     IFNE *BLANKS                                                       CLE154
     C           @RTCD     ANDNE'*NRF   '                                                     CLE154
     C                     MOVEL'SCSARDPD'DBFILE                                              CLE154
     C                     MOVEL'*VERIFY' DBKEY                                               CLE154
     C                     Z-ADD8         DBASE                                               CLE154
     C                     MOVE *ON       *INU7                                               CLE154
     C                     MOVE *ON       *INU8                                               CLE154
     C                     GOTO ENDALL                                                        CLE154
     C                     ENDIF                                                              CLE154
      *                                                                                       CLE154
     C           @RTCD     IFEQ *BLANKS                                                       CLE154
     C                     MOVE 'Y'       CLE154  1                                           CLE154
     C                     SETON                     59                                       CLE154
     C                     ELSE                                                               CLE154
     C                     MOVE 'N'       CLE154                                              CLE154
     C                     ENDIF                                                              CLE154
0219 C*
      *                                                                                       CLE134
      ** CLE134 - Past Due Call Loans                                                         CLE134
      *                                                                                       CLE134
     C                     CALL 'AOSARDR0'                                                    CLE134
     C                     PARM *BLANKS   @RTCD                                               CLE134
     C                     PARM '*VERIFY' @OPTN                                               CLE134
     C                     PARM 'CLE134'  PSARD   6                                           CLE134
     C           SCSARD    PARM SCSARD    DSFDY                                               CLE134
     C                     MOVE 'N'       CLE134  1                                           CLE134
      *                                                                                       CLE134
      ** If feature is on, set up SAR work flag                                               CLE134
      *                                                                                       CLE134
     C           @RTCD     IFEQ *BLANKS                                                       CLE134
     C                     MOVE 'Y'       CLE134                                              CLE134
     C                     ENDIF                                                              CLE134
      *
     C/COPY WNCPYSRC,LE0691C009
0221 C*
0222 C**  SET-UP RECORD COUNT
0223 C                     Z-ADD1         RECTOT  50
0224 C*
0225 C**************       GOTO ENDALL                                   098642
0226 C*
0227 C           BY00      TAG                             ** BY00  TAG **
0228 C*
0229 C*   NOT DETAIL REC. GO TO END
0230 C     N02             GOTO END
     C*
     C**   MULTIBRANCH MAIN PROCESSING
     C*
     C           MBIN      IFEQ 'Y'
     C           *INL4     IFEQ '1'
     C                     CLOSELE0691P1
     C                     SETOF                     10
     C*                                                                   S01270
     C** SETOF indicators to condition EXCPT for first Loan Fee Output    S01270
     C                     SETOF                     6061                 S01270
     C           BRNCH     IFEQ 'ALL'
     C           BRNCH     OREQ BRCA
     C                     SETON                     10
     C                     MOVE 'Y'       P1OP    1
     C                     OPEN LE0691P1
     C                     Z-ADD0         PAGE
     C                     Z-ADD0         PAGE1
     C**
     C*    ENSURE REPORT SPOOL FILE RECORDED BY RCF
     C**
     C                     Z-ADDSFNUM     ZSNUM   60
     C**
     C                     OUT  LDA
     C                     CALL 'ZSFILE'
     C                     PARM           SEQ
     C                     PARM BRCA      SENTY
     C                     PARM           SFILE
     C                     PARM           ZSNUM
     C                     PARM           ZSERR   1
     C           *LOCK     IN   LDA
      *
     C           ZSERR     IFEQ 'Y'
      **  ERROR DURING ZSFILE PROCESSING, RETURN TO CALLING PROGRAM
     C                     SETON                     U7U8LR
     C                     RETRN
     C                     END
     C**
     C** RETRIEVE BRANCH NAME
     C                     MOVELBRCA      ##KB                                                CSC042
     C                     EXSR ##CHKB                                                        CSC042
      * If branch is in the array then use the details                                        CSC042
     C           ##FIC     IFEQ 'Y'                        *** B10                            CSC042
     C                     EXSR ##SETB                                                        CSC042
     C                     ELSE                            *** X10                            CSC042
     C**********           CALL 'AOBRCHR0'                                                    CGL029
     C                     CALL 'AOBRCHR1'                                                    CGL029
     C                     PARM '*MSG   ' @RTCD   7
     C                     PARM '*KEY   ' @OPTN   7
     C                     PARM BRCA      @DSNB   3
     C**********           PARM           SDBRCH                                              CGL029
     C           SDBRCH    PARM SDBRCH    DSSDY                                               CGL029
     C           @RTCD     IFNE *BLANK
     C                     SETON                     U7U8LR
     C                     MOVEL'SDBRCHPD'DBFILE
     C                     MOVEL@DSNB     DBKEY            ***************
     C                     MOVEL@OPTN     DBOPTN  7        * DBERROR 004 *
     C                     MOVEL'004'     DBASE            ***************
     C                     GOTO END
     C                     ELSE                                                               CSC042
      * Details found on the DB so add them to the array                                      CSC042
      * if the array still has room                                                           CSC042
     C                     EXSR ##ADDB                                                        CSC042
     C                     END
     C                     END                             *** E10                            CSC042
     C**
     C                     ELSE
     C                     SETOF                     10
     C           BRNCH     IFLT BRCA
     C                     SETON                     LR
      * Set-off detail indicator, LE0691P1 was already closed                                BUG6476
     C                     SETOF                     3629                                    BUG6476
      *                                                                                      BUG6476
     C                     GOTO END
     C                     END
     C                     END
     C                     END
     C**
     C                     ELSE
     C**
     C*       IF MBIN='N' AND FIRST CYCLE,
     C*       OPEN LE0691P1
     C**
     C           P1OP      IFNE 'Y'
     C                     SETON                     10    ALLOW OUTPUTPUT
     C                     MOVE 'Y'       P1OP    1
     C                     OPEN LE0691P1
     C                     Z-ADD0         PAGE
     C                     Z-ADD0         PAGE1
     C*
     C**      ENSURE REPORT SPOOL FILE RECORDED BY RCF
     C*
     C                     Z-ADDSFNUM     ZSNUM
     C*
     C                     OUT  LDA
     C                     CALL 'ZSFILE'
     C                     PARM           SEQ
     C                     PARM BRCA      SENTY   3
     C                     PARM           SFILE
     C                     PARM           ZSNUM
     C                     PARM           ZSERR
     C*
     C           *LOCK     IN   LDA
     C           ZSERR     IFEQ 'Y'
     C**  ERROR DURING ZSFILE PROCESSING, RETURN TO CALLING PROGRAM
     C                     SETON                     U7U8LR
     C                     RETRN
     C                     END
     C                     END
     C                     END
      *
     C           MBIN      IFEQ 'Y'
     C           BRNCH     IFNE 'ALL'
     C           BRNCH     ANDNEBRCA
     C                     SETOF                     10
0230 C                     GOTO END
     C                     END
     C                     END
     C**
0232 C**  ACCUMULATE CONTROLS
0233 C           RECTOT    ADD  1         RECTOT
0234 C           AMNT      DIV  1000      ZZAMT        43
0235 C         43          Z-SUBZZAMT     ZZAMT
0236 C                     EXSR GLZADD
0238 C*
0239 C**  ACCESS EVENT CODE ARRAY
0240 C                     Z-ADD1         X       10
0241 C           EVNT      LOKUPETYP,X                   20
0242 C**********           MOVE N,X       Z       10                                          CGL014
     C                     Z-ADD0         Z                                                  BUG8137
     C                     MOVE N,X       Z       20                                          CGL014
     C/COPY WNCPYSRC,LEH01270
      *                                                                                       CGL014
      ** Process Collateral Diary Events                                                      CGL014
      *                                                                                       CGL014
     C           CGL014    IFEQ 'Y'                                                           CGL014
     C           EVNT      IFEQ 'N'                                                           CGL014
     C           EVNT      OREQ 'O'                                                           CGL014
     C           EVNT      OREQ 'P'                                                           CGL014
     C           EVNT      OREQ 'Q'                                                           CGL014
     C                     MOVE *ON       *IN30                                               CGL014
     C           LAMT      COMP 0                      44                                     CGL014
      *                                                                                       CGL014
     C                     SELEC                                                              CGL014
     C           EVNT      WHEQ 'N'                                                           CGL014
     C                     Z-ADD10        Z                                                   CGL014
     C           EVNT      WHEQ 'O'                                                           CGL014
     C                     Z-ADD11        Z                                                   CGL014
     C           EVNT      WHEQ 'P'                                                           CGL014
     C                     Z-ADD12        Z                                                   CGL014
     C           EVNT      WHEQ 'Q'                                                           CGL014
     C                     Z-ADD13        Z                                                   CGL014
     C                     ENDSL                                                              CGL014
      *                                                                                       CGL014
     C                     SELEC                                                              CGL014
     C           ENTY      WHEQ 'K'                                                           CGL014
     C                     MOVE 'BANK'    LEVEL   4                                           CGL014
     C           ENTY      WHEQ 'C'                                                           CGL014
     C                     MOVE 'COMP'    LEVEL                                               CGL014
     C           ENTY      WHEQ 'B'                                                           CGL014
     C                     MOVE 'BRCH'    LEVEL                                               CGL014
     C                     OTHER                                                              CGL014
     C                     MOVE *BLANKS   LEVEL                                               CGL014
     C                     ENDSL                                                              CGL014
      *                                                                                       CGL014
     C           GNSP      IFEQ 'G'                                                           CGL014
     C                     MOVEL'GENERAL 'WGNSP   8                                           CGL014
     C                     ELSE                                                               CGL014
     C                     MOVEL'SPECIFIC'WGNSP                                               CGL014
     C                     ENDIF                                                              CGL014
      *                                                                                       CGL014
     C                     ELSE                                                               CGL014
     C                     MOVE *OFF      *IN30                                               CGL014
     C                     ENDIF                                                              CGL014
     C                     ENDIF                                                              CGL014
0243 C*  'Z' USED TO ACCESS ARRAYS ENAR & UDL
0245 C****CHECK*IF*FACILITY*OR*COMMITMENT**********                       S01270
0246 C***********FC        COMP 'F'                      21               S01270
0247 C*
0248 C**  FOR FORMATTING REPAYMENT & INTEREST
0249 C**  CHECK IF EVENT TYPE 'L'
0250 C           Z         COMP 7                        25
     C/COPY WNCPYSRC,LE0691C001
     C           CLE154    IFEQ 'Y'                                                           CLE154
     C                     MOVE '0'       *IN58                                               CLE154
     C           Z         IFEQ 2                                                             CLE154
     C           Z         OREQ 5                                                             CLE154
     C           Z         OREQ 6                                                             CLE154
      ** Check if Interest, Repayment or Maturity Event                                       CLE154
     C                     MOVE '1'       *IN58                                               CLE154
     C                     END                                                                CLE154
     C                     END                                                                CLE154
     C*
0251 C**  PERFORM RELEVENT PROCESSING
0252 C*****N25*****                                                       S01270
0253 C*OR****24****         GOTO BY03                                     S01270
0254 C***********                                                         S01270
0255 C****THEREFORE*EVENT=*'L'*&*OTHER*FEE*CODE*NOT*BLANK**************   S01270
     C***********          MOVE OFCD      FEEKEY                          S01270
     C***********          CALL 'AOFEER0' PLIST1                          S01270
     C***********@RTCD     IFNE *BLANKS                                   S01270
0260 C***********          SETON                     26                   S01270
     C***********          END                                            S01270
0261 C*
0255 C**  If Event = 'L', then *IN25 = '1'                                S01270
     C           *IN25     IFEQ '1'                                       S01270
     C*                                                                   S01270
     C* If the Account Officer has changed, SETOF *IN60 to                S01270
     C* enable the program to identify new Loan Fee Events.               S01270
     C           *INL3     IFEQ '1'                                       S01270
     C                     SETOF                     60                   S01270
     C                     END                                            S01270
     C*                                                                   S01270
0262 C* Check to see if this event relates to facility fees or to         S01270
0262 C* Loan fees. If LDREF & DDCY NOT = blanks, then LOAN fee event.     S01270
     C***********LDREF     IFNE '0'                                S01270 101841
     C***********DDCY      ANDNE*BLANKS                            S01270 101841
     C********** LDREF     IFNE '000000'                                               101841 CLE148
     C           LDREF     IFNE *BLANKS                                                       CLE148
     C                     SETOF                     61                   S01270
     C***********          Z-ADD9         Z                        S01270 060308
     C                     Z-ADD8         Z                               060308
     C*                                                                   S01270
0262 C* Check to find when the file records start to relate to Loan       S01270
0262 C* fees. When they do so, throw another page and a new Event         S01270
0262 C* Heading. *IN60 used to identify first Loan Fee Event.             S01270
     C           *IN60     IFEQ '0'                                       S01270
     C                     SETON                     606136               S01270
     C                     SETON                     L1                   S01270
     C                     END                                            S01270
     C*                                                                   S01270
     C                     END                                            S01270
     C                     END                                            S01270
0262 C*
0263 C***********BY03      TAG                             ** BY03  TAG **S01270
0264 C*
0265 C** ACCESS CURRENCY RECORD ON 'SDCURRPD' FOR DECIMAL POSITIONS
0266 C**IF*27*IT*IS*A*COMMITMENT*EVENT***********                         S01270
0266 C* IF 27 IT IS A FACILITY EVENT                                      S01270
0267 C                     SETOF                     515253
     C     N27             MOVELDDCY      CKEY
     C      27             MOVELCMCY      CKEY
      * Are the details for this CCY already stored in the arrays                             CSC042
     C                     MOVELCKEY      ##KC                                                CSC042
     C                     EXSR ##CHKC                                                        CSC042
     C           ##FIC     IFEQ 'Y'                                                           CSC042
      * Found in the arrays so use the details from there                                     CSC042
     C                     EXSR ##SETC                                                        CSC042
     C                     ELSE                                                               CSC042
     C                     CALL 'AOCURRR0'PLIST2
     C           @RTCD     IFNE *BLANKS
0274 C                     SETON                     80
0276 C                     MOVEL'SDCURRPD'DBFILE
0277 C                     MOVELCKEY      DBKEY
0278 C                     MOVEL'002'     DBASE            ** DBASE  02 **
0279 C                     SETON                     U7U8LR
0280 C                     GOTO ENDALL
     C                     ELSE                                                               CSC042
      * Found on the DB and not in the array so add to the array                              CSC042
     C                     EXSR ##ADDC                                                        CSC042
     C                     END
     C                     END                                                                CSC042
      * Deleted following two lines as they are spurious rubbish                              CSC042
0275 C*****N80*************GOTO BY04                                                          CSC042
0281 C*********************                                                                   CSC042
0282 C*********************                                                                   CSC042
0283 C***********BY04******TAG                             ** BY04 TAG **                     CSC042
0284 C           CDP       COMP 0                        50
0285 C        N50CDP       COMP 2                    535152
0286 C*
0287 C****CONVERT*RATE*FIX*DAY*NO.*TO*DATE*FORMAT*FOR*SYND.LOANS*******   S01339
0288 C******21***          GOTO BY04A                                     S01339
0289 C***********          Z-ADDRFXD      ZDAYNO                          S01339
0290 C***********          EXSR ZDATE2                                    S01339
0291 C***********          MOVE ZADATE    RFDAT   7                       S01339
0292 C***********BY04A     TAG                             ** BY04A TAG **S01339
     C*                                                                   E28771
     C**   On change of account officer, access name                      E28771
     C*                                                                   E28771
     C/COPY WNCPYSRC,LE0691C004
     C           *INL3     IFEQ '1'                                       E28771
     C/COPY WNCPYSRC,LE0691C005
     C*                                                                   E28771
     C           ACOC      IFEQ *BLANKS                                   E28771
     C           ACOC      OREQ '00'                                      E28771
     C*                                                                   E28771
     C                     MOVE *BLANKS   ACON                            E28771
     C                     MOVELUNASSG    ACON                            E28771
     C*                                                                   E28771
     C                     ELSE                                           E28771
     C*                                                                   E28771
     C                     MOVE ACOC      ACOKEY                          E28771
     C                     CALL 'AOACOFR0'PLIST3                          E28771
     C*                                                                   E28771
     C           @RTCD     IFNE *BLANKS                                   E28771
     C*                                                                   E28771
     C                     SETON                     U7U8                 E28771
     C                     MOVE ACOKEY    DBKEY                           E28771
     C                     MOVE 'SDACOFPD'DBFILE                          E28771
     C                     Z-ADD3         DBASE            DBASE 3        E28771
     C                     GOTO ENDALL                                    E28771
     C*                                                                   E28771
     C                     END                                            E28771
     C*                                                                   E28771
     C                     END                                            E28771
     C*                                                                   E28771
     C                     END                                            E28771
0293 C*
     C***  Pick up fee sequence                                           BH3493
     C*                                                                   BH3493
     C                     MOVE '  '      WOSEQ                           BH3493
     C                     MOVE '  '      WOFEC                           100373
     C           *IN25     IFEQ '1'                                       BH3493
     C                     MOVE '0'       *IN77                           BH3493
     C                     MOVE '0'       *IN24                           100522
     C                     MOVELLDREF     WRK60                           100373
     C                     Z-ADDLASN      FESEQ                           100373
     C*                                                                   100373
     C** Retrieve fee details                                             100373
     C*                                                                   100373
     C           FEEKEY    CHAINLEFEED               77                   100373
     C           *IN77     IFEQ '0'                                       100373
     C                     MOVELFEFSEQ    WOSEQ   2                       100373
     C                     MOVELFEFCOD    WOFEC   2                       100373
     C*                                                                   100522
     C** Check if fee calculation type is based on average amount         100522
     C*                                                                   100522
     C           FECALT    IFEQ '01'                                      100522
     C           FECALT    OREQ '02'                                      100522
     C           FECALT    OREQ '03'                                      100522
     C           FECALT    OREQ '11'                                      100522
     C           FECALT    OREQ '12'                                      100522
     C           FECALT    OREQ '13'                                      100522
     C           FECALT    OREQ '21'                                      100522
     C                     MOVE '1'       *IN24                           100522
     C                     END                                            100522
     C                     END                                            100373
     C                     END                                            100373
     C***********FEEKEY    SETLLLEFEED                              BH3493099357
     C***********          READELEFEED                   77         BH3493099357
     C***********FEEKEY    SETLLLEFEED               77            099357 100373
     C**N77******          READELEFEED                   77        099357 100373
     C***********                                                  099357 100373
     C************IN77     DOWEQ'0'                                BH3493 100373
     C************                                                 BH3493 100373
     C*****Pay*attention!*This*is*important!*LE0492*writes*the*fee*BH3528 100373
     C*****events,*and*does*them*in*fee*sequence order.*So*we*can*jBH3528 100373
     C*****take*them*off*in*fee*seq*order*here.********************BH3528 100373
     C***********                                                  BH3528 100373
     C*****If*customer*has*changed,*reset*store*of*sequence*numbersBH3528 100373
     C***********                                                  BH3528 100373
     C***********BWCN      IFNE SVBWCN                             BH3528 100373
     C***********          Z-ADD0         FSQ                      BH3528 100373
     C***********          END                                     BH3528 100373
     C***********          MOVE BWCN      SVBWCN  6                BH3528 100373
     C***********          Z-ADDFEFSEQ    BC      20               BH3528 100373
     C***********                                                  BH3528 100373
     C*****Either*End*Date*or*Next*Payment*Date*must*be*event*date.BH3493 100373
     C*****Then*again,*it*could*be*last*payment*date*or*start*date.BH3528 100373
     C***********                                                  BH3493 100373
     C***********FENPYD    IFEQ EVND                               BH3493 100373
     C***********FELPDT    OREQ EVND                               BH3528 100373
     C***********FEPEND    OREQ EVND                               BH3528 100373
     C***********FEPSTD    OREQ EVND                               BH3528 100373
     C***********FSQ,BC    IFEQ 0                                  BH3528 100373
     C***********          MOVE FEFSEQ    WOSEQ   2                BH3493 100373
     C***********                                                  BH3528 100373
     C*****Save*'used'*fee*seqs*so*as*not*to*use*them*again.*******BH3528 100373
     C***********                                                  BH3528 100373
     C***********          Z-ADDFEFSEQ    FSQ,BC  20               BH3528 100373
     C***********          MOVE '1'       *IN77                    BH3493 100373
     C***********          END                                     BH3528 100373
     C**********           ELSE                                    BH3493 BH3528
     C********** FEPEND    IFEQ EVND                               BH3493 BH3528
     C**********           MOVE FEFSEQ    WOSEQ                    BH3493 BH3528
     C**********           MOVE '1'       *IN77                    BH3493 BH3528
     C**********           ELSE                                    BH3493 BH3528
     C**********           MOVE '**'      WOSEQ                    BH3493 BH3528
     C**********           END                                     BH3493 BH3528
     C***********          END                                     BH3493 100373
     C***********          READELEFEED                   77        BH3493 100373
     C***********          END                                     BH3493 100373
     C***********          END                                     BH3493 100373
     C*                                                                   BH3493
0294 C*   CONVERT EVENT DAYNO TO DATE FORMAT
     C/COPY WNCPYSRC,LE0691C006
0295 C  NL2                GOTO BY05
     C/COPY WNCPYSRC,LE0691C007
0296 C                     Z-ADDEVND      ZDAYNO
0297 C                     EXSR ZDATE2
0298 C                     MOVE ZADATE    EVDAT   7
0299 C*
0300 C*
0301 C*
0302 C           BY05      TAG                             ** BY05  TAG **
0303 C*
0304 C**  CHECK IF AMOUNTS NEGATIVE
0305 C           AMNT      COMP 0                      40
0306 C           RPYA      COMP 0                      41
0307 C           INTA      COMP 0                      42
0308 C*
0309 C*
0310 C**  CHECK WITHHOLDING TAX & AUTO SETTLE INDICATORS.
0311 C           WTXI      COMP 'Y'                      38
0312 C           AUTO      COMP 'Y'                      39
     C  N39      AUTO      IFEQ 'C'                                                           CLE134
     C           CLE134    IFEQ 'Y'                                                           CLE134
     C                     MOVE *ON       *IN39                                               CLE134
     C                     ENDIF                                                              CLE134
     C                     ENDIF                                                              CLE134
      *                                                                   CLE004
      ** If CLE004 is switched on, print the 'Generate on                 CLE004
      ** Assignment' detail                                               CLE004
      *                                                                   CLE004
     C           CLE004    IFEQ 'Y'                                       CLE004
     C                     SELEC                                          CLE004
     C           GASI      WHEQ 'Y'                                       CLE004
     C**********           MOVELAASS,1    WGASI  10                                    CLE004 CLE042
     C                     MOVELAASS,1    WGASI   6                                           CLE042
     C           GASI      WHEQ 'T'                                       CLE004
     C                     MOVELAASS,2    WGASI                           CLE004
     C           GASI      WHEQ 'R'                                       CLE004
     C                     MOVELAASS,3    WGASI                           CLE004
     C                     OTHER                                          CLE004
     C                     MOVEL*BLANKS   WGASI                           CLE004
     C                     ENDSL                                          CLE004
     C                     ENDIF                                          CLE004
      *                                                                                       244589
     C                     MOVE *BLANK    WINOI   1                                           244589
     C           CLE106    IFEQ 'Y'                                                           244589
     C           FCTKEY    CHAINLEFCLTLQ             33                                       244589
      *                                                                                       244589
     C           *IN33     IFEQ *OFF                                                          244589
     C           INOI      IFEQ *BLANK                                                        244589
     C                     MOVE 'N'       WINOI                                               244589
     C                     ELSE                                                               244589
     C                     MOVE INOI      WINOI                                               244589
     C                     ENDIF                                                              244589
     C                     ENDIF                                                              244589
     C                     ENDIF                                                              244589
     C/COPY WNCPYSRC,LEH00847
      *                                                                   CLE004
0313 C********************************************************************
0314 C           END       TAG                             **  END  TAG **
0316 C*
0317 C  N03 OFNL2
0339 F*  IF DATABASE ERROR IN FIRST RECORD
0340 F*  HEADINGS STILL NEED TO BE PRINTED
     COR 01 U7
     C*
     C/COPY WNCPYSRC,LE0691C008
0318 CORN03 L2             SETON                     36
     C/COPY WNCPYSRC,LE0691C002
0319 C  N03 L1
0337 COR    61                                                            S01270
0320 COR    36             EXCPT
0321 C           TCALCS    TAG                             ** TCALCS TAG *
0322 C*
0323 C     N03             GOTO ENDALL
0324 C*   CHECK IF ANY DETAILS HAVE BEEN REPORTED. 31 ON:NO DETAILS
0325 C           RECTOT    COMP 1                        31
     C   31                SETON                         36
0326 C*   ADD TO CONTROL
0327 C           RECTOT    ADD  1         RECTOT
0328 C*
0329 C**  CHECK IF CONTROLS BALANCE
     C           MBIN      IFEQ 'N'
     C           MBIN      OREQ 'Y'
     C           BRNCH     ANDEQ'ALL'
0330 C           NORE      COMP RECTOT               7070
0331 C        N70HRWN      COMP ZZTOTI               7070
0332 C        N70HRDC      COMP ZZTOTD               7070
0333 C         70          SETON                         U8
     C                     END
0334 C*
0338 C           ENDALL    TAG                             ** ENDALL TAG *
0343 C   U7
0344 COR U8                SETON                     LR
     C**
     C*       ENSURE TOTAL SPOOL FILE RECORDED BY RCF
     C**
     CLR                   Z-ADDSFNUMU    ZSNUMU  60
     C**
     CLR                   OUT  LDA
     CLR                   CALL 'ZSFILE'
     CLR                   PARM           SEQ     5
     CLR                   PARM *BLANK    SENTY   3
     CLR                   PARM           SFILEU
     CLR                   PARM           ZSNUMU
     CLR                   PARM           ZSERR   1
     CLR         *LOCK     IN   LDA
      *
     CLR         ZSERR     IFEQ 'Y'
      **  ERROR DURING ZSFILE PROCESSING, RETURN TO CALLING PROGRAM
     CLR                   SETON                     U7U8
     CLR                   RETRN
     CLR                   END
0335 C**  IF NO DETAILS HAVE BEEN REPORTED PRINT HEADINGS
     CLR         P1OP      IFNE 'Y'
     CLR                   EXSR TZZ
     CLR                   END
      **
     CLR    U7 U8          EXSR *PSSR
      *
      *****************************************************************
      /EJECT                                                                                  CSC042
     C********************************************************************                    CSC042
     C*                                                                                       CSC042
     C*  ##CHKC  - Check the currency details                                                 CSC042
     C*                                                                                       CSC042
     C********************************************************************                    CSC042
     C           ##CHKC    BEGSR                                                              CSC042
      *                                                                                       CSC042
     C           *LIKE     DEFN BJCYCD    ##KC                                                CSC042
     C           *LIKE     DEFN Q         ##QSV                                               CSC042
      *                                                                                       CSC042
      * Set off the currency found indicator                                                  CSC042
     C                     MOVEL*BLANK    ##FIC   1                                           CSC042
      *                                                                                       CSC042
      * Save the state of indicator 87 so it can be reset at the end                          CSC042
      * of the SR as it may be used elsewhere in the code                                     CSC042
     C           *IN87     IFEQ *ON                                                           CSC042
     C                     MOVEL'Y'       #IN87   1                                           CSC042
     C                     ELSE                                                               CSC042
     C                     MOVEL'N'       #IN87                                               CSC042
     C                     END                                                                CSC042
      *                                                                                       CSC042
     C                     SETOF                         87                                   CSC042
      *                                                                                       CSC042
      * Restore Q from ##QSV in case Q is used elsewhere in the code                          CSC042
     C                     Z-ADD##QSV     Q       40                                          CSC042
      *                                                                                       CSC042
      * Are we looking for the same details as the last time this                             CSC042
      * subroutine was called i.e. is Q already set correctly?                                CSC042
      * If so then use the data rather than do another LOKUP                                  CSC042
      * First make sure that we don't reference the 0th array element                         CSC042
     C           Q         IFEQ 0                                                             CSC042
     C                     Z-ADD1         Q                                                   CSC042
     C                     END                                                                CSC042
      * Now see if this search is same as last one performed                                  CSC042
      * If we have a match then seton 87 so the code after this                               CSC042
      * subroutine knows it can use Q directly                                                CSC042
     C           ##KC      IFEQ CURR,Q                                                        CSC042
     C                     SETON                         87                                   CSC042
     C                     ELSE                                                               CSC042
      * Otherwise hunt in the array and seton 87 if found                                     CSC042
     C                     Z-ADD1         Q                                                   CSC042
     C           ##KC      LOKUPCURR,Q                   87                                   CSC042
     C                     END                                                                CSC042
      *                                                                                       CSC042
      * Save Q for next time                                                                  CSC042
     C           *IN87     IFEQ *ON                                                           CSC042
     C                     Z-ADDQ         ##QSV                                               CSC042
      * Set the indicator to show the data was found                                          CSC042
     C                     MOVEL'Y'       ##FIC                                               CSC042
     C                     END                                                                CSC042
      *                                                                                       CSC042
      * Reset the state of indicator 87.                                                      CSC042
     C           #IN87     IFEQ 'Y'                                                           CSC042
     C                     MOVEL*ON       *IN87                                               CSC042
     C                     ELSE                                                               CSC042
     C                     MOVEL*OFF      *IN87                                               CSC042
     C                     END                                                                CSC042
      *                                                                                       CSC042
     C                     ENDSR                                                              CSC042
      *                                                                                       CSC042
     C********************************************************************                    CSC042
      /EJECT                                                                                  CSC042
     C********************************************************************                    CSC042
     C*                                                                                       CSC042
     C*  ##SETC  - Set up the SDCURRPD fields as expected by this program                     CSC042
     C*            from the array fields                                                      CSC042
     C*                                                                                       CSC042
     C********************************************************************                    CSC042
     C           ##SETC    BEGSR                                                              CSC042
     C*                                                                                       CSC042
     C                     MOVELCURR,Q    A6CYCD                                              CSC042
     C                     MOVEL#CDC,Q    DCCY                                                CSC042
     C                     Z-ADD#CTX,Q    TNOT                                                CSC042
     C                     Z-ADD#CDP,Q    CDP                                                 CSC042
     C*                                                                                       CSC042
     C                     ENDSR                                                              CSC042
     C********************************************************************                    CSC042
      /EJECT                                                                                  CSC042
      ********************************************************************                    CSC042
      *                                                                                       CSC042
      * ##ADDC - Adds the SDCURRPD fields used in the code to the                             CSC042
      * arrays                                                                                CSC042
      *                                                                                       CSC042
     C           ##ADDC    BEGSR                                                              CSC042
      *                                                                                       CSC042
     C           *LIKE     DEFN Q         ##QNDX                                              CSC042
      * If there is still room in the array then add the details                              CSC042
     C           ##QNDX    IFLT 150                                                           CSC042
     C                     ADD  1         ##QNDX                                              CSC042
     C                     Z-ADD##QNDX    Q                                                   CSC042
     C                     MOVELA6CYCD    CURR,Q                                              CSC042
     C                     MOVELDCCY      #CDC,Q                                              CSC042
     C                     Z-ADDTNOT      #CTX,Q                                              CSC042
     C                     Z-ADDCDP       #CDP,Q                                              CSC042
     C                     END                                                                CSC042
      *                                                                                       CSC042
      * Update ##QSV so next call to ##CHKC checks this latest adddition                      CSC042
      * to the array firss                                                                    CSC042
     C                     Z-ADDQ         ##QSV                                               CSC042
      *                                                                                       CSC042
     C                     ENDSR                                                              CSC042
      ********************************************************************                    CSC042
      /EJECT
      *****************************************************************
      *                                                               *
0349  *  ZSYSTM SR. TO CHAIN TO THE INSTALLATION CONTROL DATA RECORD. *
0350  *                                                               *
      *****************************************************************
0350  *
0351 C           ZSYSTM    BEGSR                           *** ZSYSTM ***
0359 C**
     C                     CALL 'AOBANKR0'
     C                     PARM '*MSG   ' @RTCD   7
     C                     PARM '*FIRST ' @OPTN   7
     C           SDBANK    PARM SDBANK    DSFDY
     C           @RTCD     IFNE *BLANKS
     C                     SETON                     99
     C                     END
0360 C**   CHECK SYSTEM DATE FORMAT, DDMMYY OR MMDDYY.
0361 C           DATF      COMP 'M'                      98MMDDYY, 98 ON
0362 C**
     C/COPY WNCPYSRC,LE0691C003
0363 C                     ENDSR
      *
      *****************************************************************
      /EJECT
      *****************************************************************
      *                                                               *
0368  * SUBROUTINE TO ADD AN AMOUNT (ZZAMT) TO THE TOTAL (ZZTOTI,ZZTOTD)
0369  *   IND '99' IS SET BY AN OVERFLOW ERROR                        *
0370  *                                                               *
      *****************************************************************
      *
0371 CSR         GLZADD    BEGSR                           *** GLZADD ****
0372 C*
0373 CSR                   Z-ADDZZAMT     ZZAMT  153     91-DEFINE ZZAMT
0374 CSR 91                GOTO ZZAEND                     AMT = 0.BYPASS
0375 C*
0376 C* SPLIT ZZAMT INTO INTEGER AND DECIMAL FIELDS
0377 CSR                   Z-ADDZZAMT     ZZAMTI 150       INTEGER FIELD
0378 CSR                   MOVE ZZAMT     ZZAMTD  30       DECIMAL FIELD
0379 C* BOTH ZZAMTI AND ZZAMTD CONTAIN A 'SIGN' ZONE NOW
0380 C*
0381 CSR                   EXSR GLZSUM
0382 CSR         ZZAEND    ENDSR                           ** ZZAEND TAG *
      *
      *****************************************************************
      /EJECT
      *****************************************************************
      *                                                               *
0385  * SUBROUTINE TO CARRY OUT THE ADDITION FOR SUBROUTINES -        *
0386  *                        GLZADD, GLZSUB, GLZCMP.                *
0387  *          PARAMETERS PASSED -                                  *
0388  *                     I/P ZZAMTI ZZAMTD                         *
0389  *                     O/P ZZTOTI ZZTOTD ZZNEGD IND 96 IND 99.   *
0390  *                                                               *
      *****************************************************************
      *
0391 CSR         GLZSUM    BEGSR                           *** GLZSUM ****
0392 C*
0393 CSR                   Z-ADDZZTOTI    ZZTOTI 150       DEFINE ZZTOTI
0394 CSR                   Z-ADDZZTOTD    ZZTOTD  30       DEFINE ZZTOTD
0395 CSR                   SETOF                     919293
0396 CSR                   SETOF                     949599
0397 C*
0398 C*    DETERMINE SIGN OF ZZAMTI & D,   92 IF NEG
0399 CSR         ZZAMTI    COMP 0                      9293
0400 CSR 93      ZZAMTD    COMP 0                      9293
0401 CSR 93                GOTO ZZSEND                     ZERO BYPASS
0402 C*
0403 C*    DETERMINE SIGN OF ZZTOTI & D, 91 IF NEG.
0404 CSR         ZZTOTI    COMP 0                      9193
0405 CSR 93      ZZTOTD    COMP 0                      9193
0406 C*
0407 C*    IF ZZTOTAL IS ZERO, RETURN ZZAMOUNT.
0408 CSR 93                Z-ADDZZAMTI    ZZTOTI
0409 CSR 93                Z-ADDZZAMTD    ZZTOTD
0410 CSR 93                GOTO ZZSEND                     ZERO BYPASS
0411 C*    IF SIGNS DIFFER BYPASS OVERFLOW CHECKS.
0412 CSR 91N92
0413 CORN91 92             GOTO ZZOFPS
0414 C*
0415 CSR         ZZAMTD    ADD  ZZTOTD    ZZWK2   40
0416 CSR         ZZWK2     COMP 999                  93    '93' = CARRY
0417 CSRN93      ZZWK2     COMP -999                   93    INTO INTEGER.
0418 C*
0419 CSR 93N92   ZZAMTI    ADD  1         ZZWK3  150       ADD 'CARRY' +VE
0420 CSR    93 92ZZAMTI    SUB  1         ZZWK3            SUB 'CARRY' -VE
0421 CSR 93      ZZTOTI    ADD  ZZWK3     ZZWK3
0422 CSRN93      ZZTOTI    ADD  ZZAMTI    ZZWK3
0423 C*
0424 C* IF THE MODULUS OF ZZWK3 IS LT MOD. ZZTOTI THEN O/F HAS OCCURED
0425 CSRN92      ZZWK3     COMP ZZTOTI                 99  -92 MEANS NOS.
0426 CSR 92      ZZWK3     COMP ZZTOTI               99     NEGATIVE
0427 CSRN99                Z-ADDZZWK2     ZZTOTD
0428 CSRN99                Z-ADDZZWK3     ZZTOTI
0429 C*
0430 C* IF O/F ZEROIZE ZZAMT , IND '99' SET AND ZZTOT FIELDS LEFT INTACT.
0431 CSR 99                Z-ADD0         ZZAMT  153
0432 CSR                   GOTO ZZSEND
0433 C*
0434 C* THE 'SIGNS' ARE DIFFERENT
0435 CSR         ZZOFPS    TAG                             ** ZZOFPS TAG**
0436 C* IF ZZAMT WAS NEGATIVE, MAKE IT POS. TO COMP WITH ZZTOT
0437 C*
0438 CSR 92                Z-SUBZZAMTI    ZZAMTI 150
0439 CSR 92                Z-SUBZZAMTD    ZZAMTD  30
0440 C*
0441 C* IF ZZTOT WAS NEGATIVE, MAKE IT POS. TO COMP WITH ZZAMT.
0442 C*
0443 CSR 91                Z-SUBZZTOTI    ZZTOTI
0444 CSR 91                Z-SUBZZTOTD    ZZTOTD
0445 C* BOTH ZZAMT AND ZZTOT ARE NOW POSITIVE.
0446 C*
0447 CSR         ZZTOTI    COMP ZZAMTI               93  95
0448 CSR 95      ZZTOTD    COMP ZZAMTD               93  95
0449 C*
0450 C* IF ZZTOT EQ. ZZAMT RETURN ZERO.
0451 CSR 95                Z-ADD0         ZZTOTI
0452 CSR 95                Z-ADD0         ZZTOTD
0453 CSR 95                GOTO ZZSEND
0454 C*
0455 C* IF ZZTOT GT. ZZAMT.
0456 CSR 93      ZZAMTD    COMP ZZTOTD               94
0457 CSR 93 94   ZZTOTI    SUB  1         ZZTOTI
0458 CSR 93 94   ZZTOTD    ADD  1000      ZZWK2
0459 CSR 93      ZZTOTI    SUB  ZZAMTI    ZZTOTI
0460 CSR 93 94   ZZWK2     SUB  ZZAMTD    ZZTOTD
0461 CSR 93N94   ZZTOTD    SUB  ZZAMTD    ZZTOTD
0462 C*
0463 C*
0464 C* IF ZZAMT GT. ZZTOT.
0465 CSRN93      ZZTOTD    COMP ZZAMTD               94
0466 CSRN93 94   ZZAMTI    SUB  1         ZZWK3  150
0467 CSRN93 94   ZZAMTD    ADD  1000      ZZWK2
0468 CSRN93 94   ZZWK3     SUB  ZZTOTI    ZZTOTI
0469 CSRN93N94   ZZAMTI    SUB  ZZTOTI    ZZTOTI
0470 CSRN93 94   ZZWK2     SUB  ZZTOTD    ZZTOTD
0471 CSRN93N94   ZZAMTD    SUB  ZZTOTD    ZZTOTD
0472 C*
0473 C* REVERSE SIGN OF ZZTOT IF LARGER I/P FIELDS WERE NEGATIVE
0474 CSR                   SETOF                     94
0475 CSR 93 91
0476 CORN93 92             SETON                     94
0477 CSR 94                Z-SUBZZTOTI    ZZTOTI
0478 CSR 94                Z-SUBZZTOTD    ZZTOTD
0479 C**
0480 C**   RESTORE SIGN OF ZZAMTI & ZZAMTD IF IT WAS REVERSED.
0481 CSR 92                Z-SUBZZAMTI    ZZAMTI
0482 CSR 92                Z-SUBZZAMTD    ZZAMTD
0483 CSR         ZZSEND    TAG                             ** ZZSEND TAG *
0484 C**
0485 C**   IF ZZTOTD IS ZERO, AND ZZTOTI IS NEG. SET UP ZZNEGD.
0486 CSR                   SETOF                     96
0487 CSR         ZZTOTD    COMP 0                        91
0488 CSR 91      ZZTOTI    COMP 0                      96
0489 CSR 96                MOVE '.000-'   ZZNEGD  5
0490 CSR                   ENDSR                             ** ENDSR **
      *
      *****************************************************************
      /EJECT
      *****************************************************************
      *                                                               *
      * SUBROUTINE : TZZ                                              *
      *                                                               *
      * CALLED BY MAIN PROCESSING DURING TOTAL TIME CALCULATIONS IF   *
      * THE P1 FILES HAVE NOT ALREADY BEEN OPENED (IE, IF THERE ARE   *
      * NO RECORDS READ AND THEREFORE FILES OPENING NOT PERFORMED)    *
      *                                                               *
      *****************************************************************
      *
     C           TZZ       BEGSR
      *
     C***********          CLOSELE0691AU                           S01270 055365
     C***********          OPEN LE0691AU                           S01270 055365
     C*                                                                   055365
     C** Get date, title, and check multi-branching.                      055365
     C*                                                                   055365
     C           *IN66     IFEQ '0'                                       055365
     C                     IN   RUNDT                                     055365
     C           MBIN      IFEQ 'Y'                                       055365
     C                     MOVE '1'       *IN88                           055365
     C                     END                                            055365
     C                     EXSR ZSYSTM                                    055365
     C           *IN99     IFEQ '1'                                       055365
     C                     MOVEL'SDBANKPD'DBFILE            ************* 055365
     C                     Z-ADD14        DBASE             * DBERR 014 * 055365
     C                     MOVE '1'       *INU7             ************* 055365
     C                     MOVE '1'       *INU8                           055365
     C                     MOVE '1'       *INLR                           055365
     C                     EXSR *PSSR                                     055365
     C                     GOTO TZZ9                                      055365
     C                     END                                            055365
     C*                                                                   055365
     C                     END                                            055365
      *                                                                   S01270
     C                     SETON                       31                 S01270
     C*                                                                   055365
     C** If multibranching,                                               055365
     C*                                                                   055365
     C           MBIN      IFEQ 'Y'                                       055365
     C*                                                                   055365
     C** Turn-on printing of 'No details to report' on LE0691P1           055365
     C*                                                                   055365
     C                     MOVE '1'       *IN65                           055365
     C                     MOVE '1'       *IN36                           055365
     C                     MOVE '1'       *IN10                           055365
     C*                                                                   055365
     C***********          SETON                     103136               S01270
      ***OPEN*P1*SPOOL*FILE************                                   S01270
     C***********          OPEN LE0691P1                                  S01270
      ***********                                                         S01270
      ***IF*REPORT*FOR*ALL*ENTITIES*CALL*ZSFILE*WITH*BLANK*SENTY****      S01270
      *                                                                   052102
     C***********          OPEN LE0691P1                           052102 055365
     C*                                                                   055365
     C           BRNCH     IFEQ 'ALL'                      B1
     C***********MBIN      ORNE 'Y'                                       055365
     C*                                                                   055365
     C** For every branch in SDBRCHPD, write 'No details to report'       055365
     C*                                                                   055365
     C** Access first record.                                             055365
     C*                                                                   055365
     C**********           CALL 'AOBRCHR0'                                             055365 CGL029
     C                     CALL 'AOBRCHR1'                                                    CGL029
     C                     PARM '*MSG   ' @RTCD   7                       055365
     C                     PARM '*FIRST ' @OPTN   7                       055365
     C                     PARM BRCA      @DSNB   3                       055365
     C**********           PARM           SDBRCH                                       055365 CGL029
     C           SDBRCH    PARM SDBRCH    DSSDY                                               CGL029
     C*                                                                   055365
     C** If error,                                                        055365
     C*                                                                   055365
     C           @RTCD     IFNE *BLANKS                                   055365
     C                     MOVEL*BLANKS   DBKEY                           055365
     C                     MOVEL'SDBRCHPD'DBFILE           ***************055365
     C                     Z-ADD12        DBASE            * DBERROR 012 *055365
     C                     MOVEL@OPTN     DBOPTN  7        ***************055365
     C                     MOVE '1'       *INU7                           055365
     C                     MOVE '1'       *INU8                           055365
     C                     EXSR *PSSR                                     055365
     C                     GOTO TZZ9                                      055365
     C                     END                                            055365
     C*                                                                   055365
     C** While not eof/error                                              055365
     C*                                                                   055365
     C           @RTCD     DOWEQ*BLANKS                                   055365
     C           *INU7     ANDEQ'0'                                       055365
     C*                                                                   055365
     C** If okay, open LE0691P1.                                          055365
     C*                                                                   055365
     C                     OPEN LE0691P1                                  055365
     C                     Z-ADD0         PAGE                            055365
     C                     MOVE BRAA      BRCA                            055365
     C*                                                                   055365
     C** Ensure recording in RCF                                          055365
     C*
     C** ENSURE REPORT SPOOL FILE RECORDED BY RCF
     C**
     C                     Z-ADDSFNUM     ZSNUM   60
     C**
     C                     OUT  LDA
     C                     CALL 'ZSFILE'
     C                     PARM           SEQ
     C                     PARM *BLANKS   SENTY   3
     C***********          PARM           SFILE                           S01270
     C***********          PARM           SFILEU                   S01270 055365
     C                     PARM           SFILE                           055365
     C                     PARM           ZSNUM
     C                     PARM           ZSERR   1
     C           *LOCK     IN   LDA
      *
     C           ZSERR     IFEQ 'Y'
      **  ERROR DURING ZSFILE PROCESSING, RETURN TO CALLING PROGRAM
     C                     SETON                     U7U8LR
     C                     RETRN
     C                     END
     C*                                                                   055365
     C** Write 'No details to report.'                                    055365
     C*                                                                   055365
     C                     EXCPT                                          055365
     C*                                                                   055365
     C** Close, and process next branch.                                  055365
     C*                                                                   055365
     C                     CLOSELE0691P1                                  055365
     C*                                                                   055365
     C                     MOVE *BLANKS   BRCA                            055365
     C**********           CALL 'AOBRCHR0'                                             055365 CGL029
     C                     CALL 'AOBRCHR1'                                                    CGL029
     C                     PARM '*MSG   ' @RTCD   7                       055365
     C                     PARM '*NEXT  ' @OPTN   7                       055365
     C                     PARM BRCA      @DSNB   3                       055365
     C**********           PARM           SDBRCH                                       055365 CGL029
     C           SDBRCH    PARM SDBRCH    DSSDY                                               CGL029
     C*                                                                   055365
     C** If error,                                                        055365
     C*                                                                   055365
     C           @RTCD     IFNE *BLANKS                                   055365
     C           @RTCD     ANDNE'*EOF'                                    055365
     C                     MOVEL*BLANKS   DBKEY                           055365
     C                     MOVEL'SDBRCHPD'DBFILE           ***************055365
     C                     Z-ADD13        DBASE            * DBERROR 013 *055365
     C                     MOVEL@OPTN     DBOPTN  7        ***************055365
     C                     MOVE '1'       *INU7                           055365
     C                     MOVE '1'       *INU8                           055365
     C                     EXSR *PSSR                                     055365
     C                     GOTO TZZ9                                      055365
     C                     END                                            055365
     C*                                                                   055365
     C** End DoWhile                                                      055365
     C*                                                                   055365
     C                     END                                            055365
     C**
     C***********          MOVE 'ALL'     BRCA                            055365
     C***********          MOVE *BLANKS   BRNM                            055365
     C*                                                                   055365
     C** Else, If not *ALL                                                055365
     C*                                                                   055365
      *
      ** ELSE REPORT BY ENTITY SO CALL ZSFILE WITH ENTITY REQUESTED
     C                     ELSE                            X1
     C*                                                                   055365
     C** Open LE0691P1                                                    055365
     C*                                                                   055365
     C                     OPEN LE0691P1                                  055365
     C                     Z-ADD0         PAGE                            055365
      *
      ** ENSURE REPORT SPOOL FILE RECORDED BY RCF
     C**
     C                     Z-ADDSFNUM     ZSNUM   60
     C**
     C                     OUT  LDA
     C                     CALL 'ZSFILE'
     C                     PARM           SEQ
     C                     PARM BRNCH     SENTY   3
     C                     PARM           SFILE
     C                     PARM           ZSNUM
     C                     PARM           ZSERR   1
     C           *LOCK     IN   LDA
      *
     C           ZSERR     IFEQ 'Y'
      **  ERROR DURING ZSFILE PROCESSING, RETURN TO CALLING PROGRAM
     C                     SETON                     U7U8LR
     C                     RETRN
     C                     END
     C**
     C                     MOVE BRNCH     BRCA
      *
     C***AND*GET*ENTITY*DETAILS*FOR*REPORT*HEADINGS*WHEN*MULTIBRANCHING   055365
     C***********MBIN      IFEQ 'Y'                                       055365
     C*                                                                   055365
     C** And get entity details for report headings                       055365
      *
     C**********           CALL 'AOBRCHR0'                                                    CGL029
     C                     CALL 'AOBRCHR1'                                                    CGL029
     C                     PARM '*MSG   ' @RTCD   7
     C                     PARM '*KEY   ' @OPTN   7
     C                     PARM BRNCH     @DSNB   3
     C**********           PARM           SDBRCH                                              CGL029
     C           SDBRCH    PARM SDBRCH    DSSDY                                               CGL029
     C           @RTCD     IFNE *BLANKS
     C                     MOVEL@DSNB     DBKEY
     C                     MOVEL'SDBRCHPD'DBFILE           ***************
     C                     Z-ADD11        DBASE            * DBERROR 011 *
     C                     MOVEL@OPTN     DBOPTN  7        ***************
     C                     SETON                     U7U8
     C                     EXSR *PSSR
     C                     GOTO TZZ9
     C                     ELSE                                                               CSC042
      * Details found on the DB so add them to the array                                      CSC042
      * if the array still has room                                                           CSC042
     C                     EXSR ##ADDB                                                        CSC042
     C                     END
      *
     C***********          END                                            055365
     C*                                                                   055365
     C** Write 'No details to report'                                     055365
     C*                                                                   055365
     C                     EXCPT                                          055365
     C*                                                                   055365
     C** Close LE0691P1.                                                  055365
     C*                                                                   055365
     C                     CLOSELE0691P1                                  055365
      *
     C                     END                             E1
     C*                                                                   055365
     C** END If Multibranching                                            055365
     C*                                                                   055365
     C                     END                                            055365
      *
      ***OUTPUT*'NO*DETAILS*TO*REPORT'*IN*P1***********                   S01270
     C***OUTPUT*'NO*DETAILS*TO*REPORT'*IN*AUDIT*REPORT*************S01270 055365
     C**
     C           TZZ9      TAG
     C***********          EXCPT                                          055365
     C**
     C*                                                                   055365
     C** Turn-off indicators to avoid further printing in P1.             055365
     C*                                                                   055365
     C                     MOVE '0'       *IN65                           055365
     C                     MOVE '0'       *IN36                           055365
     C                     MOVE '0'       *IN10                           055365
     C                     MOVE '0'       *IN88                           055365
     C                     ENDSR
      *
      *****************************************************************
      /EJECT
      *****************************************************************
      /EJECT                                                                                  CSC042
     C********************************************************************                    CSC042
      *                                                                                       CSC042
      * ##CHKB - Subroutine to check the Branch in the arrays                                 CSC042
      *                                                                                       CSC042
     C           ##CHKB    BEGSR                                                              CSC042
      *                                                                                       CSC042
     C           *LIKE     DEFN BRAA      ##KB                                                CSC042
      *                                                                                       CSC042
      * Set off the branch found indicator                                                    CSC042
     C                     MOVEL*BLANK    ##FIC   1                                           CSC042
      *                                                                                       CSC042
      * Save the state of indicator 30 so it can be reset at the end                          CSC042
      * of the SR as it may be used elsewhere in the code                                     CSC042
     C           *IN30     IFEQ *ON                                                           CSC042
     C                     MOVEL'Y'       #IN30   1                                           CSC042
     C                     ELSE                                                               CSC042
     C                     MOVEL'N'       #IN30                                               CSC042
     C                     END                                                                CSC042
      *                                                                                       CSC042
     C                     SETOF                         30                                   CSC042
      *                                                                                       CSC042
      * Restore the saved Value of B                                                          CSC042
     C                     Z-ADD##BSV     B                                                   CSC042
      *                                                                                       CSC042
     C* Check whether details for Branch already in array                                     CSC042
      *                                                                                       CSC042
      * Is this the same as the last LOKUP, if so we can bypass                               CSC042
      * the LOKUP                                                                             CSC042
      * Defend against B being 0                                                              CSC042
     C           B         IFEQ 0                                                             CSC042
     C                     Z-ADD1         B                                                   CSC042
     C                     END                                                                CSC042
      *                                                                                       CSC042
      * If the branch being checked is the same then use these                                CSC042
      * details rather than doing a LOKUP                                                     CSC042
     C           ##KB      IFEQ ##BR,B                                                        CSC042
      * Found so seton 30                                                                     CSC042
     C                     SETON                         30                                   CSC042
     C                     ELSE                                                               CSC042
     C                     Z-ADD1         B                                                   CSC042
     C           ##KB      LOKUP##BR,B                   30                                   CSC042
     C                     END                                                                CSC042
      *                                                                                       CSC042
      * Save the last update to B                                                             CSC042
     C           *IN30     IFEQ *ON                                                           CSC042
     C                     Z-ADDB         ##BSV                                               CSC042
      * Set the indicator to show the data was found                                          CSC042
     C                     MOVEL'Y'       ##FIC                                               CSC042
     C                     END                                                                CSC042
      *                                                                                       CSC042
      * Reset the state of indicator 30.                                                      CSC042
     C           #IN30     IFEQ 'Y'                                                           CSC042
     C                     MOVEL*ON       *IN30                                               CSC042
     C                     ELSE                                                               CSC042
     C                     MOVEL*OFF      *IN30                                               CSC042
     C                     END                                                                CSC042
      *                                                                                       CSC042
     C                     ENDSR                                                              CSC042
      ********************************************************************                    CSC042
      /EJECT                                                                                  CSC042
      ********************************************************************                    CSC042
      *                                                                                       CSC042
      * ##SETB - Sets up the SDBRCHPD fields used in the code from the                        CSC042
      * arrays                                                                                CSC042
      *                                                                                       CSC042
     C           ##SETB    BEGSR                                                              CSC042
      *                                                                                       CSC042
     C                     MOVEL##BR,B    BRAA                                                CSC042
     C                     MOVEL##BN,B    BRNM                                                CSC042
      *                                                                                       CSC042
     C                     ENDSR                                                              CSC042
      *                                                                                       CSC042
      ********************************************************************                    CSC042
      /EJECT                                                                                  CSC042
      ********************************************************************                    CSC042
      *                                                                                       CSC042
      * ##ADDB - Adds the SDBRCHPD fields used in the code to the                             CSC042
      * arrays                                                                                CSC042
      *                                                                                       CSC042
     C           ##ADDB    BEGSR                                                              CSC042
      *                                                                                       CSC042
      * If there is still room in the array then add the details                              CSC042
     C           ##BNDX    IFLT 999                                                           CSC042
     C                     ADD  1         ##BNDX                                              CSC042
     C                     Z-ADD##BNDX    B                                                   CSC042
     C                     MOVELBRAA      ##BR,B                                              CSC042
     C                     MOVELBRNM      ##BN,B                                              CSC042
     C                     END                                                                CSC042
      *                                                                                       CSC042
      * Update ##BSV  so next call to ##CHKB checks this latest adddition                     CSC042
      * to the array firss                                                                    CSC042
     C                     Z-ADDB         ##BSV                                               CSC042
      *                                                                                       CSC042
     C                     ENDSR                                                              CSC042
     C/COPY WNCPYSRC,LEH01271
      ********************************************************************                    CSC042
      /EJECT                                                                                  CSC042
      ********************************************************************                    CSC042
      *                                                               *
      * *PSSR  --- SUBROUTINE TO HANDLE ABNORMAL ERROR CONDITIONS     *
      *                                                               *
      * CALLED FROM: AFTER ABNORNAL OPERATION OCCURS                  *
      *                                                               *
      * CALLS: NOTHING                                                *
      *                                                               *
      *****************************************************************
      *
     C           *PSSR     BEGSR                           ** *PSSR **
     C*
     C           @RUN      IFEQ *BLANKS
     C                     MOVE 'Y'       @RUN    1
     C                     DUMP
     C                     ELSE                                           S01270
     C*                                                                   S01270
     C** If *PSSR already called , then end the program here.             S01270
     C                     SETON                     U7U8LR               S01270
     C                     RETRN                                          S01270
     C                     END
     C*
     C                     ENDSR                           ** *PSSR **
      *
      *****************************************************************
     C/COPY ZSRSRC,ZDATE2Z4                                               S01392
     C********************************************************************S01392
      /EJECT
0583 O*
0584 O**  REPORT. MAIN HEADINGS
0585 OLE0691P1E  103   36 10
0586 O                                   24 'REFERENCE  LE0691P1'
0587 O                         TITL      89
0588 O                                  104 'DATE'
0589 O                         RUNA     113
0590 O                                  122 'PAGE'
0591 O                         PAGE  Z  128
0592 O        E 1      36 10
0595 O                                   65 'FINANCIAL LOANS DIARY'
0596 O                                   69 'FOR'
0597 O                         EVDAT     77
0593 O                 88                87 'BRANCH'
0594 O                 88      BRCA      92
     O                 88                93 '-'
     O                 88      BRNM     123
0598 O        E 1      36 10
0599 O                                   68 '------------------------'
0600 O                                   77 '---------'
0601 O        E 11     36 10
      *                                                                   S01408
     O/COPY WNCPYSRC,LE0691OOP2                                           S01408
      *                                                                   S01408
0602 O                                   17 'A/C OFFICER'
0603 O****************         ACOC      21                               E28771
     O                N31      ACON      49                               E28771
      *                                                                   S01408
     O/COPY WNCPYSRC,LE0691OOP1                                           S01408
      *                                                                   S01408
0604 O********E*1******36*10**                                            S01339
0605 O************************           49 'CMMT  D/D'                   S01339
0606 O        E 1      36 10
0607 O                                    9 'BORROWER'
     O                 29                10 '/'                                               CGL014
0608 O************************           44 'FCLT/CMMT  LOAN   FCLT'      S01339
0608 O***********                        44 'FCLT       LOAN   FCLTS01339 CLE004
     O                N28                44 'FCLT       LOAN   FCLT'      CLE004
     O**********       28                19 'FCLT'                                     CLE004 CGL014
     O**********       28                30 'LOAN'                                     CLE004 CGL014
     O**********       28                42 'FCLT EVENT'                               CLE004 CGL014
     O                 28                23 'FCLT'                                            CGL014
     O                 28                34 'LOAN'                                            CGL014
     O                 28                46 'FCLT EVENT'                                      CGL014
     O*                                                                   S01408
     O/COPY WNCPYSRC,LE0691OPG1                                           S01408
     O*                                                                   S01408
0609 O***********************************49 'LOAN'                        101841
     O***********                        50 'EVENT'                101841 CLE004
A    O                N28                50 'EVENT'                       CLE004
     O                 32                53 'IN/'                                             244589
0610 O***********************            77 'AMOUNT     RATE FIX'         S01339
0610 O**********                         77 'AMOUNT             '                      S01339 CGL014
0611 O************************           90 'LOAN   FREQ'                 S01339
0611 O**********                         90 '       FREQ'                              S01339 CGL014
     O                N29                77 'AMOUNT             '                             CGL014
     O                 29                65 'AMOUNT/'                                         CGL014
     O                                   88 'FREQ'                                            CGL014
0612 O                                  103 'REPAYMENT'
     O/COPY WNCPYSRC,LE0691O001
0613 O                                  121 'INTEREST'
0614 O**********                        132 'NON'                                             CLE154
     O                                  127 'NON'                                             CLE154
     O                 58 59            132 'REP'                                             CLE154
0615 O        E 1      36 10
0616 O************************           44 'LOAN/DD   TYP/SUB  CCY'      S01339
0616 O***********                        44 'LOAN      TYP/SUB  CCYS01339 CLE004
     O                N28                44 'LOAN      TYP/SUB  CCY'      CLE004
     O**********       28                19 'LOAN'                                     CLE004 CGL014
     O**********       28                31 'TYP/SUB'                                  CLE004 CGL014
     O**********       28                38 'CCY'                                      CLE004 CGL014
     O                 28                23 'LOAN'                                            CGL014
     O                 29                24 '/'                                               CGL014
     O                 28                35 'TYP/SUB'                                         CGL014
     O                 28                42 'CCY'                                             CGL014
     O                 32                53 'OUT'                                             244589
     O*                                                                   S01408
     O/COPY WNCPYSRC,LE0691OPG2                                           S01408
     O*                                                                   S01408
0617 O***********                        49 'CCY'                         CLE004
     O                N28                49 'CCY'                         CLE004
0618 O************************           85 'DATE   MANAGER'              S01339
0619 O                                  100 'DUE'
     O                 29               101 '/'                                               CGL014
0620 O                                  119 'DUE'
     O                 29               120 '/'                                               CGL014
0621 O**********                        132 'AUTO'                                            CGL014
     O**********                        131 'AUTO'                                     CGL014 CLE154
     O**********       29               132 '/'                                        CGL014 CLE154
     O                                  127 'AUTO'                                            CLE154
     O                 29               128 '/'                                               CLE154
     O                 58 59            132 'TYPE'                                            CLE154
      *                                                                                       CGL014
     O********E*1      36 29                                                          CGL014 BUG8219
     O        E 1      36 10 29                                                              BUG8219
     O                                   11 'COLLATERAL'                                      CGL014
     O                                   24 'COLL.'                                           CGL014
     O                                   35 'COLL.'                                           CGL014
     O                                   46 'COLLATERAL'                                      CGL014
     O                                   68 'COLLATERAL'                                      CGL014
     O                                  104 'COLLATERAL'                                      CGL014
     O                                  118 'LEVEL'                                           CGL014
     O                                  132 'ALLOC'                                           CGL014
      *                                                                                       CGL014
     O********E*1      36 29                                                          CGL014 BUG8219
     O        E 1      36 10 29                                                              BUG8219
     O                                    9 'CUSTOMER'                                        CGL014
     O                                   23 'REF.'                                            CGL014
     O                                   34 'TYPE'                                            CGL014
     O                                   47 'DESCRIPTION'                                     CGL014
     O                                   64 'AMOUNT'                                          CGL014
     O                                  107 'LENDING VALUE'                                   CGL014
     O*                                                                   055365
     O** No details to report                                             055365
     O*                                                                   055365
     O        E 3      36 10 65                                           055365
     O                                   63 '***   No Details To Repo'    055365
     O                                   71 'rt   ***'                    055365
0622 O*
0623 O**  EVENT TYPE HEADINGS
0624 O        E 3      L1 10 20
     O       AND      N31
0625 O                                   13 'EVENT TYPE -'
0626 O*************************ENAR,Z    26                                 0045
     O**********               ENAR,Z    31                                 0045              CGL014
     O                         ENAR,Z    40                                                   CGL014
     O*
0627 O        E 1      L1 10 20
     O       AND      N31
0628 O                                   14 '-------------'
0629 O*************************UDL,Z     26                                 0045
     O**********               UDL,Z     31                                 0045              CGL014
     O                         UDL,Z     40                                                   CGL014
0630 O*
0631 O** DETAIL RECORD OUTPUT
0632 O        D 2      02 10
0633 O                         CPNM      21
0634 O***************     21   FDETS     35 '      /   /  '               S01339
0634 O*************************FDETS*****35 '      /   /  '        S01339 100522
     O                         FDETS     35 '0      /   /  '              100522
     O                         FCNO      28                                                   CSD027
     O/COPY WNCPYSRC,LEH00848
     O                 30      DESC      66                                                   CGL014
     O/COPY WNCPYSRC,LEH00849
     O                 30      LEVEL    117                                                   CGL014
     O                 30      WGNSP    132                                                   CGL014
0635 O***************    N21   CFREF     28                               S01339
     O/COPY WNCPYSRC,LEH00850
     O                 25                40 'SEQ '                        BH3493
     O                 25      WOSEQ     43                               BH3493
     O                 25                52 'FEE CODE'                    100373
     O                 25      WOFEC     55                               100373
     O/COPY WNCPYSRC,LEH00851
0636 O        D 1      02 10
0637 O                         CTWN      11
0638 O***********              BWCN      21                               CLE004
0639 O***********              LDREF     28                               CLE004
     O                N28      BWCN      21                               CLE004
     O                N28      LDREF     28                               CLE004
     O                 28      BWCN      18                               CLE004
     O**********       28      LDREF     25                                            CLE004 CGL014
     O                 28N30   LDREF     25                                                   CGL014
     O                    30   CREF      29                                                   CGL014
     O*                                                                   S01408
     O/COPY WNCPYSRC,LE0691OPG3                                           S01408
     O*                                                                   S01408
0640 O***********              LTYP      35                               CLE004
0641 O***********                        36 '-'                           CLE004
0642 O***********              SUTP      38                               CLE004
0643 O***************    N21             38 'SYN.L'                       S01339
0644 O***********              CMCY      44                               CLE004
0645 O***********              DDCY      49                               CLE004
     O                N28      LTYP      35                               CLE004
     O                N28                36 '-'                           CLE004
     O                N28      SUTP      38                               CLE004
     O                N28      CLAS      42                                                   CLE042
     O                N28      CMCY      46                                                   CLE042
     O                N28      DDCY      50                                                   CLE042
     O**********      N28      CMCY      44                                            CLE004 CLE042
     O**********      N28      DDCY      49                                            CLE004 CLE042
     O**********       28      LTYP      28                                            CLE004 CGL014
     O**********       28                29 '-'                                        CLE004 CGL014
     O**********       28      SUTP      31                                            CLE004 CGL014
     O**********       28      CMCY      35                                            CLE004 CGL014
     O**********       28      DDCY      39                                            CLE004 CGL014
     O**********       28      WGASI     50                                            CLE004 CGL014
0646 O**********          50   AMNT      67 ' ,   ,   ,   , 0 '                               CGL014
0647 O**********          51   AMNT      67 '   ,   ,   , 0 . '                               CGL014
0648 O**********          52   AMNT      67 '  ,   ,   , 0 .  '                               CGL014
0649 O**********          53   AMNT      67 ' ,   ,   , 0 .   '                               CGL014
0650 O**********             40          68 '-'                                               CGL014
0651 O**************     N21   RFDAT     76                               S01339
0652 O**************     N21   AGNT      85                               S01339
     O**********          25 24          86 'ESTIMATED AVERAGE'                        100522 CGL014
0653 O**********               EVNF      89                                                   CGL014
0654 O**********         N25 50RPYA     107 ' ,   ,   ,   , 0 '                               CGL014
0655 O**********         N25 51RPYA     107 '   ,   ,   , 0 . '                               CGL014
0656 O**********         N25 52RPYA     107 '  ,   ,   , 0 .  '                               CGL014
0657 O**********         N25 53RPYA     107 ' ,   ,   , 0 .   '                               CGL014
0658 O**********         N25 41         108 '-'                                               CGL014
0659 O***************     25 24         107 'COMMITMENT FEE'              S01270
0660 O***************  25N24 26         119 '* FEE CODE NOT ON FILE *'    S01270
0661 O***************  25N24N26OFCD      92                               S01270
0662 O***************  25N24N26NL20     113                               S01270
0663 O**********         N25 50INTA     125 ' ,   ,   ,   , 0 '                               CGL014
0664 O**********         N25 51INTA     125 '   ,   ,   , 0 . '                               CGL014
0665 O**********         N25 52INTA     125 '  ,   ,   , 0 .  '                               CGL014
0666 O**********         N25 53INTA     125 ' ,   ,   , 0 .   '                               CGL014
0667 O**********         N25 42         126 '-'                                               CGL014
     O                 28N30   LTYP      32                                                   CGL014
     O                 28N30             33 '-'                                               CGL014
     O                 28N30   SUTP      35                                                   CGL014
     O                 28N30   CLAS      39                                                   CLE042
     O                 30      COLT      35                                                   CGL014
     O                 28      CMCY      43                                                   CLE042
     O                 28      DDCY      47                                                   CLE042
     O**********       28      CMCY      39                                            CGL014 CLE042
     O**********       28      DDCY      43                                            CGL014 CLE042
     O                 32      WINOI     52                                                   244589
     O                 28      WGASI     54                                                   CGL014
     O                    50   AMNT      71 ' ,   ,   ,   , 0 '                               CGL014
     O                    51   AMNT      71 '   ,   ,   , 0 . '                               CGL014
     O                    52   AMNT      71 '  ,   ,   , 0 .  '                               CGL014
     O                    53   AMNT      71 ' ,   ,   , 0 .   '                               CGL014
     O                       40          72 '-'                                               CGL014
     O                    25 24          84 'ESTIM. AVE.'                                     CGL014
     O                         EVNF      86                                                   CGL014
0654 O**********      N30N25 50RPYA     107 ' ,   ,   ,   , 0 '                        CGL014 CLE154
0655 O**********      N30N25 51RPYA     107 '   ,   ,   , 0 . '                        CGL014 CLE154
0656 O**********      N30N25 52RPYA     107 '  ,   ,   , 0 .  '                        CGL014 CLE154
0657 O**********      N30N25 53RPYA     107 ' ,   ,   , 0 .   '                        CGL014 CLE154
0658 O**********      N30N25 41         108 '-'                                        CGL014 CLE154
0654 O**********       30 50   LAMT     107 '   ,   ,   ,   , 0 '                      CGL014 CLE154
0655 O**********       30 51   LAMT     107 '  ,   ,   ,   , 0 . '                     CGL014 CLE154
0656 O**********       30 52   LAMT     107 ' ,   ,   ,   , 0 .  '                     CGL014 CLE154
0657 O**********       30 53   LAMT     107 '   ,   ,   , 0 .   '                      CGL014 CLE154
0658 O**********       30 44            108 '-'                                        CGL014 CLE154
     O**********       29      ENTT     111                                            237251 CLE154
0663 O**********      N29N25 50INTA     125 ' ,   ,   ,   , 0 '                       CGL014 BUG8477
0664 O**********      N29N25 51INTA     125 '   ,   ,   , 0 . '                       CGL014 BUG8477
0665 O**********      N29N25 52INTA     125 '  ,   ,   , 0 .  '                       CGL014 BUG8477
0666 O**********      N29N25 53INTA     125 ' ,   ,   , 0 .   '                       CGL014 BUG8477
0667 O**********      N29N25 42         126 '-'                                       CGL014 BUG8477
0663 O**********         N25 50INTA     125 ' ,   ,   ,   , 0 '                       BUG8477 CLE154
0664 O**********         N25 51INTA     125 '   ,   ,   , 0 . '                       BUG8477 CLE154
0665 O**********         N25 52INTA     125 '  ,   ,   , 0 .  '                       BUG8477 CLE154
0666 O**********         N25 53INTA     125 ' ,   ,   , 0 .   '                       BUG8477 CLE154
0667 O**********         N25 42         126 '-'                                       BUG8477 CLE154
     O                N30N25 50RPYA     103 ' ,   ,   ,   , 0 '                               CLE154
     O                N30N25 51RPYA     103 '   ,   ,   , 0 . '                               CLE154
     O                N30N25 52RPYA     103 '  ,   ,   , 0 .  '                               CLE154
     O                N30N25 53RPYA     103 ' ,   ,   , 0 .   '                               CLE154
     O                N30N25 41         104 '-'                                               CLE154
     O                 30 50   LAMT     103 '   ,   ,   ,   , 0 '                             CLE154
     O                 30 51   LAMT     103 '  ,   ,   ,   , 0 . '                            CLE154
     O                 30 52   LAMT     103 ' ,   ,   ,   , 0 .  '                            CLE154
     O                 30 53   LAMT     103 '   ,   ,   , 0 .   '                             CLE154
     O                 30 44            104 '-'                                               CLE154
     O                 29      ENTT     107                                                   CLE154
     O                   N25 50INTA     121 ' ,   ,   ,   , 0 '                               CLE154
     O                   N25 51INTA     121 '   ,   ,   , 0 . '                               CLE154
     O                   N25 52INTA     121 '  ,   ,   , 0 .  '                               CLE154
     O                   N25 53INTA     121 ' ,   ,   , 0 .   '                               CLE154
     O                   N25 42         122 '-'                                               CLE154
0667 O**********       29      ENTT     116                                            CGL014 237251
0668 O**********          38            129 'W/T'                                             CLE154
0669 O**********         N39            132 'NA'                                              CLE154
     O                    38            125 'W/T'                                             CLE154
     O                   N39            128 'NA'                                              CLE154
     O                 58 59   REPT     132                                                   CLE154
0670 O*
0671 O**  TRAILER OUTPUT
0675 O*
0676 O**  DATA BASE ERRORS
0677 O        T 3      U7 U8 10
0678 O                                   22 '*** REFERENCE'
0679 O                         DBPGM     34
0680 O                                   54 'DATABASE ERROR AT'
     O                         DBASE     58
0677 O        T 3      U7 U8 10
0678 O                                   17 'FILENAME'
0679 O                         DBFILE    26
0680 O                                   30 'KEY'
     O                         DBKEY     60
     O********T*32*****31NU7                                              S01270
     O*****************                  63 '***   NO DETAILS TO REPO'    S01270
     O*****************                  71 'RT   ***'                    S01270
0687 O        T 3      10 L4NU7
     O       AND       88
     O       OR        LRN88 10
     O                 88                66 '*** END OF REPORT FOR'
0688 O                 88                74 ' BRANCH '
     O                 88      BRCA      77
     O                 88                83 '   ***'
     O                N88                76 '*** END OF REPORT ***'
0689 O*
0690 O**  CONTROL PRINT
0691 OLE0691AUT  103   LR
0692 O                                   24 'REFERENCE LE0691AU'
0693 O                         TITL      89
0694 O                                  104 'DATE'
0695 O                         RUNA     112
0696 O                                  122 'PAGE'
0697 O                         PAGE1 Z  127
0698 O        T 1      LR
0699 O                                   55 '        FINANCIAL L'
0700 O                                   68 'OANS DIARY - '
0701 O                                   89 'FILE CONTROLS        '
0702 O        T 13     LR
0703 O                                   55 '        -----------'
0704 O                                   68 '-------------'
0705 O                                   89 '-------------        '
0706 O        T 1      LR
0707 O*******************                28 'S/LDEVS - RUN CONTROLS'      S01339
0707 O                                   28 'S/LVEDS - RUN CONTROLS'      S01339
0708 O                                   59 'NUMBER'
0709 O                                   84 'VALUE'
0710 O        T 12     LR
0711 O                                   28 '----------------------'
0712 O                                   59 'OF RECORDS'
0713 O                                   84 'OF RECORDS'
0714 O        T 11     LR
0715 O                                   29 'TOTAL RECORDS ON FILE'
0716 O                      NU7NORE  3   59
0717 O                      NU7HRWN  Z   81
0718 O                      NU7HRDC      84
0719 O        T 11     LR
0720 O                                   29 'TOTAL RECORDS ON FILE'
0721 O                                   42 '- CALCULATED'
0722 O                         RECTOT3   59
0723 O                         ZZTOTIZ   81
0724 O                         ZZTOTD    84
0725 O                 70               111 '***   DIFFERENCE   ***'
0677 O        T 3      U7 U8 LR
0678 O                                   22 '*** REFERENCE'
0679 O                         DBPGM     34
0680 O                                   54 'DATABASE ERROR AT'
0681 O                         DBASE     58
0682 O        T 1      U7 U8 LR
0683 O                                   17 'FILE NAME'
0684 O                         DBFILE    26
0685 O                                   30 'KEY'
0686 O                         DBKEY     60
     O        T 32     LRNU7 31
     O                                   63 '***   NO DETAILS TO REPO'
     O                                   71 'RT   ***'
      /EJECT
**   ZYDY - YEARS IN DAYS CUMULATIVE IN FOUR YEAR SPAN
0366073110961461
**   ZMDY - MONTHS IN DAYS CUMULATIVE THROUGH YEAR
000031059090120151181212243273304334365
**   ZMNM  -  MONTHS SHORTNAMES
JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC
** ETYP - EVENT CODES
BDFGHJLK                                                                                      CLE028
** N - NUMERIC FOR EVENT CODES
12345679                                                                                      CLE028
** ENAR - EVENT NARRATIVES
START
MATURITY
ROLLOVER
PRIN.INCR.
INTEREST DUE
REPAYMENT
FACILITY FEES DUE                                                         S01270
LOAN FEES DUE                                                             S01270
CHARGES DUE                                                                                   CLE028
COLLATERAL START                                                                              CGL014
COLLATERAL MATURITY                                                                           CGL014
COLLATERAL RENEWAL DUE                                                                        CGL014
COLLATERAL REVALUATION DUE                                                                    CGL014
** UDL  - UNDERLINES FOR NARRATIVES
-----
--------
--------
----------
------------
---------
-----------------                                                         S01270
-------------                                                             S01270
-----------                                                                                   CLE028
----------------                                                                              CGL014
-------------------                                                                           CGL014
----------------------                                                                        CGL014
--------------------------                                                                    CGL014
**   CPY@   ** OBJECT COPYRIGHT
(c) Misys International Banking Systems Ltd. 2001
** AASS   - Assignment details                                            CLE004
ASSIGNMENT                                                                CLE004
TRANSFER                                                                  CLE004
MCCY ROLL                                                                              CLE004 193701
