0001 H        1                                                           S01117
      *****************************************************************
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas LE Commit, faclty and loan detls extract')       *
0001 H**********                                                          S01117
0002 F*****************************************************************
0003 F*                                                               *
     F*  Midas - Customer Lending Module
0005 F*                                                               *
0006 F*  LE0700 - COMMT/FAC. & LOAN DETAILS EXTRACT                   *
0007 F*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
0009 F*                                                               *
      *  Last Amend No. 259872             Date 02Feb15               *
      *  Prev Amend No. MD029793           Date 25Nov14               *
      *                 AR989943A          Date 23Nov12               *
      *                 AR989943           Date 23Nov12               *
      *                 CLE134             Date 01Aug12               *
      *                 CLE148             Date 23Jul12               *
      *                 AR787620           Date 10Jun11               *
      *                 AR677799           Date 22Dec10               *
      *                 259282             Date 03Nov10               *
      *                 CER059             Date 19Jul10               *
      *                 CER020             Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      *                 CSC042             Date 16Feb09               *
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *                 248383             Date 08Jun07               *
      * Midas Plus 1.4 Base ------------------------------------------*
      *                 244459             Date 14Dec06               *
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD031             Date 10Apr06               *
      *                 CLE059             Date 12Jul06               *
      *                 CSD027             Date 09Dec05               *
      *                 CLE042             Date 06Sep05               *
      *                 CSW037A            Date 02May05               *
      *                 CSD025             Date 11Jan05               *
      *                 CSW037             Date 15Dec04               *
      *                 CSW036             Date 15Dec04               *
      *                 CLE025             Date 20Oct03               *
      *                 CGL029             Date 01Sep03               *
      *                 CAS006             Date 21Jan03               *
      *                 CAS005             Date 16Dec02               *
      * Midas Release 4.01.03 ----------------------------------------*
      *                 190571             Date 13Jan03               *
      * Midas Release 4.01 -------------------------------------------*
      *                 193603             Date 31Aug01               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *                 CLE011             Date 07Nov00               *
      *                 184606             Date 12Dec00               *
      * Midas DBA 3.03 -----------------------------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 101182             Date 10Mar98               *
     F*                 CLE005             DATE 22MAY97               *
     F*                 CLE004             DATE 02DEC96               *
     F*                 S01408             DATE 10MAR95               *
     F*                 E43518             DATE 11JAN93               *
     F*                 S01339             DATE 06APR92               *
     F*                 S01270             DATE 21MAR91               *
     F*                 S01220             DATE 15MAR91               *
0009 F*                 BHF128             DATE 26JUL90               *
0009 F*                 S01194             DATE 24/01/90              *
0009 F*                 S01117             DATE 18/07/89              *
0009 F*                                                               *
0009 F*---------------------------------------------------------------*
     F*                                                               *
      *  259872 - Facility availability incorrectly reported in       *
      *           LE720P1. Applied fix 258006 to use OAM2 instead of  *
      *           OAM1.                                               *     
      *  MD029793 - Missing some linked live loans and available      *
      *             amount of a multi-ccy facility on some days are   *
      *             wrong                                             *
      *           - change the location of PTFC, PTFT and PTFN field &*
      *             correct formula of available amount is FAMT-OAM1  *
      *  AR989943A - Current outstanding amount is wrong              *
      *             (Child:AR990609)                                  *
      *  AR989943 - Current outstanding amount is wrong               *
      *             (Child:AR990609)                                  *
      *  CLE134 - Past Due Call Loan Processing                       *
      *  CLE148 - Alpha Loan Reference                                *
      *  AR787620 - Hooks Incorporation                               *
      *             WNCPYSRC,LEH00170                                 *
      *  AR677799 - Report LE0710 Facilities and Commitment Details by*
      *             Customer/Parent Erroneous Customer Lending Value  *
      *             data  (Child: AR677800)                           *
      *  259282 - Initialise the facility branch to the branch in the *
      *           MFU record. Use MOVEL when passing value from CNUMM *
      *           to KEYC. Also, change to FCLTYL1 in order to        *
      *           properly retrieve CRSK from file; and correct       *
      *           definition of OVPC.                                 *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER020 - Enhanced Rollover Window: Upgrade FGE089 to         *
      *           Midas Plus                                          *
      *  CSC042 - COB Performance fix.                                *
      *           Reduce number of AOBRCHR* pgm calls. RZB sofia calls*
      *           AO pgm 220K times for 205 records                   *
      *  248383 - Apply fix 220263.                                   *
      *  220263 - Current outstanding includes the amount sold.       *
      *  244459 - Facility and Availablity Report not showing         *
      *           syndications correctly                              *
      *  CSD031 - Enhanced Centralised Static Data (Recompile)        *
      *  CLE059 - Commitment and Facility Availability by Cust report *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CLE042 - Extended Loan Sub Type                              *
      *  CSW037A- Additional Field extended to 40 chars (recompile)   *
      *  CSD025 - Customer De-Activation                              *
      *  CSW037 - Additional Field Data on MT300/MT320                *
      *  CSW036 - Dual SWIFT BIC held on Client Details               *
      *  CLE025 - Credit Lines (Recompile)                            *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CAS006 - Hedge Accounting Phase B (Recompile)                *
      *  CAS005 - Enahancements to CAS001, CAS002 and CAS004          *
      *           (Recompile)                                         *
      *  190571 - Correct hash totalling to use absolute value (not   *
      *           negative amounts). MFUs should appear on LE0720P1.  *
      *  193603 - Negative amount not hash totalled correctly         *
      *  CLE011 - Rate Fixing Days for Lending Rollover Processing    *
     F*  184606 - Exclude expired facilities with no live loans.      *
     F*  101182 - Country of Domicile on the report is from the loan  *
     F*           customer although the customer on the report is the *
     F*           facility customer. Fix 043518 incorrectly changed   *
     F*           processing to use the loan customer - remove this   *
     F*           change.                                             *
     F*  CLE005 - Customer Lending Enhancements - Others (T3)         *
     F*  CLE004 - Customer Lending Enhancements - Syndications        *
     F*  S01408 - Addition of core hooks  LE0700FFPG                  *
     F*                                   LE0700CCPG                  *
     F*                                   LE0700OOPG                  *
     F*  E43518 - Report shows incorrect country of domicile for      *
     F*           loans whose facility customer no. and loan cust no. *
     F*           are different with different country of domicile.   *
     F*  S01339 - Remove syndicated loans processing, due to module   *
     F*           redundancy.                                         *
     F*  S01270 - Customer lending amendments.                        *
     F*  S01220 - Amended for Strategic Risk Management.              *
     F*           Release 10 to allow the input of a book code        *
     F*           against a loan.                                     *
0009 F*  BHF128 - Correction of parm statement.                       *
0009 F*  S01194 - New standing data changes.                          *
0009 F*  S01117 - Multibranching.                                     *
0009 F*                                                               *
0012 F*****************************************************************
     F*  C R E A T I O N     P A R A M E T E R S                      *
     F*                                                               *
     F*                                                               *
     F*****************************************************************
0013 F*CLOAN***IP**F*****400  7AI     2 DISK                              S01220
0013 F***CLOAN***IP  F     436  7AI     2 DISK                     S01220 CLE004
0014 F***FCLTY***IS  F     256 12AI     2 DISK                            CLE004
      *                                                                   CLE004
     F*CLOAN***IP**F    1275  7AI     2 DISK                       CLE004 CLE011
     F***CLOAN** IP  F    1310  7AI     2 DISK                                         CLE011 CGL029
     F*CLOAN***IP**F****1461  7AI     2 DISK                                           CGL029 CLE042
     F***CLOAN** IP  F    1773  7AI     2 DISK                                         CLE042 CER020
     F***CLOAN** IP  F    1782  7AI     2 DISK                                         CER020 CLE134
     FCLOAN   IP  F    1874  7AI     2 DISK                                                   CLE134
     F***FCLTY** IS  F     401 12AI     2 DISK                                         CLE004 CGL029
     FFCLTY   IS  F    1217 12AI     2 DISK                                                   CGL029
      *                                                                   CLE004
0015 F***LOANS***IS**F*****400 13AI     2 DISK                         U1 S01339
0016 F*CLINT***IF**F*****256**7AI*****2*DISK*******                       S01194
0017 F*TABLE***IF**F******96*12AI*****2*DISK*******                       S01194
     FCLOANFL1IF  E           K        DISK                               184606
     F            CLOANCLF                          KRENAMECLOANFLF       184606
     FLEMNFUL0IF  E           K        DISK         KINFSR *PSSR                              190571
     FLEMNFUZZIF  E           K        DISK         KINFSR *PSSR                              190571
     F***FCLTYL0 IF  E           K        DISK         KINFSR *PSSR                    190571 259282
     FFCLTYL1 IF  E           K        DISK         KINFSR *PSSR                              259282
     FFACEXHH O   F      80            DISK
     F*FACEXFA*O***F******80            DISK                                                  CLE042
     F***FACEXFA*O   F      84            DISK                                         CLE042 244459
     FFACEXFA O   F     100            DISK                                                   244459
     F*ACEXFC O   F      80            DISK                               S01117
      *                                                                   CLE004
     F***FACEXFC*O   F      83            DISK                     S01117 CLE004
     FFACEXFC O   F     100            DISK                               CLE004
      *                                                                   CLE004
     FFACEXT4 O   F      80            DISK
     FFACEXHHAO   F      80            DISK                           UC  CLE059
     FFACEXFCAO   F     104            DISK                           UC  CLE059
     FFACEXFAAO   F     104            DISK                           UC  CLE059
     FFACEXT4AO   F      80            DISK                           UC  CLE059
     F*                                                                   S01408
     F/COPY WNCPYSRC,LE0700FFPG                                           S01408
     F*                                                                   S01408
0019 F*E0700P1O** F     132            PRINTER                  S01124    S01117
0019 FLE0700AUO   F     132            PRINTER                            S01117
0020 F* ID F  C  H  L    FUNCTION OF INDICATORS
0021 F* 01            S/CLOAN - HEADER RECORD
0022 F* 02                    - DETAIL RECORD 1 -LIVE/MATURED
0023 F* 03                    - DETAIL RECORD 2 - LIVE
0024 F* 04                    - TRAILER RECORD
0025 F* 05                    - ASTERISKED RECORD
0026 F* 06            S/FCLTY - DETAIL RECORD 1 -LIVE/EXPIRED
0027 F* 07                    -   ''     ''   2 -   ''   ''
0028 F* 08                    - TRAILER RECORD
0029 F* 09                    - ASTERISKED RECORD
0030 F**10************S/LOANS*-*COMMITMENT*DETAIL*RECORD***************   S01339
0031 F**11********************-*DRAWDOWN*DETAIL*RECORD*****************   S01339
0032 F**12********************-*MATURED*COMMITMENT*********************   S01339
0033 F**13********************-*MATURED*DRAWDOWN***********************   S01339
0034 F**14********************-*COMMITMENT*TRAILER*RECORD**************   S01339
0035 F**15********************-*DRAWDOWN*TRAILER*RECORD****************   S01339
0036 F* 20            S/CLINT - DETAIL RECORD
     F*       30      OUR AMOUNTS ZERO - USE TOTALS
0037 F*       40      CONDITIONS FIRST CYCLE PROCESSING
0038 F*       41      GENERAL PURPOSE
0039 F********42******S/LOANS*PROCESSING*******************************   S01339
0040 F*       43      S/FCLTY PROCESSING
     F*       44      LEMNFUL0 PROCESSING                                                     190571
0041 F********50******CHAIN FAIL                                          S01194
0042 F*       60      OUTPUT FAC/CMMT TYPE RECORD
0043 F*       61        ''   LOAN      ''    ''
0044 F*       62      FILE OUT OF BALANCE - S/CLOAN
0045 F*       63                          - S/FCLTY
     F*       64                          - S/LEMNFUPD                                        190571
0046 F********64**************************-*S/LOANS*-*COMMITMENTS******   S01339
0047 F********65************************************-*DRAWDOWNS********   S01339
0048 F*       66      S/CLOAN - PART. SOLD
     F*   67  - CLE004 is switched *ON                                *   CLE004
     F*   68  - Participant Facility Details are not blanks.          *   CLE004
     F**************U1COMM.*LOANS*-*LOANS*FILE*IS*PRESENT**************   S01339
0049 F*             U7STANDARD MIDAS USAGE
0050 F*             U8STANDARD MIDAS USAGE
     E                    CPY@    1   1 80
     E                    ##BR      999  3               Branch codes                         CSC042
     E                    ##BC      999  3               Company codes                        CSC042
0051 I*
0052 I*    CUSTOMER LENDING LOANS FILE - HEADER RECORD
0053 I*
0054 ICLOAN   NS  01   1 CH
0055 I*
0056 I*    CUSTOMER LENDING LOANS FILE - DETAIL RECORD 1
0057 I*
0058 I        NS  02   1 CD   8 CA
0059 I       OR        1 CM   8 CA
0060 I                                        1   1 RECI
0061 I**********                              2   70LNRF                                      CLE148
     I                                        2   7 LNRF                                      CLE148
0062 I                                        8   8 RCDT
0063 I                                        9   90MRIN
0064 I                                       10  110PTYP
0065 I**********                             12  170CNUM                                      CSD027
0065 I                                       12  17 CNUM                                      CSD027
0066 I*************                          18  200BRCD                  S01117
0066 I                                       18  20 BRCA                  S01117
0067 I                                       21  22 LTYP
0068 I                                       23  24 SUTP
0069 I                                    P  25  270DDAT
0070 I                                    P  28  300VDAT
0071 I                                    P  31  330MDAT
0072 I                                       34  350LASQ
0073 I**********                             36  410FCUS                                      CSD027
0073 I                                       36  41 FCUS                                      CSD027
0074 I                                       42  440FTYP
0075 I                                       45  460FSEQ
0076 I                                       47  49 CCY
0077 I                                    P  50  560CPAM
0078 I                                       57  57 INTC
0079 I                                    P  58  637INTR
0080 I                                       64  650BRTT
0081 I                                    P  66  717BRTE
0082 I                                    P  72  777RTSP
0083 I                                    P  78  815MARG
0084 I                                       82  82 SPIN
0085 I                                       83  83 CHIN
0086 I                                    P  84  897WTRT
0087 I                                       90  90 WTIN
0088 I                                       91  910REPT
0089 I                                    P  92  980RAMT
0090 I                                    P  99 1010NRPD
0091 I                                      102 102 RFRQ
0092 I                                      103 1040RDYN
0093 I                                      105 107 FCCY
0094 I                                      108 1100LIND
0095 I                                      111 112 CRSK
0096 I                                      113 114 ACOF
0097 I                                      115 115 NACD
0098 I                                      116 116 RELI
0099 I                                      117 117 AUTO
0100 I                                    P 118 1240PSAM
0101 I                                    P 125 1318BCXR
0102 I                                    P 132 1388FCXR
0103 I                                      139 1400SDST
0104 I**********                            141 152 OSDA                                      CGL029
     I                                      141 152 OSDAQQ                                    CGL029
0105 I                                      153 162 TSTN
0106 I                                      163 1640MDST
0107 I**********                            165 176 OMDA                                      CGL029
     I                                      165 176 OMDAQQ                                    CGL029
0108 I                                      177 186 TMAN
0109 I                                      187 196 FACO
0110 I                                    P 197 1990RLDT
0111 I                                    P 200 2020NROD
0112 I                                      203 203 RLFQ
0113 I                                      204 2050RLDY
0114 I                                      207 2080NBRA
0115 I                                    P 209 2147NRTS
0116 I                                      215 215 NSIN
0117 I                                      216 2160NCAC
0118 I                                    P 217 2230AWTP
0119 I                                    P 224 2300WTRD
0120 I                                    P 231 2370WTWD
0121 I                                    P 238 2440IWOD
0122 I                                    P 245 2510PWOD
0123 I                                      252 252 BMDI
0124 I                                      253 253 FMDI
0125 I                                    P 254 2600PDIN
     I                                      274 277 PRFC                  CLE059
     I                                      278 280 FCLB                  S01117
0126 I                                      287 287 BTIN
0127 I                                      288 2890BLDY
0128 I**********                            290 2950OLNO                                      CSD027
0128 I                                      290 295 OLNO                                      CSD027
0129 I                                      296 296 RCSI
0130 I                                      297 2970ICBS
0131 I                                      298 298 IPFR
0132 I                                    P 299 3050TOTI
0133 I                                    P 306 3080NIDT
0134 I                                    P 309 3110IBDT
0135 I                                    P 312 3140SLID
0136 I                                    P 315 3210AIPD
0137 I                                    P 322 3240DLRC
0138 I                                    P 325 3270IACD
0139 I                                    P 328 3340AITC
0140 I                                    P 335 3410TFEP
0141 I                                    P 342 3480AIAP
0142 I                                    P 349 3550IPRD
0143 I                                    P 356 3620IPRM
0144 I                                    P 363 3690ICTD
0145 I                                    P 370 3760AIMN
0146 I                                    P 377 3790RBDT
0147 I                                      384 3850IFDY
0148 I                                      386 386 LONI
0149 I                                      387 387 CNFI
0150 I                                      388 388 ACEI
0151 I                                      389 389 TLXI
0152 I                                      390 390 CBLI
0153 I                                    P 391 3930ORED
0154 I                                    P 394 3960LCD
0155 I                                      397 397 CHTP
0156 I                                    P 398 4000TNLU
     I                                      435 436 BOKC                  S01220
     I                                     12491263 PCRF                                      244459
     I                                     12641264 LPFI                                      244459
     I                                     12651270 PTFC                                    MD029793
     I                                     127112730PTFT                                    MD029793
     I                                     127412750PTFN                                    MD029793
     I*************************************13901407 OSDA                               CGL029 CLE042
     I*************************************14081425 OMDA                               CGL029 CLE042
     I                                     15611578 OSDA                                      CLE042
     I                                     15791596 OMDA                                      CLE042
     I                                     17621765 CLAS                                      CLE042
     I                                     17801782 LOIC                                      CER020
      *                                                                                       CLE134
     I                                     18301830 FAMU                                      CLE134
     I                                     18311831 FPNR                                      CLE134
     I                                    P183218340RIDT                                      CLE134
     I                                    P183518360RIDC                                      CLE134
     I                                     183718370RCAT                                      CLE134
     I                                    P183818390RCAC                                      CLE134
     I                                    P184018420RCSD                                      CLE134
     I                                    P184318440RCDY                                      CLE134
     I                                    P184518460RICC                                      CLE134
      *                                                                                       CLE134
     I                                    P184718490BIDT                                      CLE134
     I                                    P185018510BIDC                                      CLE134
     I                                     185218520BCAT                                      CLE134
     I                                    P185318540BCAC                                      CLE134
     I                                    P185518570BCSD                                      CLE134
     I                                    P185818590BCDY                                      CLE134
     I                                    P186018610BICC                                      CLE134
      *                                                                                       CLE134
     I                                     18621864 XRFI                                      CLE134
     I                                     186518740XRFN                                      CLE134
      *                                                                                       CLE134
0157 I*
0158 I*   CUSTOMER LENDING LOANS FILE - DETAIL RECORD 2
0159 I*
0160 I        NS  03   1 CD   8 CB
0161 I                                        1   1 RECI
0162 I**********                              2   70LNRF                                      CLE148
     I                                        2   7 LNRF                                      CLE148
0163 I                                        8   8 RCDT
0164 I                                        9   90MRIN
0165 I                                       10  44 NAR1
0166 I                                       45  79 NAR2
0167 I                                       80 114 NAR3
0168 I                                      115 149 NAR4
0169 I                                    P 150 1560OPAM
0170 I                                      157 1610FRBC
0171 I                                    P 162 1680YPLN
0172 I                                    P 169 1750YFLN
0173 I                                    P 176 1820YILN
0174 I                                    P 183 1890ABLN
0175 I                                    P 190 1960YPLC
0176 I                                    P 197 2030YFLC
0177 I                                    P 204 2100YWLC
0178 I                                    P 211 2170ABLC
0179 I                                    P 218 2240WWLN
0180 I                                    P 225 2310IWLN
0181 I                                    P 232 2380PWLN
0182 I                                      245 274 SPI1
0183 I                                      275 304 SPI2
0184 I                                      305 334 SPI3
0185 I                                    P 391 3930ORED
0186 I                                    P 394 3960LCD
0187 I                                      397 397 CHTP
0188 I                                    P 398 4000TNLU
      *                                                                   CLE004
      ** Participant Facility Details                                     CLE004
     I**********                           126512700PTFC                               CLE004 CSD027
     I**********                           12651270 PTFC                             CSD027 MD029793
     I**********                           127112730PTFT                             CLE004 MD029793
     I**********                           127412750PTFN                             CLE004 MD029793
0189 I*
0190 I*    CUSTOMER LENDING LOANS FILE - TRAILER RECORD
0191 I*
0192 I        NS  04   1 CT
0193 I                                        1   1 RECI
0194 I**********                              2   70LNRF                                      CLE148
     I                                        2   7 LNRF                                      CLE148
0195 I                                        8   8 RCDT
0196 I*    FOLLOWING FIELD RENAMED FOR PURPOSE OF THIS PROGRAM
0197 I                                    P  17  190NORE1
0198 I*
0199 I                                    P  20  220FLSZ
0200 I                                    P  23  250NLRB
0201 I                                    P  26  280NINS
0202 I                                    P  29  310NDEL
0203 I                                    P  32  340NLRA
0204 I                                    P  35  420VLBF
0205 I                                    P  43  440VLBL
0206 I                                    P  45  520VRIF
0207 I                                    P  53  540VRIL
0208 I                                    P  55  620VRDF
0209 I                                    P  63  640VRDL
0210 I*    FOLLOWING FIELDS RENAMED FOR PURPOSE OF THIS PROGRAM
0211 I                                    P  65  720VLAF1
0212 I                                    P  73  740VLAL1
0213 I*
0214 I                                    P  75  770DTMR
0215 I                                    P  78  800ITMR
0216 I                                    P 394 3960LCD
0217 I                                      397 397 CHTP
0218 I                                    P 398 4000TNLU
0219 I*
0220 I*    CUSTOMER LENDING LOANS FILE - ASTERISKED RECORD
0221 I*
0222 I        NS  05   1 C*
0223 I*
0224 I*    CATCH ALL
0225 I*
0226 I        NS
0227 I*
0228 I*    FACILITY FILE - DETAIL RECORD 1
0229 I*
0230 IFCLTY   NS  06   1 CD  13 CA
0231 I       OR        1 CE  13 CA
0232 I                                        1   1 RECI
     I**   REDEFINE RECORD ID FOR O/P TO EXTRACT FOR EXPIRED CHECK
     I                                        1   1 RECIF
0233 I**********                              2   70CNUM                                      CSD027
0233 I                                        2   7 CNUM                                      CSD027
0234 I                                        8  100FACT
0235 I                                       11  120FCNO
0236 I                                       13  13 RCTP
0237 I***********                            14  160BRCD                  S01117
0237 I                                       14  16 BRCA                  S01117
0238 I                                       17  17 FCTI
0239 I                                       18  20 FCCY
0240 I                                    P  21  270FAMT
0241 I**********                          P  28  300OVPC                                      259282
0241 I                                    P  28  303OVPC                                      259282
0242 I                                    P  31  330DTAP
0243 I                                    P  34  360DTEX
0244 I                                       37  37 RVCR
0245 I                                       38  38 SECI
0246 I                                       39  39 MCCY
0247 I                                       40  40 MCSI
0248 I                                       41  41 NACD
0249 I                                       42  43 CRSK
0250 I                                    P  44  460DLFS
0251 I                                    P  47  527NOMR
0252 I                                    P  53  550RVDT
0253 I                                       56  56 RVFR
0254 I                                       57  580RVDY
0255 I                                       59  93 NAR1
0256 I                                       94 128 NAR2
0257 I                                      129 163 NAR3
0258 I                                      164 198 NAR4
0259 I                                    P 199 2050MTDH
0260 I                                    P 206 2120MTDL
0261 I                                    P 213 2190MTDA
0262 I                                    P 220 2270QTDA
0263 I                                    P 228 2350YTDA
0264 I                                      236 237 ACOF
     I                                    P 242 2440RVCD                  S01270
0265 I                                    P 247 2490ORED
0266 I                                    P 250 2520LCD
0267 I                                      253 253 CHTP
0268 I                                    P 254 2560TNLU
0267 I                                      339 340 TRCA                                    AR677799
0269 I*
0270 I*    FACILITY FILE - DETAIL RECORD 2
0271 I*
0272 I        NS  07   1 CD  13 CB
0273 I       OR        1 CE  13 CB
0274 I                                        1   1 RECI
0275 I**********                              2   70CNUM                                      CSD027
0275 I                                        2   7 CNUM                                      CSD027
0276 I                                        8  100FACT
0277 I                                       11  120FCNO
0278 I                                       13  13 RCTP
0279 I                                       14  14 CMFT
0280 I                                       15  150CALC
0281 I                                    P  16  217SPRD
0282 I                                       22  230BCOD
0283 I                                    P  24  297BRAT
0284 I                                    P  30  320STDT
0285 I                                    P  33  350EDDT
0286 I                                    P  36  380DUDT
0287 I                                       39  39 BLFR
0288 I                                       40  410BLDN
0289 I                                       42  42 BTIN
0290 I                                       43  440BLDY
0291 I                                       45  460SETT
0292 I**********                             47  58 OBAC                                      CGL029
     I                                       47  58 OBACQQ                                    CGL029
0293 I                                       59  68 TNAC
0294 I                                    P  69  710SLCD
0295 I                                    P  72  740ACCD
0296 I                                    P  75  810ADNP
0297 I                                    P  82  880PDTD
0298 I                                    P  89  950AFPD
0299 I                                    P  96 1020ADJP
0300 I                                    P 103 1090ADJN
0301 I                                    P 110 1160TOTD
0302 I                                    P 117 1230CAMD
0303 I                                    P 124 1300HFAM
     I                                      126 129 PRFC                  CLE059
     I/COPY WNCPYSRC,LE0700I001
     I                                    P 132 1380PEXP
0304 I                                    P 147 1490RUN0
0305 I                                    P 150 1520RUN1
0306 I                                    P 153 1550RUN2
0307 I                                    P 156 1580RUN3
0308 I                                    P 159 1610RUN4
0309 I                                    P 162 1640RUN5
0310 I                                    P 165 1670RUN6
0311 I                                    P 168 1700RUN7
0312 I                                    P 171 1730RUN8
0313 I                                    P 174 1760RUN9
0314 I                                    P 177 1830OAM1
0315 I                                    P 184 1900OAM2
0316 I                                    P 191 1970OAM3
0317 I                                    P 198 2040OAM4
0318 I                                    P 205 2110OAM5
0319 I                                    P 212 2180OAM6
0320 I                                    P 219 2250OAM7
0321 I                                    P 226 2320OAM8
0322 I                                    P 233 2390OAM9
0323 I                                    P 240 2460OA10
0324 I                                    P 247 2490ORED
0325 I                                    P 250 2520LCD
0326 I                                      253 253 CHTP
0327 I                                    P 254 2560TNLU
     I**********                          P 257 2630CEXP                             220263 AR677799
     I                                    P 257 2630CEXP                                    AR989943
     I                                      331 348 OBAC                                      CGL029
     I/COPY WNCPYSRC,LEH00170
      *                                                                   CLE004
      ** Participant Facility Indicator                                   CLE004
     I                                      401 401 PRTR                  CLE004
0328 I*
0329 I*    FACILITY FILE - TRAILER RECORD
0330 I*
0331 I        NS  08   1 CT
0332 I                                        1   1 RECI
0333 I**********                              2   70CNUM                                      CSD027
0333 I                                        2   7 CNUM                                      CSD027
0334 I                                        8  100FACT
0335 I                                       11  120FCNO
0336 I                                       13  13 RCTP
0337 I*    FOLLOWING FIELD RENAMED FOR PURPOSE OF THIS PROGRAM
0338 I                                    P  17  190NORE2
0339 I*
0340 I                                    P  20  220FLSZ
0341 I                                    P  23  250NLRB
0342 I                                    P  26  280NINS
0343 I                                    P  29  310NDEL
0344 I                                    P  32  340NLRA
0345 I                                    P  35  420VLBF
0346 I                                    P  43  440VLBL
0347 I                                    P  45  520VRIF
0348 I                                    P  53  540VRIL
0349 I                                    P  55  620VRDF
0350 I                                    P  63  640VRDL
0351 I                                    P  65  720VRAF
0352 I                                    P  73  740VRAL
0353 I*    FOLLOWING FIELDS RENAMED FOR PURPOSE OF THIS PROGRAM
0354 I                                    P  75  820VLAF2
0355 I                                    P  83  840VLAL2
0356 I*
0357 I                                    P 250 2520LCD
0358 I                                      253 253 CHTP
0359 I                                    P 254 2560TNLU
0360 I*
0361 I*    FACILITY FILE - ASTERISKED RECORD
0362 I*
0363 I        NS  09   1 C*
0364 I*
0365 I*    CATCH ALL
0366 I*
0367 I        NS
      *                                                                   184606
      ** Rename similar fields in CLOAN                                   184606
      *                                                                   184606
     ICLOANFLF                                                            184606
     I              RECI                            CFRECI                184606
     I              FCUS                            CFFCUS                184606
     I              FTYP                            CFFTYP                184606
     I              FSEQ                            CFFSEQ                184606
      *                                                                   184606
     ILEMNFUPF                                                                                190571
      ** Rename fields                                                                        190571
     I              BRCA                            BRCAM                                     190571
     I              CNUM                            CNUMM                                     190571
     I              FACT                            FACTM                                     190571
     I              FCNO                            FCNOM                                     190571
      *                                                                                       190571
     ILEMNFUZF                                                                                190571
      ** Rename fields                                                                        190571
     I              NLRA                            NLRAM                                     190571
     I              VLAF                            VLAFM                                     190571
     I              VLAL                            VLALM                                     190571
      *                                                                                       190571
     I            DS                                                                          190571
      ** Data structure of key list used in chaining to FCLTYL0                               190571
     I                                        1  11 FCTREC                                    190571
     I**********                              1   60CNUMM                              190571 CSD027
     I                                        1   6 CNUMM                                     CSD027
     I                                        7   90FACTM                                     190571
     I                                       10  110FCNOM                                     190571
      *                                                                                       190571
0368 I************
0369 I*****COMMITMENT*FILE*-*DETAIL*RECORD*****************************   S01339
0370 I************                                                        S01339
0371 I***LOANS***NS**10   1 CD   8 CD                                     S01339
0372 I*******OR***12   1 CM   8 CD                                        S01339
0373 I************                            1   1 RECI                  S01339
0374 I************                            2   70LNRF                  S01339
0375 I************                            8   8 RCDT                  S01339
0376 I************                            9  140DDRF                  S01339
0377 I************                           15  200BWCN                  S01339
0378 I************                           21  22 CRSK                  S01339
0379 I************                        P  23  290ORCA                  S01339
0380 I***********                            30  320BRCD                  S01117
0380 I************                           30  32 BRCA           S01117 S01339
0381 I************                           33  380LMNO                  S01339
0382 I************                           39  40 LNTP                  S01339
0383 I************                           41  42 LNST                  S01339
0384 I************                           43  43 MANT                  S01339
0385 I************                           44  44 MGRI                  S01339
0386 I************                           45  45 PLDI                  S01339
0387 I************                        P  46  520PDHA                  S01339
0388 I************                           53  53 MCYI                  S01339
0389 I************                           54  54 GDSD                  S01339
0390 I************                        P  55  570SGND                  S01339
0391 I************                        P  58  600STTD                  S01339
0392 I************                        P  61  630FAVD                  S01339
0393 I************                        P  64  660LAVD                  S01339
0394 I************                        P  67  690COND                  S01339
0395 I************                        P  70  720MATD                  S01339
0396 I************                        P  73  790MSAM                  S01339
0397 I************                        P  80  820MSBD                  S01339
0398 I************                        P  83  850MSDD                  S01339
0399 I************                           86  86 MSF                   S01339
0400 I************                        P  87  930TLAM                  S01339
0401 I************                        P  94 1000OLAM                  S01339
0402 I************                          101 103 CMCY                  S01339
0403 I************                        P 104 1100TTCA                  S01339
0404 I************                        P 111 1170TTDA                  S01339
0405 I************                        P 118 1240TTUA                  S01339
0406 I************                        P 125 1310AUNA                  S01339
0407 I************                        P 132 1380ORDA                  S01339
0408 I************                        P 139 1450ORUA                  S01339
0409 I************                          146 146 RCUI                  S01339
0410 I************                          147 147 WTXT                  S01339
0411 I************                        P 148 1514WTXR                  S01339
0412 I************                        P 152 1577SPRD                  S01339
0413 I************                        P 158 1614CFRT                  S01339
0414 I************                        P 162 1640CFSD                  S01339
0415 I************                        P 165 1670CFED                  S01339
0416 I************                        P 168 1700CFBD                  S01339
0417 I************                        P 171 1730CFDD                  S01339
0418 I************                          174 174 CFF                   S01339
0419 I************                        P 175 1826CFAD                  S01339
0420 I************                        P 183 1850LSFD                  S01339
0421 I************                        P 186 1923CFPD                  S01339
0422 I************                        P 193 1993CFPT                  S01339
0423 I************                          200 2010CFST                  S01339
0424 I************                          202 213 CFON                  S01339
0425 I************                          214 223 CFBN                  S01339
0426 I************                          224 2250ACSQ                  S01339
0427 I************                        P 226 2280ACTD                  S01339
0428 I************                        P 289 2953ACFP                  S01339
0429 I************                        P 296 3023ACFN                  S01339
0430 I************                          303 3040MSDY                  S01339
0431 I************                          305 3060CFDY                  S01339
0432 I************                          307 3130SICH                  S01339
0433 I************                          314 314 CAID                  S01339
0434 I************                          315 3150CFCM                  S01339
0435 I************                        P 391 3930ORED                  S01339
0436 I************                        P 394 3960LCD                   S01339
0437 I************                          397 397 CHTP                  S01339
0438 I************                        P 398 4000TNLU                  S01339
0439 I************                                                        S01339
0440 I*****DRAWDOWN*FILE*-*DETAIL*RECORD.******************************   S01339
0441 I************                                                        S01339
0442 I********NS**11   1 CD   8 CG                                        S01339
0443 I*******OR***13   1 CM   8 CG                                        S01339
0444 I************                            1   1 RECI                  S01339
0445 I************                            2   70LNRF                  S01339
0446 I************                            8   8 RCDT                  S01339
0447 I************                            9  140DDRF                  S01339
0448 I************                           15  200BWCN                  S01339
0449 I************                           21  220TRID                  S01339
0450 I************                        P  23  290OACC                  S01339
0451 I***********                            30  320BRCD                  S01117
0451 I************                           30  32 BRCA           S01117 S01339
0452 I************                           33  35 CMCY                  S01339
0453 I************                           36  38 DDCY                  S01339
0454 I************                           39  39 MCYI                  S01339
0455 I************                           40  41 LNTP                  S01339
0456 I************                        P  42  440DELD                  S01339
0457 I************                        P  45  470STTD                  S01339
0458 I************                        P  48  500MATD                  S01339
0459 I************                        P  51  530LRPD                  S01339
0460 I************                           54  540RPYT                  S01339
0461 I************                        P  55  610RSAM                  S01339
0462 I************                        P  62  640RSBD                  S01339
0463 I************                        P  65  670RSDD                  S01339
0464 I************                           68  68 RSF                   S01339
0465 I************                        P  69  750RPHA                  S01339
0466 I************                           76  76 DPMI                  S01339
0467 I************                        P  77  830DPMA                  S01339
0468 I************                        P  84  900DPMP                  S01339
0469 I************                        P  91  970DPTA                  S01339
0470 I************                           98  98 ACCI                  S01339
0471 I************                        P  99 1050OADC                  S01339
0472 I************                        P 106 1120ODDA                  S01339
0473 I************                        P 113 1190ODCC                  S01339
0474 I************                        P 120 1260ODDC                  S01339
0475 I************                        P 127 1330PRLA                  S01339
0476 I************                        P 134 1400WTXP                  S01339
0477 I************                        P 141 1430RLBD                  S01339
0478 I************                        P 144 1460ROLD                  S01339
0479 I************                          147 147 ROLF                  S01339
0480 I************                          148 150 NCCY                  S01339
0481 I************                        P 151 1530NRLD                  S01339
0482 I************                        P 154 1619DXRT                  S01339
0483 I************                        P 162 1699NXRT                  S01339
0484 I************                        P 170 1757CINR                  S01339
0485 I************                        P 176 1817NINR                  S01339
0486 I************                        P 182 1877SPRD                  S01339
0487 I************                        P 188 1937EINR                  S01339
0488 I************                          194 194 IRLI                  S01339
0489 I************                        P 195 1970IIND                  S01339
0490 I************                          198 1980INCM                  S01339
0491 I************                        P 199 2010LIPD                  S01339
0492 I************                        P 202 2040ACTD                  S01339
0493 I************                        P 205 2110AITC                  S01339
0494 I************                        P 212 2180AIAN                  S01339
0495 I************                        P 219 2250AIAP                  S01339
0496 I************                        P 226 2320AIPD                  S01339
0497 I************                        P 233 2390IPRD                  S01339
0498 I************                          240 249 BSTN                  S01339
0499 I************                          250 259 BMRN                  S01339
0500 I************                          260 271 OSTN                  S01339
0501 I************                          272 283 OMRN                  S01339
0502 I************                          284 2850SDST                  S01339
0503 I************                          286 2870MRST                  S01339
0504 I************                          288 2890ACSQ                  S01339
0505 I************                        P 290 2957COFR                  S01339
0506 I************                          296 296 CONI                  S01339
0507 I************                          297 3020CDDR                  S01339
0508 I************                          343 343 MOIN                  S01339
0509 I************                        P 344 3500ASTC                  S01339
0510 I************                          351 3520RSDY                  S01339
0511 I************                          353 3540RLDY                  S01339
0512 I************                          355 355 DXRI                  S01339
0513 I************                          356 356 NXRI                  S01339
0514 I************                          357 3570NICM                  S01339
0515 I************                          358 358 LNAI                  S01339
0516 I************                          359 359 LNAT                  S01339
0517 I************                        P 383 3850LDCD                  S01339
0518 I************                          386 386 DCHT                  S01339
0519 I************                        P 387 3890LRCD                  S01339
0520 I************                          390 390 RCHT                  S01339
0521 I************                        P 391 3930ORED                  S01339
0522 I************                        P 394 3960LCD                   S01339
0523 I************                          397 397 CHTP                  S01339
0524 I************                        P 398 4000TNLU                  S01339
0525 I************                                                        S01339
0526 I*****COMMITMENT*FILE*-*TRAILER*RECORD****************************   S01339
0527 I************                                                        S01339
0528 I********NS**14   1 CT   8 CD                                        S01339
0529 I************                            1   1 RECI                  S01339
0530 I*****FOLLOWING*FIELDS*RENAMED*FOR*PURPOSE*OF*THIS*PROGRAM********   S01339
0531 I************                        P  27  290NORE3                 S01339
0532 I************                        P  30  370HRWN3                 S01339
0533 I************                        P  38  390HRDC3                 S01339
0534 I*************                                                       S01339
0535 I************                        P  40  420NLRB                  S01339
0536 I************                        P  43  500RBWN                  S01339
0537 I************                        P  51  520RBDC                  S01339
0538 I************                        P  53  550NINS                  S01339
0539 I************                        P  56  630INWN                  S01339
0540 I************                        P  64  650INDC                  S01339
0541 I************                        P  66  680NAMD                  S01339
0542 I************                        P  69  760AMWN                  S01339
0543 I************                        P  77  780AMDC                  S01339
0544 I************                        P  79  810NDEL                  S01339
0545 I************                        P  82  890DLWN                  S01339
0546 I************                        P  90  910DLDC                  S01339
0547 I************                           92  92 IRRI                  S01339
0548 I************                        P 100 1020TNLU                  S01339
0549 I************                                                        S01339
0550 I*****DRAWDOWN*FILE*-*TRAILER*RECORD.*****************************   S01339
0551 I************                                                        S01339
0552 I********NS**15   1 CT   8 CG                                        S01339
0553 I************                            1   1 RECI                  S01339
0554 I************                            2   7 KEY1                  S01339
0555 I************                            8   8 RCDT                  S01339
0556 I************                            9  22 KEY2                  S01339
0557 I*****FOLLOWING FIELDS RENAMED FOR PURPOSE OF THIS PROGRAM           S01339
0558 I************                        P  27  290NORE4                 S01339
0559 I************                        P  30  370HRWN4                 S01339
0560 I************                        P  38  390HRDC4                 S01339
0561 I************                                                        S01339
0562 I************                        P  40  420NLRB                  S01339
0563 I************                        P  43  500RBWN                  S01339
0564 I************                        P  51  520RBDC                  S01339
0565 I************                        P  53  550NINS                  S01339
0566 I************                        P  56  630INWN                  S01339
0567 I************                        P  64  650INDC                  S01339
0568 I************                        P  66  680NAMD                  S01339
0569 I************                        P  69  760AMWN                  S01339
0570 I************                        P  77  780AMDC                  S01339
0571 I************                        P  79  810NDEL                  S01339
0572 I************                        P  82  890DLWN                  S01339
0573 I************                        P  90  910DLDC                  S01339
0574 I************                           92  92 IRR1                  S01339
0575 I************                           93  93 IRR2                  S01339
0576 I************                        P 100 1020TNLU                  S01339
0577 I************                                                        S01339
0578 I******CATCHALL***************************************************   S01339
0579 I************                                                        S01339
0580 I********NS**                                                        S01339
0581 I**********                                                          S01194
0582 I*****CLIENT*FILE*-*CUSTOMER*STANDING*DATA*RECORD.*****              S01194
0583 I**********                                                          S01194
0584 I*CLINT***NS**20***1*CD***8*CA****                                   S01194
0585 I**********                              1   1 RECI                  S01194
0586 I**********                              2   70CNUM                  S01194
0587 I**********                              8   8 RCDT                  S01194
0588 I**********                              9  28 CRNM                  S01194
0589 I**********                             29  38 CTWN                  S01194
0590 I**********                             39  48 CSNM                  S01194
0591 I**********                             49  56 CASK                  S01194
0592 I**********                             57  68 TELX                  S01194
0593 I**********                             69  80 CSID                  S01194
0594 I**********                             81  82 ACOC                  S01194
0595 I**********                             83  83 CBSI                  S01194
0596 I**********                             84  85 CCTZ                  S01194
0597 I**********                             86  87 CLOC                  S01194
0598 I**********                             88  930CPAR                  S01194
0599 I*****FOLLOWING*FIELD*RENAMED FOR PURPOSE OF THIS PROGRAM            S01194
0601 I**********                                                          S01194
0602 I**********                             97  980LINS                  S01194
0603 I**********                             99 1010LIND                  S01194
0604 I**********                          P 102 1040DASU                  S01194
0605 I**********                          P 105 1070CDIC                  S01194
0606 I**********                          P 108 1100DADE                  S01194
0607 I**********                            111 111 CMIN                  S01194
0608 I**********                            112 112 CTYP                  S01194
0609 I**********                            113 124 TELF                  S01194
0610 I**********                            125 133 CHID                  S01194
0611 I**********                            134 136 CHAB                  S01194
0612 I**********                          P 250 2520LCD                   S01194
0613 I**********                            253 253 CHTP                  S01194
0614 I**********                          P 254 2560TNLU                  S01194
0615 I**********                                                          S01194
0616 I*****CATCH ALL                                                      S01194
0617 I**********                                                          S01194
0618 I********NS**                                                        S04494
0619 I***********                                                         S01194
0620 I*****TABLE*FILE*-*INSTALLATION*CONTROL*DATA*RECORD*1.******         S01194
0621 I**********                                                          S01194
0622 I*TABLE***NS*******2*C0***3*C1**12*C1****                            S01194
0623 I*******AND******13*C0*****                                          S01194
0624 I**********                              1   1 RECI                  S01194
0625 I**********                              2   30RECT                  S01194
0626 I**********                             12  130RCDE                  S01194
0627 I**********                             14  66 TITL                  S01194
0628 I**********                             67  67 DATF                  S01194
0630 I**********                             74  74 MODI1                 S01194
0631 I**********                             75  75 MODI2                 S01194
0632 I**********                             76  76 MODI3                 S01194
0633 I**********                          P  77  790RUND                  S01194
0634 I**********                             80  86 RUNA                  S01194
0635 I**********                             87  870SFLG                  S01194
0636 I**********                          P  90  920LCD                   S01194
0637 I**********                             93  93 CHTP                  S01194
0638 I**********                          P  94  960TNLU                  S04494
0639 I**********                                                          S01194
0640 I*****CATCH*ALL******                                                S01194
0641 I***********                                                         S01194
0642 I********NS*                                                         S01194
0358 I**********                                                          S01194
     ISDBANK    E DSSDBANKPD                                              S01194
      ** BANK DETAILS                                                     S01194
     I              BJDFIN                          DATF                  S01194
     I              BJMRDT                          RUNA                  S01194
     I              BJURPT                          TITL                  S01194
     ISDCUST    E DSSDCUSTPD                                              S01194
      **   CUSTOMER                                                       S01194
     I              BBCOLC                          CLOC                  S01194
     I              BBPCNB                          CPAR                  S01194
     I              BBCRNM                          CRNM                  S01194
     ISDBRCH    E DSSDBRCHPD                                              S01117
     I              QQDFAC                          QQDFA1                                    CGL029
     I** EXTERNAL DS FOR BRANCHES DETAILS                                 S01117
     I**                                                                  S01117
     I              A8CMCD                          CMPYM                 S01117
     I*                                                                   S01194
     IDSFDY     E DSDSFDY                                                 S01194
     I* FIRST DS FOR ACCESS PROGRAMS, SHORT DATA STRUCTURE                S01194
     I*                                                                   S01194
     IDSSDY     E DSDSSDY                                                 S01194
     I* SECOND DS FOR ACCESS PROGRAMS, LONG DATA STRUCTURE                S01194
     I*                                                                   S01194
     ISCSARD    E DSSCSARDPD                                              CLE004
      **  Switchable Features File                                        CLE004
0643 I*
0644 I*    LDA - DIAGNOSTICS FOR PROGRAM ABORT
0645 I*
0646 ILDA        UDS                            256
0647 I***********                           134 138 DBFILE                S01117
0648 I***********                           139 167 DBKEY                 S01117
0649 I***********                           168 175 DBPGM                 S01117
0650 I***********                           176 1770DBASE                 S01117
0647 I                                      134 141 DBFILE                S01117
0648 I                                      142 170 DBKEY                 S01117
0649 I                                      171 180 DBPGM                 S01117
0650 I                                      181 1830DBASE                 S01117
     C**********           MOVEACPY@      BIS@   80                                           CSC042
     C*    DEFINE LDA                                                     S01117
     C           *NAMVAR   DEFN           LDA                             S01117
0651 C********************************************************************
0652 C**   FIRST CYCLE PROCESSING
0653 C   40                GOTO DETAIL
     C                     MOVEACPY@      BIS@   80                                           CSC042
     C                     MOVE *BLANKS   DBPGM                           S01194
     C                     MOVEL'LE0700'  DBPGM                           S01194
     C                     Z-ADD0         ##BNDX  40                                          CSC042
     C           *LIKE     DEFN ##BNDX    B                                                   CSC042
     C           *LIKE     DEFN ##BNDX    ##BSV                                               CSC042
      *                                                                                       CSC042
0654 C                     EXSR ZSYSTM
0655 C   99                SETON                     U7U8  **DATABASE 01**
0656 C   99                Z-ADD1         DBASE
0657 C***99*********       MOVE ZTABKY    DBKEY                           S01194
0658 C***99*********       MOVE 'TABLE'   DBFILE                          S01194
0658 C   99                MOVE 'SDBANKPD'DBFILE                          S01194
0659 C   99                GOTO END
      *                                                                   184606
      ** Define keylist for loans by facility                             184606
      *                                                                   184606
     C           CLFKEY    KLIST                                          184606
     C                     KFLD           CNUM                            184606
     C                     KFLD           FACT                            184606
     C                     KFLD           FCNO                            184606
0660 C**
0661 C*****DEFINE*CUSTOMER*KEY                                            S01194
0662 C*********************MOVE 'A'       CUSKEY  7                       S01194
      *                                                                   CLE004
     C/COPY WNCPYSRC,LE0700C001
      ** Check if CLE004 is switched *ON                                  CLE004
      *                                                                   CLE004
     C                     MOVE 'N'       CLE004  1                       CLE004
     C                     CALL 'AOSARDR0'                                CLE004
     C                     PARM *BLANKS   @RTCD                           CLE004
     C                     PARM '*VERIFY' @OPTN                           CLE004
     C                     PARM 'CLE004'  @SARD   6                       CLE004
     C           SCSARD    PARM SCSARD    DSFDY                           CLE004
      *                                                                   CLE004
     C           @RTCD     IFEQ *BLANKS                                   CLE004
     C                     MOVE 'Y'       CLE004                          CLE004
     C                     END                                            CLE004
      *                                                                   CLE004
     C           @RTCD     IFNE *BLANKS                                   CLE004
     C           @RTCD     ANDNE'*NRF   '                                 CLE004
      *                                                                   CLE004
      ** Call to program ended in error                                   CLE004
      *                                                                   CLE004
     C                     SETON                     U7U8                 CLE004
     C                     MOVEL'CLE004'  DBKEY            ***************CLE004
     C                     MOVE 'SCSARDPD'DBFILE           * DB ERROR 10 *CLE004
     C                     Z-ADD10        DBASE            ***************CLE004
     C                     GOTO END                                       CLE004
     C                     ENDIF                                          CLE004
      *                                                                   CLE004
      ** Set on indicator if CLE004 is switched *ON                       CLE004
      *                                                                   CLE004
     C           CLE004    IFEQ 'Y'                                       CLE004
     C                     MOVE *ON       *IN67                           CLE004
     C                     END                                            CLE004
      *                                                                   CLE005
      ** Check if CLE005 is switched *ON                                  CLE005
      *                                                                   CLE005
     C                     MOVE 'N'       CLE005  1                       CLE005
     C                     CALL 'AOSARDR0'                                CLE005
     C                     PARM *BLANKS   WRTCD   7                       CLE005
     C                     PARM '*VERIFY' WOPTN   7                       CLE005
     C                     PARM 'CLE005'  WSARD   6                       CLE005
     C           SCSARD    PARM SCSARD    DSFDY                           CLE005
      *                                                                   CLE005
     C           WRTCD     IFEQ *BLANKS                                   CLE005
     C                     MOVE 'Y'       CLE005                          CLE005
     C                     ELSE                                           CLE005
      *                                                                   CLE005
      ** Call to program ended in error                                   CLE005
      *                                                                   CLE005
     C           WRTCD     IFNE '*NRF   '                                 CLE005
     C                     MOVEL'CLE005'  DBKEY            ***************CLE005
     C                     MOVE 'SCSARDPD'DBFILE           * DB ERROR 11 *CLE005
     C                     Z-ADD11        DBASE            ***************CLE005
     C                     MOVE *ON       *INU7                           CLE005
     C                     MOVE *ON       *INU8                           CLE005
     C                     GOTO END                                       CLE005
     C                     ENDIF                                          CLE005
     C                     ENDIF                                          CLE005
      **********                                                                     220263 AR677799
     C**********           CALL 'AOSARDR0'                                           220263 AR677799
     C**********           PARM *BLANKS   @RTCD                                      220263 AR677799
     C**********           PARM '*VERIFY' @OPTN                                      220263 AR677799
     C**********           PARM 'CLE023'  @SARD   6                                  220263 AR677799
     C********** SCSARD    PARM SCSARD    DSFDY                                      220263 AR677799
      **********                                                                     220263 AR677799
     C********** @RTCD     IFEQ *BLANKS                                              220263 AR677799
     C**********           MOVE '1'       *IN11                                      220263 AR677799
     C**********           ELSE                                                      220263 AR677799
     C**********           MOVE '0'       *IN11                                      220263 AR677799
     C**********           END                                                       220263 AR677799
      **********                                                                     220263 AR677799
     C********** @RTCD     IFNE *BLANKS                                              220263 AR677799
     C********** @RTCD     ANDNE'*NRF   '                                            220263 AR677799
      **********                                                                     220263 AR677799
      ***Call*to*program*ended*in*error                                              220263 AR677799
      **********                                                                     220263 AR677799
     C**********           MOVE '1'       *INU7                                      220263 AR677799
     C**********           MOVE '1'       *INU8                                      220263 AR677799
     C**********           MOVEL'CLE023'  DBKEY            ***************           220263 AR677799
     C**********           MOVE 'SCSARDPD'DBFILE           * DB ERROR 10 *           220263 AR677799
     C**********           Z-ADD10        DBASE            ***************           220263 AR677799
     C**********           GOTO END                                                  220263 AR677799
     C**********           ENDIF                                                     220263 AR677799
      *                                                                                     AR989943
     C                     CALL 'AOSARDR0'                                                  AR989943
     C                     PARM *BLANKS   @RTCD                                             AR989943
     C                     PARM '*VERIFY' @OPTN                                             AR989943
     C                     PARM 'CLE023'  @SARD   6                                         AR989943
     C           SCSARD    PARM SCSARD    DSFDY                                             AR989943
      *                                                                                     AR989943
     C           @RTCD     IFEQ *BLANKS                                                     AR989943
     C                     MOVE '1'       *IN11                                             AR989943
     C                     ELSE                                                             AR989943
     C                     MOVE '0'       *IN11                                             AR989943
     C                     END                                                              AR989943
      *                                                                                     AR989943
     C           @RTCD     IFNE *BLANKS                                                     AR989943
     C           @RTCD     ANDNE'*NRF   '                                                   AR989943
      *                                                                                     AR989943
      ** Call to program ended in error                                                     AR989943
      *                                                                                     AR989943
     C                     MOVE '1'       *INU7                                             AR989943
     C                     MOVE '1'       *INU8                                             AR989943
     C                     MOVEL'CLE023'  DBKEY                                             AR989943
     C                     MOVE 'SCSARDPD'DBFILE                                            AR989943
     C                     Z-ADD10        DBASE                                             AR989943
     C                     GOTO END                                                         AR989943
     C                     ENDIF                                                            AR989943
      *                                                                   CLE059
      *** Check if feature CLE059 is switched on and move *on *IN70       CLE059
      *                                                                   CLE059
     C                     CALL 'AOSARDR0'                                CLE059
     C                     PARM *BLANKS   WRTCD                           CLE059
     C                     PARM '*VERIFY' WOPTN                           CLE059
     C                     PARM 'CLE059'  WSARD                           CLE059
     C           SCSARD    PARM SCSARD    DSFDY                           CLE059
      *                                                                   CLE059
     C           WRTCD     IFEQ *BLANKS                                   CLE059
     C                     MOVE *ON       *IN70                           CLE059
     C                     OPEN FACEXHHA                                  CLE059
     C                     OPEN FACEXFCA                                  CLE059
     C                     OPEN FACEXFAA                                  CLE059
     C                     OPEN FACEXT4A                                  CLE059
     C                     ENDIF                                          CLE059
     C/COPY WNCPYSRC,LE0700C002
0663 C**
0664 C                     SETON                     40
     C                     MOVE *BLANKS   ZZ016  16                                           190571
      *                                                                                       190571
      ** Key list for Facilities file                                                         190571
      *                                                                                       190571
     C           WKFAC     KLIST                                                              190571
     C                     KFLD           BRCAM                                               259282
     C                     KFLD           CNUMM                                               190571
     C                     KFLD           FACTM                                               190571
     C                     KFLD           FCNOM                                               190571
      *                                                                                       190571
0665 C**********************************
0666 C           DETAIL    TAG                             **DETAIL TAG**
0667 C**
0668 C**   RESET EXTRACT INDICATORS
0669 C                     SETOF                     6061
0670 C**
0671 C***42******          GOTO QLOANS                                    S01339
0672 C   43                GOTO QFCLTY
0673 C**********************************
0674 C**   S/CLOAN PROCESSING
0675 C**
0676 C**   PERFORM RECORD COUNT & HASH TOTALS
0677 C  N05      COUNT1    ADD  1         COUNT1  50
0678 C   02                Z-ADDHSHWN1    ZZTOTI
0679 C   02                Z-ADDHSHDC1    ZZTOTD
0680 C**
0681 C**   IF AMOUNT IS NEGATIVE,REVERSE SIGN
0682 C   02      CPAM      DIV  1000      ZZAMT        41
0683 C   02 41             Z-SUBZZAMT     ZZAMT
0684 C   02                EXSR GLZADD
0685 C   02                Z-ADDZZTOTI    HSHWN1 150
0686 C   02                Z-ADDZZTOTD    HSHDC1  30
0687 C**
0688 C**   S/CLOAN - 'B' RECORD PROCESSING
      *                                                                   CLE004
      ** If any of the participant details has a value then use these     CLE004
      ** details as the facility of the loan.                             CLE004
      *                                                                   CLE004
     C           *IN03     IFEQ *ON                                       CLE004
     C           CLE004    ANDEQ'Y'                                       CLE004
     C                     MOVE *OFF      *IN68   1                       CLE004
     C********** PTFC      IFNE 0                                                      CLE004 CSD027
     C           PTFC      IFNE *BLANKS                                                       CSD027
     C           PTFT      ORNE 0                                         CLE004
     C           PTFN      ORNE 0                                         CLE004
     C                     MOVE *ON       *IN68                           CLE004
     C                     ENDIF                                          CLE004
     C                     ENDIF                                          CLE004
      *                                                                   CLE004
     C   03                EXSR CMPYCD                                    S01117
*    C   U7 U8             GOTO END                                       S01117
0689 C   03                SETON                     61
0690 C**
0691 C   03      PTYP      COMP 66                       66
0692 C   03N66   PTYP      COMP 67                       66
      *                                                                   CLE005
      ** If CLE005 is installed, include additional processing types      CLE005
      ** 69 and 72.                                                       CLE005
      *                                                                   CLE005
     C           CLE005    IFEQ 'Y'                                       CLE005
     C           *IN03     ANDEQ'1'                                       CLE005
     C           *IN66     ANDEQ'0'                                       CLE005
     C           PTYP      IFEQ 69                                        CLE005
     C           PTYP      OREQ 72                                        CLE005
     C                     MOVE *ON       *IN66                           CLE005
     C                     ENDIF                                          CLE005
     C                     ENDIF                                          CLE005
0693 C**
0694 C**   PERFORM RECORD COUNT & HASH TOTALS FOR EXTRACT FILE
0695 C**
0696 C**   IF AMOUNT IS NEGATIVE,REVERSE SIGN
0697 C   03      CPAM      DIV  1000      ZZAMT        41
0698 C   03 41             Z-SUBZZAMT     ZZAMT
0699 C   03                EXSR CONTR1
0700 C**
0701 C**   OBTAIN DETAILS FOR FACILITY CUSTOMER
0702 C***03********        MOVELFCUS      CUSKEY                          S01194
     C***03******          MOVELFCUS      KEYC                     S01194 E43518
     C***03********        MOVELCNUM      KEYC                     E43518 101182
     C           *IN03     IFEQ '1'                                       101182
     C                     MOVELFCUS      KEYC                            101182
     C                     ENDIF                                          101182
0703 C   03                EXSR CUSCHN
0704 C   03N20             SETON                     U7U8  **DATABASE 02**
0705 C   03N20             Z-ADD2         DBASE
0706 C   03N20             GOTO END
0707 C**
0708 C**   S/CLOAN - TRAILER RECORD PROCESSING
0709 C   04      COUNT1    COMP NORE1                U8U8
0710 C   04NU8   HSHWN1    COMP VLAF1                U8U8
0711 C   04NU8   HSHDC1    COMP VLAL1                U8U8
0712 C   04 U8             SETON                     62
0713 C   04                SETON                     43
0714 C                     GOTO END
0715 C**********************************
0716 C**   S/FCLTY PROCESSING
0717 C           QFCLTY    TAG                             *QFCLTY TAG **
0718 C**
0719 C**   PERFORM RECORD COUNT & HASH TOTALS
0720 C  N09      COUNT2    ADD  1         COUNT2  50
0721 C   06                Z-ADDHSHWN2    ZZTOTI
0722 C   06                Z-ADDHSHDC2    ZZTOTD
0723 C   06                MOVE FAMT      ZZAMT
     C           *IN06     IFEQ '1'                                                           193603
     C           ZZAMT     ANDLT0                                                             193603
     C                     Z-SUBZZAMT     ZZAMT                                               193603
     C                     END                                                                193603
0724 C   06                EXSR GLZADD
0725 C   06                Z-ADDZZTOTI    HSHWN2 150
0726 C   06                Z-ADDZZTOTD    HSHDC2  30
      *                                                                   184606
      ** Check if expired facility needs to be output to PF/FACEXFC       184606
      ** A record should only be output if and only if the facility       184606
      ** is expired and no live loans are attached to it                  184606
      *                                                                   184606
     C           *IN07     IFEQ '1'                                       184606
     C           RECIF     ANDEQ'E'                                       184606
     C           CLFKEY    CHAINCLOANFL1             51                   184606
     C           *IN51     IFEQ '1'                                       184606
     C                     GOTO END                                       184606
     C                     ENDIF                                          184606
     C                     ENDIF                                          184606
     C**                                                                  S01117
     C**   IF S/FCLTY RECORD, SET FCLB TO BRCA                            S01117
     C           *IN06     IFEQ '1'                                       S01117
     C           *IN07     OREQ '1'                                       S01117
     C                     MOVE BRCA      FCLB                            S01117
     C                     END                                            S01117
0727 C**
0728 C**   S/FCLTY - 'B' RECORD PROCESSING
     C   07                EXSR CMPYCD                                    S01117
*    C   U7 U8             GOTO END                                       S01117
0729 C   07                SETON                     60
0730 C**
0731 C**   PERFORM RECORD COUNT & HASH TOTALS FOR EXTRACT FILE
      *                                                                                     AR677799
      ** All drawdown in the linked tranches                                                AR677799
      ** should be printed in the CA line                                                   AR677799
      *                                                                                     AR677799
     C           TRCA      IFEQ 'CA'                                                        AR677799
     C           *IN07     ANDEQ'1'                                                         AR677799
     C                     MOVE OAM1      PEXP                                              AR677799
     C                     ENDIF                                                            AR677799
      *                                                                                     AR677799
0732 C   07                MOVE PEXP      ZZAMT
     C********** *IN11     IFEQ '1'                                                  220263 AR677799
     C********** *IN07     ANDEQ'1'                                                  220263 AR677799
     C**********           MOVE CEXP      ZZAMT                                      220263 AR677799
     C**********           ENDIF                                                     220263 AR677799
     C********** *IN11     IFEQ '1'                                                AR989943 MD029793
     C********** *IN07     ANDEQ'1'                                                AR989943 MD029793
     C**********           MOVE CEXP      ZZAMT                                   AR989943 AR989943A
     C**********           MOVE CAMD      ZZAMT                                   AR989943A MD029793
     C**********           ENDIF                                                   AR989943 MD029793
0733 C   07                EXSR CONTR2
0734 C**
0735 C**   OBTAIN DETAILS FOR FACILITY CUSTOMER
0736 C***07****************MOVELCNUM      CUSKEY                          S01194
0736 C   07                MOVELCNUM      KEYC                            S01194
0737 C   07                EXSR CUSCHN
0738 C   07N20             SETON                     U7U8  **DATABASE 03**
0739 C   07N20             Z-ADD3         DBASE
0740 C   07N20             GOTO END
0741 C**
0742 C**   DETERMINE CURRENT AVAILABLE AMOUNT
0743 C***07***** FAMT      SUB  OAM1      CALC1  130                                          259872
     C   07      FAMT      SUB  OAM2      CALC1  130                                          259872
     C***07*11** FAMT      SUB  CEXP      CALC1                                   AR989943 AR989943A
     C***07*11** FAMT      SUB  CAMD      CALC1                                   AR989943A MD029793
0744 C**
0745 C**   S/FCLTY - TRAILER RECORD PROCESSING
0746 C   08      COUNT2    COMP NORE2                U8U8
0747 C   08NU8   HSHWN2    COMP VLAF2                U8U8
0748 C   08NU8   HSHDC2    COMP VLAL2                U8U8
0749 C   08 U8             SETON                     63
0750 C***08******          SETON                     42                   S01339
0751 C***********          GOTO END                                       S01339
0752 C***********                                                         S01339
0753 C**********************************                                  S01339
0754 C*****S/LOANS*PROCESSING******************************************   S01339
0755 C***********QLOANS    TAG                             *QLOANS TAG**  S01339
     C***********                                                  S01117 S01339
     C***To*get*COMPANY*Name*FOR*OUPUT*TO*FACEXFA*&*FACEXFC********S01117 S01339
     C***10******                                                  S01117 S01339
     C***OR*11******          EXSR CMPYCD                          S01117 S01339
*    C***U7*U8***          GOTO END                                S01117 S01339
0756 C***********                                                         S01339
0757 C*****S/LOANS*-*COMMITMENTS*PROCESSING****************************   S01339
0758 C***********                                                         S01339
0759 C*****PERFORM*RECORD*COUNT*&*HASH*TOTALS**************************   S01339
0760 C***10******COUNT3    ADD  1         COUNT3  50                      S01339
0761 C***12******COUNT3    ADD  1         COUNT3                          S01339
0762 C***10******          Z-ADDHSHWN3    ZZTOTI                          S01339
0763 C***10******          Z-ADDHSHDC3    ZZTOTD                          S01339
0764 C***10******          MOVE ORCA      ZZAMT                           S01339
0765 C***10******          EXSR GLZADD                                    S01339
0766 C***10******          Z-ADDZZTOTI    HSHWN3 150                      S01339
0767 C***10******          Z-ADDZZTOTD    HSHDC3  30                      S01339
0768 C***********                                                         S01339
0769 C***10******          SETON                     60                   S01339
     C***********                                                         S01339
     C*****CHECK*WHICH*AMOUNTS*TO*OUTPUT*TO*EXTRACT*FILE.**************   S01339
     C***********                                                         S01339
     C***10******OLAM      COMP 0                        30               S01339
     C***10*30***          Z-ADDTTCA      TCMA   130                      S01339
     C***10*30***          Z-ADDTTDA      TDNA   130                      S01339
     C***10*30***          Z-ADDTTUA      TUNA   130                      S01339
     C***********                                                         S01339
     C***10N30***          Z-ADDORCA      TCMA                            S01339
     C***10N30***          Z-ADDORDA      TDNA                            S01339
     C***10N30***          Z-ADDORUA      TUNA                            S01339
0770 C***********                                                         S01339
0771 C***PERFORM*RECORD*COUNT*&*HASH*TOTALS*FOR*EXTRACT*FILE***********   S01339
     C***10******          MOVE TDNA      ZZAMT                           S01339
0773 C***10******          EXSR CONTR2                                    S01339
0774 C***********                                                         S01339
0775 C*****OBTAIN*DETAILS*FOR*COMMITMENT*CUSTOMER**********************   S01339
0776 C***10****************MOVELBWCN      CUSKEY                          S01194
0776 C***10******          MOVELBWCN      KEYC                     S01194 S01339
0777 C***10******          EXSR CUSCHN                                    S01339
0778 C***10N20***          SETON                     U7U8  **DATABASE 04**S01339
0779 C***10N20***          Z-ADD4         DBASE                           S01339
0780 C***10N20***          GOTO END                                       S01339
0781 C***********                                                         S01339
0782 C*****S/LOANS*-*DRAWDOWN*RECORD*PROCESSING************************   S01339
0783 C***********                                                         S01339
0784 C*****PERFORM*RECORD*COUNT*&*HASH*TOTALS**************************   S01339
0785 C***11******COUNT4    ADD  1         COUNT4  50                      S01339
0786 C***13******COUNT4    ADD  1         COUNT4                          S01339
0787 C***11******          Z-ADDHSHWN4    ZZTOTI                          S01339
0788 C***11******          Z-ADDHSHDC4    ZZTOTD                          S01339
0789 C***11******          MOVE OACC      ZZAMT                           S01339
0790 C***11******          EXSR GLZADD                                    S01339
0791 C***11******          Z-ADDZZTOTI    HSHWN4 150                      S01339
0792 C***11******          Z-ADDZZTOTD    HSHDC4  30                      S01339
0793 C***********                                                         S01339
0794 C***11******          SETON                     61                   S01339
     C***********                                                         S01339
     C*****CHECK*WHICH*AMOUNTS*TO*OUTPUT*TO*EXTRACT*FILE.**************   S01339
     C***********                                                         S01339
     C***11******ODDC      COMP 0                        30               S01339
     C***11*30***          Z-ADDOADC      TDDA   130                      S01339
     C***11N30***          Z-ADDODDC      TDDA                            S01339
0795 C***********                                                         S01339
0796 C*****PERFORM*RECORD*COUNT*&*HASH*TOTALS*FOR*EXTRACT*FILE*********   S01339
     C***11******          MOVE TDDA      ZZAMT                           S01339
0798 C***11******          EXSR CONTR1                                    S01339
0799 C***********                                                         S01339
0800 C*****OBTAIN*DETAILS*FOR*DRAWDOWN*CUSTOMER************************   S01339
0801 C***11****************MOVELBWCN      CUSKEY                          S01194
0801 C***11******          MOVELBWCN      KEYC                     S01194 S01339
0802 C***11******          EXSR CUSCHN                                    S01339
0803 C***11N20***          SETON                     U7U8  **DATABASE05** S01339
0804 C***11N20***          Z-ADD5         DBASE                           S01339
0805 C***11N20***          GOTO END                                       S01339
0806 C***********                                                         S01339
0807 C*****S/LOANS*-*COMMITMENT*TRAILER*RECORD*PROCESSING**************   S01339
0808 C***14******COUNT3    COMP NORE3                U8U8                 S01339
0809 C***14NU8***HSHWN3    COMP HRWN3                U8U8                 S01339
0810 C***14NU8***HSHDC3    COMP HRDC3                U8U8                 S01339
0811 C***14*U8***          SETON                     64                   S01339
0812 C***********                                                         S01339
0813 C*****S/LOANS DRAWDOWN TRAILER RECORD PROCESSING                     S01339
0814 C***15******COUNT4    COMP NORE4                U8U8                 S01339
0815 C***15NU8***HSHWN4    COMP HRWN4                U8U8                 S01339
0816 C***15NU8***HSHDC4    COMP HRDC4                U8U8                 S01339
0817 C***15*U8***          SETON                     65                   S01339
0818 C***********                                                         S01339
0819 C*****END*PROCESSING(2*TRAILER*RECORDS*UNPROCESSED)***************   S01339
0820 C***15******          SETON                     LR                   S01339
0821 C***********                                                         S01339
0822 C           END       TAG                             **END TAG**
0823 C** U7
0824 C   U7                SETON                     LR
      *                                                                                       190571
      ** Extract Manual Facility Utilisation records                                          190571
      *                                                                                       190571
     CLRNU7                SETON                     44                                       190571
     CLRNU7                EXSR SRMFU                                                         190571
      *                                                                                       190571
     CLR U7 U8             EXSR *PSSR                                     S01117
     C*                                                                   S01408
     C/COPY WNCPYSRC,LE0700CCPG                                           S01408
     C*                                                                   S01408
1018 C**                                                                  S01117
0825 C********************************************************************
0826 C/SPACE 3
0827 C********************************************************************S01117
     C           CMPYCD    BEGSR                           **CMPYCD**     S01117
     C* Check whether details for Branch already in array                                     CSC042
     C                     MOVELFCLB      ##KB                                                CSC042
     C                     EXSR ##CHKB                                                        CSC042
      * If branch is in the array then use the details                                        CSC042
     C           ##FIC     IFEQ 'Y'                        *** B10                            CSC042
     C                     EXSR ##SETB                                                        CSC042
     C                     ELSE                            *** X10                            CSC042
     C**********           CALL 'AOBRCHR0'                                S01117              CGL029
     C                     CALL 'AOBRCHR1'                                                    CGL029
     C                     PARM '*MSG   ' @RTCD   7                       S01117
     C                     PARM '*KEY   ' @OPTN   7                       S01117
     C                     PARM FCLB      @DSNB   3                       S01117
     C**********           PARM           SDBRCH                    S01117BHF128
     C********** SDBRCH    PARM SDBRCH    DSFDY                           BHF128              CGL029
     C           SDBRCH    PARM SDBRCH    DSSDY                                               CGL029
     C*                                                                   S01117
     C           @RTCD     IFNE *BLANKS                                   S01117
     C                     SETON                     U7U8LR               S01117
     C                     MOVEL'SDBRCHPD'DBFILE                          S01117
     C                     MOVEL@DSNB     DBKEY            ************** S01117
     C                     MOVEL@OPTN     DBOPTN  7        *DBASE 06 **** S01117
     C                     Z-ADD6         DBASE            ************** S01117
     C                     EXSR *PSSR                                     S01117
     C                     ELSE                                                               CSC042
      * Details found on the DB so add them to the array                                      CSC042
      * if the array still has room                                                           CSC042
     C                     EXSR ##ADDB                                                        CSC042
     C                     END                                            S01117
     C                     END                             *** E10                            CSC042
*    C                     ENDSR                                          S01117
0827 C********************************************************************
      /EJECT                                                                                  CSC042
     C********************************************************************                    CSC042
      *                                                                                       CSC042
      * ##CHKB - Subroutine to check the Branch in the arrays                                 CSC042
      *                                                                                       CSC042
     C           ##CHKB    BEGSR                                                              CSC042
      *                                                                                       CSC042
     C           *LIKE     DEFN A8BRCD    ##KB                                                CSC042
      *                                                                                       CSC042
      * Set off the branch found indicator                                                    CSC042
     C                     MOVEL*BLANK    ##FIC   1                                           CSC042
      *                                                                                       CSC042
      * Save the state of indicator 30 so it can be reset at the end                          CSC042
      * of the SR as it may be used elsewhere in the code                                     CSC042
     C           *IN30     IFEQ *ON                                                           CSC042
     C                     MOVEL'Y'       #IN30   1                                           CSC042
     C                     ELSE                                                               CSC042
     C                     MOVEL'N'       #IN30                                               CSC042
     C                     END                                                                CSC042
      *                                                                                       CSC042
     C                     SETOF                         30                                   CSC042
      *                                                                                       CSC042
      * Restore the saved Value of B                                                          CSC042
     C                     Z-ADD##BSV     B                                                   CSC042
      *                                                                                       CSC042
     C* Check whether details for Branch already in array                                     CSC042
      *                                                                                       CSC042
      * Is this the same as the last LOKUP, if so we can bypass                               CSC042
      * the LOKUP                                                                             CSC042
      * Defend against B being 0                                                              CSC042
     C           B         IFEQ 0                                                             CSC042
     C                     Z-ADD1         B                                                   CSC042
     C                     END                                                                CSC042
      *                                                                                       CSC042
      * If the branch being checked is the same then use these                                CSC042
      * details rather than doing a LOKUP                                                     CSC042
     C           ##KB      IFEQ ##BR,B                                                        CSC042
      * Found so seton 30                                                                     CSC042
     C                     SETON                         30                                   CSC042
     C                     ELSE                                                               CSC042
     C                     Z-ADD1         B                                                   CSC042
     C           ##KB      LOKUP##BR,B                   30                                   CSC042
     C                     END                                                                CSC042
      *                                                                                       CSC042
      * Save the last update to B                                                             CSC042
     C           *IN30     IFEQ *ON                                                           CSC042
     C                     Z-ADDB         ##BSV                                               CSC042
      * Set the indicator to show the data was found                                          CSC042
     C                     MOVEL'Y'       ##FIC                                               CSC042
     C                     END                                                                CSC042
      *                                                                                       CSC042
      * Reset the state of indicator 30.                                                      CSC042
     C           #IN30     IFEQ 'Y'                                                           CSC042
     C                     MOVEL*ON       *IN30                                               CSC042
     C                     ELSE                                                               CSC042
     C                     MOVEL*OFF      *IN30                                               CSC042
     C                     END                                                                CSC042
      *                                                                                       CSC042
     C                     ENDSR                                                              CSC042
      ********************************************************************                    CSC042
      /EJECT                                                                                  CSC042
      ********************************************************************                    CSC042
      *                                                                                       CSC042
      * ##SETB - Sets up the SDBRCHPD fields used in the code from the                        CSC042
      * arrays                                                                                CSC042
      *                                                                                       CSC042
     C           ##SETB    BEGSR                                                              CSC042
      *                                                                                       CSC042
     C                     MOVEL##BR,B    A8BRCD                                              CSC042
     C                     MOVEL##BC,B    CMPYM                                               CSC042
      *                                                                                       CSC042
     C                     ENDSR                                                              CSC042
      *                                                                                       CSC042
      ********************************************************************                    CSC042
      /EJECT                                                                                  CSC042
      ********************************************************************                    CSC042
      *                                                                                       CSC042
      * ##ADDB - Adds the SDBRCHPD fields used in the code to the                             CSC042
      * arrays                                                                                CSC042
      *                                                                                       CSC042
     C           ##ADDB    BEGSR                                                              CSC042
      *                                                                                       CSC042
      * If there is still room in the array then add the details                              CSC042
     C           ##BNDX    IFLT 999                                                           CSC042
     C                     ADD  1         ##BNDX                                              CSC042
     C                     Z-ADD##BNDX    B                                                   CSC042
     C                     MOVELA8BRCD    ##BR,B                                              CSC042
     C                     MOVELCMPYM     ##BC,B                                              CSC042
     C                     END                                                                CSC042
      *                                                                                       CSC042
      * Update ##BSV  so next call to ##CHKB checks this latest adddition                     CSC042
      * to the array first                                                                    CSC042
     C                     Z-ADDB         ##BSV                                               CSC042
      *                                                                                       CSC042
     C                     ENDSR                                                              CSC042
      ********************************************************************                    CSC042
      /EJECT                                                                                  CSC042
      ********************************************************************                    CSC042
0828 C*****SUBROUTINE*TO*CHAIN*TO*S/CLINT*********                        S01194
0829 C**   CALLED FROM - MAIN PROCESSING                                  S01194
0830 C**                                                                  S01194
0831 C           CUSCHN    BEGSR                           **CUSCHN**     S01194
     C                     CALL 'AOCUSTR0'                                S01194
     C                     PARM '*MSG   ' @RTCD   7                       S01194
     C                     PARM '*KEY   ' @OPTN   7                       S01194
     C                     PARM           KEYC   10                       S01194
     C                     PARM '*CNUM'   KEYSTS  7                       S01194
     C           SDCUST    PARM SDCUST    DSSDY                           S01194
     C*                                                                   S01194
     C           @RTCD     COMP *BLANKS                  20               S01194
0832 C**                                                                  S01194
0833 C***********CUSKEY    CHAINCLINT                50                   S01194
0834 C**N20***********     MOVE CUSKEY    DBKEY                           S01194
0835 C**N20***********     MOVE 'CLINT'   DBFILE                          S01194
0835 C  N20                MOVE 'SDCUSTPD'DBFILE                          S01194
0836 C  N20                MOVE KEYC      DBKEY
0837 C                     ENDSR
0838 C********************************************************************
0839 C********************************************************************
0840 C**   SUBROUTINE TO MAINTAIN RUN CONTROLS FOR LOAN TYPE EXTRACT
0841 C**   CALLED FROM- MAIN PROCESSING
0842 C**   CALLS - GLZADD
0843 C**
0844 C           CONTR1    BEGSR                           **CONTR1**
0845 C**
0846 C           COUNT5    ADD  1         COUNT5  50
0847 C**
0848 C                     Z-ADDHSHWN5    ZZTOTI
0849 C                     Z-ADDHSHDC5    ZZTOTD
0850 C                     EXSR GLZADD
0851 C                     Z-ADDZZTOTI    HSHWN5 150
0852 C                     Z-ADDZZTOTD    HSHDC5  30
0853 C**
0854 C                     ENDSR
0855 C********************************************************************
0856 C********************************************************************
0857 C**   SUBROUTINE TO MAINTAIN RUN CONTROLS FOR FAC. TYPE EXTRACT
0858 C**   CALLED FROM - MAIN PROCESSING
0859 C**   CALLS - GLZADD
0860 C**
0861 C           CONTR2    BEGSR                           ** CONTR2**
0862 C**
0863 C           COUNT6    ADD  1         COUNT6  50
0864 C**
0865 C                     Z-ADDHSHWN6    ZZTOTI
0866 C                     Z-ADDHSHDC6    ZZTOTD
0867 C                     EXSR GLZADD
0868 C                     Z-ADDZZTOTI    HSHWN6 150
0869 C                     Z-ADDZZTOTD    HSHDC6  30
0870 C**
0871 C                     ENDSR
0872 C********************************************************************
0873 C/SPACE 3
0874 C********************************************************************
0875 C* SUBROUTINE TO ADD AN AMOUNT (ZZAMT) TO THE TOTAL (ZZTOTI,ZZTOTD)
0876 C*   IND '99' IS SET BY AN OVERFLOW ERROR
0877 C*
0878 CSR         GLZADD    BEGSR                           *** GLZADD ****
0879 C*
0880 CSR                   Z-ADDZZAMT     ZZAMT  153     91-DEFINE ZZAMT
0881 CSR 91                GOTO ZZAEND                     AMT = 0.BYPASS
0882 C*
0883 C* SPLIT ZZAMT INTO INTEGER AND DECIMAL FIELDS
0884 CSR                   Z-ADDZZAMT     ZZAMTI 150       INTEGER FIELD
0885 CSR                   MOVE ZZAMT     ZZAMTD  30       DECIMAL FIELD
0886 C* BOTH ZZAMTI AND ZZAMTD CONTAIN A 'SIGN' ZONE NOW
0887 C*
0888 CSR                   EXSR GLZSUM
0889 CSR         ZZAEND    ENDSR                           ** ZZAEND TAG *
0890 C*
0891 C********************************************************************
0892 C********************************************************************
0893 C* SUBROUTINE TO CARRY OUT THE ADDITION FOR SUBROUTINES -
0894 C*                        GLZADD, GLZSUB, GLZCMP.
0895 C*          PARAMETERS PASSED -
0896 C*                     I/P ZZAMTI ZZAMTD
0897 C*                     O/P ZZTOTI ZZTOTD ZZNEGD IND 96 IND 99.
0898 C*
0899 CSR         GLZSUM    BEGSR                           *** GLZSUM ****
0900 C*
0901 CSR                   Z-ADDZZTOTI    ZZTOTI 150       DEFINE ZZTOTI
0902 CSR                   Z-ADDZZTOTD    ZZTOTD  30       DEFINE ZZTOTD
0903 CSR                   SETOF                     919293
0904 CSR                   SETOF                     949599
0905 C*
0906 C*    DETERMINE SIGN OF ZZAMTI & D,   92 IF NEG
0907 CSR         ZZAMTI    COMP 0                      9293
0908 CSR 93      ZZAMTD    COMP 0                      9293
0909 CSR 93                GOTO ZZSEND                     ZERO BYPASS
0910 C*
0911 C*    DETERMINE SIGN OF ZZTOTI & D, 91 IF NEG.
0912 CSR         ZZTOTI    COMP 0                      9193
0913 CSR 93      ZZTOTD    COMP 0                      9193
0914 C*
0915 C*    IF ZZTOTAL IS ZERO, RETURN ZZAMOUNT.
0916 CSR 93                Z-ADDZZAMTI    ZZTOTI
0917 CSR 93                Z-ADDZZAMTD    ZZTOTD
0918 CSR 93                GOTO ZZSEND                     ZERO BYPASS
0919 C*    IF SIGNS DIFFER BYPASS OVERFLOW CHECKS.
0920 CSR 91N92
0921 CORN91 92             GOTO ZZOFPS
0922 C*
0923 CSR         ZZAMTD    ADD  ZZTOTD    ZZWK2   40
0924 CSR         ZZWK2     COMP 999                  93    '93' = CARRY
0925 CSRN93      ZZWK2     COMP -999                   93    INTO INTEGER.
0926 C*
0927 CSR 93N92   ZZAMTI    ADD  1         ZZWK3  150       ADD 'CARRY' +VE
0928 CSR    93 92ZZAMTI    SUB  1         ZZWK3            SUB 'CARRY' -VE
0929 CSR 93      ZZTOTI    ADD  ZZWK3     ZZWK3
0930 CSRN93      ZZTOTI    ADD  ZZAMTI    ZZWK3
0931 C*
0932 C* IF THE MODULUS OF ZZWK3 IS LT MOD. ZZTOTI THEN O/F HAS OCCURED
0933 CSRN92      ZZWK3     COMP ZZTOTI                 99  -92 MEANS NOS.
0934 CSR 92      ZZWK3     COMP ZZTOTI               99     NEGATIVE
0935 CSRN99                Z-ADDZZWK2     ZZTOTD
0936 CSRN99                Z-ADDZZWK3     ZZTOTI
0937 C*
0938 C* IF O/F ZEROIZE ZZAMT , IND '99' SET AND ZZTOT FIELDS LEFT INTACT.
0939 CSR 99                Z-ADD0         ZZAMT  153
0940 CSR                   GOTO ZZSEND
0941 C*
0942 C* THE 'SIGNS' ARE DIFFERENT
0943 CSR         ZZOFPS    TAG                             ** ZZOFPS TAG**
0944 C* IF ZZAMT WAS NEGATIVE, MAKE IT POS. TO COMP WITH ZZTOT
0945 C*
0946 CSR 92                Z-SUBZZAMTI    ZZAMTI 150
0947 CSR 92                Z-SUBZZAMTD    ZZAMTD  30
0948 C*
0949 C* IF ZZTOT WAS NEGATIVE, MAKE IT POS. TO COMP WITH ZZAMT.
0950 C*
0951 CSR 91                Z-SUBZZTOTI    ZZTOTI
0952 CSR 91                Z-SUBZZTOTD    ZZTOTD
0953 C* BOTH ZZAMT AND ZZTOT ARE NOW POSITIVE.
0954 C*
0955 CSR         ZZTOTI    COMP ZZAMTI               93  95
0956 CSR 95      ZZTOTD    COMP ZZAMTD               93  95
0957 C*
0958 C* IF ZZTOT EQ. ZZAMT RETURN ZERO.
0959 CSR 95                Z-ADD0         ZZTOTI
0960 CSR 95                Z-ADD0         ZZTOTD
0961 CSR 95                GOTO ZZSEND
0962 C*
0963 C* IF ZZTOT GT. ZZAMT.
0964 CSR 93      ZZAMTD    COMP ZZTOTD               94
0965 CSR 93 94   ZZTOTI    SUB  1         ZZTOTI
0966 CSR 93 94   ZZTOTD    ADD  1000      ZZWK2
0967 CSR 93      ZZTOTI    SUB  ZZAMTI    ZZTOTI
0968 CSR 93 94   ZZWK2     SUB  ZZAMTD    ZZTOTD
0969 CSR 93N94   ZZTOTD    SUB  ZZAMTD    ZZTOTD
0970 C*
0971 C*
0972 C* IF ZZAMT GT. ZZTOT.
0973 CSRN93      ZZTOTD    COMP ZZAMTD               94
0974 CSRN93 94   ZZAMTI    SUB  1         ZZWK3  150
0975 CSRN93 94   ZZAMTD    ADD  1000      ZZWK2
0976 CSRN93 94   ZZWK3     SUB  ZZTOTI    ZZTOTI
0977 CSRN93N94   ZZAMTI    SUB  ZZTOTI    ZZTOTI
0978 CSRN93 94   ZZWK2     SUB  ZZTOTD    ZZTOTD
0979 CSRN93N94   ZZAMTD    SUB  ZZTOTD    ZZTOTD
0980 C*
0981 C* REVERSE SIGN OF ZZTOT IF LARGER I/P FIELDS WERE NEGATIVE
0982 CSR                   SETOF                     94
0983 CSR 93 91
0984 CORN93 92             SETON                     94
0985 CSR 94                Z-SUBZZTOTI    ZZTOTI
0986 CSR 94                Z-SUBZZTOTD    ZZTOTD
0987 C**
0988 C**   RESTORE SIGN OF ZZAMTI & ZZAMTD IF IT WAS REVERSED.
0989 CSR 92                Z-SUBZZAMTI    ZZAMTI
0990 CSR 92                Z-SUBZZAMTD    ZZAMTD
0991 CSR         ZZSEND    TAG                             ** ZZSEND TAG *
0992 C**
0993 C**   IF ZZTOTD IS ZERO, AND ZZTOTI IS NEG. SET UP ZZNEGD.
0994 CSR                   SETOF                     96
0995 CSR         ZZTOTD    COMP 0                        91
0996 CSR 91      ZZTOTI    COMP 0                      96
0997 CSR 96                MOVE '.000-'   ZZNEGD  5
0998 CSR                   ENDSR                             ** ENDSR **
0999 C********************************************************************
1000 C********************************************************************
1001 C**
1002 C**   ZSYSTM SR. TO CHAIN TO THE INSTALLATION CONTROL DATA RECORD.
1003 C**
1004 C           ZSYSTM    BEGSR                           *** ZSYSTM ***
1005 C**
1006 C*****SET*UP*KEY*FOR*INSTALLATION*CONTROL*RECORD.******              S01194
1007 C************         MOVEL'01      'ZTABKY 12                       S01194
1008 C************         MOVE '  10'    ZTABKY                          S01194
1009 C**                                                                  S01194
1010 C***********ZTABKY    CHAINTABLE                99    ON NOT THERE   S01194
1011 C**N99******RECI      COMP 'D'                  9999  ON, IS DELETED S01194
1012 C**                                                                  S01194
      ** ACCESS BANK DETAILS                                              S01194
     C                     CALL 'AOBANKR0'                                S01194
     C                     PARM '*MSG    '@RTCD   7                       S01194
     C                     PARM '*FIRST ' @OPTN   7                       S01194
     C           SDBANK    PARM SDBANK    DSFDY                           S01194
     C           @RTCD     COMP *BLANKS              9999                 S01194
1013 C**   CHECK SYSTEM DATE FORMAT, DDMMYY OR MMDDYY.
1014 C           DATF      COMP 'M'                      98MMDDYY, 98 ON
1015 C**
1016 C                     ENDSR
1017 C**
1019 C********************************************************************
     C*                                                                                       190571
     C*  SRMFU -  Process Manual Facility Utilisation records.                                190571
     C*                                                                                       190571
     C*  CALLED FROM: Main Processing                                                         190571
     C*                                                                                       190571
     C*  CALLS: EXTMFU                                                                        190571
     C*                                                                                       190571
     C********************************************************************                    190571
     C*                                                                                       190571
     C           SRMFU     BEGSR                           ** SRMFU **                        190571
     C*                                                                                       190571
     C                     READ LEMNFUL0                 80                                   190571
     C           *IN80     DOWNE'1'                                                           190571
      *                                                                                       190571
      ** Process live records.                                                                190571
      *                                                                                       190571
     C           RECI      IFEQ 'D'                                                           190571
     C                     EXSR EXTMFU                                                        190571
     C                     ENDIF                                                              190571
      *                                                                                       190571
     C                     READ LEMNFUL0                 80                                   190571
      *                                                                                       190571
     C                     ENDDO                                                              190571
      *                                                                                       190571
      ** Check hash totals and record count                                                   190571
      *                                                                                       190571
     C                     READ LEMNFUZZ                 80                                   190571
     C           COUNTM    COMP NLRAM                U8U8                                     190571
     C     NU8   HSHWNM    COMP VLAFM                U8U8                                     190571
     C     NU8   HSHDCM    COMP VLALM                U8U8                                     190571
     C      U8             SETON                     64                                       190571
      *                                                                                       190571
     C                     ENDSR                           ** SRMFU **                        190571
     C*                                                                                       190571
     C********************************************************************                    190571
     C********************************************************************                    190571
     C*                                                                                       190571
     C*  EXTMFU -  Extract Manual Facility Utilisation records.                               190571
     C*                                                                                       190571
     C*  CALLED FROM: SRMFU                                                                   190571
     C*                                                                                       190571
     C*  CALLS: GLZADD, CONTR1, CMPYCD, CUSCHN                                                190571
     C*                                                                                       190571
     C********************************************************************                    190571
     C*                                                                                       190571
     C           EXTMFU    BEGSR                           ** EXTMFU **                       190571
      *                                                                                       190571
      **   Perform record count & hash totalling                                              190571
      *                                                                                       190571
     C           COUNTM    ADD  1         COUNTM  50                                          190571
     C                     Z-ADDHSHWNM    ZZTOTI                                              190571
     C                     Z-ADDHSHDCM    ZZTOTD                                              190571
      *                                                                                       190571
      **   If amount is negative, reverse sign                                                190571
      *                                                                                       190571
     C           UAMT      DIV  1000      ZZAMT                                               190571
     C           ZZAMT     IFLT *ZEROS                                                        190571
     C                     Z-SUBZZAMT     ZZAMT                                               190571
     C                     ENDIF                                                              190571
     C                     EXSR GLZADD                                                        190571
     C                     Z-ADDZZTOTI    HSHWNM 150                                          190571
     C                     Z-ADDZZTOTD    HSHDCM  30                                          190571
      *                                                                                       190571
      **   Perform record count & hash totals for extract file.                               190571
      **   If amount is negative, reverse sign.                                               190571
      *                                                                                       190571
     C           UAMT      DIV  1000      ZZAMT                                               190571
     C           ZZAMT     IFLT *ZEROS                                                        190571
     C                     Z-SUBZZAMT     ZZAMT                                               190571
     C                     ENDIF                                                              190571
     C                     EXSR CONTR1                                                        190571
      *                                                                                       190571
      ** Chain to Facilities file                                                             190571
      *                                                                                       190571
     C********** WKFAC     CHAINFCLTYL0              89                                190571 259282
     C           WKFAC     CHAINFCLTYL1              89                                       259282
      *                                                                                       190571
     C           *IN89     IFEQ '1'                                                           190571
     C           *LOCK     IN   LDA                                                           190571
     C                     MOVEL'FCLTY   'DBFILE           ************                       190571
     C                     Z-ADD12        DBASE            * DBERR 12 *                       190571
     C                     MOVELFCTREC    DBKEY            ************                       190571
     C                     OUT  LDA                                                           190571
     C                     EXSR *PSSR                                                         190571
     C                     ENDIF                                                              190571
      *                                                                                       190571
      ** Obtain company name from branch file                                                 190571
      *                                                                                       190571
     C**********           MOVE BRCA      FCLB                                         190571 259282
     C                     MOVE BRCAM     FCLB                                                259282
     C                     EXSR CMPYCD                                                        190571
      *                                                                                       190571
      ** Obtain country of location from customer file                                        190571
      *                                                                                       190571
     C**********           MOVE CNUMM     KEYC                                         190571 259282
     C                     MOVELCNUMM     KEYC                                                259282
     C                     EXSR CUSCHN                                                        190571
      *                                                                                       190571
     C                     EXCPTEXMFU                                                         190571
      *                                                                                       190571
     C                     ENDSR                           ** EXTMFU **                       190571
     C*                                                                                       190571
     C********************************************************************S01117
     C*                                                                   S01117
     C*  *PSSR --- SUBROUTINE TO HANDLE ABNORMAL ERROR CONDITIONS         S01117
     C*                                                                   S01117
     C*  CALLED FROM: AFTER ABNORMAL OPERATION OCCURS                     S01117
     C*                                                                   S01117
     C*  CALLS: NOTHING                                                   S01117
     C*                                                                   S01117
     C********************************************************************S01117
     C*                                                                   S01117
     C           *PSSR     BEGSR                           ** *PSSR **    S01117
     C*                                                                   S01117
     C           @RUN      IFEQ *BLANKS                                   S01117
     C                     MOVE 'Y'       @RUN    1                       S01117
     C                     DUMP                                           S01117
     C                     END                                            S01117
     C                     ENDSR                           ** *PSSR **    S01117
     C*                                                                   S01117
     C********************************************************************S01117
1020 OFACEXHH D        01
1021 O                                    1 'H'
1022 O**   FACILITY TYPE RECORD
1023 OFACEXFC D        60
1024 O                                    1 'D'
1025 O***********              BRCD       4                               S01117
1025 O                         BRCA       4                               S01117
1026 O                         CPAR      10
1027 O                       07CNUM      16
1028 O****************       10BWCN      16                               S01339
1029 O                       07FACT      19
1030 O                       07FCNO      21
1031 O****************       10LNRF      22                               S01339
1032 O                                   23 'F'
1033 O                       07FCCY      26
1034 O****************       10CMCY      26                               S01339
     O                       07RECIF     27                               S01117
1035 O                       07FAMT      34P
     O****************       10TCMA      34P                              S01339
     O                       07PEXP      41P
     O**********          11 07CEXP      41P                                         220263 AR677799
     O**********          11 07CEXP      41P                                      AR989943 AR989943A
     O**********          11 07CAMD      41P                                      AR989943A MD029793
     O****************       10TDNA      41P                              S01339
1039 O                       07CALC1     48P
     O****************       10TUNA      48P                              S01339
1041 O                       07          49 'F'
1042 O****************       10          49 'C'                           S01339
1043 O                       07FCTI      50
1044 O****************       10          50 'C'                           S01339
1045 O                       07FAMT      57P
1046 O****************       10TTCA      57P                              S01339
1047 O                         CRNM      77
     O***********            07RECIF     78                               S01117
1047 O                         CMPYM     80                               S01117
     O                         FCLB      83                               S01117
      *                                                                   CLE004
      ** Participant indicator                                            CLE004
     O                       67PRTR     100                               CLE004
      *                                                                   CLE004
     O**   LOAN TYPE RECORD
     OFACEXFA D        61
     O                                    1 'D'
     O***********              BRCD       4                               S01117
     O                         BRCA       4                               S01117
     O***********            03FCUS      16                               CLE004
     O                   N68 03FCUS      16                               CLE004
     O                    68 03PTFC      16                               CLE004
     O****************       11BWCN      16                               S01339
     O***********            03FTYP      19                               CLE004
     O                   N68 03FTYP      19                               CLE004
     O                    68 03PTFT      19                               CLE004
     O***********            03FSEQ      21                               CLE004
     O                   N68 03FSEQ      21                               CLE004
     O                    68 03PTFN      21                               CLE004
     O****************       11LNRF      22                               S01339
     O                                   23 'L'
     O                       03CCY       26
     O****************       11DDCY      26                               S01339
     O                       03CPAM      33P
     O****************       11TDDA      33P                              S01339
     O                         CRSK      35
     O                         CLOC      37
     O                       03MDAT      40P
     O****************       11MATD      40P                              S01339
     O                         FCLB      43                               S01117
     O                         CMPYM     62                               S01117
     O                       03PTYP      64
     O                       03LTYP      66
     O                       03SUTP      68
     O                    03 66OLNO      74
     O                    03N66LNRF      74
     O****************       11DDRF      74                               S01339
     O                       03LNRF      80
     O****************       11DDRF      80                               S01339
     O                       03CLAS      84                                                   CLE042
     O                         PCRF      99                                                   244459
     O                         LPFI     100                                                   244459
     O        E        44      EXMFU                                                          190571
     O                                    1 'D'                                               190571
     O                         BRCAM      4                                                   190571
     O                                   10 '      '                                          190571
     O                         CNUMM     16                                                   190571
     O                         FACTM     19                                                   190571
     O                         FCNOM     21                                                   190571
     O                                   22 ' '                                               190571
     O                                   23 'M'                                               190571
     O                         UCCY      26                                                   190571
     O                         UAMT      33P                                                  190571
     O                         CRSK      35                                                   190571
     O                         CLOC      37                                                   190571
     O                         EXDT      40P                                                  190571
     O                         FCLB      43                                                   190571
     O                         ZZ016     59                                                   190571
     O                         CMPYM     62                                                   190571
     O                                   68 '      '                                          190571
     O                                   74 '      '                                          190571
     O                         SQNO      77                                                   190571
     O                                   80 '   '                                             190571
     O*                                                                   S01408
     O/COPY WNCPYSRC,LE0700OOPG                                           S01408
     O*                                                                   S01408
      *                                                                   CLE059
      *** Header record                                                   CLE059
      *                                                                   CLE059
     OFACEXHHAD        01 70                                              CLE059
     O                                    1 'H'                           CLE059
      *                                                                   CLE059
      *** Facility type record                                            CLE059
      *                                                                   CLE059
     OFACEXFCAD        60 70                                              CLE059
     O                                    1 'D'                           CLE059
     O                         BRCA       4                               CLE059
     O                         CPAR      10                               CLE059
     O                       07CNUM      16                               CLE059
     O                       07FACT      19                               CLE059
     O                       07FCNO      21                               CLE059
     O                                   23 'F'                           CLE059
     O                       07FCCY      26                               CLE059
     O                       07RECIF     27                               CLE059
     O                       07FAMT      34P                              CLE059
     O                       07PEXP      41P                              CLE059
     O**********          11 07CEXP      41P                                      AR989943 AR989943A
     O**********          11 07CAMD      41P                                      AR989943A MD029793
     O                       07CALC1     48P                              CLE059
     O                       07          49 'F'                           CLE059
     O                       07FCTI      50                               CLE059
     O                       07FAMT      57P                              CLE059
     O                         CRNM      77                               CLE059
     O                         CMPYM     80                               CLE059
     O                         FCLB      83                               CLE059
     O                       67PRTR     100                               CLE059
     O                         PRFC     104                               CLE059
      *                                                                   CLE059
      *** Loan type record                                                CLE059
      *                                                                   CLE059
     OFACEXFAAD        61 70                                              CLE059
     O                                    1 'D'                           CLE059
     O                         BRCA       4                               CLE059
     O                   N68 03FCUS      16                               CLE059
     O                    68 03PTFC      16                               CLE059
     O                   N68 03FTYP      19                               CLE059
     O                    68 03PTFT      19                               CLE059
     O                   N68 03FSEQ      21                               CLE059
     O                    68 03PTFN      21                               CLE059
     O                                   23 'L'                           CLE059
     O                       03CCY       26                               CLE059
     O                       03CPAM      33P                              CLE059
     O                         CRSK      35                               CLE059
     O                         CLOC      37                               CLE059
     O                       03MDAT      40P                              CLE059
     O                         FCLB      43                               CLE059
     O                         CMPYM     62                               CLE059
     O                       03PTYP      64                               CLE059
     O                       03LTYP      66                               CLE059
     O                       03SUTP      68                               CLE059
     O                    03 66OLNO      74                               CLE059
     O                    03N66LNRF      74                               CLE059
     O                       03LNRF      80                               CLE059
     O                         CRNM     100                               CLE059
     O                         PRFC     104                               CLE059
      *                                                                   CLE059
      *** Trailer record                                                  CLE059
      *                                                                   CLE059
     OFACEXT4AT        LRNU8 70                                           CLE059
     O                                    1 'T'                           CLE059
     O                         COUNT5     4P                              CLE059
     O                         HSHWN5    12P                              CLE059
     O                         HSHDC5    14P                              CLE059
     O                         COUNT6    17P                              CLE059
     O                         HSHWN6    25P                              CLE059
     O                         HSHDC6    27P                              CLE059
1074 OFACEXT4 T        LRNU8
1075 O                                    1 'T'
1076 O                         COUNT5     4P
1077 O                         HSHWN5    12P
1078 O                         HSHDC5    14P
1079 O                         COUNT6    17P
1080 O                         HSHWN6    25P
1081 O                         HSHDC6    27P
8882 O*E0700P1T** 03   LR                                       S01124    S01117
8882 OLE0700AUT   03   LR                                                 S01117
1083 O***********                        22 'REFERENCE  LE0700'           S01117
1083 O                                   24 'REFERENCE  LE0700AU'         S01117
1084 O                         TITL      89
1085 O                                  104 'DATE'
1086 O                         RUNA     112
1087 O                                  127 'PAGE    1'
1088 O        T   05   LR
1089 O                                   57 'COMMITMENT,FACILITY & LO'
1090 O                                   81 'AN DETAILS EXTRACT - FIL'
1091 O                                   91 'E CONTROLS'
1092 O        T   06   LR
1093 O                                   57 '------------------------'
1094 O                                   81 '------------------------'
1095 O                                   91 '----------'
1096 O        T   09   LR
1097 O                                   28 'S/FACEX - RUN CONTROLS'
1098 O                                   59 'NUMBER'
1099 O                                   84 'VALUE'
1100 O                                  110 'FAC/CMMT TYPE RECORDS'
1101 O        T   10   LR
1102 O                                   28 '----------------------'
1103 O                                   59 'OF RECORDS'
1104 O                                   84 'OF RECORDS'
1105 O                                  110 '---------------------'
1106 O        T   12   LR
1107 O                                   29 'TOTAL RECORDS ON FILE'
1108 O                         COUNT63   59
1109 O                         HSHWN64   81
1110 O                         HSHDC6    84
1111 O        T   15   LR
1112 O                                   28 'S/FACEX - RUN CONTROLS'
1113 O**********                        106 'LOAN TYPE RECORDS'                               190571
     O                                  110 'LOAN/MFU TYPE RECORDS'                           190571
1114 O        T   16   LR
1115 O                                   28 '----------------------'
1116 O**********                        106 '-----------------'                               190571
     O                                  110 '---------------------'                           190571
1117 O        T   18   LR
1118 O                                   29 'TOTAL RECORDS ON FILE'
1119 O                         COUNT53   59
1120 O                         HSHWN54   81
1121 O                         HSHDC5    84
1122 O********T***21***LR U1                                              S01339
1123 O*****************                  28 'S/LOANS - RUN CONTROLS'      S01339
1124 O*****************                 107 'COMMITMENT RECORDS'          S01339
1125 O********T***22***LR U1                                              S01339
1126 O*****************                  28 '----------------------'      S01339
1127 O*****************                 107 '------------------'          S01339
1128 O********T***24***LR U1                                              S01339
1129 O*****************                  29 'TOTAL RECORDS ON FILE'       S01339
1130 O*****************     NU7NORE3 3   59                               S01339
1131 O*****************     NU7HRWN3 4   81                               S01339
1132 O*****************     NU7HRDC3     84                               S01339
1133 O********T***26***LR U1                                              S01339
1134 O*****************                  29 'TOTAL RECORDS ON FILE'       S01339
1135 O*****************                  42 '- CALCULATED'                S01339
1136 O*****************        COUNT33   59                               S01339
1137 O*****************        HSHWN34   81                               S01339
1138 O*****************        HSHDC3    84                               S01339
1139 O*****************      64         111 '***   DIFFERENCE   ***'      S01339
     O********T***29***LR U1                                              S01339
1141 O*****************                  28 'S/LOANS - RUN CONTROLS'      S01339
1142 O*****************                 105 'DRAWDOWN RECORDS'            S01339
     O********T***30***LR U1                                              S01339
1144 O*****************                  28 '----------------------'      S01339
1145 O*****************                 105 '----------------'            S01339
     O********T***32***LR U1                                              S01339
1147 O*****************                  29 'TOTAL RECORDS ON FILE'       S01339
1148 O*****************     NU7NORE4 3   59                               S01339
1149 O*****************     NU7HRWN4 4   81                               S01339
1150 O*****************     NU7HRDC4     84                               S01339
     O********T***34***LR U1                                              S01339
1152 O*****************                  29 'TOTAL RECORDS ON FILE'       S01339
1153 O*****************                  42 '- CALCULATED'                S01339
1154 O*****************        COUNT43   59                               S01339
1155 O*****************        HSHWN44   81                               S01339
1156 O*****************        HSHDC4    84                               S01339
1157 O*****************      65         111 '***   DIFFERENCE   ***'      S01339
1158 O********T***37***LR                                                 S01339
1158 O        T   21   LR                                                 S01339
1159 O                                   28 'S/FCLTY - RUN CONTROLS'
1160 O********T***38***LR                                                 S01339
1160 O        T   22   LR                                                 S01339
1161 O                                   28 '----------------------'
1162 O********T***40***LR                                                 S01339
1162 O        T   24   LR                                                 S01339
1163 O                                   29 'TOTAL RECORDS ON FILE'
1164 O                      NU7NORE2 3   59
1165 O                      NU7VLAF2 4   81
1166 O                      NU7VLAL2     84
1167 O********T***42***LR                                                 S01339
1167 O        T   26   LR                                                 S01339
1168 O                                   29 'TOTAL RECORDS ON FILE'
1169 O                                   42 '- CALCULATED'
1170 O                         COUNT23   59
1171 O                         HSHWN24   81
1172 O                         HSHDC2    84
1173 O                       63         111 '***   DIFFERENCE   ***'
1174 O********T***45***LR                                                 S01339
1174 O        T   29   LR                                                 S01339
1175 O                                   28 'S/CLOAN - RUN CONTROLS'
1176 O********T***46***LR                                                 S01339
1176 O        T   30   LR                                                 S01339
1177 O                                   28 '----------------------'
1178 O********T***48***LR                                                 S01339
1178 O        T   32   LR                                                 S01339
1179 O                                   29 'TOTAL RECORDS ON FILE'
1180 O                      NU7NORE1 3   59
1181 O                      NU7VLAF1 4   81
1182 O                      NU7VLAL1     84
1183 O********T***50***LR                                                 S01339
1183 O        T   34   LR                                                 S01339
1184 O                                   29 'TOTAL RECORDS ON FILE'
1185 O                                   42 '- CALCULATED'
1186 O                         COUNT13   59
1187 O                         HSHWN14   81
1188 O                         HSHDC1    84
1189 O                       62         111 '***   DIFFERENCE   ***'
     O        T   37   LR                                                                     190571
     O                                   26 'S/MFU - RUN CONTROLS'                            190571
     O        T   38   LR                                                                     190571
     O                                   26 '--------------------'                            190571
     O        T   40   LR                                                                     190571
     O                                   28 'LIVE RECORDS ON FILE'                            190571
     O                      NU7NLRAM 3   59                                                   190571
     O                      NU7VLAFM 4   81                                                   190571
     O                      NU7VLALM     84                                                   190571
     O        T   42   LR                                                                     190571
     O                                   28 'LIVE RECORDS ON FILE'                            190571
     O                                   41 '- CALCULATED'                                    190571
     O                         COUNTM3   59                                                   190571
     O                         HSHWNM4   81                                                   190571
     O                         HSHDCM    84                                                   190571
     O                       64         111 '***   DIFFERENCE   ***'                          190571
1190 O        T 32     LR U7
1191 O                                   51 '*** REFERENCE LE0700'
1192 O                                   71 '- DATABASE ERROR AT'
1193 O**********               DBASE     74                               S01117
1193 O                         DBASE     75                               S01117
1194 O        T        LR U7
1195 O                                   37 'FILENAME'
1196 O**********               DBFILE    43                               S01117
1196 O                         DBFILE    46                               S01117
1197 O**********                         48 'KEY'                         S01117
1197 O                                   51 'KEY'                         S01117
1198 O**********               DBKEY     78                               S01117
1198 O                         DBKEY     81                               S01117
1199 O******* T 3      LR                                                 S01117
1200 O*******                            76 '*** END OF REPORT ***'       S01117
** CPY@   **      OBJECT COPYRIGHT
(c) Misys International Banking Systems Ltd. 2001
