0001 H        1                                                           S01117
      *****************************************************************
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas LE Loans shadow post extract')                   *
0001 H***********                                                         S01117
0002 F********************************************************************LE0820
     F*                                                                  *LE0820
     F*  Midas Customer Lending Module                                S01194
0005 F*                                                                  *LE0820
0006 F*       LE0820 - SHADOW POST EXTRACT                               *LE0820
0007 F*                                                                  *LE0820
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. AR375891A          Date 26Aug20               *
      *  Prev Amend No. 261881A            Date 09Mar10               *
      *                 261881             Date 19Nov09               *
      *                 MD031174           Date 12Mar20               *
      *                 MD054877           Date 10Jan20               *
      *                 AR1096915          Date 10Jan20               *
      *                 MD054101           Date 08Aug19               *
      *                 MD053950           Date 16Jul19               *
      *                 MD053873           Date 10Jul19               *
      *                 MD052216           Date 04Apr19               *
      *                 CER050             Date 16Jun19               *
      *                 AR897086           Date 24Jan19               *
      *                 MD051891           Date 05OCt18               *
      *                 MD046248           Date 27Oct17               *
      *                 CLE154             Date 06Aug12               *
      *                 CLE141A            Date 28Apr16               *
      *                 CLE141             Date 08Feb16               *
      *                 MD023860           Date 25Apr14               *
      *                 261191             Date 11Oct12               *
      *                 AR1022006          Date 01Aug12               *
      *                 AR548455           Date 01Aug12               *
      *                 CLE134             Date 01Aug12               *
      *                 CLE148             Date 23Jul12               *
      *                 CER049             Date 06Dec10               *
      *                 259640             Date 05May09               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      *                 CAP205             Date 16Mar10               *
      *                 CSC042             Date 16Feb09               *
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 237599             Date 20Apr06               *
      *                 237466             Date 24Mar06               *
      *                 237362             Date 07Mar06               *
      *                 CSD031             Date 10Apr06               *
      *                 CSD027             Date 09Dec05               *
      *                 222446             Date 06Jun06               *
      *                 157984             Date 06Jun06               *
      *                 181612             Date 06Jun06               *
      *                 BUG8552            Date 29Sep05               *
      *                 CLE042             Date 06Sep05               *
      *                 BUG8630            Date 16Sep05               *
      *                 220257             Date 24Oct03               *
      *                 CLE036             Date 22Sep03               *
      *                 BUG7568            Date 22Jun05               *
      *                 CLE025             Date 20Oct03               *
      *                 CGL029             Date 01Sep03               *
      *                 222373             Date 28Oct03               *
      *                 222187             Date 21Oct03               *
      *                 221683             Date 03Oct03               *
      *                 220257             Date 31Jul03               *
      *                 218992             Date 10Jul03               *
      *                 219230             Date 30Jun03               *
      *                 218782             Date 18Jun03               *
      *                 218262             Date 10Jun03               *
      *                 CLE033             Date 26Mar03               *
      *                 CLE031             Date 04Feb03               *
      *                 CGL020             Date 12Dec02               *
      *                 CRE009             Date 26Aug02               *
      * Midas Release 4.01.02 ----------------------------------------*
      *                 204452             Date 02May02               *
      * Midas Release 4.01 -------------------------------------------*
      *                 190995             Date 28Aug01               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 192289             Date 23Jul01               *
      * Midas DBA 3.05 -----------------------------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      * Midas DBA 3.03 -----------------------------------------------*
     F*                 155174             Date 15Jun00               *
      * Midas DBA 3.02 -----------------------------------------------*
     F*                 146132             Date 20Oct99               *
     F*                 163486             Date 14Oct99               *
      * Midas DBA 3.01 -----------------------------------------------*
     F*                 CLE009             Date 26Apr99               *
      *                 CGL007             Date 26Mar99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 030176             Date 01Dec97               *
      *                 074627             Date 29Oct97               *
     F*                 CLE005             DATE 22MAY97               *
     F*                 123275             DATE 23SEP97               *
     F*                 105140             DATE 18NOV96               *
     F*                 096084             DATE 17JAN96               *
     F*                 064773             DATE 28FEB94               *
     F*                 S01392             DATE 14SEP92               *
     F*                 S01194             DATE 16JAN90               *
     F*                 HK0000             DATE 14/11/89              *
0010 F*                 S01117             DATE 02/08/89              *S01117
0010 F*                 E12726             DATE 14/12/88              *LE0820
0010 F*                 E13500             DATE 09/06/88              *LE0820
     F*---------------------------------------------------------------*
      *                                                               *
      *  AR375891A - Fee for parts sold was tagged as Debit, where it *
      *              should be Credit. Check processing type of loan  *
      *              (Child: AR375892).                               *
      *  261881A- Failed component SCC0411 due to difference on value *
      *           of records. Amend program such that event amount for*
      *           future valued discount loans would be computed      *
      *           correctly.                                          *
      *  261881 - Incorrect Current Exposure Amount Drawn(CAMD) is    *
      *           projected on PF/FCLTYFN. Amend program such that    *
      *           for discount loans, system would post a single      *
      *           entry where event amount is principal amount less   *
      *           discount amount.                                    *
      *  MD031174 - Value date shadow Posting missing.                *
      *  MD054877 - Enhance fix AR1096915, to also exclude risk       *
      *             parts purchased & risk parts sold.                *
      *  AR1096915 - Generate shadow posting of maturity interest of  *
      *              risk/guarantee loan. (Child: AR1096916)          *
      *            - Applied for MD054877                             *
      *  MD054101 - When loan fee and CLE141 is ON, access CLOAN to   *
      *             ensure that correct currency/location combination *
      *             was used in holiday checking. Also, set fee pay   *
      *             ment date to FELPDT if it's greater than previous *
      *             rundate.                                          *
      *  MD053950 - Incorrect Value Date for fee payment when CLE031  *
      *             is ON and settlement currency is not blank.       *
      *             Include event types FX and FY in checking of the  *
      *             actual event date.                                *
      *  MD053873 - Set fee currency as first basis for checking      *
      *             currency holiday setup. Then, use settlement      *
      *             currency when CLE031 is ON and value is not blank *
      *  MD052216 - Lending Fee's Payment Due and Taken Day           *
      *  CER050 - Annualised Percentage Rate (Recompile)              *
      *  AR897086 - Cannot input negative all-in-rate on Lending.     *
      *             Allow input and computation for negative          *
      *             all-in-rate on Lending.                           *
      *           - Applied for MD034449                              *
      *           - Applied for MD052515                              *
      *  MD051891 - Double Projection for freq based principal        *
      *             repayment on retail account                       *
      *  MD046248 - Finastra Rebranding                               *
      *  CLE154 - Loan Repayment Schedule Enhancement (Recompile)     *
      *  CLE141A - CLE141 Change Control 1                            *
      *  CLE141 - Currency and Location Business Day Convention       *
      *           for LE Transactions                                 *
      *  MD023860 - Projected movement was not generated for Loan     *
      *  261191 - Double postings in PAMV for fees. Do not generate   *
      *           postings for interbranch events, and ensure posting *
      *           generated has correct branch code.                  *
      *         - Wrong narrative for fee postings in PAMV because    *
      *           LEFEED read (and not found¦) with wrong branch code.*
      *         - Also no projection needed if AUTO = 'N'             *
      *           Applied fix 254155                                  *
      *  AR1022006 - COB Performance Optimisation                     *
      *  AR548455 - Wrong narrative in projected movements details    *
      *           - Loan Ref in TNMR on RSACMTPD is incorrect. Ensure *
      *             TRAN06 is always initialised. Apply GEMS 261339.  *
      *             (Child: AR548456)                                 *
      *  CLE134 - Past Due Call Loan Processing                       *
      *  CLE148 - Alpha Loan Reference                                *
      *  CER049 - Stamp Tax                                           *
      *  259640 - Switch OFF *IN11 out of loan processing to correct  *
      *           posting date.                                       *
      *  CAP205 - Teller Related APIs - Account Balance Check         *
      *  CSC042 - COB performance. Best not to check MMOD every record*
      *           Once in first cycle should be enough. If modules are*
      *           being turned on and off during the COB we really   *
      *           have more trpuble than this pgm can cope with      *
      *  CSD031 - Enhanced Centralised Static Data (Recompile)        *
      *  237599 - Incorrect shadow posting when settlement branch is  *
      *           different from booking branch. Only post to settle- *
      *           ment account.  ANNOTATED AS 222446.                 *
      *  237466 - The value date show in projected accnt movements    *
      *           should be the actual interest/repayment date.       *
      *           Applied fix 236098.                                 *
      *  237362 - Duplicate repayment posting due to incorrect switch *
      *           off of *IN55 which controls output to RPOSTPD.      *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  222446 - Incorrect shadow posting when settlement branch is  *
      *           different from booking branch. Only post to settle- *
      *           ment account.                                       *
      *  157984 - Condition output to RPOSTPD for commitment fees.    *
      *  181612 - Exclude processing of events with zero amount.      *
      *  BUG8552 - Interest payment on holiday not shown on PAMV of   *
      *            next working day. Allow EDAT<RUND but not equal to *
      *            0 to be written to RPOSTPD. Set posting date equal *
      *            to next working date. (Based on fix 234914)        *
      *  CLE042 - Extended Loan Sub Type                              *
      *  BUG8630- Fee records in LEHOSTPD have corrupted data         *
      *  220257 - Negative amounts should be converted to positive    *
      *           for loan events as well as fee events               *
      *  CLE036 - Lending Enhancements for Nordea Phase 1 Priority 2: *
      *           Allow repayments in facility currency (Recompile)   *
      *  BUG7568 - Duplicate repayment posting for repayment types 1  *
      *            and 3.  Suppress output to RPOSTPD for events M2   *
      *            and R2                                             *
      *  CLE025 - Credit Lines (Recompile)                            *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  222373 - Parameter Mismatch                                  *
      *  222187 - LEHOSTPD entries should only be written for event   *
      *           types that are going to produce shadow postings.    *
      *  221683 - Need to access the fee record for the transaction   *
      *           number of last update.                              *
      *  220257 - Negative amounts should be converted to positive on *
      *           LEHOSTPD and the Pay/Receive indicator changed      *
      *  218992 - Do not write to LEHOSTPD if interbranch event       *
      *           Do not overwrite settlement details on event as     *
      *           these are correct for this settlement allocation    *
      *  219230 - Do not write to LEHOSTPD if value date is zero      *
      *           or posting amount is zero                           *
      *  218782 - Add Program ref, Sequence Number & Status fields to *
      *           LEHOSTPD.                                           *
      *  218262 - Setup pay/receive indicator depending on the        *
      *  CLE033 - Settlement method 09                                *
      *  CLE031 - Lending Enhancements.                               *
      *  CGL020 - Midas Compliance Watch - Additional A/C Postings    *
      *           Information                                         *
      *  CRE009 - Projected Account Movements for Retail Accounts     *
      *  204452 - Recompiled due to changed PF/LEFEED.                *
      *  190995 - The loan type in file RPOSTPD is not updated        *
      *           correctly and subsequently RE0672 does not update   *
      *           TRAT in PF/RSACMTPD correctly.                      *
      *  192289 - When settlement is in another currency, projected   *
      *           account movements were missing, or were doubled.    *
     F*  155174 - Include the settlement types '01', '02', '07', '08' *
     F*           and '12' in the array TABMEM. Amendment to          *
     F*           incomplete fix 074627.                              *
     F*  146132 - Removal of 030176:- interbranch events are required.*
     F*  163486 - Recompile due to changes in LVENTEL.                *
     F*  CLE009 - LE I/C Swift Message Generation for Fees            *
     F*           Recompiled due to changes in LEFEED                 *
      *  CGL007 - Account Postings Enquiry                            *
     F*  030176 - Ignore interbranch events - only output to RPOSTPD  *
     F*           if funds are incoming/outgoing.                     *
     F*  074627 - Include settlement types '01', '02', '07', '08' and *
     F*           '12' in the array of retail settlement types.       *
     F*         - Check if the account settled through a nostro is    *
     F*           a retail account, and output if so.                 *
     F*  CLE005 - Customer Lending Enhancements - Others (T3)         *
     F*  123275 - Customer Lending shadow posting narratives are in-  *
     F*           consistent.  Changed value of posting narrative for *
     F*           fees events from loan reference no. (LNRF) and  fa- *
     F*           cility no. (FACLTY) to fee sequence no. (FEFSEQ)    *
     F*           and fee narrative (AUFENV).                         *
     F*           Fix patterned after 101114.                         *
     F*       105140 - Recompile over changed LVENTZZ.                   *
     F*                Field NORE increased in size.                     *
     F*       096084 - Wrong key used  with settl. 04 for account        *
     F*                validation                                        *
     F*       064773 - CONDITION CALL TO AORETLR0 ON RETAIL BEING PRESENT*
     F*       S01392 - JAPANESE SUB MODULE ENHANCEMENTS                  *
     F*       S01194 - STANDING DATA CHANGES
     F*       HK0000 - EXTEND THE ACCOUNT KEY TO INCLUDE BRANCH CODE     *
     F*       S01117 - MULTIBRANCHING                                    *S01117
0011 F*       E12726 - A/C WAS REPORTED IN MISSING SETTLEMENT A/C'S      *E12726
0011 F*                REPORT EVEN THOUGH IT EXISTS, DUE TO LOAN BRANCH  *E12726
0011 F*                DIFFERING FROM BRANCH OF SETTLING RETAIL A/C.     *E12726
0011 F*                ALSO,TITLE AND DATE NOT PRINTED IN FIRST CYCLE,   *E12726
0011 F*                AND WRONG FORMAT ON 'NO MISSING ACCOUNTS' MSG.    *E12726
0011 F*       E13500 - WHEN THERE ARE NO DETAIL RECORDS FOR MISSING      *LE0820
0011 F*                SETTLEMENTS ACCOUNTS REPORT.; THE MESSAGE         *LE0820
0011 F*                'NO MISSING ACCOUNTS' IS PRODUCED ON A PAGE       *LE0820
0011 F*                WHICH DOES NOT CONTAIN HEADINGS.                  *LE0820
0011 F*                                                                  *LE0820
0012 F********************************************************************LE0820
     F*  C R E A T I O N     P A R A M E T E R S                      *
     F*                                                               *
     F*                                                               *
0012 F********************************************************************LE0820
0013 F*VENT***IP  F     400 20AI     2 DISK                               S01117
0013 F***LVENTL2 IP  F     400 20AI     2 DISK                      S01117CLE031
0013 F***LVENTL2*IP**F     410 20AI     2 DISK                            CLE031              218992
     F***LVENTL2 IP  F    1070 20AI     2 DISK                                         218992 CGL029
     F*LVENTL2*IP**F****1124 20AI     2 DISK                                           CGL029 CLE042
     FLVENTL2 IP  F    1128 20AI     2 DISK                                                   CLE042
0014 F*TABLE***IF  F      96 12AI     2 DISK                              S01194
0015 F***ACNUM** IF  F      40 10AI     2 DISK                                         LE0820 CGL029
     FACNUM   IF  F     117 10AI     2 DISK                                                   CGL029
0016 F*CCNT***IF* F     400 15AI     2 DISK                               HK0000
0016 F***ACCNT** IF  F     400 18AI     2 DISK                                         HK0000 CGL029
     FACCNT   IF  F     573 24AI     2 DISK                                                   CGL029
     F*                                                                   123275
     F** Add files PF/LEFEED and LF/SDFEEL0 to access fee narrative.      123275
     F*                                                                   123275
     FLEFEED  IF  E           K        DISK                               123275
     FSDFEEL0 IF  E           K        DISK                               123275
     F/COPY WNCPYSRC,LE0820F001
     F*                                                                   123275
0017 FRPOSTHH O   F     160            DISK                               LE0820
     F*RPOSTPD*O***F*****160            DISK                              123275
     F***RPOSTPD*O   F     279            DISK                     123275 CGL007
     F***RPOSTPD O   F     331            DISK                                         CGL007 CGL020
     F***RPOSTPD O   F     589            DISK                                         CGL020 CGL029
     F/COPY WNCPYSRC,LEH01445
     FRPOSTPD O   F     620            DISK                                                   CGL029
     F/COPY WNCPYSRC,LEH01446
     FRPOSTZZ O   F     160            DISK
     FLEHOSTPDO   E                    DISK                               CLE033
     FCLOAN   IF  E           K        DISK                               CLE033
     F            CLOANHHF                          KIGNORE               CLE033
     F            CLOANZ1F                          KIGNORE               CLE033
     FLEFEEDL0IF  E           K        DISK                                                 MD052216
     F            LEFEEDF                           KRENAMELEFEEDF0                         MD052216
      *                                                                                     MD052216
      ** Previous Copy of Fee Extension File                                                MD052216
     FLEFEEXQDIF  E           K        DISK                                                 MD052216
     FLOAMSOM1IF  E           K        DISK                               CLE033
     F            LOAMSDKF                          KRENAMEOMLOAM         CLE033
0018 F*E0820P1O*  F     132     OF     PRINTER                  S01124    S01117
0018 FLE0820P1O   F     132     OF     PRINTER      KINFDS SPOOL      UC  S01117
     FLE0820AUO   F     132            PRINTER      KINFDS SPOOLU         S01117
0019 F**                                                                  LE0820
0020 F* ID F  C  H  L    FUNCTION OF INDICATORS                           LE0820
0021 F**                                                                  LE0820
0022 F**01*******     LVENT HEADER RECORD                                 S01117
0022 F* 01            LVENTL2 HEADER RECORD                               S01117
0023 F**02*******     LVENT DETAIL RECORD                                 S01117
0023 F* 02            LVENTL2 DETAIL RECORD                               S01117
0024 F* 12            ACCOUNT MASTER - DETAIL                             LE0820
0025 F* 13            ACCOUNT MASTER - CLOSED                             LE0820
0026 F* 14            ACNUM DETAIL                                        LE0820
     F*       10      ALLOW OUTPUT TO BRANCH REPORT                       S01117
0027 F*    15         LOAN AMEND SEQUENCE NO. ZERO                        LE0820
0028 F*       18      EVENT AMOUNT NEGATIVE                               LE0820
0029 F*       20      EVENT CURRENCY HAS 0 D.P.                           LE0820
0030 F*       21                         1 D.P.                           LE0820
0031 F*       22                         2 D.P.                           LE0820
0032 F*       23                         3 D.P.                           LE0820
      *       30      Read of Fee Detail Main and Extension File      *                     MD052216
0033 F*       40      NO POSTING REQUIRED                                 LE0820
0034 F*       41      EVENT TYPE - F2                                     LE0820
0035 F*       42                 - I2                                     LE0820
0036 F*       43                 - M1                                     LE0820
0037 F*       44                 - R1                                     LE0820
     F*          31              - R3                                     S01392
     F*          32              - R4                                     S01392
     F*          33              - R5                                     S01392
0038 F*       45                 - V1                                     LE0820
0039 F*       46                 - V3                                     LE0820
0040 F*       47      PROCESSING TYPE IS PARTS SOLD                       LE0820
0041 F*       48      SETTLEMENT TYPE - 14                                LE0820
0042 F*       49                      - 04                                LE0820
0043 F*       50                      - 05                                LE0820
0044 F*       51      OUTPUT TO RPOST                                     LE0820
0045 F*       52      OUTPUT TO MISSING SETTLEMENT ACCOUNTS REPORT        LE0820
      *       55      INDICATOR FOR M2 AND R2 EVENT TYPES                                    BUG7568
      *       56      POST DATE = BJDNWD                                                     BUG8552
     F*                                                                   S01117
0046 F*       60      AT LEAST ONE ACCOUNT MISSING/CLOSED                 LE0820
     F*       63      PROCESSING TYPE = 63                                S01392
     F*       65      MULTI-BRANCHING = 'Y'                               S01117
     F*                                                                   S01117
     F*       70      INDICATOR FOR MULTI-BRANCHING OUTPUT                S01117
     F*       71      NO DETAILS FOR THE BRANCH                           S01117
     F*       75      INPUT FILE HAS AT LEAST ONE DETAIL RECORD           S01117
0047 F*       80      FILE CONTROLS OUT OF BALANCE                        LE0820
0048 F*       86      WORK INDICATOR                                      LE0820
     F*       87      WORK INDICATOR                                      S01392
0049 F*       89      CHAIN FAIL                                          LE0820
0050 F*       90-99   STANDARD SUBROUTINES                                LE0820
0052 F*       U7&U8   DATABASE ERROR                                      LE0820
0053 F*          U8   FILE OUT OF BALANCE                                 LE0820
0054 E                    INT         2 15 0             INTEGER ARRAY    LE0820
0055 E                    DEC         2  3 0             DECIMAL ARRAY    LE0820
0056 E********************TABMEM  3   3  2 0             RETAIL SETLE0820 074627
     E/COPY WNCPYSRC,LE0820E001
     E                    TABMEM  8   8  2 0             RETAIL SETP TYPE 074627
     E/COPY WNCPYSRC,LE0820E002
0057 E***********         TABPTS  2   2  2               PARTS SOLDLE0820 CLE005
0057 E                    TABPTS  4   4  2               PARTS SOLD P.TYPECLE005
     E/COPY WNCPYSRC,LEH00956
0058 E***********         TABEVT  1   6  2   TABNAM 18   EVENT NAMES      S01392
0058 E**********          TABEVT  1   9  2   TABNAM 18   EVENT NAMES      S01392              192289
     E**********          TABEVT  1  12  2   TABNAM 18   EVENT NAMES                   192289 CLE031
     E**********          TABEVT  1  24  2   TABNAM 18   EVENT NAMES                   CLE031 CER049
     E**********          TABEVT  1  25  2   TABNAM 18   EVENT NAMES                   CER049 CLE134
     E                    TABEVT  1  28  2   TABNAM 18   EVENT NAMES                          CLE134
     E/COPY WNCPYSRC,LEH00957
      /COPY ZSRSRC,ZDATE2Z1                                               S01392
     E/COPY ZSRSRC,ZHOLE                                                                      237466
     E                    CPY@    1   1 80
     E*                                                                   CLE033
     E**  System values array                                             CLE033
     E                    SVAL    1   3 20                                CLE033
     E*                                                                   CLE033
     E*  Amendment types                                                  CLE033
     E                    #AM     1   3 20                                CLE033
     ICLOANCLF                                                            CLE033
      ** Rename loan master file details                                  CLE033
     I              RECI                            RECIX                 CLE033
     I              LNRF                            LNRFX                 CLE033
     I              RCDT                            RCDTX                 CLE033
     I              MRIN                            MRINX                 CLE033
     I              PTYP                            PTYPX                 CLE033
     I              CNUM                            CNUMX                 CLE033
     I              BRCA                            BRCAX                 CLE033
     I              LTYP                            LTYPX                 CLE033
     I              SUTP                            SUTPX                 CLE033
     I              DDAT                            DDATX                 CLE033
     I              VDAT                            VDATX                 CLE033
     I              MDAT                            MDATX                 CLE033
     I              LASQ                            LASQX                 CLE033
     I              FCUS                            FCUSX                 CLE033
     I              FTYP                            FTYPX                 CLE033
     I              FSEQ                            FSEQX                 CLE033
     I              CCY                             CCYX                  CLE033
     I              CPAM                            CPAMX                 CLE033
     I              INTC                            INTCX                 CLE033
     I              INTR                            INTRX                 CLE033
     I              BRTT                            BRTTX                 CLE033
     I              BRTE                            BRTEX                 CLE033
     I              RTSP                            RTSPX                 CLE033
     I              MARG                            MARGX                 CLE033
     I              SPIN                            SPINX                 CLE033
     I              CHIN                            CHINX                 CLE033
     I              WTRT                            WTRTX                 CLE033
     I              WTIN                            WTINX                 CLE033
     I              REPT                            REPTX                 CLE033
     I              RAMT                            RAMTX                 CLE033
     I              NRPD                            NRPDX                 CLE033
     I              RFRQ                            RFRQX                 CLE033
     I              RDYN                            RDYNX                 CLE033
     I              FCCY                            FCCYX                 CLE033
     I              LIND                            LINDX                 CLE033
     I              CRSK                            CRSKX                 CLE033
     I              ACOF                            ACOFX                 CLE033
     I              NACD                            NACDX                 CLE033
     I              RELI                            RELIX                 CLE033
     I              AUTO                            AUTOX                 CLE033
     I              PSAM                            PSAMX                 CLE033
     I              BCXR                            BCXRX                 CLE033
     I              FCXR                            FCXRX                 CLE033
     I              SDST                            SDSTX                 CLE033
     I              OSDA                            OSDAX                 CLE033
     I              TSTN                            TSTNX                 CLE033
     I              MDST                            MDSTX                 CLE033
     I              OMDA                            OMDAX                 CLE033
     I              TMAN                            TMANX                 CLE033
     I              FACO                            FACOX                 CLE033
     I              RLDT                            RLDTX                 CLE033
     I              NROD                            NRODX                 CLE033
     I              RLFQ                            RLFQX                 CLE033
     I              RLDY                            RLDYX                 CLE033
     I              RDFC                            RDFCX                 CLE033
     I              NBRA                            NBRAX                 CLE033
     I              NRTS                            NRTSX                 CLE033
     I              NSIN                            NSINX                 CLE033
     I              NCAS                            NCASX                 CLE033
     I              AWTP                            AWTPX                 CLE033
     I              WTRD                            WTRDX                 CLE033
     I              WTWD                            WTWDX                 CLE033
     I              IWOD                            IWODX                 CLE033
     I              PWOD                            PWODX                 CLE033
     I              BMDI                            BMDIX                 CLE033
     I              FMDI                            FMDIX                 CLE033
     I              PDIN                            PDINX                 CLE033
     I              LSWC                            LSWCX                 CLE033
     I              LSWS                            LSWSX                 CLE033
     I              OSDB                            OSDBX                 CLE033
     I              OMDB                            OMDBX                 CLE033
     I              ORBR                            ORBRX                 CLE033
     I              PRFC                            PRFCX                 CLE033
     I              FCLB                            FCLBX                 CLE033
     I              MLNR                            MLNRX                 CLE033
     I              BTIN                            BTINX                 CLE033
     I              BLDY                            BLDYX                 CLE033
     I              OLNO                            OLNOX                 CLE033
     I              RCSI                            RCSIX                 CLE033
     I              ICBS                            ICBSX                 CLE033
     I              IPFR                            IPFRX                 CLE033
     I              TOTI                            TOTIX                 CLE033
     I              NIDT                            NIDTX                 CLE033
     I              IBDT                            IBDTX                 CLE033
     I              SLID                            SLIDX                 CLE033
     I              AIPD                            AIPDX                 CLE033
     I              DLRC                            DLRCX                 CLE033
     I              IACD                            IACDX                 CLE033
     I              AITC                            AITCX                 CLE033
     I              TFEP                            TFEPX                 CLE033
     I              AIAP                            AIAPX                 CLE033
     I              IPRD                            IPRDX                 CLE033
     I              IPRM                            IPRMX                 CLE033
     I              ICTD                            ICTDX                 CLE033
     I              AIMN                            AIMNX                 CLE033
     I              RBDT                            RBDTX                 CLE033
     I              NOPS                            NOPSX                 CLE033
     I              IFDY                            IFDYX                 CLE033
     I              LONI                            LONIX                 CLE033
     I              CNFI                            CNFIX                 CLE033
     I              ACEI                            ACEIX                 CLE033
     I              TLXI                            TLXIX                 CLE033
     I              CBLI                            CBLIX                 CLE033
     I              ORED                            OREDX                 CLE033
     I              LCD                             LCDX                  CLE033
     I              CHTP                            CHTPX                 CLE033
     I              TNLU                            TNLUX                 CLE033
     I              ADDI                            ADDIX                 CLE033
     I              ORMD                            ORMDX                 CLE033
     I              ORTI                            ORTIX                 CLE033
     I              BOKC                            BOKCX                 CLE033
     I              COCU                            COCUX                 CLE033
     I              RECE                            RECEX                 CLE033
     I              OMDT                            OMDTX                 CLE033
     I              NIPD                            NIPDX                 CLE033
     I              NMDT                            NMDTX                 CLE033
     I              APMI                            APMIX                 CLE033
     I              RSTM                            RSTMX                 CLE033
     I              RONS                            RONSX                 CLE033
     I              RIBN                            RIBNX                 CLE033
     I              RIBA                            RIBAX                 CLE033
     I              ROBN                            ROBNX                 CLE033
     I              ROCN                            ROCNX                 CLE033
     I              PSTM                            PSTMX                 CLE033
     I              PONS                            PONSX                 CLE033
     I              PIBN                            PIBNX                 CLE033
     I              PIBA                            PIBAX                 CLE033
     I              POBN                            POBNX                 CLE033
     I              POCN                            POCNX                 CLE033
     I              RCRN                            RCRNX                 CLE033
     I              RCRA                            RCRAX                 CLE033
     I              RVNO                            RVNOX                 CLE033
     I              AWBN                            AWBNX                 CLE033
     I              AWBA                            AWBAX                 CLE033
     I              BENN                            BENNX                 CLE033
     I              BENA                            BENAX                 CLE033
     I              DTP1                            DTP1X                 CLE033
     I              DTP2                            DTP2X                 CLE033
     I              DTP3                            DTP3X                 CLE033
     I              DTP4                            DTP4X                 CLE033
     I              DCHG                            DCHGX                 CLE033
     I              BTB1                            BTB1X                 CLE033
     I              BTB2                            BTB2X                 CLE033
     I              BTB3                            BTB3X                 CLE033
     I              BTB4                            BTB4X                 CLE033
     I              BTB5                            BTB5X                 CLE033
     I              BTB6                            BTB6X                 CLE033
     I              CVMR                            CVMRX                 CLE033
     I              PTFR                            PTFRX                 CLE033
     I              HLEX                            HLEXX                 CLE033
     I              FSRP                            FSRPX                 CLE033
     I              FSGN                            FSGNX                 CLE033
     I              FPRC                            FPRCX                 CLE033
     I              TCOF                            TCOFX                 CLE033
     I              ACPD                            ACPDX                 CLE033
     I              ACDA                            ACDAX                 CLE033
     I              ACAJ                            ACAJX                 CLE033
     I              ACAP                            ACAPX                 CLE033
     I              COFD                            COFDX                 CLE033
     I              COFM                            COFMX                 CLE033
     I              CFCD                            CFCDX                 CLE033
     I              NFRS                            NFRSX                 CLE033
     I              NFSN                            NFSNX                 CLE033
     I              NFPC                            NFPCX                 CLE033
     I              PDCF                            PDCFX                 CLE033
     I              FCTD                            FCTDX                 CLE033
     I              FWOD                            FWODX                 CLE033
     I              DFTP                            DFTPX                 CLE033
     I              DFST                            DFSTX                 CLE033
     I              MCRA                            MCRAX                 CLE033
     I              FCRA                            FCRAX                 CLE033
     I              PDDI                            PDDIX                 CLE033
     I              PTDI                            PTDIX                 CLE033
     I              GDPR                            GDPRX                 CLE033
     I              GDIN                            GDINX                 CLE033
     I              LNKS                            LNKSX                 CLE033
     I              MNSG                            MNSGX                 CLE033
     I              GASS                            GASSX                 CLE033
     I              GPRT                            GPRTX                 CLE033
     I              TOLN                            TOLNX                 CLE033
     I              LSTS                            LSTSX                 CLE033
     I              IUSR                            IUSRX                 CLE033
     I              AUSR                            AUSRX                 CLE033
     I              XUSR                            XUSRX                 CLE033
     I              RATF                            RATFX                 CLE033
     I              CNCF                            CNCFX                 CLE033
     I              PCRF                            PCRFX                 CLE033
     I              LPFI                            LPFIX                 CLE033
     I              PTFC                            PTFCX                 CLE033
     I              PTFT                            PTFTX                 CLE033
     I              PTFN                            PTFNX                 CLE033
     I              PCOB                            PCOBX                 CLE033
     I              LRLD                            LRLDX                 CLE033
     I              LMCD                            LMCDX                 CLE033
     I              SCCY                            SCCYX                 CLE033
     I              ICCY                            ICCYX                 CLE033
     I              OINR                            OINRX                 CLE033
     I              OIDT                            OIDTX                 CLE033
     I              REPI                            REPIX                 CLE033
     I              RFDY                            RFDYX                 CLE033
     I              RFRI                            RFRIX                 CLE033
     I              RFRT                            RFRTX                 CLE033
     I              RFAR                            RFARX                 CLE033
     I              REXR                            REXRX                 CLE033
     I              REXI                            REXIX                 CLE033
     I              PSCY                            PSCYX                 CLE033
     I              PEXR                            PEXRX                 CLE033
     I              PEXI                            PEXIX                 CLE033
     I              CLAS                            CLASX                                     CLE042
     I              DFCL                            DFCLX                                     CLE042
     ICLOANCKF                                                            CLE033
      ** Rename loan master file details                                  CLE033
     I              TNLU                            TNLUZ                 CLE033
     IOMLOAM                                                              CLE033
      ** Rename loan amendment fields                                     CLE033
     I              RECI                            RECIY                 CLE033
     I              LNRF                            LNRFY                 CLE033
     I              CNUM                            CNUMY                 CLE033
     I              VDAT                            VDATY                 CLE033
     I              LASN                            LASNY                 CLE033
     I              AMTP                            AMTPY                 CLE033
     I              RTSP                            RTSPY                 CLE033
     I              CCY                             CCYY                  CLE033
     I              PRAM                            PRAMY                 CLE033
     I              INTA                            INTAY                 CLE033
     I              WTXA                            WTXAY                 CLE033
     I              FEAM                            FEAMY                 CLE033
     I              TAMT                            TAMTY                 CLE033
     I              BRCA                            BRCAY                 CLE033
     I              REPT                            REPTY                 CLE033
     I              STAI                            STAIY                 CLE033
     I              SETP                            SETPY                 CLE033
     I              BRTE                            BRTEY                 CLE033
     I              SPIN                            SPINY                 CLE033
     I              INTC                            INTCY                 CLE033
     I              ORED                            OREDY                 CLE033
     I              IRCF                            IRCFY                 CLE033
     I              LCD                             LCDY                  CLE033
     I              ROLN                            ROLNY                 CLE033
     I              PDDI                            PDDIY                 CLE033
     I              PTDI                            PTDIY                 CLE033
     I              TNLU                            TNLUY                 CLE033
0062 I**                                                                  LE0820
0063 I**   CUSTOMER LENDING EVENTS FILE - HEADER RECORD                   LE0820
0064 I**                                                                  LE0820
0065 I*VENT***NS* 01   1 CH                                               S01117
0065 I*VENTL1*NS* 01   1 CH                                               S01117
0065 ILVENTL2 NS  01   1 CH                                               S01117
0066 I**                                                                  LE0820
0067 I**   CUSTOMER LENDING EVENTS FILE - DETAIL RECORD - EXTRA FIELDS    LE0820
0068 I**                                                                  LE0820
0069 I        NS  02   1 CL                                               LE0820
0070 I                                        1   1 RECI                  LE0820
0071 I**********                              2   70LNRF                               LE0820 CLE148
     I                                        2   7 LNRF                                      CLE148
0072 I**********                              8  130CNUM                  LE0820              CSD027
0072 I                                        8  13 CNUM                  LE0820              CSD027
0073 I                                       14  17 ETYP                  LE0820
0074 I                                    P  18  200EDAT                  LE0820
0075 I                                    P  21  270EAMT                  LE0820
0076 I                                       28  30 ECCY                  LE0820
0077 I                                       31  320ECSS                  LE0820
0078 I                                       33  34 LTYP                  LE0820
0079 I                                       35  36 SUTP                  LE0820
0080 I***********                            37  390BRCD                  S01117
0080 I                                       37  39 EBRC  L1              S01117
0081 I                                    P  40  457INTR                  LE0820
0082 I                                       46  46 NGII                  LE0820
0083 I                                    P  47  490OTHD                  LE0820
0084 I                                    P  50  560OTHA                  LE0820
0085 I                                       57  59 FCCY                  LE0820
0086 I                                       60  610FCSS                  LE0820
0087 I                                       62  620ECDP                  LE0820
0088 I                                       63  630FCDP                  LE0820
0089 I                                    P  64  700DBCE                  LE0820
0090 I                                    P  71  770BCEQ                  LE0820
0091 I                                    P  78  848DBCR                  LE0820
0092 I                                    P  85  910DFCE                  LE0820
0093 I                                    P  92  980FCEQ                  LE0820
0094 I                                    P  99 1050DFCR                  LE0820
0095 I                                      106 106 FIRI                  LE0820
0096 I                                      107 1080SETP                  LE0820
0097 I**********                            109 120 OSAC                               LE0820 CGL029
     I                                      109 120 OSACQQ                                    CGL029
0098 I**                                                                  LE0820
0099 I**********                            109 1140ACNUMB                             LE0820 CGL029
0100 I**********                            115 1180ACODE                              LE0820 CGL029
0101 I**********                            119 1200ACSEQ                              LE0820 CGL029
0102 I**********                            109 1180ACNKEY                             LE0820 CGL029
     I                                      109 1140ACNUM#                                    CGL029
     I                                      115 1180ACODE#                                    CGL029
     I                                      119 1200ACSEQ#                                    CGL029
     I                                      109 1180ACNKE#                                    CGL029
0103 I**                                                                  LE0820
0104 I                                      121 130 TSEN                  LE0820
0105 I                                      131 140 FACO                  LE0820
0106 I                                      141 170 SPI1                  LE0820
0107 I                                      171 200 SPI2                  LE0820
0108 I                                      201 230 SPI3                  LE0820
0109 I                                      231 231 INOI                  LE0820
0110 I                                      232 2370CPAR                  LE0820
0111 I                                      238 2380PARI                  LE0820
0112 I                                      239 258 CRNM                  LE0820
0113 I                                      259 268 CTWN                  LE0820
0114 I                                      269 276 CASK                  LE0820
0115 I                                      277 296 PRNM                  LE0820
0116 I                                      297 306 PTWN                  LE0820
0117 I                                      307 314 PASK                  LE0820
0118 I**********                            315 3200FCUS                  LE0820              CSD027
0118 I                                      315 320 FCUS                  LE0820              CSD027
0119 I                                      321 3230FTYP                  LE0820
0120 I                                      324 3250FSEQ                  LE0820
0121 I                                      326 327 CRSK                  LE0820
0122 I                                      328 329 REGC                  LE0820
0123 I                                      330 331 CDOM                  LE0820
0124 I                                      332 333 RDOM                  LE0820
0125 I                                      334 3360LASN            15    LE0820
0126 I                                      337 337 FREO                  LE0820
0127 I                                      338 338 WTIN                  LE0820
0128 I                                    P 339 3447WTRT                  LE0820
0129 I                                    P 345 3510CPAM                  LE0820
0130 I                                      352 352 AUTO                  LE0820
0131 I                                      353 3530MRIN                  LE0820
0132 I                                      354 355 ACOF                  LE0820
0133 I                                      356 356 RCSI                  LE0820
     I                                      357 359 OSBR                                      222446
0133 I                                      363 363 IBRE                  030176
     I                                      369 371 ORBR                                      261191
     I                                      410 410 SIAC                  030176
     I                                      411 4120RSTM                                      218992
     I**********                            413 424 RONS                               218992 CGL029
     I                                      413 424 RONSQQ                                    CGL029
     I                                      425 432 RIBN                                      218992
     I                                      433 467 RIBA                                      218992
     I**********                            468 4730ROBN                               218992 CSD027
     I**********                            474 4790ROCN                               218992 CSD027
     I                                      468 473 ROBN                                      CSD027
     I                                      474 479 ROCN                                      CSD027
     I                                      480 482 ROBR                                      218992
     I                                      483 485 RSCY                                      218992
     I                                    P 486 4928REXR                                      218992
     I                                      493 493 REXI                                      218992
     I                                      494 4950PSTM                                      218992
     I**********                            496 507 PONS                               218992 CGL029
     I                                      496 507 PONSQQ                                    CGL029
     I                                      508 515 PIBN                                      218992
     I                                      516 550 PIBA                                      218992
     I**********                            551 5560POBN                               218992 CSD027
     I**********                            557 5620POCN                               218992 CSD027
     I                                      551 556 POBN                                      CSD027
     I                                      557 562 POCN                                      CSD027
     I                                      563 570 RCRN                                      218992
     I                                      571 605 RCRA                                      218992
     I                                      606 613 RVNO                                      218992
     I                                      614 621 AWBN                                      218992
     I                                      622 656 AWBA                                      218992
     I                                      657 664 BENN                                      218992
     I                                      665 699 BENA                                      218992
     I                                      700 734 DTP1                                      218992
     I                                      735 769 DTP2                                      218992
     I                                      770 804 DTP3                                      218992
     I                                      805 839 DTP4                                      218992
     I                                      840 842 DCHG                                      218992
     I                                      843 877 BTB1                                      218992
     I                                      878 912 BTB2                                      218992
     I                                      913 947 BTB3                                      218992
     I                                      948 982 BTB4                                      218992
     I                                      9831017 BTB5                                      218992
     I                                     10181052 BTB6                                      218992
     I                                     10531055 POBR                                      218992
     I                                     10561056 CVMR                                      218992
     I                                     10571059 PSCY                                      218992
     I                                     10601062 IC72                                      218992
     I                                    P106310698PEXR                                      218992
     I                                     10701070 PEXI                                      218992
     I                                     10711088 OSAC                                      CGL029
     I**********                           107110760ACNUMB                             CGL029 CSD027
     I                                     10711076 ACNUMB                                    CSD027
     I                                     107710860ACODE                                     CGL029
     I                                     108710880ACSEQ                                     CGL029
     I                                     107110800ACNKEY                                    CGL029
     I                                     10891106 RONS                                      CGL029
     I                                     11071124 PONS                                      CGL029
     I                                     11251128 CLAS                                      CLE042
0134 I**                                                                  LE0820
0135 I**   TRAILER RECORD                                                 LE0820
0136 I**                                                                  LE0820
0137 I********NS*      1 CT                                               S01117
0137 I        NS  03   1 CT                                               S01117
0138 I                                        1   1 RECI                  LE0820
0139 I**********                              2   60NORE            LE0820105140
     I                                    P   2   60NORE                  105140
0140 I                                    P   7  140HRWN                  LE0820
0141 I                                    P  15  160HRDC                  LE0820
0142 I**                                                                  LE0820
0143 I*****LVENT*CATCH-ALL                                                S01117
0143 I**   LVENTL2 CATCH-ALL                                              S01117
0144 I**                                                                  LE0820
0145 I        NS                                                          LE0820
0146 I                                        1   1 RECI                  LE0820
0147 I*                                                                   LE0820
0148 I*****TABLE*FILE***INSTALLATION*CONTROL*DATA*RECORD*1.               S01194
0149 I**********                                                          S01194
0150 I*TABLE***NS       2 C0   3 C1  12 C1                                S01194
0151 I*******AND      13 C0                                               S01194
0152 I**********                              1   1 RECI                  S01194
0153 I**********                              2   30RECT                  S01194
0154 I**********                             12  130RCDE                  S01194
0155 I**********                             14  66 TITL                  S01194
0156 I**********                             67  67 DATF                  S01194
0157 I***********                            68  700DFBR                  S01194
0158 I**********                             74  74 MODI1                 S01194
0159 I**********                             75  75 MODI2                 S01194
0160 I**********                             76  76 MODI3                 S01194
0161 I**********                          P  77  790RUND                  S01194
0162 I**********                             80  86 RUNA                  S01194
0163 I**********                             87  870SFLG                  S01194
0164 I**********                          P  90  920LCD                   S01194
0165 I**********                             93  93 CHTP                  S01194
0166 I**********                          P  94  960TNLU                  S01194
0167 I**********                                                          S01194
0168 I*****TABLE*FILE***INSTALLATION*CONTROL*DATA*RECORD*2.               S01194
0169 I**********                                                          S01194
0170 I*TABLE***NS       1 CD   2 C0   3 C1                                S01194
0171 I*******AND      12 C1  13 C1                                        S01194
0172 I**********                              1   1 RECI                  S01194
0173 I**********                              2   30RECT                  S01194
0174 I**********                             12  130RCDE                  S01194
0175 I**********                             14  16 BCCY                  S01194
0176 I**********                             17  19 BCYL                  S01194
0177 I**********                             20  22 HOCY                  S01194
0178 I**********                             23  280HEAD                  S01194
0179 I**********                          P  29  310APDA                  S01194
0180 I**********                             35  35 APFQ                  S01194
0181 I**********                          P  36  380LOGS                  S01194
0182 I**********                             39  40 CUZR                  S01194
0183 I**********                          P  41  430DNWD                  S01194
0184 I**********                             44  460BVLP                  S01194
0185 I**********                             47  49 LOCY                  S01194
0186 I**********                             50  510FDAY                  S01194
0187 I**********                             52  52 ACLD                  S01194
0188 I***********                            53  53 MBIN                  S01194
0189 I**********                             86  86 ISAV                  S01194
0190 I**********                          P  87  890LLOG                  S01194
0191 I**********                          P  90  920LCD                   S01194
0192 I**********                             93  93 CHTP                  S01194
0193 I**********                          P  94  960TNLU                  S01194
0194 I**********                                                          S01194
0195 I*****TABLE*FILE***INSTALLATION*CONTROL*DATA*RECORD*3.               S01194
0196 I**********                                                          S01194
0197 I********NS       1 CD   2 C0   3 C1                                 S01194
0198 I*******AND      12 C2  13 C0                                        S01194
0199 I**********                              1   1 RECI                  S01194
0200 I**********                              2   30RECT                  S01194
0201 I**********                             12  130RCDE                  S01194
0202 I**********                             14  170COMS                  S01194
0203 I**********                             18  210CADC                  S01194
0204 I**********                          P  22  240MDIC                  S01194
0205 I**********                          P  25  270MCIC                  S01194
0206 I**********                          P  28  300MDIA                  S01194
0207 I**********                          P  31  330MCIA                  S01194
0208 I**********                             34  370SRPL                  S01194
0209 I**********                             38  410SPAC                  S01194
0210 I**********                             42  450SWAC                  S01194
0211 I**********                             46  490FTAC                  S01194
0212 I**********                             50  530TAC4                  S01194
0213 I**********                             54  570TAC5                  S01194
0214 I**********                          P  63  650NOBA                  S01194
0215 I**********                          P  66  680TSIZ                  S01194
0216 I**********                             69  69 RACN                  S01194
0217 I**********                             70  700GLSI                  S01194
0218 I**********                             71  710RTSI                  S01194
0219 I**********                             72  720DLSI                  S01194
0220 I**********                             73  730NOSI                  S01194
0221 I**********                             74  740CTSI                  S01194
0222 I**********                          P  75  770ELAC                  S01194
0223 I**********                          P  78  800ECAC                  S01194
0224 I**********                          P  90  920LCD                   S01194
0225 I**********                             93  93 CHTP                  S01194
0226 I**********                          P  94  960TNLU                  S01194
0227 I**********                                                          S01194
0228 I*****TABLE*FILE*CATCH-ALL                                           S01194
0229 I**********                                                          S01194
0230 I********NS                                                          S01194
0231 I**********                              1   1 RECI                  S01194
0232 I**********                                                          S01194
0233 I*    ACCOUNT MASTER DETAIL RECORD - FIELD NAMES CHANGED             LE0820
0234 I*                                                                   LE0820
0235 IACCNT   NS  12   1 CD                                               LE0820
0236 I       OR   13   1 CC                                               LE0820
0237 I                                        1   1 RECI                  LE0820
0238 I**********                              2   70CNUMA                 LE0820              CSD027
0238 I                                        2   7 CNUMA                 LE0820              CSD027
0239 I                                        8  10 CCY                   LE0820
0240 I**********                             11  140ACOD                               LE0820 CGL029
     I                                       11  140ACODQQ                                    CGL029
0241 I                                       15  160ACSQ                  LE0820
0242 I***********                            23  250BRCDA                 S01117
0242 I                                       23  25 BRCAA                 S01117
0243 I                                       26  26 ATYP                  LE0820
0244 I                                       27  27 STYP                  LE0820
0245 I                                       29  29 ACST                  LE0820
0246 I                                    P  30  320DACO                  LE0820
0247 I                                    P  33  350DACC                  LE0820
0248 I                                       36  55 ANAM                  LE0820
0249 I                                    P  56  630LDBL                  LE0820
0250 I                                    P  64  710CLBL                  LE0820
0251 I                                       72  72 STFQ                  LE0820
0252 I                                       73  740STDY                  LE0820
0253 I                                    P  75  770LSTD                  LE0820
0254 I                                    P  78  800NSTD                  LE0820
0255 I                                    P  81  820LSTP                  LE0820
0256 I                                    P  83  900CFSB                  LE0820
0257 I                                    P  91  930LMVD                  LE0820
0258 I                                    P  94 1010EPLB                  LE0820
0259 I                                    P 102 1090EPCB                  LE0820
0260 I                                    P 110 1170YTDB                  LE0820
0261 I                                      118 118 GLBT                  LE0820
0262 I                                    P 138 1400LIMC                  LE0820
0263 I                                    P 178 1837CDIR                  LE0820
0264 I                                    P 184 1897CCIR                  LE0820
0265 I                                      190 1990ACNOA                 LE0820
0266 I                                      200 200 RETB                  LE0820
0267 I                                      201 201 ODSC                  LE0820
0268 I                                    P 202 2070ODLN                  LE0820
0269 I                                    P 208 2100ODED                  LE0820
0270 I                                    P 211 2120DIOD                  LE0820
0271 I                                      213 2150FACT                  LE0820
0272 I                                      216 2170FCNO                  LE0820
0273 I                                      218 219 EFAC                  LE0820
0274 I                                    P 220 2270HELD                  LE0820
0275 I                                    P 228 2330MINB                  LE0820
0276 I                                    P 234 2360LACD                  LE0820
0277 I                                    P 237 2380LISP                  LE0820
0278 I                                    P 239 2410RRNM                  LE0820
0279 I                                      242 2430DRIB                  LE0820
0280 I                                    P 244 2497DRIS                  LE0820
0281 I                                    P 250 2520DRCD                  LE0820
0282 I                                      253 2530DRIC                  LE0820
0283 I                                      254 254 DRIF                  LE0820
0284 I                                      255 2560DRDY                  LE0820
0285 I                                    P 257 2590NDID                  LE0820
0286 I                                    P 260 2620LDID                  LE0820
0287 I                                    P 263 2690LDIA                  LE0820
0288 I                                      270 270 SDAP                  LE0820
0289 I                                    P 271 2730LPAR                  LE0820
0290 I                                    P 274 2800DIIE                  LE0820
0291 I                                    P 281 2882DAIC                  LE0820
0292 I                                    P 289 2950MADI                  LE0820
0293 I                                    P 296 3020GADI                  LE0820
0294 I                                      303 303 DDIS                  LE0820
0295 I                                    P 304 3060DDIA                  LE0820
0296 I                                      310 3110OLDB                  LE0820
0297 I                                    P 312 3177OLDS                  LE0820
0298 I                                      318 3190CRIB                  LE0820
0299 I                                    P 320 3257CRIS                  LE0820
0300 I                                    P 326 3280CRCD                  LE0820
0301 I                                      329 3290CRIC                  LE0820
0302 I                                      330 330 CRIF                  LE0820
0303 I                                      331 3320CRDY                  LE0820
0304 I                                    P 333 3350NCID                  LE0820
0305 I                                    P 336 3380LCID                  LE0820
0306 I                                    P 339 3450LCIA                  LE0820
0307 I                                      346 346 SCAP                  LE0820
0308 I                                    P 347 3490LPAP                  LE0820
0309 I                                    P 350 3560CIIE                  LE0820
0310 I                                    P 357 3642CAIC                  LE0820
0311 I                                    P 365 3710MACI                  LE0820
0312 I                                    P 372 3780GACI                  LE0820
0313 I                                      379 379 CDIS                  LE0820
0314 I                                    P 380 3820DCIA                  LE0820
0315 I                                      386 3870OLCB                  LE0820
0316 I                                    P 388 3937OLCS                  LE0820
0317 I                                    P 394 3960LCD                   LE0820
0318 I                                      397 397 CHTP                  LE0820
0319 I                                    P 398 4000TNLU                  LE0820
     I                                      554 5630ACOD                                      CGL029
0320 I*                                                                   LE0820
0321 I*    CATCH ALL                                                      LE0820
0322 I*                                                                   LE0820
0323 I        NS                                                          LE0820
0324 I                                        1   1 RECI                  LE0820
0325 I*                                                                   LE0820
0326 I*    RETAIL ACCOUNT NUMBERS FILE - DETAIL RECORD - NAMES CHANGED    LE0820
0327 I*                                                                   LE0820
0328 IACNUM   NS  14   1 CD                                               LE0820
0329 I                                        1   1 RECI                  LE0820
0330 I                                        2  110ACNO                  LE0820
0331 I**********                             12  26 ACKEY                              LE0820 CGL029
0332 I**********                             27  27 ACST                               LE0820 CGL029
     I**********                             29  31 ACBR                               HK0000 CGL029
0331 I                                       12  32 ACKEY                                     CGL029
0332 I                                       33  33 ACST                                      CGL029
     I                                       35  37 ACBR                                      CGL029
0333 I*                                                                   LE0820
0334 I*    CATCH ALL                                                      LE0820
0335 I*                                                                   LE0820
0336 I        NS                                                          LE0820
0337 I                                        1   1 RECI                  LE0820
0338 I**                                                                  LE0820
0339 I**   DATASTRUCTURES FOR ACCNT KEY,EVENT TYPE AND FACILTY NO         LE0820
0340 I**                                                                  LE0820
0341 I            DS                                                      LE0820
0342 I***********                             1  15 ACCKEY                HK0000
0343 I**********                              1   60ACNUMB                LE0820              CSD027
0343 I                                        1   6 ACNUMB                LE0820              CSD027
0344 I                                        7   9 ACCY                  LE0820
0345 I**********                             10  130ACODE                              LE0820 CGL029
0346 I**********                             14  150ACSEQ                              LE0820 CGL029
     I**********                             16  18 BRCB                               HK0000 CGL029
0342 I**********                              1  18 ACCKEY                             HK0000 CGL029
     I**********                              1  15 ACCK2                              HK0000 CGL029
     I                                       10  190ACODE                                     CGL029
     I                                       20  210ACSEQ                                     CGL029
     I                                       22  24 BRCB                                      CGL029
     I                                        1  24 ACCKEY                                    CGL029
     I                                        1  21 ACCK2                                     CGL029
0347 I            DS                                                      LE0820
0348 I                                        1   4 ETYP                  LE0820
0349 I                                        1   2 PTP                   LE0820
0350 I                                        3   4 ETP                   LE0820
0351 I            DS                                                      LE0820
0352 I**********                              1   60FCUS                  LE0820              CSD027
0352 I                                        1   6 FCUS                  LE0820              CSD027
0353 I                                        7   90FTYP                  LE0820
0354 I                                       10  110FSEQ                  LE0820
0355 I                                        7  110FACNO                 LE0820
0356 I**********                              1  110FACLTY                LE0820              CSD027
0356 I                                        1  11 FACLTY                LE0820              CSD027
     I*                                                                   123275
     I*                                                                   074627
     I** Data structure for ACCNT key                                     074627
     I*                                                                   074627
     I            DS                                                      074627
     I**********                              1  18 NOSKEY                             074627 CGL029
     I                                        1  24 NOSKEY                                    CGL029
     I                                        1   6 NCNUM                 074627
     I                                        7   9 NCCY                  074627
     I**********                             10  13 NCODE                              074627 CGL029
     I**********                             14  150NCSEQ                              074627 CGL029
     I**********                             16  18 NBRCD                              074627 CGL029
     I**********                              1  15 NOST1                              074627 CGL029
     I                                       10  19 NCODE                                     CGL029
     I                                       20  210NCSEQ                                     CGL029
     I                                       22  24 NBRCD                                     CGL029
     I                                        1  21 NOST1                                     CGL029
     I** Data Structure for the Posting Narrative.                        123275
     I*                                                                   123275
     I            DS                                                      123275
     I                                        1  30 PNARTV                123275
     I                                        1   2 PSEQ                  123275
     I                                        3  28 PDES                  123275
      *                                                                                       CLE141
     IARCY        DS                             30                                           CLE141
     I                                        1   3 C1PI                                      CLE141
     I                                        4   6 C2PI                                      CLE141
     I                                        7   9 C3PI                                      CLE141
     I                                       10  12 C4PI                                      CLE141
     I                                       13  15 C5PI                                      CLE141
     I                                       16  18 C6PI                                      CLE141
     I                                       19  21 C7PI                                      CLE141
     I                                       22  24 C8PI                                      CLE141
     I                                       25  27 C9PI                                      CLE141
     I                                       28  30 C0PI                                      CLE141
     IALOC        DS                             30                                           CLE141
     I                                        1   3 L1PI                                      CLE141
     I                                        4   6 L2PI                                      CLE141
     I                                        7   9 L3PI                                      CLE141
     I                                       10  12 L4PI                                      CLE141
     I                                       13  15 L5PI                                      CLE141
     I                                       16  18 L6PI                                      CLE141
     I                                       19  21 L7PI                                      CLE141
     I                                       22  24 L8PI                                      CLE141
     I                                       25  27 L9PI                                      CLE141
     I                                       28  30 L0PI                                      CLE141
0357 I**                                                                  LE0820
0358 I**   LOCAL DATA AREA TO IDENTIFY DATABASE ERRORS                    LE0820
0359 I**                                                                  LE0820
0213 ILDA        UDS                            256                       LE0820
0214 I***********                           134 138 DBFILE                S01117
0215 I***********                           139 167 DBKEY                 S01117
0216 I***********                           168 175 DBPGM                 S01117
0217 I***********                           176 177 DBASE                 S01117
0214 I                                      134 141 DBFILE                S01117
0215 I                                      142 170 DBKEY                 S01117
0216 I                                      171 180 DBPGM                 S01117
0217 I                                      181 1830DBASE                 S01117
0365 I                                      252 2560FLSZ                  LE0820
     ISPOOL       DS                                                      S01117
     I                                       83  92 SFILE                 S01117
     I                                    B 123 1240SFNUM                 S01117
     ISPOOLU      DS                                                      S01117
     I                                       83  92 SFILEU                S01117
     I                                    B 123 1240SFNUMU                S01117
      *                                                                   CLE033
     ISDACOD    E DSSDACODL1                                              CLE033
      *                                                                   CLE033
     I*SDSVAL*** E DSSDSVALPD                                                          CLE033 222373
      ****EXTERNAL DS FOR SYSTEM VALUES                                                CLE033 222737
      *                                                                   CLE033
     IREPMED      DS                              5                       CRE009
      ** Dataarea for End Date                                            CRE009
      *                                                                   CRE009
     ISDBRCH    E DSSDBRCHPD                                              S01117
      **  EXTERNAL DS FOR BRANCH CODE DETAILS                             S01117
     I              A8BRNM                          BRNM                  S01194
     ISDBANK    E DSSDBANKPD                                              S01194
      **  EXTERNAL DS FOR BANK DETAILS                                    S01194
     I              BJURPT                          TITL                  S01194
     I              BJLCCY                          LOCY                                      237466
     ISDGELR    E DSSDGELRPD                                              S01194
      **  EXTERNAL DS FOR GENERAL LEDGER DETAILS                          S01194
     ISDRETL    E DSSDRETLPD                                              S01194
      **  EXTERNAL DS FOR RETAIL DETAILS                                  S01194
     I              BMACCD                          CADC                  S01194
     I              QQACCD                          QQACC1                                    CGL029
     I*                                                                   064773
     ISDMMOD    E DSSDMMODPD                                              064773
     I* MODULE DETAILS ACCESSED VIA ACCESS PROGRAM                        064773
     I*                                                                   064773
     ISCSARD    E DSSCSARDPD                                              CLE005
      ** Switchable Features File                                         CLE005
      *                                                                   CLE005
     IDSFDY     E DSDSFDY                                                 S01194
     I* FIRST DS FOR ACCESS PROGRAMS, SHORT DATA STRUCTURE                S01194
     I*                                                                   S01194
     IDSSDY     E DSDSSDY                                                 S01194
     I* SECOND DS FOR ACCESS PROGRAMS, LONG DATA STRUCTURE                S01194
     I*                                                                   074627
     I** External DS for Nostro Details                                   074627
     I*                                                                   074627
     ISDNOST    E DSSDNOSTPD                                              074627
     I              QQACCD                          QQACC2                                    CGL029
     I              A7NOSN                          CSNM                                      237466
     IDSCSNM      DS                             10                                           237466
      ** Data area for the location code in customer shortname field                          237466
     I                                        8  10 NRLC                                      237466
     I*                                                                   S01194
     IRUNDT       DS                                                      S01117
     I                                        1   7 RUNA                  S01117
     I                                    P   8  100RUND                  S01117
     I                                       11  11 SSF                   S01117
     I                                       12  12 DATF                  S01117
     I                                       13  13 MBIN                  S01117
      *                                                                                     MD054101
     IJNSTAT      DS                            200                                         MD054101
     I                                    P 103 1050PRUND                                   MD054101
     I/COPY ZSRSRC,ZHOLI                                                                      237466
     C*                                                                   064773
     C**********           CALL 'AOMMODR0'                                             064773 CSC042
     C**********           PARM '*DBERR ' @RTCD   7                                    064773 CSC042
     C**********           PARM '*FIRST ' @OPTN   7                                    064773 CSC042
     C********** SDMMOD    PARM SDMMOD    DSFDY                                        064773 CSC042
     C*                                                                   S01194
     C** PARAMETER LIST FOR PROGRAM 'AOBANKR0'                            S01194
     C           PLISTA    PLIST                                          S01194
     C                     PARM '*MSG   ' @RTCD   7                       S01194
     C                     PARM '*FIRST ' @OPTN   7                       S01194
     C           SDBANK    PARM SDBANK    DSFDY                           S01194
     C** PARAMETER LIST FOR PROGRAM 'AOGELRR0'                                              MD031174
     C           PLISTB    PLIST                                                            MD031174
     C                     PARM '*MSG   ' @RTCD                                             MD031174
     C                     PARM '*FIRST ' @OPTN                                             MD031174
     C           SDGELR    PARM SDGELR    DSSDY                                             MD031174
     C** PARAMETER LIST FOR PROGRAM 'AORETLR0'                            S01194
     C           BGRTBN    IFEQ 'Y'                                       064773
     C           BGIOAC    OREQ 'Y'                                       064773
     C           PLISTC    PLIST                                          S01194
     C                     PARM '*MSG   ' @RTCD   7                       S01194
     C                     PARM '*FIRST ' @OPTN   7                       S01194
     C           SDRETL    PARM SDRETL    DSFDY                           S01194
      *                                                                   064773
     C                     END                                            064773
     C*                                                                   S01194
     C           BDCHK     PLIST                                                              CLE141
     C                     PARM           ZDAYNO                                              CLE141
     C                     PARM           ARCY                                                CLE141
     C                     PARM           ALOC                                                CLE141
     C                     PARM           PAYIND  1                                           CLE141
     C                     PARM           BJDFIN                                              CLE141
     C                     PARM           ZCCY                                               CLE141A
     C                     PARM           ZLOC                                               CLE141A
     C                     PARM *ZEROS    ZADJDT  50                                          CLE141
      *                                                                                       CLE141
     C**********           MOVEACPY@      BIS@   80                                           CSC042
      *    DEFINE REPMED                                                  CRE009
     C           *NAMVAR   DEFN           REPMED                          CRE009
     C*    DEFINE LDA                                                     S01117
     C           *NAMVAR   DEFN           LDA                             S01117
     C           *LOCK     IN   LDA                                       S01117
     C**                                                                  S01117
0366 C**                                                                  LE0820
0367 C**   EXECUTE FIRST CYCLE CALCS                                      LE0820
0368 C**                                                                  LE0820
0369 C   01                EXSR FIRST                                     LE0820
0370 C**                                                                  LE0820
0371 C                     SETOF                     524344               LE0820
0372 C***********          SETOF                     4546                 S01392
     C                     SETOF                     454631               S01392
     C***********          SETOF                     3233                 S01392
     C                     SETOF                     323363               S01392
     C                     MOVE *OFF      *IN55                                              BUG7568
     C                     MOVE '0'       *IN25                                            AR375891A
0373 C**                                                                  LE0820
0374 C**   EXECUTE DETAIL PROCESSING                                      LE0820
0375 C**                                                                  LE0820
0376 C   02                EXSR DETAIL                                    LE0820
0395 C*                                                                   S01117
0396 C*          FOR TRAILER SKIP MAIN PROCESSING                         S01117
0397 C*                                                                   S01117
0398 C   03                EXSR TRAILR                                    S01117
0377 C**                                                                  LE0820
0378 C**   TOTAL CALCS TO COMPARE NO. OF RECS READ AND HASH TOTALS        LE0820
0379 C**                                                                  LE0820
     C*R*********          ADD  2         NRIT                            S01117
0380 C*R*********NREC      COMP NORE                 8080                 S01117
0381 C*RN80******INT,1     COMP HRWN                 8080                 S01117
0382 C*RN80******DEC,1     COMP HRDC                 8080                 S01117
0383 C*R*80******          SETON                     U8                   S01117
     C**                                                                  S01117
     C*   ENSURE TOTALS SPOOL FILE RECORDED BY RCF                        S01117
     C**                                                                  S01117
     CLR                   Z-ADDSFNUMU    ZSNUMU  60                      S01117
     C                     OUT  LDA                                       S01194
     C**                                                                  S01117
     CLR                   CALL 'ZSFILE'                                  S01117
     CLR                   PARM           SEQ                             S01117
     CLR                   PARM *BLANKS   SENTY                           S01117
     CLR                   PARM           SFILEU                          S01117
     CLR                   PARM           ZSNUMU                          S01117
     CLR                   PARM           ZSERR   1                       S01117
     C           *LOCK     IN   LDA                                       S01194
     C**                                                                  S01117
     CLR         ZSERR     IFEQ 'Y'                                       S01117
     C**  ERROR DURING ZSFILE PROCESSING, RETURN TO CALLING PROGRAM       S01117
     CLR                   SETON                     U7U8                 S01117
     CLR                   RETRN                                          S01117
     CLR                   END                                            S01117
     C**                                                                  S01117
     C*     IF P1 FILE NT OPEN (BECAUSE NO RECORDS READ) THEN OPEN IT     S01117
     C**                                                                  S01117
     CLRN75N70             EXSR #ZZ                                       S01117
0401 C*                                                                   S01117
     C**                                                                  S01117
     C*     EXCUTE ERROR ROUTINE IF DATABASE ERROR EXISTS                 S01117
     C**                                                                  S01117
     CLR U7 U8             EXSR *PSSR                                     S01117
0384 C********************************************************************LE0820
0385 C**                                                                  LE0820
0386 C**   SUBROUTINE TO EXECUTE FIRST CYCLE CALCS - FIRST                LE0820
0387 C**                                                                  LE0820
0388 C**   CALLED FROM MAIN PROCESSING                                    LE0820
0389 C**   CALLS ZSYSTM,TABCHN(2)                                         LE0820
0390 C**                                                                  LE0820
0391 C           FIRST     BEGSR                           ***  FIRST  ***LE0820
     C                     MOVEACPY@      BIS@   80                                           CSC042
     C**                                                                  S01117
     C                     CALL 'AOMMODR0'                                                    CSC042
     C                     PARM '*DBERR ' @RTCD   7                                           CSC042
     C                     PARM '*FIRST ' @OPTN   7                                           CSC042
     C           SDMMOD    PARM SDMMOD    DSFDY                                               CSC042
     C**                                                                  S01117
     C*     IN THE DATAAREA RUNDAT                                        S01117
     C**                                                                  S01117
     C           *NAMVAR   DEFN RUNDAT    RUNDT                           S01117
     C                     IN   RUNDT                                     S01117
     C**                                                                  S01117
     C           *NAMVAR   DEFN           JNSTAT                                            MD054101
     C                     IN   JNSTAT                                                      MD054101
0392 C**                                                                  LE0820
0393 C                     MOVE 'LE0820  'DBPGM                           LE0820
0394 C***********          SETON                     OF                   E13500
0395 C**                                                                  LE0820
0396 C**   ACCESS INSTALATION CONTROL DATA.                               LE0820
0397 C**                                                                  LE0820
0398 C**********           EXSR ZSYSTM                     I.C.D.R 1      S01194
0399 C***99*****           Z-ADD1         DBASE            ***************S01194
0400 C***99*****           GOTO ERROR                      ***  DB  1  ***S01194
0401 C**********                                           ***************S01194
0402 C**********           MOVE '11'      ZTABKY           I.C.D.R 2      S01194
0403 C**********           EXSR TABCHN                     ***************S01194
0404 C***89*****           Z-ADD2         DBASE            ***  DB  2  ***S01194
0405 C***89*****           GOTO ERROR                      ***************S01194
0406 C**********                                                          S01194
0407 C**********           MOVE '20'      ZTABKY           I.C.D.R 3      S01194
0408 C**********           EXSR TABCHN                     ***************S01194
0409 C***89*****           Z-ADD3         DBASE            ***  DB  3  ***S01194
0410 C***89*****           GOTO ERROR                      ***************S01194
     C                     CALL 'AOBANKR0'PLISTA                          S01194
     C           @RTCD     IFNE *BLANKS                                   S01194
     C                     Z-ADD1         DBASE                           S01194
     C                     MOVE 'SDBANKPD'DBFILE                          S01194
     C                     GOTO ERROR                                     S01194
     C                     END                                            S01194
     C**   CHECK SYSTEM DATE FORMAT, DDMMYY OR MMDDYY.                    S01194
     C           BJDFIN    COMP 'M'                      98MMDDYY, 98 ON  S01194
      *                                                                                     MD031174
      **    ACCESS GENERAL LEDGER DETAILS                                                   MD031174
      *                                                                                     MD031174
     C                     CALL 'AOGELRR1'PLISTB                                            MD031174
     C           @RTCD     IFNE *BLANKS                                                     MD031174
     C                     SETON                     U7U8LR                                 MD031174
     C                     Z-ADD2         DBASE                                             MD031174
     C                     MOVE 'SDGELRPD'DBFILE                                            MD031174
     C                     GOTO ERROR                                                       MD031174
     C                     END                                                              MD031174
     C*                                                                   S01117
     C                     CALL 'AORETLR0'PLISTC                          S01194
     C           @RTCD     IFNE *BLANKS                                   S01194
     C                     Z-ADD3         DBASE                           S01194
     C                     MOVE 'SDRETLPD'DBFILE                          S01194
     C                     GOTO ERROR                                     S01194
     C                     END                                            S01194
0411 C**                                                                  LE0820
0412 C**   SET UP FIELDS                                                  LE0820
0413 C**                                                                  LE0820
0414 C                     Z-ADD0         Z3      30                      LE0820
0415 C                     Z-ADD0         NRIT    50                      LE0820
0416 C**********           Z-ADD2         NREC    50                LE0820105140
     C                     Z-ADD2         NREC    90                      105140
0417 C                     BITOF'01234567'PRIN    1                       LE0820
0294 C**                                                                  S01117
     C*    SETON INDICATOR FOR OUTPUT IF MULTIBRANCHING = 'Y'             S01117
     C**                                                                  S01117
     C           MBIN      IFEQ 'Y'                                       S01117
     C                     SETON                     65                   S01117
     C                     END                                            S01117
     C/COPY WNCPYSRC,LE0820C001
      *                                                                   CLE005
      ** Check if CLE005 is switched *ON.                                 CLE005
      *                                                                   CLE005
     C                     MOVE 'N'       CLE005  1                       CLE005
     C                     CALL 'AOSARDR0'                                CLE005
     C                     PARM *BLANKS   @RTCD   7                       CLE005
     C                     PARM '*VERIFY' @OPTN   7                       CLE005
     C                     PARM 'CLE005'  @SARD   6                       CLE005
     C           SCSARD    PARM SCSARD    DSFDY                           CLE005
      *                                                                   CLE005
     C           @RTCD     IFEQ *BLANKS                                   CLE005
     C                     MOVE 'Y'       CLE005                          CLE005
     C                     END                                            CLE005
      *                                                                   CLE005
     C           @RTCD     IFNE *BLANKS                                   CLE005
     C           @RTCD     ANDNE'*NRF   '                                 CLE005
      *                                                                   CLE005
      ** Call to program ended in error                                   CLE005
      *                                                                   CLE005
     C                     MOVE *BLANKS   DBKEY                           CLE005
     C                     MOVEL'CLE005'  DBKEY            ************   CLE005
     C                     MOVE 'SCSARDPD'DBFILE           * DBERR 06 *   CLE005
     C                     Z-ADD006       DBASE            ************   CLE005
     C                     GOTO ERROR                                     CLE005
     C                     ENDIF                                          CLE005
      *                                                                   CLE005
      ** Check if CRE009 is switched *ON.                                 CRE009
      *                                                                   CRE009
     C                     MOVE 'N'       CRE009  1                       CRE009
     C                     CALL 'AOSARDR0'                                CRE009
     C                     PARM *BLANKS   @RTCD   7                       CRE009
     C                     PARM '*VERIFY' @OPTN   7                       CRE009
     C                     PARM 'CRE009'  @SARD   6                       CRE009
     C           SCSARD    PARM SCSARD    DSFDY                           CRE009
      *                                                                   CRE009
     C           @RTCD     IFEQ *BLANKS                                   CRE009
     C                     MOVE 'Y'       CRE009                          CRE009
     C                     END                                            CRE009
      *                                                                   CRE009
     C           @RTCD     IFNE *BLANKS                                   CRE009
     C           @RTCD     ANDNE'*NRF   '                                 CRE009
      *                                                                   CRE009
      ** Call to program ended in error                                   CRE009
      *                                                                   CRE009
     C                     MOVE *BLANKS   DBKEY                           CRE009
     C                     MOVEL'CRE009'  DBKEY            ************   CRE009
     C                     MOVE 'SCSARDPD'DBFILE           * DBERR 06 *   CRE009
     C                     Z-ADD006       DBASE            ************   CRE009
     C                     GOTO ERROR                                     CRE009
     C                     ENDIF                                          CRE009
      *                                                                   CRE009
      *                                                                   CRE009
      ** Access Switchable Feature Details                                CLE033
      *                                                                   CLE033
     C                     MOVE 'N'       CLE033  1                       CLE033
      *                                                                   CLE033
     C                     CALL 'AOSARDR0'                                CLE033
     C                     PARM *BLANKS   @RTCD                           CLE033
     C                     PARM '*VERIFY '@OPTN                           CLE033
     C                     PARM 'CLE033'  @SARD                           CLE033
      *                                                                   CLE033
     C           @RTCD     IFEQ *BLANKS                                   CLE033
      *                                                                   CLE033
     C                     MOVE 'Y'       CLE033                          CLE033
      *                                                                   CLE033
     C                     CALL 'AOSVALR0'                                CLE033
     C                     PARM *BLANKS   @RTCD                           CLE033
     C                     PARM SVAL,1    P@OP01 20                       CLE033
     C                     PARM *BLANKS   P@VL01200                       CLE033
     C                     PARM SVAL,2    P@OP02 20                       CLE033
     C                     PARM *BLANKS   P@VL02200                       CLE033
     C                     PARM SVAL,3    P@OP03 20                       CLE033
     C                     PARM *BLANKS   P@VL03200                       CLE033
     C                     PARM *BLANKS   P@OP04 20                       CLE033
     C                     PARM *BLANKS   P@VL04200                       CLE033
     C                     PARM *BLANKS   P@OP05 20                       CLE033
     C                     PARM *BLANKS   P@VL05200                       CLE033
     C                     PARM *BLANKS   P@OP06 20                       CLE033
     C                     PARM *BLANKS   P@VL06200                       CLE033
     C                     PARM *BLANKS   P@OP07 20                       CLE033
     C                     PARM *BLANKS   P@VL07200                       CLE033
     C                     PARM *BLANKS   P@OP08 20                       CLE033
     C                     PARM *BLANKS   P@VL08200                       CLE033
     C                     PARM *BLANKS   P@OP09 20                       CLE033
     C                     PARM *BLANKS   P@VL09200                       CLE033
     C                     PARM *BLANKS   P@OP10 20                       CLE033
     C                     PARM *BLANKS   P@VL10200                       CLE033
     C********** SDSVAL    PARM SDSVAL    DSSDY                                        CLE033 222373
      *                                                                   CLE033
     C           @RTCD     IFNE *BLANK                                    CLE033
     C                     MOVE *BLANKS   DBKEY                           CLE033
     C                     MOVEL'CLE033'  DBKEY            ************** CLE033
     C                     MOVE 'SDSVALPD'DBFILE           ** DBASE 12 ** CLE033
     C                     Z-ADD012       DBASE            ************** CLE033
     C                     GOTO ERROR                                     CLE033
     C                     ENDIF                                          CLE033
      *                                                                   CLE033
     C**********           MOVELP@VL02    W0ACOD  4                                    CLE033 CGL029
     C                     MOVELP@VL02    W0ACOD 10                                           CGL029
      *                                                                   CLE033
     C                     CALL 'AOACODR0'                                CLE033
     C                     PARM *BLANKS   @RTCD                           CLE033
     C                     PARM '*KEY    '@OPTN                           CLE033
     C**********           PARM W0ACOD    @ACCD   4                                    CLE033 CGL029
     C                     PARM W0ACOD    @ACCD  10                                           CGL029
     C           SDACOD    PARM SDACOD    DSSDY                           CLE033
      *                                                                   CLE033
     C           @RTCD     IFNE *BLANK                                    CLE033
     C                     MOVE *BLANKS   DBKEY                           CLE033
     C                     MOVEL'CLE033'  DBKEY            ************** CLE033
     C                     MOVE 'SDACODPD'DBFILE           ** DBASE 11 ** CLE033
     C                     Z-ADD011       DBASE            ************** CLE033
     C                     GOTO ERROR                                     CLE033
     C                     ENDIF                                          CLE033
      *                                                                   CLE033
     C                     ENDIF                                          CLE033
      *                                                                                       237466
      ** Access SAR details file to see if CEU004 is installed                                237466
      *                                                                                       237466
     C                     MOVE 'N'       CEU004  1                                           237466
      *                                                                                       237466
     C                     CALL 'AOSARDR0'                                                    237466
      *                                                                                       237466
     C                     PARM '       ' @RTCD   7                                           237466
     C                     PARM '*VERIFY' @OPTN   7                                           237466
     C                     PARM 'CEU004'  P@SARD  6                                           237466
      *                                                                                       237466
     C           SCSARD    PARM SCSARD    DSFDY                                               237466
      *                                                                                       237466
     C           @RTCD     IFEQ *BLANK                                                        237466
     C                     MOVE 'Y'       CEU004                                              237466
      *                                                                                       237466
     C                     ENDIF                                                              237466
      *                                                                                       CAP205
      ** Check if CAP205 is switched *ON.                                                     CAP205
      *                                                                                       CAP205
     C                     MOVE 'N'       CAP205  1                                           CAP205
     C                     CALL 'AOSARDR0'                                                    CAP205
     C                     PARM *BLANKS   @RTCD                                               CAP205
     C                     PARM '*VERIFY' @OPTN                                               CAP205
     C                     PARM 'CAP205'  @SARD                                               CAP205
     C           SCSARD    PARM SCSARD    DSFDY                                               CAP205
      *                                                                                       CAP205
     C           @RTCD     IFEQ *BLANKS                                                       CAP205
     C                     MOVE 'Y'       CAP205                                              CAP205
     C                     END                                                                CAP205
      *                                                                                       CAP205
     C           @RTCD     IFNE *BLANKS                                                       CAP205
     C           @RTCD     ANDNE'*NRF   '                                                     CAP205
      *                                                                                       CAP205
      ** Call to program ended in error                                                       CAP205
      *                                                                                       CAP205
     C                     MOVE *BLANKS   DBKEY                                               CAP205
     C                     MOVEL'CAP205'  DBKEY            ************                       CAP205
     C                     MOVE 'SCSARDPD'DBFILE           * DBERR 07 *                       CAP205
     C                     Z-ADD007       DBASE            ************                       CAP205
     C                     GOTO ERROR                                                         CAP205
     C                     ENDIF                                                              CAP205
      *                                                                                       CER049
      ** Determine if CER049 enhancement is installed                                         CER049
      *                                                                                       CER049
     C                     CALL 'AOSARDR0'                                                    CER049
     C                     PARM *BLANKS   @RTCD                                               CER049
     C                     PARM '*VERIFY' @OPTN                                               CER049
     C                     PARM 'CER049'  @SARD                                               CER049
     C           SCSARD    PARM SCSARD    DSFDY                                               CER049
      *                                                                                       CER049
      ** If feature is on, set up SAR work flag                                               CER049
      *                                                                                       CER049
     C           @RTCD     IFEQ *BLANKS                                                       CER049
     C                     MOVE 'Y'       CER049                                              CER049
     C                     ELSE                                                               CER049
     C                     MOVE 'N'       CER049  1                                           CER049
     C                     ENDIF                                                              CER049
      *                                                                   CLE033
      ** CLE134 - Past Due Call Loans                                                         CLE134
      *                                                                                       CLE134
     C                     MOVE 'N'       CLE134  1                                           CLE134
     C                     CALL 'AOSARDR0'                                                    CLE134
     C                     PARM '       ' @RTCD   7                                           CLE134
     C                     PARM '*VERIFY' @OPTN   7                                           CLE134
     C                     PARM 'CLE134'  P@SARD  6                                           CLE134
     C           SCSARD    PARM SCSARD    DSFDY                                               CLE134
     C           @RTCD     IFEQ *BLANK                                                        CLE134
     C                     MOVE 'Y'       CLE134                                              CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE141
      ** Check if CLE141 is switched on                                                       CLE141
      *                                                                                       CLE141
     C                     MOVE 'N'       CLE141  1                                           CLE141
     C                     CALL 'AOSARDR0'                                                    CLE141
     C                     PARM '       ' @RTCD                                               CLE141
     C                     PARM '*VERIFY' @OPTN                                               CLE141
     C                     PARM 'CLE141'  P@SARD                                              CLE141
     C           SCSARD    PARM SCSARD    DSFDY                                               CLE141
     C           @RTCD     IFEQ *BLANK                                                        CLE141
     C                     MOVE 'Y'       CLE141                                              CLE141
     C                     ENDIF                                                              CLE141
      *                                                                                       CLE141
      ** Check if CLE031 is switched on                                                     MD053873
      *                                                                                     MD053873
     C                     MOVEL'N'       CLE031  1                                         MD053873
     C                     CALL 'AOSARDR0'                                                  MD053873
     C                     PARM *BLANKS   @RTCD                                             MD053873
     C                     PARM '*VERIFY' @OPTN                                             MD053873
     C                     PARM 'CLE031'  P@SARD                                            MD053873
     C           SCSARD    PARM SCSARD    DSFDY                                             MD053873
     C           @RTCD     IFEQ *BLANKS                                                     MD053873
     C                     MOVEL'Y'       CLE031                                            MD053873
     C                     ENDIF                                                            MD053873
      *                                                                                     MD053873
0418 C                     GOTO ENDFC                                     LE0820
0419 C**                                                                  LE0820
0420 C*****DATABASE*ERROR*ON*TABLE*CHAIN*                                 S01194
0420 C**   DATABASE ERROR ON ACCESS PROGRAM                               S01194
0421 C**                                                                  LE0820
0422 C           ERROR     TAG                             ** ERROR TAG **LE0820
0423 C**                                                                  LE0820
0424 C                     SETON                     U7U8LR               LE0820
0425 C**********           MOVELZTABKY    DBKEY                           S01194
0426 C**********           MOVE 'TABLE'   DBFILE                          S01194
0427 C**                                                                  LE0820
     C/COPY WNCPYSRC,LEH01447
     C                     MOVEL*BLANKS   WACKEY 20                                           CGL020
     C                     MOVE *BLANKS   FEEFLG  1                                           CGL020
     C                     Z-ADD0         FEEVAL 130                                          CGL020
     C                     Z-ADD0         FEEPCT  52                                          CGL020
     C                     MOVE *BLANKS   RORACT 20                                           CGL020
     C                     MOVE *BLANKS   RORCTY  2                                           CGL020
     C                     MOVE *BLANKS   RORBNK 20                                           CGL020
     C                     MOVE *BLANKS   RORCDE 11                                           CGL020
     C                     MOVE *BLANKS   PORACT 20                                           CGL020
     C                     MOVE *BLANKS   PORCTY  2                                           CGL020
     C                     MOVE *BLANKS   PORBNK 20                                           CGL020
     C                     MOVE *BLANKS   PORCDE 11                                           CGL020
     C                     MOVE *BLANKS   DSTACT 35                                           CGL020
     C                     MOVE *BLANKS   DSTCTY  2                                           CGL020
     C                     MOVE *BLANKS   DSTBNK 20                                           CGL020
     C                     Z-ADD0         SETDAT  50                                          CGL020
     C                     MOVE *BLANKS   TICKER 10                                           CGL020
     C                     MOVE *BLANKS   EXCHNG 20                                           CGL020
     C                     Z-ADD0         NOMINL 132                                          CGL020
     C                     MOVE *BLANKS   FDTRID 16                                           CGL020
      *                                                                                       CGL020
0428 C           ENDFC     ENDSR                           ***  ENDFC  ***LE0820
0429 C**                                                                  LE0820
0430 C**                                                                  LE0820
0431 C********************************************************************LE0820
0432 C********************************************************************LE0820
0433 C**                                                                  LE0820
0434 C**   SUBROUTINE TO PROCESS DETAIL RECS - DETAIL                     LE0820
0435 C**                                                                  LE0820
0436 C**   CALLED FROM MAIN PROCESSING                                    LE0820
0437 C**   CALLS HASH,POSTCK,POSTOT,WHTAX,ZDATE2                          LE0820
0438 C**                                                                  LE0820
0439 C           DETAIL    BEGSR                           *** DETAIL  ***LE0820
     C*                                                                   S01117
     C           MBIN      IFEQ 'Y'                                       S01117
     C*                                                                   S01117
     C           *INL1     IFEQ '1'                                       S01117
     C                     CLOSELE0820P1                                  S01117
     C                     SETOF                     71                   S01117
     C**                                                                  S01117
     C*       IF MBIN=YES, AND A LEVEL BREAK                              S01117
     C*       OPEN LE0820P1                                               S01117
     C**                                                                  S01117
     C                     SETON                     70    ALLOW OUTPUT   S01117
     C                     OPEN LE0820P1                                  S01117
     C                     Z-ADD0         PAGE                            S01117
     C                     Z-ADD0         PAGE1                           S01117
     C**                                                                  S01117
     C**  ENSURE TOTALS SPOOL FILE RECORDED BY RCF                        S01117
     C**                                                                  S01117
     C                     Z-ADDSFNUM     ZSNUM   60                      S01117
     C                     OUT  LDA                                       S01194
      *                                                                   S01117
     C                     CALL 'ZSFILE'                                  S01117
     C                     PARM           SEQ     5                       S01117
     C                     PARM EBRC      SENTY                           S01117
     C                     PARM           SFILE                           S01117
     C                     PARM           ZSNUM                           S01117
     C                     PARM           ZSERR   1                       S01117
     C           *LOCK     IN   LDA                                       S01194
      *                                                                   S01117
     C           ZSERR     IFEQ 'Y'                                       S01117
      ** ERROR DURING ZSFILE PROCESSING, RETURN TO CALLING PROGRAM        S01117
     C                     SETON                     U7U8LR               S01117
     C                     RETRN                                          S01117
     C                     END                                            S01117
     C**                                                                  S01117
     C** RETRIEVE BRANCH NAME                                             S01117
     C**********           CALL 'AOBRCHR0'                                             S01117 CGL029
     C                     CALL 'AOBRCHR1'                                                    CGL029
     C                     PARM '*MSG   ' @RTCD   7                       S01117
     C                     PARM '*KEY   ' @OPTN   7                       S01117
     C                     PARM EBRC      @DSNB   3                       S01117
     C********** SDBRCH    PARM SDBRCH    DSFDY                                        S01117 CGL029
     C           SDBRCH    PARM SDBRCH    DSSDY                                               CGL029
     C           @RTCD     IFNE *BLANK                                    S01117
     C                     SETON                     U7U8LR               S01117
     C                     MOVEL'SDBRCHPD'DBFILE                          S01117
     C                     MOVEL@DSNB     DBKEY            ***************S01117
     C                     MOVEL'005'     DBASE            * DBERROR  05**S01117
     C                     MOVE *BLANKS   BRNM             ***************S01117
     C                     EXSR *PSSR                                     S01117
     C                     END                                            S01117
     C           *INU7     IFEQ '1'                                       S01117
     C                     GOTO ENDD                                      S01117
     C                     END                                            S01117
     C**                                                                  S01117
     C                     END                                            S01117
     C**                                                                  S01117
     C                     ELSE                                           S01117
     C**                                                                  S01117
     C*       IF MBIN='N' AND FIRST CYCLE,                                S01117
     C*       OPEN LE0820P1                                               S01117
     C**                                                                  S01117
     C           P1OP      IFNE 'Y'                                       S01117
     C                     SETON                     70    ALLOW OUTPUT   S01117
     C                     MOVE 'Y'       P1OP    1                       S01117
     C                     OPEN LE0820P1                                  S01117
     C                     Z-ADD0         PAGE                            S01117
     C                     Z-ADD0         PAGE1                           S01117
     C**                                                                  S01117
     C*       ENSURE REPORT SPOOL FILE RECORDED BY RCF                    S01117
     C**                                                                  S01117
     C                     Z-ADDSFNUM     ZSNUM                           S01117
     C                     OUT  LDA                                       S01194
      *                                                                   S01117
     C                     CALL 'ZSFILE'                                  S01117
     C                     PARM           SEQ                             S01117
     C                     PARM EBRC      SENTY   3                       S01117
     C                     PARM           SFILE                           S01117
     C                     PARM           ZSNUM                           S01117
     C                     PARM           ZSERR   1                       S01117
     C           *LOCK     IN   LDA                                       S01194
      *                                                                   S01117
     C           ZSERR     IFEQ 'Y'                                       S01117
      ** ERROR DURING ZSFILE PROCESSING, RETURN TO CALLING PROGRAM        S01117
     C                     SETON                     U7U8LR               S01117
     C                     RETRN                                          S01117
     C                     END                                            S01117
     C                     END                                            S01117
     C                     END                                            S01117
     C**                                                                  S01117
0440 C**                                                                  LE0820
0441 C**   INCREMENT RECORD COUNT AND HASH ON ALL DETAIL RECS             LE0820
0443 C           NREC      ADD  1         NREC                            LE0820
0444 C**                                                                  LE0820
     C********** ETYP      IFEQ '63V1'                                                261881 261881A
     C********** ETYP      OREQ '65V1'                                                261881 261881A
     C********** ETYP      OREQ '67V1'                                                261881 261881A
     C**********           SUB  OTHA      EAMT                                        261881 261881A
     C**********           ENDIF                                                      261881 261881A
0445 C                     Z-ADD1         S       10                      LE0820
0446 C           EAMT      DIV  1000      ZZAMT                           LE0820
0447 C**                                                                  LE0820
0448 C                     EXSR HASH                                      LE0820
     C           ETYP      IFEQ '63V1'                                                       261881A
     C           ETYP      OREQ '65V1'                                                       261881A
     C           ETYP      OREQ '67V1'                                                       261881A
     C                     SUB  OTHA      EAMT                                               261881A
     C                     ENDIF                                                             261881A
      *                                                                                       259640
     C                     MOVE '0'       *IN11                                               259640
      *                                                                                       237466
      ** Get repayment base date to reflect actual event date.                                237466
      *                                                                                       237466
      *                                                                                       237466
      ** Key list for CLOANCL of CLOAN.                                                       237466
      *                                                                                       237466
     C           KLNRF     KLIST                                                              237466
     C                     KFLD           LNRF                                                237466
     C                     KFLD           KRTP    1                                           237466
     C                     MOVE 'A'       KRTP                                                237466
     C           KLNRF     CHAINCLOAN                14                                       237466
      *                                                                                       237466
     C           *IN14     IFEQ '0'                                                           237466
     C           LASN      ANDEQ0                                                             237466
      *                                                                                       237466
      ** Check if repayment event date was obtaind from base date.                            237466
      *                                                                                       237466
     C**********           MOVE '0'       *IN11                                        237466 259640
     C           CLE005    IFEQ 'Y'                                                           237466
     C                     Z-ADD0         ZNRDYS                                              237466
     C                     Z-ADD0         WEDAT   50                                          237466
     C                     Z-ADDEDAT      OEDAT   50                                          237466
     C                     EXSR SRSCUR                                                        237466
     C                     EXSR MATLOC                                                        237466
     C                     MOVE ZCCY      ZCCY3   3                                           237466
     C                     MOVE ZLOC      ZLOC3   3                                           237466
     C                     MOVE ZCCY2     ZCCY                                                237466
     C                     MOVE W@MDSL    ZLOC                                                237466
     C           ETP       IFEQ 'I2'                                                          237466
     C                     Z-ADDIBDTX     WEDAT                                               237466
     C                     ENDIF                                                              237466
     C           ETP       IFEQ 'R1'                                                          237466
     C           ETP       OREQ 'R2'                                                          237466
     C                     Z-ADDRBDTX     WEDAT                                               237466
     C                     ENDIF                                                              237466
     C           ETP       IFEQ 'M1'                                                          237466
     C           ETP       OREQ 'M2'                                                          237466
     C           ETP       OREQ 'P1'                                                          CLE134
     C           ETP       OREQ 'P2'                                                          CLE134
     C                     Z-ADDMDATX     WEDAT                                               237466
     C                     ENDIF                                                              237466
     C                     Z-ADDWEDAT     ZDAYNO                                              237466
     C           CLE141    IFEQ 'Y'                                                           CLE141
     C********** MDSTX     ANDEQ01                                                            CLE141
     C********** CLE141    OREQ 'Y'                                                   CLE141 CLE141A
     C********** MDSTX     ANDEQ07                                                    CLE141 CLE141A
     C********** CLE141    OREQ 'Y'                                                   CLE141 CLE141A
     C********** MDSTX     ANDEQ08                                                    CLE141 CLE141A
     C********** CLE141    OREQ 'Y'                                                   CLE141 CLE141A
     C********** MDSTX     ANDEQ02                                                    CLE141 CLE141A
     C********** CLE141    OREQ 'Y'                                                   CLE141 CLE141A
     C********** MDSTX     ANDEQ12                                                    CLE141 CLE141A
     C                     MOVELPTDIX     PAYIND                                              CLE141
     C                     CALL 'LEZBDYCD'BDCHK                                               CLE141
     C                     MOVELZADJDT    ZDYNBR                                              CLE141
     C                     ELSE                                                               CLE141
     C                     SELEC                                                              237466
     C           PTDIX     WHEQ 'P'                                                           237466
     C                     EXSR ZBKDT                                                         237466
     C           PTDIX     WHEQ 'N'                                                           237466
     C                     EXSR ZFWDT                                                         237466
     C           PTDIX     WHEQ 'M'                                                           237466
     C           PTDIX     OREQ *BLANK                                                        237466
     C                     EXSR ZDATE2                                                        237466
     C           *IN98     IFEQ *OFF                                                          237466
     C                     MOVE ZDATE     MMYY    40P                                         237466
     C                     MOVELMMYY      MMNLCD  20P                                         237466
     C                     ELSE                                                               237466
     C                     MOVELZDATE     MMNLCD    P                                         237466
     C                     ENDIF                                                              237466
     C                     Z-ADDZDAYNO    @DAYNO  50                                          237466
     C                     EXSR ZFWDT                                                         237466
     C                     Z-ADDZDYNBR    ZDAYNO                                              237466
     C                     EXSR ZDATE2                                                        237466
     C           *IN98     IFEQ *OFF                                                          237466
     C                     MOVE ZDATE     MMYY      P                                         237466
     C                     MOVELMMYY      MMNWKD  20P                                         237466
     C                     ELSE                                                               237466
     C                     MOVELZDATE     MMNWKD    P                                         237466
     C                     ENDIF                                                              237466
     C           MMNLCD    IFNE MMNWKD                                                        237466
     C                     Z-ADD@DAYNO    ZDAYNO                                              237466
     C                     EXSR ZBKDT                                                         237466
     C                     ENDIF                                                              237466
     C                     ENDSL                                                              237466
     C                     ENDIF                                                              CLE141
     C                     Z-ADDZDYNBR    WEDAT                                               237466
     C                     MOVE ZCCY3     ZCCY                                                237466
     C                     MOVE ZLOC3     ZLOC                                                237466
     C                     ENDIF                                                              237466
      *                                                                                       237466
      ** If event type is I2.                                                                 237466
      *                                                                                       237466
     C           ETP       IFEQ 'I2'                                                          237466
     C           WEDAT     ANDEQEDAT                                                          237466
     C                     Z-ADDNIDTX     EDAT                                                237466
     C           EDAT      IFGT RUND                                                          237466
     C                     MOVE '1'       *IN40                                               237466
     C                     ELSE                                                               237466
     C                     MOVE '0'       *IN40                                               237466
     C                     ENDIF                                                              237466
     C                     MOVE '1'       *IN11                                               237466
     C                     ENDIF                                                              237466
      *                                                                                       237466
      ** If event type is M1 or  M2.                                                          237466
      *                                                                                       237466
     C           ETP       IFEQ 'M1'                                                          237466
     C           WEDAT     ANDEQEDAT                                                          237466
     C           ETP       OREQ 'M2'                                                          237466
     C           WEDAT     ANDEQEDAT                                                          237466
     C           ETP       OREQ 'P1'                                                          CLE134
     C           WEDAT     ANDEQEDAT                                                          CLE134
     C           ETP       OREQ 'P2'                                                          CLE134
     C           WEDAT     ANDEQEDAT                                                          CLE134
     C                     Z-ADDMDATX     EDAT                                                237466
     C           EDAT      IFGT RUND                                                          237466
     C                     MOVE '1'       *IN40                                               237466
     C                     ELSE                                                               237466
     C                     MOVE '0'       *IN40                                               237466
     C                     ENDIF                                                              237466
     C                     MOVE '1'       *IN11                                               237466
     C                     ENDIF                                                              237466
      *                                                                                       237466
      ** If event type is R1 or  R2.                                                          237466
      *                                                                                       237466
     C           ETP       IFEQ 'R1'                                                          237466
     C           WEDAT     ANDEQEDAT                                                          237466
     C           ETP       OREQ 'R2'                                                          237466
     C           WEDAT     ANDEQEDAT                                                          237466
     C                     Z-ADDNRPDX     EDAT                                                237466
     C           EDAT      IFGT RUND                                                          237466
     C                     MOVE '1'       *IN40                                               237466
     C                     ELSE                                                               237466
     C                     MOVE '0'       *IN40                                               237466
     C                     ENDIF                                                              237466
     C                     MOVE '1'       *IN11                                               237466
     C                     ENDIF                                                              237466
      *                                                                                       237466
     C                     ENDIF                                                              237466
      *                                                                                     MD052216
      ** Get fee payment base date to reflect actual event date                             MD052216
      *                                                                                     MD052216
     C********** ETP       IFEQ 'F1'                                               MD052216 MD053950
     C********** LASN      ANDNE*ZEROS                                             MD052216 MD053950
     C********** ETP       OREQ 'F2'                                               MD052216 MD053950
     C********** LASN      ANDNE*ZEROS                                             MD052216 MD053950
     C           LASN      IFNE *ZEROS                                                      MD053950
     C           ETP       IFEQ 'F1'                                                        MD053950
     C           ETP       OREQ 'F2'                                                        MD053950
     C           ETP       OREQ 'FX'                                                        MD053950
     C           ETP       OREQ 'FY'                                                        MD053950
     C                     EXSR SRFPAD                                                      MD052216
     C                     ENDIF                                                            MD052216
     C                     ENDIF                                                            MD053950
0449 C**                                                                  LE0820
0450 C**   CHECK VALUE DATE NOT GREATER THAN RUN DATE                     LE0820
0451 C**                                                                  LE0820
     C           CRE009    IFEQ 'Y'                                       CRE009
      *                                                                   CRE009
     C           *LOCK     IN   REPMED                                    CRE009
     C                     MOVE REPMED    WDATE   50                      CRE009
      *                                                                   CRE009
     C           EDAT      IFGE RUND                                      CRE009
     C           EDAT      ANDLEWDATE                                     CRE009
     C                     MOVE *OFF      *IN40                           CRE009
     C                     ENDIF                                          CRE009
     C                     ELSE                                           CRE009
0452 C********** EDAT      COMP RUND                 4040                              LE0820 237466
     C                     MOVE '0'       *IN40                                              BUG8552
     C  N11      EDAT      COMP RUND                 4040                                     237466
      *                                                                                      BUG8552
     C           EDAT      IFGT RUND                                                         BUG8552
     C           EDAT      OREQ 0                                                            BUG8552
     C                     MOVE '1'       *IN40                                              BUG8552
     C                     ENDIF                                                             BUG8552
      *                                                                                      BUG8552
     C                     MOVE '0'       *IN56                                              BUG8552
      *                                                                                      BUG8552
     C           EDAT      IFLT RUND                                                         BUG8552
     C           EDAT      ANDNE0                                                            BUG8552
     C                     MOVE '1'       *IN56                                              BUG8552
     C                     MOVE RUND      WPOST   50                                         BUG8552
     C                     ENDIF                                                             BUG8552
     C                     ENDIF                                          CRE009
0453 C**                                                                  LE0820
0454 C**   CHECK FOR EVENT TYPE TO CONTINUE PROCESSING                    LE0820
0455 C**                                                                  LE0820
0456 C           ETP       LOKUPTABEVT    TABNAM         86               LE0820
0457 C   86                MOVE TABNAM    EVENT  18                       LE0820
0458 C  N86                SETON                     40                   LE0820
0459 C**                                                                  LE0820
      **   M2s and R2s still required for Risk / Guarantee Loans                           AR1096915
      *                                                                                    AR1096915
     C           ETP       IFEQ 'M2'                                                         BUG7568
     C           *IN86     ANDEQ*ON                                                          BUG7568
     C           PTP       ANDNE'70'                                                       AR1096915
     C           PTP       ANDNE'71'                                                        MD054877
     C           PTP       ANDNE'72'                                                        MD054877
     C           ETP       OREQ 'P2'                                                          CLE134
     C           *IN86     ANDEQ*ON                                                           CLE134
     C           ETP       OREQ 'R2'                                                         BUG7568
     C           *IN86     ANDEQ*ON                                                          BUG7568
     C           PTP       ANDNE'70'                                                       AR1096915
     C           PTP       ANDNE'71'                                                        MD054877
     C           PTP       ANDNE'72'                                                        MD054877
     C                     MOVE *ON       *IN55                                              BUG7568
     C                     ENDIF                                                             BUG7568
      *                                                                                      BUG7568
     C           CLE033    IFEQ 'Y'                                       CLE033
     C           *IN86     ANDEQ'1'                                                           222187
     C           EDAT      ANDLTBJDNWD                                    CLE033
     C           EDAT      ANDNE0                                                             219230
     C           EAMT      ANDNE0                                                             219230
     C           SETP      ANDEQ09                                        CLE033
     C           IBRE      ANDNE'Y'                                                           218992
     C                     EXSR HPOST                                     CLE033
     C**********           MOVE *OFF      *IN55                                       BUG7568 237362
     C                     ENDIF                                          CLE033
     C*                                                                   CLE033
      * If settlment is in another currency, bypass event processing:                         CLE031
     C           SIAC      IFEQ 'Y'                                                           CLE031
     C           *IN55     OREQ *ON                                                          BUG7568
     C                     SETON                     40                                       CLE031
     C                     ENDIF                                                              CLE031
      *                                                                                     MD031174
     C           ETP       IFEQ 'V1'                                                        MD031174
     C           EDAT      ANDGTPRUND                                                       MD031174
     C           BKANWD    ANDEQ'2'                                                         MD031174
     C           ETP       OREQ 'V3'                                                        MD031174
     C           EDAT      ANDGTPRUND                                                       MD031174
     C           BKANWD    ANDEQ'2'                                                         MD031174
     C                     SETOF                     40                                     MD031174
     C                     ENDIF                                                            MD031174
      *                                                                                     MD031174
0460 C   40                GOTO ENDDET                                    LE0820
0461 C**                                                                  LE0820
0462 C**   SET UP ACCOUNT KEY CURRENCY                                    LE0820
0463 C**                                                                  LE0820
0464 C                     MOVE ECCY      ACCY                            LE0820
0465 C**                                                                  LE0820
0466 C**   SETON INDICATORS FOR EVENT TYPE                                LE0820
0467 C**                                                                  LE0820
0468 C           ETP       COMP 'I2'                 864142               LE0820
0469 C   86      ETP       COMP 'R1'                 864344               LE0820
     C   86      ETP       COMP 'R4'                 863132               S01392
     C   86      ETP       COMP 'R5'                 86  33               S01392
0470 C   86      ETP       COMP 'V3'                   4546               LE0820
      *                                                                                192289 CLE031
     C********** ETP       IFEQ 'MX'                                                   192289 CLE031
     C********** ETP       OREQ 'MY'                                                   192289 CLE031
     C**********           MOVE '0'       *IN43                                        192289 CLE031
     C**********           END                                                         192289 CLE031
      *                                                                                       CLE031
      * Event type IY: set off fee indicator & set on interest indicator                      CLE031
     C           ETP       IFEQ 'IY'                                                          CLE031
     C                     SETOF                     41                                       CLE031
     C                     SETON                     42                                       CLE031
     C                     ENDIF                                                              CLE031
      *                                                                                       CLE031
      * Event types RX or RY: set off maturity indicator,                                     CLE031
      * and set on repayment indicator.                                                       CLE031
     C           ETP       IFEQ 'RX'                                                          CLE031
     C           ETP       OREQ 'RY'                                                          CLE031
     C                     SETOF                     43                                       CLE031
     C                     SETON                     44                                       CLE031
     C                     ENDIF                                                              CLE031
      *                                                                                     MD051891
     C           ETP       IFEQ 'RX'                                                        MD051891
     C           ETP       OREQ 'RY'                                                        MD051891
     C           ETP       OREQ 'MX'                                                        MD051891
     C           ETP       OREQ 'MY'                                                        MD051891
     C           EAMT      IFEQ OTHA                                                        MD051891
     C                     Z-ADD0         OTHA                                              MD051891
     C                     ENDIF                                                            MD051891
     C                     ENDIF                                                            MD051891
      *                                                                                       CLE031
      * Event type RZ: set off Maturity indicator,                                            CLE031
      * and set on New Principal Indicator,                                                   CLE031
     C           ETP       IFEQ 'RZ'                                                          CLE031
     C                     SETOF                     43                                       CLE031
     C                     SETON                     31                                       CLE031
     C                     ENDIF                                                              CLE031
      *                                                                                       CLE031
      * Event type R2: set off New Principal Indicator,                                       CLE031
      * and set on Repayment Indicator,                                                       CLE031
     C           ETP       IFEQ 'R2'                                                          CLE031
     C                     SETOF                     31                                       CLE031
     C                     SETON                     44                                       CLE031
     C                     ENDIF                                                              CLE031
      *                                                                                       CLE031
      * Event type VZ: set off Start Indicator,                                               CLE031
      * and set on Principal Increase Indicator.                                              CLE031
     C           ETP       IFEQ 'VZ'                                                          CLE031
     C                     SETOF                     45                                       CLE031
     C                     SETON                     46                                       CLE031
     C                     ENDIF                                                              CLE031
0471 C**                                                                  LE0820
0472 C**   SETON INDICATORS FOR PROCESSING TYPE                           LE0820
0473 C**                                                                  LE0820
     C           PTP       COMP '63'                     63               S01392
     C   31                                                               S01392
     COR 32                                                               S01392
     COR 33      PTP       COMP '63'                 4040                 S01392
0474 C   45      PTP       COMP '70'                     40               LE0820
0475 C           PTP       LOKUPTABPTS                   47               LE0820
      *                                                                   CLE005
      ** If SAR CLE005 is Present and *IN45 is *ON and PTP IS 71 OR 72    CLE005
      *                                                                   CLE005
     C           CLE005    IFEQ 'Y'                                       CLE005
     C           *IN45     ANDEQ*ON                                       CLE005
      *                                                                   CLE005
     C           PTP       IFEQ '71'                                      CLE005
     C           PTP       OREQ '72'                                      CLE005
     C                     MOVE *ON       *IN40                           CLE005
     C                     ENDIF                                          CLE005
      *                                                                   CLE005
     C                     ENDIF                                          CLE005
      *                                                                                    AR375891A
      ** If ETP is F1, this is a fee event attached to a loan. PTP does not                AR375891A
      ** reflect the correct processing type so it must be checked on CLOANCL              AR375891A
      *                                                                                    AR375891A
     C           ETP       IFEQ 'F1'                                                       AR375891A
     C           LNRF      CHAINCLOAN                66                                    AR375891A
      *                                                                                    AR375891A
     C           PTYPX     IFEQ 66                                                         AR375891A
     C           PTYPX     OREQ 67                                                         AR375891A
     C           PTYPX     OREQ 69                                                         AR375891A
     C           PTYPX     OREQ 72                                                         AR375891A
     C                     MOVE '0'       *IN41                                            AR375891A
     C                     MOVE '1'       *IN25                                            AR375891A
     C                     MOVE '1'       *IN47                                            AR375891A
     C                     ENDIF                                                           AR375891A
     C                     ENDIF                                                           AR375891A
     C*                                                                   123275
     C** Set value of Deal/Loan Reference (DLREF) to Loan Reference       123275
     C** no. or Facility no. according to fee type.                       123275
     C*                                                                   123275
      * If *IN41 is on (Fee event)                                                            CLE031
     C                     MOVE *BLANKS   TRAN06  6                                         AR548455
     C                     MOVE *BLANKS   TRAN05                                            AR548455
     C           *IN41     IFEQ '1'                                       123275
     C           *IN25     OREQ '1'                                                        AR375891A
     C********** *IN71     ANDEQ'0'                                                    123275 CLE031
     C/COPY WNCPYSRC,LEH00958
      * If facility fee:                                                                      CLE031
     C           ETP       IFEQ 'F2'                                                          CLE031
     C           ETP       OREQ 'FY'                                                          CLE031
     C                     MOVE 'F3'      WPREF   20       Posting Ref.                       CLE031
     C**********           MOVE *BLANKS   TRAN06  6                                  123275 AR548455
     C                     MOVELFTYP      TRAN05  5                       123275
     C                     MOVE FSEQ      TRAN05                          123275
     C                     MOVE TRAN05    TRAN06                          123275
     C                     ELSE                                           123275
     C/COPY WNCPYSRC,LEH00959
      * Else, Loan fee:                                                                       CLE031
     C                     MOVE 'F1'      WPREF            Posting Ref.                       CLE031
     C                     MOVE LNRF      TRAN06                                              CLE031
     C                     ENDIF                                                              CLE031
      * Else, not a fee event:                                                                CLE031
     C                     ELSE                                                             AR548455
     C                     MOVE LNRF      TRAN06                          123275
     C                     END                                            123275
0476 C**                                                                  LE0820
0477 C**   CHECK AUTO SETTLE IND IF REQUIRED                              LE0820
0478 C**                                                                  LE0820
      *                                                                                       CLE134
     C                     MOVE AUTO      WAUTO   1                                           CLE134
     C           WAUTO     IFEQ 'C'                                                           CLE134
     C           CLE134    ANDEQ'Y'                                                           CLE134
     C                     MOVE 'Y'       WAUTO                                               CLE134
     C                     ENDIF                                                              CLE134
      *                                                                                       CLE134
0479 C   42                                                               LE0820
0480 COR 43                                                               LE0820
0481 C***OR*44**      AUTO      COMP 'Y'                  4040                         LE0820 CLE134
0481 COR 44      WAUTO     COMP 'Y'                  4040                                     CLE134
0482 C**                                                                  LE0820
0483 C**   FOR 'I2' I/O IND MUST NOT BE BLANK                             LE0820
0484 C**                                                                  LE0820
0485 C   42N40   INOI      COMP ' '                      40               LE0820
0486 C**                                                                  LE0820
0487 C**   CHECK SETTLEMENT IS RETAIL AND CHAIN TO ACCNT                  LE0820
0488 C**                                                                  LE0820
      **Ignore*interbranch*events*****                             030176 146132
     C************IN40     IFEQ '0'                                030176 146132
     C***********IBRE      ANDEQ'Y'                                030176 146132
     C***********          MOVE '1'       *IN40                    030176 146132
     C***********          END                                     030176 146132
      *                                                            030176 146132
      * Ignore interbranch events for fees                                                    261191
     C           *IN40     IFEQ '0'                                                           261191
     C           *IN41     ANDEQ'1'                                                           261191
     C           IBRE      ANDEQ'Y'                                                           261191
     C                     MOVE '1'       *IN40                                               261191
     C                     ENDIF                                                              261191
      * Ignore if not auto settle                                                             261191
     C           *IN40     IFEQ '0'                                                           261191
     C           *IN41     ANDEQ'1'                                                           261191
     C           AUTO      ANDEQ'N'                                                           261191
     C                     MOVE '1'       *IN40                                               261191
     C                     ENDIF                                                              261191
      *                                                                                       261191
     C           *IN41     IFEQ '0'                                                           222446
     C           *IN25     ANDEQ'0'                                                        AR375891A
     C           *IN40     IFEQ '0'                                                           222446
     C           IBRE      ANDEQ'N'                                                           222446
     C           EBRC      ANDNEOSBR                                                          222446
     C           *IN40     OREQ '0'                                                           222446
     C           IBRE      ANDEQ'Y'                                                           222446
     C           OSAC      ANDEQ*BLANKS                                                       222446
     C                     MOVE '1'       *IN40                                               222446
     C                     ENDIF                                                              222446
     C                     ENDIF                                                              222446
      *                                                                                     MD051891
     C           *IN40     IFEQ '0'                                                         MD051891
     C           IBRE      ANDEQ'Y'                                                         MD051891
     C           OSAC      ANDNE*BLANKS                                                     MD051891
      *                                                                                     MD051891
     C           PTP       IFEQ '66'                                                        MD051891
     C           PTP       OREQ '67'                                                        MD051891
     C           PTP       OREQ '69'                                                        MD051891
     C           PTP       OREQ '72'                                                        MD051891
     C           INOI      IFEQ 'I'                                                         MD051891
     C                     MOVE '1'       *IN40                                             MD051891
     C                     ENDIF                                                            MD051891
     C                     ENDIF                                                            MD051891
      *                                                                                     MD051891
     C           PTP       IFNE '66'                                                        MD051891
     C           PTP       ANDNE'67'                                                        MD051891
     C           PTP       ANDNE'69'                                                        MD051891
     C           PTP       ANDNE'72'                                                        MD051891
     C           INOI      ANDEQ'O'                                                         MD051891
     C                     MOVE '1'       *IN40                                             MD051891
     C                     ENDIF                                                            MD051891
     C                     ENDIF                                                            MD051891
      *                                                                                       222446
      ** For commitment fees                                              157984
      *                                                                   157984
     C           *IN41     IFEQ '1'                                       157984
     C           *IN40     ANDEQ'0'                                       157984
     C           *IN25     OREQ '1'                                                        AR375891A
     C           *IN40     ANDEQ'0'                                                        AR375891A
      *                                                                   157984
     C           AUTO      IFNE 'Y'                                       157984
     C           AUTO      ANDNE'C'                                                           CLE134
     C                     MOVE '1'       *IN40                           157984
     C                     ENDIF                                          157984
     C           *IN40     IFEQ '0'                                       157984
     C           IBRE      ANDEQ'Y'                                       157984
     C           INOI      ANDEQ'O'                                       157984
     C                     MOVE '1'       *IN40                           157984
     C                     ENDIF                                          157984
      *                                                                   157984
     C                     ENDIF                                          157984
      *                                                                   157984
0489 C  N40                EXSR POSTCK                                    LE0820
      ** If CRE009 is ON and Account is RE write recs greater than the    CRE009
      ** rundate to RSACMTPD.                                             CRE009
      *                                                                   CRE009
     C           CRE009    IFEQ 'Y'                                       CRE009
      *                                                                   CRE009
     C           ATYP      IFNE 'R'                                       CRE009
     C           EDAT      ANDGTRUND                                      CRE009
     C           ATYP      ORNE 'R'                                       CRE009
     C           EDAT      ANDLTRUND                                      CRE009
     C                     MOVE *ON       *IN40                           CRE009
     C                     ENDIF                                          CRE009
     C                     ENDIF                                          CRE009
      *                                                                   CRE009
0490 C**                                                                  LE0820
0491 C**   END PROCESSING IF REQUIRED ( IND 40 ON )                       LE0820
0492 C**                                                                  LE0820
0493 C   40                GOTO ENDDET                                    LE0820
0494 C**                                                                  LE0820
0495 C**   PROCESS EVENTS                                                 LE0820
0496 C**                                                                  LE0820
0497 C**   CALCULATE ADJUSTMENT FOR GROSS W/TAX IF REQUIRED               LE0820
0498 C**                                                                  LE0820
0499 C   42                Z-ADDEAMT      AMOUNT 130                      LE0820
0500 C   43                                                               LE0820
0501 COR 44                Z-ADDOTHA      AMOUNT                          LE0820
0502 C   42                                                               LE0820
0503 COR 43                                                               LE0820
0504 COR 44                EXSR WHTAX                                     LE0820
0505 C   42      EAMT      SUB  AMOUNT    EAMT                            LE0820
0506 C   43                                                               LE0820
0507 COR 44      OTHA      SUB  AMOUNT    OTHA                            LE0820
0508 C***43******                                                         S01392
0508 C***43N63**                                                                    S01392 AR1096915
0509 C*OR*44**** EAMT      ADD  OTHA      EAMT                                      LE0820 AR1096915
      *                                                                                    AR1096915
     C           *IN43     IFEQ '1'                                                        AR1096915
     C           *IN63     ANDNE'1'                                                        AR1096915
     C           PTP       ANDNE'70'                                                       AR1096915
     C           PTP       ANDNE'71'                                                        MD054877
     C           PTP       ANDNE'72'                                                        MD054877
     C           *IN44     OREQ '1'                                                        AR1096915
     C           EAMT      ADD  OTHA      EAMT                                             AR1096915
     C                     ENDIF                                                           AR1096915
      *                                                                   181612
      ** Exclude processing of events with zero amount.                   181612
      *                                                                   181612
     C           EAMT      IFNE 0                                         181612
0510 C**                                                                  LE0820
0511 C**   CHECK FOR DEBIT/CREDIT IND                                     LE0820
0512 C**                                                                  LE0820
0513 C           EAMT      COMP 0                      18                 LE0820
0514 C**                                                                  LE0820
0515 C                     MOVE '1'       DRCRIN  1                       LE0820
     C**   INDICATOR 87 IS USED TO CHAIN THE CONDITION IN BELOW           S01392
     C                     SETOF                         87               S01392
0516 C  N18 47 45                                                         LE0820
0517 CORN18 47 46                                                         LE0820
     CORN18 32                                                            S01392
     CORN18 33                                                            S01392
     CORN18N47N45                                                         S01392
     C*NN46N31**           SETON                         87                         S01392 AR375891A
     CANN46N31N25          SETON                         87                                AR375891A
0518 C*RN18N47N45***                                                      S01392
0519 C*NN46*********                                                      S01392
     C   87                                                               S01392
     COR 18 31                                                            S01392
     COR 18 47N45                                                         S01392
     CANN46N32N33                                                         S01392
0520 C*R 18 47N45***                                                      S01392
0521 C*NN46*********                                                      S01392
0522 COR 41                MOVE '0'       DRCRIN                          LE0820
0523 C**                                                                  LE0820
0524 C**   POST TO RPOST                                                  LE0820
0525 C**                                                                  LE0820
     C           CAP205    IFEQ 'Y'                                                           CAP205
     C                     MOVELETYP      WACKEY                                              CAP205
     C                     ENDIF                                                              CAP205
      *                                                                                       CER049
     C           CER049    IFEQ 'Y'                                                           CER049
     C           ETYP      ANDEQ'49ST'                                                        CER049
     C                     MOVE '0'       DRCRIN                                              CER049
     C                     ENDIF                                                              CER049
      *                                                                                       CER049
0526 C                     EXSR POSTOT                                    LE0820
     C                     ENDIF                                          181612
0527 C**                                                                  LE0820
0528 C**   END OF DETAIL PROCESSING                                       LE0820
0529 C**                                                                  LE0820
0530 C           ENDDET    TAG                             ** ENDDET TAG *LE0820
0531 C**                                                                  LE0820
0532 C**   FORMAT DATE AND GET NO. OF DEC PLACES FOR REPORT               LE0820
0533 C**                                                                  LE0820
0534 C   52                Z-ADDEDAT      ZDAYNO                          LE0820
0535 C   52                EXSR ZDATE2                                    LE0820
0536 C**                                                                  LE0820
0537 C   52      ECDP      COMP 1                      2021               LE0820
0538 C   52      ECDP      COMP 2                    23  22               LE0820
0539 C**                                                                  LE0820
0540 C   52                SETON                     60                   LE0820
0541 C**                                                                  LE0820
     C*                                                                   S01117
     C**  CHECK WHETHER DETAILS TO REPORT IN P1                           S01117
     C*                                                                   S01117
     C   52 70             SETON                     7175                 S01117
     C*                                                                   S01117
     C           ENDD      ENDSR                                          S01117
0542 C***********          ENDSR                                          S01117
0543 C**                                                                  LE0820
0544 C**                                                                  LE0820
0545 C********************************************************************LE0820
0546 C********************************************************************LE0820
0547 C**                                                                  LE0820
0548 C**   SUBROUTINE TO CHECK RETAIL SETTLEMENT - POSTCK                 LE0820
0549 C**                                                                  LE0820
0550 C**   CALLED FROM DETAIL                                             LE0820
0551 C**   CALLS NO OTHER SUBROUTINE                                      LE0820
0552 C**                                                                  LE0820
0553 C           POSTCK    BEGSR                           *** POSTCK  ***LE0820
0554 C**                                                                  LE0820
0555 C           SETP      LOKUPTABMEM                   86               LE0820
      *                                                                   CLE033
     C           CLE033    IFEQ 'Y'                                       CLE033
     C           SETP      ANDEQ09                                        CLE033
     C           A5ACTY    IFEQ 'R'                                       CLE033
     C*********************DO*NOTHING*                                    CLE033
     C                     ELSE                                           CLE033
     C                     GOTO ENDPCK                                    CLE033
     C                     ENDIF                                          CLE033
     C                     ENDIF                                          CLE033
      *                                                                   CLE033
     C           SETP      IFEQ 09                                        CLE033
     C                     MOVE *ON       *IN54                           CLE033
     C                     ELSE                                           CLE033
     C                     MOVE *OFF      *IN54                           CLE033
     C                     ENDIF                                          CLE033
      *                                                                   CLE033
     C           *IN54     IFEQ *ON                                       CLE033
     C                     MOVE EBRC      BRCB                            CLE033
     C                     MOVELP@VL01    ACNUMB                          CLE033
     C                     MOVE ECCY      ACCY                            CLE033
     C                     MOVELP@VL02    ACODE                           CLE033
     C                     MOVE '01'      ACSEQ                           CLE033
     C                     ENDIF                                          CLE033
      *                                                                   CLE033
0556 C  N86                SETON                     40                   LE0820
0557 C  N86                GOTO ENDPCK                                    LE0820
0558 C**                                                                  LE0820
0559 C           SETP      COMP 14                       48               LE0820
0560 C           SETP      COMP 04                       49               LE0820
0561 C           SETP      COMP 05                       50               LE0820
     C           SETP      COMP 01                       53               074627
     C  N53      SETP      COMP 02                       53               074627
     C  N53      SETP      COMP 07                       53               074627
     C  N53      SETP      COMP 08                       53               074627
     C  N53      SETP      COMP 12                       53               074627
     C/COPY WNCPYSRC,LE0820C002
0562 C  N48                GOTO ACKYST                                    LE0820
0563 C**                                                                  LE0820
0564 C**   CHAIN TO ACNUM FOR ACCNT KEY                                   LE0820
0565 C**                                                                  LE0820
0566 C                     SETOF                     14                   LE0820
0567 C           ACNKEY    CHAINACNUM                89                   LE0820
0568 C  N14                SETON                     4052                 LE0820
0569 C***14******          MOVE ACKEY     ACCKEY                          HK0000
0569 C   14                MOVELACKEY     ACCKEY                          HK0000
0570 C**                                                                  LE0820
0571 C           ACKYST    TAG                             ** ACKYST TAG *LE0820
     C*                                                                   074627
     C** If settled through a nostro                                      074627
     C*                                                                   074627
     C           *IN53     IFEQ '1'                                       074627
     C*                                                                   074627
     C** Get Nostro details                                               074627
     C*                                                                   074627
     C                     MOVE *BLANKS   NCNUM                           074627
     C                     MOVE *BLANKS   NCCY                            074627
     C                     MOVE *BLANKS   NCODE                           074627
     C                     MOVE *BLANKS   NCSEQ                           074627
     C                     MOVE *BLANKS   NBRCD                           074627
     C                     MOVELOSAC      @NOST   2                       074627
     C*                                                                   074627
     C                     CALL 'AONOSTR0'                                074627
     C                     PARM '*MSG   ' @RTCD   7                       074627
     C                     PARM '*KEY   ' @OPTN   7                       074627
     C                     PARM *BLANKS   @KEYA   6                       074627
     C                     PARM ECCY      @KEYB   3                       074627
     C**********           PARM *BLANKS   @KEYC   4                                    074627 CGL029
     C                     PARM *BLANKS   @KEYC  10                                           CGL029
     C                     PARM *BLANKS   @KEYD   2                       074627
     C                     PARM @NOST     @KEYE   2                       074627
     C                     PARM *BLANKS   @BRCD   3                       074627
     C                     PARM *BLANKS   CSSN   10                       074627
     C                     PARM *BLANKS   PNOI    1                       074627
     C           SDNOST    PARM SDNOST    DSFDY                           074627
     C*                                                                   074627
     C           @RTCD     IFEQ *BLANK                                    074627
     C                     MOVE A7CUST    NCNUM                           074627
     C                     MOVE A7CYCD    NCCY                            074627
     C                     MOVE A7ACCD    NCODE                           074627
     C                     MOVE A7ACSN    NCSEQ                           074627
     C                     MOVE A7BRCD    NBRCD                           074627
     C                     ELSE                                           074627
     C                     MOVE '1'       *IN40                           074627
     C                     MOVE '0'       *IN53                           074627
     C                     GOTO ENDPCK                                    074627
     C                     END                                            074627
     C*                                                                   074627
     C** Chain to ACCNT for account. Output if retail.                    074627
     C*                                                                   074627
     C           NOSKEY    CHAINACCNT                89                   074627
     C           *IN89     IFEQ '0'                                       074627
     C           ATYP      IFEQ 'R'                                       074627
     C           *IN13     IFEQ '1'                                       074627
     C                     MOVE '1'       *IN40                           074627
     C                     MOVE '0'       *IN53                           074627
     C                     END                                            074627
     C                     ELSE                                           074627
     C                     MOVE '1'       *IN40                           074627
     C                     MOVE '0'       *IN53                           074627
     C                     END                                            074627
     C                     ELSE                                           074627
     C                     MOVE '1'       *IN40                           074627
     C                     MOVE '0'       *IN53                           074627
     C                     END                                            074627
     C                     GOTO ENDPCK                                    074627
     C                     END                                            074627
0572 C**                                                                  LE0820
0573 C**   IF '04' SETTLEMENT MOVE CURRENT A/C CODE INTO ACCKEY           LE0820
0574 C**                                                                  LE0820
0575 C   49                MOVE CADC      ACODE                           LE0820
     C  N48                MOVE EBRC      BRCB                            HK0000
     C   48                MOVE ACBR      BRCB                            HK0000
     C* If '04' setup also cnum and seq.                                  096084
     C           SETP      IFEQ 04                                        096084
     C**********           Z-ADDCNUM      ACNUMB                          096084              CSD027
     C                     MOVE CNUM      ACNUMB                                              CSD027
     C                     Z-ADD1         ACSEQ                           096084
     C                     END                                            096084
0576 C**                                                                  LE0820
0577 C**   CHAIN TO ACCNT FOR ACCOUNT                                     LE0820
0578 C**                                                                  LE0820
0579 C                     SETOF                     121386               LE0820
0580 C  N40      ACCKEY    CHAINACCNT                89                   LE0820
0581 C   12 50                                                            LE0820
0582 COR 13 50   ATYP      COMP 'R'                      86               LE0820
     C/COPY WNCPYSRC,LE0820C003
0583 C   13 86             SETON                     4052                 LE0820
0584 C  N86 50             SETON                     40                   LE0820
0585 C**                                                                  LE0820
0586 C  N12N50             SETON                     4052                 LE0820
0587 C**                                                                  LE0820
0588 C   50N86             GOTO ENDPCK                                    LE0820
0589 C**                                                                  LE0820
0586 C**   NO BRANCH CODE CHECK SINCE BRANCH OF THE LOAN MAY DIFFER       E12726
0587 C**   FROM THE BRANCH OF SETTLING RETAIL ACCOUNT IN MULTI-BRANCH     E12726
0588 C**   ENVIRONMENT.                                                   E12726
0589 C**                                                                  E12726
0590 C**N40******BRCDA     COMP BRCD                 8686                 E12726
0591 C**N40*86***          SETON                     4052                 E12726
0592 C**                                                                  LE0820
0593 C           ENDPCK    ENDSR                           *** ENDPCK  ***LE0820
     C**                                                                  CLE033
     C**                                                                  CLE033
     C********************************************************************CLE033
     C********************************************************************CLE033
     C**                                                                  CLE033
     C**   SUBROUTINE TO POST TO HPOST                                    CLE033
     C**                                                                  CLE033
     C**   CALLED FROM DETAIL                                             CLE033
     C**                                                                  CLE033
     C           HPOST     BEGSR                                          CLE033
      *                                                                   CLE033
     C                     MOVELETP       W0ETP   1                       CLE033
      *                                                                   CLE033
     C           W0ETP     IFEQ 'F'                                       CLE033
      *                                                                   CLE033
      * This is a fee                                                     CLE033
     C                     MOVEL'Amend   'HOACTN                          CLE033
     C                     MOVEL*BLANKS   HOTRYP                                             BUG8630
     C                     MOVEL'Fee     'HOTRYP                          CLE033
     C                     MOVE ETYP      HOETYP                          CLE033
     C                     MOVELEVENT     HOETYD                          CLE033
     C**********           Z-ADDCNUM      HOCNUM                          CLE033              CSD027
     C                     MOVE CNUM      HOCNUM                                              CSD027
     C**********           Z-ADDLNRF      HOLNRF                                       CLE033 CLE148
     C                     MOVELLNRF      HOLNRF                                              CLE148
     C                     Z-ADDLASN      HOLASN                          CLE033
     C                     MOVELFTYP      HOFTYP                          CLE033
     C                     MOVE FSEQ      HOFSEQ                          CLE033
     C                     Z-ADD0         HOFESQ                          CLE033
     C                     MOVE EBRC      HOBRCA                          CLE033
     C                     MOVE LTYP      HOLTYP                          CLE033
     C                     MOVE SUTP      HOSUTP                          CLE033
     C                     MOVE CLAS      HOCLAS                                              CLE042
     C                     Z-ADDBJRDNB    HOPSTD                          CLE033
     C                     Z-ADDEDAT      HOVALD                          CLE033
     C                     MOVE ECCY      HOCCY                           CLE033
     C                     Z-ADDEAMT      HOPSTA                          CLE033
     C                     MOVE PNARTV    HOPNAR                          CLE033
     C************         MOVE FEAUTO    HOAUTO                                       CLE033 221683
     C*********************MOVE *BLANKS   HOTLXY                    CLE033218262
     C           INOI      IFEQ 'I'                                       218262
     C                     MOVE 'R'       HOTLXY                          218262
     C                     ENDIF                                          218262
     C           INOI      IFEQ 'O'                                       218262
     C                     MOVE 'P'       HOTLXY                          218262
     C                     ENDIF                                          218262
      *                                                                                       220257
      * If posting amount is negative, convert to a positive amount                           220257
      * and change the debit/credit indicator                                                 220257
      *                                                                                       220257
     C           EAMT      IFLT 0                                                             220257
     C                     Z-SUBEAMT      HOPSTA                                              220257
     C           HOTLXY    IFEQ 'P'                                                           220257
     C                     MOVE 'R'       HOTLXY                                              220257
     C                     ELSE                                                               220257
     C                     MOVE 'P'       HOTLXY                                              220257
     C                     ENDIF                                                              220257
     C                     ENDIF                                                              220257
     C                     Z-ADDINTR      HOINTR                          CLE033
     C                     MOVE *BLANKS   HOBRTT                          CLE033
     C                     Z-ADD0         HOBRTE                          CLE033
     C                     Z-ADD0         HORTSP                          CLE033
     C                     MOVE *BLANKS   HOSPIN                          CLE033
     C                     Z-ADD0         HOMARG                          CLE033
     C***********          MOVE FESCCY    HOSCCY                          CLE033              218992
     C***********          Z-ADDFEREXR    HOREXR                          CLE033              218992
     C***********          MOVE FEREXI    HOREXI                          CLE033              218992
     C***********          MOVE OSDB      HORHBR                          CLE033              218992
     C                     MOVE RSCY      HOSCCY                                              218992
     C                     Z-ADDREXR      HOREXR                                              218992
     C                     MOVE REXI      HOREXI                                              218992
     C                     MOVE ROBR      HORHBR                                              218992
     C                     MOVE RONS      HORHAC                          CLE033
     C**********           Z-ADDROBN      HOROBN                                       CLE033 CSD027
     C**********           Z-ADDROCN      HOROCN                                       CLE033 CSD027
     C                     MOVE ROBN      HOROBN                                              CSD027
     C                     MOVE ROCN      HOROCN                                              CSD027
     C                     MOVE RIBN      HORIBN                          CLE033
     C                     MOVE RIBA      HORIBA                          CLE033
     C***********          MOVE FEPSCY    HOPSCY                          CLE033              218992
     C***********          Z-ADDFEPEXR    HOPEXR                          CLE033              218992
     C***********          MOVE FEPEXI    HOPEXI                          CLE033              218992
     C***********          MOVE OMDB      HOPHBR                          CLE033              218992
     C                     MOVE PSCY      HOPSCY                                              218992
     C                     Z-ADDPEXR      HOPEXR                                              218992
     C                     MOVE PEXI      HOPEXI                                              218992
     C                     MOVE POBR      HOPHBR                                              218992
     C                     MOVE PONS      HOPHAC                          CLE033
     C**********           Z-ADDPOBN      HOPOBN                                       CLE033 CSD027
     C**********           Z-ADDPOCN      HOPOCN                                       CLE033 CSD027
     C                     MOVE POBN      HOPOBN                                              CSD027
     C                     MOVE POCN      HOPOCN                                              CSD027
     C                     MOVE PIBA      HOPIBA                          CLE033
     C                     MOVE RVNO      HORVNO                          CLE033
     C                     MOVE CVMR      HOCVMR                          CLE033
     C                     MOVE RCRN      HORCRN                          CLE033
     C                     MOVE RCRA      HORCRA                          CLE033
     C                     MOVE AWBN      HOAWBN                          CLE033
     C                     MOVE AWBA      HOAWBA                          CLE033
     C                     MOVE BENN      HOBENN                          CLE033
     C                     MOVE BENA      HOBENA                          CLE033
     C                     MOVE DTP1      HODTP1                          CLE033
     C                     MOVE DTP2      HODTP2                          CLE033
     C                     MOVE DTP3      HODTP3                          CLE033
     C                     MOVE DTP4      HODTP4                          CLE033
     C                     MOVE DCHG      HODCHG                          CLE033
     C                     MOVE BTB1      HOBTB1                          CLE033
     C                     MOVE BTB2      HOBTB2                          CLE033
     C                     MOVE BTB3      HOBTB3                          CLE033
     C                     MOVE BTB4      HOBTB4                          CLE033
     C                     MOVE BTB5      HOBTB5                          CLE033
     C                     MOVE BTB6      HOBTB6                          CLE033
     C************         Z-ADDFETNLU    HOTNLU                                       CLE033 221683
     C                     MOVE *BLANKS   HOPROG                                              218782
     C                     MOVEL'LE0820  'HOPROG                                              218782
     C                     Z-ADD0         HOSEQN                                              218782
     C                     MOVE *BLANKS   HOSTAT                                              218782
      *                                                                                       221683
     C**********           MOVE EBRC      BRCACD                                       221683 261191
     C                     MOVE ORBR      BRCACD                                              261191
     C           OSBR      IFEQ *BLANKS                                                       261191
     C                     MOVE ORBR      OSBR                                                261191
     C                     ENDIF                                                              261191
     C                     MOVE CNUM      CUSTNO                                              221683
     C                     MOVELFTYP      FACTNO                                              221683
     C                     MOVE FSEQ      FACTNO                                              221683
     C                     MOVE LNRF      LNRFNO                                              221683
     C                     MOVE LASN      FSEQNO                                              221683
     C           LFKEY     CHAINLEFEEDF              89                                       221683
     C           *IN89     IFEQ '0'                                                           221683
     C                     MOVE FEAUTO    HOAUTO                                              221683
     C                     Z-ADDFETNLU    HOTNLU                                              221683
     C                     END                                                                221683
      *                                                                   CLE033
     C                     ELSE                                           CLE033
      *                                                                   CLE033
      * This is a loan                                                    CLE033
     C                     MOVE *IN99     W0IN99  1                       CLE033
     C           LNRF      CHAINCLOAN                99                   CLE033
      *                                                                   CLE033
     C                     MOVEL'Amend   'HOACTN                          CLE033
      *                                                                   CLE033
     C                     SELEC                                          CLE033
     C           PTYPX     WHEQ 64                                        CLE033
     C           PTYPX     OREQ 65                                        CLE033
     C           PTYPX     OREQ 68                                        CLE033
     C           PTYPX     OREQ 71                                        CLE033
     C                     MOVEA#AM,1     HOTRYP                          CLE033
     C           PTYPX     WHEQ 66                                        CLE033
     C           PTYPX     OREQ 67                                        CLE033
     C           PTYPX     OREQ 69                                        CLE033
     C           PTYPX     OREQ 72                                        CLE033
     C                     MOVEA#AM,2     HOTRYP                          CLE033
     C                     OTHER                                          CLE033
     C                     MOVEA#AM,3     HOTRYP                          CLE033
     C                     ENDSL                                          CLE033
      *                                                                   CLE033
     C                     MOVE ETYP      HOETYP                          CLE033
      *                                                                   CLE033
     C                     MOVELEVENT     HOETYD                          CLE033
     C**********           Z-ADDCNUM      HOCNUM                                       CLE033 CSD027
     C                     MOVE CNUM      HOCNUM                                              CSD027
     C**********           Z-ADDLNRF      HOLNRF                                       CLE033 CLE148
     C                     MOVELLNRF      HOLNRF                                              CLE148
     C                     Z-ADDLASN      HOLASN                          CLE033
     C                     Z-ADDFTYP      HOFTYP                          CLE033
     C                     Z-ADDFSEQ      HOFSEQ                          CLE033
     C                     Z-ADD0         HOFESQ                          CLE033
     C                     MOVE EBRC      HOBRCA                          CLE033
     C                     MOVE LTYP      HOLTYP                          CLE033
     C                     MOVE SUTP      HOSUTP                          CLE033
     C                     MOVE CLAS      HOCLAS                                              CLE042
     C                     Z-ADDBJRDNB    HOPSTD                          CLE033
     C                     Z-ADDEDAT      HOVALD                          CLE033
     C                     MOVE ECCY      HOCCY                           CLE033
     C           EAMT      IFLT 0                                                           AR897086
     C                     Z-SUBEAMT      HOPSTA                                            AR897086
     C                     ELSE                                                             AR897086
     C                     Z-ADDEAMT      HOPSTA                          CLE033
     C                     ENDIF                                                            AR897086
     C***********          MOVELPNARTV    HOPNAR                                      CLE033 BUG8630
     C                     MOVELLNRF      HOPNAR                                             BUG8630
     C                     MOVE AUTOX     HOAUTO                          CLE033
     C*********************MOVE TLXIX     HOTLXY                    CLE033218262
     C           INOI      IFEQ 'I'                                       218262
     C                     MOVE 'R'       HOTLXY                          218262
     C                     ENDIF                                          218262
     C           INOI      IFEQ 'O'                                       218262
     C                     MOVE 'P'       HOTLXY                          218262
     C                     ENDIF                                          218262
      *                                                                                       220257
      ** If posting amount is negative, convert to a positive amount                          220257
      ** and change the debit/credit indicator                                                220257
      *                                                                                       220257
     C           EAMT      IFLT 0                                                             220257
     C                     Z-SUBEAMT      HOPSTA                                              220257
     C           HOTLXY    IFEQ 'P'                                                           220257
     C                     MOVE 'R'       HOTLXY                                              220257
     C                     ELSE                                                               220257
     C                     MOVE 'P'       HOTLXY                                              220257
     C                     ENDIF                                                              220257
     C                     ENDIF                                                              220257
     C                     Z-ADDINTRX     HOINTR                          CLE033
     C                     MOVE BRTTX     HOBRTT                          CLE033
     C                     Z-ADDBRTEX     HOBRTE                          CLE033
     C                     Z-ADDRTSPX     HORTSP                          CLE033
     C                     MOVE SPINX     HOSPIN                          CLE033
     C                     Z-ADDMARGX     HOMARG                          CLE033
     C***********          MOVE SCCYX     HOSCCY                          CLE033              218992
     C***********          Z-ADDREXRX     HOREXR                          CLE033              218992
     C***********          MOVE REXIX     HOREXI                          CLE033              218992
     C***********          MOVE OSDBX     HORHBR                          CLE033              218992
     C***********          MOVE RONSX     HORHAC                          CLE033              218992
     C***********          Z-ADDROBNX     HOROBN                          CLE033              218992
     C***********          Z-ADDROCNX     HOROCN                          CLE033              218992
     C***********          MOVE RIBNX     HORIBN                          CLE033              218992
     C***********          MOVE RIBAX     HORIBA                          CLE033              218992
     C***********          MOVE PSCYX     HOPSCY                          CLE033              218992
     C***********          Z-ADDPEXRX     HOPEXR                          CLE033              218992
     C***********          MOVE PEXIX     HOPEXI                          CLE033              218992
     C***********          MOVE OMDBX     HOPHBR                          CLE033              218992
     C***********          MOVE PONSX     HOPHAC                          CLE033              218992
     C***********          Z-ADDPOBNX     HOPOBN                          CLE033              218992
     C***********          Z-ADDPOCNX     HOPOCN                          CLE033              218992
     C***********          MOVE PIBAX     HOPIBA                          CLE033              218992
     C***********          MOVE RVNOX     HORVNO                          CLE033              218992
     C***********          MOVE CVMRX     HOCVMR                          CLE033              218992
     C***********          MOVE RCRNX     HORCRN                          CLE033              218992
     C***********          MOVE RCRAX     HORCRA                          CLE033              218992
     C***********          MOVE AWBNX     HOAWBN                          CLE033              218992
     C***********          MOVE AWBAX     HOAWBA                          CLE033              218992
     C***********          MOVE BENNX     HOBENN                          CLE033              218992
     C***********          MOVE BENAX     HOBENA                          CLE033              218992
     C***********          MOVE DTP1X     HODTP1                          CLE033              218992
     C***********          MOVE DTP2X     HODTP2                          CLE033              218992
     C***********          MOVE DTP3X     HODTP3                          CLE033              218992
     C***********          MOVE DTP4X     HODTP4                          CLE033              218992
     C***********          MOVE DCHGX     HODCHG                          CLE033              218992
     C***********          MOVE BTB1X     HOBTB1                          CLE033              218992
     C***********          MOVE BTB2X     HOBTB2                          CLE033              218992
     C***********          MOVE BTB3X     HOBTB3                          CLE033              218992
     C***********          MOVE BTB4X     HOBTB4                          CLE033              218992
     C***********          MOVE BTB5X     HOBTB5                          CLE033              218992
     C***********          MOVE BTB6X     HOBTB6                          CLE033              218992
     C                     MOVE SCCY      HOSCCY                                              218992
     C                     Z-ADDREXR      HOREXR                                              218992
     C                     MOVE REXI      HOREXI                                              218992
     C                     MOVE ROBR      HORHBR                                              218992
     C                     MOVE RONS      HORHAC                                              218992
     C**********           Z-ADDROBN      HOROBN                                       218992 CSD027
     C**********           Z-ADDROCN      HOROCN                                       218992 CSD027
     C                     MOVE ROBN      HOROBN                                              CSD027
     C                     MOVE ROCN      HOROCN                                              CSD027
     C                     MOVE RIBN      HORIBN                                              218992
     C                     MOVE RIBA      HORIBA                                              218992
     C                     MOVE PSCY      HOPSCY                                              218992
     C                     Z-ADDPEXR      HOPEXR                                              218992
     C                     MOVE PEXI      HOPEXI                                              218992
     C                     MOVE POBR      HOPHBR                                              218992
     C                     MOVE PONS      HOPHAC                                              218992
     C**********           Z-ADDPOBN      HOPOBN                                       218992 CSD027
     C**********           Z-ADDPOCN      HOPOCN                                       218992 CSD027
     C                     MOVE POBN      HOPOBN                                              CSD027
     C                     MOVE POCN      HOPOCN                                              CSD027
     C                     MOVE PIBA      HOPIBA                                              218992
     C                     MOVE RVNO      HORVNO                                              218992
     C                     MOVE CVMR      HOCVMR                                              218992
     C                     MOVE RCRN      HORCRN                                              218992
     C                     MOVE RCRA      HORCRA                                              218992
     C                     MOVE AWBN      HOAWBN                                              218992
     C                     MOVE AWBA      HOAWBA                                              218992
     C                     MOVE BENN      HOBENN                                              218992
     C                     MOVE BENA      HOBENA                                              218992
     C                     MOVE DTP1      HODTP1                                              218992
     C                     MOVE DTP2      HODTP2                                              218992
     C                     MOVE DTP3      HODTP3                                              218992
     C                     MOVE DTP4      HODTP4                                              218992
     C                     MOVE DCHG      HODCHG                                              218992
     C                     MOVE BTB1      HOBTB1                                              218992
     C                     MOVE BTB2      HOBTB2                                              218992
     C                     MOVE BTB3      HOBTB3                                              218992
     C                     MOVE BTB4      HOBTB4                                              218992
     C                     MOVE BTB5      HOBTB5                                              218992
     C                     MOVE BTB6      HOBTB6                                              218992
     C                     MOVE *BLANKS   HOPROG                                              218782
     C                     MOVEL'LE0820  'HOPROG                                              218782
     C                     Z-ADD0         HOSEQN                                              218782
     C                     MOVE *BLANKS   HOSTAT                                              218782
      *                                                                   CLE033
     C                     MOVE ETYP      W0TMP2  2                       CLE033
      *                                                                   CLE033
      * Set up TNLU depending on loan/amendment                           CLE033
     C           W0TMP2    IFEQ 'R1'                                      CLE033
     C           W0TMP2    OREQ 'R2'                                      CLE033
     C           W0TMP2    OREQ 'V3'                                      CLE033
      *                                                                   CLE033
     C           LASN      IFNE 0                                         CLE033
      *                                                                   CLE033
     C           PKEY      KLIST                                          CLE033
     C                     KFLD           LNRF                            CLE033
     C                     KFLD           EDAT                            CLE033
     C                     KFLD           LASN                            CLE033
      *                                                                   CLE033
     C           PKEY      CHAINLOAMSOM1             99                   CLE033
      *                                                                   CLE033
     C           *IN99     IFEQ *OFF                                      CLE033
     C                     Z-ADDTNLUY     HOTNLU                          CLE033
     C                     ELSE                                           CLE033
     C                     Z-ADDTNLUX     HOTNLU                          CLE033
     C                     ENDIF                                          CLE033
      *                                                                   CLE033
     C                     ELSE                                           CLE033
      *                                                                   CLE033
     C                     Z-ADDTNLUX     HOTNLU                          CLE033
      *                                                                   CLE033
     C                     ENDIF                                          CLE033
      *                                                                   CLE033
     C                     ELSE                                           CLE033
      *                                                                   CLE033
     C                     Z-ADDTNLUX     HOTNLU                          CLE033
      *                                                                   CLE033
     C                     ENDIF                                          CLE033
      *                                                                   CLE033
      * End. reset indicator, if loan.                                    CLE033
     C                     MOVE W0IN99    *IN99   1                       CLE033
      *                                                                   CLE033
     C                     ENDIF                                          CLE033
      *                                                                   CLE033
     C                     WRITELEHOSTD0                                  CLE033
      *                                                                   CLE033
     C           P@VL03    IFNE *BLANKS                                   CLE033
     C                     CALL P@VL03                                    CLE033
     C/COPY WNCPYSRC,LE0820C009                                           CLE033
     C                     ENDIF                                          CLE033
      *                                                                   CLE033
     C           ENDHPO    ENDSR                                          CLE033
0594 C**                                                                  LE0820
0595 C**                                                                  LE0820
0596 C********************************************************************LE0820
0597 C********************************************************************LE0820
0598 C**                                                                  LE0820
0599 C**   SUBROUTINE TO POST TO RPOST - POSTOT                           LE0820
0600 C**                                                                  LE0820
0601 C**   CALLED FROM DETAIL                                             LE0820
0602 C**   CALLS HASH                                                     LE0820
0603 C**                                                                  LE0820
0604 C           POSTOT    BEGSR                           *** POSTOT  ***LE0820
0605 C**                                                                  LE0820
0606 C**   INCREMENT COUNT AND HASH                                       LE0820
0607 C**                                                                  LE0820
0608 C           NRIT      ADD  1         NRIT                            LE0820
0609 C**                                                                  LE0820
0610 C           EAMT      DIV  1000      ZZAMT        86                 LE0820
0611 C   86                Z-SUBEAMT      EAMT                            LE0820
0612 C   86                Z-SUBZZAMT     ZZAMT                           LE0820
0613 C                     Z-ADD2         S                               LE0820
0614 C                     EXSR HASH                                      LE0820
     C*                                                                   123275
     C** Access fee narrative                                             123275
     C*                                                                   123275
     C           *IN41     IFEQ '1'                                       123275
     C           *IN25     OREQ '1'                                                        AR375891A
     C           LFKEY     KLIST                                          123275
     C                     KFLD           BRCACD  3                       123275
     C**********           KFLD           CUSTNO  60                                   123275 CSD027
     C                     KFLD           CUSTNO  6                                           CSD027
     C                     KFLD           FACTNO  50                      123275
     C**********           KFLD           LNRFNO  60                                   123275 CLE148
     C                     KFLD           LNRFNO  6                                           CLE148
     C                     KFLD           FSEQNO  20                      123275
     C**********           MOVE EBRC      BRCACD                                       123275 261191
     C                     MOVE ORBR      BRCACD                                              261191
     C                     MOVE CNUM      CUSTNO                          123275
     C                     MOVELFTYP      FACTNO                          123275
     C                     MOVE FSEQ      FACTNO                          123275
     C                     MOVE LNRF      LNRFNO                          123275
     C                     MOVE LASN      FSEQNO                          123275
     C                     MOVE *BLANKS   WOTRF  21                                        AR1022006
     C           LFKEY     CHAINLEFEEDF              89                   123275
     C           *IN89     IFEQ '0'                                       123275
     C                     MOVE FEXRFI    XRFI                                                CLE134
     C                     MOVE FEXRFN    XRFN                                                CLE134
     C                     MOVE FEFCOD    FCODE   2                       123275
     C                     MOVE FEFSEQ    WFSEQ   2                                        AR1022006
     C           CLE134    IFEQ 'Y'                                                        AR1022006
     C           FELOAN    IFNE *BLANKS                                                    AR1022006
     C           FECNUM    CAT  FELOAN    OTRF12 12                                        AR1022006
     C           OTRF12    CAT  WFSEQ     WOTRF                                            AR1022006
     C                     ELSE                                                            AR1022006
     C           FEFACL    IFNE 0                                                          AR1022006
     C                     MOVE FEFACL    WFACL   5                                        AR1022006
     C           FECNUM    CAT  WFACL     OTRF11 11                                        AR1022006
     C           OTRF11    CAT  WFSEQ     WOTRF                                            AR1022006
     C                     ENDIF                                                           AR1022006
     C                     ENDIF                                                           AR1022006
     C                     ENDIF                                                           AR1022006
     C           FCODE     CHAIN@AURECQ              89                   123275
     C                     MOVE LASN      PSEQ                            123275
     C           *IN89     IFEQ '0'                                       123275
     C                     MOVE AUFENV    PDES                            123275
     C                     ELSE                                           123275
     C                     MOVE *BLANKS   PDES                            123275
     C                     END                                            123275
     C                     END                                            123275
     C                     END                                            123275
0615 C**                                                                  LE0820
0616 C**   OUTPUT TO RPOSTPD                                              LE0820
0617 C**                                                                  LE0820
0618 C                     SETON                     51                   LE0820
0619 C                     EXCPT                                          LE0820
0620 C***********          SETOF                     51            LE0820 074627
0620 C                     SETOF                     5153                 074627
0621 C**                                                                  LE0820
0622 C                     ENDSR                                          LE0820
0623 C**                                                                  LE0820
0624 C**                                                                  LE0820
0625 C********************************************************************LE0820
0626 C********************************************************************LE0820
0627 C**                                                                  LE0820
0628 C**   SUBROUTINE TO CALCULATE W/TAX PORTION OF AMOUNT - WHTAX        LE0820
0629 C**                                                                  LE0820
0630 C**   CALLED FROM DETAIL                                             LE0820
0631 C**   CALLS NO OTHER SUBROUTINES                                     LE0820
0632 C**                                                                  LE0820
0633 C           WHTAX     BEGSR                           ***  WHTAX  ***LE0820
0634 C**                                                                  LE0820
0635 C**   IGNORE IF NOT GROSS TAX                                        LE0820
0636 C**                                                                  LE0820
0637 C           WTIN      COMP 'G'                      86               LE0820
0638 C  N86                Z-ADD0         AMOUNT                          LE0820
0639 C  N86                GOTO WTXEND                                    LE0820
0640 C**                                                                  LE0820
0641 C           WTRT      DIV  100       WRK119 119                      LE0820
0642 C           AMOUNT    MULT WRK119    AMOUNT    H                     LE0820
0643 C**                                                                  LE0820
0644 C           WTXEND    ENDSR                           ***  WTXEND ***LE0820
0645 C**                                                                  LE0820
0646 C**                                                                  LE0820
0647 C********************************************************************LE0820
0648 C********************************************************************LE0820
0649 C**                                                                  LE0820
0650 C*****SUBROUTINE*TO*ACCESS*TABLE*FILE***TABCHN                       S01194
0651 C**********                                                          S01194
0652 C*****CALLED*FROM*FIRST                                              S01194
0653 C*****CALLS*NO*OTHER*SUBROUTINE                                      S01194
0654 C**********                                                          S01194
0655 C********** TABCHN    BEGSR                           *** TABCHN *** S01194
0656 C**********                                                          S01194
0657 C**********           SETOF                     89                   S01194
0658 C********** ZTABKY    CHAINTABLE                89                   S01194
0659 C**********                                                          S01194
0660 C**N89***** RECI      COMP 'D'                  8989                 S01194
0661 C**********                                                          S01194
0662 C**********           ENDSR                                          S01194
0663 C**                                                                  LE0820
0664 C**                                                                  LE0820
0665 C********************************************************************LE0820
0666 C********************************************************************LE0820
0667 C**                                                                  LE0820
0668 C**   SR. TO ADD ZZAMT TO HASH TOTALS IN ARRAYS INT & DEC. - HASH    LE0820
0669 C**                                                                  LE0820
0670 C**   CALLED FROM DETAIL,POSTOT                                      LE0820
0671 C**   CALLS GLZADD                                                   LE0820
0672 C**                                                                  LE0820
0673 C           HASH      BEGSR                           *** HASH ***   LE0820
0674 C**                                                                  LE0820
0675 C           ZZAMT     COMP 0                      86                 LE0820
0676 C   86                Z-SUBZZAMT     ZZAMT                           LE0820
0677 C                     Z-ADDINT,S     ZZTOTI                          LE0820
0678 C                     Z-ADDDEC,S     ZZTOTD                          LE0820
0679 C                     EXSR GLZADD                                    LE0820
0680 C                     Z-ADDZZTOTI    INT,S                           LE0820
0681 C                     Z-ADDZZTOTD    DEC,S                           LE0820
0682 C**                                                                  LE0820
0683 C                     ENDSR                                          LE0820
0684 C**                                                                  LE0820
0685 C**                                                                  LE0820
0686 C********************************************************************LE0820
      /COPY ZSRSRC,ZDATE2Z4                                               S01392
0777 C********************************************************************LE0820
0778 C**                                                                  LE0820
0779 C* SUBROUTINE TO ADD AN AMOUNT (ZZAMT) TO THE TOTAL (ZZTOTI,ZZTOTD)  LE0820
0780 C*   IND '99' IS SET BY AN OVERFLOW ERROR                            LE0820
0781 C*                                                                   LE0820
0782 CSR         GLZADD    BEGSR                           *** GLZADD ****LE0820
0783 C*                                                                   LE0820
0784 CSR                   Z-ADDZZAMT     ZZAMT  153     91-DEFINE ZZAMT  LE0820
0785 CSR 91                GOTO ZZAEND                     AMT = 0.BYPASS LE0820
0786 C*                                                                   LE0820
0787 C* SPLIT ZZAMT INTO INTEGER AND DECIMAL FIELDS                       LE0820
0788 CSR                   Z-ADDZZAMT     ZZAMTI 150       INTEGER FIELD  LE0820
0789 CSR                   MOVE ZZAMT     ZZAMTD  30       DECIMAL FIELD  LE0820
0790 C* BOTH ZZAMTI AND ZZAMTD CONTAIN A 'SIGN' ZONE NOW                  LE0820
0791 C*                                                                   LE0820
0792 CSR                   EXSR GLZSUM                                    LE0820
0793 CSR         ZZAEND    ENDSR                           ** ZZAEND TAG *LE0820
0794 C*                                                                   LE0820
0795 C********************************************************************LE0820
0796 C* SUBROUTINE TO CARRY OUT THE ADDITION FOR SUBROUTINES -            LE0820
0797 C*                        GLZADD, GLZSUB, GLZCMP.                    LE0820
0798 C*          PARAMETERS PASSED -                                      LE0820
0799 C*                     I/P ZZAMTI ZZAMTD                             LE0820
0800 C*                     O/P ZZTOTI ZZTOTD ZZNEGD IND 96 IND 99.       LE0820
0801 C*                                                                   LE0820
0802 CSR         GLZSUM    BEGSR                           *** GLZSUM ****LE0820
0803 C*                                                                   LE0820
0804 CSR                   Z-ADDZZTOTI    ZZTOTI 150       DEFINE ZZTOTI  LE0820
0805 CSR                   Z-ADDZZTOTD    ZZTOTD  30       DEFINE ZZTOTD  LE0820
0806 CSR                   SETOF                     919293               LE0820
0807 CSR                   SETOF                     949599               LE0820
0808 C*                                                                   LE0820
0809 C*    DETERMINE SIGN OF ZZAMTI & D,   92 IF NEG                      LE0820
0810 CSR         ZZAMTI    COMP 0                      9293               LE0820
0811 CSR 93      ZZAMTD    COMP 0                      9293               LE0820
0812 CSR 93                GOTO ZZSEND                     ZERO BYPASS    LE0820
0813 C*                                                                   LE0820
0814 C*    DETERMINE SIGN OF ZZTOTI & D, 91 IF NEG.                       LE0820
0815 CSR         ZZTOTI    COMP 0                      9193               LE0820
0816 CSR 93      ZZTOTD    COMP 0                      9193               LE0820
0817 C*                                                                   LE0820
0818 C*    IF ZZTOTAL IS ZERO, RETURN ZZAMOUNT.                           LE0820
0819 CSR 93                Z-ADDZZAMTI    ZZTOTI                          LE0820
0820 CSR 93                Z-ADDZZAMTD    ZZTOTD                          LE0820
0821 CSR 93                GOTO ZZSEND                     ZERO BYPASS    LE0820
0822 C*    IF SIGNS DIFFER BYPASS OVERFLOW CHECKS.                        LE0820
0823 CSR 91N92                                                            LE0820
0824 CORN91 92             GOTO ZZOFPS                                    LE0820
0825 C*                                                                   LE0820
0826 CSR         ZZAMTD    ADD  ZZTOTD    ZZWK2   40                      LE0820
0827 CSR         ZZWK2     COMP 999                  93    '93' = CARRY   LE0820
0828 CSRN93      ZZWK2     COMP -999                   93    INTO INTEGER.LE0820
0829 C*                                                                   LE0820
0830 CSR 93N92   ZZAMTI    ADD  1         ZZWK3  150       ADD 'CARRY' +VELE0820
0831 CSR    93 92ZZAMTI    SUB  1         ZZWK3            SUB 'CARRY' -VELE0820
0832 CSR 93      ZZTOTI    ADD  ZZWK3     ZZWK3                           LE0820
0833 CSRN93      ZZTOTI    ADD  ZZAMTI    ZZWK3                           LE0820
0834 C*                                                                   LE0820
0835 C* IF THE MODULUS OF ZZWK3 IS LT MOD. ZZTOTI THEN O/F HAS OCCURED    LE0820
0836 CSRN92      ZZWK3     COMP ZZTOTI                 99  -92 MEANS NOS. LE0820
0837 CSR 92      ZZWK3     COMP ZZTOTI               99     NEGATIVE      LE0820
0838 CSRN99                Z-ADDZZWK2     ZZTOTD                          LE0820
0839 CSRN99                Z-ADDZZWK3     ZZTOTI                          LE0820
0840 C*                                                                   LE0820
0841 C* IF O/F ZEROIZE ZZAMT , IND '99' SET AND ZZTOT FIELDS LEFT INTACT. LE0820
0842 CSR 99                Z-ADD0         ZZAMT  153                      LE0820
0843 CSR                   GOTO ZZSEND                                    LE0820
0844 C*                                                                   LE0820
0845 C* THE 'SIGNS' ARE DIFFERENT                                         LE0820
0846 CSR         ZZOFPS    TAG                             ** ZZOFPS TAG**LE0820
0847 C* IF ZZAMT WAS NEGATIVE, MAKE IT POS. TO COMP WITH ZZTOT            LE0820
0848 C*                                                                   LE0820
0849 CSR 92                Z-SUBZZAMTI    ZZAMTI 150                      LE0820
0850 CSR 92                Z-SUBZZAMTD    ZZAMTD  30                      LE0820
0851 C*                                                                   LE0820
0852 C* IF ZZTOT WAS NEGATIVE, MAKE IT POS. TO COMP WITH ZZAMT.           LE0820
0853 C*                                                                   LE0820
0854 CSR 91                Z-SUBZZTOTI    ZZTOTI                          LE0820
0855 CSR 91                Z-SUBZZTOTD    ZZTOTD                          LE0820
0856 C* BOTH ZZAMT AND ZZTOT ARE NOW POSITIVE.                            LE0820
0857 C*                                                                   LE0820
0858 CSR         ZZTOTI    COMP ZZAMTI               93  95               LE0820
0859 CSR 95      ZZTOTD    COMP ZZAMTD               93  95               LE0820
0860 C*                                                                   LE0820
0861 C* IF ZZTOT EQ. ZZAMT RETURN ZERO.                                   LE0820
0862 CSR 95                Z-ADD0         ZZTOTI                          LE0820
0863 CSR 95                Z-ADD0         ZZTOTD                          LE0820
0864 CSR 95                GOTO ZZSEND                                    LE0820
0865 C*                                                                   LE0820
0866 C* IF ZZTOT GT. ZZAMT.                                               LE0820
0867 CSR 93      ZZAMTD    COMP ZZTOTD               94                   LE0820
0868 CSR 93 94   ZZTOTI    SUB  1         ZZTOTI                          LE0820
0869 CSR 93 94   ZZTOTD    ADD  1000      ZZWK2                           LE0820
0870 CSR 93      ZZTOTI    SUB  ZZAMTI    ZZTOTI                          LE0820
0871 CSR 93 94   ZZWK2     SUB  ZZAMTD    ZZTOTD                          LE0820
0872 CSR 93N94   ZZTOTD    SUB  ZZAMTD    ZZTOTD                          LE0820
0873 C*                                                                   LE0820
0874 C*                                                                   LE0820
0875 C* IF ZZAMT GT. ZZTOT.                                               LE0820
0876 CSRN93      ZZTOTD    COMP ZZAMTD               94                   LE0820
0877 CSRN93 94   ZZAMTI    SUB  1         ZZWK3  150                      LE0820
0878 CSRN93 94   ZZAMTD    ADD  1000      ZZWK2                           LE0820
0879 CSRN93 94   ZZWK3     SUB  ZZTOTI    ZZTOTI                          LE0820
0880 CSRN93N94   ZZAMTI    SUB  ZZTOTI    ZZTOTI                          LE0820
0881 CSRN93 94   ZZWK2     SUB  ZZTOTD    ZZTOTD                          LE0820
0882 CSRN93N94   ZZAMTD    SUB  ZZTOTD    ZZTOTD                          LE0820
0883 C*                                                                   LE0820
0884 C* REVERSE SIGN OF ZZTOT IF LARGER I/P FIELDS WERE NEGATIVE          LE0820
0885 CSR                   SETOF                     94                   LE0820
0886 CSR 93 91                                                            LE0820
0887 CORN93 92             SETON                     94                   LE0820
0888 CSR 94                Z-SUBZZTOTI    ZZTOTI                          LE0820
0889 CSR 94                Z-SUBZZTOTD    ZZTOTD                          LE0820
0890 C**                                                                  LE0820
0891 C**   RESTORE SIGN OF ZZAMTI & ZZAMTD IF IT WAS REVERSED.            LE0820
0892 CSR 92                Z-SUBZZAMTI    ZZAMTI                          LE0820
0893 CSR 92                Z-SUBZZAMTD    ZZAMTD                          LE0820
0894 CSR         ZZSEND    TAG                             ** ZZSEND TAG *LE0820
0895 C**                                                                  LE0820
0896 C**   IF ZZTOTD IS ZERO, AND ZZTOTI IS NEG. SET UP ZZNEGD.           LE0820
0897 CSR                   SETOF                     96                   LE0820
0898 CSR         ZZTOTD    COMP 0                        91               LE0820
0899 CSR 91      ZZTOTI    COMP 0                      96                 LE0820
0900 CSR 96                MOVE '.000-'   ZZNEGD  5                       LE0820
0901 CSR                   ENDSR                             ** ENDSR **  LE0820
0902 C********************************************************************LE0820
0903 C********************************************************************LE0820
0904 C**                                                                  LE0820
0469 C*****ZSYSTM*SR.*TO*CHAIN TO THE INSTALLATION CONTROL DATA RECORD.   S01194
0470 C**********                                                          S01194
0471 C********** ZSYSTM    BEGSR                           *** ZSYSTM *** S01194
0472 C**********                                                          S01194
0473 C*****SET*UP*KEY*FOR*INSTALLATION CONTROL RECORD.                    S01194
0474 C**********           MOVEL'01      'ZTABKY 12                       S01194
0475 C**********           MOVE '  10'    ZTABKY                          S01194
0476 C**********                                                          S01194
0477 C********** ZTABKY    CHAINTABLE                99    ON NOT THERE   S01194
0478 C**N99***** RECI      COMP 'D'                  9999  ON, IS DELETED S01194
0479 C**********                                                          S01194
0480 C*****CHECK*SYSTEM*DATE FORMAT, DDMMYY OR MMDDYY.                    S01194
0481 C********** DATF      COMP 'M'                      98MMDDYY, 98 ON  S01194
0482 C**********                                                          S01194
0483 C**********           ENDSR                                          S01194
0920 C**                                                                  LE0820
0921 C**                                                                  LE0820
0780 C********************************************************************S01117
0781 C******                                                              S01117
0782 C******     SUBROUTINE FOR TRAILER PROCESSING   *********************S01117
0783 C**                                                                  S01117
0784 C**  CALLED BY: MAIN PROCESSING.                                     S01117
0785 C**                                                                  S01117
0786 C           TRAILR    BEGSR                           *** TRAILR *** S01117
     C                     ADD  2         NRIT                            S01117
0380 C           NREC      COMP NORE                 8080                 S01117
0381 C  N80      INT,1     COMP HRWN                 8080                 S01117
0382 C  N80      DEC,1     COMP HRDC                 8080                 S01117
0383 C   80                SETON                     U8                   S01117
     C                     ENDSR                                          S01117
0935 C********************************************************************S01117
     C*                                                                   S01117
     C*                                                                   S01117
     C* SUBROUTINE : #ZZ                                                  S01117
     C*                                                                   S01117
     C* CALLED BY MAIN PROCESSING DURING TOTAL TIME CALCULATIONS IF       S01117
     C* THE P1 FILES HAVE NOT ALREADY BEEN OPENED (IE, IF THERE ARE       S01117
     C* NO RECORDS READ AND THEREFORE FILES OPENING NOT PERFORMED)        S01117
     C**                                                                  S01117
0454 C           #ZZ       BEGSR                           *** NODETL *** S01117
     C**                                                                  S01117
     C                     MOVE 'Y'       P1OP                            S01117
     C                     OPEN LE0820P1                                  S01117
     C                     Z-ADD*ZEROS    PAGE                            S01117
     C                     Z-ADD*ZEROS    PAGE1                           S01117
     C*                                                                   S01117
     C** ENSURE REPORT SPOOL FILE RECORDED BY RCF                         S01117
     C**                                                                  S01117
     C                     Z-ADDSFNUM     ZSNUM   60                      S01117
     C                     OUT  LDA                                       S01194
     C**                                                                  S01117
     C                     CALL 'ZSFILE'                                  S01117
     C                     PARM           SEQ                             S01117
     C                     PARM *BLANKS   SENTY   3                       S01117
     C                     PARM           SFILE                           S01117
     C                     PARM           ZSNUM                           S01117
     C                     PARM           ZSERR   1                       S01117
     C           *LOCK     IN   LDA                                       S01194
      *                                                                   S01117
     C           ZSERR     IFEQ 'Y'                                       S01117
      **  ERROR DURING ZSFILE PROCESSING, RETURN TO CALLING PROGRAM       S01117
     C                     SETON                     U7U8LR               S01117
     C                     RETRN                                          S01117
     C                     END                                            S01117
     C**                                                                  S01117
      *                                                                   S01117
      *                                                                   S01117
      *                                                                   S01117
      *                                                                   S01117
     C**                                                                  S01117
      ** OUTPUT 'NO DETAILS TO REPORT' IN P1                              S01117
     C                     EXCPTNODTL                                     S01117
     C**                                                                  S01117
     C*                                                                   S01117
0466 C                     ENDSR                                          S01117
     C*                                                                   S01117
     C********************************************************************S01117
     C*                                                                   S01117
     C* *PSSR  --- SUBROUTINE TO HANDLE ABNORMAL ERROR CONDITIONS         S01117
     C*                                                                   S01117
     C* CALLED FROM: AFTER ABNORNAL OPERATION OCCURS                      S01117
     C*                                                                   S01117
     C* CALLS: NOTHING                                                    S01117
     C*                                                                   S01117
     C********************************************************************S01117
     C*                                                                   S01117
     C           *PSSR     BEGSR                           ** *PSSR **    S01117
     C*                                                                   S01117
     C           @RUN      IFEQ *BLANKS                                   S01117
     C                     MOVE 'Y'       @RUN    1                       S01117
     C                     DUMP                                           S01117
     C                     END                                            S01117
     C*                                                                   S01117
     C                     ENDSR                           ** *PSSR **    S01117
      /EJECT                                                                                  237466
      *****************************************************************                       237466
      *                                                               *                       237466
      *  SRSCUR - Subroutine to set correct currency depeding on the  *                       237466
      *           settlement type.                                    *                       237466
      *                                                               *                       237466
      *  Called By: DETAIL - Subroutine to process DETAIL RECS        *                       237466
      *                                                               *                       237466
      *****************************************************************                       237466
      *                                                                                       237466
     C           SRSCUR    BEGSR                                                              237466
      *                                                                                       237466
     C           MDSTX     IFEQ 01                                                            237466
     C           MDSTX     OREQ 07                                                            237466
     C           MDSTX     OREQ 08                                                            237466
     C           MDSTX     OREQ 02                                                            237466
     C           MDSTX     OREQ 12                                                            237466
     C                     MOVE CCYX      ZCCY2   3                                           237466
     C                     ELSE                                                               237466
     C                     MOVE LOCY      ZCCY2                                               237466
     C                     ENDIF                                                              237466
      *                                                                                       237466
      ** If feature CEU004 is on, use settlement currency                                     237466
      ** if Settlement currency from the LOAN is not blank.                                   237466
      *                                                                                       237466
     C           CEU004    IFEQ 'Y'                                                           237466
     C           SCCYX     ANDNE*BLANKS                                                       237466
     C                     MOVE SCCYX     ZCCY2                                               237466
     C                     ENDIF                                                              237466
      *                                                                                       237466
     C                     ENDSR                                                              237466
      /EJECT                                                                                  237466
      *****************************************************************                       237466
      *                                                               *                       237466
      *  MATLOC - Subroutine to get maturity location                 *                       237466
      *                                                               *                       237466
      *  Called By: DETAIL - Subroutine to process DETAIL RECS        *                       237466
      *                                                               *                       237466
      *****************************************************************                       237466
     C           MATLOC    BEGSR                                                              237466
      *                                                                                       237466
     C           *LIKE     DEFN NRLC      W@MDSL                                              237466
     C                     MOVE *BLANKS   W@MDSL                                              237466
      *                                                                                       237466
      ** For Type 01,02,07,08 OR 12, settlement location is determined                        237466
      ** by the nostro branch.                                                                237466
      *                                                                                       237466
     C           MDSTX     IFEQ 01                                                            237466
     C           MDSTX     OREQ 02                                                            237466
     C           MDSTX     OREQ 07                                                            237466
     C           MDSTX     OREQ 08                                                            237466
     C           MDSTX     OREQ 12                                                            237466
      *                                                                                       237466
     C                     MOVELOMDAX     SNOS    2                                           237466
      *                                                                                       237466
      ** If feature CEU004 is on                                                              237466
      ** If Settlement currency for EMU non-blank, set the Nostro Cccy                        237466
      *                                                                                       237466
     C                     MOVE CCYX      @KEYB                                               237466
      *                                                                                       237466
     C           CEU004    IFEQ 'Y'                                                           237466
      *                                                                                       237466
     C           SCCYX     IFNE *BLANKS                                                       237466
     C                     MOVE SCCYX     @KEYB                                               237466
     C                     ENDIF                                                              237466
      *                                                                                       237466
     C                     ENDIF                                                              237466
      *                                                                                       237466
     C                     CALL 'AONOSTR0'                                                    237466
     C                     PARM '*MSG   ' @RTCD   7                                           237466
     C                     PARM '*KEY   ' @OPTN   7                                           237466
     C                     PARM *BLANKS   @KEYA   6                                           237466
     C                     PARM           @KEYB   3                                           237466
     C                     PARM *BLANKS   @KEYC  10                                           237466
     C                     PARM *BLANKS   @KEYD   2                                           237466
     C                     PARM SNOS      @KEYE   2                                           237466
     C                     PARM *BLANKS   @KEYF   3                                           237466
     C                     PARM *BLANKS   @KEYG  10                                           237466
     C                     PARM *BLANKS   @KEYH   1                                           237466
     C           SDNOST    PARM SDNOST    DSFDY                                               237466
      *                                                                                       237466
     C           @RTCD     IFEQ *BLANKS                                                       237466
      *                                                                                       237466
      **                                                                                      237466
      ** Move the last 3 characters of customer short code (which is                          237466
      ** the location code) to start location code field                                      237466
      **                                                                                      237466
      *                                                                                       237466
     C                     MOVE CSNM      DSCSNM                                              237466
     C                     MOVE NRLC      W@MDSL                                              237466
     C                     END                                                                237466
      *                                                                                       237466
     C                     END                                                                237466
     C                     ENDSR                                                              237466
      *****************************************************************                     MD052216
      /EJECT                                                                                MD052216
      *****************************************************************                     MD052216
      *                                                                                     MD052216
      *  SRFPAD - Subroutine to get Fee Payment Base Date to reflect                        MD052216
      *           actual Event Date                                                         MD052216
      *                                                                                     MD052216
      *  CALLED FROM: DETAIL                                                                MD052216
      *                                                                                     MD052216
      *  CALLS: CHKPAY                                                                      MD052216
      *                                                                                     MD052216
      *****************************************************************                     MD052216
     C           SRFPAD    BEGSR                                                            MD052216
      *                                                                                     MD052216
      ** Key list for Fee Main and Extension File                                           MD052216
      *                                                                                     MD052216
     C           KFEE      KLIST                                                            MD052216
     C                     KFLD           CNUM                                              MD052216
     C                     KFLD           VFACL                                             MD052216
     C                     KFLD           VLNRF                                             MD052216
     C                     KFLD           VFSEQ                                             MD052216
      *                                                                                     MD052216
     C           ETP       IFEQ 'F2'                                                        MD052216
     C           ETP       OREQ 'FY'                                                        MD053950
     C                     MOVELFTYP      VFACL   50                                        MD052216
     C                     MOVE FSEQ      VFACL                                             MD052216
     C                     MOVEL*BLANKS   VLNRF   6                                         MD052216
     C                     ENDIF                                                            MD052216
      *                                                                                     MD052216
     C           ETP       IFEQ 'F1'                                                        MD052216
     C           ETP       OREQ 'FX'                                                        MD053950
     C                     Z-ADD*ZEROS    VFACL                                             MD052216
     C                     MOVELLNRF      VLNRF                                             MD052216
     C                     ENDIF                                                            MD052216
      *                                                                                     MD052216
     C                     MOVE LASN      VFSEQ   20                                        MD052216
     C           KFEE      CHAINLEFEEDL0             30                                     MD052216
     C           *IN30     IFEQ *OFF                                                        MD052216
     C           KFEE      CHAINLEFEEXQD             30                                     MD052216
     C                     ENDIF                                                            MD052216
      *                                                                                     MD052216
     C           *IN30     IFEQ *OFF                                                        MD052216
     C           FECALT    ANDNE*BLANKS                                                     MD052216
      *                                                                                     MD052216
      ** Set fee payment date                                                               MD052216
      *                                                                                     MD052216
     C********** EDAT      IFLE RUND                                               MD052216 MD054101
     C********** FQFPBD    ANDLERUND                                               MD052216 MD054101
     C           FELPDT    IFGT PRUND                                                       MD054101
     C                     Z-ADDFELPDT    WENPYD  50                                        MD052216
     C                     ELSE                                                             MD052216
     C                     Z-ADDFENPYD    WENPYD                                            MD052216
     C                     ENDIF                                                            MD052216
      *                                                                                     MD052216
     C           WENPYD    IFEQ *ZEROS                                                      MD052216
     C                     Z-ADDFEPEND    WENPYD                                            MD052216
     C                     ENDIF                                                            MD052216
      *                                                                                     MD052216
     C                     Z-ADDEDAT      OEDAT                                             MD052216
     C                     Z-ADDFQFPBD    WEDAT                                             MD052216
     C                     EXSR CHKPAY                                                      MD052216
     C           WEDAT     IFEQ EDAT                                                        MD052216
     C                     Z-ADDWENPYD    EDAT                                              MD052216
     C           EDAT      IFGT RUND                                                        MD052216
     C                     MOVE '1'       *IN40                                             MD052216
     C                     ELSE                                                             MD052216
     C                     MOVE '0'       *IN40                                             MD052216
     C                     ENDIF                                                            MD052216
     C                     MOVE '1'       *IN11                                             MD052216
     C                     ENDIF                                                            MD052216
      *                                                                                     MD052216
     C                     ENDIF                                                            MD052216
      *                                                                                     MD052216
     C                     ENDSR                                                            MD052216
      *****************************************************************                     MD052216
      /EJECT                                                                                MD052216
      *****************************************************************                     MD052216
      *                                                                                     MD052216
      *  CHKPAY - Check Payment Taken Day Indicator                                         MD052216
      *                                                                                     MD052216
      *  CALLED FROM: SRFPAD                                                                MD052216
      *                                                                                     MD052216
      *  CALLS: CCYLOC                                                                      MD052216
      *                                                                                     MD052216
      *****************************************************************                     MD052216
     C           CHKPAY    BEGSR                                                            MD052216
      *                                                                                     MD052216
      ** Key list for Loans File                                                            MD054101
      *                                                                                     MD054101
     C           KLOAN     KLIST                                                            MD054101
     C                     KFLD           FELOAN                                            MD054101
     C                     KFLD           KRCDT   1                                         MD054101
     C                     MOVEL'A'       KRCDT                                             MD054101
      *                                                                                     MD054101
     C                     Z-ADDWEDAT     ZDAYNO                                            MD052216
     C                     Z-ADDWEDAT     ZDYNBR                                            MD052216
     C                     Z-ADD*ZEROS    ZNRDYS                                            MD052216
     C                     EXSR CCYLOC                                                      MD052216
      *                                                                                     MD052216
     C           CLE141    IFEQ 'Y'                                                         MD052216
     C           FELOAN    ANDNE*BLANKS                                                     MD052216
      *                                                                                     MD052216
     C           KLOAN     CHAINCLOAN                97                                     MD054101
     C           FQPTDI    IFEQ *BLANK                                                      MD052216
     C                     MOVEL'M'       PAYIND                                            MD052216
     C                     ELSE                                                             MD052216
     C                     MOVELFQPTDI    PAYIND                                            MD052216
     C                     ENDIF                                                            MD052216
     C                     CALL 'LEZBDYCD'BDCHK                                             MD052216
     C                     MOVELZADJDT    ZDYNBR                                            MD052216
      *                                                                                     MD052216
     C                     ELSE                                                             MD052216
     C                     SELEC                                                            MD052216
      *                                                                                     MD052216
     C           FQPTDI    WHEQ 'P'                                                         MD052216
     C                     EXSR ZBKDT                                                       MD052216
      *                                                                                     MD052216
     C           FQPTDI    WHEQ 'N'                                                         MD052216
     C                     EXSR ZFWDT                                                       MD052216
      *                                                                                     MD052216
     C           FQPTDI    WHEQ 'M'                                                         MD052216
     C           FQPTDI    OREQ *BLANK                                                      MD052216
     C                     EXSR ZDATE2                                                      MD052216
     C           *IN98     IFEQ *OFF                                                        MD052216
     C                     MOVE ZDATE     MMYY      P                                       MD052216
     C                     MOVELMMYY      MMNLCD    P                                       MD052216
     C                     ELSE                                                             MD052216
     C                     MOVELZDATE     MMNLCD    P                                       MD052216
     C                     ENDIF                                                            MD052216
     C                     Z-ADDZDAYNO    @DAYNO                                            MD052216
     C                     EXSR ZFWDT                                                       MD052216
     C                     Z-ADDZDYNBR    ZDAYNO                                            MD052216
     C                     EXSR ZDATE2                                                      MD052216
     C           *IN98     IFEQ *OFF                                                        MD052216
     C                     MOVE ZDATE     MMYY      P                                       MD052216
     C                     MOVELMMYY      MMNWKD    P                                       MD052216
     C                     ELSE                                                             MD052216
     C                     MOVELZDATE     MMNWKD    P                                       MD052216
     C                     ENDIF                                                            MD052216
     C           MMNLCD    IFNE MMNWKD                                                      MD052216
     C                     Z-ADD@DAYNO    ZDAYNO                                            MD052216
     C                     EXSR ZBKDT                                                       MD052216
     C                     ENDIF                                                            MD052216
      *                                                                                     MD052216
     C                     ENDSL                                                            MD052216
     C                     ENDIF                                                            MD052216
      *                                                                                     MD052216
     C                     Z-ADDZDYNBR    WEDAT                                             MD052216
      *                                                                                     MD052216
     C                     ENDSR                                                            MD052216
      *****************************************************************                     MD052216
      /EJECT                                                                                MD052216
      *****************************************************************                     MD052216
      *                                                                                     MD052216
      *  CCYLOC - Set currency & location depending on settlement type                      MD052216
      *                                                                                     MD052216
      *  CALLED FROM: CHKPAY                                                                MD052216
      *                                                                                     MD052216
      *  CALLS:                                                                             MD052216
      *                                                                                     MD052216
      *****************************************************************                     MD052216
     C           CCYLOC    BEGSR                                                            MD052216
      *                                                                                     MD052216
      ** If Fee Settlement type is '01', '02', '07', '08' or '12',                          MD052216
      ** use Fee Currency and Nostro location                                               MD052216
      *                                                                                     MD052216
     C           FESTTL    IFEQ 01                                                          MD052216
     C           FESTTL    OREQ 02                                                          MD052216
     C           FESTTL    OREQ 07                                                          MD052216
     C           FESTTL    OREQ 08                                                          MD052216
     C           FESTTL    OREQ 12                                                          MD052216
      *                                                                                     MD052216
     C                     MOVELFEFCCY    PCURR                                             MD053873
      *                                                                                     MD053873
     C           CLE031    IFEQ 'Y'                                                         MD053873
      *                                                                                     MD053873
     C           PTFI      IFEQ *BLANKS                                                     MD053873
     C           FESCCY    ANDNE*BLANKS                                                     MD053873
     C                     MOVELFESCCY    PCURR                                             MD053873
     C                     ENDIF                                                            MD053873
      *                                                                                     MD053873
     C           PTFI      IFNE *BLANKS                                                     MD053873
     C           FEPSCY    ANDNE*BLANKS                                                     MD053873
     C                     MOVELFEPSCY    PCURR                                             MD053873
     C                     ENDIF                                                            MD053873
      *                                                                                     MD053873
     C                     ENDIF                                                            MD053873
      *                                                                                     MD053873
     C                     CALL 'AONOSTR0'                                                  MD052216
     C                     PARM *BLANKS   PRTCD   7                                         MD052216
     C                     PARM '*KEY   ' POPTN   7                                         MD052216
     C                     PARM *BLANKS   PCUSN   6                                         MD052216
     C**********           PARM FEFCCY    PCURR   3                                MD052216 MD053873
     C                     PARM           PCURR   3                                         MD053873
     C                     PARM *BLANKS   PACCD  10                                         MD052216
     C                     PARM *BLANKS   PACSN   2                                         MD052216
     C                     PARM FEOURS    PNONB   2                                         MD052216
     C                     PARM *BLANKS   PBRCA   3                                         MD052216
     C                     PARM *BLANKS   PCSSN  10                                         MD052216
     C                     PARM *BLANKS   PPNOI   1                                         MD052216
     C           SDNOST    PARM SDNOST    DSFDY                                             MD052216
      *                                                                                     MD052216
     C           PRTCD     IFNE *BLANKS                                                     MD052216
     C           *LOCK     IN   LDA                                                         MD052216
     C                     MOVEL'AONOSTR0'DBFILE                                            MD052216
     C                     Z-ADD56        DBASE                                             MD052216
     C                     MOVELFEFCCY    DBKEY                                             MD052216
     C                     OUT  LDA                                                         MD052216
     C                     EXSR *PSSR                                                       MD052216
     C                     ELSE                                                             MD052216
      *                                                                                     MD052216
     C**********           MOVELFEFCCY    ZCCY                                     MD052216 MD053873
     C                     MOVELPCURR     ZCCY                                              MD053873
     C                     MOVE CSNM      ZLOC                                              MD052216
     C                     ENDIF                                                            MD052216
      *                                                                                     MD052216
     C                     ELSE                                                             MD052216
      *                                                                                     MD052216
      ** For other settlement types, use Local Currency & Location                          MD052216
      *                                                                                     MD052216
     C                     MOVE LOCY      ZCCY                                              MD052216
     C                     MOVE BJSLCD    ZLOC                                              MD052216
      *                                                                                     MD052216
     C                     ENDIF                                                            MD052216
      *                                                                                     MD052216
     C                     ENDSR                                                            MD052216
      *****************************************************************                     MD052216
      /EJECT                                                                                  237466
     C/COPY ZSRSRC,ZBKDT                                                                      237466
      /EJECT                                                                                  237466
     C/COPY ZSRSRC,ZACCH                                                                      237466
      /EJECT                                                                                  237466
     C/COPY ZSRSRC,ZFWDT                                                                      237466
      /EJECT                                                                                  237466
      *                                                                                       237466
     C********************************************************************S01117
     C********************************************************************S01117
0923 O**                                                                  LE0820
0924 O**   GENERATED ENTRIES FILE HEADER                                  LE0820
0925 O**                                                                  LE0820
0926 ORPOSTHH T        LR                                                 LE0820
0927 O                                    1 'H'                           LE0820
0928 O                         FLSZ       4P                              LE0820
0929 O**                                                                  LE0820
0930 O**   GENERATED ENTRY.                                               LE0820
0931 O**                                                                  LE0820
0932 ORPOSTPD E        51                                                 LE0820
0933 O                                    1 'P'                           LE0820
0934 O***********              ACCKEY    16                               HK0000
0934 O**********               ACCK2     16                                            HK0000 CGL029
     O                         ACNUMB     7                                                   CGL029
     O                         ACCY      10                                                   CGL029
     O                         ACSEQ     16                                                   CGL029
     O**********       53      NOST1     16                                            074627 CGL029
     O                 53      NCNUM      7                                                   CGL029
     O                 53      NCCY      10                                                   CGL029
     O                 53      NCSEQ     16                                                   CGL029
0935 O                         ACNOA     32                               LE0820
0936 O**********               EDAT      35P                                          LE0820 BUG8552
     O                N56      EDAT      35P                                                 BUG8552
     O                 56      WPOST     35P                                                 BUG8552
     O                 11      OEDAT     35P                                                  237466
0937 O                         EDAT      38P                              LE0820
     O                         LTYP      40                               190995
     O**********       41 71             40 'F1'                                       123275 CLE031
     O**********       41N71             40 'F3'                                       123275 CLE031
     O                 41      WPREF     40                                                   CLE031
     O                 25      WPREF     40                                                AR375891A
0938 O*************************LNRF******49                         LE0820123275
     O**********      N41      LNRF      49                                         123275 AR375891A
     O                N41N25   LNRF      49                                                AR375891A
0939 O*****************4*******FACLTY****54                         LE0820123275
     O                 41      PNARTV    73                               123275
     O                 25      PNARTV    73                                                AR375891A
0940 O                         EAMT      80P                              LE0820
0941 O                         DRCRIN    81                               LE0820
0942 O                                  102 'GE-LE'                       LE0820
0943 O***********              BRCD     105                               S01117
0943 O                         EBRC     105                               S01117
     O                 48 14   BRCB     105                                                 MD023860
     O                 53      NBRCD    105                               074627
     O                 41      OSBR     105                                                   261191
0944 O                                  106 '1'                           LE0820
0945 O                         Z3       108P                              LE0820
0946 O                         RRNM     114P                              LE0820
0947 O                                  124 'R'                           LE0820
0948 O                         PRIN     128                               LE0820
0949 O                                  129 'U'                           LE0820
     O                                  177 'L'                           123275
     O                         TRAN06   183                               123275
     O                                  184 ' '                           123275
     O/COPY WNCPYSRC,LEH01448
     O                         WACKEY   351                                                   CGL020
     O                         FEEFLG   352                                                   CGL020
     O                         FEEVAL   359P                                                  CGL020
     O                         FEEPCT   364                                                   CGL020
     O                         RORACT   384                                                   CGL020
     O                         RORCTY   386                                                   CGL020
     O                         RORBNK   406                                                   CGL020
     O                         RORCDE   417                                                   CGL020
     O                         PORACT   437                                                   CGL020
     O                         PORCTY   439                                                   CGL020
     O                         PORBNK   459                                                   CGL020
     O                         PORCDE   470                                                   CGL020
     O                         DSTACT   505                                                   CGL020
     O                         DSTCTY   507                                                   CGL020
     O                         DSTBNK   527                                                   CGL020
     O                         SETDAT   530P                                                  CGL020
     O                         TICKER   540                                                   CGL020
     O                         EXCHNG   560                                                   CGL020
     O                         NOMINL   573                                                   CGL020
     O                         FDTRID   589                                                   CGL020
     O                         ACODE    599                                                   CGL029
     O                 53      NCODE    599                                                   CGL029
     O                         WOTRF    620                                                AR1022006
0950 O**                                                                  LE0820
0951 O**   TRAILER RECORD.                                                LE0820
0952 O**                                                                  LE0820
0953 ORPOSTZZ T        LR                                                 LE0820
0954 O                                    1 'T'                           LE0820
0955 O                         NRIT       6                               LE0820
0956 O                         INT,2     14P                              LE0820
0957 O                         DEC,2     16P                              LE0820
0958 O********LE0820P1H  203   1P                                         E13500
0958 O*E0820P1H  203   1P                                          E13500 E12726
0958 O*E0820P1H**203   01                                          E12726 S01117
0958 O*******OR**      OF                                          E12726 S01117
     OLE0820P1H  203   L1 70                                              S01117
     O       OR        OFNL1 70                                           S01117
     O       OR        01 U7 U8                                           S01117
0959 O***********                        22 'REFERENCE LE0820'            S01117
0959 O                                   24 'REFERENCE LE0820P1'          S01117
0960 O                         TITL      89                               LE0820
0961 O                                  104 'DATE'                        LE0820
0962 O                         RUNA     112                               LE0820
0963 O                                  122 'PAGE'                        LE0820
0964 O                         PAGE  Z  127                               LE0820
0965 O********H  1     1P                                                 E13500
0965 O********H  1     1P                                          E13500 E12726
0965 O********H**1     01                                          E12726 S01117
0965 O*******OR**      OF                                          E13500 S01117
     O        H  1     L1 70                                              S01117
     O       OR        OFNL1 70                                           S01117
     O       OR        01 U7 U8                                           S01117
0966 O                                   65 'MISSING SETTLEMENT'          LE0820
0967 O                                   81 'ACCOUNTS REPORT'             LE0820
     O                 65                88 'BRANCH'                      S01117
     O                 65      EBRC      92                               S01117
     O                 65                93 '-'                           S01117
     O                 65      BRNM     123                               S01117
0968 O********H  2     1P                                                 E13500
0968 O********H  2     1P                                          E13500 E12726
0968 O********H**2     01                                          E12726 S01117
0968 O*******OR**      OF                                          E13500 S01117
     O        H  3     L1 70                                              S01117
     O       OR        OFNL1 70                                           S01117
     O       OR        01 U7 U8                                           S01117
0969 O                                   71 '------------------------'    LE0820
0970 O                                   81 '----------'                  LE0820
0971 O********H  1     1P                                                 E13500
0971 O********H  1     1P                                          E13500 E12726
0971 O********H**1     01                                          E12726 S01117
0971 O*******OR**      OF                                          E13500 S01117
     O        H  1     L1 70                                              S01117
     O       OR        OFNL1 70                                           S01117
     O       OR        01 U7 U8                                           S01117
0972 O                                   40 'MISSING/CLOSED'              LE0820
0973 O                                   58 'LOAN/FACILITY'               LE0820
0974 O********H  2     1P                                                 E13500
0974 O********H  2     1P                                          E13500 E12726
0974 O********H**2     01                                          E12726 S01117
0974 O*******OR**      OF                                          E13500 S01117
     O        H  2     L1 70                                              S01117
     O       OR        OFNL1 70                                           S01117
0975 O                                   11 'EVENT'                       LE0820
0976 O                                   37 'ACCOUNT'                     LE0820
0977 O                                   54 'NUMBER'                      LE0820
0978 O                                   73 'CUSTOMER NO.'                LE0820
0979 O***********                        86 'BRANCH CODE'                 S01117
0980 O***********                        98 'EVENT DATE'                  S01117
0981 O***********                       109 'EVENT CCY'                   S01117
0982 O***********                       126 'EVENT AMOUNT'                S01117
0980 O                                   85 'EVENT DATE'                  S01117
0981 O                                   96 'EVENT CCY'                   S01117
0982 O                                  113 'EVENT AMOUNT'                S01117
0983 O********D**1     52                                                 S01117
     O        D  1     52 70                                              S01117
0984 O                         EVENT     24                               LE0820
0985 O***********     N48      ACCKEY    41                               HK0000
0985 O**********      N48      ACCK2     41                                            HK0000 CGL029
     O                N48      ACCK2     46                                                   CGL029
0986 O                 48      ACNKEY    36                               LE0820
0987 O                         LNRF      54                               LE0820
0988 O                 41      FACNO     54 '   /  '                      LE0820
0989 O                N15                56 '-'                           LE0820
0990 O                N15      LASN      60                               LE0820
0991 O                         CNUM      70                               LE0820
0992 O***********              BRCD      82                               S01117
0993 O***********              ZADATE    96                               S01117
0994 O***********              ECCY     106                               S01117
0995 O***********      20      EAMT     126 ' ,   ,   ,   , 0 -'          S01117
0996 O***********      21      EAMT     128 '   ,   ,   , 0 . -'          S01117
0997 O***********      22      EAMT     129 '  ,   ,   , 0 .  -'          S01117
0998 O***********      23      EAMT     130 ' ,   ,   , 0 .   -'          S01117
0993 O                         ZADATE    83                               S01117
0994 O                         ECCY      93                               S01117
0995 O                 20      EAMT     113 ' ,   ,   ,   , 0 -'          S01117
0996 O                 21      EAMT     115 '   ,   ,   , 0 . -'          S01117
0997 O                 22      EAMT     116 '  ,   ,   , 0 .  -'          S01117
0998 O                 23      EAMT     117 ' ,   ,   , 0 .   -'          S01117
     O        T 33     L1N71 70                                           S01117
     O                                   76 '*** NO DETAILS TO REPORT'    S01117
     O                                   80 '***'                         S01117
0999 O********T** 20   LRN60NU7                                           S01117
1000 O********                           73 '* NO MISSING ACCOUNTS *'     E12726
1000 O***********                        74 '*** NO MISSING ACCOUNTE12726 S01117
1000 O***********                        78 ' ***'                 E12726 S01117
1001 O********TF33     LR U7                                              S01117
     O        TF33     L1 U7 70                                           S01117
1002 O                                   51 '*** REFERENCE LE0820'        S01117
1003 O                                   68 '- DATABASE ERROR'            S01117
1003 O***********                        71 '- DATABASE ERROR AT'         S01117
1004 O***********              DBASE     74                               S01117
1005 O********T**      LR U7                                              S01117
1006 O***********                        39 'FILENAME'                    S01117
1007 O***********              DBFILE    45                               S01117
1008 O***********                        50 'KEY'                         S01117
1009 O***********              DBKEY     80                               S01117
     O        T 3      L1 70 65                                           S01117
     O                                   66 '*** END OF REPORT FOR'       S01117
     O                                   74 ' BRANCH '                    S01117
     O                         EBRC      77                               S01117
     O                                   81 ' ***'                        S01117
     O        T 3      LRN65 75                                           S01117
     O                                   76 '*** END OF REPORT ***'       S01117
     OLE0820P1E   10           NODTL                                      S01117
0959 O                                   24 'REFERENCE LE0820P1'          S01117
0960 O                         TITL      89                               S01117
0961 O                                  104 'DATE'                        S01117
0962 O                         RUNA     112                               S01117
0963 O                                  122 'PAGE'                        S01117
0964 O                         PAGE  Z  127                               S01117
     O        E   12           NODTL                                      S01117
0966 O                                   65 'MISSING SETTLEMENT'          S01117
0967 O                                   81 'ACCOUNTS REPORT'             S01117
     O        E   13           NODTL                                      S01117
0969 O                                   71 '------------------------'    S01117
0970 O                                   81 '----------'                  S01117
     O        E   18   LR U7 U8                                           S01117
1002 O                                   51 '*** REFERENCE LE0820'        S01117
1003 O                                   68 '- DATABASE ERROR'            S01117
     O        E   20           NODTL                                      S01117
     O                                   76 '*** NO DETAILS TO REPORT'    S01117
     O                                   80 '***'                         S01117
     O        E   25           NODTL                                      S01117
     O                                   76 '*** END OF REPORT ***'       S01117
     O********T*3      L1 10                                              S01117
     O***********                        66 '*** END OF BRANCH '          S01117
     O***********                        76 'REPORT ***'                  S01117
1010 O********T** 03   LR                                                 S01117
1010 OLE0820AUT   03   LR                                                 S01117
1011 O***********                        22 'REFERENCE LE0820'            S01117
1011 O                                   24 'REFERENCE LE0820AU'          S01117
1012 O                         TITL      89                               LE0820
1013 O                                  104 'DATE'                        LE0820
1014 O                         RUNA     112                               LE0820
1015 O                                  122 'PAGE'                        LE0820
1016 O***********              PAGE  Z  127                               S01117
1016 O                         PAGE1 Z  127                               S01117
1017 O        T   05   LR                                                 LE0820
1018 O                                   60 'LOANS SHADOW POST'           LE0820
1019 O                                   84 'EXTRACT - FILE CONTROLS'     LE0820
1020 O        T   06   LR                                                 LE0820
1021 O                                   61 '------------------'          LE0820
1022 O                                   84 '-----------------------'     LE0820
1023 O        T   09   LR                                                 LE0820
1024 O***********                        28 'S/LVENT - RUN CONTROLS'      S01117
1024 O                                   30 'S/LVENTL2 - RUN CONTROLS'    S01117
1025 O                                   59 'NUMBER'                      LE0820
1026 O                                   84 'VALUE'                       LE0820
1027 O        T   10   LR                                                 LE0820
1028 O                                   28 '----------------------'      LE0820
1029 O                                   59 'OF RECORDS'                  LE0820
1030 O                                   84 'OF RECORDS'                  LE0820
1031 O        T   12   LR                                                 S01117
1032 O                                   29 'TOTAL RECORDS ON FILE'       LE0820
1033 O                         NORE  Z   59                               LE0820
1034 O                         HRWN  Z   81                               LE0820
1035 O                         HRDC      84                               LE0820
1036 O        T   14   LR                                                 LE0820
1037 O                                   29 'TOTAL RECORDS ON FILE'       LE0820
1038 O                                   42 '- CALCULATED'                LE0820
1039 O                         NREC  3   59                               LE0820
1040 O                         INT,1 Z   81                               LE0820
1041 O                         DEC,1     84                               LE0820
1042 O                    80NU7         111 '***   DIFFERENCE   ***'      LE0820
1043 O        T   18   LR                                                 LE0820
1044 O                                   28 'S/RPOST - RUN CONTROLS'      LE0820
1045 O        T   19   LR                                                 LE0820
1046 O                                   28 '----------------------'      LE0820
1047 O        T   21   LR                                                 LE0820
1048 O                                   29 'TOTAL RECORDS ON FILE'       LE0820
1049 O                         NRIT  Z   59                               LE0820
1050 O                         INT,2 Z   81                               LE0820
1051 O                         DEC,2     84                               LE0820
1001 O        TF33     LR U7                                              S01117
1002 O                                   51 '*** REFERENCE LE0820'        S01117
1003 O                                   71 '- DATABASE ERROR AT'         S01117
     O                         DBASE     76                               S01117
1005 O        T        LR U7                                              S01117
1006 O                                   39 'FILENAME'                    S01117
     O                         DBFILE    49                               S01117
     O                                   55 'KEY'                         S01117
     O                         DBKEY     88                               S01117
     O        T   25   LRN75                                              S01117
     O                                   63 '***  NO DETAILS TO REPO'     S01117
     O                                   70 'RT  ***'                     S01117
1052 O********T** 54   LR                                                 S01117
1053 O***********                        78 '***  END OF REPORT  ***'     S01117
     O**  TABNAM IS PHYSICALLY AMENDED : 3 ENTRIES ADDED - THEY ARE       S01392
     O**  R3 NEW PRINCIPAL, R4 PRINCIPAL, R5 NEW DISCOUNT                 S01392
     O/COPY WNCPYSRC,LE0820O001
**  TABMEM  - SETTLEMENT THROUGH RETAIL ACCOUNTS
     X/COPY WNCPYSRC,LE0820X001
0405140102070812                                                          155174
     X/COPY WNCPYSRC,LE0820X002
**  TABPTS  -  PARTS SOLD PROCESSING TYPES
66676972                                                                  CLE005
**  TABEVT/TABNAM  - EVENT/EVENT NAME
V1START
I2INTEREST
R1REPAYMENT
V3PRINCIPAL INCREASE
M1MATURITY
R3NEW PRINCIPAL
R4PRINCIPAL
R5NEW DISCOUNT
F2COMMITMENT FEE
VXSTART XCCY                                                                           192289 CLE031
MXMATURITY XCCY                                                                        192289 CLE031
MYMATURITY INT. XCCY                                                                   192289 CLE031
FXLOAN FEE XCCY                                                                               CLE031
FYCOMM. FEE XCCY                                                                              CLE031
F1LOAN FEE                                                                                    CLE031
IYINTEREST XCCY                                                                               CLE031
M2MATURITY INT.                                                                               CLE031
RXREPAYMENT XCCY                                                                              CLE031
RYREPAYMENT INT. XCCY                                                                         CLE031
RZNEW PRIN/DISC XCCY                                                                          CLE031
R2REPAYMENT INT.                                                                              CLE031
VYDISCOUNT XCCY                                                                               CLE031
VZPRIN. INCR. XCCY                                                                            CLE031
V2DISCOUNT                                                                                    CLE031
STSTAMP TAX                                                                                   CER049
P1PDCL MATURITY                                                                               CLE134
P2PDCL MATURITY INT                                                                           CLE134
P6PDCL MATURITY ???                                                                           CLE134
     X/COPY WNCPYSRC,LEH00960
**   ZYDY - YEARS IN DAYS CUMULATIVE, FOUR YEAR SPAN
0366073110961461
**   ZMDY - MONTHS IN DAYS CUMULATIVE THROUGH YEAR
000031059090120151181212243273304334365
**   ZMNM - MONTHS SHORT NAMES
JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC
** CPY@   **      OBJECT COPYRIGHT
(c) Finastra International Limited 2001
**   SVAL  -  SYSTEM VALUES ARRAY                                                             CLE033
Settlement09Customer                                                                          CLE033
Settlement09AccCode                                                                           CLE033
Settlement09Hostpgm                                                                           CLE033
**   #AM   -  AMENDMENT TYPE                                                                  CLE033
Participation P.                                                                              CLE033
Participation S.                                                                              CLE033
Loan                                                                                          CLE033
