      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas FC Today's reporting audit')
     A**************************************************************
     A*                                                            *
     A*  Midas - Report Control Facility Module
     A*                                                            *
     A*  PRTF/FC0600P1 - TODAY'S REPORTING AUDIT                   *
     A*                                                            *
     A*                                                            *
      *  (c) Finastra International Limited 2001                      *
     A*                                                            *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01486             Date 06Jun94               *
      *                 E36542             Date 28May92               *
     A*                     E38368            DATE   10APR92       *
     A*                     LN1199            DATE   08APR91       *
     A*                     LN1091            DATE   10JAN91       *
     A*                     LN1067            DATE   06DEC90       *
     A*                     LN0193            DATE   11JUN90       *
     A*                                                            *
     A**************************************************************
     A*                                                            *
      *  MD046248 - Finastra Rebranding                               *
     A*     S01486 - Private Banking Upgrade to Rel 10.            *
     A*              Report Level, Level Name and Entity fields    *
     A*              should always be shown.                       *
     A*  E36542 - (1) INDICATE BRANCH AND REMOVE COLUMN HEADINGS   *
     A*               WHEN THERE IS NO DETAIL TO REPORT.           *
     A*           (2) END OF REPORT SHOULD BE BY BRANCH.           *
     A*     E38368 - NO REFERENCE TO BRANCH IN SINGLE BRANCH MODE  *
     A*     LN1199 - CHANGE CREATION PARAMETERS TO OUTQ(*JOB)      *
     A*     LN1091 - REMOVE EXCESS HEADER INFORMATION FROM         *
     A*              FORMATS RREQSFCT AND NODCTL                   *
     A*     LN1067 - CORRECT UNDERLINING                           *
     A*     LN0193 - HEADINGS CHANGES                              *
     A**************************************************************
      *  C R E A T I O N     P A R A M E T E R S
     A*****************************************************************
     A          R FC0600H0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A**
     A                                  1  1'REFERENCE FC0600P1'
     A*                                                                   LN0193
     A************TITL          51A     1 35                              LN0193
     A            BJURPT        53A     1 30
     A                                  1 90'DATE'
     A*                                                                   LN0193
     A            RUNA           7A     1 96
     A                                  1113'PAGE'
     A            PAGE           4S 0   1119EDTCDE(Z)
     A                                  3 50'AUDIT OF TODAY''S REPORTING'
     A**                                                                /LN1067
     A************                          UNDERLINE
     A                                  4 50'--------------------------'
     A**                                                                /LN1067
     A*                        /E38368/
     A**********                        5  2'BRANCH'
     A**********  RDBRN          3      5  9
     A**********  RBRNM         30      5 13
     A  50                              5  2'BRANCH'
     A  50        RDBRN          3      5  9
     A  50        RBRNM         30      5 13
     A*                        /E38368/
      *                               START OF CHANGE      /E36542/
     A**********                        7  2'USER'
     A**********  RUSRR         10      7  8
     A**********  RUNAM         25      7 19
     A**********                        9  2'REPORT'
     A**********                        9 13'DESCRIPTION'
     A**********                        9 65'PRODUCTION'
     A**********                        9 78'FOR OUTPUT TO:'
     A**50******                        9103'LEVEL'
     A**50******                        9112'ENTITY'
     A**********                        9120'TIME OF'
     A**********                       10  2'NAME/SEQ'
     A**********                       10120'REQUEST'
     A    N80                           7  2'USER'
     A    N80     RUSRR         10      7  8
     A    N80     RUNAM         25      7 19
     A    N80                           9  2'REPORT'
     A    N80                           9 13'DESCRIPTION'
     A    N80                           9 65'PRODUCTION'
     A    N80                           9 78'FOR OUTPUT TO:'
     A***********                                    Begin /S01486/
     A**50N80****                       9103'LEVEL'
     A**50N80****                       9112'ENTITY'
     A    N80                           9103'LEVEL'
     A    N80                           9112'ENTITY'
     A***********                                    End   /S01486/
     A    N80                           9120'TIME OF'
     A    N80                          10  2'NAME/SEQ'
     A    N80                          10120'REQUEST'
      *                                 END OF CHANGE      /E36542/
      *
     A          R RREQDTL                   SPACEB(2)
     A            RRNAM         10         2
     A            RRDSC         50        13
     A            RPROD         11        65
     A            ROUTI         24        78
     A***********                                    Begin /S01486/
     A**50******* RLVL           7       103
     A**50******* RETTY          3       112
     A            RLVL           7       103
     A            RETTY          3       112
     A***********                                    End   /S01486/
     A            RRQTM          6S 0    120EDTWRD('  :  :  ')
     A                                      SPACEA(1)
     A            RRQSQ          5         2
      *
     A          R RREQSFCT
     A************                                           /*LN1091*/
     A************                      1  1'REFERENCE FC0600P1'
     A************                                                        LN0193
     A************TITL          51A     1 35                              LN0193
     A************BJURPT        53A     1 30
     A************                      1 90'DATE'
     A************                                                        LN0193
     A************RUNA           7A     1 96
     A************                      1113'PAGE'
     A************PAGE           4S 0   1119EDTCDE(Z)
     A************                      3 50'AUDIT OF TODAY''S REPORTING'
     A************                                                      /LN1067
     A************                          UNDERLINE
     A************                      4 50'--------------------------'
     A************                                                      /LN1067
     A************                      5  2'BRANCH'
     A************                                                        LN0193
     A************RDBRN          3      5  8                              LN0193
     A************RDBRN          3      5  9
     A************                                                        LN0193
     A************RBRNM         30      5 12                              LN0193
     A************RBRNM         30      5 13
     A************                                                        LN0193
     A************                      7  2'USER'
     A************RUSRR         10      7  8
     A************RUNAM         25      7 19
     A************                      9  2'REPORT'
     A************                      9 13'DESCRIPTION'
     A************                      9 65'PRODUCTION'
     A************                      9 78'FOR OUTPUT TO:'
     A**50********                      9103'LEVEL'
     A**50********                      9112'ENTITY'
     A************                      9120'TIME OF'
     A************                     10  2'NAME/SEQ'
     A************                     10120'REQUEST'
     A************                                           /*LN1091*/
     A            RRNAM         10     12  2
     A            RRDSC         50     12 13
     A            RRQSQ          5     13  2
     A*                                                                   LN0193
     A***********                      13  7'CONTINUED...'                LN0193
     A                                 13  8'CONTINUED...'
     A*                                                                   LN0193
      *
     A          R RREQCTN                   SPACEA(1)
     A            ROUTI         24        78
      *
     A          R FC0600H1                  SPACEB(2)
     A                                    13'REPORTS PRODUCED'
     A                                    76'ENTITY OF'
     A                                      SPACEA(1)
     A                                    76'SPOOL FILE'
     A                                      SPACEA(1)
      *
     A          R SFNODTL                   SPACEB(1)
     A            RPNAM         10        13
     A            RPFTX         50        25
     A            RXETY          3        76
     A            RXNAM         30        80
      *
     A          R EORPT                     SPACEB(3)
      *                               START OF CHANGE      /E36542/
     A**********                          50'*** END OF REPORT ***'
     A N50                                50'*** END OF REPORT ***'
     A  50                                49'*** END OF REPORT FOR'
     A  50                                71'BRANCH '
     A  50        RDBRN          3        78
     A  50                                82'***'
      *                                 END OF CHANGE      /E36542/
      *
     A          R NODETL
     A************                                           /*LN1091*/
     A************                      1  1'REFERENCE FC0600P1'
     A************                                                        LN0193
     A************TITL          51A     1 35                              LN0193
     A************BJURPT        53A     1 30
     A************                      1 90'DATE'
     A************                                                        LN0193
     A************RUNA           7A     1 96
     A************                      1113'PAGE'
     A************PAGE           4S 0   1119EDTCDE(Z)
     A************                      3 50'AUDIT OF TODAY''S REPORTING'
     A************                                                      /LN1067
     A************                          UNDERLINE
     A************                      4 50'--------------------------'
     A************                                                      /LN1067
     A************                      5  2'BRANCH'
     A************                                                        LN0193
     A************RDBRN          3      5  8                              LN0193
     A************RDBRN          3      5  9
     A************                                                        LN0193
     A************RBRNM         30      5 12                              LN0193
     A************RBRNM         30      5 13
     A************                                                        LN0193
     A************                      7  2'USER'
     A************RUSRR         10      7  8
     A************RUNAM         25      7 19
     A************                      9  2'REPORT'
     A************                      9 13'DESCRIPTION'
     A************                      9 65'PRODUCTION'
     A************                      9 78'FOR OUTPUT TO:'
     A**50********                      9103'LEVEL'
     A**50********                      9112'ENTITY'
     A************                      9120'TIME OF'
     A************                     10  2'NAME/SEQ'
     A************                     10120'REQUEST'
     A************                                           /*LN1091*/
     A                                 25 47'*** NO DETAILS TO REPORT ***'
