      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas UP ADBU Script Report')
      *****************************************************************
      *                                                               *
      *  Midas - Upgrade Module                                       *
      *                                                               *
      *  PRTF/UP000092P1 - Midas UP ADBU Script Report                *
      *                                                               *
      *  (c) Finastra International Limited 2020                      *
      *                                                               *
      *  Last Amend No. CUT017 *CREATE     Date 17Mar20               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CUT017 - Adaptive Database Upgrade                           *
      *                                                               *
      *****************************************************************
      *
      *
     A          R HEADH                     TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2020')
     A                                      SKIPB(2)
     A                                     5'Reference: UP000092P1'
     A                                      SPACEB(0)
     A  20                                34'Adaptive Database Upgrade - Script-
     A                                       Report for Global Layer - Details'
     A N20                                34'Adaptive Database Upgrade - Script-
     A                                       Report for Zone Layer - Details'
      *
     A                                   119'Date'
     A                                   124DATE
     A                                      EDTWRD('  /  /  ')
     A                                   119'Time'
     A                                      SPACEB(1)
     A                                   124TIME
     A                                      EDTWRD('  :  :  ')
     A                                   119'Page'
     A                                      SPACEB(1)
     A                                   124PAGNBR
     A                                      EDTCDE(3)
     A                                      SPACEA(2)
      *
     A          R NORECS
     A            R_NORLC       20         5
     A            R_NORLR       20        48SPACEA(2)
                                          40'*** No details to report ***'
     A                                      SPACEA(2)
     A          R LIBRARY
     A                                     5'File:'
     A            R_FILE        10        11
     A                                    24'Library:'
     A            R_LIB         10        33
     A                                     4'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ----------------------'
     A                                      SPACEB(2)
      *
     A          R BACKUP_SC
     A                                     4'Backup Script'
     A                                      SPACEB(1)
     A                                     4'_____________'
     A*                                     ------------------------------------
     A*                                     ------------------------------------
     A*                                     ----------------------'
     A                                      SPACEB(1)
     A          R BK_DET
     A            BKSEQ          3  0      4
     A                                      EDTCDE(Z)
     A                                      SPACEB(1)
     A            BKLINE       100        10
      *
     A          R SQL_SC
     A                                     4'Update Script'
     A                                      SPACEB(1)
     A                                     4'_____________'
     A*                                    4'-----------------------------------
     A*                                     ------------------------------------
     A*                                     ------------------------------------
     A*                                     ----------------------'
     A                                      SPACEB(1)
     A          R SQL_DET
     A                                      SPACEB(1)
     A  20        SQLSEQ         3  0      4
     A                                      EDTCDE(Z)
     A            SQLLINE      100        10
      *
     A          R BLANK
     A                                      SPACEB(1)
      *-------------------*
      ***  Report Trailer *
      *-------------------*
      *
     A          R TRAILP
     A                                      SPACEB(2)
     A                                    51'***  END OF REPORT  ***'
