/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL Network Accounts - MT94x Extension Detail')   *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  PF/A6NW94PD - Midas GL Network Accounts - MT94x Extension    *
      *                Detail                                         *
      *                                                               *
      *  (c) Finastra International Limited 2023                      *
      *                                                               *
      *  Last Amend No. BA6026  *CREATE    Date 18Jan23               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  BA6026 - Structuring Current MT940 and SEPA Compliance.      *
      *                                                               *
      *****************************************************************
      *
     A          R A6NW94D0                  TEXT('(c) Finastra Internation+
     A                                      al Systems Ltd 2023.')
      *
     A            G4RECI         1A         TEXT('Record ID')
     A                                      COLHDG('Record ID')
     A            G4NWRK         6A         TEXT('Network')
     A                                      COLHDG('Network')
     A            G4BRCA         3A         TEXT('Account Branch')
     A                                      COLHDG('Account' 'Branch')
     A            G4CNUM         6A         TEXT('Account Customer')
     A                                      COLHDG('Account' 'Customer')
     A            G4CCY          3A         TEXT('Account Currency')
     A                                      COLHDG('Account' 'Currency')
     A            G4ACCD        10S 0       TEXT('Account Code')
     A                                      COLHDG('Account' 'Code')
     A            G4ACSQ         2S 0       TEXT('Account Sequence')
     A                                      COLHDG('Account' 'Sequence')
     A            G4NATY         1A         TEXT('Network Account Type')
     A                                      COLHDG('Network' 'Account' 'Type')
     A            G4DSTN        11A         TEXT('MT94x Destination')
     A                                      COLHDG('MT94x' 'Destination')
     A            G4SF86         1A         TEXT('Structured Field 86')
     A                                      COLHDG('Structured' 'Field 86')
      *
