     H        1
      *****************************************************************
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas SC Inactive Switchable features')
      *****************************************************************
      *                                                               *
      *  Midas - System Control Module                                *
      *                                                               *
      *  SC0432 - Inactive Switchable features                        *
      *                                                               *
      *  Function:  This program reads through switchable features    *
      *             file SCSARDPD to determine which features have    *
      *             been correctly switched on using passwords.       *
      *                                                               *
      *  Called By: SC3010M                                           *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CSC010  *CREATE    Date 17May99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSC010 - Switchable features enhancments.                    *
      *                                                               *
      *****************************************************************
      *
     FSCSARDL0IF  E           K        DISK
      * Switchable features held on file                              *
      *
     FSCSARJL1IF  E           K        DISK
      * All core and non-core switchable features                     *
      *
     E                    CPY@    1   1 80
      *
      ** Array containing Copyright statement
      *
      /SPACE 3
     ILDA       E DSLDA                         256
      *
      ** Local data area for database error details
      ** *LOCK IN LDA immediately before and OUT LDA immediately
      ** after each database error handling.
      **
      **                                    134 141 DBFILE
      **       Defines:                     142 170 DBKEY
      **                                    171 180 DBPGM
      **                                    181 1830DBASE
      *
     IRUNDAT    E DSRUNDAT
      *
      ** Data Area giving Installation Control Details
      *
     IPSDS       SDS
      *
      ** Program Status Data Structure
      *
     I                                     *PROGRAM PGM
     I                                      244 253 WSID
     I                                      254 263 USER
      *
      ** Set up copyright parameter
      *
     C           *ENTRY    PLIST
     C                     PARM           @RETRN  7
     C                     PARM           PASSON  1
     C                     MOVEACPY@      CPY2@  80
      *
      ** Check if there are any remaining inactive features first
      *
     C           @RETRN    IFEQ 'Check'
     C                     EXSR INACHK
     C                     EXSR EXIT
     C                     ENDIF
     C                     Z-ADD0         ERRCNT  30
     C                     EXSR INACHK
     C*
     C** If some features are inactive, display warning
     C*
     C           *IN66     IFEQ *ON
     C                     CALL 'SC0432W0'
     C                     PARM 'Warning' @RTCD   7
     C                     PARM           KEYP    2
     C                     PARM           ABSARN  6
     C                     PARM           ABSARD 50
     C*
     C** User presses F3
     C*
     C           KEYP      IFEQ '03'
     C                     EXSR EXIT
     C                     ENDIF
     C           *LOVAL    SETLLSCSARDL0
     C                     READ SCSARDL0                 89
     C*
     C           *IN89     DOWEQ'0'
     C                     CALL 'AOSARDR0'
     C                     PARM *BLANKS   @RTCD   7
     C                     PARM '*VERIFY' @OPTN   7
     C                     PARM           ABSARN  6
     C                     MOVE *BLANKS   ACTFLG  8
     C*
     C** Set up a flag to distinguish active from inactive features
     C*
     C           @RTCD     IFEQ *BLANKS
     C                     MOVEL'Active'  ACTFLG
     C                     ELSE
     C                     MOVEL'Inactive'ACTFLG
     C                     ENDIF
     C*
     C** If the feature is inactive, display it
     C*
     C           ACTFLG    IFEQ 'Inactive'
     C           ERRCNT    ADD  1         ERRCNT
     C                     CALL 'SC0432W0'
     C                     PARM *BLANKS   @RTCD   7
     C                     PARM           KEYP    2
     C                     PARM           ABSARN  6
     C                     PARM           ABSARD 50
     C                     ENDIF
     C*
     C** User presses F3
     C*
     C           KEYP      IFEQ '03'
     C                     EXSR EXIT
     C                     ENDIF
      *
     C                     READ SCSARDL0                 89
     C                     ENDDO
     C                     ENDIF
      *
     C                     EXSR EXIT
      /EJECT
      *****************************************************************
      *                                                               *
      *  EXIT   - Subroutine to END PROGRAM                           *
      *                                                               *
      *****************************************************************
     C           EXIT      BEGSR
     C                     SETON                     LR
     C                     RETRN
     C                     ENDSR
      *****************************************************************
      *                                                               *
      *  INACHK - Inactive features check                             *
      *                                                               *
      *****************************************************************
     C           INACHK    BEGSR
     C           *LOVAL    SETLLSCSARDL0
     C                     Z-ADD0         ERRCNT  30
     C                     READ SCSARDL0                 73
     C           *IN73     DOWEQ'0'
     C                     CALL 'AOSARDR0'
     C                     PARM *BLANKS   @RTCD   7
     C                     PARM '*VERIFY' @OPTN   7
     C                     PARM           ABSARN  6
     C                     MOVE *BLANKS   ACTFLG  8
     C*
     C*  Set up a flag to distinguish active from inactive features
     C*
     C           @RTCD     IFEQ *BLANKS
     C                     MOVEL'Active'  ACTFLG
     C                     ELSE
     C                     MOVEL'Inactive'ACTFLG
     C                     ENDIF
     C*
     C* If the PASSWD feature has not been switched on, all non-core
     C* switchable features on SCSARDPD will appear inactive.
     C* This code prevents this:
     C*
     C           PASSON    IFEQ 'N'
     C           ACTFLG    ANDEQ'Inactive'
     C           ABSARN    CHAINSCSARJL1             75
     C           AXMNTB    IFEQ 'B'
     C                     MOVEL'Active  'ACTFLG    P
     C                     ENDIF
     C                     ENDIF
     C*
     C* If the feature is inactive, display it
     C*
     C           ACTFLG    IFEQ 'Inactive'
     C           ERRCNT    ADD  1         ERRCNT
     C                     LEAVE
     C                     ENDIF
     C                     READ SCSARDL0                 73
     C                     ENDDO
     C           ERRCNT    IFGT 0
     C* *IN66 = Inactive features present
     C                     MOVE *ON       *IN66
     C           @RETRN    IFEQ 'Check'
     C                     MOVEL'Errors'  @RETRN    P
     C                     ENDIF
     C                     ENDIF
     C                     ENDSR
      *
      /EJECT
      *****************************************************************
      *                                                               *
      * *PSSR  - Program exception error routine                      *
      *          Called automatically if a program error occurs,      *
      *          or directly by the program code using EXSR.          *
      *          This subroutine DUMPs the program just once.         *
      *                                                               *
      *****************************************************************
      *
     C           *PSSR     BEGSR                           ** *PSSR SR **
     C           @RUN      IFEQ *BLANK
     C                     MOVE 'Y'       @RUN    1
     C                     DUMP
     C                     CALL 'DBERRCTL'
     C                     END
     C                     SETON                     U7U8LR
     C                     RETRN
     C                     ENDSR
      ********************************************************************
**  CPY@
(c) Finastra International Limited 2001
