      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_RU                                                        *
/*EXI *  TEXT('Midas Incoming Valid Messages')
      *****************************************************************
      *                                                               *
      *  Midas - Message Management Module
      *                                                               *
      *  PF/MEINMVPD - Incoming Valid Messages                        *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  NOTE: All changes to this file must also be made to its      *
      *             -DC suffixed equivalent in SETUPMIDAS             *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01435             Date 29Jul93               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  S01435 - Incoming Message Management                         *
      *                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A*=====================================================================
     A          R @INMVPD                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            MVNWRK    R               TEXT('Network')
     A                                      COLHDG('Network')
     A                                      REFFLD(NWRK)
     A            MVMTPY    R               TEXT('Message type')
     A                                      COLHDG('Msg' +
     A                                             'Typ')
     A                                      REFFLD(MTPY)
     A            MVSNDK    R               TEXT('Sender (key)')
     A                                      COLHDG('Sender (key)')
     A                                      REFFLD(NWSN)
     A            MVRECI    R               TEXT('Record Identifier')
     A                                      COLHDG('Record' +
     A                                             'Identifier')
     A                                      REFFLD(RECI)
     A            MVACPT    R               TEXT('Access Point')
     A                                      COLHDG('Access' +
     A                                             'Point')
     A                                      REFFLD(ACPT)
     A            MVINEX    R               TEXT('Include/Exclude')
     A                                      COLHDG('Include/Exclude')
     A                                      REFFLD(MSPF)
     A            MVBRCA    R               TEXT('Branch Code')
     A                                      COLHDG('Branch' +
     A                                             'Code')
     A                                      REFFLD(BRCA)
     A            MVPMFG    R               TEXT('Payment Message Flag')
     A                                      COLHDG('Payment' +
     A                                             'Message Flag')
     A                                      REFFLD(MSPF)
     A            MVNARR    R               TEXT('Narrative')
     A                                      COLHDG('Narrative')
     A                                      REFFLD(PNAR)
     A            MVAJOB    R               TEXT('Job name')
     A                                      COLHDG('Job name')
     A                                      REFFLD(JOJOB)
     A            MVAUSR    R               TEXT('User name')
     A                                      COLHDG('User name')
     A                                      REFFLD(JOUSER)
     A            MVATIM    R     P         TEXT('Action Time')
     A                                      COLHDG('Action' +
     A                                             'Time')
     A                                      REFFLD(MTIME)
     A            MVARDT    R               TEXT('Action Date')
     A                                      COLHDG('Action' +
     A                                             'Date')
     A                                      REFFLD(RUNA)
     A            MVAACT    R               TEXT('Action Type')
     A                                      COLHDG('Action' +
     A                                             'Type')
     A                                      REFFLD(LCTP)
     A            MVRDNB    R               TEXT('Run day number')
     A                                      COLHDG('Run day' +
     A                                             'number')
     A                                      REFFLD(RUND)
     A*=====================================================================
