      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas MG MGF580PD k:mgmodi,mgdest,mgsnbr..')
      *****************************************************************
      *                                                               *
      *  Midas - Message Generation Module                            *
      *                                                               *
      *   LF/MGF580L1 - MT580 CANCELLATION GENERATION DRIVER FILE     *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4.01 -------------------------------------------*
      *  Prev Amend No. CSW025             Date 22Apr02               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CEU005             Date 20Feb98               *
      *                 078256             Date 07May96               *
      *                 CSW003  *CREATE  DATE 24OCT95                 *
      *                                                               *
      *****************************************************************
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CSW025 - Midas Message Manager                               *
      *           - Recompiled over changed file                      *
      *  CEU005  - EMU SE Settlement Ccy Conversion (RECOMPILE)       *
      *  078256  - Recompiled for change in based-on file             *
      *  CSW003  - MT5XX Message Generation - Phase 2.                *
      *****************************************************************
     A          R MGF580D0                  PFILE(MGF580PD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*================================================================
     A          K MGMODI
     A          K MGDEST
     A          K MGSNBR
     A          K MGCRTN
     A          S MGFIN1                    COMP(EQ '/CANCEL/')
     A*================================================================
