      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas MA Optical disk headers')
      **************************************************************
      *                                                            *
      *  Midas - Microfiche/Optical Disk Archiving Module             *
      *                                                            *
      *   LF/MAOPTEL0 - OPTICAL DISK HEADERS                       *
      *                                                            *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                            *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *   LAST AMEND NO. S01382               DATE   05AUG92       *
      *                                                            *
      **************************************************************
      *                                                            *
      *   S01382 - OPTICAL DISK DEVELOPMENT                        *
      *            NEW FILE CREATED FOR SAR                        *
      *                                                            *
      **************************************************************
 
                R MAOPTDD0                  PFILE(MAOPTEPD)
                                            TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *---------------------------------------------------------------------
                  MACCHR
                  ODRDTL
                  ODREPP             I      SST(ODRDTL 6 10)
                K ODREPP
 
