      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE I/O Feedback - Spool Files')                  *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/LEDASPPD - I/O Feedback Area - Spool File                 *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2012            *
      *                                                               *
      *  Last Amend No. CLE134  *CREATE    Date 01Aug12               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CLE134 - Past Due Call Loan Processing                       *
      *                                                               *
      *****************************************************************
      *
     A                                      REF(MFRFL)
     A          R LEPDUED0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2012')
      **
     A            DASP000001    80A         COLHDG('Filler')
     A            DAODPT         2A         COLHDG('ODP' 'Type')
     A            DAFNAM        10A         COLHDG('File')
     A            DALIBR        10A         COLHDG('Library')
     A            DASFLN        10A         COLHDG('Spool' 'File' 'Name')
     A            DASLIB        10A         COLHDG('Spool' 'File' 'Libr')
     A            DASFNO         3B 0       COLHDG('Spool' 'File' 'No')
     A            DAMXRL         3B 0       COLHDG('Max' 'Rec' 'Len')
     A            DAMXKL         3B 0       COLHDG('Max' 'Key' 'Len')
     A            DAMBRN        10A         COLHDG('Member' 'Name')
     A            DASP000002     8A         COLHDG('Filler')
     A            DAFTYP         3B 0       COLHDG('File' 'Type')
     A            DASP000003     3A         COLHDG('Filler')
     A            DAROWS         3B 0       COLHDG('Num PRT/DSP Rows')
     A            DACOLS         3B 0       COLHDG('Num PRT/DSP Cols')
     A            DARECN         7B 0       COLHDG('Num of Rec')
     A            DASNUM         7B 0       COLHDG('6 Digit Spool Nbr')
     A            DASP000004    20A         COLHDG('Filler')
     A            DAVOLO         3B 0       COLHDG('Vol Label Offset')
     A            DAMXRB         3B 0       COLHDG('Max Rcds in Blk')
     A            DAOVRF         3B 0       COLHDG('Overflow Line')
     A            DABLKI         3B 0       COLHDG('Blk Increment')
     A            DASP000005     4A         COLHDG('Filler')
     A            DAFLG1         1A         COLHDG('Misc Flags')
     A            DARQST        10A         COLHDG('Requester Name')
     A            DAOPNC         3B 0       COLHDG('Open Count')
     A            DASP000006     2A         COLHDG('Filler')
     A            DSNBSM         2B 0       COLHDG('Num Based Mbrs')
     A            DAFLG2         1A         COLHDG('Misc Flags')
     A            DAOPNI         2A         COLHDG('Open Identifier')
     A            DAMXRF         3B 0       COLHDG('Max Rcd Fmt Len')
     A            DACSID         3B 0       COLHDG('Database CCSID')
     A            DAFLG3         1A         COLHDG('Misc Flags')
     A            DASP000007     6A         COLHDG('Filler')
     A            DANDVD         3B 0       COLHDG('Num Devs Defined')
     A            DASP000008   138A         COLHDG('Filler')
     A            DACLIN         3B 0       COLHDG('Current' 'Line No')
     A            DACPAG         7B 0       COLHDG('Current' 'Page No')
     A            DAPFLG         1A         COLHDG('Current' 'Page No')
     A            DASP000009    27A         COLHDG('Filler')
     A            DAMAJC         2A         COLHDG('Major' 'Return Code')
     A            DAMINC         2A         COLHDG('Minor' 'Return Code')
