      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas ME Auto gen. rules-based analysis control')
      *****************************************************************
      *                                                               *
      *  Midas - Message Management Module                            *
      *                                                               *
      *  PF/MEGNCRPP - FT Trans. Auto-Gen. Criteria Control           *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *                 192765             Date 01May01               *
      *                 CFT009             Date 30May00               *
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CFT005             Date 07Jul99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CFT002  *CREATE    Date 21Apr98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  192765 - Remove defs not over MFRFL                          *
      *  CFT009 - Addition of fields for FT fees and charges          *
      *  CFT005 - Straight Through Processing Phase 2                 *
      *           Auto-authorisation of STP payments                  *
      *  CFT002 - Straight Through Processing Phase 1                 *
      *           Based on MEGNCRPP original reference S01482         *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  Formats    Description                                       *
      *  ~~~~~~~     ~~~~~~~~~~~                                      *
      *  @GNCRPD    Funds Transfer Batch Authorisation Control Details*
      *                                                               *
      *================================================================
     A                                      REF(MFRFL)
     A          R @GNCRPD                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A            GNMTPY    R               TEXT('Message type')
     A                                      REFFLD(MTPY)
     A            GNMSET         3S 0       TEXT('Set number')
     A            GNNWRK    R               TEXT('Network')
      *                                               /Start 192765/
     A***********                           REFFLD(NWRK MGOREFPD)
     A                                      REFFLD(NWRK)
      *                                               /End 192765/
     A            GNPYTP    R               TEXT('Payment type')
     A                                      REFFLD(PYTP)
     A            GNSETT    R               TEXT('Settlement Type')
     A                                      REFFLD(SETT)
     A            GNEXCP    R               TEXT('Exception Report Req.')
     A                                      REFFLD(RECI)
     A            GNCLRT    R               TEXT('Clearing Type')
     A                                      REFFLD(RECI)
     A            GNBOKC    R               TEXT('Book code')
     A                                      REFFLD(BOKC)
     A            GNPYST    R               TEXT('Payment subtype')
     A                                      REFFLD(PYST)
     A**Start of change CGL029
     A**********  GNCSET    R               TEXT('Credit Settlement')                         CGL029
     A**********                            REFFLD(SEAC)                                      CGL029
     A            QQCSET        18A
     A**********  GNDSET    R               TEXT('Debit Settlement')                          CGL029
     A**********                            REFFLD(SEAC)                                      CGL029
     A            QQDSET        18A
     A**End of change CGL029
     A            GNTRCT    R               TEXT('Transfer Commission')
     A                                      REFFLD(TRCT)
     A            GNBRCA    R               TEXT('Booking Branch')
     A                                      REFFLD(BRCA)
     A            GNCSND    R               TEXT('Clear Sender')
     A                                      REFFLD(RECI)
     A            GNC50     R               TEXT('Clear 50')
     A                                      REFFLD(RECI)
     A            GNC52     R               TEXT('Clear 52')
     A                                      REFFLD(RECI)
     A            GNC53     R               TEXT('Clear 53')
     A                                      REFFLD(RECI)
     A            GNC54     R               TEXT('Clear 54')
     A                                      REFFLD(RECI)
     A            GNC56     R               TEXT('Clear 56')
     A                                      REFFLD(RECI)
     A            GNC57     R               TEXT('Clear 57')
     A                                      REFFLD(RECI)
     A            GNC58     R               TEXT('Clear 58')
     A                                      REFFLD(RECI)
     A            GNC70     R               TEXT('Clear 70')
     A                                      REFFLD(RECI)
     A            GNC72     R               TEXT('Clear 72')
     A                                      REFFLD(RECI)
     A            GNDESC        30          TEXT('Description')
     A                                      COLHDG('Description')
     A            GNDES2        30          TEXT('Description 2')
     A                                      COLHDG('Description 2')
     A            GNAJOB        10          TEXT('Job name')
     A                                      COLHDG('Job name')
     A            GNAUSR        10          TEXT('User name')
     A                                      COLHDG('User name')
     A            GNATIM         6  0       TEXT('Action Time')
     A                                      COLHDG('Action' +
     A                                            'Time')
     A            GNARDT         7          TEXT('Action Date')
     A                                      COLHDG('Action' +
     A                                            'Date')
     A            GNAACT         1          TEXT('Action Type')
     A                                      COLHDG('Action' +
     A                                            'Type')
     A            GNRDNB         5  0       TEXT('Run day number')
     A                                      COLHDG('Run day' +
     A                                            'number')
      *
      *                                              Begin /CFT005/
     A            GNAUTO    R               TEXT('Auto-authorise')
     A                                      REFFLD(RECI)
     A                                      COLHDG('Auto' 'auth')
      *                                              End   /CFT005/
      *================================================================
      *                                              Begin /CFT009/
     A            FXSPRS    R               REFFLD(DBFL)
     A                                      TEXT('FX spread set +
     A                                           (from exchange +
     A                                           spread table).')
     A                                      COLHDG('FX spread set' +
     A                                             '(from exchange' +
     A                                             'spread table).')
      *
     A            PDTOCD    R               REFFLD(DBFL)
     A                                      TEXT('Payment date +
     A                                           offset code +
     A                                           (from payment +
     A                                           offset table).')
     A                                      COLHDG('Payment date offset' +
     A                                             'code (from payment' +
     A                                             'offset table).')
      *
     A            TXCODE    R               REFFLD(DBFL)
     A                                      TEXT('Telex charge +
     A                                           code.')
     A                                      COLHDG('Telex' +
     A                                             'charge' +
     A                                             'code.')
      *
     A            CHEQCG    R               REFFLD(DBFL)
     A                                      TEXT('Cheque charge.')
     A                                      COLHDG('Cheque charge.')
      *
     A            CABCCO    R               REFFLD(DBFL)
     A                                      TEXT('Costs abroad +
     A                                           charge code.')
     A                                      COLHDG('Costs abroad' +
     A                                             'charge code')
      *
     A            SWSTRC    R               REFFLD(DBFL)
     A                                      TEXT('S.W.I.F.T. +
     A                                           standard charge')
     A                                      COLHDG('S.W.I.F.T.' +
     A                                             'standard' +
     A                                             'charge.')
      *
     A            SWPCHG    R               REFFLD(DBFL)
     A                                      TEXT('S.W.I.F.T. +
     A                                           priority charge')
     A                                      COLHDG('S.W.I.F.T.' +
     A                                             'priority' +
     A                                             'charge.')
      *
     A            MISCCH    R               REFFLD(DBFL)
     A                                      TEXT('Miscellaneous +
     A                                           charge')
     A                                      COLHDG('Miscellaneous' +
     A                                             'charge.')
      *
     A            MICHG1    R               REFFLD(DBFL)
     A                                      TEXT('Miscellaneous +
     A                                           charge 1.')
     A                                      COLHDG('Miscellaneous' +
     A                                             'charge 1.')
      *
     A            MICHG2    R               REFFLD(DBFL)
     A                                      TEXT('Miscellaneous +
     A                                           charge 2.')
     A                                      COLHDG('Miscellaneous' +
     A                                             'charge 2.')
      *
     A            MICHG3    R               REFFLD(DBFL)
     A                                      TEXT('Miscellaneous +
     A                                           charge 3.')
     A                                      COLHDG('Miscellaneous' +
     A                                             'charge 3.')
      *
     A            MICHG4    R               REFFLD(DBFL)
     A                                      TEXT('Miscellaneous +
     A                                           charge 4.')
     A                                      COLHDG('Miscellaneous' +
     A                                             'charge 4.')
      *
     A            MICHG5    R               REFFLD(DBFL)
     A                                      TEXT('Miscellaneous +
     A                                           charge 5.')
     A                                      COLHDG('Miscellaneous' +
     A                                             'charge 5.')
      *
     A            TFCOCH    R               REFFLD(DBFL)
     A                                      TEXT('Transfer +
     A                                           commission charge.')
     A                                      COLHDG('Transfer' +
     A                                             'commission charge.')
      *
     A            FXCCCH    R               REFFLD(DBFL)
     A                                      TEXT('FX/change +
     A                                           commission charge.')
     A                                      COLHDG('FX/Change' +
     A                                             'commission charge.')
      *
     A            ADVICH    R               REFFLD(DBFL)
     A                                      TEXT('Advice charge.')
     A                                      COLHDG('Advice charge.')
      *
     A            TELPCH    R               REFFLD(DBFL)
     A                                      TEXT('Telephone charge.')
     A                                      COLHDG('Telephone charge.')
      *
     A            COLLCH    R               REFFLD(DBFL)
     A                                      TEXT('Collection charge.')
     A                                      COLHDG('Collection charge.')
      *
     A            CORRCH    R               REFFLD(DBFL)
     A                                      TEXT('Correspondents charge.')
     A                                      COLHDG('Correspondents' +
     A                                             'charge.')
      *
     A            DEDUCH    R               REFFLD(DBFL)
     A                                      TEXT('Deductions charge.')
     A                                      COLHDG('Deductions charge.')
      *
      *                                              End   /CFT009/
     A**Start of change CGL029
     A            GNCSET        24A         TEXT('Credit Settlement')
     A            GNDSET        24A         TEXT('Debit Settlement')
     A**End of change CGL029
