      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas ME SWIFTRef BANK DIRECTORY Plus Inactive')       *
      *****************************************************************
      *                                                               *
      *  Midas - Message Management Module                            *
      *                                                               *
      *  PF/MEIAB3PD - Midas ME SWIFTRef BANK DIRECTORY Plus Inactive *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2015            *
      *                                                               *
      *  Last Amend No. CFT051  *CREATE    Date 04Jun15               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CFT051 - SWIFTRef Directories 2014                           *
      *                                                               *
      *****************************************************************
      *
     A          R MEIAB3D0                  TEXT('(c) Misys +
     A                                      International +
     A                                      Banking Systems Ltd. +
     A                                      2015')
      *
     A            B3IFLAG        1A         TEXT('Modification Flag')
     A                                      COLHDG('Modification Flag')
     A            B3IKEY        12A         TEXT('Record Key')
     A                                      COLHDG('Record Key')
     A            B3IOFTP        2A         TEXT('Office Type')
     A                                      COLHDG('Office Type')
     A            B3IPOKY       12A         TEXT('Parent Office Key')
     A                                      COLHDG('Parent Office Key')
     A            B3IHOKY       12A         TEXT('Head Office Key')
     A                                      COLHDG('Head Office Key')
     A            B3ILGTP        1A         TEXT('Legal Type')
     A                                      COLHDG('Legal Type')
     A            B3ILGPK       12A         TEXT('Legal Parent Key')
     A                                      COLHDG('Legal Parent Key')
     A            B3IGRTP        6A         TEXT('Group Type')
     A                                      COLHDG('Group Type')
     A            B3IGPKY       12A         TEXT('Group Parent Key')
     A                                      COLHDG('Group Parent Key')
     A            B3IISST        4A         TEXT('Institution Status')
     A                                      COLHDG('Institution Status')
     A            B3ICGKY       12A         TEXT('Cooperative Group Key')
     A                                      COLHDG('Cooperative' +
     A                                      'Group Key')
     A            B3ILEIC       20A         TEXT('ISO LEI Code')
     A                                      COLHDG('ISO LEI Code')
     A            B3IBICC        8A         TEXT('BIC')
     A                                      COLHDG('BIC')
     A            B3IBRCD        3A         TEXT('Branch Code')
     A                                      COLHDG('Branch Code')
     A            B3IUBIC       11A         TEXT('Unique BIC Code')
     A                                      COLHDG('Unique BIC Code')
     A            B3ICHIP        6A         TEXT('CHIPS UID')
     A                                      COLHDG('CHIPS UID')
     A            B3INATI       15A         TEXT('National ID')
     A                                      COLHDG('National ID')
     A            B3ICBIC       11A         TEXT('Connected BIC Code')
     A                                      COLHDG('Connected BIC Code')
     A            B3IINS1       35A         TEXT('Institution Name 1')
     A                                      COLHDG('Institution Name 1')
     A            B3IINS2       35A         TEXT('Institution Name 2')
     A                                      COLHDG('Institution Name 2')
     A            B3IINS3       35A         TEXT('Institution Name 3')
     A                                      COLHDG('Institution Name 3')
     A            B3IBIN1       35A         TEXT('Branch Information 1')
     A                                      COLHDG('Branch Information 1')
     A            B3IBIN2       35A         TEXT('Branch Information 2')
     A                                      COLHDG('Branch Information 2')
     A            B3IPOBN       35A         TEXT('POB Number')
     A                                      COLHDG('POB Number')
     A            B3IADD1       35A         TEXT('Street Name')
     A                                      COLHDG('Street Name')
     A            B3IADD2       35A         TEXT('Street Name')
     A                                      COLHDG('Street Name')
     A            B3IADD3       35A         TEXT('Building, bldg name, +
     A                                      floor')
     A                                      COLHDG('Building, bldg name,' +
     A                                      ' floor')
     A            B3IADD4       35A         TEXT('Area')
     A                                      COLHDG('Area')
     A            B3ICITY       35A         TEXT('City Heading')
     A                                      COLHDG('City Heading')
     A            B3ICPS1       30A         TEXT('CPS 1')
     A                                      COLHDG('CPS 1')
     A            B3ICPS2       30A         TEXT('CPS 2')
     A                                      COLHDG('CPS 2')
     A            B3ICPS3       30A         TEXT('CPS 3')
     A                                      COLHDG('CPS 3')
     A            B3IZIP        15A         TEXT('ZIP Code')
     A                                      COLHDG('ZIP Code')
     A            B3ICNT1       35A         TEXT('Country Name 1')
     A                                      COLHDG('Country Name 1')
     A            B3ICNT2       35A         TEXT('Country Name 2')
     A                                      COLHDG('Country Name 2')
     A            B3IISOC        2A         TEXT('ISO Country Code')
     A                                      COLHDG('ISO Country Code')
     A            B3ITMZN       10A         TEXT('Timezone')
     A                                      COLHDG('Timezone')
     A            B3ISTYP        4A         TEXT('Subtype Indicator')
     A                                      COLHDG('Subtype Indicator')
     A            B3INWCY        4A         TEXT('Network Connectivity')
     A                                      COLHDG('Network Connectivity')
     A            B3IBRQA       35A         TEXT('Branch Qualifier')
     A                                      COLHDG('Branch Qualifier')
     A            B3ISER1       30A         TEXT('Service Codes 1')
     A                                      COLHDG('Service Codes 1')
     A            B3ISER2       30A         TEXT('Service Codes 2')
     A                                      COLHDG('Service Codes 2')
     A            B3ISSIC       12A         TEXT('SSI Group Key')
     A                                      COLHDG('SSI Group Key')
     A            B3IIBNK       12A         TEXT('IBAN Key')
     A                                      COLHDG('IBAN Key')
     A            B3IFILA       35A         TEXT('Field A')
     A                                      COLHDG('Field A')
     A            B3IFLB1       35A         TEXT('Field B 1')
     A                                      COLHDG('Field B 1')
     A            B3IFLB2       35A         TEXT('Field B 2')
     A                                      COLHDG('Field B 2')
     A            B3IUDAT        8A         TEXT('Last Update Date')
     A                                      COLHDG('Last Update Date')
     A            B3IFIL1      256A         TEXT('Filler 1')
     A                                      COLHDG('Filler 1')
     A            B3IFIL2       20A         TEXT('Filler 2')
     A                                      COLHDG('Filler 2')
      *
