      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas ME Midas ME SWIFTRef SEPA Plus Inactive')        *
      *****************************************************************
      *                                                               *
      *  Midas - Message Management Module                            *
      *                                                               *
      *  PF/MEIASPPD - Midas ME Midas ME SWIFTRef SEPA Plus Inactive  *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2015            *
      *                                                               *
      *  Last Amend No. CFT051  *CREATE    Date 04Jun15                *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CFT050 - SWIFTRef Directories upload                         *
      *                                                               *
      *****************************************************************
     A          R MEIASPD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. 2015')
      *
     A            SPIFLAG        1A         TEXT('Modification Flag')
     A                                      COLHDG('Modification' +
     A                                      'Flag')
      *
     A            SPIKEY        12A         TEXT('Record Key')
     A                                      COLHDG('Record Key')
      *
     A            SPIBICC       11A         TEXT('BIC Code')
     A                                      COLHDG('BIC Code')
      *
     A            SPIINS1       35A         TEXT('Institution Name 2')
     A                                      COLHDG('Institution Name 2')
      *
     A            SPIINS2       35A         TEXT('Institution Name 2')
     A                                      COLHDG('Institution Name 2')
      *
     A            SPIINS3       35A         TEXT('Institution Name 3')
     A                                      COLHDG('Institution Name 3')
      *
     A            SPICITY       35A         TEXT('Country Name 1')
     A                                      COLHDG('Country Name 1')
      *
     A            SPIISOC        2A         TEXT('ISO Country Code')
     A                                      COLHDG('ISO' 'Ctry' 'Code')
      *
     A            SPISCHM        8A         TEXT('Scheme')
     A                                      COLHDG('Scheme')
      *
     A            SPIABIC       11A         TEXT('Adherence BIC')
     A                                      COLHDG('Adherence BIC')
      *
     A            SPIABST        8A         TEXT('Adherence BIC Start date')
     A                                      COLHDG('Adherence BIC' 'Start Date')
      *
     A            SPIABEN        8A         TEXT('Adherence BIC Stop Date')
     A                                      COLHDG('Adherence BIC' 'Stop Date')
      *
     A            SPIPAYC       11A         TEXT('Payment Channel')
     A                                      COLHDG('Payment' 'Channel')
      *
     A            SPIPRFC        1A         TEXT('Preferred Channel Flag')
     A                                      COLHDG('Pref.' 'Channel' 'Flag')
      *
     A            SPIREAC        1A         TEXT('Reachability Flag')
     A                                      COLHDG('Reach.' 'Flag')
      *
     A            SPIITRM       11A         TEXT('Interim Institution')
     A                                      COLHDG('Interim' 'Institution')
      *
     A            SPISTDT        8A         TEXT('Start date')
     A                                      COLHDG('Start' 'Date')
     A            SPIENDT        8A         TEXT('Stop date')
     A                                      COLHDG('Stop' 'Date')
      *
     A            SPISAOS        4A         TEXT('SEPA Addl Optional Services')
     A                                      COLHDG('SEPA Addl' 'Optional Servc')
      *
     A            SPIFLDA       35A         TEXT('Field A')
     A                                      COLHDG('Field A')
      *
     A            SPIFLB1       35A         TEXT('Field B 1')
     A                                      COLHDG('Field B 1')
      *
     A            SPIFLB2       35A         TEXT('Field B 2')
     A                                      COLHDG('Field B 2')
      *
     A            SPIUDAT        8A         TEXT('Last Update Date')
     A                                      COLHDG('Last' 'Update' 'Date')
