000100211007/*STD *  PFBASE                                                       *
000101211007/*EXS *  PF_STD                                                       *
000102211019/*EXI *  TEXT('Midas ME MX Header Main details for Elements')         *
000103211007      *****************************************************************
000104211007      *                                                               *
000105211007      *  Midas - Message Management                                   *
000106211007      *                                                               *
000107211019      *  PF/MEISOMPD - Message Management MX Main details for elements*
000108211007      *                                                               *
000109211007      *  (c) Finastra International Limited 2021                      *
000110211007      *                                                               *
000111211007      *  Last Amend No. CSW122 *CREATE     Date 04Oct21               *
000112211007      *                                                               *
000113211007      *---------------------------------------------------------------*
000114211007      *                                                               *
000115211007      *  CSW122 - SWIFT ISO 20022                                     *
000116211007      *                                                               *
000117211007      *****************************************************************
000118211019     A          R MEISOMD0                  TEXT('(c) Finastra +
000119211007     A                                      International +
000120211007     A                                      Limited +
000121211007     A                                      2021')
000122211007      *
000123211019     A            OMMSGR         8  0       TEXT('Message Unique Reference')
000124211007     A                                      COLHDG('Msg Unique' +
000125211007     A                                             'Reference')
000126211007      *
000127211019     A            OMMSID        20A         TEXT('Message ID')
000128211019     A                                      COLHDG('Msg ID')
000129211018      *
000130211109     A            OMUETR        36A         TEXT('UETR')
000131211018     A                                      COLHDG('UETR')
000132211018      *
000133211020     A            OMTYPE        20A         TEXT('MX Type')
000145211019     A                                      COLHDG('MX Type')
000146211020      *
000147211020     A            OMCDTE         6  0       TEXT('MX Received Date')
000148211020     A                                      COLHDG('MX Received' +
000149211020     A                                              'Date')
000150211020
