     A*****************************************************************
     A*                                                               *
     A*  Midas - Message Management Module                            *
     A*                                                               *
     A*  PF/MEVACDPP - Vostro Account Codes                           *
     A*                                                               *
     A*  (C) COPYRIGHT Midas/Kapiti International 1996                *
     A*                                                               *
     A*  Last Amend No. MD31937            Date 13Jan15               *
     A*  Last Amend No. AR856737           Date 13Sep11               *
     A*  LAST AMEND NO. Sxxxxx             DATE ddmmmyy               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  MD31937  - Upgrade STP enhancements to BF Midas 2.1          *
     A*  AR856737 - Upgrade STP enhancements to Midas Plus level      *
     A*  S01489 - Auto Generation                                     *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
/*CRTA*: CRTPF                                                      : *
/*CRTA*: FILE(**********/**********) SRCFILE(**********/**********) : *
/*CRTA*: SRCMBR(*FILE) GENLVL(20) FILETYPE(*DATA) MBR(*FILE)        : *
/*CRTA*: EXPDATE(*NONE) MAXMBRS(1) MAINT(*IMMED) FRCACCPTH(*NO)     : *
/*CRTA*: SIZE(*NOMAX) ALLOCATE(*NO) CONTIG(*NO) REUSEDLT(*YES)      : *
/*CRTA*: UNIT(*ANY) FRCRATIO(*NONE) WAITFILE(*IMMED)                : *
/*CRTA*: WAITRCD(60) SHARE(*YES) DLTPCT(*NONE) LVLCHK(*NO)          : *
/*CRTA*: AUT(*USE) TEXT(*SRCMBRTXT)                                 : *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A*=====================================================================
     A          R @VACDPP                   TEXT('Vostro Account codes')
     A*---------------------------------------------------------------------
     A            VAACCD         4          TEXT('Account Code')
     A                                      COLHDG('Account' +
     A                                             'code')
     A*.....................................................................
     A* Key fields
     A          K VAACCD
     A*=====================================================================
