      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas ME Excluded phrases')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Message Management Module                            *
     A*                                                               *
     A*  PF/MEXPHRPD - Excluded Phrases                               *
     A*                                                               *
     A*  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.03 -----------------------------------------------*
     A*  Prev Amend No. CFT007 *Create     DATE 15Oct99               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  MD046248 - Finastra Rebranding                               *
     A*  CFT007 - BIC Database Plus Integration                       *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A*=====================================================================
     A          R @XPHRPD                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            XPPHRS        20          TEXT('Excluded Phrase')
     A                                      COLHDG('Excluded Phrase')
     A            XPUSER        10          TEXT('Last Update +
     A                                           User   ')
     A                                      COLHDG('Last' 'Update' +
     A                                         'User')
     A            XPCHTP         1          TEXT('Last Update +
     A                                           Type')
     A                                      COLHDG('Last' 'Update' +
     A                                         'Type')
     A            XPTNLU         5  0       TEXT('Last Update +
     A                                           Number')
     A                                      COLHDG('Last' 'Update' +
     A                                         'Number')
     A*=====================================================================
