      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas CB Mutually Exclusive Compnt Copy')              *
      *****************************************************************
      *                                                               *
      *  Midas - Close of Business Module                             *
      *                                                               *
      *  LF/CBMUTXL0 - Mutually Exclusive Component Copy              *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CGL120             Date 06Aug12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CCB003 *C *CREATE  Date 04Apr97               *
      *                 XXXnnn             DATE nnXXXnn               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL120 - GL COB Components Task Split                        *
      *  CCB003 - CoB Task Split Enhancement:                         *
      *         - New logical file used by CoB                        *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A          R CBMEXCD0                  PFILE(CBMUTXPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A* Key fields
     A          K DKCOTT
     A          K DKCSEQ
      **Start of change CGL120
     A**********K DKMEUN                                                                      CGL120
     A          K DKMECN
     A          K DKMECS
      **End of change CGL120
