      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas CB COB run conditions update')
      *****************************************************************
      *                                                               *
      *  Midas - Close of Business Module                             *
      *                                                               *
      *  LF/CBRUNCL0 - COB Run Conditions Update                      *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Last Amend No. CCB008             Date 12Oct98               *
      *  Prev Amend No. S01488             DATE 28Apr94               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CCB008 - Synon Closedown Project (CB):                       *
      *           - File removed from CB model.                       *
      *  S01488 - New file to contain all COB run conditions valid    *
      *           in the system.                                      *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A*=====================================================================
     A          R @RUNCL0                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                      PFILE(CBRUNCPD)
     A*---------------------------------------------------------------------
     A            ANRUNC                    TEXT('COB Run Condition Id')
     A            ANTYL1                    TEXT('Type of Last Change')
     A            ANLCD1                    TEXT('Last Change Date')
     A            ANRUNT                    TEXT('COB Run Condition Text')
     A*.....................................................................
     A* Key fields
     A          K ANRUNC
     A*=====================================================================
