      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas ME SWIFTRef SEPA PLus DIRECTORY - DwnLd')        *
      *****************************************************************
      *                                                               *
      *  Midas - Message Management Module                            *
      *                                                               *
      *  PF/MEDWSPPD - SWIFTRef SEPA Plus DIRECTORY - Downloaded      *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2013            *
      *                                                               *
      *  Last Amend No. CFT050  *CREATE    Date 03Jun13               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CFT050 - SWIFTRef Directories upload                         *
      *                                                               *
      *****************************************************************
      *
     A          R MEDWSPD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. 2013')
      *
     A            DWSP        1248A         TEXT('Downloaded SEPA Record')
     A                                      COLHDG('Downloaded' 'SEPA Record')
      *
