      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_SN                                                        *
/*EXI *  MBR(*NONE)                                                   *
/*EXI *  TEXT('Midas ME Verification of message')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Message Management Module
     A*                                                               *
     A*  PF/MEINMCPD - Verification of Message                        *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01435             Date 29Jul93               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     A*  S01435 - Incoming Message Management                         *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A*=====================================================================
     A          R @INMCPD                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            MCMSGR    R               TEXT('Msg Unique Reference')
     A                                      COLHDG('Msg Unique' +
     A                                             'Reference')
     A                                      REFFLD(MSGR)
     A            MCMTPY    R               TEXT('Message type')
     A                                      COLHDG('Msg' +
     A                                             'Typ')
     A                                      REFFLD(MTPY)
     A            MCMIR     R               TEXT('Message Input reference')
     A                                      COLHDG('Message Input' +
     A                                             'reference')
     A                                      REFFLD(MIR)
     A            MCNWRK    R               TEXT('Network')
     A                                      COLHDG('Network')
     A                                      REFFLD(NWRK)
     A            MCMOR     R               TEXT('Message Output reference')
     A                                      COLHDG('Message Output' +
     A                                             'reference')
     A                                      REFFLD(MOR)
     A            MCBRCA    R               TEXT('Branch Code')
     A                                      COLHDG('Branch' +
     A                                             'Code')
     A                                      REFFLD(BRCA)
     A            MCSNDR    R               TEXT('Sender')
     A                                      COLHDG('Sender')
     A                                      REFFLD(NWSN)
     A            MCACPT    R               TEXT('Access Point')
     A                                      COLHDG('Access' +
     A                                             'Point')
     A                                      REFFLD(ACPT)
     A            MCCPGM    R               TEXT('Calling Process')
     A                                      COLHDG('Calling' +
     A                                             'Process')
     A                                      REFFLD(JOPGM)
     A            MCPMFG    R               TEXT('Payment Message Flag')
     A                                      COLHDG('Payment' +
     A                                             'Message Flag')
     A                                      REFFLD(MSPF)
     A*=====================================================================
