      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas LB DEALSDB+SDCUSTPD/key= cnum.')                 *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Lending Module                             *
     A*                                                               *
     A*  LF/LBDEALL0 - JLF/DEALDBJ1 - JOIN DEALS + CUSTOMER DETAILS SD*
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      *  Last Amend No. CDL099             Date 06Oct17               *
      *  Prev Amend No. CDL094             Date 30May14               *
      *                 CTI006             Date 31Mar14               *
      *                 CSW212             Date 03May12               *
      *                 CER059             Date 19Jul10               *
      *                 CER043             Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CDL049             Date 07Jul06               *
      *                 CSD031             Date 10Apr06               *
      *                 CDL038             Date 10May05               *
      *                 CSD027             Date 05Dec05               *
      *                 CSW037A            Date 02May05               *
      *                 CSD025             Date 11Jan05               *
      *                 CSW037             Date 15Dec04               *
      *                 CSW036             Date 15Dec04               *
      *                 CLE025             Date 20Oct03               *
      *                 CGL029             Date 01Sep03               *
      *                 CAS004             Date 26Jun02               *
      * Midas Release 4.01 -------------------------------------------*
      *                 CAS001             Date 23Nov01               *
      *                 CSW024             Date 31Aug01               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      *                 CSD007             Date 28Aug00               *
      *                 CDL008             Date 02May00               *
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CAP051             Date 10Nov99               *
      *                 CPB001             Date 01Jun99               *
     A*                 CAP034             Date 10MAY99               *
      * Midas DBA 3.01 -----------------------------------------------*
      *                 CDL006             Date 26Apr99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CEU014             Date 24Apr98               *
      *                 CEU003             Date 05Nov97               *
     A*                 CTI001             Date 15Jul97               *
     A*                 CDL002             Date 03Jan97               *
     A*                 CAC001             Date 01Feb96               *
     A*                 CDL001             Date 12OCT95               *
     A*                 CCF001             Date 11APR95               *
     A*                 S01498             DATE 10AUG94               *
     A*                 S01498             DATE 06JUN94               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  CDL099 - Split Value Date (Recompile)                        *
      *  CDL094 - Enhance  Receive Settlement Instructions (Recompile)*
      *  CTI006 - Trade Finance BF Midas 2.2 Interface (Recompile)    *
      *  CSW212 - SWIFT 2012 Changes (Recompile)                      *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER043 - German Features LF041-00 New Fields and Defaulting  *
      *           (Recompile)                                         *
      *  CDL049 - Addition of a Reference Rate field (recompile)      *
      *  CSD031 - Enhanced Centralised Static Data (Recompile)        *
      *  CDL038 - Extended Deal Sub Type (Recompile)                  *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CSW037A- Additional Field extended to 40 chars (recompile)   *
      *  CSD025 - Customer De-Activation                              *
      *  CSW037 - Additional Field Data on MT300/MT320                *
      *  CSW036 - Dual SWIFT BIC held on Client Details               *
      *  CLE025 - Credit Lines (Recompile)                            *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CAS004 - Hedge Accounting Phase A (Recompile)                *
      *  CAS001 - Net Present Value (NPV) Accounting                  *
      *           (Recompile)                                         *
      *  CSW024 - S.W.I.F.T. MT3xx Field 82/83/87. (Recompiled)       *
      *  CSD007 - Customer Closing: Recompile.                        *
      *  CDL008 - Continuous Linked Settlement (Recompiled)           *
     A*  CAP051 - Automatic Authorisation (FX Part)                   *
     A*           Recompile over changes in DEALSDB.                  *
     A*  CPB001 - Meridian DBA Middleware Replication Customization.  *
     A*           Recompile over changes in DEALSDB.                  *
     A*  CAP034 - Conversion of Midas inputs to modular API structure *
     A*           Recompiled over changed SDCUSTPD.                   *
      *  CDL006 - Dealing Fiduciary.                                  *
      *         - Recompiled over changed PF/SDCUSTPD                 *
     A*  CEU014 - EMU User Defined Correspondence Changes:            *
     A*           Recompiled over changed SDCUSTPD.                   *
     A*  CEU003 - EMU Dealing Settlement Ccy Conversion               *
     A*  CTI001 - Midas / Trade Innovation Interface Phase 1          *
     A*           Recompiled over changed SDCUSTPD.                   *
     A*  CDL002 - FX Netting:                                         *
     A*           Recompiled over changed SDCUSTPD.                   *
     A*  CAC001 - Profit Centre Accounting Development:               *
     A*           Recompiled only.                                    *
     A*  CDL001 - Customer Margins project:                           *
     A*           - Addition of Margin Type field to SDCUSTPD.        *
     A*  CCF001 - Concord Development:                                *
     A*           - Recompiled over extended SDCUSTPD.                *
     A*  S01498 - Portfolio Lending Upgrade to Release 10.            *
     A*  S01498 - Portfolio Lending Upgrade                           *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A          R DEALDBJF                  JFILE(DEALSDB SDCUSTPD)
     A**************                                 Begin /S01498/
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A**************                                 End   /S01498/
     A          J                           JOIN(1 2)
     A                                      JFLD(CNUM BBCUSN)
     A*=====================================================================
     A            RECI      R
     A            DLNO      R
     A            RCDT      R
     A            RCDC      R
     A            CNUM      R
      *                                              Begin /S01498/
     A*********** BRCD      R
     A            BRCA      R
      *                                              End   /S01498/
     A            DTYP      R
     A            DLST      R
     A            DDAT      R
     A            VDAT      R
     A            OTDT      R
     A            BRKC      R
     A            BAGE      R
     A            PUCY      R
     A            PUAM      R
     A            EXRT      R
     A            SLCY      R
     A            SLAM      R
     A            BCEQ      R
     A            OBCE      R
     A            LCXR      R
     A            PCST      R
     A            OPCA      R
     A            TSCN      R
     A            SCST      R
     A            OSCA      R
     A            TPCN      R
     A            ORPA      R
     A            ORSA      R
     A            FSLI      R
     A            LITD      R
     A            LILA      R
     A            DITD      R
     A            DILA      R
     A            SPPD      R
     A            SPLA      R
     A            SPLC      R
     A            ILCY      R
     A            ILAM      R
     A            IDCY      R
     A            IDAM      R
     A            IDIA      R
     A            SODN      R
     A            FACO      R
     A            SPI       R
     A            ILIR      R
     A            IDIR      R
     A            ILIA      R
     A            DNSI      R
     A            DSTI      R
     A            CNFI      R
     A            ACEI      R
     A            TLXI      R
     A            ILCM      R
     A            IDCM      R
     A            LSWC      R
     A            LSWS      R
     A            ORED      R
     A            LCD       R
     A            CHTP      R
     A            TNLU      R
     A            BOKC      R
     A            LNKDN     R
     A            RSTM      R
     A            RONS      R
     A            RIBN      R
     A            RIBA      R
     A            ROBN      R
     A            ROCN      R
     A            PSTM      R
     A            PONS      R
     A            PIBN      R
     A            PIBA      R
     A            POBN      R
     A            POCN      R
     A            RCRN      R
     A            RCRA      R
     A            RVNO      R
     A            AWBN      R
     A            AWBA      R
     A            BENN      R
     A            BENA      R
     A            DTP1      R
     A            DTP2      R
     A            DTP3      R
     A            DTP4      R
     A            DCHG      R
     A            BTB1      R
     A            BTB2      R
     A            BTB3      R
     A            BTB4      R
     A            BTB5      R
     A            BTB6      R
     A            CVMR      R
     A            PTFR      R
     A*                                              Begin /CEU003/
     A            RSCY
     A            PSCY
     A            IC72
     A*                                              End   /CEU003/
     A*=====================================================================
      * Begin /CSD027/
     A**********  BBCUSN         6S 0I      RENAME(BBCUST)                                    CSD027
     A            BBCUSN             I      RENAME(BBCUST)
      * End /CSD027/
     A            BBCSSN
     A            BBCNA1
     A            BBCNA2
     A            BBCNA3
     A            BBCNA4
     A            BBCRTN
     A            BBPAIN
     A            BBCRNM
     A            BBDRCS
      *                                              Begin /S01498/
     A*********** BBDRLC
     A            BBLCCD
      *                                              End   /S01498/
     A            BBACOC
     A            BBCNCZ
     A            BBCOLC
     A            BBSSDT
     A            BBDOIC
     A            BBPCNB
     A            BBCASC
     A            BBBRCD
     A            BBBNBI
     A            BBLINC
     A            BBLICD
     A            BBCTNB
     A            BBREID
     A            BBBSIN
     A            BBCSTY
     A            BBTAIN
     A            BBCSID
     A            BBSTAD
     A            BBTXA1
     A            BBTXA2
     A            BBTXA3
     A            BBTXA4
     A            BBTXA5
     A            BBCHID
     A            BBCHSC
     A            BBCABA
     A            BBBFIC
     A            BBBLCD
     A            BBFWCD
      *                                              Begin /S01498/
     A*********** BBMB12
     A*********** BBMR12
     A*********** BBMBR3
     A*********** BBMRT3
     A*********** BBMBR4
     A*********** BBMRT4
     A*********** BBMRT5
     A*********** BBMRT7
     A*********** BBMRT9
     A*********** BBMBR5
     A*********** BBMBR7
     A*********** BBMBR9
     A*********** BBGCRF
     A*********** BBGCCS
     A*********** BBGIDC
     A*********** BBGISC
      *                                              End   /S01498/
     A            BBLCD
     A            BBTYLC
     A            BBLALD
     A            BBLDHD
     A            BBLRLD
     A            BBDTDL
     A            BBLETI
     A            BBCMTI
     A*=====================================================================
     A          K CNUM
     A*=====================================================================
     A          O RECI                      CMP(NE 'D')
     A*=====================================================================
