      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SC Playback Jar File Lock Data Area Layout')
      *****************************************************************
      *                                                               *
      *  Midas - System Control Module                                *
      *                                                               *
      *  PF/SCPBJFLCK - Playback Jar File Lock Data Area Layout       *
      *                                                               *
      *  Note: Any fix applied to this file may also need to be       *
      *        applied to the core DTAARA source.                     *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2005            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. BUG8255 *CREATE    Date 30Aug05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  BUG8255 - Playback Process should be executed as a           *
      *            Standalone program.                                *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R SCPBJRD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2005')
      *
     A            LOCK           1A         TEXT('Filler')
     A                                      COLHDG('Filler')
