      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas AK SE Generated account keys details')
     A********************************************************************
     A*                                                                  *
     A*  Midas - Account Key Generator                         *
     A*                                                                  *
     A*       PF/TSEACKA   GENERATED ACCOUNT KEYS DETAIL                 *
     A*                                                                  *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                                  *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMENDMENT NO. 081881           DATE 17JAN95                *
     A*  PREV AMENDMENT NO. E40721           DATE 04JUN92                *
     A*                                                                  *
     A*****************************************************************
     A*                                                                  *
     A*   081881 - MOVED TO DMLIB                                        *
     A*   E40721 - NEW FILE FOR USE AS A "TEMPLATE"                   *
     A*                                                                  *
     A********************************************************************
     A*                                                               *
     A                                      REF(MFRFL)
     A          R TSEACKAF                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            SLRB      R
     A            SINS      R
     A            SAMD      R
     A            SDEL      R
     A            NORE      R
