      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas ZCOU Data Area Layout')
     A********************************************************************
     A*                                                                ***
     A*  Midas SECURITY PROFILE FACILITY                   ***
     A*                                                                ***
     A*      ZCOU Data Area - Authorised Companies
     A*
     A*  (c) Finastra International Limited 2001                      *
     A**                                                                **
     A**     COMPANY CONFIDENTIAL                                       **
     A*                                                                ***
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*      PREV AMEND NO.                    DATE                    ***
     A*                                                                ***
     A*****************************************************************
     A*                                                               *
     A*  MD046248 - Finastra Rebranding                               *
     A********************************************************************
     A*                                                               *
     A*  NOTE: Any fix applied to this file may also need to be       *
     A*        applied to the core DTAARA source.                     *
     A*                                                               *
     A*****************************************************************
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A*
     A          R ZCOUF                     TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            ZCHO           1          TEXT('Record ID')
     A            ZINO           3          TEXT('Index Number')
     A            ZCO1         150          TEXT('Authorised Companies')
     A            ZCO2         150          TEXT('Authorised Companies')
