      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas ED Drip Feed Audit File')
      *****************************************************************
      *                                                               *
      *  Midas - Midas Export Data Module                             *
      *                                                               *
      *  PF/EDDFAUPD - Drip Feed Audit File                           *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. 101971             Date 17Jul95               *
      *                 S01493 *C *CREATE  Date 16May94               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  101971 - Phase II Modifications                              *
      *  S01493 - Midas Export Data Interface Module.                 *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R EDDFAUD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A            EEBTCH    R               REFFLD(JMBR)
     A                                      TEXT('BATCH')
     A            EEBAST    R               REFFLD(CHTP)
     A                                      TEXT('BATCH STATUS')
     A            EECRET    R               REFFLD(TATM)
     A                                      TEXT('CREATE TIME')
     A            EECRED    R               REFFLD(DMY7)
     A                                      TEXT('CREATE DATE')
     A            EEDELT    R               REFFLD(TATM)
     A                                      TEXT('DELETE TIME')
     A            EEDELD    R               REFFLD(DMY7)
     A                                      TEXT('DELETE DATE')
      *                                     Start of change /101971/    /101971/
     A**********  EEAUDR    R               REFFLD(CHTP)
     A**********                            TEXT('AUDIT REPORTED?')
     A            EEAUDR    R               REFFLD(ACUM)
     A                                      TEXT('AUDIT AGE')
      *                                       End of change /101971/    /101971/
