      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IMIP                                                      *
/*EXI *  TEXT('Midas I.M Control by Message Tag')                     *
      *****************************************************************
      *                                                               *
      *  Midas - Message Management Module                            *
      *                                                               *
      *  LF/MEINDTL0 - Incoming Message Control by Message Tag        *
      *                                                               *
      *  (c) Finastra International Limited 2018                      *
      *                                                               *
      *  Last Amend No. CSW218             Date 19Mar18               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  CSW218 - SWIFT Changes 2018                                  *
      *                                                               *
     A*****************************************************************
     A          R @INDTPD
     A                                      TEXT('(c) Finastra +
     A                                      International Limited +
     A                                      2018')
     A                                      PFILE(MEINDTPD)
     A          K DTMSGR
     A          K DTMTG
