      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IMIP                                                      *
/*EXI *  TEXT('Midas Incoming Electronic Msg Reservn RTV')            *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Message Management Module
     A*                                                               *
     A*  LF/MEINMRL1 - Incoming Electronic Msg Reserv'n RTV           *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. S01435             DATE 29JUL93               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  S01435 - Incoming Message Management                         *
     A*                                                               *
     A*****************************************************************
     A                                      UNIQUE
     A*=====================================================================
     A          R @INMRL1
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                      PFILE(MEINMRPD)
     A*---------------------------------------------------------------------
     A            MRMSGR                    TEXT('Msg Unique Reference')
     A            MRKPRT                    TEXT('Part Number (Key)')
     A            MRJOB                     TEXT('Job name')
     A            MRUSR                     TEXT('User name')
     A            MRJNO                     TEXT('*Job number')
     A*.....................................................................
     A* Key fields
     A          K MRMSGR
     A          K MRKPRT
     A*=====================================================================
