      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IMIP                                                      *
/*EXI *  TEXT('Midas I.M Control  Detail Part Order')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Message Management Module
     A*                                                               *
     A*  LF/MEINDTS2 - Incoming Message Control  Part Order           *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      *  Prev Amend No. CSW209             Date 01Apr09               *
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 S01435             Date 29Jul93               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSW209 - SWIFT 2009 Changes                                  *
     A*  S01435 - Incoming Message Management                         *
     A*                                                               *
     A*****************************************************************
     A          R @INDTS2
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A                                      PFILE(MEINDTPD)
     A*---------------------------------------------------------------------
     A            DTMSGR                    TEXT('Msg Unique Reference')
     A            DTSEQN                    TEXT('Sequence Number')
     A            DTMTG                     TEXT('Message Tag')
     A            DTPART                    TEXT('Part Number')
     A            DTMFLD                    TEXT('Message detail')
     A            DTFPID                    TEXT('First Part Identifier')
      ** Start of Change CSW209
     A            DTMSEQ                    TEXT('Message Sequence')
      ** End of Change CSW209
     A*.....................................................................
     A* Key fields
     A          K DTMSGR
     A          K DTPART
     A          K DTMTG
      ** Start of Change CSW209
     A          K DTMSEQ
      ** End of Change CSW209
     A          K DTSEQN
     A*=====================================================================
     A          R @IN35S2                   TEXT('Incoming Message Det 35')
     A                                      PFILE(MEIN35PD)
     A*---------------------------------------------------------------------
     A            DSMSGR                    TEXT('Msg Unique Reference')
     A            DSSEQN                    TEXT('Sequence Number')
     A            DSMTG                     TEXT('Message Tag')
     A            DSPART                    TEXT('Part Number')
     A            DSMF35                    TEXT('Message detail (35 chars)')
     A            DSFPID                    TEXT('First Part Identifier')
      ** Start of Change CSW209
     A            DSMSEQ                    TEXT('Message Sequence')
      ** End of Change CSW209
     A*.....................................................................
     A* Key fields
     A          K DSMSGR
     A          K DSPART
     A          K DSMTG
      ** Start of Change CSW209
     A          K DSMSEQ
      ** End of Change CSW209
     A          K DSSEQN
     A*=====================================================================
