      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IMIP                                                      *
/*EXI *  TEXT('Midas Message Routing Extension')                      *
      *****************************************************************
      *                                                               *
      *  Midas - Message Management Module                            *
      *                                                               *
      *  LF/MEINMVV0 - Message Routing Extension                      *
      *                                                               *
      *  (c) Finastra International Limited 2004                      *
      *                                                               *
      *  Last Amend No. MD058190           Date 25May21               *
      *  Prev Amend No. MD031937           Date 13Jan15               *
      *                 AR856737           Date 15Jul2011             *
      *                 ESL038             Date 03Aug2004             *
      *                 ERN056             Date 03Aug2004             *
      *                 EEE065             Date 01Jan2004             *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD058190 - FT0300 Compile Error Due to Missing Files. Copied *
      *             FTCRCKP0 source from SP08 Branch.                 *
      *  MD031937 - Upgrade STP enhancements to BF Midas 2.1          *
      *  AR856737 - Upgrade STP enhancements to Midas Plus level.     *
      *  ESL038 - Funds Transfer STP Enhancements                     *
      *  ERN056 - FT Rocket Payment Messages                          *
      *  EEE065 - FT Payment Routing                                  *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
      *
     A          R @INMVV0                   TEXT('(c) Finastra International +
     A                                      Limited 2004')
     A                                      PFILE(MEINMVP0)
      *---------------------------------------------------------------------
     A            MVNWRK                    TEXT('Network')
     A            MVMTPY                    TEXT('Message type')
     A            MVSNDK                    TEXT('Sender (key)')
     A            MVRECI                    TEXT('Record Identifier')
     A            MVDSPR                    TEXT('Display Payment Route')
      * ERN056 Rocket Payment Messages
     A            MVMCMG                    TEXT('MC Message (Y/N)')
     A            MVMCSX                    TEXT('MC Midas Suffix')
     A            MVMACK                    TEXT('MC Ack Immed')
     A            MVMACM                    TEXT('MC Ack Msg')
     A            MVMNCK                    TEXT('MC Reject')
     A            MVMNCM                    TEXT('MC Reject Msg')
     A            MVIMPA                    TEXT('MC Import Accounting')
     A            MVREVA                    TEXT('MC Reversal Accounting')
      * ERN056 Rocket Payment Messages
      *
      * Start of ESL038 changes
     A            MVDSPI                    TEXT('Display PCAT on Incoming')
     A            MVDSPO                    TEXT('Display PCAT on Outgoing')
     A            MVDINC                    TEXT('Disable Input Correction')
      * End of ESL038 changes
      *
      *....................
      * Key fields
     A          K MVNWRK
     A          K MVMTPY
     A          K MVSNDK
     A*=====================================================================
