      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas ME MX Element Name Description')                 *
      *****************************************************************
      *                                                               *
      *  Midas - Message Management Module                            *
      *                                                               *
      *  LF/MEISODL1 - MX Element Description by Msg Unique Ref and   *
      *                Sequence Number                                *
      *                                                               *
      *  (c) Finastra International Limited 2021                      *
      *                                                               *
      *  Last Amend No. MD060246           Date 01Dec22               *
      *  Prev Amend No. CSW122 *CREATE     Date 04Oct21               *
      *                                                               *
      *----------------------------------------------------------------
      *                                                               *
      *  MD060246 - Increase field length value for MX Element Value  *
      *             changed from 120A to 500A. (Recompile)            *
      *  CSW122 - SWIFT ISO 20022                                     *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A          R MEISODD0                  PFILE(MEISODPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2021')
     A          K MEMSGR
     A          K MESEQN
