      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas ME BIC Plus excluding unchanged records')
     A********************************************************************
     A*                                                               *  *
     A*  Midas - Message Management Module                            *
     A*                                                               *  *
     A*  LF/METICPL1 - BIC Plus (excludes unchanged records)          *
     A*                                                               *  *
     A*  (c) Finastra International Limited 2007                      *
     A*                                                               *  *
     A*  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
     A*  Last Amend No. CFT035 *Create     DATE 15Oct99               *
     A*                                                               *  *
     A*------------------------------------------------------------------*
     A*                                                               *  *
     A*  MD046248 - Finastra Rebranding                               *
     A*  CFT035 - BIC Database Plus Changes 2007                      *
     A*                                                               *  *
     A********************************************************************
     A                                      DYNSLT
     A          R @BICPPD                   PFILE(METICPPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A          S BIFLAG                    COMP(NE 'U')
