      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MQ RTEVENTS PF for event code option 1')
      *****************************************************************
     A*                                                               *
     A*    Midas - Midas/Q Module                                     *
     A*                                                               *
     A*    MQ542XPF  -  Subset RTEVENTS.  Dummy File for use          *
     A*                 in Event Selection Option 1                   *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CMQ001             Date 03Nov97               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL029 - Increase Account Code to 10 digits                  *
     A*  CMQ001 - MidasQ rationalisation.                             *
     A*                                                               *
     A********************************************************************
     A*
     A          R OPT1                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            MQID1          8A
      **Start of change CGL029
     A**********  ECOD1          4A                                                           CGL029
     A            ECOD1         10A
      **End of change CGL029
