      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas AC Autocall Status Data Area')
     A*****************************************************************
     A*                                                               *
     A*  Midas - System Control Module                            *
     A*                                                               *
     A*  PF/ACSTAT - Autocall Status Data Area                        *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. 098705             Date 05Feb96               *
      *                 S01491 *C *CREATE  Date 01Oct94               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     A*  098705 - Add resource name field                             *
     A*         - Remove redundant fields.                            *
     A*         - Add text to each field (not annotated)              *
     A*  S01491 - Autocall.                                           *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A                                      REF(MFRFL)
     A          R ACSTATF                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            ACRMTS         1A         TEXT('Remote user?')
     A            ACMIDS         2A         TEXT('Midas system ID')
     A            ACRMTR         1A         TEXT('Remote restart enabled')
     A**                                            /Begin 098705/
     A            ACRSNM        10A         TEXT('Autocall resource name')
     A            ZZ006         16A         TEXT('Filler')
     A************ACUSER        10A         TEXT('User ID')
     A************ACJOBN         6S         TEXT('Job number')
     A**                                            /End   098705/
     A            ACECSU        10A         TEXT('ECS User ID')
     A            ACECSP        10A         TEXT('ECS password')
     A            ACCLNT        10A         TEXT('ECS Client name')
     A            ACFALB         1A         TEXT('Fallback pager flag')
