      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas IR Internal Table')                              *
      *****************************************************************
      *                                                               *
      *  Midas - European Reporting Module - Italy.                   *
      *                                                               *
      *  LF/IRFXTBL1 - Internal Table                                 *
      *                                                               *
      *  (C) Copyright Midas-Kapiti International Ltd. 1997           *
      *                                                               *
      *  Last Amend No. LUC139             Date 11Jan21               *
      *  Prev Amend No. UIT022             Date 13Jan97               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LUC139 - Upgrade UCI Italian Returns                         *
      *  UIT022 - Telegramma Decadale /Puma 2 interface               *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A          R F0PR                      PFILE(IRFXTBPD)
     A                                      TEXT('(C) Midas-Kapiti +
     A                                      International Ltd. 1997')
      *
      ***  Key fields : table code + table key code
      *
     A          K F0INTC
     A          K F0INTK
      *
