      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MS IFS Format Output File')                      *
      *****************************************************************
      *                                                               *
      *  Midas SWIFT Direct Link                                      *
      *                                                               *
      *  PF/MSIFSOPD - Midas MS IFS Format Output File                *
      *                                                               *
      *  (c) Finastra International Limited 2021                      *
      *                                                               *
      *  Last Amend No. CSW052  *CREATE    Date 02Nov21               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSW052 - Send SWIFT messages to AFT via MQ queues            *
      *                                                               *
      *****************************************************************
      *
     A          R MSIFSOD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2021')
      *
     A            SIDATA     10240A         TEXT('Message Data')
     A                                      COLHDG('Message Data')
