      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL Fontis IAT interface data area layout')
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger                                       *
      *                                                               *
      *  PF/GLFIATDA - Midas-Fontis IAT Interface Data Area           *
      *                                                               *
      *  Note: Any fix applied to this file may also need to be       *
      *        applied to the core DTAARA source.                     *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.01 -----------------------------------------------*
      *  Prev Amend No. CGL009 *CREATE     DATE 19May99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL009 - Inter-Account Transfers (IAT) and                   *
      *           Third Party Payments (TPP) Interface                *
      *           for Fontis                                          *
      *                                                               *
      *****************************************************************
     A*
     A                                      REF(MFRFL)
     A          R GLFIATD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*
     A            FFBKGJ        26A         TEXT('IAT Background Job')
     A                                      COLHDG('IAT Background ' +
     A                                      'Job')
     A            FFRIAT         1A         TEXT('Receive IAT Files?')
     A                                      COLHDG('Receive IAT ' +
     A                                      'Files?')
     A            FFICTT         1A         TEXT('IAT tfrd at ICT ind.')
     A                                      COLHDG('IAT ' +
     A                                      'transferred at ' +
     A                                      'ICT indicator')
     A            FFPHAS         1A         TEXT('IAT Activity Phase'  )
     A                                      COLHDG('IAT ' +
     A                                      'Activity phase ')
     A            FFLIBN         3S 0       TEXT('Last IAT Batch Number Used')
     A                                      COLHDG('Last IAT ' +
     A                                      'Batch Number Used')
     A            FFBNRS         1A         TEXT('Batch Range Used Up?')
     A                                      COLHDG('Batch Range' +
     A                                      'Used Up?')
