      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL ATU Nostro Details Data Area Definition')
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  PF/NOSTD - Midas GL ATU Nostro Details Data Area Definition  *
      *                                                               *
      *  (c) Finastra International Limited 2010                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. BUG27903 *CREATE   Date 13Jul10               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  BUG27903 - Unable to transfer account with setl 01 and 08    *
      *                                                               *
      *****************************************************************
      *
     A          R NOSTDF                    TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2010')
      *
     A            DANOST         8A         TEXT('Nostro details')
     A                                      COLHDG('Nostro details')
      *
