      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas LE Past Due Call Loans Maintenance Today rpt')   *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PRTF/LE000082P1 - Past Due Call Loans Maintenance Today      *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2012            *
      *                                                               *
      *  Last Amend No. CLE134  *CREATE    Date 01Aug12               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CLE134 - Past Due Call Loan Processing                       *
      *                                                               *
      *****************************************************************
 
     A          R HEAD01                    SKIPB(3)
     A                                      TEXT('(c) Misys International +
     A                                            Banking Systems Ltd. 2012')
 
     A                                     2'Reference'
     A            SFILE1        10        12
     A            BJURPT        53        40
     A                                   123'Page'
     A                                   128PAGNBR
     A                                      EDTCDE(Z)
     A            BJMRDT         7       115
     A                                      SKIPB(4)
 
     A                                   124TIME
     A                                    48'PAST DUE CALL LOANS MAINTENANCE +
     A                                       TODAY'
     A                                      HIGHLIGHT
     A                                      UNDERLINE
     A                                      SKIPB(5)
 
     A                                     2'Branch'
     A                                      SKIPB(7)
     A            H#BRCA         3         9
     A                                      HIGHLIGHT
     A            H#BRNM        30        13
     A                                      HIGHLIGHT
 
     A                                     2'Loan'
     A                                      HIGHLIGHT
     A                                      SKIPB(9)
     A                                    11'Customer'
     A                                      HIGHLIGHT
     A                                    22'Origin'
     A                                      HIGHLIGHT
     A                                    34'Currency'
     A                                      HIGHLIGHT
     A                                    46'Value'
     A                                      HIGHLIGHT
     A                                    56'Loan Type'
     A                                      HIGHLIGHT
     A                                    78'Current'
     A                                      HIGHLIGHT
     A                                    94'Interest'
     A                                      HIGHLIGHT
     A                                   107'Interest'
     A                                      HIGHLIGHT
     A                                   118'Change'
     A                                      HIGHLIGHT
 
     A                                    22'Loan/Fee'
     A                                      HIGHLIGHT
     A                                      SKIPB(10)
     A                                    46'Date'
     A                                      HIGHLIGHT
     A                                    56'Sub-type'
     A                                      HIGHLIGHT
     A                                    78'Principal'
     A                                      HIGHLIGHT
     A                                    94'Rate'
     A                                      HIGHLIGHT
     A                                   107' Basis  '
     A                                      HIGHLIGHT
     A                                   119'Type'
     A                                      HIGHLIGHT
     A                                      SKIPA(11)
 
     A  30                                56'Class'
     A  30                                  HIGHLIGHT
     A  30                                  SKIPA(12)
 
     A          R DETAIL01                  SPACEB(1)
     A            #1LNRF         6         2
     A            #1CNUM         6        12
     A            #1OGNLNF       9        22
     A            #1CCY          3        36
     A            #1VDAT         8        45
     A            #1LTSTCL      10        56
     A            #1CPAM        21        67
     A            #1INTR        14        90
     A            #1ICBS         1       110
     A            #1CHTP         1       120
 
     A          R FOOT01                    SPACEB(3)
     A                                    48'*** End of Report for Branch'
     A            H#BRCA         3        77
     A                                    81'***'
 
     A          R FOOT02                    SPACEB(3)
     A                                    56'*** End of Report ***'
