      *****************************************************************
/*STD *  PRTFP1                                                       *
/*EXI *  TEXT('Midas LE Stamp Tax A/c Keys and Generated Entries')    *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending                                     *
      *                                                               *
      *  PRTF/LE008110P1 - Stamp Tax generated A/C Keys and Postings  *
      *                                                               *
      *  (C) Copyright Finastra International Limited 2010            *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CLE148             Date 23Jul12               *
      *                 CER049 *C *CREATE  Date 06Dec201              *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CLE148 - Alpha Loan Reference                                *
      *  CER049 - Stamp Tax                                           *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
      **   *******************
      **   PAGE HEADINGS
      **   *******************
      **
     A          R HEADP1                    SKIPB(3)
     A                                     6'REFERENCE LE008110P1'
     A            BJURPT        53A       39
     A                                   101'DATE'
     A            BJMRDT         7A      106
     A                                   119'PAGE'
     A            PAGE2        004S 0    125EDTCDE(Z) SPACEA(2)
      *
     A                                    30'LENDING - '
     A                                    40'A/C KEYS AND GENERATED EN'
     A                                    65'TRIES'
      *
     A                                      SPACEA(1)
     A                                    30'----------'
     A                                    40'-------------------------'
     A                                    65'-----'
     A                                      SPACEA(2)
     A                                    04'ACCOUNT KEY'
     A                                    21'LOAN  '
     A                                    30'MISSING'
     A                                    40'EVENT'
     A                                    50'EVENT'
     A                                    74'EVENT AMOUNT'
     A                                    89'REV'
     A                                      SPACEA(1)
     A                                    21'NUMBER'
     A                                    32'IND'
     A                                    40'DATE'
     A                                    51'CCY'
     A                                    89'IND'
      **
      **   *****************************************
      **   DETAIL PART OF REPORT 2 - A/C KEY
      **   *****************************************
      **
     A          R DETLP21                   SPACEB(2)
     A            AKEY          14A       04
      **Start of change CLE148
     A**********  LNNO           6S 0     21                                                  CLE148
     A            LNNO           6A       21
      **End of change CLE148
     A            SMISS          1A       33
     A            YEVDT          7A       40
     A            EVCY           3A       51
     A            EDEVAM        21A       65
     A            RVRS           1A       90
      **
      **   *****************************************
      **   DETAIL PART OF REPORT 3 - GENERATED ENTRY
      **   *****************************************
      **
     A          R DETLP31                   SPACEB(1)
     A            P1BRCA    R             10REFFLD(BRCA)
     A            P1CNUM    R             15REFFLD(CNUMA)
     A            P1CCY     R             23REFFLD(CCY)
     A            P1ACOD    R             28REFFLD(ACOD)
     A            P1ACSQ    R             34REFFLD(ACSQ)
     A            PVALD          7A       48
     A            PPSTD          7A       58
     A            PNAR      R             68
     A            PPSTA         21A      100
     A            PDRCR          2A      121
      **   *******************
      **   REPORT TRAILER
      **   *******************
      **
     A          R TRAILP1                   SPACEB(2)
     A                                    56'*** END OF REPORT ***'
