      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas LE Credit Lines Trans Fac History Proc Rpt')
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PRTF/LE000030P1 - Credit Lines Transaction Facility History  *
      *                    Report                                     *
      *                                                               *
      *  (c) Finastra International Limited 2003                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CLE025  *CREATE    Date 20Oct03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CLE025 - Credit Lines                                        *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R HEADP1                    TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2003')
      *
     A                                      SKIPB(3)
     A                                     6'REFERENCE LE000030P1'
     A            BJURPT    R             37REFFLD(URPT)
     A                                   101'DATE'
     A            BJMRDT    R            106REFFLD(MRDT)
     A                                   119'PAGE'
     A                                   124PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(1)
      *
     A                                   101'TIME'
     A                                   106TIME
     A                                      EDTWRD('  :  :  ')
     A                                      SPACEA(1)
      *
     A                                    46'EXTRACT CREDIT LINES ACTIONS +
     A                                      FOR FACILITY UPDATE'
      *
     A                                   132' '
     A                                      SPACEA(1)
     A                                    46'-----------------------------+
     A                                      -------------------'
     A                                      SPACEA(2)
      *
     A                                     3'DEAL'
     A                                    97'VALUE'
     A                                      SPACEA(1)
      *
     A                                     2'NUMBER'
     A                                    18'ACCOUNT'
     A                                    42'FACILITY'
     A                                    55'ACTION'
     A                                    73'DESCRIPTION'
     A                                    98'DATE'
     A                                   106'CCY'
     A                                   119'AMOUNT'
     A                                      SPACEA(2)
      *
     A          R DETAIL
      *
     A            RDEAL          6         2
     A            RACCOUNT      28        10
     A            RFACILTY      13        40
     A            RACTION        2        57
     A            RDESC         35        61
     A            RVDATE         7        97
     A            RVFCCY         3       106
     A            RAMOUNT       21       111
     A                                      SPACEA(1)
      *
     A          R TRAILP1
     A                                    51'***  END OF REPORT  ***'
     A                                      SPACEB(3)
      *
