      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas LE Facility amendments audit report')            *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PRTF/LE3170P1 - Facility Amendments Audit Report             *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. AR787620           Date 10Jun11               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 BUG7672            Date 30Jun05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 154116             Date 28Jan99               *
      *                 147935             Date 04Dec98               *
      *                 CLE005 *Create     Date 22May97               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  AR787620 - Hooks Incorporation                               *
      *             WNCPYSRC,LEH00198                                 *
      *  BUG7672 - LE report LE3170 amount field error                *
      *  154116 - Addition of the customer name.                      *
      *  147935 - Addition of insert, authorise and amend user        *
      *           profiles to lending reports                         *
      *  CLE005 - Customer Lending Enhancements - Others (T3)         *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
      *--------------------------------*
      ***  Report Header Record Format *
      *--------------------------------*
      *
     A          R HEADP1                    TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A                                      SKIPB(3)
     A                                     6'REFERENCE LE3170P1'
     A            BJURPT    R             37REFFLD(URPT)
     A                                   101'DATE'
     A            BJMRDT    R            106REFFLD(MRDT)
     A                                   119'PAGE'
     A                                   124PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(1)
      *
     A                                   101'TIME'
     A                                   106TIME
     A                                      EDTWRD('  :  :  ')
     A                                      SPACEA(1)
      *
     A                                    46'FACILITY AMENDMENT AUDIT +
     A                                      REPORT'
      *
     A  37                                89'BRANCH -'
     A  37        A8BRCD    R             98REFFLD(BRCA)
     A  37        A8BRNM    R            102REFFLD(BRNM)
      *
     A                                   132' '
     A                                      SPACEA(1)
     A                                    46'-------------------------+
     A                                      ------'
     A                                      SPACEA(2)
      *
      ***  Sub-Headings:
      ***  -------------
      *
      *                                              Begin /154116/
     A***********                         89'New'
      **Start of change BUG7672
     A**********                          96'New'                                            BUG7672
     A*/COPY WNCPYSRC,LEH00448
     A                                   102'New'
      **End of change BUG7672
      *                                              End   /154116/
     A                                      SPACEA(1)
     A                                     7'Facility'
      *                                              Begin /154116/
     A***********                         22'Value'
     A***********                         31'Amend'
     A***********                         38'Amendment'
     A***********                         62'Amount'
     A***********                         78'Currency'
     A***********                         89'Expiry'
     A***********                        101'Revolving'
     A***********                           SPACEA(1)
     A***********                         22'Date'
     A***********                         32'Seq'
     A***********                         38'Type'
     A***********                         89'Date'
     A***********                        101'Credit'
      **Start of change BUG7672
     A**********                          29'Value'                                          BUG7672
     A**********                          38'Amend'                                          BUG7672
     A**********                          45'Amendment'                                      BUG7672
     A**********                          69'Amount'                                         BUG7672
     A**********                          85'Currency'                                       BUG7672
     A**********                          96'Expiry'                                         BUG7672
     A**********                         108'Revolving'                                      BUG7672
     A                                    28'Value'
     A                                    37'Amend'
     A                                    44'Amendment'
     A                                    68'Amount'
     A*/COPY WNCPYSRC,LEH00449
     A                                    91'Currency'
     A*/COPY WNCPYSRC,LEH00450
     A                                   101'Expiry'
     A                                   111'Revolving'
      **End of change BUG7672
     A                                      SPACEA(1)
      **Start of change BUG7672
     A**********                          29'Date'                                           BUG7672
     A**********                          39'Seq'                                            BUG7672
     A**********                          45'Type'                                           BUG7672
     A**********                          96'Date'                                           BUG7672
     A**********                         108'Credit'                                         BUG7672
     A                                    28'Date'
     A                                    38'Seq'
     A                                    44'Type'
     A                                   102'Date'
     A                                   111'Credit'
      **End of change BUG7672
      *                                              End   /154116/
     A                                      SPACEA(2)
      *
      *-------------------------*
      ***  Detail Record Format *
      *-------------------------*
      *
     A          R DETAIL
      *
     A            RCNUM          6         6
     A                                    12'-'
     A            RFACT          3        13
     A                                    16'-'
     A            RFCNO          2        17
     A*/COPY WNCPYSRC,LEH00198
      *                                              Begin /154116/
     A*********** RVLDT          7        22
     A*********** RSQNO          3        33
     A*********** RFATP         19        38
     A*N21******* RAAMT         17        59
     A*N21******* RACCY          3        81
     A*********** RNDEX          7        89
     A*********** RRVCR          3       103
     A*********** RASTS         10       112SPACEA(1)
      **Start of change BUG7672
     A**********  RVLDT          7        29                                                 BUG7672
     A**********  RSQNO          3        40                                                 BUG7672
     A**********  RFATP         19        45                                                 BUG7672
     A*N21******  RAAMT         17        66                                                 BUG7672
     A*N21******  RACCY          3        88                                                 BUG7672
     A**********  RNDEX          7        96                                                 BUG7672
     A**********  RRVCR          3       110                                                 BUG7672
     A**********  RASTS         10       119                                                 BUG7672
     A            RVLDT          7        28
     A            RSQNO          3        38
     A            RFATP         19        44
     A N21        RAAMT         25        66
     A*/COPY WNCPYSRC,LEH00451
     A N21        RACCY          3        93
     A*/COPY WNCPYSRC,LEH00452
     A            RNDEX          7       101
     A            RRVCR          3       111
     A            RASTS         10       122
      **End of change BUG7672
     A                                      SPACEA(1)
      *                                              End   /154116/
      *                                              Begin /147935/
      *                                              Begin /154116/
     A***********                         22'INSERTING USER'
     A*********** RIUSR     R             38REFFLD(ZZ010)
     A***********                         59'AMENDING USER'
     A*********** RAUSR     R             74REFFLD(ZZ010)
     A***********                         89'AUTHORISING USER'
     A*********** RXUSR     R            107REFFLD(ZZ010)
     A            RCRNM         20A        6
     A                                    29'INSERTING USER'
     A            RIUSR     R             45REFFLD(ZZ010)
     A                                    66'AMENDING USER'
     A            RAUSR     R             81REFFLD(ZZ010)
     A                                    96'AUTHORISING USER'
     A            RXUSR     R            114REFFLD(ZZ010)
      *                                              End   /154116/
     A*/COPY WNCPYSRC,LEH00599
     A                                      SPACEA(2)
      *                                              End   /147935/
      *
      *-------------------*
      ***  Report Trailer *
      *-------------------*
      *
     A          R TRAILP1
     A  37                                44'***  END OF REPORT FOR +
     A                                      BRANCH'
     A                                      SPACEB(3)
     A  37        RBRCA     R             74REFFLD(BRCA)
     A  37                                79'***'
     A N37                                51'***  END OF REPORT  ***'
     A                                      SPACEB(3)
