      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas LE Facility history reconciliation report')      *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Customer Lending Module                              *
     A*                                                               *
     A*  PRTF/LER032P1 - Print File for Facilities History            *
     A*                  reconciliations exceptions report            *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. AR787620           Date 10Jun11               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027             Date 30Nov05               *
      *                 CLE025             Date 20Oct03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CLE004             Date 02Dec96               *
      *                 051427             Date 08Sep93               *
     A*                 E29762             Date 08Apr92               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  AR787620 - Hooks Incorporation                               *
      *             WNCPYSRC,LEH00060                                 *
      *             WNCPYSRC,LEH00061                                 *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CLE025 - Credit Lines                                        *
      *  CLE004 - Customer Lending Enhancements - Syndications        *
     A*  051427 - Leading zeros should not be suppressed for cust.    *
     A*           number.                                             *
     A*  E29762 - History checked incorrectly - changed so            *
     A*           that revolving credit facilities are reported       *
     A*           in the same way as non-revolving facilities         *
     A*           and the report now shows expired facilities.        *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R LER032H1                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A                                      SKIPB(3)
     A                                     6'REFERENCE'
      *                                                    /Start 0026/
     A***********                         16'LER032'
     A                                    16'LER032P1'
      *                                                      /End 0026/
     A            BJURPT        53        36
     A                                   100'DATE'
     A            BJMRDT         7       105
     A                                   119'PAGE'
     A            PAGE           4  0    124EDTCDE(Z)
     A                                      SPACEA(2)
      *                                                    /Start 0026/
     A***********                         34'FACILITIES HISTORY RECONCILIATION -
     A***********                           EXCEPTIONS'
     A*N33******                          79'BRANCH'
     A*N33******  BRCA      R             86
     A*N33******  BRCA      R             86
     A*N33******                          90'-'
     A*N33******  BRNM          30A       92
     A                                    34'FACILITIES HISTORY RECONCILIATION'
     A  33                                  SPACEA(2)
     A N33                                68'BRANCH'
     A N33        BRCA      R             75
     A N33                                79'-'
     A N33        BRNM          30A       81
      *                                                    /End 0026/
     A N33                                  SPACEA(2)
     A
     A
     A                                    36'----------- HISTORY -----------'
      *                                              Begin /CLE004/
     A***********                         72'----------- FACILITY ----------'
     A N25                                72'------------ FACILITY -----------'
     A  25                                71'-------------------'
     A  25                                91'FACILITY -------------------'
     A*E29762****
     A***********                        110'STATUS'
     A*E29762****
     A                                   123'STATUS'
     A                                      SPACEA(1)
      *                                              End   /CLE004/
     A                                     5'CUSTOMER'
     A
     A
     A
     A                                    18'FACILITY'
     A
     A                                    +1'CURRENCY'
     A
     A                                    36'FACILITY AMOUNT'
     A
     A                                    54'DRAWN AMOUNT'
     A
     A                                    71'FACILITY AMOUNT'
     A
      *                                              Begin /CLE004/
     A***********                         91'DRAWN AMOUNT'
     A                                    90'DRAWN AMOUNT'
     A N25                               105' '
     A                                      SPACEA(2)
     A  25                               106'FACILITY IND.'
      *                                              End   /CLE004/
     A
     A
     A
     A                                      SPACEA(2)
     A
     A          R LER032D1                  SPACEA(1)
     A
     A*********              START OF CHANGE               /051427/
     A*********   CNUM           6  0      6EDTCDE(Z)
      * Begin /CSD027/
     A**********  CNUM           6  0      6                                                  CSD027
     A            CNUM           6A        6
      * End /CSD027/
     A*                      END OF CHANGE                 /051427/
     A*/COPY WNCPYSRC,LEH00060
     A            FACT           3  0     18EDTCDE(Z)
     A                                    21'/'
     A            FCNO           2  0     22EDTCDE(Z)
     A*/COPY WNCPYSRC,LEH00061
     A            FCCY           3        30
     A     60     @DSAMT        13  0     33EDTWRD(' ,   ,   ,   , 0 -')
     A     61     @DSAM1        13  1     33EDTWRD('   ,   ,   , 0 . -')
     A     62     @DSAM2        13  2     33EDTWRD('  ,   ,   , 0 .  -')
     A     63     @DSAM3        13  3     33EDTWRD(' ,   ,   , 0 .   -')
     A     60     @DTAMT        13  0     51EDTWRD(' ,   ,   ,   , 0 -')
     A     61     @DTAM1        13  1     51EDTWRD('   ,   ,   , 0 . -')
     A     62     @DTAM2        13  2     51EDTWRD('  ,   ,   , 0 .  -')
     A     63     @DTAM3        13  3     51EDTWRD(' ,   ,   , 0 .   -')
     A     60     @DUAMT        13  0     69EDTWRD(' ,   ,   ,   , 0 -')
     A     61     @DUAM1        13  1     69EDTWRD('   ,   ,   , 0 . -')
     A     62     @DUAM2        13  2     69EDTWRD('  ,   ,   , 0 .  -')
     A     63     @DUAM3        13  3     69EDTWRD(' ,   ,   , 0 .   -')
     A     60     @DVAMT        13  0     87EDTWRD(' ,   ,   ,   , 0 -')
     A     61     @DVAM1        13  1     87EDTWRD('   ,   ,   , 0 . -')
     A     62     @DVAM2        13  2     87EDTWRD('  ,   ,   , 0 .  -')
     A     63     @DVAM3        13  3     87EDTWRD(' ,   ,   , 0 .   -')
      *                                              Begin /CLE004/
     A  25        RFAIN     R            107REFFLD(DCRA)
     A*E29762****
     A*********** @STAT         10       110
     A*E29762****
     A            @STAT         10       123
      *                                              End   /CLE004/
      **Start of change CLE025
     A  51                                36'OFFSET AMOUNT: '
     A                                      SPACEB(1)
     A  51 60     @DWAMT        13  0     51EDTWRD(' ,   ,   ,   , 0 -')
     A  51 61     @DWAM1        13  1     51EDTWRD('   ,   ,   , 0 . -')
     A  51 62     @DWAM2        13  2     51EDTWRD('  ,   ,   , 0 .  -')
     A  51 63     @DWAM3        13  3     51EDTWRD(' ,   ,   , 0 .   -')
     A  51                                71'OFFSET AMOUNT: '
     A  51 60     @DXAMT        13  0     86EDTWRD(' ,   ,   ,   , 0 -')
     A  51 61     @DXAM1        13  1     86EDTWRD('   ,   ,   , 0 . -')
     A  51 62     @DXAM2        13  2     86EDTWRD('  ,   ,   , 0 .  -')
     A  51 63     @DXAM3        13  3     86EDTWRD(' ,   ,   , 0 .   -')
      **End of change CLE025
     A
     A          R LER032T2
     A*E29762
     A***********                         16'THE HISTORY DETAILS FOR THE ABOVE -
     A***********                           FACILITIES DO NOT'
     A*E29762
     A                                    16'THE HISTORY DETAILS FOR SOME OF -
     A                                      THE ABOVE FACILITIES DO NOT'
     A
     A                                      SPACEB(3)
     A
     A                                    16'RECONCILE TO THE FACILITY DETAILS -
     A                                      AND SHOULD BE INVESTIGATED'
     A                                      SPACEB(1)
     A                                      SPACEA(3)
     A
     A          R LER032T3
      *                                                   /Start 0026/
     A**33***********                     60'***  END OF REPORT  ***'
     A  33                                55'***  END OF REPORT  ***'
     A
     A*N33***********                     55'***  END OF REPORT FOR +
     A***************                       BRANCH'
     A*N33********STRBRC         3        85
     A*N33***********                     90'***'
     A
     A N33                                49'***  END OF REPORT FOR +
     A                                      BRANCH'
     A N33        STRBRC         3        79
     A N33                                83'***'
      *                                                     /End 0026/
     A
