      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60J                                                    *
/*EXI *  TEXT('Midas LE Loan fees - amortized')                       *
/*ADD *  CHGPRTF FILE(LER180P4) SAVE(*YES)                            *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Customer Lending Module
     A*                                                               *
     A*  PRTF/LER180P4 - Print File For loan fee accruals             *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      *  Last Amend No. CLE073             Date 12May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 30Nov05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CLE042             Date 06Sep05               *
      *                 158687             Date 13Apr99               *
      *                 156582             Date 25Mar99               *
      *                 CLE005             Date 22May97               *
      *                 100431             Date 22May96               *
     A*                 100371             Date 22May96               *
     A*                 BH3518             DATE 09SEP92               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  CLE073 - Calculated Loan Based Fees                          *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CLE042 - Extended Loan Sub Type                              *
      *  158687 - Header 'fees up to and excluding' should be 'fees   *
      *           and past due up to and excluding' to be consistent  *
      *           with the report details.                            *
      *  156582 - LER180, fee accrual report should subtract payables *
     A*  CLE005 - Customer Lending Enhancements - Others (T3)         *
     A*  100431 - Fee currency name in headings getting corrupted     *
     A*           by subsequent chain to ccy file with facility ccy.  *
     A*  100371 - Correct alignment of amounts.                       *
     A*  BH3518 - Formatting changes                                  *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R LER180D1                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                      SKIPB(2)
     A                                     6'REFERENCE'
     A                                    16'LER180P4'
     A            BJURPT        53        30
     A                                   100'DATE'
     A            BJMRDT         7       105
     A                                   119'PAGE'
     A            PAGE4          4  0    124EDTCDE(Z)
     A                                      SPACEA(2)
     A*                                                        /BH3518/
     A**********                          40'Loan Fee Amortisation Report'
      *                                              Begin /158687/
     A***********                         40'Loan Fee Amortisation Report - up -
     A***********                           to and excluding'
     A                                    26'Loan Fee Amortisation and Past +
     A                                      Due Report - up to and excluding'
      *                                              End   /158687/
     A            TODATE         7        +1
     A*N24******                            SPACEA(2)
     A N24                                  SPACEA(1)
     A*                                                        /BH3518/
     A  24                                +1'Branch'
     A  24        BRCA           3        +1
     A  24                                +1'-'
     A  24        BRNM          30A       +1
     A*                                                        /BH3518/
     A**24******                            SPACEA(2)
     A  24                                  SPACEA(1)
      *                                              Begin /158687/
     A***********                         40'-----------------------------------
     A***********                           ------------------------'
     A                                    26'-------------------------------+
     A                                      --------------------------------+
     A                                      --------'
      *                                              End   /158687/
     A                                      SPACEA(1)
     A*                                                        /BH3518/
     A
     A          R LER180D2
     A            FEFCCY         3         2
     A                                     6' - '
     A*                                              Begin /100431/
     A************A6CYNM        14         9
     A            ULCYNM        14         9
     A*                                              End   /100431/
     A*                                                        /BH3518/
     A**********                            SPACEA(2)
     A                                      SPACEA(1)
     A                                     2'---------------------'
     A                                      SPACEA(1)
     A*                                                        /BH3518/
     A                                     1'Cust.'
     A                                     8'Name'
     A                                    29'Loan'
     A*                                              Begin /CLE042/
     A************************************35'Fee'                                             CLE042
     A************************************39'Fee'                                             CLE042
     A************************************43'Loan'                                            CLE042
     A************************************66'From'                                            CLE042
     A                                    38'Fee'                                             CLE042
     A                                    42'Fee'                                             CLE042
     A                                    45'Loan'                                            CLE042
     A                                    68'From'                                            CLE042
     A*                                              End   /CLE042/
     A                                    74'Fee'
     A                                    79'Fee '
     A                                   101'Calculated'
     A                                   120'Accrued'
     A                                      SPACEA(1)
     A                                     1'Number'
     A                                     8'Town'
     A                                    29'Type'
     A*                                              Begin /CLE042/
     A                                    38'Seq'                                             CLE042
     A                                    42'Cde'                                             CLE042
     A                                    45'Amount'                                          CLE042
     A                                    68'Date'                                            CLE042
     A************************************35'Seq'                                             CLE042
     A************************************39'Cde'                                             CLE042
     A************************************43'Amount'                                          CLE042
     A************************************66'Date'                                            CLE042
     A*                                              End   /CLE042/
     A                                    74'Bas'
     A                                    79'Type/Amount'
     A                                   101'Amount'
     A                                   120'Amount'
     A                                      SPACEA(2)
     A
     A          R LER180D3                  SPACEA(1)
      * Begin /CSD027/
     A**********  FECNUM         6  0      1                                                  CSD027
     A            FECNUM         6A        1
      * End /CSD027/
     A            BBCRNM        20         8
     A            LTYP           2        29
     A                                    31'/'
     A            SUTP           2        32
     A*                                              Begin /CLE042/
     A            CLAS           4        34                                                  CLE042
     A            FEFSEQ         2  0     39                                                  CLE042
     A            FEFCOD         2  0     42                                                  CLE042
     A  34        LAMT0         13  0     45EDTCDE(J)                                         CLE042
     A  35        LAMT1         13  1     45EDTCDE(J)                                         CLE042
     A  36        LAMT2         13  2     45EDTCDE(J)                                         CLE042
     A  37        LAMT3         13  3     45EDTCDE(J)                                         CLE042
     A            CCY            3        64                                                  CLE042
     A            FRDATE         7        68                                                  CLE042
      **Start of Change CLE073
     A            OFCALT         2        74
     A  11        FERATE         7  5     86EDTCDE(L)
      **End of Change CLE073
     A************FEFSEQ*********2  0     36                                                  CLE042
     A************FEFCOD*********2  0     39                                                  CLE042
     A**34********LAMT0         13  0     43EDTCDE(J)                                         CLE042
     A**35********LAMT1         13  1     43EDTCDE(J)                                         CLE042
     A**36********LAMT2         13  2     43EDTCDE(J)                                         CLE042
     A**37********LAMT3         13  3     43EDTCDE(J)                                         CLE042
     A************CCY            3        62                                                  CLE042
     A************FRDATE         7        66                                                  CLE042
     A*                                              End   /CLE042/
      **Start of Change CLE073
     A**30******* FEEAM0        13  0     77EDTCDE(J)                                         CLE073
     A**31******* FEEAM1        13  1     77EDTCDE(J)                                         CLE073
     A**32******* FEEAM2        13  2     77EDTCDE(J)                                         CLE073
     A**33******* FEEAM3        13  3     77EDTCDE(J)                                         CLE073
     A*/COPY WNCPYSRC,LEH00635
     A  30N11     FEEAM0        13  0     77EDTCDE(J)
     A  31N11     FEEAM1        13  1     77EDTCDE(J)
     A  32N11     FEEAM2        13  2     77EDTCDE(J)
     A  33N11     FEEAM3        13  3     77EDTCDE(J)
     A*/COPY WNCPYSRC,LEH00636
      **End of Change CLE073
     A  30        CALCD0        13  0     96EDTCDE(J)
     A  31        CALCD1        13  1     96EDTCDE(J)
     A  32        CALCD2        13  2     96EDTCDE(J)
     A  33        CALCD3        13  3     96EDTCDE(J)
     A  30        POSTD0        13  0    115EDTCDE(J)
      *                                              Begin /156582/
     A**30*******                           SPACEA(1)
     A  30N53                               SPACEA(1)
      *                                              End   /156582/
     A  31        POSTD1        13  1    115EDTCDE(J)
      *                                              Begin /156582/
     A**31*******                           SPACEA(1)
     A  31N53                               SPACEA(1)
      *                                              End   /156582/
     A  32        POSTD2        13  2    115EDTCDE(J)
      *                                              Begin /156582/
     A**32*******                           SPACEA(1)
     A  32N53                               SPACEA(1)
      *                                              End   /156582/
     A  33        POSTD3        13  3    115EDTCDE(J)
      *                                              Begin /156582/
     A**33*******                           SPACEA(1)
     A  33N53                               SPACEA(1)
     A  53                               132'*'
     A  53                                  SPACEA(1)
      *                                              End   /156582/
     A            BBCRTN        10         8
     A*                                              Begin /CLE005/
     A  50                                29'** PAYABLE **'
     A  51                                29'** INTERNAL **'
     A  52                                29'** RECEIVABLE **'
     A*                                              End   /CLE005/
     A
     A          R LER180D4
     A
     A N24                                50'***  END OF REPORT  ***'
     A
     A  24                                46'***  END OF REPORT FOR +
     A                                      BRANCH'
     A  24        STRBRC         3        76
     A  24                                81'***'
     A          R LER180D6                  SPACEB(1)
     A**********                                               /BH3518/
     A**********                          54'Total for currency'BH3518/
     A**********  SVCCY          3        78                   /BH3518/
     A**30******  CLTOM0        15  0     85EDTCDE(J)          /BH3518/
     A**30******                            SPACEA(2)          /BH3518/
     A**31******  CLTOM1        15  1     85EDTCDE(J)          /BH3518/
     A**31******                            SPACEA(2)          /BH3518/
     A**32******  CLTOM2        15  2     85EDTCDE(J)          /BH3518/
     A**32******                            SPACEA(2)          /BH3518/
     A**33******  CLTOM3        15  3     85EDTCDE(J)          /BH3518/
     A**33******                            SPACEA(2)          /BH3518/
     A                                    61'Total for currency'
     A            SVCCY          3        85
     A*                                              Begin /100371/
     A**30********CLTOM0        15  0     93EDTCDE(J)
     A  30        CLTOM0        15  0     94EDTCDE(J)
     A*                                              End   /100371/
     A  31        CLTOM1        15  1     93EDTCDE(J)
     A  32        CLTOM2        15  2     93EDTCDE(J)
     A*                                              Begin /100371/
     A**33********CLTOM3        15  3     93EDTCDE(J)
     A**30********CXTOM0        15  0    112EDTCDE(J)
     A  33        CLTOM3        15  3     94EDTCDE(J)
     A  30        CXTOM0        15  0    113EDTCDE(J)
     A*                                              End   /100371/
     A  30                                  SPACEA(2)
     A  31        CXTOM1        15  1    112EDTCDE(J)
     A  31                                  SPACEA(2)
     A  32        CXTOM2        15  2    112EDTCDE(J)
     A  32                                  SPACEA(2)
     A*                                              Begin /100371/
     A**33********CXTOM3        15  3    112EDTCDE(J)
     A  33        CXTOM3        15  3    113EDTCDE(J)
     A*                                              End   /100371/
     A  33                                  SPACEA(2)
     A*                                                        /BH3518/
