      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60J                                                    *
/*EXI *  TEXT('Midas Fees Due for Settlement -Overdue Rpt')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Customer Lending Module
     A*                                                               *
     A*  PRTF/LER160P1 - Print File showing Fees due for Settlement - *
     A*                  Overdue Fees.                                *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Last Amend No. 245614             Date 08Mar07               *
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. 153792             Date 18Feb99               *
      *                 CLE005             Date 02Dec96               *
      *                 BH3515             Date 07Sep92               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  245614 - Incorrect accnt offcr description and space needed  *
      *  153792 - Fees due for settlement report should show          *
      *           syndicated fees better                              *
     A*  CLE005 - Customer Lending Enhancements - Others (T3)         *
     A*  BH3515 - UNDERLINE keyword prevents viewing of header on outq*
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R LER160H1                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                      SKIPB(3)
     A                                     6'REFERENCE'
     A                                    16'LER160P1'
     A            BJURPT        53        30
     A                                   100'DATE'
     A*
     A            BJMRDT         7       105
     A                                   119'PAGE'
     A            PAGE           4  0    124EDTCDE(Z)
     A                                      SPACEA(2)
     A                                    38'FEES DUE FOR SETTLEMENT REPORT - O-
     A                                      VERDUE FEES'
     A**********                            UNDERLINE          /BH3515/
     A**********                            SPACEA(2)          /BH3515/
     A                                      SPACEA(1)
     A                                    38'-----------------------------------
     A                                      -----------'
     A                                      SPACEA(1)
     A*                                                        /BH3515/
     A          R LER160H2                  SPACEA(2)
     A                                     1'BRANCH NAME'
     A            BRNM      R             13
     A                                   117'BRANCH'
     A            @AORL          3       124
     A
     A**********R LER160H3                  SPACEA(2)          /BH3515/
     A          R LER160H3                  SPACEA(1)
     A**********                                                      /3410/
     A**********                           5'ACCOUNT OFFICER'
     A                                     2'ACCOUNT OFFICER'
     A**********                                                      /3410/
     A**********                             UNDERLINE         /BH3515/
     A
      *                                              Begin /CLE005/
     A***********                         37'FEE REFERENCE'
     A***************************************UNDERLINE*********/BH3515/**
     A***********
     A***********                         60'CUSTOMER NAME'
     A***************************************UNDERLINE*********/BH3515/**
     A***********                         81'CUSTOMER TOWN'
     A***************************************UNDERLINE*********/BH3515/**
     A*******************************************************************
     A************************************95'CCY'************************
     A***************************************UNDERLINE*******************
     A*******************************************************************
     A***********************************107'AMOUNT*DUE'*****************
     A***************************************UNDERLINE*******************
     A*******************************************************************
     A***********************************119'DUE*DATE'*******************
     A***************************************UNDERLINE*******************
     A***********                         95'CCY'
     A***************************************UNDERLINE*********/BH3515/**
     A***********
     A***********                        107'AMOUNT DUE'
     A***************************************UNDERLINE*********/BH3515/**
     A***********
     A***********                        119'DUE DATE'
     A***************************************UNDERLINE*********/BH3515/**
     A                                    36'FEE REFERENCE'
     A                                    54'CUSTOMER NAME'
     A                                    75'CUSTOMER TOWN'
     A                                    89'CCY'
      *                                              Begin /153792/
     A***********                        102'AMOUNT DUE'
     A***********                        114'DUE DATE'
     A**20*******                        124'FEE IND'
     A                                    96'AMOUNT DUE'
     A                                   112'DUE DATE'
     A  20                               121'FEE IND'
     A  25                               129'SYN'
      *                                              End   /153792/
     A                                   132' '
      *                                              End   /CLE005/
     A                                      SPACEA(1)
     A                                     2'---------------'
      *                                              Begin /CLE005/
     A***********                         37'-------------'
     A***********                         60'-------------'
     A***********                         81'-------------'
     A***********                         95'---'
     A***********                        107'----------'
     A***********                        119'--------'
     A                                    36'-------------'
     A                                    54'-------------'
     A                                    75'-------------'
     A                                    89'---'
      *                                              Begin /153792/
     A***********                        102'----------'
     A***********                        114'--------'
     A**20*******                        124'-------'
     A                                    96'----------'
     A                                   112'--------'
     A  20                               121'-------'
     A  25                               129'---'
      *                                              End   /153792/
     A                                   132' '
      *                                              End   /CLE005/
     A
     A          R LER160D1                  SPACEA(1)
     A  50                                 1' '
     A                                      SPACEA(1)
     A**********                                                      /3410/
     A************@AO           30         5
     A            @AO           33         2
     A
     A************@FR           19        37
      *                                              Begin /CLE005/
     A*********** @FR           16        37
     A****************************************************************/3410/
     A********************************************************************
     A*********** BBCRNM        20        60
     A*********** BBCRTN        10        82
     A********************************************************************
     A************FEFCCY*****R************85REFFLD(CCY)*******************
     A*****60*****@DSAMT********13**0*****90EDTWRD('*,***,***,***,*0*-')**
     A*****61*****@DSAM1********13**1*****90EDTWRD('***,***,***,*0*.*-')**
     A*****62*****@DSAM2********13**2*****90EDTWRD('**,***,***,*0*.**-')**
     A*****63*****@DSAM3********13**3*****90EDTWRD('*,***,***,*0*.***-')**
     A************@DD************7*******110******************************
     A*********** FEFCCY    R             95REFFLD(CCY)
     A*****60**** @DSAMT        13  0    100EDTWRD(' ,   ,   ,   , 0 -')
     A*****61**** @DSAM1        13  1    100EDTWRD('   ,   ,   , 0 . -')
     A*****62**** @DSAM2        13  2    100EDTWRD('  ,   ,   , 0 .  -')
     A*****63**** @DSAM3        13  3    100EDTWRD(' ,   ,   , 0 .   -')
     A*********** @DD            7       120
     A            @FR           16        36
     A            BBCRNM        20        54
     A            BBCRTN        10        76
     A            FEFCCY    R             89REFFLD(CCY)
      *                                              Begin /153792/
     A*****60**** @DSAMT        13  0     95EDTWRD(' ,   ,   ,   , 0 -')
     A*****61**** @DSAM1        13  1     95EDTWRD('   ,   ,   , 0 . -')
     A*****62**** @DSAM2        13  2     95EDTWRD('  ,   ,   , 0 .  -')
     A*****63**** @DSAM3        13  3     95EDTWRD(' ,   ,   , 0 .   -')
     A*********** @DD            7       115
     A**20******* RPTFI          3A  O   126
     A     60     @DSAMT        13  0     93EDTWRD(' ,   ,   ,   , 0 -')
     A     61     @DSAM1        13  1     93EDTWRD('   ,   ,   , 0 . -')
     A     62     @DSAM2        13  2     93EDTWRD('  ,   ,   , 0 .  -')
     A     63     @DSAM3        13  3     93EDTWRD(' ,   ,   , 0 .   -')
     A            @DD            7       113
     A  20        RPTFI          3A  O   123
     A  25        RSYIN          1A      130
      *                                              End   /153792/
      *                                              End   /CLE005/
     A
     A          R LER160T2
     A                                    60'***  END OF REPORT  ***'
     A                                      SPACEB(3)
     A          R LER160T4
     A                                    60'***  END OF REPORT FOR THIS BRANCH-
     A                                      ***'
     A                                      SPACEB(3)
     A
     A          R LER160T3
     A                                    55'* NO OVERDUE FEE DETAILS TO REPORT-
     A                                      FOR THIS BRANCH *'
     A                                      SPACEB(3)
     A** Start of change 245614
     A          R LER160S1
     A            @SPC           1A  O     1SPACEB(001)
     A** End of change 245614
