      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXI *  TEXT('Midas GP BSPL Analysis File')
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  GPBSANL0 - BSPL Analysis File                                *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2004            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGP010  *CREATE    Date 17Jan05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGP010 - Global BSPL                                         *
      *                                                               *
      *****************************************************************
     A          R GPBSAND0                  PFILE(GPBSANPD)
     A          K A1ZONE
     A          K YR
     A          K PR
     A          K BRCA
     A          K CCY
     A          K ACOD
     A          K EPBLDC
     A          K ANLYSC
