      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GP SAR Core/Branch password file')
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing                                    *
      *                                                               *
      *  LF/GPCSECL1 - Switchable Features from Core and Non-core     *
      *                delivered password files.                      *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGP002  *CREATE    Date 11Aug03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGP002 - Global Processing                                   *
      *           - New file. Global version of SCCSECL1.             *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A          R GPCSECD0                  PFILE(GPCSECPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
     A            RECI
     A            P@SARN
     A            SEPASS
     A            SEINTL
      *
     A          K P@SARN
      *
     A          R GPCSECD1                  PFILE(GPNSECPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
     A            RECI
     A            P@SARN
     A            SEPASS
     A            SEINTL
      *
     A          K P@SARN
