      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXI *  TEXT('Midas GP Global Historic Balances')
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  GPHIBLL1 - Global Historic Balances                          *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2005            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      *  Prev Amend No. CGP010  *CREATE    Date 17Jan05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGP010 - Global BSPL                                         *
      *                                                               *
      *****************************************************************
     A          R GPHIBLD0                  PFILE(GPHIBLPD)
     A          K YR
     A          K PR
     A          K BRCA
     A          K CCY
     A          K ACOD
     A          K CNUM
     A          K ACSQ
