      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GP Manual Transaction details')                  *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  LF/GPMATRL0 - Midas GP Manual Transaction details            *
      *                                                               *
      *  (c) Finastra International Limited 2012                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. AR1009180 *CREATE  Date 25Nov12               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  AR1009180 - Show unauthorized manual transaction in          *
      *              Midas dashboard (Child:AR1009182)                *
      *                                                               *
      *****************************************************************
      *
     A          R T_MLMTRAN                 PFILE(T_MLMTRAN)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2012')
      *
     A            MTBRCHCODE                TEXT('Booking branch')
     A            MTAUTH                    TEXT('Status')
      *
     A          K MTBRCHCODE
      *
      ** Select only those records that requires reauthorization
      *
     A          S MTAUTH                    VALUES('C' 'R')
      *
