      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GP Trigger log by event date and time')
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  LF/GPTLOGL0 - Trigger Log By 'Event Date' and 'Event Time'   *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2004            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGP001  *CREATE    Date 09Mar04               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  CGP001 - Global Processing                                   *
      *           Required to add triggers to global files            *
      *                                                               *
      *****************************************************************
     A          R GPTLOGD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2004')
     A                                      PFILE(GPTLOGPD)
      *
     A          K TREVTD
     A          K TREVTT
