      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas MC F/M Accounts Rec'n Report - Imbalance')
      *****************************************************************
      *                                                               *
      *  Midas - Management Accounting Module                         *
      *                                                               *
      *  PRTF/MC0550P2 - Financial/Management Accounts Reconciliation *
      *                  Imbalance Report                             *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. 124847 *CREATE     Date 05Sep97               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  124847 - Financial/Management Accounts Reconciliation        *
      *           New printer file for MC0550.                        *
      *                                                               *
      *****************************************************************
     A*
     A                                      REF(MFRFL)
     A*
     A*--------------------------------*
     A**  Report Header Record Format  *
     A*--------------------------------*
     A*
     A          R MC0550E0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*
     A                                      SKIPB(3)
     A                                     6'REFERENCE MC0550P2'
     A            BJURPT    R             37REFFLD(URPT)
     A                                   101'DATE'
     A            BJMRDT    R            106REFFLD(MRDT)
     A                                   119'PAGE'
     A                                   124PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(1)
     A*
     A                                   101'TIME'
     A                                   106TIME
     A                                      EDTWRD('  :  :  ')
     A                                      SPACEA(1)
     A*
     A                                    51'FINANCIAL & MANAGEMENT +
     A                                      ACCOUNTS'
     A                                      SPACEA(1)
     A                                    51'-----------------------+
     A                                      --------'
     A                                      SPACEA(1)
     A                                    56'RECONCILIATION REPORT -+
     A                                       IMBALANCE'
     A  10 11                            115'CONSOLIDATED'
     A                                   132' '
     A                                      SPACEA(1)
     A                                    56'---------------------'
     A                                      SPACEA(2)
     A*
     A*---------------*
     A**  Sub-Heading *
     A*---------------*
     A*
     A  10                                 6'BRANCH'
     A  10        RBRCA     R             15REFFLD(BRCA)
     A  10        RBRNM     R             19REFFLD(BRNM)
     A                                      SPACEA(1)
     A                                     6'CURRENCY'
     A            RCCY      R             15REFFLD(CCY)
     A                                      SPACEA(2)
     A*
     A*------------------------*
     A**  Detail Sub-Headings  *
     A*------------------------*
     A*
     A                                     1'CUSTOMER'
     A**Start of change CGL029
     A**********                          11'A/C CODE'                                        CGL029
     A**********                          21'A/C SEQ'                                         CGL029
     A**********                          34'ACCOUNT NAME'                                    CGL029
     A**********                          56'FINANCIAL ACCOUNT'                               CGL029
     A**********                          83'MANAGEMENT ACCOUNT'                              CGL029
     A                                    12'A/C CODE'
     A                                    23'A/C SEQ'
     A                                    36'ACCOUNT NAME'
     A                                    58'FINANCIAL ACCOUNT'
     A                                    85'MANAGEMENT ACCOUNT'
     A**End of change CGL029
     A                                      SPACEA(1)
     A                                     1'--------'
     A**Start of change CGL029
     A**********                          11'--------'                                        CGL029
     A**********                          21'-------'                                         CGL029
     A**********                          30'--------------------'                            CGL029
     A**********                          52'-------------------------'                       CGL029
     A**********                          79'-------------------------'                       CGL029
     A                                    11'----------'
     A                                    23'-------'
     A                                    32'--------------------'
     A                                    54'-------------------------'
     A                                    81'-------------------------'
     A**End of change CGL029
     A                                      SPACEA(2)
     A*
     A*-------------------------*
     A**  Detail Record Format  *
     A*-------------------------*
     A*
     A          R MC0550E1
     A*
     A            RCNUM     R              2REFFLD(CNUMA)
     A**Start of change CGL029
     A**********  RACOD     R             13REFFLD(ACODA)                                     CGL029
     A**********  RACSQ     R             23REFFLD(ACSQA)                                     CGL029
     A**********  RANAM     R             30REFFLD(ANAM)                                      CGL029
     A**********  RFBAL         25A       52                                                  CGL029
     A**********  RMBAL         25A       79                                                  CGL029
     A            RACOD         10A       11
     A            RACSQ     R             25REFFLD(ACSQA)
     A            RANAM     R             32REFFLD(ANAM)
     A            RFBAL         25A       54
     A            RMBAL         25A       81
     A**End of change CGL029
     A                                      SPACEA(1)
     A*
     A*-------------------*
     A**  Report Trailer  *
     A*-------------------*
     A*
     A          R MC0550E2
     A  10N11                             46'***  END OF REPORT FOR +
     A                                      BRANCH  ***'
     A                                      SPACEB(2)
     A N10
     AO 11                                51'***  END OF REPORT  ***'
     A                                      SPACEB(2)
