      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Daylight Saving Time Code')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDDSTCPD - Midas SD DST File                              *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2008            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Last Amend No. CSW208  *CREATE    Date 15Apr08               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSW208 - SWIFT 2008 Changes                                  *
      *                                                               *
      *****************************************************************
     A          R SDDSTCD0                  TEXT('(c) Misys +
     A                                      International +
     A                                      Banking Systems Ltd. +
     A                                      2008')
      *
     A            DSRECI         1A         TEXT('Record ID')
     A                                      COLHDG('Record ID')
      *
     A            DSDSCD        10A         TEXT('DST Code')
     A                                      COLHDG('DST Code')
      *
     A            DSYEAR         4A         TEXT('Year')
     A                                      COLHDG('Year')
      *
     A            DSDESC        60A         TEXT('Description')
     A                                      COLHDG('Description')
      *
     A            DSOFFS         3S 0       TEXT('Offset Time')
     A                                      COLHDG('Offset Time')
      *
     A            DSDSDT         5P 0       TEXT('DST Start Date')
     A                                      COLHDG(' DST Start Date')
      *
     A            DSDSDH         6S 0       TEXT('DST Start Time')
     A                                      COLHDG('DST Start Time')
      *
     A            DSDSTM         2S 0       TEXT('DST Month')
     A                                      COLHDG('DST Month')
      *
     A            DSDSTW         1S 0       TEXT('DST Week')
     A                                      COLHDG('DST Week')
      *
     A            DSDSTD         2S 0       TEXT('DST Day')
     A                                      COLHDG('DST Day')
      *
     A            DSDSED         5P 0       TEXT('DST End Date')
     A                                      COLHDG(' DST End Date')
      *
     A            DSDENH         6S 0       TEXT('DST End Time')
     A                                      COLHDG('DST End Time')
      *
     A            DSDENM         2S 0       TEXT('DST Month of End Date')
     A                                      COLHDG('DST Month' 'of End Date' )
      *
     A            DSDENW         1S 0       TEXT('DST Week of End Date')
     A                                      COLHDG('DST Week' 'of End Date')
      *
     A            DSDEND         2S 0       TEXT('DST Day of End Date')
     A                                      COLHDG('DST Day' 'of End Date')
      *
     A            DSDIND         1A         TEXT('DST Indicator')
     A                                      COLHDG('DST Indicator')
      *
     A            DSLCD          5P 0       TEXT('Last Change Date')
     A                                      COLHDG('Last Change Date')
      *
     A            DSLCT          1A         TEXT('Last Change Type')
     A                                      COLHDG('Last Change Type')
      *
     A            DSUSER        10A         TEXT('User')
     A                                      COLHDG('User')
