      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FT CCT header browse')
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTE102HBPD - CCT Header                                   *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.03 -----------------------------------------------*
      *  Last Amend No. CFT008  *CREATE    Date 29Sep99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CFT008 - Funds Transfer/Swift Messages MT102                 *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R FTE102HBD0                TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            OKSDORD   R               REFFLD(OKFLAG)
     A                                      TEXT('Sndr/Dest/Ord cust')
     A                                      COLHDG('Sndr/Dest/Ord cst')
     A                                      DFT('Y')
      *
     A            OKFLRF    R               REFFLD(OKFLAG)
     A                                      TEXT('File ref/cct id')
     A                                      COLHDG('File ref/cct id')
     A                                      DFT('Y')
      *
     A            OKSFACTN  R               REFFLD(OKFLAG)
     A                                      TEXT('Subfile Action Code')
     A                                      COLHDG('Subfile Action Code')
     A                                      DFT('Y')
      *
     A            OKHDACTN  R               REFFLD(OKFLAG)
     A                                      TEXT('Header Action Code')
     A                                      COLHDG('Header Action Code')
     A                                      DFT('Y')
      *
     A            OKCCTD    R               REFFLD(OKFLAG)
     A                                      TEXT('CCT Id')
     A                                      COLHDG('CCT Id')
     A                                      DFT('Y')
      *
     A            OKTRRF    R               REFFLD(OKFLAG)
     A                                      TEXT('Transaction +
     A                                      Reference')
     A                                      COLHDG('Transaction ' +
     A                                      'Reference')
     A                                      DFT('Y')
      *
     A            OKSWFRF   R               REFFLD(OKFLAG)
     A                                      TEXT('Swift Reference')
     A                                      COLHDG('Swift Reference')
     A                                      DFT('Y')
      *
