      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FT RFT detail screen 2')
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTE101S2PD RFT Detail screen 2                            *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.03 -----------------------------------------------*
      *  Last Amend No. CFT006  *CREATE    Date 06Sep99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CFT006 - Funds Transfer/Swift Messages MT101                 *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R FTE101S2D0                TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            OKFXDF    R               REFFLD(OKFLAG)
     A                                      TEXT('FX Deal Ref')
     A                                      COLHDG('FX Deal Ref')
     A            OKTRAM    R               REFFLD(OKFLAG)
     A                                      TEXT('Transfert Amount')
     A                                      COLHDG('Transfert Amount')
     A            OKTRCY    R               REFFLD(OKFLAG)
     A                                      TEXT('Transfert CCY')
     A                                      COLHDG('Transfert CCY')
     A            OKXRTE    R               REFFLD(OKFLAG)
     A                                      TEXT('Rate')
     A                                      COLHDG('Rate')
     A            OKXRTO    R               REFFLD(OKFLAG)
     A                                      TEXT('Rate Override')
     A                                      COLHDG('Rate Override')
     A            OKPYAM    R               REFFLD(OKFLAG)
     A                                      TEXT('Payment Amount')
     A                                      COLHDG('Payment Amount')
     A            OKPYCY    R               REFFLD(OKFLAG)
     A                                      TEXT('Payment CCY')
     A                                      COLHDG('Payment CCY')
     A            OKCDDT    R               REFFLD(OKFLAG)
     A                                      TEXT('Credit Date')
     A                                      COLHDG('Credit Date')
     A            OKORAM    R               REFFLD(OKFLAG)
     A                                      TEXT('Original Amount')
     A                                      COLHDG('Original Amount')
     A            OKORCY    R               REFFLD(OKFLAG)
     A                                      TEXT('Original CCY')
     A                                      COLHDG('Original CCY')
     A            OKCGAC    R               REFFLD(OKFLAG)
     A                                      TEXT('Charges A/C')
     A                                      COLHDG('Charges A/C')
     A            OKDTCH    R               REFFLD(OKFLAG)
     A                                      TEXT('Detail of Charges')
     A                                      COLHDG('Detail of Charges')
     A            OKRVCH    R               REFFLD(OKFLAG)
     A                                      TEXT('Receiver Chg Amnt')
     A                                      COLHDG('Receiver chg Amnt')
     A            OKRVCY    R               REFFLD(OKFLAG)
     A                                      TEXT('Receiver Chg CCY')
     A                                      COLHDG('Receiver Chg CCY')
     A            OKRTCH    R               REFFLD(OKFLAG)
     A                                      TEXT('Transf Chg Amnt')
     A                                      COLHDG('Transf Chg Amnt')
     A            OKRTCY    R               REFFLD(OKFLAG)
     A                                      TEXT('Transf Chg CCY')
     A                                      COLHDG('Transf Chg CCY')
     A            OKRPCH    R               REFFLD(OKFLAG)
     A                                      TEXT('Paymnt Chg Amnt')
     A                                      COLHDG('Paymnt Chg Amnt')
     A            OKRPCY    R               REFFLD(OKFLAG)
     A                                      TEXT('Paymnt Chg CCY')
     A                                      COLHDG('Paymnt Chg CCY')
      *
