      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FT CCT trailer')
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTE102TPD- CCT Trailer                                    *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.03 -----------------------------------------------*
      *  Last Amend No. CFT008  *CREATE    Date 06Sep99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CFT008 - Funds Transfer/Swift Messages MT102                 *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R FTE102TD0                 TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            OKCCTD    R               REFFLD(OKFLAG)
     A                                      TEXT('CCT Id')
     A                                      COLHDG('CCT Id')
     A                                      DFT('Y')
     A            OKSDTE    R               REFFLD(OKFLAG)
     A                                      TEXT('Settlement Value +
     A                                      Date')
     A                                      COLHDG('Settlement ' +
     A                                      'Value Date')
     A                                      DFT('Y')
     A            OKSCCY    R               REFFLD(OKFLAG)
     A                                      TEXT('Settlement Currency +
     A                                      Code')
     A                                      COLHDG('Settlement ' +
     A                                      'Cuurency Code')
     A                                      DFT('Y')
     A            OKSAMT    R               REFFLD(OKFLAG)
     A                                      TEXT('Settlement Amount')
     A                                      COLHDG('Settlement Amount')
     A                                      DFT('Y')
     A            OKSSAM    R               REFFLD(OKFLAG)
     A                                      TEXT('Settlement Sum +
     A                                      of Amounts')
     A                                      COLHDG('Settlement Sum ' +
     A                                      'of Amounts')
     A                                      DFT('Y')
     A            OKSSCG    R               REFFLD(OKFLAG)
     A                                      TEXT('Settlement Sum +
     A                                      of Senders Charges')
     A                                      COLHDG('Settlement Sum ' +
     A                                      'of Senders Chargers')
     A                                      DFT('Y')
     A            OKSSSA    R               REFFLD(OKFLAG)
     A                                      TEXT('Settlement Sum +
     A                                      of Senders Amount')
     A                                      COLHDG('Settlement Sum ' +
     A                                      'of Senders Amount')
     A                                      DFT('Y')
     A            OKSRCG    R               REFFLD(OKFLAG)
     A                                      TEXT('Settlement Sum +
     A                                      of Receivers Charges')
     A                                      COLHDG('Settlement Sum ' +
     A                                      'of Receivers ' +
     A                                      'Chargers')
     A                                      DFT('Y')
     A            OKRAMT    R               REFFLD(OKFLAG)
     A                                      TEXT('Settlement Sum +
     A                                      of Receivers Amount')
     A                                      COLHDG('Settlement Sum ' +
     A                                      'of Receivers Amount')
     A                                      DFT('Y')
     A            OKSCRR    R               REFFLD(OKFLAG)
     A                                      TEXT('Settlement Senders +
     A                                      Correspondent')
     A                                      COLHDG('Settlement ' +
     A                                      'Senders ' +
     A                                      'Correspondent')
     A                                      DFT('Y')
     A            OKRCRR    R               REFFLD(OKFLAG)
     A                                      TEXT('Settlement +
     A                                      Receivers Correspondent')
     A                                      COLHDG('Settlement ' +
     A                                      'Receivers ' +
     A                                      'Correspondent')
     A                                      DFT('Y')
     A            OKSRI1    R               REFFLD(OKFLAG)
     A                                      TEXT('Settlement Sender +
     A                                      to Receiver Info')
     A                                      COLHDG('Settlement ' +
     A                                      'Sender to Receiver ' +
     A                                      'Info')
     A                                      DFT('Y')
     A            OKSRI2    R               REFFLD(OKFLAG)
     A                                      TEXT('Settlement Sender +
     A                                      to Receiver Info')
     A                                      COLHDG('Settlement ' +
     A                                      'Sender to Receiver ' +
     A                                      'Info')
     A                                      DFT('Y')
     A            OKSRI3    R               REFFLD(OKFLAG)
     A                                      TEXT('Settlement Sender +
     A                                      to Receiver Info')
     A                                      COLHDG('Settlement ' +
     A                                      'Sender to Receiver ' +
     A                                      'Info')
     A                                      DFT('Y')
     A            OKSRI4    R               REFFLD(OKFLAG)
     A                                      TEXT('Settlement Sender +
     A                                      to Receiver Info')
     A                                      COLHDG('Settlement ' +
     A                                      'Sender to Receiver ' +
     A                                      'Info')
     A                                      DFT('Y')
     A            OKSRI5    R               REFFLD(OKFLAG)
     A                                      TEXT('Settlement Sender +
     A                                      to Receiver Info')
     A                                      COLHDG('Settlement ' +
     A                                      'Sender to Receiver ' +
     A                                      'Info')
     A                                      DFT('Y')
     A            OKSRI6    R               REFFLD(OKFLAG)
     A                                      TEXT('Settlement Sender +
     A                                      to Receiver Info')
     A                                      COLHDG('Settlement ' +
     A                                      'Sender to Receiver ' +
     A                                      'Info')
     A                                      DFT('Y')
      *
