      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FT OPAY - Error Inds File - LU Window')
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTEOPLX1PD - API Error Definition File for                *
      *                  Outgoing Payments Extra Data - LU Extension  *
      *                                                               *
      *  (c) Finastra International Limited 2005                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CER001  *CREATE    Date 25Apr05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CER001 - LUX Upgrade to MidasPlus                            *
      *                                                               *
      *****************************************************************
      *
     A          R FTEOPLXDL                 TEXT('(c) Finastra International +
     A                                      Limited 2005')
      *
     A            OK#LLXORTY     1A         TEXT('Ordering Type')
      *
     A            OK#LLXBETY     1A         TEXT('Beneficiary Type')
      *
     A            OK#LLXOPCO     1A         TEXT('IBLC Operation Code')
      *
     A            OK#LLXCOCO     1A         TEXT('Country Code')
      *
     A            OK#LLXIDCO     1A         TEXT('Identification Code')
      *
     A            OK#LLXIDEN     1A         TEXT('Identification')
      *
