      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FT API Outgoing Pmts error inds screen 3')
      *****************************************************************
      *                                                               *
      *  Midas - Application Program Interface Module                 *
      *                                                               *
      *  PF/FTOPY3PD - API Field error indicators layout file for     *
      *             Funds Transfer Outgoing Payments screen 3         *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      *  Prev Amend No. CFT014             Date 25May00               *
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CAP031  *CREATE    Date 08Apr99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CFT014 - Straight-through Processing Phase 2 MT103           *
      *           Messages Generation for FT.                         *
      *  CAP031 - Conversion of transaction inputs into modular       *
      *           structure to use as APIs.                           *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R FTEOPY3D0                 TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
      *
     A            OKACTION3 R               TEXT('Action code')
     A                                      REFFLD(OKFLAG)
      *
     A            OKPREF3   R               TEXT('Payment Reference')
     A                                      REFFLD(OKFLAG)
      *
      *                                              Begin /CFT014/
     A            OKDTP1    R               REFFLD(OKFLAG)
     A                                      TEXT('Details of payment 1')
      *
     A            OKDTP2    R               REFFLD(OKFLAG)
     A                                      TEXT('Details of payment 2')
      *
     A            OKDTP3    R               REFFLD(OKFLAG)
     A                                      TEXT('Details of payment 3')
      *
     A            OKDTP4    R               REFFLD(OKFLAG)
     A                                      TEXT('Details of payment 4')
      *
     A            OKBBI1    R               REFFLD(OKFLAG)
     A                                      TEXT('Bank to bank information 1')
      *
     A            OKBBI2    R               REFFLD(OKFLAG)
     A                                      TEXT('Bank to bank information 2')
      *
     A            OKBBI3    R               REFFLD(OKFLAG)
     A                                      TEXT('Bank to bank information 3')
      *
     A            OKBBI4    R               REFFLD(OKFLAG)
     A                                      TEXT('Bank to bank information 4')
      *
     A            OKBBI5    R               REFFLD(OKFLAG)
     A                                      TEXT('Bank to bank information 5')
      *
     A            OKBBI6    R               REFFLD(OKFLAG)
     A                                      TEXT('Bank to bank information 6')
      *
     A*********** OKINB1    R               REFFLD(OKFLAG)
     A***********                           TEXT('Intermediary bank 1')
      ***********
     A*********** OKINB2    R               REFFLD(OKFLAG)
     A***********                           TEXT('Intermediary bank 2')
      ***********
     A*********** OKINB3    R               REFFLD(OKFLAG)
     A***********                           TEXT('Intermediary bank 3')
      ***********
     A*********** OKINB4    R               REFFLD(OKFLAG)
     A***********                           TEXT('Intermediary bank 4')
      ***********
     A*********** OKINB5    R               REFFLD(OKFLAG)
     A***********                           TEXT('Intermediary bank 5')
      *                                              End   /CFT014/
      *
     A            OKDNBC    R               REFFLD(OKFLAG)
     A                                      TEXT('Central bank reference')
      *
      *                                              Begin /CFT014/
     A            OKTRCT    R               REFFLD(OKFLAG)
     A                                      TEXT('Transfer Commission +
     A                                      Tariff')
      *
     A*********** OKDTCH    R               REFFLD(OKFLAG)
     A***********                           TEXT('Details of charges')
      ***********
     A*********** OKTRCD    R               REFFLD(OKFLAG)
     A***********                           TEXT('Transfer commission')
      ***********
     A*********** OKVAT1    R               REFFLD(OKFLAG)
     A***********                           TEXT('Transfer commission VAT ind')
      ***********
     A*********** OKCHCD    R               REFFLD(OKFLAG)
     A***********                           TEXT('FX/charge commission')
      ***********
     A*********** OKVAT7    R               REFFLD(OKFLAG)
     A***********                           TEXT('FX/charge commission VAT ind')
      ***********
     A*********** OKTXCD    R               REFFLD(OKFLAG)
     A***********                           TEXT('Telex charge')
      ***********
     A*********** OKVAT2    R               REFFLD(OKFLAG)
     A***********                           TEXT('Telex charge VAT indicator')
      ***********
     A*********** OKCQCD    R               REFFLD(OKFLAG)
     A***********                           TEXT('Cheque charge')
      ***********
     A*********** OKVAT3    R               REFFLD(OKFLAG)
     A***********                           TEXT('Cheque charge VAT ind')
      ***********
     A*********** OKCSTD    R               REFFLD(OKFLAG)
     A***********                           TEXT('Costs abroad')
      ***********
     A*********** OKVAT4    R               REFFLD(OKFLAG)
     A***********                           TEXT('Costs abroad VAT ind')
      ***********
     A*********** OKSPCD    R               REFFLD(OKFLAG)
     A***********                           TEXT('Swift priority charge')
      ***********
     A*********** OKVAT5    R               REFFLD(OKFLAG)
     A***********                           TEXT('Swift priority chge VAT ind')
      ***********
     A*********** OKMSCD    R               REFFLD(OKFLAG)
     A***********                           TEXT('Miscellaneous charge')
      ***********
     A*********** OKVAT6    R               REFFLD(OKFLAG)
     A***********                           TEXT('Miscellaneous charge VAT ind')
      *                                              End   /CFT014/
      *
     A            OKRLPR    R               REFFLD(OKFLAG)
     A                                      TEXT('Related Payment reference')
      *
     A            OKCHAP    R               REFFLD(OKFLAG)
     A                                      TEXT('CHAPS code')
      *
      *                                              Begin /CFT014/
     A            OKICD1    R               REFFLD(OKFLAG)
     A                                      TEXT('Instruction Code 1')
      *
     A            OKICD2    R               REFFLD(OKFLAG)
     A                                      TEXT('Instruction Code 2')
      *
     A            OKICD3    R               REFFLD(OKFLAG)
     A                                      TEXT('Instruction Code 3')
      *
     A            OKICD4    R               REFFLD(OKFLAG)
     A                                      TEXT('Instruction Code 4')
      *
     A            OKICD5    R               REFFLD(OKFLAG)
     A                                      TEXT('Instruction Code 5')
      *
     A            OKRRP1    R               REFFLD(OKFLAG)
     A                                      TEXT('Regulatory Reporting 1')
      *
     A            OKRRP2    R               REFFLD(OKFLAG)
     A                                      TEXT('Regulatory Reporting 2')
      *
     A            OKRRP3    R               REFFLD(OKFLAG)
     A                                      TEXT('Regulatory Reporting 3')
      *
     A*********** OKFXMP    R               REFFLD(OKFLAG)
     A***********                           TEXT('FX Margin Points')
      ***********
     A*********** OKMBSI    R               REFFLD(OKFLAG)
     A***********                           TEXT('Margin Buy/Sell Indicator')
      ***********
     A*********** OKMSIG    R               REFFLD(OKFLAG)
     A***********                           TEXT('Margin Sign')
      *                                              End   /CFT014/
      *
