      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FT API Outgoing Pmts error inds screen 2')
      *****************************************************************
      *                                                               *
      *  Midas - Application Program Interface Module                 *
      *                                                               *
      *  PF/FTOPY2PD - API Field error indicators layout file for     *
      *             Funds Transfer Outgoing Payments secondary screen *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      *  Prev Amend No. CFT014             Date 25May00               *
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CAP031  *CREATE    Date 08Apr99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CFT014 - Straight-through Processing Phase 2 MT103           *
      *           Messages Generation for FT.                         *
      *  CAP031 - Conversion of transaction inputs into modular       *
      *           structure to use as APIs.                           *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R FTEOPY2D0                 TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
      *
     A            OKACTION2 R               TEXT('Action code')
     A                                      REFFLD(OKFLAG)
      *
     A            OKPREF2   R               TEXT('Payment Reference')
     A                                      REFFLD(OKFLAG)
      *
      *                                              Begin /CFT014/
     A            OKBOCD    R               REFFLD(OKFLAG)
     A                                      TEXT('Bank Operation Code')
      *
     A            OKTRTC    R               REFFLD(OKFLAG)
     A                                      TEXT('Transaction Type Code')
      *
     A*********** OKTRCT    R               REFFLD(OKFLAG)
     A***********                           TEXT('Transfer commission tarif')
      ***********
     A*********** OKCDRO    R               REFFLD(OKFLAG)
     A***********                           TEXT('Charges to debit of account')
      ***********
     A*********** OKCDBR    R               REFFLD(OKFLAG)
     A***********                           TEXT('Charges to debit of branch')
      *                                              End   /CFT014/
      *
     A            OKRCO1    R               REFFLD(OKFLAG)
     A                                      TEXT('Receivers correspondent 1')
      *
     A            OKRCO2    R               REFFLD(OKFLAG)
     A                                      TEXT('Receivers correspondent 2')
      *
     A            OKRCO3    R               REFFLD(OKFLAG)
     A                                      TEXT('Receivers correspondent 3')
      *
     A            OKRCO4    R               REFFLD(OKFLAG)
     A                                      TEXT('Receivers correspondent 4')
      *
     A            OKRCO5    R               REFFLD(OKFLAG)
     A                                      TEXT('Receivers correspondent 5')
      *
      *                                              Begin /CFT014/
     A            OKTRI1    R               REFFLD(OKFLAG)
     A                                      TEXT('Third Reimbursement +
     A                                      Institution 1')
      *
     A            OKTRI2    R               REFFLD(OKFLAG)
     A                                      TEXT('Third Reimbursement +
     A                                      Institution 2')
      *
     A            OKTRI3    R               REFFLD(OKFLAG)
     A                                      TEXT('Third Reimbursement +
     A                                      Institution 3')
      *
     A            OKTRI4    R               REFFLD(OKFLAG)
     A                                      TEXT('Third Reimbursement +
     A                                      Institution 4')
      *
     A            OKTRI5    R               REFFLD(OKFLAG)
     A                                      TEXT('Third Reimbursement +
     A                                      Institution 5')
      *
     A            OKINB1    R               REFFLD(OKFLAG)
     A                                      TEXT('Intermediary bank 1')
      *
     A            OKINB2    R               REFFLD(OKFLAG)
     A                                      TEXT('Intermediary bank 2')
      *
     A            OKINB3    R               REFFLD(OKFLAG)
     A                                      TEXT('Intermediary bank 3')
      *
     A            OKINB4    R               REFFLD(OKFLAG)
     A                                      TEXT('Intermediary bank 4')
      *
     A            OKINB5    R               REFFLD(OKFLAG)
     A                                      TEXT('Intermediary bank 5')
      *                                              End   /CFT014/
      *
     A            OKACB1    R               REFFLD(OKFLAG)
     A                                      TEXT('Account with bank 1')
      *
     A            OKACB2    R               REFFLD(OKFLAG)
     A                                      TEXT('Account with bank 2')
      *
     A            OKACB3    R               REFFLD(OKFLAG)
     A                                      TEXT('Account with bank 3')
      *
     A            OKACB4    R               REFFLD(OKFLAG)
     A                                      TEXT('Account with bank 4')
      *
     A            OKACB5    R               REFFLD(OKFLAG)
     A                                      TEXT('Account with bank 5')
      *
     A            OKBNC1    R               REFFLD(OKFLAG)
     A                                      TEXT('Beneficiary 1')
      *
     A            OKBNC2    R               REFFLD(OKFLAG)
     A                                      TEXT('Beneficiary 2')
      *
     A            OKBNC3    R               REFFLD(OKFLAG)
     A                                      TEXT('Beneficiary 3')
      *
     A            OKBNC4    R               REFFLD(OKFLAG)
     A                                      TEXT('Beneficiary 4')
      *
     A            OKBNC5    R               REFFLD(OKFLAG)
     A                                      TEXT('Beneficiary 5')
      *
      *                                              Begin /CFT014/
     A*********** OKDTP1    R               REFFLD(OKFLAG)
     A***********                           TEXT('Details of payment 1')
      ***********
     A*********** OKDTP2    R               REFFLD(OKFLAG)
     A***********                           TEXT('Details of payment 2')
      ***********
     A*********** OKDTP3    R               REFFLD(OKFLAG)
     A***********                           TEXT('Details of payment 3')
      ***********
     A*********** OKDTP4    R               REFFLD(OKFLAG)
     A***********                           TEXT('Details of payment 4')
      ***********
     A*********** OKBBI1    R               REFFLD(OKFLAG)
     A***********                           TEXT('Bank to bank information 1')
      ***********
     A*********** OKBBI2    R               REFFLD(OKFLAG)
     A***********                           TEXT('Bank to bank information 2')
      ***********
     A*********** OKBBI3    R               REFFLD(OKFLAG)
     A***********                           TEXT('Bank to bank information 3')
      ***********
     A*********** OKBBI4    R               REFFLD(OKFLAG)
     A***********                           TEXT('Bank to bank information 4')
      ***********
     A*********** OKBBI5    R               REFFLD(OKFLAG)
     A***********                           TEXT('Bank to bank information 5')
      ***********
     A*********** OKBBI6    R               REFFLD(OKFLAG)
     A***********                           TEXT('Bank to bank information 6')
      *                                              End   /CFT014/
      *
