      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FT IPAY API Level 2 Scrn 1 Format Defn File2')
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTIPY3PD - IPAY API Level 2 Screen 1 Format Definition    *
      *                File 2                                         *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CFT032             Date 11Sep06               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      *  Prev Amend No. CFT014             Date 25May00               *
      * Midas DBA 3.03 -----------------------------------------------*
      *                 CAP136  *CREATE    Date 15Nov99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CFT032 - Account line in field 50X in MT103                  *
      *  CFT014 - Straight-through Processing Phase 2 MT103           *
      *           Messages Generation for FT.                         *
      *  CAP136 - Conversion of FT Incoming Payment inputs into       *
      *           modular structure to use as APIs.                   *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R FTIPY3D0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
      *                                              Begin /CFT014/
     A*********** DDORC5        35A         TEXT('Ordering Customer 5')
     A***********                           COLHDG('Ordering Customer 5')
      *                                              End   /CFT014/
      ** Start of change CFT032
     A            DDORC5        35A         TEXT('Ordering Customer 5')
     A                                      COLHDG('Ordering Customer 5')
      ** End of change CFT032
      *
     A            DDBBI1        35A         TEXT('Bank to Bank Information 1')
     A                                      COLHDG('Bank to Bank Info 1')
      *
     A            DDBBI2        35A         TEXT('Bank to Bank Information 2')
     A                                      COLHDG('Bank to Bank Info 2')
      *
     A            DDBBI3        35A         TEXT('Bank to Bank Information 3')
     A                                      COLHDG('Bank to Bank Info 3')
      *
     A            DDBBI4        35A         TEXT('Bank to Bank Information 4')
     A                                      COLHDG('Bank to Bank Info 4')
      *
     A            DDBBI5        35A         TEXT('Bank to Bank Information 5')
     A                                      COLHDG('Bank to Bank Info 5')
      *
     A            DDBBI6        35A         TEXT('Bank to Bank Information 6')
     A                                      COLHDG('Bank to Bank Info 6')
      *
      *                                              Begin /CFT014/
     A*********** DDTRCT         1A         TEXT('Transfer Commission Tariff')
     A***********                           COLHDG('Tfr' 'Com' +
     A***********                                  'Trf')
      ***********
     A*********** DDCDRO        12A         TEXT('Charges to the Debit of A/c')
     A***********                           COLHDG('Chrgs to the' +
     A***********                                  'Debit of A/c')
      ***********
     A*********** DDCDBR         3A         TEXT('Debit A/c Branch')
     A***********                           COLHDG('Debt' 'A/c' 'Brch')
      *                                              End   /CFT014/
