      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FT IPAY API level 2 scrn 1 format defn file1')   *
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTIPY2PD - IPAY API Level 2 Screen 1 Format Definition    *
      *                File 1                                         *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *  Last Amend No. CSF011A            Date 28Nov11               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.03 -----------------------------------------------*
      *  Prev Amend No. CAP136  *CREATE    Date 15Nov99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSF011A - CCR015: Display Order in Confirmation Pages        *
      *  CAP136 - Conversion of FT Incoming Payment inputs into       *
      *           modular structure to use as APIs.                   *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R FTIPY2D0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            DDOBK1        35A         TEXT('Ordering Bank 1')
     A                                      COLHDG('Ordering Bank 1')
      **Start of change CSF011A
     A            DDOBSN        10A         TEXT('Ordering Bank 1 +
     A                                           Shortname')
     A                                      COLHDG('Ordering Bank 1' +
     A                                           'Shortname')
     A            DDOBNM        20A         TEXT('Ordering Bank 1 +
     A                                           Report Name')
     A                                      COLHDG('Ordering Bank 1' +
     A                                           'Report Name')
     A            DDOBTN        10A         TEXT('Ordering Bank 1 +
     A                                           Report Town')
     A                                      COLHDG('Ordering Bank 1' +
     A                                           'Report Town')
     A            DDOBSW        12A         TEXT('Ordering Bank 1 +
     A                                           SWIFT Id')
     A                                      COLHDG('Ordering Bank 1' +
     A                                           'SWIFT Id')
      **End of change CSF011A
      *
     A            DDOBK2        35A         TEXT('Ordering Bank 2')
     A                                      COLHDG('Ordering Bank 2')
      *
     A            DDOBK3        35A         TEXT('Ordering Bank 3')
     A                                      COLHDG('Ordering Bank 3')
      *
     A            DDOBK4        35A         TEXT('Ordering Bank 4')
     A                                      COLHDG('Ordering Bank 4')
      *
     A            DDOBK5        35A         TEXT('Ordering Bank 5')
     A                                      COLHDG('Ordering Bank 5')
      *
     A            DDSNC1        35A         TEXT('Sender''s Correspondent 1')
     A                                      COLHDG('Sender''s Corresp. 1')
      **Start of change CSF011A
     A            DDSCSN        10A         TEXT('Sender''s Correspon+
     A                                      dent 1 Shortname')
     A                                      COLHDG('Sender''s Correspon' +
     A                                      'dent 1 Shortname')
     A            DDSCNM        20A         TEXT('Sender''s Correspon+
     A                                      dent 1 Report Name')
     A                                      COLHDG('Sender''s Correspon' +
     A                                      'dent 1 Report Name')
     A            DDSCTN        10A         TEXT('Sender''s Correspon+
     A                                      dent 1 Report Town')
     A                                      COLHDG('Sender''s Correspon' +
     A                                      'dent 1 Report Town')
     A            DDSCSW        12A         TEXT('Sender''s Correspon+
     A                                      dent 1 SWIFT Id')
     A                                      COLHDG('Sender''s Correspon' +
     A                                      'dent 1 SWIFT Id')
      **End of change CSF011A
      *
     A            DDSNC2        35A         TEXT('Sender''s Correspondent 2')
     A                                      COLHDG('Sender''s Corresp. 2')
      *
     A            DDSNC3        35A         TEXT('Sender''s Correspondent 3')
     A                                      COLHDG('Sender''s Corresp. 3')
      *
     A            DDSNC4        35A         TEXT('Sender''s Correspondent 4')
     A                                      COLHDG('Sender''s Corresp. 4')
      *
     A            DDSNC5        35A         TEXT('Sender''s Correspondent 5')
     A                                      COLHDG('Sender''s Corresp. 5')
      *
     A            DDORC1        35A         TEXT('Ordering Customer 1')
     A                                      COLHDG('Ordering Customer 1')
      **Start of change CSF011A
     A            DDOCSN        10A         TEXT('Ordering Customer 1 +
     A                                           Shortname')
     A                                      COLHDG('Ordering Customer 1' +
     A                                           'Shortname')
     A            DDOCNM        20A         TEXT('Ordering Customer 1 +
     A                                           Report Name')
     A                                      COLHDG('Ordering Customer 1' +
     A                                           'Report Name')
     A            DDOCTN        10A         TEXT('Ordering Customer 1 +
     A                                           Report Town')
     A                                      COLHDG('Ordering Customer 1' +
     A                                           'Report Town')
     A            DDOCAN        20A         TEXT('Ordering Customer 1 +
     A                                           Account Name')
     A                                      COLHDG('Ordering Customer 1' +
     A                                           'Account Name')
     A            DDOCSW        12A         TEXT('Ordering Customer 1 +
     A                                           SWIFT Id')
     A                                      COLHDG('Ordering Customer 1' +
     A                                           'SWIFT Id')
      **End of change CSF011A
      *
     A            DDORC2        35A         TEXT('Ordering Customer 2')
     A                                      COLHDG('Ordering Customer 2')
      *
     A            DDORC3        35A         TEXT('Ordering Customer 3')
     A                                      COLHDG('Ordering Customer 3')
      *
     A            DDORC4        35A         TEXT('Ordering Customer 4')
     A                                      COLHDG('Ordering Customer 4')
