      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FT API Nostro Transfer Authorisation Prof')      *
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTNAUTPD - Midas FT API FTNT Authorisation profiles       *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2015            *
      *                                                               *
      *  Last Amend No. CFT163 *CREATE     Date 04May18               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CFT163 - FT Nostro Transfer Authorisation (RPG)              *
      *                                                               *
      *****************************************************************
      *
     A          R FTNAUTD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2018')
     A            NAUP1         10A         COLHDG('Approving Prof')
     A            NAUP2         10A         COLHDG('Authorising Prof')
      *
      *****************************************************************

