      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FT OPAY API Cover Message Format Defn File')
      *****************************************************************
      *                                                               *
      *  Midas - Funds Transfer Module                                *
      *                                                               *
      *  PF/FTOPYCPD - OPAY API Cover Messages Format Definition File *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2009            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      *  Last Amend No. CSW209  *CREATE    Date 01Apr09               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSW209 - SWIFT 2009 Changes                                  *
      *                                                               *
      *****************************************************************
      *
     A          R FTOPYCD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2009')
      *
     A            SCDP1         35A         TEXT('Remittance Information (Cover-
     A                                       1')
     A                                      COLHDG('Remittance' 'Info (Cover) 1-
     A                                      )')
      *
     A            SCDP2         35A         TEXT('Remittance Information (Cover-
     A                                       2')
     A                                      COLHDG('Remittance' 'Info (Cover) 2-
     A                                      )')
      *
     A            SCDP3         35A         TEXT('Remittance Information (Cover-
     A                                       3')
     A                                      COLHDG('Remittance' 'Info (Cover) 3-
     A                                      )')
      *
     A            SCDP4         35A         TEXT('Remittance Information (Cover-
     A                                       4')
     A                                      COLHDG('Remittance' 'Info (Cover) 4-
     A                                      )')
      *
     A            SCBB1         35A         TEXT('Sender to Receiver Informatio-
     A                                      n (Cover B) 1')
     A                                      COLHDG('Sender to' 'Receiver Info' -
     A                                      '(Cover B) 1')
      *
     A            SCBB2         35A         TEXT('Sender to Receiver Informatio-
     A                                      n (Cover B) 2')
     A                                      COLHDG('Sender to' 'Receiver Info' -
     A                                      '(Cover B) 2')
      *
     A            SCBB3         35A         TEXT('Sender to Receiver Informatio-
     A                                      n (Cover B) 3')
     A                                      COLHDG('Sender to' 'Receiver Info' -
     A                                      '(Cover B) 3')
      *
     A            SCBB4         35A         TEXT('Sender to Receiver Informatio-
     A                                      n (Cover B) 4')
     A                                      COLHDG('Sender to' 'Receiver Info' -
     A                                      '(Cover B) 4')
      *
     A            SCBB5         35A         TEXT('Sender to Receiver Informatio-
     A                                      n (Cover B) 5')
     A                                      COLHDG('Sender to' 'Receiver Info' -
     A                                      '(Cover B) 5')
      *
     A            SCBB6         35A         TEXT('Sender to Receiver Informatio-
     A                                      n (Cover B) 6')
     A                                      COLHDG('Sender to' 'Receiver Info' -
     A                                      '(Cover B) 6')
      *
     A            SCICY          3A         TEXT('Instructed Currency (Cover)')
     A                                      COLHDG('Instructed' 'Currency' '(Co-
     A                                      ver)')
      *
     A            SCIAM         15A         TEXT('Instructed Amount (Cover)')
     A                                      COLHDG('Instructed' 'Amount' '(Cove-
     A                                      r)')
      *
     A            SOCBB1        35A         TEXT('Sender to Receiver Informatio-
     A                                      n (Cover A) 1')
     A                                      COLHDG('Sender to' 'Receiver Info' -
     A                                      '(Cover A) 1')
      *
     A            SOCBB2        35A         TEXT('Sender to Receiver Informatio-
     A                                      n (Cover A) 2')
     A                                      COLHDG('Sender to' 'Receiver Info' -
     A                                      '(Cover A) 2')
      *
     A            SOCBB3        35A         TEXT('Sender to Receiver Informatio-
     A                                      n (Cover A) 3')
     A                                      COLHDG('Sender to' 'Receiver Info' -
     A                                      '(Cover A) 3')
      *
     A            SOCBB4        35A         TEXT('Sender to Receiver Informatio-
     A                                      n (Cover A) 4')
     A                                      COLHDG('Sender to' 'Receiver Info' -
     A                                      '(Cover A) 4')
      *
     A            SOCBB5        35A         TEXT('Sender to Receiver Informatio-
     A                                      n (Cover A) 5')
     A                                      COLHDG('Sender to' 'Receiver Info' -
     A                                      '(Cover A) 5')
      *
     A            SOCBB6        35A         TEXT('Sender to Receiver Informatio-
     A                                      n (Cover A) 6')
     A                                      COLHDG('Sender to' 'Receiver Info' -
     A                                      '(Cover A) 6')
