      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FT Outgoing Payments extra data layout file')
      *****************************************************************
      *                                                               *
      *  Midas - API Funds Transfer Module                            *
      *                                                               *
      *  PF/FTOPEXPD - API FT Outgoing Payments Extra Data Layout File*
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. ERZ248             Date 18Nov19               *
      *  Prev Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CAP031  *CREATE    Date 14Apr99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  ERZ248 - SWIFT UETR via OPAY API                             *
      *  MD046248 - Finastra Rebranding                               *
      *  CAP031 - APIs FT module                                      *
      *           Addition of file to pass supplemental information   *
      *           from front to back office                           *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)

     A          R FTOPEXD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')

     A            SUETR         36          TEXT('Unique End-to-End Tran Ref')                ERZ248
                                                                                              ERZ248
     A            APNARV    R               TEXT('Narrative Text')
                                            REFFLD(NARV)