      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SC Midas help references')
      *****************************************************************
      *                                                               *
      *  Midas - System Control Module                                *
      *                                                               *
      *  PF/SCHELPPD - Midas Help References                          *
      *                                                               *
      *  (c) Finastra International Limited 2003                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSC021             Date 15Dec03               *
      *                 CPK016  *CREATE    Date 22Jul03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSC021 - Change the size of the file fields so more          *
      *           information can be held                             *
      *  CPK016 - Help processing infrastructure for Midas Webfacing. *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R SCHELPD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2003')
      *
      * Start of CSC021
     A**********  HPJSP        100          TEXT('Help Reference')
     A**********                            COLHDG('Help' 'Reference')
      *
     A**********  HPHTAG        20          TEXT('Help Tag')
     A**********                            COLHDG('Help Tag')
      *
     A            HPJSP        200          TEXT('Help Reference')
     A                                      COLHDG('Help' 'Reference')
      *
     A            HPHTAG       600          TEXT('Help Tag')
     A                                      COLHDG('Help Tag')
      * End of CSC021
