      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SC IP Address for URL Caching')                  *
      *****************************************************************
      *                                                               *
      *  Midas - System Contol Module                                 *
      *                                                               *
      *  PF/SCIPADPD - Midas SC IP Address for URL Caching            *
      *                                                               *
      *  (c) Finastra International Limited 2019                      *
      *                                                               *
      *  Last Amend No. CSW219  *CREATE    Date 04Mar19               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSW219 - SWIFT Changes 2019                                  *
      *                                                               *
      *****************************************************************
      *
     A          R SCIPADD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2019')
      *
     A            SIPADD       100A         TEXT('IP Address')
     A                                      COLHDG('IP Address')
      *
