      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SC Mutually Exclusive objects in PEA restore')   *
      *****************************************************************
      *                                                               *
      *  Midas - System Control Module                                *
      *                                                               *
      *  PF/SCMEXCPD - Mutually Exclusive objects in PEA restore      *
      *                                                               *
      *  (c) Finastra International Limited 2012                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CSC054  *CREATE    Date 23Feb12               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSC054 - Period End Adjustments                              *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A          R SCMEXCD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2012')
      *
     A            MEFILE        10          TEXT('File')
     A                                      COLHDG('File')
     A            MEMEXC        10          TEXT('Mut. Exl. File')
     A                                      COLHDG('Mut. Exl. File')
      *
     A          K MEFILE
      *
