      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SC Switchable features dependencies file')
      *****************************************************************
      *                                                               *
      *  Midas - System Control Module                                *
      *                                                               *
      *  PF/SCSARXPD - Dependencies between switchable features, and  *
      *                between features and modules.                  *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CSC007             Date 08Nov98               *
      *                 CSC005  *CREATE    Date 08May98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSC007 - Addition of new field SEQ                           *
      *  CSC005 - New suite of programs and files to permit           *
      *           insertion of switchable features via passwords.     *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R SCCSECD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            RECI           1A         COLHDG('Core')
     A            DSON           6A         COLHDG('Depends on - SF')
     A            DDON           6A         COLHDG('Depended on - SF')
     A            DTYPE          1A         COLHDG('Dependency Type')
     A            LCD            5P 0       COLHDG('Last Change Date')
     A            CHTP           1A         COLHDG('Change Type')
     A            LOGT           1A         COLHDG('Logical Type')
     A            MDSN          10A         COLHDG('Depended on - Mod')
      *                                                /*Start CSC007*/
     A            SEQ            2A         COLHDG('Sequence')
     A            DOFF           3A         COLHDG('SAR must be off')
      *                                                /* End  CSC007*/
