      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SC All core switchable feature details')
      *****************************************************************
      *                                                               *
      *  Midas - System Control Module                                *
      *                                                               *
      *  PF/SCSARSPD - Switchable Features Status                     *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *   If the attributes of this file are changed then the         *
      *   associated BRIDGE upgrade utilities must also be amended.   *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGP002             Date 11Aug03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CCB008             Date 12Oct98               *
      *                 CSC005             Date 12Oct98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGP002 - Global Processing.                                  *
      *           - Change to share format with the new global        *
      *             version of this file.                             *
      *  CCB008 - Synon Closedown Project (CB):                       *
      *           - File removed from CB model.                       *
      *  CSC005 - New suite of programs and files to permit           *
      *           insertion of switchable features via passwords.     *
      *                                                               *
      *****************************************************************
      * Start of change CGP002
     A          R SCSARSD0                  FORMAT(GPSARSPD)
      *
      *
      *
     A**********R SCSARSD0                  TEXT('(c) Misys International +                   CGP002
     A**********                            Banking Systems Ltd. +                            CGP002
     A**********                            2001')                                            CGP002
     A*---------------------------------------------------------------------                  CGP002
     A**********  AXSARN         6          TEXT('Switchable Feature Number')                 CGP002
     A**********                            COLHDG('Switchable' +                             CGP002
     A**********                                   'Feature Number' )                         CGP002
     A**********  AXSARD        50          TEXT('Description')                               CGP002
     A**********                            COLHDG('Description' )                            CGP002
     A**********  AXPRIM         2          TEXT('Primary Module')                            CGP002
     A**********                            COLHDG('Primary' +                                CGP002
     A**********                                   'Module' )                                 CGP002
     A**********  AXCEMI         1          TEXT('Complex Module Conds Flag')                 CGP002
     A**********                            COLHDG('Complex Module' +                         CGP002
     A**********                                   'Conds Flag' )                             CGP002
     A**********  AXRELL        10          TEXT('Release Level')                             CGP002
     A**********                            COLHDG('Release' +                                CGP002
     A**********                                   'Level' )                                  CGP002
     A**********  AXIREL         3          TEXT('Interim Release Level')                     CGP002
     A**********                            COLHDG('Interim' +                                CGP002
     A**********                                   'Release Level' )                          CGP002
     A**********  AXCLVL         4          TEXT('Collection Level')                          CGP002
     A**********                            COLHDG('Collection' +                             CGP002
     A**********                                   'Level' )                                  CGP002
     A**********  AXRSTS         1          TEXT('Release Status')                            CGP002
     A**********                            COLHDG('Release' +                                CGP002
     A**********                                   'Status' )                                 CGP002
     A**********  AXDFLT         3          TEXT('Default')                                   CGP002
     A**********                            COLHDG('Default' )                                CGP002
     A**********  AXMNTB         1          TEXT('Maintained By')                             CGP002
     A**********                            COLHDG('Maintained' +                             CGP002
     A**********                                   'By' )                                     CGP002
     A**********  AXCHRG         1          TEXT('Chargeable?')                               CGP002
     A**********                            COLHDG('Chargeable?' )                            CGP002
     A**********  AXFLRN        35          TEXT('Folder')                                    CGP002
     A**********                            COLHDG('Folder' )                                 CGP002
     A**********  AXDOCN        11          TEXT('Document')                                  CGP002
     A**********                            COLHDG('Document' )                               CGP002
     A**********  AXHELP         8          TEXT('Help Tag')                                  CGP002
     A**********                            COLHDG('Help' +                                   CGP002
     A**********                                   'Tag' )                                    CGP002
      * End of change CGP002
     A*=====================================================================
