/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas Table 1.1 - IML codes')
     A****************************************************************
     A*                                                              *
     A*   MIDAS/ABS - EUROPEAN REPORTING                             *
     A*                                                              *
     A*   ERLU11PD  -  ER Table 1.1 - IML codes                      *
     A*                                                              *
     A* (c) Finastra International Limited 2005                      *
     A*                                                              *
     A*                                                              *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CER001             Date 25Apr05               *
      *                 ERL415 PT          Date 22Jul94               *
     A*                                                              *
     A*--------------------------------------------------------------*
     A*                                                              *
      *  MD046248 - Finastra Rebranding                               *
      *  CER001 - LUX Upgrade to MidasPlus                            *
     A*   ERL415 - IML 1.1 CODES VALIDATION                          *
     A*                                                              *
     A****************************************************************
     A          R ERLU11F0                  TEXT('ER Table 1.1 codes')
     A*
     A            IMACTI         1A         TEXT('Action Value')
     A                                      COLHDG('Action' 'Value')
     A            IMCODE         8A         TEXT('IML code')
     A                                      COLHDG('IML' 'Code')
     A            IMTYPE         1A         TEXT('Line Type')
     A                                      COLHDG('Line' 'Type')
     A*
     A          K IMCODE
     A*
