      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM15                                                      *
/*EXI *  TEXT('Midas FD MM interest rates update file')
     A****************************************************************
     A*                                                              *
     A*  Midas - Dealing Module                                      *
     A*                                                              *
     A*   FDINTULL - MM INTEREST RATES UPDATE FILE.                  *
     A*                                                              *
      *  (c) Finastra International Limited 2001                      *
     A*                                                              *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CGP001             Date 23May03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *                 CSD006             Date 13Jul00               *
      *                 CAP058             Date 13Jul00               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 S01328             Date 04Feb91               *
      *                                                               *
     A****************************************************************
     A*                                                              *
      *  MD046248 - Finastra Rebranding                               *
      *   CGP001 - Global Processing (recompile)                     *
      *   CSD006 - Market Data Feeds                                 *
      *           (Recompiled due to changes in PF/FDINTRPP)         *
      *   CAP058 - Money Market Interest Rates API                   *
      *           (Recompiled due to changes in PF/FDINTRPP)         *
     A*   S01328 - FRA/IRS REVALUATION - ADD PERIOD DATE TO FDINTRPP *
     A*            IN MIDAS DAY NO. FORMAT - RECREATE LOGICAL        *
     A*                                                              *
     A****************************************************************
     A                                      UNIQUE
     A                                      ALTSEQ(*LIBL/FDDWMYXX)
     A          R FDINTRP0                  PFILE(FDINTRPP)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*
     A          K HWCCY                     NOALTSEQ
     A          K HWTPRD
     A          K HWPRD                     NOALTSEQ
