      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_SN                                                        *
/*EXI *  TEXT('Midas A6 UDC name conversion extension')               *
      *****************************************************************
      *                                                               *
      *  Midas - User Defined Correspondence                          *
      *                                                               *
      *  PF/A6RDEXPD - UDC Name Conversion Extension                  *
      *                                                               *
      *  (c) Finastra Systems Technology, Inc 2023                    *
      *                                                               *
      *  Last Amend No. BA6020   *CREATE   Date 16Jan23               *
      *  Prev Amend No. nnnnnn             Date ddmmmyy               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  BA6020 - Add specific header field to CM XML Output          *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R CGRDEXD0                  TEXT('(c) Finastra Systems  +
     A                                      Technology, Inc. 2023')
      *
     A            CGARGT       111          TEXT('Argument')
     A                                      COLHDG('Argument')
      *
     A            CGTYPE         4          TEXT('Type')
     A                                      COLHDG('Type')
      *
     A            CGNWFD        50          TEXT('New Field')
     A                                      COLHDG('New Field')
      *
     A            CGSNWD        10          TEXT('Short New Field')
     A                                      COLHDG('Short' 'New Field')
