      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD API Base Rate Codes Screen defn file')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data ILE Module                             *
      *                                                               *
      *  PF/SDBSRSPD - API Incoming Message Definition File for       *
      *                Base Rate Codes                                *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. CSD103             Date 10Aug20               *
      *  Prev Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *                 CSD006             Date 08Jan01               *
      *                 CAP038  *CREATE    Date 24Feb00               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD103 - LIBOR Deregulation - Common Layer/Standing Data     *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD006 - Market Data Feed                                    *
      *  CAP038 - Conversion of SD inputs into modular structure      *
      *           to use as APIs.                                     *
      *****************************************************************
     A          R SDBSRSD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
      ** Message contents
      *
      ** Action code
     A            DDACTN         1A         COLHDG('Action Code')
      *
      ** Currency Code
     A            DDCYCD         3A         COLHDG('Currency Code')
      *
      ** Base Rate Code
     A            DDBSRC         2A         COLHDG('Base Rate Code')
      *
      ** Base Rate Name
     A            DDBSRN        30A         COLHDG('Base Rate name')
      *
      ** Base Rate Short Name
     A            DDBSRS         5A         COLHDG('Base Rate Short name')
      *
      ** Current Base Rate
     A            DDCBSR        12A         COLHDG('Current Base Rate')
      *
      ** Current Base Rate Value Date
     A            DDVDRC         7A         COLHDG('VDAT of Current Rate')
      *
      ** New Base Rate
     A            DDNBRT        12A         COLHDG('New Base Rate')
      *
      ** New Base Rate Value Date
     A            DDVDNR         6A         COLHDG('VDAT of New Rate')
      *
      ** ISA Def of Base Rate
     A            DDSCDD        24A         COLHDG('ISA Def of Base Rate')
      *
      ** Designated Maturity
     A            DDDGMA         3A         COLHDG('Designated Maturity')
      *
      ** Other Maturity Decription
     A            DDOMD1        35A         COLHDG('Other Maturity Desc')
     A            DDOMD2        35A         COLHDG('Other Maturity Desc')
     A
      *                                              Begin /CSD006/
      *
      ** Data Source Override
     A            DDBRDS        32A         COLHDG('Data Source Override')
      *
      ** Data Request Id
     A            DDDTFR        32A         COLHDG('Data Request Id')
      *
      ** Base Rate Timestamp
     A            DDDFTS        14A         COLHDG('Data Feed Timestamp')
      *
      ** Base Rate FO Identifier
     A            DDFRNT        20A         COLHDG('Base Rate FO Id')
     A
      *                                              End   /CSD006/
      *                                              Begin /CSD103/
      ** Backward-Looking Rate
     A            DDBLRT         1A         COLHDG('Backward-Looking Rate')
      *
      ** Default Lookback Days for Settlement Base Rate
     A            DDLBDY         2A         COLHDG('Def. Lookback Days' +
     A                                             'for Sett. Base Rate')
      ** Default Lockout Days
     A            DDLODY         2A         COLHDG('Default Lockout Days')
      *
      ** Default Payment Delay Days
     A            DDPDLY         2A         COLHDG('Default Payment Delay Days')
      *
      ** Benchmark Adjustment
     A            DDBADJ        14A         COLHDG('Benchmark Adjustment')
      *
      ** Averaging Option
     A            DDAVOP         1A         COLHDG('Averaging Option')
      *
      ** Base Rate for Accrual
     A            DDBRAC         2A         COLHDG('Base Rate for Accrual')
      *
      ** Weight Convention
     A            DDWGHT         1A         COLHDG('Weight Convention')
      *
      ** Default Lookback Days for Accrual
     A            DDLBAC         2A         COLHDG('Def. Lookback Days' +
     A                                             'for Accrual')
      *                                              End   /CSD103/
