      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Temporary Customer Depository Reference')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDCSXXPD - Temporary Customer Depository Reference File   *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. 222727             Date 05Nov03               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 CSE022  *CREATE    Date 29Mar01               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  222727 - Release 5.0 errors  (Recompile)                     *
      *  CSE022 - Depository Definition Enhancement                   *
      *                                                               *
      *****************************************************************
      *
     A          R SDCSXXD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A            DTCUST         6A         TEXT('Customer Number')
     A                                      COLHDG('Customer' 'Number')
      *
     A            DTDPOT         6A         TEXT('Depot Customer Number')
     A                                      COLHDG('Depot' 'Customer' 'Number')
      *
     A            DTDPSN        10A         TEXT('Depot Shortname')
     A                                      COLHDG('Depot' 'Shortname')
      *
     A            DTREFN        20A         TEXT('Depot Reference')
     A                                      COLHDG('Depot' 'Reference')
      *
     A          K DTCUST
     A          K DTDPSN
      *
