      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD API customers details defn file - ext C')     *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data ILE Module                             *
      *                                                               *
      *  PF/SDCUXCPD - API Incoming Message Definition File for       *
      *                Customers - Extention 1                        *
      *                                                               *
      *  (c) Finastra International Limited 2013                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CGL132  *CREATE    Date 01May13               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL132 - FATCA Phase 1 - Customer's Identification           *
      *                      and Classification                       *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R SDCUXCT0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
      ** Alternative Country of Citizenship
      *
     A            DDACCZ         2A         TEXT('Alt Ctry of Citznshp')
      *
      ** Creation Date
      *
     A            DDCRDT         6A         TEXT('Creation Date')
      *
      ** Last Change User
      *
     A            DDLCUS        10A         TEXT('Last Change User')
      *
      ** Dormant Indicator
      *
     A            DDDRMT         1A         TEXT('Dormant Indicator')
      *****************************************************************
