      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD CUAH API Format Definition File')             *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDCUAHDPD - Midas SD CUAH API Format Definition           *
      *                                                               *
      *  (c) Finastra International Limited 2010                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CGL132             Date 01May13               *
      *                 CER059  *CREATE    Date 19Jul10               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL132 - FATCA Phase 1 - Customers' Identification and       *
      *           Classification - Master                             *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *         - LT073: upgrade ACU3, ACU4, CUAH and CCTX to CUSD    *
      *                                                               *
      *****************************************************************
     A          R SDCUAHDD0                 TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2010')
      *
     A            DDAUT1        10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP1         2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG11         2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG21         2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG31         2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG41         2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA1         2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN1         1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN1         3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT2        10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP2         2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG12         2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG22         2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG32         2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG42         2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA2         2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN2         1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN2         3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT3        10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP3         2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG13         2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG23         2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG33         2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG43         2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA3         2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN3         1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN3         3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT4        10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP4         2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG14         2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG24         2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG34         2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG44         2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA4         2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN4         1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN4         3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT5        10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP5         2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG15         2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG25         2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG35         2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG45         2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA5         2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN5         1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN5         3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT6        10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP6         2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG16         2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG26         2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG36         2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG46         2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA6         2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN6         1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN6         3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT7        10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP7         2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG17         2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG27         2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG37         2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG47         2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA7         2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN7         1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN7         3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT8        10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP8         2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG18         2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG28         2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG38         2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG48         2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA8         2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN8         1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN8         3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT9        10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP9         2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG19         2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG29         2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG39         2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG49         2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA9         2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN9         1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN9         3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT10       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP10        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG110        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG210        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG310        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG410        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA10        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN10        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN10        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT11       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP11        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG111        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG211        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG311        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG411        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA11        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN11        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN11        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT12       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP12        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG112        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG212        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG312        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG412        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA12        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN12        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN12        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT13       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP13        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG113        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG213        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG313        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG413        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA13        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN13        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN13        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT14       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP14        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG114        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG214        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG314        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG414        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA14        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN14        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN14        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT15       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP15        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG115        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG215        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG315        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG415        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA15        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN15        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN15        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT16       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP16        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG116        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG216        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG316        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG416        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA16        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN16        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN16        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT17       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP17        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG117        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG217        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG317        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG417        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA17        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN17        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN17        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT18       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP18        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG118        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG218        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG318        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG418        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA18        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN18        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN18        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT19       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP19        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG119        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG219        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG319        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG419        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA19        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN19        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN19        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT20       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP20        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG120        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG220        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG320        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG420        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA20        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN20        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN20        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT21       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP21        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG121        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG221        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG321        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG421        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA21        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN21        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN21        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT22       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP22        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG122        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG222        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG322        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG422        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA22        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN22        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN22        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT23       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP23        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG123        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG223        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG323        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG423        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA23        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN23        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN23        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT24       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP24        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG124        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG224        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG324        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG424        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA24        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN24        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN24        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT25       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP25        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG125        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG225        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG325        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG425        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA25        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN25        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN25        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT26       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP26        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG126        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG226        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG326        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG426        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA26        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN26        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN26        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT27       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP27        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG127        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG227        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG327        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG427        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA27        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN27        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN27        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT28       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP28        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG128        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG228        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG328        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG428        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA28        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN28        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN28        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT29       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP29        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG129        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG229        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG329        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG429        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA29        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN29        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN29        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT30       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP30        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG130        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG230        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG330        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG430        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA30        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN30        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN30        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT31       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP31        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG131        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG231        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG331        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG431        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA31        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN31        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN31        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT32       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP32        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG132        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG232        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG332        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG432        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA32        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN32        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN32        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT33       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP33        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG133        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG233        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG333        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG433        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA33        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN33        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN33        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT34       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP34        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG134        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG234        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG334        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG434        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA34        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN34        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN34        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT35       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP35        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG135        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG235        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG335        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG435        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA35        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN35        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN35        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT36       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP36        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG136        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG236        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG336        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG436        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA36        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN36        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN36        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT37       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP37        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG137        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG237        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG337        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG437        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA37        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN37        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN37        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT38       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP38        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG138        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG238        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG338        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG438        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA38        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN38        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN38        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT39       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP39        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG139        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG239        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG339        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG439        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA39        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN39        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN39        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT40       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP40        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG140        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG240        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG340        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG440        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA40        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN40        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN40        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT41       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP41        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG141        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG241        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG341        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG441        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA41        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN41        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN41        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT42       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP42        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG142        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG242        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG342        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG442        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA42        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN42        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN42        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT43       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP43        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG143        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG243        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG343        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG443        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA43        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN43        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN43        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT44       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP44        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG144        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG244        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG344        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG444        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA44        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN44        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN44        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT45       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP45        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG145        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG245        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG345        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG445        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA45        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN45        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN45        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT46       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP46        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG146        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG246        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG346        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG446        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA46        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN46        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN46        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT47       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP47        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG147        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG247        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG347        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG447        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA47        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN47        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN47        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT48       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP48        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG148        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG248        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG348        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG448        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA48        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN48        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN48        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT49       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP49        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG149        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG249        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG349        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG449        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA49        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN49        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN49        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
     A            DDAUT50       10A         TEXT('Authority Holder +
     A                                            Number')
     A                                      COLHDG('Authority Holder' +
     A                                             'Number')
      *
     A            DDLTP50        2A         TEXT('Link Type')
     A                                      COLHDG('Link Type')
      *
     A            DDPG150        2A         TEXT('Product Group 1')
     A                                      COLHDG('Product' +
     A                                             'Group 1')
      *
     A            DDPG250        2A         TEXT('Product Group 2')
     A                                      COLHDG('Product' +
     A                                             'Group 2')
      *
     A            DDPG350        2A         TEXT('Product Group 3')
     A                                      COLHDG('Product' +
     A                                             'Group 3')
      *
     A            DDPG450        2A         TEXT('Product Group 4')
     A                                      COLHDG('Product' +
     A                                             'Group 4')
      *
     A            DDTPA50        2A         TEXT('Type of Authority')
     A                                      COLHDG('Type of' +
     A                                             'Authority')
      *
      ** Start of Change CGL132
     A            DDCIN50        1A         TEXT('Controlling Interest')
     A                                      COLHDG('Controlling' +
     A                                             'Interest' )
     A            DDPCN50        3A         TEXT('Control Percentage')
     A                                      COLHDG('Control' +
     A                                             'Percentage')
      ** End of Change CGL132
