      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD API Cust FX Netting details def File')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data ILE Module                             *
      *                                                               *
      *  PF/SDCUFXPD - API Incoming Message Definition File for       *
      *                Customer FX Netting details                    *
      *                                                               *
      *  (c) Finastra International Limited 2006                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Prev Amend No. CSD079  *CREATE    Date 05Feb07               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD079 - Enhanced Customer Maintenance API                   *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R SDCUFXD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2006')
      *
     A            DDACTN         1          TEXT('Action Code')
     A                                      COLHDG('Action' 'Code')
      *
     A            DDNET          1          TEXT('Net Settlement')
     A                                      COLHDG('Net' 'Settlement')
      *
     A            DDNTGP         4          TEXT('Netting Group')
     A                                      COLHDG('Netting' 'Group')
      *
     A            DDNTCP         1          TEXT('Net by Currency Pairs')
     A                                      COLHDG('Net by' 'Currency' +
     A                                             'Pairs')
      *
     A            DDNTND         2          TEXT('Net Notice Days')
     A                                      COLHDG('Net' 'Notice' 'Days')
      *
     A            DDNTMM         1          TEXT('Net Manual Matching')
     A                                      COLHDG('Net' 'Manual' 'Matching')
