      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD API ACUD Records Error Indicators 5')         *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDEACU5PD - Midas SD API ACUD Records Error Indicators 5  *
      *                                                               *
      *  (c) Finastra International Limited 2004                      *
      *                                                               *
      *  Last Amend No. CGL157             Date 17Aug15               *
      *  Prev Amend No. MD046248           Date 27Oct17               *
      *                 CGL132  *CREATE    Date 01May13               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGL157 - CRS Reporting                                       *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL132 - FATCA Phase 1 - Customer's Identification           *
      *           Classification - Master                             *
      *                                                               *
      *****************************************************************
     A          R SDEACU5D0                 TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2013')
     A            OKTIN2         1A         TEXT('Tax Identification No. 2')
     A                                      COLHDG('Tax Id 2')
     A            OKTNC2         1A         TEXT('TIN Country No. 2')
     A                                      COLHDG('TIN Ctry 2')
     A            OKTIN3         1A         TEXT('Tax Identification No. 3')
     A                                      COLHDG('Tax Id 3')
     A            OKTNC3         1A         TEXT('TIN Country No. 3')
     A                                      COLHDG('TIN Ctry 3')
     A            OKTIN4         1A         TEXT('Tax Identification No. 4')
     A                                      COLHDG('Tax Id 4')
     A            OKTNC4         1A         TEXT('TIN Country No. 4')
     A                                      COLHDG('TIN Ctry 4')
     A            OKTIN5         1A         TEXT('Tax Identification No. 5')
     A                                      COLHDG('Tax Id 5')
     A            OKTNC5         1A         TEXT('TIN Country No. 5')
     A                                      COLHDG('TIN Ctry 5')
      ** Start of change CGL157
     A            OKEFF1         1A         TEXT('Effective Date 1')
     A                                      COLHDG('Effective' +
     A                                             'Date 1' )
     A            OKEXP1         1A         TEXT('Expiry Date 1')
     A                                      COLHDG('Expiry ' +
     A                                             'Date 1' )
     A            OKEFF2         1A         TEXT('Effective Date 2')
     A                                      COLHDG('Effective' +
     A                                             'Date 2' )
     A            OKEXP2         1A         TEXT('Expiry Date 2')
     A                                      COLHDG('Expiry ' +
     A                                             'Date 2' )
     A            OKEFF3         1A         TEXT('Effective Date 3')
     A                                      COLHDG('Effective' +
     A                                             'Date 3' )
     A            OKEXP3         1A         TEXT('Expiry Date 3')
     A                                      COLHDG('Expiry ' +
     A                                             'Date 3' )
     A            OKEFF4         1A         TEXT('Effective Date 4')
     A                                      COLHDG('Effective' +
     A                                             'Date 4' )
     A            OKEXP4         1A         TEXT('Expiry Date 4')
     A                                      COLHDG('Expiry ' +
     A                                             'Date 4' )
     A            OKEFF5         1A         TEXT('Effective Date 5')
     A                                      COLHDG('Effective' +
     A                                             'Date 5' )
     A            OKEXP5         1A         TEXT('Expiry Date 5')
     A                                      COLHDG('Expiry ' +
     A                                             'Date 5' )
     A            OKEFF6         1A         TEXT('Effective Date 6')
     A                                      COLHDG('Effective' +
     A                                             'Date 6' )
     A            OKEXP6         1A         TEXT('Expiry Date 6')
     A                                      COLHDG('Expiry ' +
     A                                             'Date 6' )
     A            OKEFF7         1A         TEXT('Effective Date 7')
     A                                      COLHDG('Effective' +
     A                                             'Date 7' )
     A            OKEXP7         1A         TEXT('Expiry Date 7')
     A                                      COLHDG('Expiry ' +
     A                                             'Date 7' )
     A            OKEFF8         1A         TEXT('Effective Date 8')
     A                                      COLHDG('Effective' +
     A                                             'Date 8' )
     A            OKEXP8         1A         TEXT('Expiry Date 8')
     A                                      COLHDG('Expiry ' +
     A                                             'Date 8' )
     A            OKEFF9         1A         TEXT('Effective Date 9')
     A                                      COLHDG('Effective' +
     A                                             'Date 9' )
     A            OKEXP9         1A         TEXT('Expiry Date 9')
     A                                      COLHDG('Expiry ' +
     A                                             'Date 9' )
     A            OKEFF0         1A         TEXT('Effective Date 10')
     A                                      COLHDG('Effective' +
     A                                             'Date 10' )
     A            OKEXP0         1A         TEXT('Expiry Date 10')
     A                                      COLHDG('Expiry ' +
     A                                             'Date 10' )
     A            OKTIN6         1A         TEXT('Tax Identification No. 6')
     A                                      COLHDG('Tax Id 6')
     A            OKTNC6         1A         TEXT('TIN Country No. 6')
     A                                      COLHDG('TIN Ctry 6')
     A            OKTIN7         1A         TEXT('Tax Identification No. 7')
     A                                      COLHDG('Tax Id 7')
     A            OKTNC7         1A         TEXT('TIN Country No. 7')
     A                                      COLHDG('TIN Ctry 7')
     A            OKTIN8         1A         TEXT('Tax Identification No. 8')
     A                                      COLHDG('Tax Id 8')
     A            OKTNC8         1A         TEXT('TIN Country No. 8')
     A                                      COLHDG('TIN Ctry 8')
     A            OKTIN9         1A         TEXT('Tax Identification No. 9')
     A                                      COLHDG('Tax Id 9')
     A            OKTNC9         1A         TEXT('TIN Country No. 9')
     A                                      COLHDG('TIN Ctry 9')
     A            OKTIN0         1A         TEXT('Tax Identification No. 10')
     A                                      COLHDG('Tax Id 10')
     A            OKTNC0         1A         TEXT('TIN Country No. 10')
     A                                      COLHDG('TIN Ctry 10')
      ** End of change CGL157
