      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD API Customer Depository Ref. Error Def.')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDECSDRPD - API Customer Depository Reference Error       *
      *                 Definition File                               *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      *  Last Amend No. CSE022  *CREATE    Date 29Mar01               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSE022 - Depository Definition Enhancement                   *
      *                                                               *
      *****************************************************************
      *
     A          R SDECSDRD0                 TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            DDACTNOK       1A         TEXT('Action Code')
     A                                      COLHDG('Action' 'Code')
      *
     A            DDCUSTOK       1A         TEXT('Customer Number')
     A                                      COLHDG('Customer' 'Number')
      *
     A            DDDPOTOK       1A         TEXT('Depot Customer Number')
     A                                      COLHDG('Depot' 'Customer' 'Number')
      *
     A            DDREFNOK       1A         TEXT('Depot Reference')
     A                                      COLHDG('Depot' 'Reference')
      *
