      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('SD Error indicators - Currency/Time of Netting')       *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDECTNMPD - API Error Definition File for Customer        *
      *                 Currency/Time of Netting Details              *
      *                                                               *
      *  (c) Finastra International Limited 2013                      *
      *                                                               *
      *  Last Amend No. MD059520           Date 21Feb22               *
      *  Prev Amend No. MD046248           Date 27Oct17               *
      *                 AR1086546 *CREATE  Date 18Jun13               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD059520 - Fusion Midas, Customer details Currency/Time of   *
      *             netting tab not showing records.                  *
      *  MD046248 - Finastra Rebranding                               *
      *  AR1086546 - CDL025 upgrade to MP1.4. (Child: AR1086547).     *
      *              Applied for MD021813                             *
      *                                                               *
      *****************************************************************
     A          R SDECTNMP0                 TEXT('(c) Finastra International +
     A                                      Limited 2013')
      *
     A            DDACTNOK       1A         TEXT('Action Code OK')
     A                                      COLHDG('Action Code OK')
     A            DDCUSTOK       1A         TEXT('Customer Number OK')
     A                                      COLHDG('Customer Number OK')
     A            DDNTCPOK       1A         TEXT('Net by Currency Pairs OK')
     A                                      COLHDG('Net by Ccy Pairs OK')
     A            DDCCY1_1OK     1A         TEXT('Currency Code1 1 OK')
     A                                      COLHDG('Currency Code1 1 OK')
     A            DDCCY2_1OK     1A         TEXT('Currency Code2 1 OK')
     A                                      COLHDG('Currency Code2 1 OK')
     A            DDTIME_1OK     1A         TEXT('Time 1 OK')
     A                                      COLHDG('Time 1 OK')
     A            DDRNTD_1OK     1A         TEXT('Release Notice Days 1 OK')
     A                                      COLHDG('Rel Notice Days 1 OK')
     A            DDCCY1_2OK     1A         TEXT('Currency Code1 2 OK')
     A                                      COLHDG('Currency Code1 2 OK')
     A            DDCCY2_2OK     1A         TEXT('Currency Code2 2 OK')
     A                                      COLHDG('Currency Code2 2 OK')
     A            DDTIME_2OK     1A         TEXT('Time 2 OK')
     A                                      COLHDG('Time 2 OK')
     A            DDRNTD_2OK     1A         TEXT('Release Notice Days 2 OK')
     A                                      COLHDG('Rel Notice Days 2 OK')
     A            DDCCY1_3OK     1A         TEXT('Currency Code1 3 OK')
     A                                      COLHDG('Currency Code1 3 OK')
     A            DDCCY2_3OK     1A         TEXT('Currency Code2 3 OK')
     A                                      COLHDG('Currency Code2 3 OK')
     A            DDTIME_3OK     1A         TEXT('Time 3 OK')
     A                                      COLHDG('Time 3 OK')
     A            DDRNTD_3OK     1A         TEXT('Release Notice Days 3 OK')
     A                                      COLHDG('Rel Notice Days 3 OK')
     A            DDCCY1_4OK     1A         TEXT('Currency Code1 4 OK')
     A                                      COLHDG('Currency Code1 4 OK')
     A            DDCCY2_4OK     1A         TEXT('Currency Code2 4 OK')
     A                                      COLHDG('Currency Code2 4 OK')
     A            DDTIME_4OK     1A         TEXT('Time 4 OK')
     A                                      COLHDG('Time 4 OK')
     A            DDRNTD_4OK     1A         TEXT('Release Notice Days 4 OK')
     A                                      COLHDG('Rel Notice Days 4 OK')
     A            DDCCY1_5OK     1A         TEXT('Currency Code1 5 OK')
     A                                      COLHDG('Currency Code1 5 OK')
     A            DDCCY2_5OK     1A         TEXT('Currency Code2 5 OK')
     A                                      COLHDG('Currency Code2 5 OK')
     A            DDTIME_5OK     1A         TEXT('Time 5 OK')
     A                                      COLHDG('Time 5 OK')
     A            DDRNTD_5OK     1A         TEXT('Release Notice Days 5 OK')
     A                                      COLHDG('Rel Notice Days 5 OK')
     A            DDCCY1_6OK     1A         TEXT('Currency Code1 6 OK')
     A                                      COLHDG('Currency Code1 6 OK')
     A            DDCCY2_6OK     1A         TEXT('Currency Code2 6 OK')
     A                                      COLHDG('Currency Code2 6 OK')
     A            DDTIME_6OK     1A         TEXT('Time 6 OK')
     A                                      COLHDG('Time 6 OK')
     A            DDRNTD_6OK     1A         TEXT('Release Notice Days 6 OK')
     A                                      COLHDG('Rel Notice Days 6 OK')
     A            DDCCY1_7OK     1A         TEXT('Currency Code1 7 OK')
     A                                      COLHDG('Currency Code1 7 OK')
     A            DDCCY2_7OK     1A         TEXT('Currency Code2 7 OK')
     A                                      COLHDG('Currency Code2 7 OK')
     A            DDTIME_7OK     1A         TEXT('Time 7 OK')
     A                                      COLHDG('Time 7 OK')
     A            DDRNTD_7OK     1A         TEXT('Release Notice Days 7 OK')
     A                                      COLHDG('Rel Notice Days 7 OK')
     A            DDCCY1_8OK     1A         TEXT('Currency Code1 8 OK')
     A                                      COLHDG('Currency Code1 8 OK')
     A            DDCCY2_8OK     1A         TEXT('Currency Code2 8 OK')
     A                                      COLHDG('Currency Code2 8 OK')
     A            DDTIME_8OK     1A         TEXT('Time 8 OK')
     A                                      COLHDG('Time 8 OK')
     A            DDRNTD_8OK     1A         TEXT('Release Notice Days 8 OK')
     A                                      COLHDG('Rel Notice Days 8 OK')
     A            DDCCY1_9OK     1A         TEXT('Currency Code1 9 OK')
     A                                      COLHDG('Currency Code1 9 OK')
     A            DDCCY2_9OK     1A         TEXT('Currency Code2 9 OK')
     A                                      COLHDG('Currency Code2 9 OK')
     A            DDTIME_9OK     1A         TEXT('Time 9 OK')
     A                                      COLHDG('Time 9 OK')
     A            DDRNTD_9OK     1A         TEXT('Release Notice Days 9 OK')
     A                                      COLHDG('Rel Notice Days 9 OK')
     A            DDCCY110OK     1A         TEXT('Currency Code1 10 OK')
     A                                      COLHDG('Currency Code1 10 OK')
     A            DDCCY210OK     1A         TEXT('Currency Code2 10 OK')
     A                                      COLHDG('Currency Code2 10 OK')
     A            DDTIME10OK     1A         TEXT('Time 10 OK')
     A                                      COLHDG('Time 10 OK')
     A            DDRNTD10OK     1A         TEXT('Release Notice Days 10 OK')
     A                                      COLHDG('Rel Not Days 10 OK')
     A**Start of change MD059520                                                            MD059520
     A            DDCCY111OK     1A         TEXT('Currency Code1 11 OK')
     A                                      COLHDG('Currency Code1 11 OK')
     A            DDCCY211OK     1A         TEXT('Currency Code2 11 OK')
     A                                      COLHDG('Currency Code2 11 OK')
     A            DDTIME11OK     1A         TEXT('Time 11 OK')
     A                                      COLHDG('Time 11 OK')
     A            DDRNTD11OK     1A         TEXT('Release Notice Days 11 OK')
     A                                      COLHDG('Rel Not Days 11 OK')
     A            DDCCY112OK     1A         TEXT('Currency Code1 12 OK')
     A                                      COLHDG('Currency Code1 12 OK')
     A            DDCCY212OK     1A         TEXT('Currency Code2 12 OK')
     A                                      COLHDG('Currency Code2 12 OK')
     A            DDTIME12OK     1A         TEXT('Time 12 OK')
     A                                      COLHDG('Time 12 OK')
     A            DDRNTD12OK     1A         TEXT('Release Notice Days 12 OK')
     A                                      COLHDG('Rel Not Days 12 OK')
     A            DDCCY113OK     1A         TEXT('Currency Code1 13 OK')
     A                                      COLHDG('Currency Code1 13 OK')
     A            DDCCY213OK     1A         TEXT('Currency Code2 13 OK')
     A                                      COLHDG('Currency Code2 13 OK')
     A            DDTIME13OK     1A         TEXT('Time 13 OK')
     A                                      COLHDG('Time 13 OK')
     A            DDRNTD13OK     1A         TEXT('Release Notice Days 13 OK')
     A                                      COLHDG('Rel Not Days 13 OK')
     A            DDCCY114OK     1A         TEXT('Currency Code1 14 OK')
     A                                      COLHDG('Currency Code1 14 OK')
     A            DDCCY214OK     1A         TEXT('Currency Code2 14 OK')
     A                                      COLHDG('Currency Code2 14 OK')
     A            DDTIME14OK     1A         TEXT('Time 14 OK')
     A                                      COLHDG('Time 14 OK')
     A            DDRNTD14OK     1A         TEXT('Release Notice Days 15 OK')
     A                                      COLHDG('Rel Not Days 15 OK')
     A            DDCCY115OK     1A         TEXT('Currency Code1 15 OK')
     A                                      COLHDG('Currency Code1 15 OK')
     A            DDCCY215OK     1A         TEXT('Currency Code2 15 OK')
     A                                      COLHDG('Currency Code2 15 OK')
     A            DDTIME15OK     1A         TEXT('Time 15 OK')
     A                                      COLHDG('Time 15 OK')
     A            DDRNTD15OK     1A         TEXT('Release Notice Days 15 OK')
     A                                      COLHDG('Rel Not Days 15 OK')
     A            DDCCY116OK     1A         TEXT('Currency Code1 16 OK')
     A                                      COLHDG('Currency Code1 16 OK')
     A            DDCCY216OK     1A         TEXT('Currency Code2 16 OK')
     A                                      COLHDG('Currency Code2 16 OK')
     A            DDTIME16OK     1A         TEXT('Time 16 OK')
     A                                      COLHDG('Time 16 OK')
     A            DDRNTD16OK     1A         TEXT('Release Notice Days 16 OK')
     A                                      COLHDG('Rel Not Days 16 OK')
     A            DDCCY117OK     1A         TEXT('Currency Code1 17 OK')
     A                                      COLHDG('Currency Code1 17 OK')
     A            DDCCY217OK     1A         TEXT('Currency Code2 17 OK')
     A                                      COLHDG('Currency Code2 17 OK')
     A            DDTIME17OK     1A         TEXT('Time 17 OK')
     A                                      COLHDG('Time 17 OK')
     A            DDRNTD17OK     1A         TEXT('Release Notice Days 17 OK')
     A                                      COLHDG('Rel Not Days 17 OK')
     A            DDCCY118OK     1A         TEXT('Currency Code1 18 OK')
     A                                      COLHDG('Currency Code1 18 OK')
     A            DDCCY218OK     1A         TEXT('Currency Code2 18 OK')
     A                                      COLHDG('Currency Code2 18 OK')
     A            DDTIME18OK     1A         TEXT('Time 18 OK')
     A                                      COLHDG('Time 18 OK')
     A            DDRNTD18OK     1A         TEXT('Release Notice Days 18 OK')
     A                                      COLHDG('Rel Not Days 18 OK')
     A            DDCCY119OK     1A         TEXT('Currency Code1 19 OK')
     A                                      COLHDG('Currency Code1 19 OK')
     A            DDCCY219OK     1A         TEXT('Currency Code2 19 OK')
     A                                      COLHDG('Currency Code2 19 OK')
     A            DDTIME19OK     1A         TEXT('Time 10 OK')
     A                                      COLHDG('Time 19 OK')
     A            DDRNTD19OK     1A         TEXT('Release Notice Days 19 OK')
     A                                      COLHDG('Rel Not Days 19 OK')
     A            DDCCY120OK     1A         TEXT('Currency Code1 20 OK')
     A                                      COLHDG('Currency Code1 20 OK')
     A            DDCCY220OK     1A         TEXT('Currency Code2 20 OK')
     A                                      COLHDG('Currency Code2 20 OK')
     A            DDTIME20OK     1A         TEXT('Time 20 OK')
     A                                      COLHDG('Time 20 OK')
     A            DDRNTD20OK     1A         TEXT('Release Notice Days 20 OK')
     A                                      COLHDG('Rel Not Days 20 OK')
     A            DDCCY121OK     1A         TEXT('Currency Code1 21 OK')
     A                                      COLHDG('Currency Code1 21 OK')
     A            DDCCY221OK     1A         TEXT('Currency Code2 21 OK')
     A                                      COLHDG('Currency Code2 21 OK')
     A            DDTIME21OK     1A         TEXT('Time 21 OK')
     A                                      COLHDG('Time 21 OK')
     A            DDRNTD21OK     1A         TEXT('Release Notice Days 21 OK')
     A                                      COLHDG('Rel Not Days 21 OK')
     A            DDCCY122OK     1A         TEXT('Currency Code1 22 OK')
     A                                      COLHDG('Currency Code1 22 OK')
     A            DDCCY222OK     1A         TEXT('Currency Code2 22 OK')
     A                                      COLHDG('Currency Code2 22 OK')
     A            DDTIME22OK     1A         TEXT('Time 22 OK')
     A                                      COLHDG('Time 22 OK')
     A            DDRNTD22OK     1A         TEXT('Release Notice Days 22 OK')
     A                                      COLHDG('Rel Not Days 22 OK')
     A            DDCCY123OK     1A         TEXT('Currency Code1 23 OK')
     A                                      COLHDG('Currency Code1 23 OK')
     A            DDCCY223OK     1A         TEXT('Currency Code2 23 OK')
     A                                      COLHDG('Currency Code2 23 OK')
     A            DDTIME23OK     1A         TEXT('Time 23 OK')
     A                                      COLHDG('Time 23 OK')
     A            DDRNTD23OK     1A         TEXT('Release Notice Days 23 OK')
     A                                      COLHDG('Rel Not Days 23 OK')
     A            DDCCY124OK     1A         TEXT('Currency Code1 24 OK')
     A                                      COLHDG('Currency Code1 24 OK')
     A            DDCCY224OK     1A         TEXT('Currency Code2 24 OK')
     A                                      COLHDG('Currency Code2 24 OK')
     A            DDTIME24OK     1A         TEXT('Time 24 OK')
     A                                      COLHDG('Time 24 OK')
     A            DDRNTD24OK     1A         TEXT('Release Notice Days 24 OK')
     A                                      COLHDG('Rel Not Days 24 OK')
     A            DDCCY125OK     1A         TEXT('Currency Code1 25 OK')
     A                                      COLHDG('Currency Code1 25 OK')
     A            DDCCY225OK     1A         TEXT('Currency Code2 25 OK')
     A                                      COLHDG('Currency Code2 25 OK')
     A            DDTIME25OK     1A         TEXT('Time 25 OK')
     A                                      COLHDG('Time 25 OK')
     A            DDRNTD25OK     1A         TEXT('Rel Not Days 25 OK')
     A                                      COLHDG('Rel Not Days 25 OK')
     A            DDCCY126OK     1A         TEXT('Currency Code1 26 OK')
     A                                      COLHDG('Currency Code1 26 OK')
     A            DDCCY226OK     1A         TEXT('Currency Code2 26 OK')
     A                                      COLHDG('Currency Code2 26 OK')
     A            DDTIME26OK     1A         TEXT('Time 26 OK')
     A                                      COLHDG('Time 26 OK')
     A            DDRNTD26OK     1A         TEXT('Release Notice Days 26 OK')
     A                                      COLHDG('Rel Not Days 26 OK')
     A            DDCCY127OK     1A         TEXT('Currency Code1 27 OK')
     A                                      COLHDG('Currency Code1 27 OK')
     A            DDCCY227OK     1A         TEXT('Currency Code2 27 OK')
     A                                      COLHDG('Currency Code2 27 OK')
     A            DDTIME27OK     1A         TEXT('Time 27 OK')
     A                                      COLHDG('Time 27 OK')
     A            DDRNTD27OK     1A         TEXT('Release Notice Days 27 OK')
     A                                      COLHDG('Rel Not Days 27 OK')
     A            DDCCY128OK     1A         TEXT('Currency Code1 28 OK')
     A                                      COLHDG('Currency Code1 28 OK')
     A            DDCCY228OK     1A         TEXT('Currency Code2 28 OK')
     A                                      COLHDG('Currency Code2 28 OK')
     A            DDTIME28OK     1A         TEXT('Time 28 OK')
     A                                      COLHDG('Time 28 OK')
     A            DDRNTD28OK     1A         TEXT('Release Notice Days 28 OK')
     A                                      COLHDG('Rel Not Days 28 OK')
     A            DDCCY129OK     1A         TEXT('Currency Code1 29 OK')
     A                                      COLHDG('Currency Code1 29 OK')
     A            DDCCY229OK     1A         TEXT('Currency Code2 29 OK')
     A                                      COLHDG('Currency Code2 29 OK')
     A            DDTIME29OK     1A         TEXT('Time 29 OK')
     A                                      COLHDG('Time 29 OK')
     A            DDRNTD29OK     1A         TEXT('Release Notice Days 29 OK')
     A                                      COLHDG('Rel Not Days 29 OK')
     A            DDCCY130OK     1A         TEXT('Currency Code1 30 OK')
     A                                      COLHDG('Currency Code1 30 OK')
     A            DDCCY230OK     1A         TEXT('Currency Code2 30 OK')
     A                                      COLHDG('Currency Code2 30 OK')
     A            DDTIME30OK     1A         TEXT('Time 30 OK')
     A                                      COLHDG('Time 30 OK')
     A            DDRNTD30OK     1A         TEXT('Release Notice Days 30 OK')
     A                                      COLHDG('Rel Not Days 30 OK')
     A**End of change MD059520
      *