      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD API CCTX Records Error Indicators')           *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDECCTXPD - Midas SD API CCTX Records Error Indicators    *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2004            *
      *                                                               *
      *  Last Amend No. CER059             Date 19Jul10               *
      *  Prev Amend No. CER048             Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 236137             Date 21Sep05               *
      *                 CGL031  *CREATE    Date 05Jul04               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER048 - German Features - Taxes                             *
      *  236137 - Change Control for CGL031                           *
      *  CGL031 - Taxation of Savings Income                          *
      *                                                               *
      *****************************************************************
     A          R SDECCTXD0                 TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2004')
     A            OKACTN         1A         TEXT('Action Code')
     A                                      COLHDG('Action Code')
     A            OKCUST         1A         TEXT('Customer Number')
     A                                      COLHDG('Customer Number')
     A            OKCTTX         1A         TEXT('Country of Tax Code')
     A                                      COLHDG('Country of Tax Code')
     A            OKETXS         1A         TEXT('European Tax Status')
     A                                      COLHDG('European Tax Status')
     A            OKCERF         1A         TEXT('Certificate Reference')
     A                                      COLHDG('Certificate ' +
     A                                      'Reference')
     A            OKCEEX         1A         TEXT('Certificate Expiry Date')
     A                                      COLHDG('Certificate ' +
     A                                      'Expiry Date')
     A**Start of change 236137
     A            OKCSTS         1A         TEXT('Customer Tax Status')
     A                                      COLHDG('Customer Tax Status')
     A**End of change 236137
      **Start of change CER048
     A            OKCRTP         1A         TEXT('Certificate Type')
     A                                      COLHDG('Certificate Type')
     A            OKCADT         1A         TEXT('Certificate +
     A                                      Approval Date')
     A                                      COLHDG('Certificate ' +
     A                                      'Approval Date')
     A            OKCVDT         1A         TEXT('Certificate Value +
     A                                      Date')
     A                                      COLHDG('Certificate ' +
     A                                      'Value Date')
      **End of change CER048
