      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Compliance watch conf. error file')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data ILE Module                             *
      *                                                               *
      *  PF/SDECWCMPD - Compliance Watch Configuration Error File     *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2002            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD017             Date 08Nov02               *
      *  Prev Amend No. CSD015  *CREATE    Date 14Oct02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD017 - Midas Compliance Watch - Anti-Money Laundering      *
      *  CSD015 - Midas Compliance Watch - Watch List Checking        *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R SDECWCMD0                 TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2002')
     A            #1CASROK       1          TEXT('Compliance Alert Server +
     A                                           Identifier')
     A                                      COLHDG('Compliance Alert' +
     A                                             'Server Identifier')
     A            #1CADBOK       1          TEXT('Compliance Alert +
     A                                           Database Name')
     A                                      COLHDG('Compliance Alert' +
     A                                             'Database Name')
     A            #1IND1OK       1          TEXT('Private Customer +
     A                                           Industry Code 1')
     A                                      COLHDG('Private Customer' +
     A                                             'Industry Code 1')
     A            #1IND2OK       1          TEXT('Private Customer +
     A                                           Industry Code 2')
     A                                      COLHDG('Private Customer' +
     A                                             'Industry Code 2')
     A            #1IND3OK       1          TEXT('Private Customer +
     A                                           Industry Code 3')
     A                                      COLHDG('Private Customer' +
     A                                             'Industry Code 3')
     A            #1IND4OK       1          TEXT('Private Customer +
     A                                           Industry Code 4')
     A                                      COLHDG('Private Customer' +
     A                                             'Industry Code 4')
     A            #1IND5OK       1          TEXT('Private Customer +
     A                                           Industry Code 5')
     A                                      COLHDG('Private Customer' +
     A                                             'Industry Code 5')
      **Start of change CSD017
     A            #1AEINOK       1          TEXT('Account Export +
     A                                           Indicator')
     A            #1ACCYOK       1          TEXT('AML Analysis +
     A                                           Currency')
      **End of change CSD017
