      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_SN                                                        *
/*EXI *  TEXT('Midas SD File Extended Settle Ins - PAY')
      *****************************************************************
      *                                                               *
      *  Midas  Standing data Module                                  *
      *                                                               *
      *    PF/SDESFPPD - Midas SD FILE EXTENDED SETTLE INS - PAY      *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 25Nov05               *
      *                 CLE031             Date 26Apr05               *
      *                 CDL018             Date 03Feb04               *
      *                 CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CAP002  *Create    Date 17Mar98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CLE031 - Lending Enhancements - Settlement Currency          *
      *  CDL018 - Multiple Settlement Accounts on Loans/Deposit       *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
 
     A          R SDESFPD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            FLPSTM         2S 0       TEXT('Pay - Settlement Meth')
     A**Start of change CGL029
     A**********  FLPONS        12A         TEXT('Pay - Our Nostro')                          CGL029
     A            FLPONS        18A         TEXT('Pay - Our Nostro')
     A**End of change CGL029
     A            FLPIBN         8A         TEXT('Pay - Intermediary Bank')
     A            FLPIBA        35A         TEXT('Pay - I/m Bank A/c Line')
      * Begin /CSD027/
     A**********  FLPOBN         6S 0       TEXT('Pay - Ordering Bank')                       CSD027
     A            FLPOBN         6A         TEXT('Pay - Ordering Bank')
      * End /CSD027/
      * Begin /CSD027/
     A**********  FLPOCN         6S 0       TEXT('Pay - Ordering Cust')                       CSD027
     A            FLPOCN         6A         TEXT('Pay - Ordering Cust')
      * End /CSD027/
     A            FLRCRN         8A         TEXT('Receiver Corr.')
     A            FLRCRA        35A         TEXT('Receiver Corr. A/c Line')
     A            FLRVNO         8A         TEXT('Receiver number')
     A            FLAWBN         8A         TEXT('A/c With Bank')
     A            FLAWBA        35A         TEXT('A/c With Bank Line')
     A            FLBENN         8A         TEXT('Beneficiary')
     A            FLBENA        35A         TEXT('Beneficiary A/c Line')
     A            FLDTP1        35A         TEXT('Details of Payment 1')
     A            FLDTP2        35A         TEXT('Details of Payment 2')
     A            FLDTP3        35A         TEXT('Details of Payment 3')
     A            FLDTP4        35A         TEXT('Details of Payment 4')
     A            FLDCHG         3A         TEXT('Details of charges')
     A            FLBTB1        35A         TEXT('Bank to Bank Info. 1')
     A            FLBTB2        35A         TEXT('Bank to Bank Info. 2')
     A            FLBTB3        35A         TEXT('Bank to Bank Info. 3')
     A            FLBTB4        35A         TEXT('Bank to Bank Info. 4')
     A            FLBTB5        35A         TEXT('Bank to Bank Info. 5')
     A            FLBTB6        35A         TEXT('Bank to Bank Info. 6')
     A            FLPOBR         3A         TEXT('Our Pay Branch')
     A            FLCVMR         1          TEXT('Cover MT202 required')
 
     A            FLPSCY    R               REFFLD(CCY)
                                            TEXT('Pay - Settlement +
                                                  Currency')
                                            COLHDG('Pay' 'Sett' 'Curr')
 
     A            FLIC72    R               REFFLD(CCY)
                                            TEXT('''In'' Currency in +
                                                  Field 72')
                                            COLHDG('In Ccy' 'In' 'Field 72')
 
      **Start of change CDL018
     A            FLPMAC         1A         TEXT('Pay - More A/C')
     A                                      COLHDG('Pay' 'More A/C')
      **End of change CDL018
      * Start /CLE031/
     A            FLPEXR        13P 8       TEXT('Pay Ccy Exchange Rate')
     A                                      COLHDG('Pay Ccy' 'Exchange' 'Rate')
     A            FLPEXI         1A         TEXT('Pay Ccy Exchange Rate Ind.')
     A                                      COLHDG('Pay' 'Exch' 'Ind')
      * End /CLE031/
