      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD FTP/Transmission/Output')                     *
      *****************************************************************
      *                                                               *
      *  Midas SWIFT Direct Link                                      *
      *                                                               *
      *  PF/SDFTTOPD - FTP/Transmission/Output                        *
      *                                                               *
      *  (c) Finastra International Limited 2019                      *
      *                                                               *
      *  Last Amend No. MD053437  *CREATE  Date 07Oct19               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD053437 - CGL013 FTP exit program                           *
      *                                                               *
      *****************************************************************
      *
     A          R SDFTPOD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2019')
      *
     A            SIFTPI       256          TEXT('FTP subcommand')
