      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Normal FATCA Customers Classfn Upd')          *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data ILE Module                             *
      *                                                               *
      *  PF/SDNACUPD - Normal FATCA Customers Classification Update   *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2013            *
      *                                                               *
      *  Last Amend No. CGL132  *CREATE    Date 01May13               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGL132 - FATCA Phase 1 - Customer's Identification           *
      *                      and Classification                       *
      *                                                               *
      *****************************************************************
     A          R SDNACUD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2013')
      *
      ** Customer Number
      *
     A            NCCUST         6A         TEXT('Customer Number')
     A                                      COLHDG('Cust No.')
      *
      ** Non-Account Holder Reference
      *
     A            NCNAHO        10A         TEXT('NAHO Reference')
     A                                      COLHDG('NAHO Ref.')
      *
      ** Report Name
      *
     A            NCRPNM        20A         TEXT('Report Name')
     A                                      COLHDG('Rept Name')
      *
      ** Report Town
      *
     A            NCRPTN        10A         TEXT('Report Town')
     A                                      COLHDG('Rept Town')
      *
      ** High Value Indicator
      *
     A            NCHVAC         1A         TEXT('High Value Acct?')
     A                                      COLHDG('High Value?')
      *
      ** New Classification Code
      *
     A            NCNCLS         5A         TEXT('New Classfn Code')
     A                                      COLHDG('New Classfn')
      *
      ** New Classification Code Description
      *
     A            NCNCLD        50A         TEXT('New Classfn Desc')
     A                                      COLHDG('New Classfn Desc')
      *
      ** Current Classification Code
      *
     A            NCCCLS         5A         TEXT('Curr Classfn Code')
     A                                      COLHDG('Curr Classfn')
      *
      ** Current Classification Code Description
      *
     A            NCCCLD        50A         TEXT('Curr Classfn Desc')
     A                                      COLHDG('Curr Classfn Desc')
      *
      ** FATCA Information Complete Flag
      *
     A            NCINFC         1A         TEXT('FATCA Info Complt?')
     A                                      COLHDG('FATCA Info Complt?')
      *****************************************************************
