      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Nostro Codes extra data layout file')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data ILE Module
      *                                                               *
      *  PF/SDNVEXPD  - Nostro Codes extra data layout file           *
      *                                                               *
      *  (c) Finastra International Limited 2006                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Prev Amend No. CRE026  *CREATE    Date 24May06               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CRE026 - Consumer Banking                                    *
      *                                                               *
      *****************************************************************
      *
     A                                      REF(MFRFL)
     A          R SDNVEXD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2006')
      *
     A            APNARV        50          TEXT('Narrative Text')
                                            COLHDG('Narrative Text')
