      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD API Cust Trade Innov Interface detfile')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data ILE Module                             *
      *                                                               *
      *  SDTICDPD - API Incoming Message Definition File for          *
      *             Customer Trade Innovation Interface details       *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2006            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Last Amend No. CSD079  *CREATE    Date 05Feb07               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD079 - Enhanced Customer Maintenance API                   *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R SDTICDD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2006')
      *
     A            DDACTN         1          TEXT('Action code')
     A                                      COLHDG('Action' 'code')
      *
     A            DDCFXC         6          TEXT('Charge FX Rate Code')
     A                                      COLHDG('Charge' 'FX Rate' 'Code')
      *
     A            DDPFXC         6          TEXT('Principal FX Rate Code')
     A                                      COLHDG('Principal' 'FX Rate' +
     A                                              'Code')
      *
     A            DDETIT         1          TEXT('Exempt From TF Taxes')
     A                                      COLHDG('Exempt' 'From TF' 'Taxes')
      *
     A            DDSALU        35          TEXT('Salutation')
     A                                      COLHDG('Salutation')
      *
     A            DDTELX        20          TEXT('Telex')
     A                                      COLHDG('Telex')
      *
     A            DDTXAB         8          TEXT('Telex Answer Back')
     A                                      COLHDG('Telex' 'Answer' 'Back')
      *
     A            DDFXNO        20          TEXT('Fax')
     A                                      COLHDG('Fax')
      *
     A            DDZPCD        10          TEXT('Zip code')
     A                                      COLHDG('Zip code')
      *
     A            DDTRFM         2          TEXT('TI Transfer Method')
     A                                      COLHDG('TI' 'Transfer' 'Method')
      *
     A            DDDLNG         2          TEXT('Default Language')
     A                                      COLHDG('Default' 'Language')
      *
     A            DDANAL         2          TEXT('Analysis Code')
     A                                      COLHDG('Analysis' 'Code')
      *
     A            DDMLBR         3          TEXT('Mail to Branch Code')
     A                                      COLHDG('Mail to' 'Branch' 'Code')
      *
