      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas RP Internal and external repair queue')
      *****************************************************************
      *                                                               *
      *  Midas - Replication Module                                   *
      *                                                               *
      *  PF/RPREPQPD - Internal and External Queue                    *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CPB010  *CREATE    Date 06Jan03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CPB010 - Avoid DB Error by write message in Repair File      *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R RPREPQD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
      *
     A            RPINIQ        48A         TEXT('Internal Queue')
     A                                      COLHDG('Internal Queue')
      *
     A            RPOUTQ        48A         TEXT('External Queue')
     A                                      COLHDG('External Queue')
