      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_NM                                                        *
/*EXI *  TEXT('Midas PB Sys prefix not receiving invalid')
      *****************************************************************
      *                                                               *
      *  Midas - Replication                                          *
      *                                                               *
      *  PF/RPSYRFPD - System prefix not receiving Refused            *
      *                Invalid Transactions.                          *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. 215336  *CREATE    Date 21Mar03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  215336 - Avoid send back of transaction in repair (action    *
      *           code is 'Q') when not originated by TOF             *
      *           (i.e. CityDealer)                                   *
      *                                                               *
      *****************************************************************
     A          R RPSYRFF0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
      *
     A            RSPREF        10A         TEXT('System Prefix')
     A                                      COLHDG('System' +
     A                                             'Prefix')
     A            RSNAME        40A         TEXT('System Name')
     A                                      COLHDG('System' +
     A                                             'Name')
