      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GP Dummy access object data structure')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/DS2000DY - 2000 Character Data Structure (Access Objects) *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CPK018  *MOVED    Date 26Jan04                *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CSW005             Date 14FEB97               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CPK018 - MidasPlus packaging.  Moved from zone.              *
      *  CSW005 - New file created to act as an external data         *
      *           structure definition for access objects built       *
      *           over files with a record length of 801 to 2000.     *
      *                                                               *
      *****************************************************************
     A          R DS2000D0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            FLD1         200A         TEXT('DUMMY FIELD')
     A            FLD2         200A         TEXT('DUMMY FIELD')
     A            FLD3         200A         TEXT('DUMMY FIELD')
     A            FLD4         200A         TEXT('DUMMY FIELD')
     A            FLD5         200A         TEXT('DUMMY FIELD')
     A            FLD6         200A         TEXT('DUMMY FIELD')
     A            FLD7         200A         TEXT('DUMMY FIELD')
     A            FLD8         200A         TEXT('DUMMY FIELD')
     A            FLD9         200A         TEXT('DUMMY FIELD')
     A            FLD0         200A         TEXT('DUMMY FIELD')
