      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GP BSPL Branches')
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  PF/GPBSPLBPD - BSPL Branches                                 *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2005            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGP010  *CREATE    Date 17Jan05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGP010 - Global BSPL                                         *
      *                                                               *
      *****************************************************************
      *
     A                                      UNIQUE
     A          R GPBSPLBD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2005')
      *
     A            A8BRCD         3          TEXT('Branch code')
     A                                      COLHDG('Branch' 'code' )
     A            BREXT1         1          TEXT('Extract 1')
     A                                      COLHDG('Extract' '1' )
     A            BREXT2         1          TEXT('Extract 2')
     A                                      COLHDG('Extract' '2' )
     A          K A8BRCD
