      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GP Arrays of event data')
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  PF/GPEVDTPD - Arrays of Event Data                           *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGP001  *CREATE    Date 23May03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGP001 - Global Processing                                   *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R GPEVDTP0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
      *
     A            #DT001         5S 0       TEXT('Date Number 001')
     A            #DT002         5S 0       TEXT('Date Number 002')
     A            #DT003         5S 0       TEXT('Date Number 003')
     A            #DT004         5S 0       TEXT('Date Number 004')
     A            #DT005         5S 0       TEXT('Date Number 005')
     A            #DT006         5S 0       TEXT('Date Number 006')
     A            #DT007         5S 0       TEXT('Date Number 007')
     A            #DT008         5S 0       TEXT('Date Number 008')
     A            #DT009         5S 0       TEXT('Date Number 009')
     A            #DT010         5S 0       TEXT('Date Number 010')
     A            #DT011         5S 0       TEXT('Date Number 011')
     A            #DT012         5S 0       TEXT('Date Number 012')
     A            #DT013         5S 0       TEXT('Date Number 013')
     A            #DT014         5S 0       TEXT('Date Number 014')
     A            #DT015         5S 0       TEXT('Date Number 015')
     A            #DT016         5S 0       TEXT('Date Number 016')
     A            #DT017         5S 0       TEXT('Date Number 017')
     A            #DT018         5S 0       TEXT('Date Number 018')
     A            #DT019         5S 0       TEXT('Date Number 019')
     A            #DT020         5S 0       TEXT('Date Number 020')
     A            #DT021         5S 0       TEXT('Date Number 021')
     A            #DT022         5S 0       TEXT('Date Number 022')
     A            #DT023         5S 0       TEXT('Date Number 023')
     A            #DT024         5S 0       TEXT('Date Number 024')
     A            #DT025         5S 0       TEXT('Date Number 025')
     A            #DT026         5S 0       TEXT('Date Number 026')
     A            #DT027         5S 0       TEXT('Date Number 027')
     A            #DT028         5S 0       TEXT('Date Number 028')
     A            #DT029         5S 0       TEXT('Date Number 029')
     A            #DT030         5S 0       TEXT('Date Number 030')
     A            #DT031         5S 0       TEXT('Date Number 031')
     A            #DT032         5S 0       TEXT('Date Number 032')
     A            #DT033         5S 0       TEXT('Date Number 033')
     A            #DT034         5S 0       TEXT('Date Number 034')
     A            #DT035         5S 0       TEXT('Date Number 035')
     A            #DT036         5S 0       TEXT('Date Number 036')
     A            #DT037         5S 0       TEXT('Date Number 037')
     A            #DT038         5S 0       TEXT('Date Number 038')
     A            #DT039         5S 0       TEXT('Date Number 039')
     A            #DT040         5S 0       TEXT('Date Number 040')
     A            #DT041         5S 0       TEXT('Date Number 041')
     A            #DT042         5S 0       TEXT('Date Number 042')
     A            #DT043         5S 0       TEXT('Date Number 043')
     A            #DT044         5S 0       TEXT('Date Number 044')
     A            #DT045         5S 0       TEXT('Date Number 045')
     A            #DT046         5S 0       TEXT('Date Number 046')
     A            #DT047         5S 0       TEXT('Date Number 047')
     A            #DT048         5S 0       TEXT('Date Number 048')
     A            #DT049         5S 0       TEXT('Date Number 049')
     A            #DT050         5S 0       TEXT('Date Number 050')
     A            #DT051         5S 0       TEXT('Date Number 051')
     A            #DT052         5S 0       TEXT('Date Number 052')
     A            #DT053         5S 0       TEXT('Date Number 053')
     A            #DT054         5S 0       TEXT('Date Number 054')
     A            #DT055         5S 0       TEXT('Date Number 055')
     A            #DT056         5S 0       TEXT('Date Number 056')
     A            #DT057         5S 0       TEXT('Date Number 057')
     A            #DT058         5S 0       TEXT('Date Number 058')
     A            #DT059         5S 0       TEXT('Date Number 059')
     A            #DT060         5S 0       TEXT('Date Number 060')
     A            #DT061         5S 0       TEXT('Date Number 061')
     A            #DT062         5S 0       TEXT('Date Number 062')
     A            #DT063         5S 0       TEXT('Date Number 063')
     A            #DT064         5S 0       TEXT('Date Number 064')
     A            #DT065         5S 0       TEXT('Date Number 065')
     A            #DT066         5S 0       TEXT('Date Number 066')
     A            #DT067         5S 0       TEXT('Date Number 067')
     A            #DT068         5S 0       TEXT('Date Number 068')
     A            #DT069         5S 0       TEXT('Date Number 069')
     A            #DT070         5S 0       TEXT('Date Number 070')
     A            #DT071         5S 0       TEXT('Date Number 071')
     A            #DT072         5S 0       TEXT('Date Number 072')
     A            #DT073         5S 0       TEXT('Date Number 073')
     A            #DT074         5S 0       TEXT('Date Number 074')
     A            #DT075         5S 0       TEXT('Date Number 075')
     A            #DT076         5S 0       TEXT('Date Number 076')
     A            #DT077         5S 0       TEXT('Date Number 077')
     A            #DT078         5S 0       TEXT('Date Number 078')
     A            #DT079         5S 0       TEXT('Date Number 079')
     A            #DT080         5S 0       TEXT('Date Number 080')
     A            #DT081         5S 0       TEXT('Date Number 081')
     A            #DT082         5S 0       TEXT('Date Number 082')
     A            #DT083         5S 0       TEXT('Date Number 083')
     A            #DT084         5S 0       TEXT('Date Number 084')
     A            #DT085         5S 0       TEXT('Date Number 085')
     A            #DT086         5S 0       TEXT('Date Number 086')
     A            #DT087         5S 0       TEXT('Date Number 087')
     A            #DT088         5S 0       TEXT('Date Number 088')
     A            #DT089         5S 0       TEXT('Date Number 089')
     A            #DT090         5S 0       TEXT('Date Number 090')
     A            #DT091         5S 0       TEXT('Date Number 091')
     A            #DT092         5S 0       TEXT('Date Number 092')
     A            #DT093         5S 0       TEXT('Date Number 093')
     A            #DT094         5S 0       TEXT('Date Number 094')
     A            #DT095         5S 0       TEXT('Date Number 095')
     A            #DT096         5S 0       TEXT('Date Number 096')
     A            #DT097         5S 0       TEXT('Date Number 097')
     A            #DT098         5S 0       TEXT('Date Number 098')
     A            #DT099         5S 0       TEXT('Date Number 099')
     A            #DT100         5S 0       TEXT('Date Number 100')
     A            #DT101         5S 0       TEXT('Date Number 101')
     A            #DT102         5S 0       TEXT('Date Number 102')
     A            #DT103         5S 0       TEXT('Date Number 103')
     A            #DT104         5S 0       TEXT('Date Number 104')
     A            #DT105         5S 0       TEXT('Date Number 105')
     A            #DT106         5S 0       TEXT('Date Number 106')
     A            #DT107         5S 0       TEXT('Date Number 107')
     A            #DT108         5S 0       TEXT('Date Number 108')
     A            #DT109         5S 0       TEXT('Date Number 109')
     A            #DT110         5S 0       TEXT('Date Number 110')
     A            #DT111         5S 0       TEXT('Date Number 111')
     A            #DT112         5S 0       TEXT('Date Number 112')
     A            #DT113         5S 0       TEXT('Date Number 113')
     A            #DT114         5S 0       TEXT('Date Number 114')
     A            #DT115         5S 0       TEXT('Date Number 115')
     A            #DT116         5S 0       TEXT('Date Number 116')
     A            #DT117         5S 0       TEXT('Date Number 117')
     A            #DT118         5S 0       TEXT('Date Number 118')
     A            #DT119         5S 0       TEXT('Date Number 119')
     A            #DT120         5S 0       TEXT('Date Number 120')
     A            #DT121         5S 0       TEXT('Date Number 121')
     A            #DT122         5S 0       TEXT('Date Number 122')
     A            #DT123         5S 0       TEXT('Date Number 123')
     A            #DT124         5S 0       TEXT('Date Number 124')
     A            #DT125         5S 0       TEXT('Date Number 125')
     A            #DT126         5S 0       TEXT('Date Number 126')
     A            #DT127         5S 0       TEXT('Date Number 127')
     A            #DT128         5S 0       TEXT('Date Number 128')
     A            #DT129         5S 0       TEXT('Date Number 129')
     A            #DT130         5S 0       TEXT('Date Number 130')
     A            #DT131         5S 0       TEXT('Date Number 131')
     A            #DT132         5S 0       TEXT('Date Number 132')
     A            #DT133         5S 0       TEXT('Date Number 133')
     A            #DT134         5S 0       TEXT('Date Number 134')
     A            #DT135         5S 0       TEXT('Date Number 135')
     A            #DT136         5S 0       TEXT('Date Number 136')
     A            #DT137         5S 0       TEXT('Date Number 137')
     A            #DT138         5S 0       TEXT('Date Number 138')
     A            #DT139         5S 0       TEXT('Date Number 139')
     A            #DT140         5S 0       TEXT('Date Number 140')
     A            #DT141         5S 0       TEXT('Date Number 141')
     A            #DT142         5S 0       TEXT('Date Number 142')
     A            #DT143         5S 0       TEXT('Date Number 143')
     A            #DT144         5S 0       TEXT('Date Number 144')
     A            #DT145         5S 0       TEXT('Date Number 145')
     A            #DT146         5S 0       TEXT('Date Number 146')
     A            #DT147         5S 0       TEXT('Date Number 147')
     A            #DT148         5S 0       TEXT('Date Number 148')
     A            #DT149         5S 0       TEXT('Date Number 149')
     A            #DT150         5S 0       TEXT('Date Number 150')
     A            #DT151         5S 0       TEXT('Date Number 151')
     A            #DT152         5S 0       TEXT('Date Number 152')
     A            #DT153         5S 0       TEXT('Date Number 153')
     A            #DT154         5S 0       TEXT('Date Number 154')
     A            #DT155         5S 0       TEXT('Date Number 155')
     A            #DT156         5S 0       TEXT('Date Number 156')
     A            #DT157         5S 0       TEXT('Date Number 157')
     A            #DT158         5S 0       TEXT('Date Number 158')
     A            #DT159         5S 0       TEXT('Date Number 159')
     A            #DT160         5S 0       TEXT('Date Number 160')
     A            #DT161         5S 0       TEXT('Date Number 161')
     A            #DT162         5S 0       TEXT('Date Number 162')
     A            #DT163         5S 0       TEXT('Date Number 163')
     A            #DT164         5S 0       TEXT('Date Number 164')
     A            #DT165         5S 0       TEXT('Date Number 165')
     A            #DT166         5S 0       TEXT('Date Number 166')
     A            #DT167         5S 0       TEXT('Date Number 167')
     A            #DT168         5S 0       TEXT('Date Number 168')
     A            #DT169         5S 0       TEXT('Date Number 169')
     A            #DT170         5S 0       TEXT('Date Number 170')
     A            #DT171         5S 0       TEXT('Date Number 171')
     A            #DT172         5S 0       TEXT('Date Number 172')
     A            #DT173         5S 0       TEXT('Date Number 173')
     A            #DT174         5S 0       TEXT('Date Number 174')
     A            #DT175         5S 0       TEXT('Date Number 175')
     A            #DT176         5S 0       TEXT('Date Number 176')
     A            #DT177         5S 0       TEXT('Date Number 177')
     A            #DT178         5S 0       TEXT('Date Number 178')
     A            #DT179         5S 0       TEXT('Date Number 179')
     A            #DT180         5S 0       TEXT('Date Number 180')
     A            #DT181         5S 0       TEXT('Date Number 181')
     A            #DT182         5S 0       TEXT('Date Number 182')
     A            #DT183         5S 0       TEXT('Date Number 183')
     A            #DT184         5S 0       TEXT('Date Number 184')
     A            #DT185         5S 0       TEXT('Date Number 185')
     A            #DT186         5S 0       TEXT('Date Number 186')
     A            #DT187         5S 0       TEXT('Date Number 187')
     A            #DT188         5S 0       TEXT('Date Number 188')
     A            #DT189         5S 0       TEXT('Date Number 189')
     A            #DT190         5S 0       TEXT('Date Number 190')
     A            #DT191         5S 0       TEXT('Date Number 191')
     A            #DT192         5S 0       TEXT('Date Number 192')
     A            #DT193         5S 0       TEXT('Date Number 193')
     A            #DT194         5S 0       TEXT('Date Number 194')
     A            #DT195         5S 0       TEXT('Date Number 195')
     A            #DT196         5S 0       TEXT('Date Number 196')
     A            #DT197         5S 0       TEXT('Date Number 197')
     A            #DT198         5S 0       TEXT('Date Number 198')
     A            #DT199         5S 0       TEXT('Date Number 199')
     A            #DT200         5S 0       TEXT('Date Number 200')
     A            #DT201         5S 0       TEXT('Date Number 201')
     A            #DT202         5S 0       TEXT('Date Number 202')
     A            #DT203         5S 0       TEXT('Date Number 203')
     A            #DT204         5S 0       TEXT('Date Number 204')
     A            #DT205         5S 0       TEXT('Date Number 205')
     A            #DT206         5S 0       TEXT('Date Number 206')
     A            #DT207         5S 0       TEXT('Date Number 207')
     A            #DT208         5S 0       TEXT('Date Number 208')
     A            #DT209         5S 0       TEXT('Date Number 209')
     A            #DT210         5S 0       TEXT('Date Number 210')
     A            #DT211         5S 0       TEXT('Date Number 211')
     A            #DT212         5S 0       TEXT('Date Number 212')
     A            #DT213         5S 0       TEXT('Date Number 213')
     A            #DT214         5S 0       TEXT('Date Number 214')
     A            #DT215         5S 0       TEXT('Date Number 215')
     A            #DT216         5S 0       TEXT('Date Number 216')
     A            #DT217         5S 0       TEXT('Date Number 217')
     A            #DT218         5S 0       TEXT('Date Number 218')
     A            #DT219         5S 0       TEXT('Date Number 219')
     A            #DT220         5S 0       TEXT('Date Number 220')
     A            #DT221         5S 0       TEXT('Date Number 221')
     A            #DT222         5S 0       TEXT('Date Number 222')
     A            #DT223         5S 0       TEXT('Date Number 223')
     A            #DT224         5S 0       TEXT('Date Number 224')
     A            #DT225         5S 0       TEXT('Date Number 225')
     A            #DT226         5S 0       TEXT('Date Number 226')
     A            #DT227         5S 0       TEXT('Date Number 227')
     A            #DT228         5S 0       TEXT('Date Number 228')
     A            #DT229         5S 0       TEXT('Date Number 229')
     A            #DT230         5S 0       TEXT('Date Number 230')
     A            #DT231         5S 0       TEXT('Date Number 231')
     A            #DT232         5S 0       TEXT('Date Number 232')
     A            #DT233         5S 0       TEXT('Date Number 233')
     A            #DT234         5S 0       TEXT('Date Number 234')
     A            #DT235         5S 0       TEXT('Date Number 235')
     A            #DT236         5S 0       TEXT('Date Number 236')
     A            #DT237         5S 0       TEXT('Date Number 237')
     A            #DT238         5S 0       TEXT('Date Number 238')
     A            #DT239         5S 0       TEXT('Date Number 239')
     A            #DT240         5S 0       TEXT('Date Number 240')
     A            #DT241         5S 0       TEXT('Date Number 241')
     A            #DT242         5S 0       TEXT('Date Number 242')
     A            #DT243         5S 0       TEXT('Date Number 243')
     A            #DT244         5S 0       TEXT('Date Number 244')
     A            #DT245         5S 0       TEXT('Date Number 245')
     A            #DT246         5S 0       TEXT('Date Number 246')
     A            #DT247         5S 0       TEXT('Date Number 247')
     A            #DT248         5S 0       TEXT('Date Number 248')
     A            #DT249         5S 0       TEXT('Date Number 249')
     A            #DT250         5S 0       TEXT('Date Number 250')
     A            #DT251         5S 0       TEXT('Date Number 251')
     A            #DT252         5S 0       TEXT('Date Number 252')
     A            #DT253         5S 0       TEXT('Date Number 253')
     A            #DT254         5S 0       TEXT('Date Number 254')
     A            #DT255         5S 0       TEXT('Date Number 255')
     A            #DT256         5S 0       TEXT('Date Number 256')
     A            #DT257         5S 0       TEXT('Date Number 257')
     A            #DT258         5S 0       TEXT('Date Number 258')
     A            #DT259         5S 0       TEXT('Date Number 259')
     A            #DT260         5S 0       TEXT('Date Number 260')
     A            #DT261         5S 0       TEXT('Date Number 261')
     A            #DT262         5S 0       TEXT('Date Number 262')
     A            #DT263         5S 0       TEXT('Date Number 263')
     A            #DT264         5S 0       TEXT('Date Number 264')
     A            #DT265         5S 0       TEXT('Date Number 265')
     A            #DT266         5S 0       TEXT('Date Number 266')
     A            #DT267         5S 0       TEXT('Date Number 267')
     A            #DT268         5S 0       TEXT('Date Number 268')
     A            #DT269         5S 0       TEXT('Date Number 269')
     A            #DT270         5S 0       TEXT('Date Number 270')
     A            #DT271         5S 0       TEXT('Date Number 271')
     A            #DT272         5S 0       TEXT('Date Number 272')
     A            #DT273         5S 0       TEXT('Date Number 273')
     A            #DT274         5S 0       TEXT('Date Number 274')
     A            #DT275         5S 0       TEXT('Date Number 275')
     A            #DT276         5S 0       TEXT('Date Number 276')
     A            #DT277         5S 0       TEXT('Date Number 277')
     A            #DT278         5S 0       TEXT('Date Number 278')
     A            #DT279         5S 0       TEXT('Date Number 279')
     A            #DT280         5S 0       TEXT('Date Number 280')
     A            #DT281         5S 0       TEXT('Date Number 281')
     A            #DT282         5S 0       TEXT('Date Number 282')
     A            #DT283         5S 0       TEXT('Date Number 283')
     A            #DT284         5S 0       TEXT('Date Number 284')
     A            #DT285         5S 0       TEXT('Date Number 285')
     A            #DT286         5S 0       TEXT('Date Number 286')
     A            #DT287         5S 0       TEXT('Date Number 287')
     A            #DT288         5S 0       TEXT('Date Number 288')
     A            #DT289         5S 0       TEXT('Date Number 289')
     A            #DT290         5S 0       TEXT('Date Number 290')
     A            #DT291         5S 0       TEXT('Date Number 291')
     A            #DT292         5S 0       TEXT('Date Number 292')
     A            #DT293         5S 0       TEXT('Date Number 293')
     A            #DT294         5S 0       TEXT('Date Number 294')
     A            #DT295         5S 0       TEXT('Date Number 295')
     A            #DT296         5S 0       TEXT('Date Number 296')
     A            #DT297         5S 0       TEXT('Date Number 297')
     A            #DT298         5S 0       TEXT('Date Number 298')
     A            #DT299         5S 0       TEXT('Date Number 299')
     A            #DT300         5S 0       TEXT('Date Number 300')
     A            #DT301         5S 0       TEXT('Date Number 301')
     A            #DT302         5S 0       TEXT('Date Number 302')
     A            #DT303         5S 0       TEXT('Date Number 303')
     A            #DT304         5S 0       TEXT('Date Number 304')
     A            #DT305         5S 0       TEXT('Date Number 305')
     A            #DT306         5S 0       TEXT('Date Number 306')
     A            #DT307         5S 0       TEXT('Date Number 307')
     A            #DT308         5S 0       TEXT('Date Number 308')
     A            #DT309         5S 0       TEXT('Date Number 309')
     A            #DT310         5S 0       TEXT('Date Number 310')
     A            #DT311         5S 0       TEXT('Date Number 311')
     A            #DT312         5S 0       TEXT('Date Number 312')
     A            #DT313         5S 0       TEXT('Date Number 313')
     A            #DT314         5S 0       TEXT('Date Number 314')
     A            #DT315         5S 0       TEXT('Date Number 315')
     A            #DT316         5S 0       TEXT('Date Number 316')
     A            #DT317         5S 0       TEXT('Date Number 317')
     A            #DT318         5S 0       TEXT('Date Number 318')
     A            #DT319         5S 0       TEXT('Date Number 319')
     A            #DT320         5S 0       TEXT('Date Number 320')
     A            #DT321         5S 0       TEXT('Date Number 321')
     A            #DT322         5S 0       TEXT('Date Number 322')
     A            #DT323         5S 0       TEXT('Date Number 323')
     A            #DT324         5S 0       TEXT('Date Number 324')
     A            #DT325         5S 0       TEXT('Date Number 325')
     A            #DT326         5S 0       TEXT('Date Number 326')
     A            #DT327         5S 0       TEXT('Date Number 327')
     A            #DT328         5S 0       TEXT('Date Number 328')
     A            #DT329         5S 0       TEXT('Date Number 329')
     A            #DT330         5S 0       TEXT('Date Number 330')
     A            #DT331         5S 0       TEXT('Date Number 331')
     A            #DT332         5S 0       TEXT('Date Number 332')
     A            #DT333         5S 0       TEXT('Date Number 333')
     A            #DT334         5S 0       TEXT('Date Number 334')
     A            #DT335         5S 0       TEXT('Date Number 335')
     A            #DT336         5S 0       TEXT('Date Number 336')
     A            #DT337         5S 0       TEXT('Date Number 337')
     A            #DT338         5S 0       TEXT('Date Number 338')
     A            #DT339         5S 0       TEXT('Date Number 339')
     A            #DT340         5S 0       TEXT('Date Number 340')
     A            #DT341         5S 0       TEXT('Date Number 341')
     A            #DT342         5S 0       TEXT('Date Number 342')
     A            #DT343         5S 0       TEXT('Date Number 343')
     A            #DT344         5S 0       TEXT('Date Number 344')
     A            #DT345         5S 0       TEXT('Date Number 345')
     A            #DT346         5S 0       TEXT('Date Number 346')
     A            #DT347         5S 0       TEXT('Date Number 347')
     A            #DT348         5S 0       TEXT('Date Number 348')
     A            #DT349         5S 0       TEXT('Date Number 349')
     A            #DT350         5S 0       TEXT('Date Number 350')
     A            #DT351         5S 0       TEXT('Date Number 351')
     A            #DT352         5S 0       TEXT('Date Number 352')
     A            #DT353         5S 0       TEXT('Date Number 353')
     A            #DT354         5S 0       TEXT('Date Number 354')
     A            #DT355         5S 0       TEXT('Date Number 355')
     A            #DT356         5S 0       TEXT('Date Number 356')
     A            #DT357         5S 0       TEXT('Date Number 357')
     A            #DT358         5S 0       TEXT('Date Number 358')
     A            #DT359         5S 0       TEXT('Date Number 359')
     A            #DT360         5S 0       TEXT('Date Number 360')
      *
     A            #DA001        15A         TEXT('Data Number 001')
     A            #DA002        15A         TEXT('Data Number 002')
     A            #DA003        15A         TEXT('Data Number 003')
     A            #DA004        15A         TEXT('Data Number 004')
     A            #DA005        15A         TEXT('Data Number 005')
     A            #DA006        15A         TEXT('Data Number 006')
     A            #DA007        15A         TEXT('Data Number 007')
     A            #DA008        15A         TEXT('Data Number 008')
     A            #DA009        15A         TEXT('Data Number 009')
     A            #DA010        15A         TEXT('Data Number 010')
     A            #DA011        15A         TEXT('Data Number 011')
     A            #DA012        15A         TEXT('Data Number 012')
     A            #DA013        15A         TEXT('Data Number 013')
     A            #DA014        15A         TEXT('Data Number 014')
     A            #DA015        15A         TEXT('Data Number 015')
     A            #DA016        15A         TEXT('Data Number 016')
     A            #DA017        15A         TEXT('Data Number 017')
     A            #DA018        15A         TEXT('Data Number 018')
     A            #DA019        15A         TEXT('Data Number 019')
     A            #DA020        15A         TEXT('Data Number 020')
     A            #DA021        15A         TEXT('Data Number 021')
     A            #DA022        15A         TEXT('Data Number 022')
     A            #DA023        15A         TEXT('Data Number 023')
     A            #DA024        15A         TEXT('Data Number 024')
     A            #DA025        15A         TEXT('Data Number 025')
     A            #DA026        15A         TEXT('Data Number 026')
     A            #DA027        15A         TEXT('Data Number 027')
     A            #DA028        15A         TEXT('Data Number 028')
     A            #DA029        15A         TEXT('Data Number 029')
     A            #DA030        15A         TEXT('Data Number 030')
     A            #DA031        15A         TEXT('Data Number 031')
     A            #DA032        15A         TEXT('Data Number 032')
     A            #DA033        15A         TEXT('Data Number 033')
     A            #DA034        15A         TEXT('Data Number 034')
     A            #DA035        15A         TEXT('Data Number 035')
     A            #DA036        15A         TEXT('Data Number 036')
     A            #DA037        15A         TEXT('Data Number 037')
     A            #DA038        15A         TEXT('Data Number 038')
     A            #DA039        15A         TEXT('Data Number 039')
     A            #DA040        15A         TEXT('Data Number 040')
     A            #DA041        15A         TEXT('Data Number 041')
     A            #DA042        15A         TEXT('Data Number 042')
     A            #DA043        15A         TEXT('Data Number 043')
     A            #DA044        15A         TEXT('Data Number 044')
     A            #DA045        15A         TEXT('Data Number 045')
     A            #DA046        15A         TEXT('Data Number 046')
     A            #DA047        15A         TEXT('Data Number 047')
     A            #DA048        15A         TEXT('Data Number 048')
     A            #DA049        15A         TEXT('Data Number 049')
     A            #DA050        15A         TEXT('Data Number 050')
     A            #DA051        15A         TEXT('Data Number 051')
     A            #DA052        15A         TEXT('Data Number 052')
     A            #DA053        15A         TEXT('Data Number 053')
     A            #DA054        15A         TEXT('Data Number 054')
     A            #DA055        15A         TEXT('Data Number 055')
     A            #DA056        15A         TEXT('Data Number 056')
     A            #DA057        15A         TEXT('Data Number 057')
     A            #DA058        15A         TEXT('Data Number 058')
     A            #DA059        15A         TEXT('Data Number 059')
     A            #DA060        15A         TEXT('Data Number 060')
     A            #DA061        15A         TEXT('Data Number 061')
     A            #DA062        15A         TEXT('Data Number 062')
     A            #DA063        15A         TEXT('Data Number 063')
     A            #DA064        15A         TEXT('Data Number 064')
     A            #DA065        15A         TEXT('Data Number 065')
     A            #DA066        15A         TEXT('Data Number 066')
     A            #DA067        15A         TEXT('Data Number 067')
     A            #DA068        15A         TEXT('Data Number 068')
     A            #DA069        15A         TEXT('Data Number 069')
     A            #DA070        15A         TEXT('Data Number 070')
     A            #DA071        15A         TEXT('Data Number 071')
     A            #DA072        15A         TEXT('Data Number 072')
     A            #DA073        15A         TEXT('Data Number 073')
     A            #DA074        15A         TEXT('Data Number 074')
     A            #DA075        15A         TEXT('Data Number 075')
     A            #DA076        15A         TEXT('Data Number 076')
     A            #DA077        15A         TEXT('Data Number 077')
     A            #DA078        15A         TEXT('Data Number 078')
     A            #DA079        15A         TEXT('Data Number 079')
     A            #DA080        15A         TEXT('Data Number 080')
     A            #DA081        15A         TEXT('Data Number 081')
     A            #DA082        15A         TEXT('Data Number 082')
     A            #DA083        15A         TEXT('Data Number 083')
     A            #DA084        15A         TEXT('Data Number 084')
     A            #DA085        15A         TEXT('Data Number 085')
     A            #DA086        15A         TEXT('Data Number 086')
     A            #DA087        15A         TEXT('Data Number 087')
     A            #DA088        15A         TEXT('Data Number 088')
     A            #DA089        15A         TEXT('Data Number 089')
     A            #DA090        15A         TEXT('Data Number 090')
     A            #DA091        15A         TEXT('Data Number 091')
     A            #DA092        15A         TEXT('Data Number 092')
     A            #DA093        15A         TEXT('Data Number 093')
     A            #DA094        15A         TEXT('Data Number 094')
     A            #DA095        15A         TEXT('Data Number 095')
     A            #DA096        15A         TEXT('Data Number 096')
     A            #DA097        15A         TEXT('Data Number 097')
     A            #DA098        15A         TEXT('Data Number 098')
     A            #DA099        15A         TEXT('Data Number 099')
     A            #DA100        15A         TEXT('Data Number 100')
     A            #DA101        15A         TEXT('Data Number 101')
     A            #DA102        15A         TEXT('Data Number 102')
     A            #DA103        15A         TEXT('Data Number 103')
     A            #DA104        15A         TEXT('Data Number 104')
     A            #DA105        15A         TEXT('Data Number 105')
     A            #DA106        15A         TEXT('Data Number 106')
     A            #DA107        15A         TEXT('Data Number 107')
     A            #DA108        15A         TEXT('Data Number 108')
     A            #DA109        15A         TEXT('Data Number 109')
     A            #DA110        15A         TEXT('Data Number 110')
     A            #DA111        15A         TEXT('Data Number 111')
     A            #DA112        15A         TEXT('Data Number 112')
     A            #DA113        15A         TEXT('Data Number 113')
     A            #DA114        15A         TEXT('Data Number 114')
     A            #DA115        15A         TEXT('Data Number 115')
     A            #DA116        15A         TEXT('Data Number 116')
     A            #DA117        15A         TEXT('Data Number 117')
     A            #DA118        15A         TEXT('Data Number 118')
     A            #DA119        15A         TEXT('Data Number 119')
     A            #DA120        15A         TEXT('Data Number 120')
     A            #DA121        15A         TEXT('Data Number 121')
     A            #DA122        15A         TEXT('Data Number 122')
     A            #DA123        15A         TEXT('Data Number 123')
     A            #DA124        15A         TEXT('Data Number 124')
     A            #DA125        15A         TEXT('Data Number 125')
     A            #DA126        15A         TEXT('Data Number 126')
     A            #DA127        15A         TEXT('Data Number 127')
     A            #DA128        15A         TEXT('Data Number 128')
     A            #DA129        15A         TEXT('Data Number 129')
     A            #DA130        15A         TEXT('Data Number 130')
     A            #DA131        15A         TEXT('Data Number 131')
     A            #DA132        15A         TEXT('Data Number 132')
     A            #DA133        15A         TEXT('Data Number 133')
     A            #DA134        15A         TEXT('Data Number 134')
     A            #DA135        15A         TEXT('Data Number 135')
     A            #DA136        15A         TEXT('Data Number 136')
     A            #DA137        15A         TEXT('Data Number 137')
     A            #DA138        15A         TEXT('Data Number 138')
     A            #DA139        15A         TEXT('Data Number 139')
     A            #DA140        15A         TEXT('Data Number 140')
     A            #DA141        15A         TEXT('Data Number 141')
     A            #DA142        15A         TEXT('Data Number 142')
     A            #DA143        15A         TEXT('Data Number 143')
     A            #DA144        15A         TEXT('Data Number 144')
     A            #DA145        15A         TEXT('Data Number 145')
     A            #DA146        15A         TEXT('Data Number 146')
     A            #DA147        15A         TEXT('Data Number 147')
     A            #DA148        15A         TEXT('Data Number 148')
     A            #DA149        15A         TEXT('Data Number 149')
     A            #DA150        15A         TEXT('Data Number 150')
     A            #DA151        15A         TEXT('Data Number 151')
     A            #DA152        15A         TEXT('Data Number 152')
     A            #DA153        15A         TEXT('Data Number 153')
     A            #DA154        15A         TEXT('Data Number 154')
     A            #DA155        15A         TEXT('Data Number 155')
     A            #DA156        15A         TEXT('Data Number 156')
     A            #DA157        15A         TEXT('Data Number 157')
     A            #DA158        15A         TEXT('Data Number 158')
     A            #DA159        15A         TEXT('Data Number 159')
     A            #DA160        15A         TEXT('Data Number 160')
     A            #DA161        15A         TEXT('Data Number 161')
     A            #DA162        15A         TEXT('Data Number 162')
     A            #DA163        15A         TEXT('Data Number 163')
     A            #DA164        15A         TEXT('Data Number 164')
     A            #DA165        15A         TEXT('Data Number 165')
     A            #DA166        15A         TEXT('Data Number 166')
     A            #DA167        15A         TEXT('Data Number 167')
     A            #DA168        15A         TEXT('Data Number 168')
     A            #DA169        15A         TEXT('Data Number 169')
     A            #DA170        15A         TEXT('Data Number 170')
     A            #DA171        15A         TEXT('Data Number 171')
     A            #DA172        15A         TEXT('Data Number 172')
     A            #DA173        15A         TEXT('Data Number 173')
     A            #DA174        15A         TEXT('Data Number 174')
     A            #DA175        15A         TEXT('Data Number 175')
     A            #DA176        15A         TEXT('Data Number 176')
     A            #DA177        15A         TEXT('Data Number 177')
     A            #DA178        15A         TEXT('Data Number 178')
     A            #DA179        15A         TEXT('Data Number 179')
     A            #DA180        15A         TEXT('Data Number 180')
     A            #DA181        15A         TEXT('Data Number 181')
     A            #DA182        15A         TEXT('Data Number 182')
     A            #DA183        15A         TEXT('Data Number 183')
     A            #DA184        15A         TEXT('Data Number 184')
     A            #DA185        15A         TEXT('Data Number 185')
     A            #DA186        15A         TEXT('Data Number 186')
     A            #DA187        15A         TEXT('Data Number 187')
     A            #DA188        15A         TEXT('Data Number 188')
     A            #DA189        15A         TEXT('Data Number 189')
     A            #DA190        15A         TEXT('Data Number 190')
     A            #DA191        15A         TEXT('Data Number 191')
     A            #DA192        15A         TEXT('Data Number 192')
     A            #DA193        15A         TEXT('Data Number 193')
     A            #DA194        15A         TEXT('Data Number 194')
     A            #DA195        15A         TEXT('Data Number 195')
     A            #DA196        15A         TEXT('Data Number 196')
     A            #DA197        15A         TEXT('Data Number 197')
     A            #DA198        15A         TEXT('Data Number 198')
     A            #DA199        15A         TEXT('Data Number 199')
     A            #DA200        15A         TEXT('Data Number 200')
     A            #DA201        15A         TEXT('Data Number 201')
     A            #DA202        15A         TEXT('Data Number 202')
     A            #DA203        15A         TEXT('Data Number 203')
     A            #DA204        15A         TEXT('Data Number 204')
     A            #DA205        15A         TEXT('Data Number 205')
     A            #DA206        15A         TEXT('Data Number 206')
     A            #DA207        15A         TEXT('Data Number 207')
     A            #DA208        15A         TEXT('Data Number 208')
     A            #DA209        15A         TEXT('Data Number 209')
     A            #DA210        15A         TEXT('Data Number 210')
     A            #DA211        15A         TEXT('Data Number 211')
     A            #DA212        15A         TEXT('Data Number 212')
     A            #DA213        15A         TEXT('Data Number 213')
     A            #DA214        15A         TEXT('Data Number 214')
     A            #DA215        15A         TEXT('Data Number 215')
     A            #DA216        15A         TEXT('Data Number 216')
     A            #DA217        15A         TEXT('Data Number 217')
     A            #DA218        15A         TEXT('Data Number 218')
     A            #DA219        15A         TEXT('Data Number 219')
     A            #DA220        15A         TEXT('Data Number 220')
     A            #DA221        15A         TEXT('Data Number 221')
     A            #DA222        15A         TEXT('Data Number 222')
     A            #DA223        15A         TEXT('Data Number 223')
     A            #DA224        15A         TEXT('Data Number 224')
     A            #DA225        15A         TEXT('Data Number 225')
     A            #DA226        15A         TEXT('Data Number 226')
     A            #DA227        15A         TEXT('Data Number 227')
     A            #DA228        15A         TEXT('Data Number 228')
     A            #DA229        15A         TEXT('Data Number 229')
     A            #DA230        15A         TEXT('Data Number 230')
     A            #DA231        15A         TEXT('Data Number 231')
     A            #DA232        15A         TEXT('Data Number 232')
     A            #DA233        15A         TEXT('Data Number 233')
     A            #DA234        15A         TEXT('Data Number 234')
     A            #DA235        15A         TEXT('Data Number 235')
     A            #DA236        15A         TEXT('Data Number 236')
     A            #DA237        15A         TEXT('Data Number 237')
     A            #DA238        15A         TEXT('Data Number 238')
     A            #DA239        15A         TEXT('Data Number 239')
     A            #DA240        15A         TEXT('Data Number 240')
     A            #DA241        15A         TEXT('Data Number 241')
     A            #DA242        15A         TEXT('Data Number 242')
     A            #DA243        15A         TEXT('Data Number 243')
     A            #DA244        15A         TEXT('Data Number 244')
     A            #DA245        15A         TEXT('Data Number 245')
     A            #DA246        15A         TEXT('Data Number 246')
     A            #DA247        15A         TEXT('Data Number 247')
     A            #DA248        15A         TEXT('Data Number 248')
     A            #DA249        15A         TEXT('Data Number 249')
     A            #DA250        15A         TEXT('Data Number 250')
     A            #DA251        15A         TEXT('Data Number 251')
     A            #DA252        15A         TEXT('Data Number 252')
     A            #DA253        15A         TEXT('Data Number 253')
     A            #DA254        15A         TEXT('Data Number 254')
     A            #DA255        15A         TEXT('Data Number 255')
     A            #DA256        15A         TEXT('Data Number 256')
     A            #DA257        15A         TEXT('Data Number 257')
     A            #DA258        15A         TEXT('Data Number 258')
     A            #DA259        15A         TEXT('Data Number 259')
     A            #DA260        15A         TEXT('Data Number 260')
     A            #DA261        15A         TEXT('Data Number 261')
     A            #DA262        15A         TEXT('Data Number 262')
     A            #DA263        15A         TEXT('Data Number 263')
     A            #DA264        15A         TEXT('Data Number 264')
     A            #DA265        15A         TEXT('Data Number 265')
     A            #DA266        15A         TEXT('Data Number 266')
     A            #DA267        15A         TEXT('Data Number 267')
     A            #DA268        15A         TEXT('Data Number 268')
     A            #DA269        15A         TEXT('Data Number 269')
     A            #DA270        15A         TEXT('Data Number 270')
     A            #DA271        15A         TEXT('Data Number 271')
     A            #DA272        15A         TEXT('Data Number 272')
     A            #DA273        15A         TEXT('Data Number 273')
     A            #DA274        15A         TEXT('Data Number 274')
     A            #DA275        15A         TEXT('Data Number 275')
     A            #DA276        15A         TEXT('Data Number 276')
     A            #DA277        15A         TEXT('Data Number 277')
     A            #DA278        15A         TEXT('Data Number 278')
     A            #DA279        15A         TEXT('Data Number 279')
     A            #DA280        15A         TEXT('Data Number 280')
     A            #DA281        15A         TEXT('Data Number 281')
     A            #DA282        15A         TEXT('Data Number 282')
     A            #DA283        15A         TEXT('Data Number 283')
     A            #DA284        15A         TEXT('Data Number 284')
     A            #DA285        15A         TEXT('Data Number 285')
     A            #DA286        15A         TEXT('Data Number 286')
     A            #DA287        15A         TEXT('Data Number 287')
     A            #DA288        15A         TEXT('Data Number 288')
     A            #DA289        15A         TEXT('Data Number 289')
     A            #DA290        15A         TEXT('Data Number 290')
     A            #DA291        15A         TEXT('Data Number 291')
     A            #DA292        15A         TEXT('Data Number 292')
     A            #DA293        15A         TEXT('Data Number 293')
     A            #DA294        15A         TEXT('Data Number 294')
     A            #DA295        15A         TEXT('Data Number 295')
     A            #DA296        15A         TEXT('Data Number 296')
     A            #DA297        15A         TEXT('Data Number 297')
     A            #DA298        15A         TEXT('Data Number 298')
     A            #DA299        15A         TEXT('Data Number 299')
     A            #DA300        15A         TEXT('Data Number 300')
     A            #DA301        15A         TEXT('Data Number 301')
     A            #DA302        15A         TEXT('Data Number 302')
     A            #DA303        15A         TEXT('Data Number 303')
     A            #DA304        15A         TEXT('Data Number 304')
     A            #DA305        15A         TEXT('Data Number 305')
     A            #DA306        15A         TEXT('Data Number 306')
     A            #DA307        15A         TEXT('Data Number 307')
     A            #DA308        15A         TEXT('Data Number 308')
     A            #DA309        15A         TEXT('Data Number 309')
     A            #DA310        15A         TEXT('Data Number 310')
     A            #DA311        15A         TEXT('Data Number 311')
     A            #DA312        15A         TEXT('Data Number 312')
     A            #DA313        15A         TEXT('Data Number 313')
     A            #DA314        15A         TEXT('Data Number 314')
     A            #DA315        15A         TEXT('Data Number 315')
     A            #DA316        15A         TEXT('Data Number 316')
     A            #DA317        15A         TEXT('Data Number 317')
     A            #DA318        15A         TEXT('Data Number 318')
     A            #DA319        15A         TEXT('Data Number 319')
     A            #DA320        15A         TEXT('Data Number 320')
     A            #DA321        15A         TEXT('Data Number 321')
     A            #DA322        15A         TEXT('Data Number 322')
     A            #DA323        15A         TEXT('Data Number 323')
     A            #DA324        15A         TEXT('Data Number 324')
     A            #DA325        15A         TEXT('Data Number 325')
     A            #DA326        15A         TEXT('Data Number 326')
     A            #DA327        15A         TEXT('Data Number 327')
     A            #DA328        15A         TEXT('Data Number 328')
     A            #DA329        15A         TEXT('Data Number 329')
     A            #DA330        15A         TEXT('Data Number 330')
     A            #DA331        15A         TEXT('Data Number 331')
     A            #DA332        15A         TEXT('Data Number 332')
     A            #DA333        15A         TEXT('Data Number 333')
     A            #DA334        15A         TEXT('Data Number 334')
     A            #DA335        15A         TEXT('Data Number 335')
     A            #DA336        15A         TEXT('Data Number 336')
     A            #DA337        15A         TEXT('Data Number 337')
     A            #DA338        15A         TEXT('Data Number 338')
     A            #DA339        15A         TEXT('Data Number 339')
     A            #DA340        15A         TEXT('Data Number 340')
     A            #DA341        15A         TEXT('Data Number 341')
     A            #DA342        15A         TEXT('Data Number 342')
     A            #DA343        15A         TEXT('Data Number 343')
     A            #DA344        15A         TEXT('Data Number 344')
     A            #DA345        15A         TEXT('Data Number 345')
     A            #DA346        15A         TEXT('Data Number 346')
     A            #DA347        15A         TEXT('Data Number 347')
     A            #DA348        15A         TEXT('Data Number 348')
     A            #DA349        15A         TEXT('Data Number 349')
     A            #DA350        15A         TEXT('Data Number 350')
     A            #DA351        15A         TEXT('Data Number 351')
     A            #DA352        15A         TEXT('Data Number 352')
     A            #DA353        15A         TEXT('Data Number 353')
     A            #DA354        15A         TEXT('Data Number 354')
     A            #DA355        15A         TEXT('Data Number 355')
     A            #DA356        15A         TEXT('Data Number 356')
     A            #DA357        15A         TEXT('Data Number 357')
     A            #DA358        15A         TEXT('Data Number 358')
     A            #DA359        15A         TEXT('Data Number 359')
     A            #DA360        15A         TEXT('Data Number 360')
