      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GP Field reference file original refs 1')
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  PF/GPFRF1PD - Midas Field Reference Original Fields File 1   *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *  NOTE: This file is now static. All new core entries should   *
      *        be added to xxDTALIB/GPFRFCPD                          *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGL029             Date 01Sep03               *
      *  Prev Amend No. CPK018  *MOVED     Date 25Nov03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CSC006  *CREATE    Date 22MAY98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGL029 - Increase Account Code to 10 digits (Recompile).     *
      *  CPK018 - Moved to the global layer and renamed to GPFRF1PD.  *
      *  CSC006 - MIDASFRLIV closedown project:                       *
      *         - xxDTALIB/SCFRF1PD replaces this file:               *
      *           - MIDASFRLIV/MFRFZZ                                 *
      *                                                               *
      *****************************************************************
     A          R SCFRF1D0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            ##KEY          1          TEXT('DUMMY KEY')
     A            ZZ001          1A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ002          2A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ003          3A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ004          4A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ005          5A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ006          6A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ007          7A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ008          8A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ009          9A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ010         10A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ011         11A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ012         12A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ013         13A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ014         14A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ015         15A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ016         16A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ017         17A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ018         18A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ019         19A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ020         20A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ021         21A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ022         22A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ023         23A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ024         24A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ025         25A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ026         26A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ027         27A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ028         28A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ029         29A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ030         30A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ031         31A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ032         32A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ033         33A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ034         34A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ035         35A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ036         36A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ037         37A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ038         38A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ039         39A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ040         40A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ041         41A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ042         42A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ043         43A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ044         44A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ045         45A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ046         46A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ047         47A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ048         48A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ049         49A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ050         50A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ051         51A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ052         52A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ053         53A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ054         54A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ055         55A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ056         56A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ057         57A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ058         58A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ059         59A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ060         60A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ061         61A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ062         62A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ063         63A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ064         64A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ065         65A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ066         66A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ067         67A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ068         68A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ069         69A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ070         70A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ071         71A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ072         72A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ073         73A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ074         74A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ075         75A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ076         76A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ077         77A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ078         78A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ079         79A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ080         80A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ081         81A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ082         82A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ083         83A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ084         84A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ085         85A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ086         86A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ087         87A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ088         88A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ089         89A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ090         90A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ091         91A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ092         92A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ093         93A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ094         94A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ095         95A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ096         96A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ097         97A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ098         98A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ099         99A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ100        100A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ101        101A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ102        102A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ103        103A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ104        104A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ105        105A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ106        106A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ107        107A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ108        108A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ109        109A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ110        110A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ111        111A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ112        112A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ113        113A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ114        114A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ115        115A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ116        116A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ117        117A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ118        118A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ119        119A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ120        120A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ121        121A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ122        122A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ123        123A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ124        124A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ125        125A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ126        126A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ127        127A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ128        128A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ129        129A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ130        130A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ131        131A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ132        132A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ133        133A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ134        134A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ135        135A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ136        136A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ137        137A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ138        138A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ139        139A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ140        140A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ141        141A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ142        142A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ143        143A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ144        144A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ145        145A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ146        146A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ147        147A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ148        148A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ149        149A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ150        150A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ151        151A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ152        152A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ153        153A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ154        154A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ155        155A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ156        156A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ157        157A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ158        158A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ159        159A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ160        160A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ161        161A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ162        162A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ163        163A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ164        164A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ165        165A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ166        166A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ167        167A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ168        168A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ169        169A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ170        170A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ171        171A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ172        172A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ173        173A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ174        174A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ175        175A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ176        176A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ177        177A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ178        178A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ179        179A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ180        180A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ181        181A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ182        182A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ183        183A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ184        184A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ185        185A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ186        186A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ187        187A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ188        188A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ189        189A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ190        190A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ191        191A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ192        192A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ193        193A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ194        194A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ195        195A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ196        196A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ197        197A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ198        198A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ199        199A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ200        200A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ201        201A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ202        202A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ203        203A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ204        204A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ205        205A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ206        206A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ207        207A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ208        208A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ209        209A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ210        210A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ211        211A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ212        212A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ213        213A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ214        214A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ215        215A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ216        216A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ217        217A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ218        218A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ219        219A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ220        220A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ221        221A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ222        222A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ223        223A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ224        224A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ225        225A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ226        226A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ227        227A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ228        228A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ229        229A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ230        230A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ231        231A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ232        232A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ233        233A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ234        234A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ235        235A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ236        236A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ237        237A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ238        238A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ239        239A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ240        240A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ241        241A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ242        242A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ243        243A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ244        244A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ245        245A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ246        246A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ247        247A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ248        248A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ249        249A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ250        250A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ251        251A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ252        252A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ253        253A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ254        254A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
     A            ZZ255        255A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
      *
      ** This file is now static - No further entries should be applied
      *
