      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_RU                                                        *
/*EXI *  TEXT('Midas GP Global Nostro Balances')                      *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  PF/GPNOSBPD - Global Nostro Balances                         *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      *  Last Amend No. CGP016  *MOVED     Date 06Aug12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CGP001  *CREATE    Date 23May03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGP016 - Global database - Re-use deleted records            *
      *         - Moved from GPDDSSRCGM                               *
      *  CGP001 - Global Processing                                   *
      *                                                               *
      *****************************************************************
      *
     A          R GPNOSBD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
      *
     A            NBBRCA         3          TEXT('Branch Code')
     A                                      COLHDG('Branch Code ')
     A            NBCCY          3          TEXT('Currency Code')
     A                                      COLHDG('Currency Code')
     A            NBNOSN         2          TEXT('Nostro Number')
     A                                      COLHDG('Nostro Number')
     A            NBBAL0        17P 0       TEXT('Balance 0')
     A                                      COLHDG('Balance 0')
     A            NBBAL1        17P 0       TEXT('Balance 1')
     A                                      COLHDG('Balance 1')
     A            NBBAL2        17P 0       TEXT('Balance 2')
     A                                      COLHDG('Balance 2')
     A            NBBAL3        17P 0       TEXT('Balance 3')
     A                                      COLHDG('Balance 3')
     A            NBBAL4        17P 0       TEXT('Balance 4')
     A                                      COLHDG('Balance 4')
     A            NBBAL5        17P 0       TEXT('Balance 5')
     A                                      COLHDG('Balance 5')
     A            NBBAL6        17P 0       TEXT('Balance 6')
     A                                      COLHDG('Balance 6')
     A            NBBAL7        17P 0       TEXT('Balance 7')
     A                                      COLHDG('Balance 7')
     A            NBBAL8        17P 0       TEXT('Balance 8')
     A                                      COLHDG('Balance 8')
     A            NBBAL9        17P 0       TEXT('Balance 9')
     A                                      COLHDG('Balance 9')
