      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_RU                                                        *
/*EXI *  TEXT('Midas GP Global postings')                             *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  PF/GPPOSTPD - Global Postings                                *
      *                                                               *
      *  (c) Finastra International Limited 2003                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CGP016             Date 06Aug12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CGP001  *CREATE    Date 23May03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGP016 - Global database - Re-use deleted records            *
      *         - Moved from GPDDSSRCGM                               *
      *  CGP001 - Global Processing                                   *
      *                                                               *
      *****************************************************************
     A          R GOPOSTD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2003')
      *
     A            C_ID          15S 0       TEXT('Identifier')
     A                                      COLHDG('Identifier')
      *
     A            C_TMOD         2A         TEXT('Transaction Module')
     A                                      COLHDG('Transaction' 'Module')
     A            C_TSMD         4A         TEXT('Transaction Sub-Module')
     A                                      COLHDG('Transaction' 'Sub-Module')
     A            C_TREF        20A         TEXT('Transaction Reference')
     A                                      COLHDG('Transaction' 'Reference')
      *
     A            C_PSTD         5P 0       TEXT('Posting Date')
     A                                      COLHDG('Posting' 'Date')
     A            C_VALD         5P 0       TEXT('Value Date')
     A                                      COLHDG('Value' 'Date')
     A            C_PNAR        30A         TEXT('Posting Narrative')
     A                                      COLHDG('Posting' 'Narrative')
     A            C_PSTA        13P 0       TEXT('Posting Amount')
     A                                      COLHDG('Posting' 'Amount')
     A            C_DRCR         1A         TEXT('Debit/Credit Indicator')
     A                                      COLHDG('Deb/Crd' 'Indicator')
     A            C_POST         1A         TEXT('Posted?')
     A                                      COLHDG('Posted?')
     A            C_CLER         1A         TEXT('Cleared?')
     A                                      COLHDG('Cleared?')
