      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GP Selected Accounts Temporary File')            *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  PF/GPSATPPD - Selected Accounts Temporary File               *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2011            *
      *                                                               *
      *  Last Amend No. AR719317 *CREATE   Date 19Jul11               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  AR719317 - Include T_GZAMADEX in ATU processing              *
      *                                                               *
      *****************************************************************
      *
     A          R GPSATPD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2011')
      *
     A            GPZONE        10A         TEXT('Zone')
     A                                      COLHDG('Zone')
     A            GPRFNO        10A         TEXT('Reference')
     A                                      COLHDG('Reference')
     A            GPFRAC        24A         TEXT('From Account')
     A                                      COLHDG('From Account')
     A            GPTOAC        24A         TEXT('To Account')
     A                                      COLHDG('To Account')
      *
