      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXI *  TEXT('Midas GP work file for passw migration')
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing                                    *
      *                                                               *
      *  PF/GPUPASPD - Work file for redundant GPPASSPD               *
      *                                                               *
      *  (c) Finastra International Limited 2021                      *
      *                                                               *
      *  Last Amend No. MD054346 *CREATE   Date 18Jul21               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD054346 - Switchable Features Password Encryption           *
      *                                                               *
      *****************************************************************
     A          R GPUPASD0
     A            PASS          16A         COLHDG('Password')
     A            P@SARN         6A         COLHDG('SF Number')
