      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas A9 Journal Feeder Details Record File')          *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  PF/A9FEEDDTD - Midas A9 Journal Feeder Details Record File   *
      *                 VLJ Format                                    *
      *                                                               *
      *  (c) Finastra International Limited 2024                      *
      *                                                               *
      *  Last Amend No. MD059406           Date 11Mar24               *
      *  Prev Amend No. BA9005  *CREATE    Date 11Mar24               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD059406 - Extract issues with Feeder and Proofing files     *
      *              Add new flag for Balances in Proofing file       *
      *  BA9005 - HO and EDW Extracts                                 *
      *                                                               *
      *****************************************************************
      *
     A          R A9FEEDDD0                 TEXT('(c) Finastra International -
     A                                      Limited 2024')
      *
     A            XXDDBID        3          TEXT('Journal Control Header')
     A                                      COLHDG('Journal' 'Control' 'Header')
     A            XXDVJCC        5          TEXT('Corporate Entity Code')
     A                                      COLHDG('Corporate' 'Entity' 'Code')
     A            XXDJRNID      10          TEXT('Journal Id')
     A                                      COLHDG('Journal' 'Id')
     A            XXDEFFD        8  0       TEXT('Effective Date')
     A                                      COLHDG('Effective' 'Date')
     A            XXDJRNSQ       5  0       TEXT('Journal Sequence')
     A                                      COLHDG('Journal' 'Seq')
     A            XXDGLMCP      44          TEXT('GLM Acc to post to')
     A                                      COLHDG('GLM' 'Acc' 'to post to')
     A            XXDCCYL        3          TEXT('Currency')
     A                                      COLHDG('Currency')
     A            XXDACOD       10          TEXT('Account Code')
     A                                      COLHDG('Account' 'Code')
     A            XXDRND         5  0       TEXT('Rundate')
     A                                      COLHDG('Rundate')
     A            XXDCSTS        1          TEXT('Constant S')
     A                                      COLHDG('Constant' 'S')
     A            XXDSLID        1          TEXT('Subledger Id')
     A                                      COLHDG('Subledger' 'Id')
     A            XXDSLAC       16          TEXT('Subledger Account')
     A                                      COLHDG('Subledger' 'Account')
     A            XXDSRCE       10          TEXT('Source')
     A                                      COLHDG('Source')
     A            XXDJRND       75          TEXT('Journal Description')
     A                                      COLHDG('Journal' 'Description')
     A            XXDCSTCY       2          TEXT('Constant CY')
     A                                      COLHDG('Constant' 'CY')
     A            XXDCSTCP       2          TEXT('Constant CP')
     A                                      COLHDG('Constant' 'CP')
     A            XXDDRCR        1          TEXT('Debit / Credit Indicator')
     A                                      COLHDG('DR/CR' 'Indicator')
     A            XXDLCBE       15  0       TEXT('Local Book Equivalent')
     A                                      COLHDG('Local' 'Book' 'Equivalent')
     A            XXDPSTA       15  0       TEXT('Posting Amount')
     A                                      COLHDG('Posting' 'Amount')
     A            XXDRATE       18          TEXT('Currency Convert Rate')
     A                                      COLHDG('CCY' 'Convert' 'Rate')
      ** Start MD059406
     A            XXDINBL        1          TEXT('Include Balance (Y/N)')
     A                                      COLHDG('Include' 'Bal(Y/N)')
      ** End MD059406
      *****************************************************************
