     H        1                                                           MS0201
      *****************************************************************
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas Swift EBCDIC/ASCII Conversion')
     F*****************************************************************
     F*                                                               *
     F*  Midas SWIFT DIRECT LINK MODULE                           *
     F*                                                               *
     F*  MS0208B - S.W.I.F.T. EBCDIC/ASCII CONVERSION                 *
     F*           (TCP/IP TRANSFER)                                   *
     F*                                                               *
      *  (c) Finastra International Limited 2001                      *
     F*      COMPANY CONFIDENTIAL                                     *
     F*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CSW001  *CREATE    Date 20Mar95               *
     F*                                                               *
     F*****************************************************************
     F*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     F*   CSW001 - SWIFT Alliance Batch Interface                     *
     F*            PGM Renamed from MS0206B (R3) for R10              *
     F*                                                               *
     F*****************************************************************
     F*                                                               *
     F*  C R E A T I O N     P A R A M E T E R S                      *
     F*                                                               *
      *
      ****************************************************************
     FMS2780O IF  E                    DISK         KINFSR *PSSR
     FMSTCPFPDO   E                    DISK         KINFSR *PSSR
     F*
     E* Copyright Statement
     E                    CPY@    1   1 80
     E*
     IFIELD       DS
     I                                        1 199 FLD1
     I                                      200 398 FLD2
     I*
     C** Copyright Statement
     C                     MOVEACPY@      BIS@   80
     C*
     C           1         SETLLMS2780O
     C                     READ MS2780O                  50
     C*
     C           *IN50     DOWNE'1'
     C                     MOVELFLD1      @BUFR 199
     C                     EXSR TXL
     C                     MOVEL@BUFR     FLD1
     C*
     C                     MOVELFLD2      @BUFR
     C                     EXSR TXL
     C                     MOVEL@BUFR     FLD2
     C*
     C                     WRITEMSTCPFF
     C*
     C                     READ MS2780O                  50
     C                     END
     C                     SETON                     LR
     C*
     C*****************************************************************
     C*                                                               *
     C*  SUBROUTINE : TXL    - Translate Data from EBCDIC to ASCII    *
     C*                                                               *
     C*  CALLED BY  : This routine is called for each record from     *
     C*               MS2780O to be translated.                       *
     C*                                                               *
     C*****************************************************************
     C*
     C           TXL       BEGSR
     C*
     C                     Z-ADD199       @LENG   50
     C                     MOVEL'QTCPASC' @TBLIN 10
     C                     MOVEL'QUSRSYS' @LIBIN 10
     C                     CALL 'QDCXLATE'
     C                     PARM           @LENG
     C                     PARM           @BUFR
     C                     PARM           @TBLIN
     C                     PARM           @LIBIN
     C*
     C                     ENDSR
     C/EJECT
     C*****************************************************************
     C*                                                               *
     C*  SUBROUTINE : *PSSR  - Error Handling Subroutine              *
     C*                                                               *
     C*  CALLED BY  : This routine is called if there are any program *
     C*               or file errors.                                 *
     C*                                                               *
     C*****************************************************************
     C*
     C           *PSSR     BEGSR                           ** *PSSR  **
     C*
     C                     DUMP
     C                     SETON                     U7U8LR
     C                     RETRN
     C*
     C                     ENDSR
** CPY@
(c) Finastra International Limited 2001
