     H        1
      *****************************************************************
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas MS Swift direct link 2780 msg index upd')        *
      *****************************************************************
      *                                                               *
      *  Midas - SWIFT Direct Link Module                             *
      *                                                               *
      *   MS0203 - OUTGOING MESSAGE INDEX UPDATE (2780 PROTOCOL)      *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *  Last Amend No. AR787620           Date 10Jun11               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 09Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      *                 CDL008             Date 02May00               *
      * Midas DBA 3.03 -----------------------------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 141572             Date 21SEP98               *
      *                   113352           DATE 13FEB97               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  AR787620 - Hooks Incorporation                               *
      *             WNCPYSRC,MSH00003                                 *
      *             WNCPYSRC,MSH00001                                 *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *   CDL008 - Continuous Linked Settlement (Recompiled MGOREFPD) *
      *   141572 -  Recompile over changes in MGOREFPD                *
      *   113352 -  RECOMPILE OVER CHANGES IN MGOREFPD                *
      *   S01344 -  RE WRITTEN FOR SWIFT RATIONALISATION PHASE 2.     *
      *                                                               *
      *****************************************************************
     FMGOREFPDUF  E                    DISK
     F                                              KCOMIT
     F/COPY WNCPYSRC,MS0203F001
      *
     E                    CPY@    1   1 80
      *
     E/COPY WNCPYSRC,MSH00003
     ICPYR@#      DS
     I                                        1  80 CPY@
     I                                        1  20 CPY@##
     I/COPY WNCPYSRC,MSH00001
      *
     C           *ENTRY    PLIST
     C                     PARM           INPUT   1
     C/COPY WNCPYSRC,MS0203C001
      *
     C           1         CHAINMGOREFPD             10
      *
     C           *IN10     DOWEQ'0'
      *
     C/COPY WNCPYSRC,MS0203C002
     C           MGST      IFEQ 'PEND'
     C           INPUT     IFEQ 'T'
     C                     MOVE '3'       MGSG
     C                     MOVE 'TRAN'    MGST
     C/COPY WNCPYSRC,MS0203C003
     C                     END
      *
     C           INPUT     IFEQ 'R'
     C                     MOVE '2'       MGSG
     C                     MOVE 'RSND'    MGST
     C/COPY WNCPYSRC,MS0203C004
     C                     END
      *
     C                     UPDATMGOREFD0
     C                     COMIT
     C                     END
      *
     C                     READ MGOREFPD                 10
     C                     END
      *
     C                     SETON                     LR
     C/EJECT
      *****************************************************************
      *   *PSSR - error handling                                      *
      *****************************************************************
      *
     C           *PSSR     BEGSR
      *
     C                     SETON                     U7U8LR
     C                     DUMP
     C                     RETRN
      *
     C                     ENDSR
**  CPY@  ** OBJECT COPYRIGHT                                             S01194
(c) Misys International Banking Systems Ltd. 2001
