      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Logical file for Midas LE HISTORY file')               *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  LF/UTLE0522L1 - Logical file of HISTSxx keyed by loan number *
      *                  Used by UTLE0522 utility for MD037545.       *
      *                                                               *
      *  (C) Misys Banking Systems 2016                               *
      *                                                               *
      *  Last Amend No. AR545781 *CREATE   Date 24Aug16               *
      *  Prev AMend No. Xnnnnnnn           Date ddmmmyy               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  AR545781 - Missing/Multiple IH on history file.              *
      *             Provide datapatch utility to correct principal    *
      *             and interest values on history file.              *
      *           - Applied utility to MD-37545                       *
      *                                                               *
      *****************************************************************
     A          R HISTSHMF                  PFILE(HISTSHM)
     A                                      TEXT('(c) Misys +
     A                                      Banking Systems Ltd. +
     A                                      2016')
     A          K LNRF
     A          K VDAT
     A          K PRSQ
     A          K LASN
      *
     A          R HISTSHPF                  PFILE(HISTSHP)
     A          K LNRF
     A          K VDAT
     A          K PRSQ
     A          K LASN
     A          S AMTP                      VALUES('MR' 'IN' 'RE' 'MA')
      *
