      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Logical file for Midas PF/HISTSHN file')               *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  LF/UTLE0522L2 - Logical file of HISTSHN keyed by loan number *
      *                  Used by UTLE0522 utility for MD037545.       *
      *                                                               *
      *  (C) Finastra International Limited 2016                      *
      *                                                               *
      *  Last Amend No. CLE172             Date 01Oct20               *
      *  Prev Amend No. CSD103             Date 10Aug20               *
      *                 MD046248           Date 27Oct17               *
      *                 AR545781 *CREATE   Date 24Aug16               *
      *                 XNNNNNNN           Date DDMmmYY               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CLE172 - LIBOR Deregulation - Lending (Recompile)            *
      *  CSD103 - LIBOR Deregulation - Common Layer/Standing Data     *
      *             (Recompile)                                       *
      *  MD046248 - Finastra Rebranding                               *
      *  AR545781 - Missing/Multiple IH on history file.              *
      *             Provide datapatch utility to correct principal    *
      *             and interest values on history file.              *
      *           - Applied utility to MD-37545                       *
      *                                                               *
      *****************************************************************
     A          R HISTSHNF                  PFILE(HISTSHN)
     A          K LNRF
