      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD BTS Master')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/UTSD0774L3 - Midas SD BTS Monthly History by Company Code *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2016            *
      *                                                               *
      *  Last Amend No. MD038430 *Create   Date 19May16               *
      *  Prev Amend No. MDnnnnnn           Date nnXxxnn               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD038430 - Unable to grant BFTC HKG user Company Codes.      *
      *             Select SDBTFHPD records with company codes        *
      *             having less than 3 characters.                    *
      *                                                               *
      *****************************************************************
      *
     A          R SDBTFHD0                  PFILE(SDBTFHPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2016')
      *
     A            E3MMOD
     A            E3FNME
     A            E3DATE
     A            E3TNTY
     A            E3TTIN
     A            E3TTAV
     A            E3CMPY
     A            E3BRCA
      *
     A            CPYCOD3            I      SST(E3CMPY 3 1)
      *
     A          K E3MMOD
     A          K E3FNME
     A          K E3DATE
     A          K E3TNTY
     A          K E3CMPY
     A          K E3BRCA
      *
     A          S CPYCOD3                   COMP(EQ ' ')
      *
