      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD BTS Monthly Figures')                         *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/UTSD0774L1 - Midas SD BTS Monthly Figures by Company Code *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2016            *
      *                                                               *
      *  Last Amend No. MD038430 *Create   Date 19May16               *
      *  Prev Amend No. MDnnnnnn           Date nnXxxnn               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD038430 - Unable to grant BFTC HKG user Company Codes.      *
      *             Select SDBTSFPD records with company codes        *
      *             having less than 3 characters.                    *
      *                                                               *
      *****************************************************************
      *
     A          R SDBTSFD0                  PFILE(SDBTSFPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2016')
      *
     A            E1MMOD
     A            E1FNME
     A            E1DATE
     A            E1TNTY
     A            E1TTIN
     A            E1TTAV
     A            E1CMPY
     A            E1BRCA
      *
     A            CPYCOD1            I      SST(E1CMPY 3 1)
      *
     A          K E1MMOD
     A          K E1FNME
     A          K E1DATE
     A          K E1TNTY
     A          K E1CMPY
     A          K E1BRCA
      *
     A          S CPYCOD1                   COMP(EQ ' ')
      *
