      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas - ER Acount Code Details Extension - LU')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDACX2PD   - LU Account Code Details File                 *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2005            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CPK025             Date 02May06               *
      *  Prev Amend No. CER001  *CREATE    Date 25Apr05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CPK025 - Deletion of ERFRF field reference file.             *
      *  CER001 - LUX Upgrade to MidasPlus                            *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
      * Start /CPK025*/
     A**********                            REF(ERFRF)                                        CPK025
      * End /CPK025*/
     A          R SDACODF6                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2005')
      * Start /CPK025*/
     A**********  QQACOD    R               REFFLD(ACODA)                                     CPK025
     A**********  SDIM93    R               REFFLD(IM93)                                      CPK025
     A**********  SDSHAT         1S 0                                                         CPK025
     A**********  SDACOD    R               REFFLD(ACOD)                                      CPK025
     A            QQACOD         4S 0       TEXT('Account Code')
     A                                      COLHDG('Account' 'Code')
     A            SDIM93         1S 0       TEXT('Note IML 93/93')
     A                                      COLHDG('Note' 'IML 93/93')
     A            SDSHAT         1S 0
     A            SDACOD        10S 0       TEXT('Account Code')
     A                                      COLHDG('Account' 'Code')
      * End /CPK025*/
     A          K SDACOD
