      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Additional customer details')                 *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDACUSPD -  Additional customer details                   *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. CGL157             Date 17Aug15               *
      *  Prev Amend No. MD046248           Date 27Oct17               *
      *                 CER071             Date 01Aug16               *
      *                 CER070             Date 19Aug14               *
      *                 CGL132             Date 01May13               *
      *                 CLE134             Date 01Aug12               *
      *                 AR742563           Date 06Apr11               *
      *                 CER059             Date 19Jul10               *
      *                 CER045             Date 20Jul09               *
      *                 CER054             Date 07Apr09               *
      *                 BUG22529           Date 05Feb09               *
      *                 CER048             Date 19May08               *
      *                 CER034             Date 19May08               *
      *                 CER041             Date 19May08               *
      *                 CER038             Date 19May08               *
      *                 CER047             Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *                 CSW207             Date 07Jul07               *
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD029             Date 22Aug05               *
      *                 232543             Date 30Mar05               *
      *                 CGL031             Date 05Jul04               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 113339             Date 22Jul99               *
      *                 CSD003             Date 15Sep98               *
      *                 S01459             Date 16Jun98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGL157 - CRS Reporting (Recompile)                           *
      *  MD046248 - Finastra Rebranding                               *
      *  CER071 - BAIS - Legal Form field (Recompile)                 *
      *  CER070 - BuBa Reporting / BAIS V.1.16.0 (Recompile)          *
      *  CGL132 - FATCA Phase 1 - Customers' Identification and       *
      *           Classification - Master (Recompile)                 *
      *  CLE134 - Past Due Call Loan Processing (Recompile)           *
      *  AR742563 - Global Replication : GZSDACUSPD vs SDACUSPD       *
      *             (Child: AR742564)                                 *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER045 - German Features - Reporting Bundesbank              *
      *  CER054 - German Features - Church Tax                        *
      *  BUG22529 - Global Additional Customer Details                *
      *  CER048 - German Features - Taxes                             *
      *  CER034 - German Features - New Fields and Enquiries          *
      *  CER041 - Audit Letters Correspondence                        *
      *  CER038 - Additional fields added to Correspondence           *
      *  CER047 - German Features LF037-00 Reporting §24c KWG         *
      *  CSW207 - SWIFT 2007 Changes                                  *
      *  CSD029 - Customer Details Additional Fields                  *
      *  232543 - Fix to CGL031                                       *
      *  CGL031 - Taxation of Savings Income                          *
      *  113339 - Date of birth could be before 01-01-72, thus add    *
      *           field to retrieve full date.                        *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  S01459 - Addition of Midas headerbox.                        *
      *                                                               *
      *****************************************************************
      **Start of change AR742563
     A          R SDACUSD0                  FORMAT(GZSDACUSPD)
      *
      *
      *
     A**********R SDACUSD0                  TEXT('(c) Misys International +                 AR742563
     A**********                            Banking Systems Ltd. +                          AR742563
     A**********                            2001')                                          AR742563
     A***********--------------------------------------------------------------------       AR742563
     A**********  E5CUST         6          TEXT('Customer Number')                         AR742563
     A**********                            COLHDG('Customer' +                             AR742563
     A**********                                   'Number' )                               AR742563
     A**********  E5LCD          5  0       TEXT('Last Change Date')                        AR742563
     A**********                            COLHDG('Last' +                                 AR742563
     A**********                                   'Change Date' )                          AR742563
     A**********                            EDTCDE(3)                                       AR742563
     A**********  E5TYLC         1          TEXT('Type of Last Change')                     AR742563
     A**********                            COLHDG('Type of' +                              AR742563
     A**********                                   'Last Change' )                          AR742563
     A**********  E5ALTN        12          TEXT('Alternative Number')                      AR742563
     A**********                            COLHDG('Alternative' +                          AR742563
     A**********                                   'Number' )                               AR742563
     A**********  E5IDNO        15          TEXT('Identity Number')                         AR742563
     A**********                            COLHDG('Identity' +                             AR742563
     A**********                                   'Number' )                               AR742563
     A**********  E5FXNB        12          TEXT('Fax Number')                              AR742563
     A**********                            COLHDG('Fax Number' )                           AR742563
     A**********  E5TXNB        12          TEXT('Telex Number')                            AR742563
     A**********                            COLHDG('Telex Number' )                         AR742563
     A**********  E5DOLV         5  0       TEXT('Date of Last Visit')                      AR742563
     A**********                            COLHDG('Date of' +                              AR742563
     A**********                                   'Last Visit' )                           AR742563
     A**********                            EDTCDE(3)                                       AR742563
     A**********  E5PRVO         1          TEXT('Provisional Opening')                     AR742563
     A**********                            COLHDG('Provisional' +                          AR742563
     A**********                                   'Opening' )                              AR742563
     A**********  E5MDTL         5          TEXT('Mail Details')                            AR742563
     A**********                            COLHDG('Mail' +                                 AR742563
     A**********                                   'Details' )                              AR742563
     A**Start of change CGL031
     A**********  E5CNA1        35          TEXT('Cust. Name & Address 1')                    CGL031
     A**********  E5CNA1        70          TEXT('Cust. Name & Address 1')                  AR742563
     A**End of change CGL031
     A**********                            COLHDG('Cust. Name' +                           AR742563
     A**********                                   '& Address 1' )                          AR742563
     A**Start of change CGL031
     A**********  E5CNA2        35          TEXT('Cust. Name & Address 2')                    CGL031
     A**********  E5CNA2        70          TEXT('Cust. Name & Address 2')                  AR742563
     A**End of change CGL031
     A**********                            COLHDG('Cust. Name' +                           AR742563
     A**********                                   '& Address 2' )                          AR742563
     A**********  E5CNA3        35          TEXT('Cust. Name & Address 3')                  AR742563
     A**********                            COLHDG('Cust. Name' +                           AR742563
     A**********                                   '& Address 3' )                          AR742563
     A**********  E5CNA4        35          TEXT('Cust. Name & Address 4')                  AR742563
     A**********                            COLHDG('Cust. Name' +                           AR742563
     A**********                                   '& Address 4' )                          AR742563
     A**********  E5CWL1        20          TEXT('Code Word One')                           AR742563
     A**********                            COLHDG('Code Word 1' )                          AR742563
     A**********  E5CWL2        20          TEXT('Code Word Two')                           AR742563
     A**********                            COLHDG('Code Word 2' )                          AR742563
     A**********  E5CWL3        20          TEXT('Code Word Three')                         AR742563
     A**********                            COLHDG('Code Word 3' )                          AR742563
     A**********  E5CWL4        20          TEXT('Code Word Four')                          AR742563
     A**********                            COLHDG('Code Word 4' )                          AR742563
     A**********  E5BRTH         5  0       TEXT('Date of Birth')                           AR742563
     A**********                            COLHDG('Date of' +                              AR742563
     A**********                                   'Birth' )                                AR742563
     A**********                            EDTCDE(3)                                       AR742563
     A**********  E5CWL5        20          TEXT('Code Word Five')                          AR742563
     A**********                            COLHDG('Code Word 5' )                          AR742563
     A*                                                       /* Start 113339 */
     A**********  E5BRT1         6          TEXT('Date of Brith DAF 1')                     AR742563
     A**********                            COLHDG('Date of' 'Birth' 'DAF 1')               AR742563
     A**********  E5BRT2         2          TEXT('Date of Brith DAF 2')                     AR742563
     A**********                            COLHDG('Date of' 'Birth' 'DAF 2')               AR742563
     A*                                                       /*  End  113339 */
     A***********=====================================================================      AR742563
     A**Start of change CGL031
     A**********  E5CITY        35A         TEXT('City')                                    AR742563
     A**********                            COLHDG('City')                                  AR742563
     A**********  E5ZIPC        10A         TEXT('Zip Code')                                AR742563
     A**********                            COLHDG('Zip Code')                              AR742563
     A**********  E5TINO        25A         TEXT('Tax Identification Number')               AR742563
     A**********                            COLHDG('Tax Identification ' +                  AR742563
     A**********                            'Number')                                       AR742563
     A**********  E5IDTP         2A         TEXT('Identification Type')                     AR742563
     A**********                            COLHDG('Identification Type')                   AR742563
     A**********  E5ISCT         2A         TEXT('Issuing Country')                         AR742563
     A**********                            COLHDG('Issuing Country')                       AR742563
     A** Start of change 232543
     A**********  E5ISDT         5P 0       TEXT('Issuing Date')                              232543
     A**********  E5ISDT         8A         TEXT('Issuing Date')                            AR742563
     A** End of change 232543
     A**********                            COLHDG('Issuing Date')                          AR742563
     A**********  E5DBTH         8A         TEXT('Birth Date (YYYYMMDD)')                   AR742563
     A**********                            COLHDG('Birth Date ' +                          AR742563
     A**********                            '(YYYYMMDD)')                                   AR742563
     A**********  E5BTHC         2A         TEXT('Place of Birth - Country')                AR742563
     A**********                            COLHDG('Place of Birth - ' +                    AR742563
     A**********                            'Country')                                      AR742563
     A**********  E5BTHT        35A         TEXT('Place of Birth - Town')                   AR742563
     A**********                            COLHDG('Place of Birth - ' +                    AR742563
     A**********                            'Town')                                         AR742563
     A**********  E5JATP         1A         TEXT('Joint Account Type')                      AR742563
     A**********                            COLHDG('Joint Account Type')                    AR742563
     A**********  E5REPI         1A         TEXT('Replication Indicator')                   AR742563
     A**********                            COLHDG('Replication ' +                         AR742563
     A**********                            'Indicator')                                    AR742563
     A**********  E5FRNT        20A         TEXT('Front Office Transaction ID')             AR742563
     A**********                            COLHDG('Front Office ' +                        AR742563
     A**********                            'Transaction ID')                               AR742563
     A**********  E5CSSN        10A         TEXT('Customer Shortname')                      AR742563
     A**********                            COLHDG('Customer' +                             AR742563
     A**********                            'Shortname')                                    AR742563
     A**********  E5REPA         1A         TEXT('Repair Location')                         AR742563
     A**********                            COLHDG('Repair Location')                       AR742563
     A**********  E5TMST          Z         TEXT('Timestamp')                               AR742563
     A**********                            COLHDG('Timestamp')                             AR742563
     A**End of change CGL031
      **Start of change CSD029
     A**********  E5FL01        50          TEXT('Field 01 details')                        AR742563
     A**********                            COLHDG('Field 01 details')                      AR742563
     A**********  E5FL02        50          TEXT('Field 02 details')                        AR742563
     A**********                            COLHDG('Field 02 details')                      AR742563
     A**********  E5FL03        50          TEXT('Field 03 details')                        AR742563
     A**********                            COLHDG('Field 03 details')                      AR742563
     A**********  E5FL04        50          TEXT('Field 04 details')                        AR742563
     A**********                            COLHDG('Field 04 details')                      AR742563
     A**********  E5FL05        50          TEXT('Field 05 details')                        AR742563
     A**********                            COLHDG('Field 05 details')                      AR742563
     A**********  E5FL06        50          TEXT('Field 06 details')                        AR742563
     A**********                            COLHDG('Field 06 details')                      AR742563
     A**********  E5FL07        50          TEXT('Field 07 details')                        AR742563
     A**********                            COLHDG('Field 07 details')                      AR742563
     A**********  E5FL08        50          TEXT('Field 08 details')                        AR742563
     A**********                            COLHDG('Field 08 details')                      AR742563
     A**********  E5FL09        50          TEXT('Field 09 details')                        AR742563
     A**********                            COLHDG('Field 09 details')                      AR742563
     A**********  E5FL10        50          TEXT('Field 10 details')                        AR742563
     A**********                            COLHDG('Field 10 details')                      AR742563
      **End of change CSD029
     A**Start of change CSW207
     A**********  E5ISCD        35          TEXT('Issuer Code')                             AR742563
     A**********                            COLHDG('Issuer Code')                           AR742563
     A**End of change CSW207
      **Start of change CER047
     A**********  E5TITL        35A         TEXT('Title')                                   AR742563
     A**********                            COLHDG('Title')                                 AR742563
      *
     A**********  E5EXDT         5P 0       TEXT('Expiry Date')                             AR742563
     A**********                            EDTCDE(3)                                       AR742563
     A**********                            COLHDG('Expiry Date')                           AR742563
      *
     A**********  E5REM1        40A         TEXT('Remarks 1')                               AR742563
     A**********                            COLHDG('Remarks 1')                             AR742563
      *
     A**********  E5REM2        40A         TEXT('Remarks 2')                               AR742563
     A**********                            COLHDG('Remarks 2')                             AR742563
      *
     A**********  E5REM3        40A         TEXT('Remarks 3')                               AR742563
     A**********                            COLHDG('Remarks 3')                             AR742563
      *
     A**********  E5S24C         1A         TEXT('Subject to §24c')                         AR742563
     A**********                            COLHDG('Subject to §24c')                       AR742563
      *
      **End of change CER047
      **Start of Change CER038
     A**********  E5LNID         2A         TEXT('Language ID')                             AR742563
     A**********                            COLHDG('Language ID')                           AR742563
      *
     A**********  E5CTYP        10A         TEXT('Correspondent Type')                      AR742563
     A**********                            COLHDG('Correspondent' +                        AR742563
     A**********                                   'Type')                                  AR742563
      **End of change CER038
      **Start of change CER041
     A**********  E5ZCFG         1A         TEXT('Zero Confirmation +                       AR742563
     A**********                                 Flag')                                     AR742563
     A**********                            COLHDG('Zero Cnfrm.' +                          AR742563
     A**********                                   'Flag')                                  AR742563
      **End of change CER041
      **Start of change CER034
     A**********  E5FXCU         1A         TEXT('FX Customer')                             AR742563
     A**********                            COLHDG('FX Customer')                           AR742563
      *
     A**********  E5SECU         1A         TEXT('Securities Customer')                     AR742563
     A**********                            COLHDG('Securities Cust.')                      AR742563
      *
     A**********  E5SMBR         1A         TEXT('Staff Member')                            AR742563
     A**********                            COLHDG('Staff Member')                          AR742563
      **End of change CER034
      **Start of change CER048
     A**********  E5MDNM        70A         TEXT('Maiden Name')                             AR742563
     A**********                            COLHDG('Maiden Name')                           AR742563
      *
     A**********  E5SHRF        10A         TEXT('Spouse Reference')                        AR742563
     A**********                            COLHDG('Spouse' +                               AR742563
     A**********                                   'Reference')                             AR742563
      *
     A**********  E5PIND         1A         TEXT('Partner/Associate +                       AR742563
     A**********                                Indicator')                                 AR742563
     A**********                            COLHDG('Partnr/Associate' +                     AR742563
     A**********                                    'Indicator')                            AR742563
      *
     A**********  E5EXTH         6P 0       TEXT('Exemption Threshold')                     AR742563
     A**********                            COLHDG('Exmptn. Threshold')                     AR742563
      *
     A**********  E5EADT         5P 0       TEXT('Exemption Threshold +                     AR742563
     A**********                                Approval Date')                             AR742563
     A**********                            EDTCDE(3)                                       AR742563
     A**********                            COLHDG('Exmptn Threshold' +                     AR742563
     A**********                                   'Approval Date')                         AR742563
      *
     A**********  E5EVDT         5P 0       TEXT('Exemption Threshold +                     AR742563
     A**********                                Value Date')                                AR742563
     A**********                            EDTCDE(3)                                       AR742563
     A**********                            COLHDG('Exmptn Threshold' +                     AR742563
     A**********                                   'Value Date')                            AR742563
      *
     A**********  E5ETXT         5P 0       TEXT('Exemption Threshold +                     AR742563
     A**********                                Expiry Date')                               AR742563
     A**********                            EDTCDE(3)                                       AR742563
     A**********                            COLHDG('Exmptn Threshold' +                     AR742563
     A**********                                   'Expiry Date')                           AR742563
      *
     A**********  E5DCID        20A         TEXT('Identification +                          AR742563
     A**********                                Document No/Id')                            AR742563
     A**********                            COLHDG('Identification' +                       AR742563
     A**********                                   'Document No/Id')                        AR742563
      *
     A**********  E5DIPL        40A         TEXT('Identification +                          AR742563
     A**********                                Document Issued Place')                     AR742563
     A**********                            COLHDG('Identification' +                       AR742563
     A**********                                   'Doc. Issued Place')                     AR742563
      *
     A**********  E5CDCL        40A         TEXT('Characteristic of +                       AR742563
     A**********                                Demand/Claim')                              AR742563
     A**********                            COLHDG('Characteristic' +                       AR742563
     A**********                                   'of Demand/Claim')                       AR742563
      **End of change CER048
     A**Start of change BUG22529
     A**********  E5ZONE        10A         TEXT('Zone')                                    AR742563
     A**********                            COLHDG('Zone')                                  AR742563
     A**End of change BUG22529
      **Start of change CER054
     A**********  E5STCD         2A         TEXT('State Code')                              AR742563
     A**********                            COLHDG('State' +                                AR742563
     A**********                                   'Code')                                  AR742563
     A**********  E5RLAF         4A         TEXT('Religious Affiliation Code')              AR742563
     A**********                            COLHDG('Religious' +                            AR742563
     A**********                                   'Affiliation' +                          AR742563
     A**********                                   'Code')                                  AR742563
      **End of change CER054
      **Start of change CER045
     A**********  E5BSCC         2P         TEXT('Borrower Sector +                         AR742563
     A**********                                Classification Code')                       AR742563
     A**********                            COLHDG('Borrower Sector' +                      AR742563
     A**********                                   'Classification Code')                   AR742563
     A**********  E5ECAC         3A         TEXT('Economic Activity Code')                  AR742563
     A**********                            COLHDG('Economic Activity' +                    AR742563
     A**********                                   'Code')                                  AR742563
     A**********  E5BIST         3P         TEXT('Borrower Sector +                         AR742563
     A**********                                Classification/BISTA')                      AR742563
     A**********                            COLHDG('Borrower Sector' +                      AR742563
     A**********                                   'Classification/BISTA')                  AR742563
     A**********  E5ABSK         1A         TEXT('Additional Borrowers +                    AR742563
     A**********                                Statistics Key')                            AR742563
     A**********                            COLHDG('Additional Borrowers' +                 AR742563
     A**********                                   'Statistics Key')                        AR742563
     A**********  E5BEXT         1A         TEXT('Customer Required for +                   AR742563
     A**********                                Bundesbank Reporting')                      AR742563
     A**********                            COLHDG('Customer Required' +                    AR742563
     A**********                                    'for Bundesbank' +                      AR742563
     A**********                                   'Reporting')                             AR742563
      **End of change CER045
      **End of change AR742563
