      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD AML Account Holdings Details Import Table')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDAHOLPD - AML Account Holdings Details Import Table      *
      *                                                               *
      *  (c) Finastra International Limited 2002                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. BUG3031            Date 03Jun02               *
      *                 CSD017  *CREATE    Date 08Nov02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  BUG3031 - Compliance Watch AML export data corrections       *
      *  CSD017 - Midas Compliance Watch - Anti-Money Laundering      *
      *                                                               *
      *****************************************************************
      *
     A          R SDAHOLD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2002')
      *
     A            X4CUCD        20A         TEXT('CUST_CODE')
     A                                      COLHDG('CUST_CODE')
      *
     A**Start of change BUG3031
     A**********  X4ACNO        20A         TEXT('ACC_NUM')                                  BUG3031
     A            X4ACNO        30A         TEXT('ACC_NUM')
     A**End of change BUG3031
     A                                      COLHDG('ACC_NUM')
      *
     A            X4BRCA        16A         TEXT('BRANCH_CODE')
     A                                      COLHDG('BRANCH_CODE')
      *
     A            X4ACTN         1A         TEXT('ACTION')
     A                                      COLHDG('ACTION')
