      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD CI authorised device definition')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDBAIDPD - BAI Authorised Device Definition Physical File *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *  NOTE: All changes to this file must also be made to its      *
      *             -DC suffixed equivalent in SETUPMIDAS             *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Last Amend No. 143232             Date 22SEP98               *
      *  Prev Amend No. CSD003             Date 22SEP98               *
      *  Last Amend No. CRT003             DATE 12JUN96               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  143232 - The layout of the file did not match any other      *
      *           related object. File re-ordered to match the pgms.  *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  CRT003 - Branch Automation Interface - new file.             *
      *                                                               *
      *****************************************************************
     A          R SDBAIDD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*---------------------------------------------------------------------
      *                                       End of change /143232/
     A            FWBRCA         3          TEXT('Branch of Location')
     A                                      COLHDG('Branch of' +
     A                                             'Location' )
      *                                     Start of change /143232/
     A            FWBAID        10          TEXT('Branch Automation Interface D-
     A                                      evice Name')
     A                                      COLHDG('BAI Device' +
     A                                             'Name' )
     A            FWDVDS        30          TEXT('BAI Device Description')
     A                                      COLHDG('BAI Device' +
     A                                             'Description' )
      *                                     Start of change /143232/
     A**********  FWBRCA         3          TEXT('Branch of Location')
     A**********                            COLHDG('Branch of' +
     A**********                                   'Location' )
      *                                       End of change /143232/
     A            FWLCD          5  0       TEXT('Last Change Date')
     A                                      COLHDG('Last' +
     A                                             'Change Date' )
     A                                      EDTCDE(3)
     A            FWTYLC         1          TEXT('Type of Last Change')
     A                                      COLHDG('Type of' +
     A                                             'Last Change' )
     A*=====================================================================
