      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD RTS retail bank codes file')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDBNCDPD - Midas SD IRTS Retail bank codes file.          *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Last Amend No. CSD003             DATE 22APR99               *
      *  Prev Amend No. 091241             DATE 09AUG95               *
      *                 CRT001             DATE 22FEB95               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  091241 - Key field RBCD extended to 11A from 7A.             *
      *  CRT001 - Retail Teller System, new file.                     *
      *                                                               *
      *****************************************************************
     A          R SDBNCDD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            FPRBCD        11          TEXT('Bank Code')
     A                                      COLHDG('Bank' +
     A                                             'Code' )
     A            FPLCD          5  0       TEXT('Last Change Date')
     A                                      COLHDG('Last' +
     A                                             'Change Date' )
     A                                      EDTCDE(3)
     A            FPTYLC         1          TEXT('Type of Last Change')
     A                                      COLHDG('Type of' +
     A                                             'Last Change' )
     A            FPRBNM        30          TEXT('Bank Name')
     A                                      COLHDG('Bank Name' )
     A            FPRBII         1          TEXT('Bank Itself Indicator')
     A                                      COLHDG('Bank Itself' +
     A                                             'Indicator' )
     A*=====================================================================
