      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_SN                                                        *
/*EXI *  TEXT('Midas SD BTS Monthly Figures')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDBTSFPD - BTS Monthly Figures to Date                    *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Last Amend No. CSD004             Date 22Feb99               *
      *  Prev Amend No. CSD003             Date 12Mar99               *
      *                 S01459             Date 12Mar99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD004 - Report split by business entity                     *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  S01459 - Addition of Midas headerbox.                        *
      *                                                               *
      *****************************************************************
      *                                     Start of change /CSD004/
     A                                      REF(MFRFL)
      *                                       End of change /CSD004/
     A          R SDBTSFD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            E1MMOD         2          TEXT('File module')
     A                                      COLHDG('File' +
     A                                             'module' )
     A            E1FNME        10          TEXT('File name')
     A                                      COLHDG('File' +
     A                                             'name' )
     A            E1DATE         5  0       TEXT('Todays run date')
     A                                      COLHDG('Todays' +
     A                                             'run date' )
     A                                      EDTCDE(3)
     A            E1TNTY         2          TEXT('Transaction types')
     A                                      COLHDG('Transaction' +
     A                                             'types' )
     A            E1TTIN         6S 0       TEXT('Total inserts today')
     A                                      COLHDG('Total inserts' +
     A                                             'today' )
     A                                      EDTCDE(3)
     A            E1TTAV         6S 0       TEXT('Average live records')
     A                                      COLHDG('Average' +
     A                                             'live' +
     A                                             'records' )
     A                                      EDTCDE(3)
      *                                     Start of change /CSD004/
     A            E1CMPY    R               REFFLD(CMPYM)
     A                                      TEXT('Company')
     A                                      COLHDG('Company')
     A            E1BRCA    R               REFFLD(BRCA)
     A                                      TEXT('Branch')
     A                                      COLHDG('Branch')
      *                                       End of change /CSD004/
     A*=====================================================================
