      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas BRT Customer details Shadow file')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *   PF/SDCBSHPD - Basic Rate Tax (BRT) Customer Shadow file     *
      *                                                               *
      *                This file is an exact copy of SDCBRTPD.        *
      *                Any fields added to that file need to be       *
      *                added here as well.                            *
      *                                                               *
      *  (c) Finastra International Limited 2002                      *
      *                                                               *
      *  Last Amend No. MD055446           Date 04Apr20               *
      *  Prev Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027             Date 05Dec05               *
      *                 CSD012 *C *CREATE  Date 15Oct02               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD055446 - There are parties and fields missing from the BRT *	
      *             details tab in Customer Input plus date of birth  *	
      *             issues.                                           *	
      *           - BRT Participation Date of Birth field is missing. *
      *             Patterened after SDCBRTPD.                        * 	
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CSD012 - Standing Data Authorisation                         *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R SDCBRTD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2002')
     A            XRECI     R               REFFLD(RECI)
      * Begin /CSD027/
     A**********  XCNUM     R               REFFLD(CNUM)                                      CSD027
     A            XCNUM          6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            ACHLRT    R
     A            H1TITL    R
     A            H1NAME    R
     A            H1INIT    R
     A            H1ADR1    R
     A            H1ADR2    R
     A            H1ADR3    R
     A            H1PCD1    R
     A            H1PCD2    R
     A            H1BRTL    R
     A            H1NINO    R
     A            H1DOB     R
     A            H1SEQN    R
     A            H2TITL    R               REFFLD(H1TITL)
     A            H2NAME    R               REFFLD(H1NAME)
     A            H2INIT    R               REFFLD(H1INIT)
     A            H2ADR1    R               REFFLD(H1ADR1)
     A            H2ADR2    R               REFFLD(H1ADR2)
     A            H2ADR3    R               REFFLD(H1ADR3)
     A            H2PCD1    R               REFFLD(H1PCD1)
     A            H2PCD2    R               REFFLD(H1PCD2)
     A            H2BRTL    R               REFFLD(H1BRTL)
     A            H2NINO    R               REFFLD(H1NINO)
     A            H2DOB     R               REFFLD(H1DOB)
     A            H2SEQN    R               REFFLD(H1SEQN)
     A            H3TITL    R               REFFLD(H1TITL)
     A            H3NAME    R               REFFLD(H1NAME)
     A            H3INIT    R               REFFLD(H1INIT)
     A            H3ADR1    R               REFFLD(H1ADR1)
     A            H3ADR2    R               REFFLD(H1ADR2)
     A            H3ADR3    R               REFFLD(H1ADR3)
     A            H3PCD1    R               REFFLD(H1PCD1)
     A            H3PCD2    R               REFFLD(H1PCD2)
     A            H3BRTL    R               REFFLD(H1BRTL)
     A            H3NINO    R               REFFLD(H1NINO)
     A            H3DOB     R               REFFLD(H1DOB)
     A            H3SEQN    R               REFFLD(H1SEQN)
     A            H4TITL    R               REFFLD(H1TITL)
     A            H4NAME    R               REFFLD(H1NAME)
     A            H4INIT    R               REFFLD(H1INIT)
     A            H4ADR1    R               REFFLD(H1ADR1)
     A            H4ADR2    R               REFFLD(H1ADR2)
     A            H4ADR3    R               REFFLD(H1ADR3)
     A            H4PCD1    R               REFFLD(H1PCD1)
     A            H4PCD2    R               REFFLD(H1PCD2)
     A            H4BRTL    R               REFFLD(H1BRTL)
     A            H4NINO    R               REFFLD(H1NINO)
     A            H4DOB     R               REFFLD(H1DOB)
     A            H4SEQN    R               REFFLD(H1SEQN)
     A            H5TITL    R               REFFLD(H1TITL)
     A            H5NAME    R               REFFLD(H1NAME)
     A            H5INIT    R               REFFLD(H1INIT)
     A            H5ADR1    R               REFFLD(H1ADR1)
     A            H5ADR2    R               REFFLD(H1ADR2)
     A            H5ADR3    R               REFFLD(H1ADR3)
     A            H5PCD1    R               REFFLD(H1PCD1)
     A            H5PCD2    R               REFFLD(H1PCD2)
     A            H5BRTL    R               REFFLD(H1BRTL)
     A            H5NINO    R               REFFLD(H1NINO)
     A            H5DOB     R               REFFLD(H1DOB)
     A            H5SEQN    R               REFFLD(H1SEQN)
     A            TAXIND    R
     A            NXASQN    R
     A            ACHCGD    R
     A            XLCD      R               REFFLD(LCD)
     A            XCHTP     R               REFFLD(CHTP)
     A            XTNLU     R               REFFLD(TNLU)
     A            PSTR           1          TEXT('Post 5/4/01 R105')
     A                                      COLHDG('Post' '5/4/01' 'R105')
      ** Start of Change MD055446
     A            H1DOBC         2  0       TEXT('Holder 1 DOB Century')
     A                                      COLHDG('Holder 1 DOB century')
     A            H2DOBC         2  0       TEXT('Holder 2 DOB Century')
     A                                      COLHDG('Holder 2 DOB century')
     A            H3DOBC         2  0       TEXT('Holder 3 DOB Century')
     A                                      COLHDG('Holder 3 DOB century')
     A            H4DOBC         2  0       TEXT('Holder 4 DOB Century')
     A                                      COLHDG('Holder 4 DOB century')
     A            H5DOBC         2  0       TEXT('Holder 5 DOB Century')
     A                                      COLHDG('Holder 5 DOB century')
      ** End of Change MD055446
