      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas Customer Grouping Codes   Physical file')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDCGRPPD - Midas SD Customer Grouping Codes               *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CSD003             Date 15Sep98               *
      *                 CDL002             Date 14Jan97               *
      *                 S01459             Date 14Jan97               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  CDL002 - FX Netting:                                         *
      *           - Addition of D6NETG, D6NTCU, D6NTCP, D6NTND, D6NTMM*
      *  S01459 - Addition of Midas headerbox.                        *
      *                                                               *
      *****************************************************************
     A          R SDCGRPD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            D6SNBR         1          TEXT('Set Number')
     A                                      COLHDG('Set' +
     A                                             'Number' )
     A            D6GPCD         4          TEXT('Group Code')
     A                                      COLHDG('Group' +
     A                                             'Code' )
     A            D6LCD          5  0       TEXT('Last Change Date')
     A                                      COLHDG('Last' +
     A                                             'Change Date' )
     A                                      EDTCDE(3)
     A            D6TYLC         1          TEXT('Type of Last Change')
     A                                      COLHDG('Type of' +
     A                                             'Last Change' )
     A            D6GPDS        30          TEXT('Group Description')
     A                                      COLHDG('Group Description' )
     A            D6NETG         1          TEXT('Net Group')
     A                                      COLHDG('Net' +
     A                                             'Group' )
     A            D6NTCU         6          TEXT('Netting Settlmnt Customer')
     A                                      COLHDG('Netting Settlmnt' +
     A                                             'Customer' )
     A            D6NTCP         1          TEXT('Net by Currency Pairs')
     A                                      COLHDG('Net by' +
     A                                             'Currency Pairs' )
     A            D6NTND         2S 0       TEXT('Net Notice Days')
     A                                      COLHDG('Net Notice' +
     A                                             'Days' )
     A                                      EDTCDE(3)
     A            D6NTMM         1          TEXT('Net Manual Matching')
     A                                      COLHDG('Net Manual' +
     A                                             'Matching' )
     A*=====================================================================
