      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Client limits')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDCLLMPD -  Midas SD Customer limits                      *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *  Last Amend No. CGL011             Date 20Sep99               *
      * Midas DBA 3.01 -----------------------------------------------*
      *  Prev Amend No. CDL006             Date 26Apr99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CSD003             Date 15Sep98               *
      *                 S01459             Date 24Jun98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGL011 - Collateral Processing for Midas                     *
      *  CDL006 - Dealing Fiduciary.                                  *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  S01459 - Addition of Midas headerbox.                        *
      *                                                               *
      *****************************************************************
     A          R SDCLLMD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            DZCUST         6          TEXT('Customer Number')
     A                                      COLHDG('Customer' +
     A                                             'Number' )
     A            DZLEVL         1          TEXT('Level')
     A                                      COLHDG('Level' )
     A            DZBCCD         3          TEXT('Branch/Company Code')
     A                                      COLHDG('Branch/Company' +
     A                                             'Code' )
     A            DZLCD          5  0       TEXT('Last Change Date')
     A                                      COLHDG('Last' +
     A                                             'Change Date' )
     A                                      EDTCDE(3)
     A            DZTYLC         1          TEXT('Type of Last Change')
     A                                      COLHDG('Type of' +
     A                                             'Last Change' )
     A            DZFXLT         3          TEXT('FX Limit Type')
     A                                      COLHDG('FX Limit' +
     A                                             'Type' )
     A            DZFLAM         9  0       TEXT('FX Limit Amount')
     A                                      COLHDG('FX Limit' +
     A                                             'Amount' )
     A                                      EDTCDE(3)
     A            DZFLED         5  0       TEXT('FX Limit Expiry Date')
     A                                      COLHDG('FX Limit' +
     A                                             'Expiry Date' )
     A                                      EDTCDE(3)
     A            DZFLRD         5  0       TEXT('FX Limit Review Date')
     A                                      COLHDG('FX Limit' +
     A                                             'Review Date' )
     A                                      EDTCDE(3)
     A            DZFLFQ         1          TEXT('FX Limit Frequency')
     A                                      COLHDG('FX Limit' +
     A                                             'Frequency' )
     A            DZFFDN         2S 0       TEXT('FX Frequency Day No.')
     A                                      COLHDG('FX Frequency' +
     A                                             'Day No.' )
     A                                      EDTCDE(3)
     A            DZMDDR         9  0       TEXT('MDDR Amount')
     A                                      COLHDG('MDDR' +
     A                                             'Amount' )
     A                                      EDTCDE(3)
     A            DZLLTY         3          TEXT('Lending Limit Type')
     A                                      COLHDG('Lending' +
     A                                             'Limit Type' )
     A            DZLLAM         9  0       TEXT('Lending Limit Amount')
     A                                      COLHDG('Lending' +
     A                                             'Limit Amount' )
     A                                      EDTCDE(3)
     A            DZLLED         5  0       TEXT('Lending Limit Expiry Date')
     A                                      COLHDG('Lending Limit' +
     A                                             'Expiry Date' )
     A                                      EDTCDE(3)
     A            DZLLRD         5  0       TEXT('Lending Limit Review Date')
     A                                      COLHDG('Lending Limit' +
     A                                             'Review Date' )
     A                                      EDTCDE(3)
     A            DZLLFR         1          TEXT('Lending Limit Frequency')
     A                                      COLHDG('Lending Limit' +
     A                                             'Frequency' )
     A            DZLFDN         2S 0       TEXT('Lending Frequency Day No.')
     A                                      COLHDG('Lending Frequency' +
     A                                             'Day No.' )
     A                                      EDTCDE(3)
     A            DZSECD         1          TEXT('Secured')
     A                                      COLHDG('Secured' )
     A            DZFRLA         9  0       TEXT('FRA Limit Amount')
     A                                      COLHDG('FRA Limit' +
     A                                             'Amount' )
     A                                      EDTCDE(3)
     A            DZFRED         5  0       TEXT('FRA Expiry Date')
     A                                      COLHDG('FRA Expiry' +
     A                                             'Date' )
     A                                      EDTCDE(3)
     A            DZFRRD         5  0       TEXT('FRA Review Date')
     A                                      COLHDG('FRA Review' +
     A                                             'Date' )
     A                                      EDTCDE(3)
     A            DZFRFQ         1          TEXT('FRA Review Frequency')
     A                                      COLHDG('FRA Review' +
     A                                             'Frequency' )
     A            DZFRAD         2S 0       TEXT('FRA Frequency Day No.')
     A                                      COLHDG('FRA Frequency' +
     A                                             'Day No.' )
     A                                      EDTCDE(3)
     A            DZIRLM         9  0       TEXT('IRS Limit Amount')
     A                                      COLHDG('IRS Limit' +
     A                                             'Amount' )
     A                                      EDTCDE(3)
     A            DZIRED         5  0       TEXT('IRS Expiry Date')
     A                                      COLHDG('IRS Expiry' +
     A                                             'Date' )
     A                                      EDTCDE(3)
     A            DZIRDT         5  0       TEXT('IRS Review Date')
     A                                      COLHDG('IRS Review' +
     A                                             'Date' )
     A                                      EDTCDE(3)
     A            DZIRFQ         1          TEXT('IRS Review Frequency')
     A                                      COLHDG('IRS Review' +
     A                                             'Frequency' )
     A            DZIFDN         2S 0       TEXT('IRS Frequency Day No.')
     A                                      COLHDG('IRS Frequency' +
     A                                             'Day No.' )
     A                                      EDTCDE(3)
     A            DZMMTY         3          TEXT('Money market limit type')
     A                                      COLHDG('Money market' +
     A                                             'limit type' )
     A            DZMMAM         9  0       TEXT('Money market limit amount')
     A                                      COLHDG('Money market' +
     A                                             'limit amount' )
     A                                      EDTCDE(3)
     A            DZMMED         5  0       TEXT('Money market expiry date')
     A                                      COLHDG('Money market' +
     A                                             'expiry date' )
     A                                      EDTCDE(3)
     A            DZMMRD         5  0       TEXT('Money market review date')
     A                                      COLHDG('Money market' +
     A                                             'review date' )
     A                                      EDTCDE(3)
     A            DZMMFR         1          TEXT('Money market limit Freq.')
     A                                      COLHDG('Money market' +
     A                                             'limit Freq.' )
     A            DZMFDN         2S 0       TEXT('Money market Freq. day no')
     A                                      COLHDG('Money market' +
     A                                             'Freq. day no' )
     A                                      EDTCDE(3)
     A            DZMSEC         1          TEXT('Money market secured')
     A                                      COLHDG('Money market' +
     A                                             'secured' )
     A            DZMLAM         9  0       TEXT('Money market Line amount')
     A                                      COLHDG('Money market' +
     A                                             'Line amount' )
     A                                      EDTCDE(3)
     A            DZFXLA         9  0       TEXT('FX line amount')
     A                                      COLHDG('FX line' +
     A                                             'amount' )
     A                                      EDTCDE(3)
     A            DZFXFA         9  0       TEXT('FX Forward limit amount')
     A                                      COLHDG('FX Forward' +
     A                                             'limit amount' )
     A                                      EDTCDE(3)
     A            DZPLTY         3          TEXT('Prec metals limit type')
     A                                      COLHDG('Prec metals' +
     A                                             'limit type' )
     A            DZPFAM         9  0       TEXT('Prec metals frwd lim amt')
     A                                      COLHDG('Prec metals' +
     A                                             'frwd lim amt' )
     A                                      EDTCDE(3)
     A            DZPSAM         9  0       TEXT('Prec metal Spot limit amt')
     A                                      COLHDG('Prec metal' +
     A                                             'Spot limit amt' )
     A                                      EDTCDE(3)
     A            DZPLED         5  0       TEXT('Prec metals expiry date')
     A                                      COLHDG('Prec metals' +
     A                                             'expiry date' )
     A                                      EDTCDE(3)
     A            DZPLVD         5  0       TEXT('Prec metals review date')
     A                                      COLHDG('Prec metals' +
     A                                             'review date' )
     A                                      EDTCDE(3)
     A            DZPLRF         1          TEXT('Prec metals review freq')
     A                                      COLHDG('Prec metals' +
     A                                             'review freq' )
     A            DZPLAM         9  0       TEXT('Prec metals line amount')
     A                                      COLHDG('Prec metals' +
     A                                             'line amount' )
     A                                      EDTCDE(3)
     A*                                              Begin /CDL006/
     A            DZFILT         3          TEXT('Fiduciary Limit Type')
     A                                      COLHDG('Fiduciary Limiy Type')
     A            DZFILA         9  0       TEXT('Fiduciary Limit Amount')
     A                                      COLHDG('Fiduciary Limit' +
     A                                             'Amount')
     A*                                              End   /CDL006/
      *                                              Begin /CGL011/
     A            DZFLSC         1          TEXT('FX Limit Secured')
     A                                      COLHDG('FX Limit Secured')
      *                                              End   /CGL011/
     A*=====================================================================
