      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas Counterparty Nostros      Physical file')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDCNSTPD -  Counterparty Nostros                          *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CSD003             Date 24Jun98               *
      *                 S01459             Date 24Jun98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  S01459 - Addition of Midas headerbox.                        *
      *                                                               *
      *****************************************************************
     A          R SDCNSTD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            AWCPNC         8          TEXT('Counterparty Nostro Code')
     A                                      COLHDG('Counterparty' +
     A                                             'Nostro Code' )
     A            AWLCD          5  0       TEXT('Last Change Date')
     A                                      COLHDG('Last' +
     A                                             'Change Date' )
     A                                      EDTCDE(3)
     A            AWTYLC         1          TEXT('Type of Last Change')
     A                                      COLHDG('Type of' +
     A                                             'Last Change' )
     A            AWCPNM        35          TEXT('Counterparty Nostro Name')
     A                                      COLHDG('Counterparty' +
     A                                             'Nostro Name' )
     A            AWCNTN        20          TEXT('Counterparty Nostro Town')
     A                                      COLHDG('Counterparty' +
     A                                             'Nostro Town' )
     A            AWCSN1         7          TEXT('Customer Shortname part 1')
     A                                      COLHDG('Customer' +
     A                                             'Shortname part 1' )
     A            AWCSN2         3          TEXT('Customer Shortname part 2')
     A                                      COLHDG('Customer' +
     A                                             'Shortname part 2' )
     A            AWCABA         3  0       TEXT('Chips ABA')
     A                                      COLHDG('Chips ABA' )
     A                                      EDTCDE(3)
     A            AWSWID        12          TEXT('Swift id')
     A                                      COLHDG('Swift id' )
     A            AWCUID         6  0       TEXT('Chips UID')
     A                                      COLHDG('Chips' +
     A                                             'UID' )
     A                                      EDTCDE(3)
     A            AWCHSC         6  0       TEXT('Chaps sort code')
     A                                      COLHDG('Chaps' +
     A                                             'sort code' )
     A                                      EDTCDE(3)
     A            AWBOJC         4          TEXT('BOJ Code')
     A                                      COLHDG('BOJ' +
     A                                             'Code' )
     A            AWBACD         8          TEXT('Bankleitzahl Code')
     A                                      COLHDG('Bankleitzahl' +
     A                                             'Code' )
     A            AWFWCD         9  0       TEXT('Fedwire Code')
     A                                      COLHDG('Fedwire' +
     A                                             'Code' )
     A                                      EDTCDE(3)
     A            AWTXA1        10          TEXT('MIDAS Telex Shortname')
     A                                      COLHDG('MIDAS Telex' +
     A                                             'Shortname' )
     A            AWSTAD        12          TEXT('STTX Address')
     A                                      COLHDG('STTX' +
     A                                             'Address' )
     A            AWOGID        10          TEXT('Midas Export Value OGID')
     A                                      COLHDG('Midas Export' +
     A                                             'Value OGID' )
     A*=====================================================================
