      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD COB processing')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDCOBPPD -  Midas SD System control ICD data              *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CSD003             Date 15Sep98               *
      *                 100025             Date 26Feb96               *
      *                 CAAA01             DATE 09Jan95               *
      *                 S01517             DATE 21Jul94               *
      *                 S01491             DATE 13Jun94               *
      *                 S01459             DATE 13Jun94               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  100025 - Addition of 'COB Control Profile' field.            *
      *  CAAA01 - Addition of 'Graphical User Interface Active'       *
      *           field.                                              *
      *  S01517 - Addition of new field:                              *
      *           - 'Allow Component Bypass in COB'.                  *
      *  S01491 - Addition of new fields for Autocall Project:        *
      *           - 'Initiate ECS' field.                             *
      *           - 'Telephone Number' field.                         *
      *           - Several 'Pager Number' fields.                    *
      *  S01459 - Addition of Midas headerbox.                        *
      *                                                               *
      *****************************************************************
     A          R SDCOBPD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            DOCOPK        10          TEXT('COB Processing Key')
     A                                      COLHDG('COB' +
     A                                             'Processing Key' )
     A            DOLCD          5  0       TEXT('Last Change Date')
     A                                      COLHDG('Last' +
     A                                             'Change Date' )
     A                                      EDTCDE(3)
     A            DOTYLC         1          TEXT('Type of Last Change')
     A                                      COLHDG('Type of' +
     A                                             'Last Change' )
     A            DOAQCM         1          TEXT('Allow QCL after COB error')
     A                                      COLHDG('Allow QCL after' +
     A                                             'COB error' )
     A            DORCSP         1          TEXT('Run COB separate pools')
     A                                      COLHDG('Run COB' +
     A                                             'separate pools' )
     A            DOMNAS         2S 0       TEXT('Max.no.active COB streams')
     A                                      COLHDG('Max.no.active' +
     A                                             'COB streams' )
     A                                      EDTCDE(3)
     A            DODSCP         1          TEXT('Disp COB Pmpts before ICT')
     A                                      COLHDG('Disp COB Pmpts' +
     A                                             'Before ICT' )
     A            DOIECS         1          TEXT('Initiate ECS')
     A                                      COLHDG('Initiate' +
     A                                             'ECS' )
     A            DOTNB1        15          TEXT('Bureau Telephone Number')
     A                                      COLHDG('Bureau Telephone' +
     A                                             'Number' )
     A            DOPNB1        15          TEXT('ECS Pager Number 1')
     A                                      COLHDG('ECS Pager' +
     A                                             'Number 1' )
     A            DOPNB2        15          TEXT('ECS Pager Number 2')
     A                                      COLHDG('ECS Pager' +
     A                                             'Number 2' )
     A            DOPNB3        15          TEXT('ECS Pager Number 3')
     A                                      COLHDG('ECS Pager' +
     A                                             'Number 3' )
     A            DOPNB4        15          TEXT('ECS Pager Number 4')
     A                                      COLHDG('ECS Pager' +
     A                                             'Number 4' )
     A            DOPNB5        15          TEXT('ECS Pager Number 5')
     A                                      COLHDG('ECS Pager' +
     A                                             'Number 5' )
     A            DOABIC         1          TEXT('Allow Comp Bypass in COB')
     A                                      COLHDG('Allow Comp' +
     A                                             'Bypass in COB' )
     A            DOGUIA         1          TEXT('Graphical user I/face Act')
     A                                      COLHDG('Graphical user' +
     A                                             'I/face Act' )
     A            DOCPRF        10          TEXT('COB Control Profile')
     A                                      COLHDG('COB Control' +
     A                                             'Profile' )
     A*=====================================================================
