      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Currency/Time of Netting File')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDCTNMPD -  Midas SD Currency/Time of Netting             *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CDL025  *CREATE    Date 07Nov04               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CDL025 - FX Netting Payment Generation                       *
      *                                                               *
      *****************************************************************
     A          R SDCTNMP0                  TEXT('(c) Finastra International +
     A                                      Limited')
      *
     A            LCUST          6A         TEXT('Customer Number')
     A                                      COLHDG('Customer Number')
     A            LCCY1          3A         TEXT('Currency Code')
     A                                      COLHDG('Currency Code')
     A            LCCY2          3A         TEXT('Currency Code')
     A                                      COLHDG('Currency Code')
     A            LTIME          4A         TEXT('Time')
     A                                      COLHDG('Time')
     A            LRNTD          1S 0       TEXT('Release Notice Days')
     A                                      COLHDG('Release Notice days')
     A            LNTCP          1A         TEXT('Net by Currency Pairs')
     A                                      COLHDG('Net by' +
     A                                             'Currency Pairs' )
     A            LTYLC          1A         TEXT('Change Type')
     A                                      COLHDG('Change Type')
     A            LLCD           5S 0       TEXT('Change Date')
     A                                      COLHDG('Change Date')
