      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Country codes')                               *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDCTRYPD -  Midas SD Country codes                        *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CGL132             Date 01May13               *
      *                 CER059             Date 19Jul10               *
      *                 CER045             Date 20Jul09               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *                 CRE026             Date 24May06               *
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 BUG11806           Date 30Jul06               *
      *                 CSD031             Date 10Apr06               *
      *                 CGL035             Date 01Mar05               *
      *                 BUG3644            Date 12Jul04               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CPB001             Date  2Jun99               *
      *                 CFT004             Date 08Jul99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CSD003             Date 24Jun98               *
      *                 S01459             Date 24Jun98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL132 - FATCA Phase 1 - Customers' Identification and       *
      *           Classification - Master (Recompile)                 *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER045 - German Features - Reporting Bundesbank (Recompile)  *
      *  CRE026 - Consumer Banking (Recompile)                        *
      *  BUG11806 - Extension tables processing (recompile).          *
      *  CSD031 - Enhanced Centralised Static Data (Recompile)        *
      *  CGL035 - EUSD Upgrade to Midasplus (Recompile)               *
      *  BUG3644 - Serious Error in Collateralised Lending            *
      *  CPB001 - 'Private Banking' Module                            *
      *  CFT004 - Straight Through Processing Phase 2                 *
      *         - International Bank Account Numbers                  *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  S01459 - Addition of Midas headerbox.                        *
      *                                                               *
      *****************************************************************
      **Start of change BUG3644
     A**********R SDCTRYD0                  TEXT('(c) Misys International +                  BUG3644
     A**********                            Banking Systems Ltd. +                           BUG3644
     A**********                            2001')                                           BUG3644
     A          R SDCTRYD0                  FORMAT(GZSDCTRYPD)
      **End of change BUG3644
     A*---------------------------------------------------------------------
      **Start of change BUG3644
     A**********  A4CNCD         2          TEXT('Country Code')                             BUG3644
     A**********                            COLHDG('Country' +                               BUG3644
     A**********                                   'code' )                                  BUG3644
     A**********  A4RGCD         2          TEXT('Region Code')                              BUG3644
     A**********                            COLHDG('Region' +                                BUG3644
     A**********                                   'Code' )                                  BUG3644
     A**********  A4LCD          5  0       TEXT('Last Change Date')                         BUG3644
     A**********                            COLHDG('Last' +                                  BUG3644
     A**********                                   'Change Date' )                           BUG3644
     A**********                            EDTCDE(3)                                        BUG3644
     A**********  A4TYLC         1          TEXT('Type of Last Change')                      BUG3644
     A**********                            COLHDG('Type of' +                               BUG3644
     A**********                                   'Last Change' )                           BUG3644
     A**********  A4CNNM        30          TEXT('Country Name')                             BUG3644
     A**********                            COLHDG('Country Name' )                          BUG3644
     A**********  A4ISOC         2          TEXT('ISO Country code')                         BUG3644
     A**********                            COLHDG('ISO Country' +                           BUG3644
     A**********                                   'code' )                                  BUG3644
     A**********  A4MLOC        10          TEXT('Midas Export Value MLOC')                  BUG3644
     A**********                            COLHDG('Midas Export' +                          BUG3644
     A**********                                   'Value MLOC' )                            BUG3644
      **End of change BUG3644
      *
      *                                              Begin /CFT004/
      **Start of change BUG3644
     A**********  A4BBAN         2  0       TEXT('BBAN total length')                        BUG3644
     A**********                            COLHDG('BBAN' 'Total' +                          BUG3644
     A**********                                   'Len')                                    BUG3644
     A**********  A4BBRL         2  0       TEXT('BBAN bank length')                         BUG3644
     A**********                            COLHDG('BBAN' 'Bank' +                           BUG3644
     A**********                                   'Len')                                    BUG3644
      **End of change BUG3644
      *                                              End   /CFT004/
     A*                                              Begin /CPB001/
      **Start of change BUG3644
     A**********  A4CTAY         3          TEXT('Associated currency')                      BUG3644
     A**********                            COLHDG('Associated' +                            BUG3644
     A**********                                   'Currency' )                              BUG3644
     A**********  A4CTZP         4          TEXT('Zip code')                                 BUG3644
     A**********                            COLHDG('Zip code')                               BUG3644
     A**********  A4CTWC         2S 0       TEXT('Weighting code')                           BUG3644
     A**********                            COLHDG('Weighting' +                             BUG3644
     A**********                                   'Code' )                                  BUG3644
      **End of change BUG3644
     A*                                              End   /CPB001/
     A*=====================================================================
