      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Country Codes - LU Ext. File')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDCTX2PD   - SD Country Codes Extended File               *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2005            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CER001  *CREATE    Date 25Apr05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CER001 - LUX Upgrade to MidasPLus                            *
      *                                                               *
      *****************************************************************
     A          R SDCTRYF6                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2005')
     A            WFCTRY         2A         TEXT('COUNTRY CODE')
     A                                      COLHDG('COUNTRY' 'CODE')
     A            WFICTR         1A         TEXT('INDUSTRIALISED COUNTRY')
     A                                      COLHDG('INDUSTR.' 'COUNTRY')
     A            WFEMUM         1A         TEXT('EMU MEMBER')
     A                                      COLHDG('EMU' 'MEMBER')
     A            WFISOC         2A         TEXT('ISO COUNTRY CODE')
     A                                      COLHDG('ISO' 'COUNTRY')
     A          K WFCTRY
