      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Customer Details Extension C')                *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDCUSTXC - Customer Details Extension C                   *
      *                                                               *
      *  (c) Finastra International Limited 2014                      *
      *                                                               *
      *  Last Amend No. CSW123             Date 08Jan24               *
      *  Prev Amend No. MD050212           Date 02Apr18               *
      *                 MD046248           Date 27Oct17               *
      *                 CGL132  *CREATE    Date 01May13               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSW123 - SWIFT ISO 20022 - Phase 2 (Structured Addresses)    *
      *           (Recompile)                                         *
      *  MD050212 - Replication processing for PF/SDCUSTXC            *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL132 - FATCA Phase 1 - Customer's Identification           *
      *           Classification - Master                             *
      *                                                               *
      *****************************************************************
     A** Start of MD050212
     A          R SDCUSTX0                  FORMAT(GZSDCUSTXC)
     A**********R SDCUSTX0                  TEXT('(c) Finastra International +
     A**********                            Limited +
     A**********                            2014')
     A
     A**********  XCCUST    R               REFFLD(BBCUST SDCUSTPD)
     A
     A**********  XCACCZ         2          TEXT('Alt. Cntry of Citizenship')
     A**********                            COLHDG('Alt. Cntry of Ctz')
     A**********  XCCRDT         5P 0       TEXT('Creation Date')
     A**********                            COLHDG('Crt Date')
     A**********  XCLCUS        10          TEXT('Last Change User')
     A**********                            COLHDG('Lst Chg Usr')
     A**********  XCDRMT         1          TEXT('Dormancy Indicator')
     A**********                            COLHDG('Dormant?')
     A** End of MD050212
