      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Message to Compliance Watch')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDWMGPD - Message to Compliance Watch                     *
      *                                                               *
      *  (c) Finastra International Limited 2005                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD028  *CREATE    Date 22Aug05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD028 - KYC (Standing Data Authorisation)                   *
      *                                                               *
      *****************************************************************
      *
     A          R SDCWMGD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2005')
      *
     A            CWCNUM        10A         TEXT('Customer Number')
     A                                      COLHDG('Customer Number')
      *
     A            CWCNA1        35A         TEXT('Customer Address1')
     A                                      COLHDG('Customer Address1')
      *
     A            CWCNA2        35A         TEXT('Customer Address2')
     A                                      COLHDG('Customer Address2')
      *
     A            CWCNA3        35A         TEXT('Customer Address3')
     A                                      COLHDG('Customer Address3')
      *
     A            CWCNA4        35A         TEXT('Customer Address4')
     A                                      COLHDG('Customer Address4')
      *
     A            CWCRNM        20A         TEXT('Customer Report Name')
     A                                      COLHDG('Customer Report Name')
      *
     A            CWPAIN         1A         TEXT('Parent Indicator')
     A                                      COLHDG('Parent Indicator')
      *
     A            CWCNCZ         2A         TEXT('Country Citizenship')
     A                                      COLHDG('Country Citizenship')
      *
     A            CWBRCD         3A         TEXT('Branch Code')
     A                                      COLHDG('Branch Code')
      *
     A            CWCOLC         2A         TEXT('Country of Domicile')
     A                                      COLHDG('Country of Domicile')
      *
     A            CWBSIN         1A         TEXT('Branch Indicator')
     A                                      COLHDG('Branch Indicator')
      *
     A            CWBNBI         1A         TEXT('Bank Indicator')
     A                                      COLHDG('Bank Indicator')
      *
     A            CWDOIC         8A         TEXT('Date of First Contact  +
     A                                           (YYYYMMDD)')
     A                                      COLHDG('Date of ' +
     A                                             'First Contact' +
     A                                             '(YYYYMMDD)')
      *
     A            CWLINC         2A         TEXT('Institution Code')
     A                                      COLHDG('Institution Code')
      *
     A            CWCTNB        12A         TEXT('Telephone')
     A                                      COLHDG('Telephone')
      *
     A            CWLICD         3A         TEXT('Industry')
     A                                      COLHDG('Industry')
      *
     A            CWTAIN         1A         TEXT('Account Holder Type')
     A                                      COLHDG('Account Holder Type')
      *
     A            CWCSTY         1A         TEXT('Customer Type')
     A                                      COLHDG('Customer Type')
      *
     A            CWCGRP         1A         TEXT('Retail Customer Group')
     A                                      COLHDG('Retail Customer' +
     A                                             'Group')
      *
     A            CWTXA1        10A         TEXT('Telex Address')
     A                                      COLHDG('Telex Address')
      *
     A            CWCRPC         1A         TEXT('Corporate Customer')
     A                                      COLHDG('Corporate Customer')
      *
     A            CWFXNB        12A         TEXT('Customer Fax Number')
     A                                      COLHDG('Customer Fax Number')
      *
     A            CWIDNO        15A         TEXT('Customer Identity Number')
     A                                      COLHDG('Customer Identity' +
     A                                             'Number')
      *
     A            CWTXNB        12A         TEXT('Customer Telex Number')
     A                                      COLHDG('Customer Telex' +
     A                                             'Number')
      *
     A            CWDOBH         8A         TEXT('Date of Birth (YYYYMMDD)')
     A                                      COLHDG('Date of Birth' +
     A                                             '(YYYYMMDD)')
      *
     A            CWDOLV         8A         TEXT('Date of Last Visit +
     A                                           (YYYYMMDD)')
     A                                      COLHDG('Date of Last Visit' +
     A                                             '(YYYYMMDD)')
      *
     A            CWMDTL         5A         TEXT('Customer Mail Details')
     A                                      COLHDG('Customer Mail' +
     A                                             'Details')
      *
     A            CWAOA1        35A         TEXT('Account Owner +
     A                                           Address line 1')
     A                                      COLHDG('Account Owner' +
     A                                             'Address line 1')
      *
     A            CWAOA2        35A         TEXT('Account Owner +
     A                                           Address line 2')
     A                                      COLHDG('Account Owner' +
     A                                             'Address line 2')
      *
     A            CWAOA3        35A         TEXT('Account Owner +
     A                                           Address line 3')
     A                                      COLHDG('Account Owner' +
     A                                             'Address line 3')
      *
     A            CWAOA4        35A         TEXT('Account Owner +
     A                                           Address line 4')
     A                                      COLHDG('Account Owner' +
     A                                             'Address line 4')
      *
     A            CWTINN        15A         TEXT('TIN Number')
     A                                      COLHDG('TIN Number')
      *
     A            CWTWBH        35A         TEXT('Town of Birth')
     A                                      COLHDG('Town of Birth')
      *
     A            CWCTBH         2A         TEXT('Country of Birth')
     A                                      COLHDG('Country of Birth')
      *
     A            CWCRRT         3A         TEXT('Credit Rating')
     A                                      COLHDG('Credit Rating')
      *
     A            CWICNM        15A         TEXT('IC Number')
     A                                      COLHDG('IC Number')
      *
     A            CWPASN        15A         TEXT('Passport Number')
     A                                      COLHDG('Passport Number')
      *
     A            CWASCL         3A         TEXT('Asset Classification')
     A                                      COLHDG('Asset Classification')
      *
     A            CWFL01        50A         TEXT('Additional Customer +
     A                                           Field 1')
     A                                      COLHDG('Additional Customer' +
     A                                             'Field 1')
      *
     A            CWFL02        50A         TEXT('Additional Customer +
     A                                           Field 2')
     A                                      COLHDG('Additional Customer' +
     A                                             'Field 2')
      *
     A            CWFL03        50A         TEXT('Additional Customer +
     A                                           Field 3')
     A                                      COLHDG('Additional Customer' +
     A                                             'Field 3')
      *
     A            CWFL04        50A         TEXT('Additional Customer +
     A                                           Field 4')
     A                                      COLHDG('Additional Customer' +
     A                                             'Field 4')
      *
     A            CWFL05        50A         TEXT('Additional Customer +
     A                                           Field 5')
     A                                      COLHDG('Additional Customer' +
     A                                             'Field 5')
      *
     A            CWFL06        50A         TEXT('Additional Customer +
     A                                           Field 6')
     A                                      COLHDG('Additional Customer' +
     A                                             'Field 6')
      *
     A            CWFL07        50A         TEXT('Additional Customer +
     A                                           Field 7')
     A                                      COLHDG('Additional Customer' +
     A                                             'Field 7')
      *
     A            CWFL08        50A         TEXT('Additional Customer +
     A                                           Field 8')
     A                                      COLHDG('Additional Customer' +
     A                                             'Field 8')
      *
     A            CWFL09        50A         TEXT('Additional Customer +
     A                                           Field 9')
     A                                      COLHDG('Additional Customer' +
     A                                             'Field 9')
      *
     A            CWFL10        50A         TEXT('Additional Customer +
     A                                           Field 10')
     A                                      COLHDG('Additional Customer' +
     A                                             'Field 10')
      *
     A            CWSYPX         2A         TEXT('System Prefix')
     A                                      COLHDG('System Prefix')
      *
     A            CWTMST        26A         TEXT('Timestamp')
     A                                      COLHDG('Timestamp')
      *
