      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD MDF Data Request End File')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDDRQEPD - Midas SD Data Request End File                 *
      *                In Meridian, this is a ClientContextSendService*                       196570
      *                message.                                       *                       196570
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4.01 -------------------------------------------*
      *  Prev Amend No. 196570             Date 06Aug01               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *                 CSD006  *CREATE    Date 13Oct00               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  196570 - Patch for Market Data Feed                          *
      *  CSD006 - Market Data Feeds                                   *
      *                                                               *
      *****************************************************************
     A          R SDDRQED0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            QENODK        32          TEXT('Node key')
     A                                      COLHDG('Node' +
     A                                             'key')
     A            QEACKN         1          TEXT('Acknowledge')
     A                                      COLHDG('Acknowledge')
     A*                                                        /*Start 196570*/
     A************QEDIWS        32          TEXT('Data item watch'+
     A************                               'set key')
     A************                          COLHDG('Data item' +
     A************                                 'watch set' +
     A************                                 'key')
     A            QEDIWS        32          TEXT('Client Context '+
     A                                           'Key')
     A                                      COLHDG('Client ' +
     A                                             'Context ' +
     A                                             'Key')
     A*                                                        /* End  196570*/
     A*=====================================================================
