      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD External Transaction System ID File')         *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDEXTSPD - SD External Transaction System ID File         *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2008            *
      *                                                               *
      *  Last Amend No. CUP006  *MOVED     Date 16Sep10               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Prev Amend No. CSW208  *CREATE    Date 15Apr08               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CUP006 - Moved to DMLIB as no data is delivered.             *
      *  CSW208 - SWIFT 2008 Changes                                  *
      *                                                               *
      *****************************************************************
      *
     A          R SDEXTSD0                  TEXT('(c) Misys +
     A                                      International Banking +
     A                                      Systems Ltd. 2008')
      *
     A            E9EXID         2A         TEXT('External System ID')
     A                                      COLHDG('External System' +
     A                                             'ID')
      *
     A            E9DESC        30A         TEXT('Description')
     A                                      COLHDG('Description')
      *
     A            E9AMEN         1A         TEXT('Data Input +
     A                                            Protection')
     A                                      COLHDG('Data Input '  +
     A                                             'Protection')
      *
     A            E9TIMF         1A         TEXT('Time Format')
     A                                      COLHDG('Time Format')
      *
     A            E9LCD          5P 0       TEXT('Last Change Date')
     A                                      COLHDG('Last Change' +
     A                                             'Date')
      *
     A            E9TYLC         1A         TEXT('Type of Last Change')
     A                                      COLHDG('Type of Last' +
     A                                             'Change')
      *
