      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Exemption Code Details')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDEXEMPD - Exemption code details                         *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGP001             Date 23May03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      *  Prev Amend No. CSE023  *CREATE    Date 12Jul00               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGP001 - Global Processing                                   *
      *           - Change to share format with the new global file   *
      *  CSE023 - Treaty Withholding Tax                              *
      *                                                               *
      *****************************************************************
      * Start of Change CGP001
     A          R SDEXEMD0                  FORMAT(GZSDEXEMPD)                                CGP001
     A**********                            REF(MFRFL)                                        CGP001
      **********                                                                              CGP001
     A**********R SDEXEMD0                  TEXT('(c) Misys International +                   CGP001
     A**********                            Banking Systems Ltd. +                            CGP001
     A**********                            2001')                                            CGP001
      **********                                                                              CGP001
     A**********  EXRECI    R               REFFLD(RECID)                                     CGP001
     A**********                            TEXT('Record Identifier')                         CGP001
     A**********                            COLHDG('Record' 'Identifier')                     CGP001
      **********                                                                              CGP001
     A**********  EXCRTT    R               REFFLD(CCOD)                                      CGP001
     A**********                            TEXT('Country of Treaty')                         CGP001
     A**********                            COLHDG('Country' 'of Treaty')                     CGP001
      **********                                                                              CGP001
     A**********  EXEXCD    R               REFFLD(ZZ002)                                     CGP001
     A**********                            TEXT('Exemption Code')                            CGP001
     A**********                            COLHDG('Exemption' 'Code')                        CGP001
      **********                                                                              CGP001
     A**********  EXNARR    R               REFFLD(NAR5)                                      CGP001
     A**********                            TEXT('Narrative')                                 CGP001
     A**********                            COLHDG('Narrative')                               CGP001
      **********                                                                              CGP001
     A**********  EXTYLC    R               REFFLD(CHTP)                                      CGP001
     A**********                            TEXT('Type of Last Change')                       CGP001
     A**********                            COLHDG('Type of' 'Last' +                         CGP001
     A**********                            'Change')                                         CGP001
      **********                                                                              CGP001
     A**********  EXLCD     R               REFFLD(LCD)                                       CGP001
     A**********                            TEXT('Last Change Date')                          CGP001
     A**********                            COLHDG('Last' 'Change' +                          CGP001
     A**********                            'Date')                                           CGP001
      **********                                                                              CGP001
      * End of Change CGP001                                                                  CGP001
