      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_NM                                                        *
/*EXI *  TEXT('Midas SD Standing Data Controls (Multithread APIs)')   *
      *****************************************************************
      *                                                               *
      *  Midas - Standing data Module                                 *
      *                                                               *
      *  PF/SDFCTZTD  - Standing Data Controls (Multithread APIs)     *
      *                                                               *
      *  (c) Finastra International Limited 2014                      *
      *                                                               *
      *  Last Amend No. MD061009           Date 23Jan23               *
      *  Prev Amend No. MD046248           Date 27Oct17               *
      *                 CPK030             Date 08Apr14               *
      *                 MD025467 *CREATE   Date 28Feb14               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD061009 - Deliverable Data Split for SDFCTLPA and GPFCTLPA  *
      *  MD046248 - Finastra Rebranding                               *
      *  CPK030 - Clean up of deliverable data library.               *
      *  MD025467 - API locking issues Redesign Approach              *
      *                                                               *
      *****************************************************************
      * Start of MD061009
     A**********R SDFCTLA0                  FORMAT(SDFCTLPA)                                MD061009
     A          R SDFCTLA0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            AHFLNM        10          TEXT('Filename')
     A                                      COLHDG('Filename' )
     A            AHNORC         5  0       TEXT('No. of Records')
     A                                      COLHDG('No. of' +
     A                                             'Records' )
     A                                      EDTCDE(3)
     A            AHNOIN         5  0       TEXT('No. of Inserts')
     A                                      COLHDG('No. of' +
     A                                             'Inserts' )
     A                                      EDTCDE(3)
     A            AHNOAM         5  0       TEXT('No. of Amends')
     A                                      COLHDG('No. of' +
     A                                             'Amends' )
     A                                      EDTCDE(3)
     A            AHNODL         5  0       TEXT('No. of Deletes')
     A                                      COLHDG('No. of' +
     A                                             'Deletes' )
     A                                      EDTCDE(3)
      * End of MD061009
      *****************************************************************
