      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD IGA Country Update List')                     *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDFTIGPD - Midas SD IGA Country Update List File          *
      *                                                               *
      *  (c) Finastra International Limited 2013                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CGL132  *CREATE    Date 01May13               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL132 - FATCA Phase 1 - Customers' Identification and       *
      *           Classification - Master                             *
      *                                                               *
      *****************************************************************
     A          R SDFTIGD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2013')
     A            IGCNCD         2A         TEXT('Country Code')
     A                                      COLHDG('Country Code')
     A            IGCNNM        30A         TEXT('Country Code Name')
     A                                      COLHDG('Country Code Name')
     A            IGCUST         6A         TEXT('Customer Number')
     A                                      COLHDG('Customer Number')
     A            IGRPNM        20A         TEXT('Customer Report Name')
     A                                      COLHDG('Customer Report Name')
     A            IGRPTN        10A         TEXT('Customer Report Town')
     A                                      COLHDG('Customer Report Town')
     A            IGFFST         2A         TEXT('New FFI Sub-Type')
     A                                      COLHDG('New FFI Sub-Type')
     A            IGCLAC         5A         TEXT('New FATCA +
     A                                       Classification Code')
     A                                      COLHDG('New FATCA' +
     A                                      'Classification Code')
