      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD CRS Naho Detail File')                        *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDICRNHPD - Midas SD CRS Invalid Customer Detail - Detail *
      *                                                               *
      *  (c) Finastra International Limited 2016                      *
      *                                                               *
      *  Last Amend No. MD041311           Date 19Sep16               *
      *  Prev Amend No. MD040876  *CREATE  Date 26Aug16               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD041311 - CRS Type is populated even if there is no CRS Type*
      *             defined in MQ input                               *
      *  MD040876 - CRS MQ                                            *
      *                                                               *
      *****************************************************************
      *
     A          R SDICRSND0                 TEXT('(c) Finastra +
     A                                      International Limited +
     A                                      2016')
     A            DDNAHD        10A         TEXT('Non Accnt Hldr')
     A                                      COLHDG('Non Accnt Hldr')
     A            DDCTRY         2A         TEXT('Country')
     A                                      COLHDG('Country')
     A            DDREPN         1A         TEXT('Subject to Reporting')
     A                                      COLHDG('Subject to Reporting')
      ** Start of change MD041311
     A**********  DDREPR       128A         TEXT('Reporting - Remark')                      MD041311
     A**********                            COLHDG('Reporting - Remark')                    MD041311
     A**********  DDREPD         5P 0       TEXT('Reporting - Date')                        MD041311
     A**********                            COLHDG('Reporting - Date')                      MD041311
     A**********  DDREPM         6A         TEXT('Reporting - Time')                        MD041311
     A**********                            COLHDG('Reporting - Time')                      MD041311
     A            DDREPU        10A         TEXT('Reporting - User')
     A                                      COLHDG('Reporting - User')
     A            DDREPD         6A         TEXT('Reporting - Date')
     A                                      COLHDG('Reporting - Date')
     A            DDREPM         6A         TEXT('Reporting - Time')
     A                                      COLHDG('Reporting - Time')
     A            DDREPR       128A         TEXT('Reporting - Remark')
     A                                      COLHDG('Reporting - Remark')
      ** End of change MD041311
     A            DDEVE1         2A         TEXT('Evidence 1')
     A                                      COLHDG('Evidence 1')
      ** Start of change MD041311
     A**********  DDEVS1         3S 0       TEXT('Evidence Seq 1')                          MD041311
     A**********                            COLHDG('Evidence Seq 1')                        MD041311
     A            DDEVS1         3A         TEXT('Evidence Seq 1')
     A                                      COLHDG('Evidence Seq 1')
      ** End of change MD041311
     A            DDEVE2         2A         TEXT('Evidence 2')
     A                                      COLHDG('Evidence 2')
      ** Start of change MD041311
     A**********  DDEVS2         3S 0       TEXT('Evidence Seq 2')                          MD041311
     A**********                            COLHDG('Evidence Seq 2')                        MD041311
     A            DDEVS2         3A         TEXT('Evidence Seq 2')
     A                                      COLHDG('Evidence Seq 2')
      ** End of change MD041311
     A            DDEVE3         2A         TEXT('Evidence 3')
     A                                      COLHDG('Evidence 3')
      ** Start of change MD041311
     A**********  DDEVS3         3S 0       TEXT('Evidence Seq 3')                          MD041311
     A**********                            COLHDG('Evidence Seq 3')                        MD041311
     A            DDEVS3         3A         TEXT('Evidence Seq 3')
     A                                      COLHDG('Evidence Seq 3')
      ** End of change MD041311
     A            DDEVE4         2A         TEXT('Evidence 4')
     A                                      COLHDG('Evidence 4')
      ** Start of change MD041311
     A**********  DDEVS4         3S 0       TEXT('Evidence Seq 4')                          MD041311
     A**********                            COLHDG('Evidence Seq 4')                        MD041311
     A            DDEVS4         3A         TEXT('Evidence Seq 4')
     A                                      COLHDG('Evidence Seq 4')
      ** End of change MD041311
     A            DDEVE5         2A         TEXT('Evidence 5')
     A                                      COLHDG('Evidence 5')
      ** Start of change MD041311
     A**********  DDEVS5         3S 0       TEXT('Evidence Seq 5')                          MD041311
     A**********                            COLHDG('Evidence Seq 5')                        MD041311
     A            DDEVS5         3A         TEXT('Evidence Seq 5')
     A                                      COLHDG('Evidence Seq 5')
      ** End of change MD041311
     A            DDTINN        25A         TEXT('TIN')
     A                                      COLHDG('TIN')
      ** Start of change MD041311
     A**********  DDEFFD         5P 0       TEXT('Effective Date')                          MD041311
     A**********                            COLHDG('Effective Date')                        MD041311
     A**********  DDEXPD         5P 0       TEXT('Expiry Date')                             MD041311
     A**********                            COLHDG('Expiry Date')                           MD041311
     A            DDEFFD         6A         TEXT('Effective Date')
     A                                      COLHDG('Effective Date')
     A            DDEXPD         6A         TEXT('Expiry Date')
     A                                      COLHDG('Expiry Date')
      ** End of change MD041311
     A            DDCODO         1A         TEXT('Country of Domicile')
     A                                      COLHDG('Ctry of Domicile')
     A            DDJACM         1A         TEXT('Joint Acnt Member')
     A                                      COLHDG('Joint Acnt Member')
     A            DDMALC         1A         TEXT('Mailing Country')
     A                                      COLHDG('Mailing Country')
     A            DDPHNN         1A         TEXT('Phone Number Ctry')
     A                                      COLHDG('Phone Number Ctry')
     A            DDRPAY         1A         TEXT('Reg Payment')
     A                                      COLHDG('Reg Payment')
      ** Start of change MD041311
     A            DDFILR       125A         TEXT('Filler')
     A                                      COLHDG('Reg Payment')
      ** End of change MD041311
     A            DDTINS         1A         TEXT('TIN')
     A                                      COLHDG('TIN')
     A            DDTMSN          Z         TEXT('Timestamp')
     A                                      COLHDG('Timestamp')
     A            DDFRNN        20A         TEXT('Front Office ID')
     A                                      COLHDG('Front Office ID')
      *****************************************************************
