      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD API Customer fmt defn file- invalid cust')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data ILE Module                             *
      *                                                               *
      *  PF/SDICUSDPD - Invalid Customers                             *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Last Amend No. CSW207A            Date 05Aug07               *
      *  Prev Amend No. CSW207             Date 07Jul07               *
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSW037A            Date 02May05               *
      *                 CSD025             Date 11Jan05               *
      *                 CSW037             Date 15Dec04               *
      *                 CSW036             Date 15Dec04               *
      *                 CGP001             Date 23May03               *
      * Midas Release 4.01 -------------------------------------------*
      *                 CSW024             Date 31Aug01               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CAP034  *CREATE    Date 26apr99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSW207A - SWIFT 2007 Changes                                 *
      *  CSW207 - SWIFT 2007 Changes                                  *
      *  CSW037A- Additional Field extended to 40 chars               *
      *  CSD025 - Customer De-Activation                              *
      *  CSW037 - Additional Field Data on MT300/MT320                *
      *  CSW036 - Dual SWIFT BIC held on Client Details               *
      *  CGP001 - Global Processing                                   *
      *  CSW024 - S.W.I.F.T. MT3xx Field 82/83/87.                    *
      *  CAP034 - Midas/ToF Interface                                 *
      *                                                               *
      *****************************************************************
      *
     A                                      REF(MFRFL)
     A          R SDICUSDD0                 TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            DDFOTRANIDR               REFFLD(FOTRNID)
     A            DDFOASOCIDR               REFFLD(FOTRNID)
     A                                      TEXT('Associated Front +
     A                                            Office Transaction Id')
     A                                      COLHDG('Associated' +
     A                                             'Front Office' +
     A                                             'Transaction Id')
     A            DDRPRLOCN R               REFFLD(RPRLOC)
 
      * The following fields are the "primary" details
     A            DDACTN         1A         TEXT('Action Code')
     A            DDCUSN         6A         TEXT('Customer Number')
     A            DDCNA1        35A         TEXT('Cust. Name & Adr.1')
     A            DDCSSN        10A         TEXT('Customer Shortname')
     A            DDCNA2        35A         TEXT('Cust. Name & Adr.2')
     A            DDDRCS         7A         TEXT('DRS Cust. Shortname')
     A            DDLCCD         3A         TEXT('Location Code')
     A            DDCNA3        35A         TEXT('Cust. Name & Adr.3')
     A            DDCNA4        35A         TEXT('Cust. Name & Adr.4')
     A            DDCRNM        20A         TEXT('Cust. Report Name')
     A            DDCRTN        10A         TEXT('Cust. Report Town')
     A            DDDINC         3A         TEXT('Designated In Ccy')
     A            DDPAIN         1A         TEXT('Parent Indicator')
     A            DDPCNB         6A          TEXT('Parent Customer No')
     A            DDACOC         2A          TEXT('Account Officer')
     A            DDCASC         8A          TEXT('Cust. Alpha Sort')
     A            DDCNCZ         2A          TEXT('Country Citizen.')
     A            DDBSIN         1A          TEXT('Branch Indicator')
     A            DDCOLC         2A          TEXT('Country Location')
     A            DDBNBI         1A         TEXT('Bank/Non-Bank Ind.')
     A            DDSDAL         6A         TEXT('Suspended Date')
     A            DDLINC         2A         TEXT('Local Institut.')
     A            DDFCAL         6A         TEXT('Dt Initial contact')
     A            DDLICD         3A         TEXT('Local Industry cd')
     A            DDCTNB        12A         TEXT('Cust. Telephone No')
     A            DDTAIN         1A         TEXT('Taxable Indicator')
     A            DDREID         4A         TEXT('Reuter Identif.')
     A            DDBRCD         3A         TEXT('Branch Code')
     A            DDCSTY         1A         TEXT('Customer Type')
     A            DDCDEL         1A         TEXT('Allow delet.in COB')
     A            DDRWCD         4A         TEXT('Risk Weighting cd')
     A            DDMCAC         1A         TEXT('MA Anal.by Assoc.')
     A            DDCGRP         1A         TEXT('Retail Customer Gr.')
     A            DDMTSC         2A         TEXT('Margin Type/screen')
     A            DDPRBA         1A         TEXT('Private Banking Cust.')
      ** Start of change CGP001
     A            DDGCUS        10A         TEXT('Global Customer ID')
      ** End of change CGP001
      **Start of change CSD025
     A            DDDEAC         1A         TEXT('Customer De-Activated Flag')
     A            DDDEDT         6A         TEXT('Customer De-Activated Date')
      **End of change CSD025
 
      * The following fields are the "secondary" details
     A            DDCSID        12A         TEXT('Swift Identifier')
     A            DDSTAD        12A         TEXT('STTX Address')
     A            DDTXA1        10A         TEXT('Midas Tlx Shortname')
     A            DDCRPC         1A         TEXT('Corporate Customer')
     A            DDPSWC        11A         TEXT('Pseudo SWIFT code')
     A            DDSWFI         1A         TEXT('SWIFT Financ.Instr.')
     A            DDCIDA         6A         TEXT('Chips ID alpha')
     A            DDCSCA         6A         TEXT('Chaps Sort Code')
     A            DDABAS         4A         TEXT('Chips 2 ABA screen')
     A            DDBFIC         4A         TEXT('BOJ Fin. Inst. Code')
     A            DDBLCD         8A         TEXT('Bankleitzahl code')
     A            DDFWCA         9A         TEXT('Fedwire code alpha')
     A            DDSSDL         1A         TEXT('Stop Stmt. Download')
 
      **Start of Change CSW024
     A            DDCORP         1A         TEXT('Corporate Customer Flag')
     A            DDCBEI        11A         TEXT('Corporate BEI')
     A            DDRI01        40A         TEXT('MT3xx Receiver Party +
     A                                            Information 1')
     A            DDRI02        40A         TEXT('MT3xx Receiver Party +
     A                                            Information 2')
     A            DDRI03        40A         TEXT('MT3xx Receiver Party +
     A                                            Information 3')
     A            DDRI04        40A         TEXT('MT3xx Receiver Party +
     A                                            Information 4')
     A            DDRI05        40A         TEXT('MT3xx Receiver Party +
     A                                            Information 5')
     A            DDFUND        34A         TEXT('Fund Identification')
      **End of Change CSW024
      ** Start of change CSW037A
     A            DDFNAC        40A         TEXT('Fund Account Number')
     A                                      COLHDG('Fund Account Number')
      ** End of change CSW037A
      * The following fields are the "Message Routing" details
     A            DDNG01         3A         TEXT('Msg type not Gen.01')
     A            DDNG02         3A         TEXT('Msg type not Gen.02')
     A            DDNG03         3A         TEXT('Msg type not Gen.03')
     A            DDNG04         3A         TEXT('Msg type not Gen.04')
     A            DDNG05         3A         TEXT('Msg type not Gen.05')
     A            DDNG06         3A         TEXT('Msg type not Gen.06')
     A            DDNG07         3A         TEXT('Msg type not Gen.07')
     A            DDNG08         3A         TEXT('Msg type not Gen.08')
     A            DDNG09         3A         TEXT('Msg type not Gen.09')
     A            DDNG10         3A         TEXT('Msg type not Gen.10')
     A            DDNG11         3A         TEXT('Msg type not Gen.11')
     A            DDNG12         3A         TEXT('Msg type not Gen.12')
     A            DDNG13         3A         TEXT('Msg type not Gen.13')
     A            DDNG14         3A         TEXT('Msg type not Gen.14')
     A            DDNG15         3A         TEXT('Msg type not Gen.15')
     A            DDDS01         3A         TEXT('Dflt Status Rel.01')
     A            DDDS02         3A         TEXT('Dflt Status Rel.02')
     A            DDDS03         3A         TEXT('Dflt Status Rel.03')
     A            DDDS04         3A         TEXT('Dflt Status Rel.04')
     A            DDDS05         3A         TEXT('Dflt Status Rel.05')
     A            DDDS06         3A         TEXT('Dflt Status Rel.06')
     A            DDDS07         3A         TEXT('Dflt Status Rel.07')
     A            DDDS08         3A         TEXT('Dflt Status Rel.08')
     A            DDDS09         3A         TEXT('Dflt Status Rel.09')
     A            DDDS10         3A         TEXT('Dflt Status Rel.10')
     A            DDDS11         3A         TEXT('Dflt Status Rel.11')
     A            DDDS12         3A         TEXT('Dflt Status Rel.12')
     A            DDDS13         3A         TEXT('Dflt Status Rel.13')
     A            DDDS14         3A         TEXT('Dflt Status Rel.14')
     A            DDDS15         3A         TEXT('Dflt Status Rel.15')
     A            DDDNW1         6A         TEXT('Dflt Network MT1nn')
     A            DDDNW2         6A         TEXT('Dflt Network MT2nn')
     A            DDDNW3         6A         TEXT('Dflt Network MT3nn')
     A            DDDNW4         6A         TEXT('Dflt Network MT4nn')
     A            DDDNW5         6A         TEXT('Dflt Network MT5nn')
     A            DDDNW6         6A         TEXT('Dflt Network MT6nn')
     A            DDDNW7         6A         TEXT('Dflt Network MT7nn')
     A            DDDNW8         6A         TEXT('Dflt Network MT8nn')
     A            DDDNW9         6A         TEXT('Dflt Network MT9nn')
 
 
      ** Timestamp
     A            DDTMESTMP R               REFFLD(TIMESTMP)
      ** Start of change CSW036
     A            DDCSI2        12A         TEXT('Customer Swift Id 2')
     A                                      COLHDG('Customer Swift Id 2' )
      ** End of change       CSW036
      ** Start of change CSW037
      ** Start of change CSW037A
     A*****       DDFNAC        30A         TEXT('Fund Account Number')
     A*****                                 COLHDG('Fund Account Number')
      ** End of change CSW037A
      ** End of change       CSW037
      ** Start of change CSW207A
     A**Start of change CSW207
     A**********  DDCICI         4A         TEXT('Investor Capacity Indicator')              CSW207A
     A**********                            COLHDG('Investor' +                              CSW207A
     A**********                            'Capacity' 'Indicator')                          CSW207A
     A**********  DDCPCI         4A         TEXT('Party Capacity Indicator')                 CSW207A
     A**********                            COLHDG('Party' +                                 CSW207A
     A**********                            'Capacity' 'Indicator')                          CSW207A
     A**********  DDIBEI        10A         TEXT('International Business -                   CSW207A
     A**********                            Entity Identifier')                              CSW207A
     A**********                            COLHDG('International' ' Business' +             CSW207A
     A**********                            'Entity Identifier')                             CSW207A
     A**End of change CSW207
      ** End of change CSW207A
