      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD API Customer PB details - invalid PB dets')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data ILE Module                             *
      *                                                               *
      *  PF/SDICUPBPD - Invalid PRIVATE BANKING DETAILS               *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *  Prev Amend No. CAP034  *CREATE    Date 02Sep99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CAP034 - Conversion of SD inputs into modular structure to   *
      *           use as APIs.                                        *
      *****************************************************************
      *
     A                                      REF(MFRFL)
     A          R SDICUPBD0                 TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A            DDFOTRANIDR               REFFLD(FOTRNID)
     A            DDFOASOCIDR               REFFLD(FOTRNID)
     A                                      TEXT('Associated Front +
     A                                            Office Transaction Id')
     A                                      COLHDG('Associated' +
     A                                             'Front Office' +
     A                                             'Transaction Id')
     A            DDRPRLOCN R               REFFLD(RPRLOC)
 
     A            DDACTN         1A         TEXT('Action Code')
                                            COLHDG('Action Code')
     A            DDCUSN         6A         TEXT('Customer Number')
                                            COLHDG('Customer Number')
     A            DDHOLD         1A         TEXT('Hold Mail Indicator')
                                            COLHDG('Hold Mail Indicator')
     A            DDNUAC         1A         TEXT('Numbered Account Indicator')
                                            COLHDG('Numbered Account' +
                                                   'Indicator')
     A            DDAGEN         6A         TEXT('Agent')
                                            COLHDG('Agent')
     A            DDCOUN         1A         TEXT('Valid Counterparty')
                                            COLHDG('Valid Counterparty')
     A            DDREPB         1A         TEXT('Requested PB Customer')
                                            COLHDG('Requested PB' +
                                                   'Customer')
     A            DDPBST         6A         TEXT('PB Start Date')
                                            COLHDG('Start Date')
 
      ** Timestamp
     A            DDTMESTMP R               REFFLD(TIMESTMP)
