      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Identification Types')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDIDTPPD - Midas SD Identification Types                  *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2004            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Last Amend No. CSW207             Date 07Jul07               *
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CGL031  *CREATE    Date 05Jul04               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSW207 - SWIFT 2007 Changes                                  *
      *  CGL031 - Taxation of Savings Income                          *
      *                                                               *
      *****************************************************************
     A          R SDIDTPD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2004')
     A            IDIDTP         2A         TEXT('Identification Type')
     A                                      COLHDG('Identification Type')
     A            IDNARR        30A         TEXT('Identification Type +
     A                                      Narrative')
     A                                      COLHDG('Identification Type ' +
     A                                      'Narrative')
     A            IDCHTP         1A         TEXT('Type of Last Change')
     A                                      COLHDG('Type of Last Change')
     A            IDLCDT         5P 0       TEXT('Last Change Date')
     A                                      COLHDG('Last Change Date')
     A**Start of CSW207
     A            IDSWCD         4A         TEXT('SWIFT Identification Code')
     A                                      COLHDG('SWIFT Identification' +
     A                                      'Code')
     A**End of CSW207
