      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD SIWFT Extension defn file- invalid cust')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data ILE Module                             *
      *                                                               *
      *  PF/SDISWSDPD - Invalid SWIFT Extension                      *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2007            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Last Amend No. CSW207A *CREATE    Date 05Aug07               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSW207A - SWIFT 2007 Changes                                 *
      *                                                               *
      *****************************************************************
      *
     A                                      REF(MFRFL)
     A          R SDISWFDD0                 TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2007')
     A            DDFOTRANIDR               REFFLD(FOTRNID)
     A            DDFOASOCIDR               REFFLD(FOTRNID)
     A                                      TEXT('Associated Front +
     A                                            Office Transaction Id')
     A                                      COLHDG('Associated' +
     A                                             'Front Office' +
     A                                             'Transaction Id')
     A            DDTMESTMP R               REFFLD(TIMESTMP)
     A            DDRPRLOCN R               REFFLD(RPRLOC)
      *
     A            DDCICI         4A         TEXT('Investor Capacity Indicator')
     A                                      COLHDG('Investor' +
     A                                      'Capacity' 'Indicator')
     A            DDCPCI         4A         TEXT('Party Capacity Indicator')
     A                                      COLHDG('Party' +
     A                                      'Capacity' 'Indicator')
     A            DDIBEI        10A         TEXT('International Business -
     A                                      Entity Identifier')
     A                                      COLHDG('International' ' Business' +
     A                                      'Entity Identifier')
