      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Local Tax Office File')                       *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDLTOFPD - Midas SD Local Tax Office File                 *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2008            *
      *                                                               *
      *  Last Amend No. CER059             Date 19Jul10               *
      *  Prev Amend No. BUG24807           Date 08Jul09               *
      *                 CER048  *CREATE    Date 19May08               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  BUG24807 - Missing function in CER048                        *
      *  CER048 - German Features - Taxes                             *
      *                                                               *
      *****************************************************************
     A          R SDLTOFD0                  TEXT('(c) Misys Internatio-
     A                                      nal Banking Systems Ltd. +
     A                                      2008')
      *
     A            LTBRCH         3A         TEXT('Branch Code')
     A                                      COLHDG('Branch Code')
      *
     A            LTOFNM        45A         TEXT('Local Tax +
     A                                            Office Name')
     A                                      COLHDG('Local Tax' +
     A                                             'Office Name')
      *
     A            LTOFRN        20A         TEXT('Local Tax Office +
     A                                      Registration Number')
     A                                      COLHDG('Local Tax Office' +
     A                                             'Registration +
     A                                              Number')
      *
     A            LTBAKR         6A         TEXT('BAK Registration +
     A                                            Number')
     A                                      COLHDG('BAK Registration' +
     A                                             'Number')
      **Start of change BUG24807
     A            LTLCD          5  0       TEXT('Last Change Date')
     A                                      COLHDG('Last' +
     A                                             'Change Date' )
     A                                      EDTCDE(3)
     A            LTCHTP         1          TEXT('Type of Last Change')
     A                                      COLHDG('Type of' +
     A                                             'Last Change' )
      **End of change BUG24807
