      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Microfiche ICD data')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDMCFCPD - Midas SD Microfiche data                       *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Last Amend No. CSD003             DATE 22APR99               *
      *  Prev Amend No. S01459             DATE 22APR99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  S01459 - Addition of Midas headerbox.                        *
      *                                                               *
      *****************************************************************
     A          R SDMCFCD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            D1MCFC        10          TEXT('Microfiche (Key)')
     A                                      COLHDG('Microfiche' +
     A                                             '(Key)' )
     A            D1TDEV        10          TEXT('Tape Device')
     A                                      COLHDG('Tape Device' )
     A            D1TVOL         6          TEXT('Tape Volume')
     A                                      COLHDG('Tape Volume' )
     A            D1TOWN        14          TEXT('Tape Owner')
     A                                      COLHDG('Tape Owner' )
     A            D1TDEN         5S 0       TEXT('Tape Density')
     A                                      COLHDG('Tape' +
     A                                             'Density' )
     A                                      EDTCDE(3)
     A            D1CLTP         4          TEXT('Clear Tape')
     A                                      COLHDG('Clear' +
     A                                             'Tape' )
     A            D1NOCP         1S 0       TEXT('Number of Copies')
     A                                      COLHDG('Number' +
     A                                             'of Copies' )
     A                                      EDTCDE(3)
     A            D1RELN         3S 0       TEXT('Record Length')
     A                                      COLHDG('Record' +
     A                                             'Length' )
     A                                      EDTCDE(3)
     A            D1BLLN         4S 0       TEXT('Block Length')
     A                                      COLHDG('Block' +
     A                                             'Length' )
     A                                      EDTCDE(3)
     A            D1BTJQ        10          TEXT('Batch Job Queue')
     A                                      COLHDG('Batch Job Queue' )
     A            D1JOBD        10          TEXT('Job Description')
     A                                      COLHDG('Job Description' )
     A            D1LCD          5  0       TEXT('Last Change Date')
     A                                      COLHDG('Last' +
     A                                             'Change Date' )
     A                                      EDTCDE(3)
     A            D1TYLC         1          TEXT('Type of Last Change')
     A                                      COLHDG('Type of' +
     A                                             'Last Change' )
     A            D1AINZ         1          TEXT('Allow auto-INZTAP')
     A                                      COLHDG('Allow' +
     A                                             'auto-INZTAP' )
     A            D1HJBQ         1          TEXT('Hold on job queue?')
     A                                      COLHDG('Hold on' +
     A                                             'job queue?' )
     A            D1ACLR         1          TEXT('Allow Auto-clear of OUTQs')
     A                                      COLHDG('Allow Auto-clear' +
     A                                             'of OUTQs' )
     A*=====================================================================
