      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Midas modules')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDMMODPD - Midas SD Midas module flags                    *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CPB001             Date 08Jun99               *
      *                 CSD003             Date 22Apr99               *
      *                 CTI001             DATE 08APR97               *
      *                 CPL002             DATE 19MAR97               *
      *                 CRM001             DATE 16FEB95               *
      *                 S01522             DATE 07OCT94               *
      *                 S01505             DATE 21JUN94               *
      *                 S01486             DATE 21JUN94               *
      *                 S01459             DATE 21JUN94               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CPB001 - Field BGN4ST allocated to the Private Banking mod.  *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  CTI001 - Trade Innovation Interface.                         *
      *           - Changed name of field BGN3ST to Midas-Trade       *
      *             Innovation Interface.                             *
      *  CPL002 - Plato Interface:                                    *
      *           changed name of field N2ST to Midas-Plato Interface.*
      *  CRM001 - Changed 'Risk Management' to 'Interest Risk         *
      *           Management'.                                        *
      *  S01522 - Addition of 'User Defined Correspondence' module.   *
      *  S01505 - Addition of 'Analytical Accounting' module.         *
      *  S01486 - Private Banking development:                        *
      *           Change 'Lombard Credits' to 'Portfolio Lending'.    *
      *  S01459 - Addition of Midas headerbox.                        *
      *                                                               *
      *****************************************************************
     A          R SDMMODD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            BGMODS        10          TEXT('Modules')
     A                                      COLHDG('Modules' )
     A            BGLCD          5  0       TEXT('Last Change Date')
     A                                      COLHDG('Last' +
     A                                             'Change Date' )
     A                                      EDTCDE(3)
     A            BGTYLC         1          TEXT('Type of Last Change')
     A                                      COLHDG('Type of' +
     A                                             'Last Change' )
     A            BGMTMI         1          TEXT('Midas/Telex Module Ind.')
     A                                      COLHDG('Midas/Telex' +
     A                                             'Module Ind.' )
     A            BGSWFT         1          TEXT('SWIFT Funds Transfer')
     A                                      COLHDG('SWIFT Funds' +
     A                                             'Transfer' )
     A            BGSWST         1          TEXT('SWIFT Securities Trading')
     A                                      COLHDG('SWIFT Securities' +
     A                                             'Trading' )
     A            BGSWCL         1          TEXT('SWIFT Customer Lending')
     A                                      COLHDG('SWIFT Customer' +
     A                                             'Lending' )
     A            BGSWSL         1          TEXT('SWIFT Synd Loans (REDUN)')
     A                                      COLHDG('SWIFT Synd' +
     A                                             'Loans (REDUN)' )
     A            BGSWSM         1          TEXT('SWIFT Statements')
     A                                      COLHDG('SWIFT' +
     A                                             'Statements' )
     A            BGSWDL         1          TEXT('SWIFT Dealing')
     A                                      COLHDG('SWIFT' +
     A                                             'Dealing' )
     A            BGSDGL         1          TEXT('Standing data/Gen.Ledger')
     A                                      COLHDG('Standing' +
     A                                             'data/Gen.Ledger' )
     A            BGDLFX         1          TEXT('Dealing: FX')
     A                                      COLHDG('Dealing:' +
     A                                             'FX' )
     A            BGSYLN         1          TEXT('Syndicated Loans (REDUN)')
     A                                      COLHDG('Syndicated' +
     A                                             'Loans (REDUN)' )
     A            BGEXMG         1          TEXT('Exposure Management')
     A                                      COLHDG('Exposure' +
     A                                             'Management' )
     A            BGFNMO         1          TEXT('Financial Modeller')
     A                                      COLHDG('Financial' +
     A                                             'Modeller' )
     A            BGSTRT         1          TEXT('Statutory Returns')
     A                                      COLHDG('Statutory' +
     A                                             'Returns' )
     A            BGCSLN         1          TEXT('Customer Lending')
     A                                      COLHDG('Customer' +
     A                                             'Lending' )
     A            BGRTBN         1          TEXT('Retail Banking')
     A                                      COLHDG('Retail' +
     A                                             'Banking' )
     A            BGMSDL         1          TEXT('Midas/Swift direct link')
     A                                      COLHDG('Midas/Swift' +
     A                                             'direct link' )
     A            BGSECS         1          TEXT('Securities')
     A                                      COLHDG('Securities' )
     A            BGAURC         1          TEXT('Auto-reconciliations')
     A                                      COLHDG('Auto-reconciliations' )
     A            BGBDLI         1          TEXT('Bond Dealers Interface')
     A                                      COLHDG('Bond Dealers' +
     A                                             'Interface' )
     A            BGDRSD         1          TEXT('DRS Standing Data')
     A                                      COLHDG('DRS Standing' +
     A                                             'Data' )
     A            BGDRCM         1          TEXT('DRS Control module')
     A                                      COLHDG('DRS Control' +
     A                                             'module' )
     A            BGDRFE         1          TEXT('DRS Foreign Exchange')
     A                                      COLHDG('DRS Foreign' +
     A                                             'Exchange' )
     A            BGDRMM         1          TEXT('DRS Money Market')
     A                                      COLHDG('DRS Money' +
     A                                             'Market' )
     A            BGDRAR         1          TEXT('DRS Arbitrage')
     A                                      COLHDG('DRS' +
     A                                             'Arbitrage' )
     A            BGFDTR         1          TEXT('Funds Transfer')
     A                                      COLHDG('Funds' +
     A                                             'Transfer' )
     A            BGDRCA         1          TEXT('DRS Common Applications')
     A                                      COLHDG('DRS Common' +
     A                                             'Applications' )
     A            BGFUOP         1          TEXT('Futures & Options')
     A                                      COLHDG('Futures &' +
     A                                             'Options' )
     A            BGMTSL         1          TEXT('Midas/Telex Synd. Loans')
     A                                      COLHDG('Midas/Telex' +
     A                                             'Synd. Loans' )
     A            BGMTDL         1          TEXT('Midas/Telex Dealing')
     A                                      COLHDG('Midas/Telex' +
     A                                             'Dealing' )
     A            BGMTGL         1          TEXT('Midas/Telex Gen. Ledger')
     A                                      COLHDG('Midas/Telex' +
     A                                             'Gen. Ledger' )
     A            BGMTCL         1          TEXT('Midas/Telex Cust. Lending')
     A                                      COLHDG('Midas/Telex' +
     A                                             'Cust. Lending' )
     A            BGNWMI         1          TEXT('Message Management')
     A                                      COLHDG('Message' +
     A                                             'Management' )
     A            BGFIIN         1          TEXT('FRA/IRS Indicator')
     A                                      COLHDG('FRA/IRS' +
     A                                             'Indicator' )
     A            BGDLMM         1          TEXT('Dealing: MM')
     A                                      COLHDG('Dealing:' +
     A                                             'MM' )
     A            BGINCN         1          TEXT('Internal Contracts')
     A                                      COLHDG('Internal' +
     A                                             'Contracts' )
     A            BGTRMG         1          TEXT('Treasury Management')
     A                                      COLHDG('Treasury' +
     A                                             'Management' )
     A            BGRKMG         1          TEXT('Interest Risk Management')
     A                                      COLHDG('Interest Risk' +
     A                                             'Management' )
     A            BGTSKY         1          TEXT('Testkey')
     A                                      COLHDG('Testkey' )
     A            BGMIDQ         1          TEXT('Midas/Q')
     A                                      COLHDG('Midas/Q' )
     A            BGMFIC         1          TEXT('Microfiche')
     A                                      COLHDG('Microfiche' )
     A            BGIOAC         1          TEXT('Interest on accounts')
     A                                      COLHDG('Interest' +
     A                                             'on accounts' )
     A            BGWDPR         1          TEXT('Window processing requir.')
     A                                      COLHDG('Window processing' +
     A                                             'requir.' )
     A            BGSARP         1          TEXT('SAR''s processing required')
     A                                      COLHDG('SAR''s processing' +
     A                                             'required' )
     A            BGFRIN         1          TEXT('French return indicator')
     A                                      COLHDG('French return' +
     A                                             'indicator' )
     A            BGLRIN         1          TEXT('Lux return indicator')
     A                                      COLHDG('Lux return' +
     A                                             'indicator' )
     A            BGDRIN         1          TEXT('Dutch return indicator')
     A                                      COLHDG('Dutch return' +
     A                                             'indicator' )
     A            BGGRIN         1          TEXT('German return indicator')
     A                                      COLHDG('German return' +
     A                                             'indicator' )
     A            BGBRIN         1          TEXT('Belgian return indicator')
     A                                      COLHDG('Belgian return' +
     A                                             'indicator' )
     A            BGIRIN         1          TEXT('Italian return indicator')
     A                                      COLHDG('Italian return' +
     A                                             'indicator' )
     A            BGSWEI         1          TEXT('Swift External Interface')
     A                                      COLHDG('Swift External' +
     A                                             'Interface' )
     A            BGPFMG         1          TEXT('Portfolio Management')
     A                                      COLHDG('Portfolio' +
     A                                             'Management' )
     A            BGCRMG         1          TEXT('Credit Management.')
     A                                      COLHDG('Credit' +
     A                                             'Management.' )
     A            BGHORP         1          TEXT('Head Office Reporting')
     A                                      COLHDG('Head Office' +
     A                                             'Reporting' )
     A            BGAVBL         1          TEXT('Average Balances')
     A                                      COLHDG('Average' +
     A                                             'Balances' )
     A            BGMARG         1          TEXT('Margins')
     A                                      COLHDG('Margins' )
     A            BGCFMT         1          TEXT('Confirmation Matching')
     A                                      COLHDG('Confirmation' +
     A                                             'Matching' )
     A            BGMIMX         1          TEXT('Mimix')
     A                                      COLHDG('Mimix' )
     A            BGRCFI         1          TEXT('Report Control Facility')
     A                                      COLHDG('Report Control' +
     A                                             'Facility' )
     A            BGAMIN         1          TEXT('Amps Int')
     A                                      COLHDG('Amps' +
     A                                             'Int' )
     A            BGSWRT         1          TEXT('Swiss Returns')
     A                                      COLHDG('Swiss' +
     A                                             'Returns' )
     A            BGFLND         1          TEXT('Fiduciary Loans & Deposits')
     A                                      COLHDG('Fiduciary Loans' +
     A                                             '& Deposits' )
     A            BGLMCR         1          TEXT('Portfolio Lending')
     A                                      COLHDG('Portfolio' +
     A                                             'Lending' )
     A            BGCNTX         1          TEXT('Cantonal Tax')
     A                                      COLHDG('Cantonal' +
     A                                             'Tax' )
     A            BGSTDU         1          TEXT('Stamp Duty')
     A                                      COLHDG('Stamp' +
     A                                             'Duty' )
     A            BGUDRS         1          TEXT('Use DRS Shortnames')
     A                                      COLHDG('Use DRS' +
     A                                             'Shortnames' )
     A            BGCHDL         1          TEXT('Chips Dealing')
     A                                      COLHDG('Chips' +
     A                                             'Dealing' )
     A            BGCHLN         1          TEXT('Chips Lending')
     A                                      COLHDG('Chips' +
     A                                             'Lending' )
     A            BGCHOB         1          TEXT('Chips Opening Balance')
     A                                      COLHDG('Chips Opening' +
     A                                             'Balance' )
     A            BGCHIP         1          TEXT('CHIPS')
     A                                      COLHDG('CHIPS' )
     A            BGCHDI         1          TEXT('Chips Direct Link')
     A                                      COLHDG('Chips' +
     A                                             'Direct Link' )
     A            BGOPDK         1          TEXT('Optical Disk')
     A                                      COLHDG('Optical' +
     A                                             'Disk' )
     A            BGMBIN         1          TEXT('Multi-branching Indicator')
     A                                      COLHDG('Multi-branching' +
     A                                             'Indicator' )
     A            BGNNST         1          TEXT('Leo Data Nucleus')
     A                                      COLHDG('Leo Data' +
     A                                             'Nucleus' )
     A            BGNOST         1          TEXT('Leo Letters of Credit')
     A                                      COLHDG('Leo Letters' +
     A                                             'of Credit' )
     A            BGNPST         1          TEXT('Leo Collections')
     A                                      COLHDG('Leo' +
     A                                             'Collections' )
     A            BGNQST         1          TEXT('Leo Bills/Financing')
     A                                      COLHDG('Leo' +
     A                                             'Bills/Financing' )
     A            BGNRST         1          TEXT('Leo Bankers Acceptances')
     A                                      COLHDG('Leo Bankers' +
     A                                             'Acceptances' )
     A            BGNSST         1          TEXT('Leo Reimbursements')
     A                                      COLHDG('Leo' +
     A                                             'Reimbursements' )
     A            BGNTST         1          TEXT('Taxes')
     A                                      COLHDG('Taxes' )
     A            BGNUST         1          TEXT('History & Audit Facility')
     A                                      COLHDG('History &' +
     A                                             'Audit Facility' )
     A            BGNVST         1          TEXT('Management Accounts')
     A                                      COLHDG('Management' +
     A                                             'Accounts' )
     A            BGNWST         1          TEXT('IBLC Returns')
     A                                      COLHDG('IBLC' +
     A                                             'Returns' )
     A            BGNXST         1          TEXT('Retail 3')
     A                                      COLHDG('Retail' +
     A                                             '3' )
     A            BGNYST         1          TEXT('Interest on Accounts 3')
     A                                      COLHDG('Interest on' +
     A                                             'Accounts 3' )
     A            BGNZST         1          TEXT('Midas Export Data Module')
     A                                      COLHDG('Midas Export' +
     A                                             'Data Module' )
     A            BGN0ST         1          TEXT('Analytical Accounting')
     A                                      COLHDG('Analytical' +
     A                                             'Accounting' )
     A            BGN1ST         1          TEXT('User Defined Correspondence')
     A                                      COLHDG('User Defined' +
     A                                             'Correspondence' )
     A            BGN2ST         1          TEXT('Midas-Plato Interface')
     A                                      COLHDG('Midas-Plato' +
     A                                             'Interface' )
     A            BGN3ST         1          TEXT('Midas-Trade Innovation If')
     A                                      COLHDG('Midas-Trade' +
     A                                             'Innovation If' )
     A**********  BGN4ST         1          TEXT('Reserved for Later Use 41')                 CPB001
     A**********                            COLHDG('Reserved for' +                           CPB001
     A**********                                   'Later Use 41' )                           CPB001
     A            BGN4ST         1          TEXT('Private Banking')                           CPB001
     A                                      COLHDG('Private banking')                         CPB001
     A            BGN5ST         1          TEXT('Reserved for Later Use 42')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 42' )
     A            BGN6ST         1          TEXT('Reserved for Later Use 43')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 43' )
     A            BGN7ST         1          TEXT('Reserved for Later Use 44')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 44' )
     A            BGN8ST         1          TEXT('Reserved for Later Use 45')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 45' )
     A            BGN9ST         1          TEXT('Reserved for Later Use 46')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 46' )
     A            BGOAST         1          TEXT('Reserved for Later Use 47')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 47' )
     A            BGOBST         1          TEXT('Reserved for Later Use 48')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 48' )
     A            BGOCST         1          TEXT('Reserved for Later Use 49')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 49' )
     A            BGODST         1          TEXT('Reserved for Later Use 50')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 50' )
     A            BGOEST         1          TEXT('Reserved for Later Use 51')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 51' )
     A            BGOFST         1          TEXT('Reserved for Later Use 52')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 52' )
     A            BGOGST         1          TEXT('Reserved for Later Use 53')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 53' )
     A            BGOHST         1          TEXT('Reserved for Later Use 54')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 54' )
     A            BGOIST         1          TEXT('Reserved for Later Use 55')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 55' )
     A            BGOJST         1          TEXT('Reserved for Later Use 56')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 56' )
     A            BGOKST         1          TEXT('Reserved for Later Use 57')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 57' )
     A            BGOLST         1          TEXT('Reserved for Later Use 58')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 58' )
     A            BGOMST         1          TEXT('Reserved for Later Use 59')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 59' )
     A            BGONST         1          TEXT('Reserved for Later Use 60')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 60' )
     A            BGOOST         1          TEXT('Reserved for Later Use 61')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 61' )
     A            BGOPST         1          TEXT('Reserved for Later Use 62')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 62' )
     A            BGOQST         1          TEXT('Reserved for Later Use 63')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 63' )
     A            BGORST         1          TEXT('Reserved for Later Use 64')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 64' )
     A            BGOSST         1          TEXT('Reserved for Later Use 65')
     A                                      COLHDG('Reserved for' +
     A                                             'Later Use 65' )
     A*=====================================================================
