      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Nostro Extension File')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDNOSRQD - Nostro Extension File                          *
      *                                                               *
      *  (c) Finastra International Limited 2007                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Prev Amend No. 255049B            Date 08Dec08               *
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CAP186C *CREATE    Date 16Nov07               *
      *                 XXXXXX             Date                       *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  255049B - Recompile to xxDMLIB instead xxDPLIB.              *
      *  CAP186C - MQ Enabled CB APIs                                 *
      *                                                               *
      *****************************************************************
 
     A          R SDNOSRD0                  TEXT('(c) Finastra International +
                                            Limited +
                                            2007')
 
     A            DDBRCA         3A         TEXT('Branch Code')
                                            COLHDG('Branch Code')
 
     A            DDCCY          3A         TEXT('Currency code')
                                            COLHDG('Currency code')
 
     A            DDACOD        10A         TEXT('Account Code')
                                            COLHDG('Account Code')
 
     A            DDACSQ         2A         TEXT('Account Sequence')
                                            COLHDG('Account Sequence')
 
     A            COFRID        20A         TEXT('Front office ID')
                                            COLHDG('Front office ID')
 
     A            DDCUSN        20A         TEXT('Customer Number')
                                            COLHDG('Customer Number')
 
     A            DDNONB         2A         TEXT('Nostro Number')
                                            COLHDG('Nostro Number')
