      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD API cust private banking Shadow file')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data ILE Module                             *
      *                                                               *
      *  PF/SDPBSHPD - Private Banking Customer Shadow file.          *
      *                                                               *
      *                This file is an exact copy of SDPBDSPD.        *
      *                Any fields added to that file need to be       *
      *                added here as well.                            *
      *                                                               *
      *  (c) Finastra International Limited 2002                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      *                 CSD012  *CREATE    Date 15Oct02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CSD012 - Standing Data Authorisation                         *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R SDPBDSD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2002')
      *
     A            PBRECI    R               REFFLD(RECI)
      * Begin /CSD027/
     A**********  PBCNUM    R               REFFLD(CNUM)                                      CSD027
     A            PBCNUM         6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            PBHOLD         1          TEXT('Hold Mail Indicator')
     A                                      COLHDG('Hold Mail Indicator')
     A            PBNUAC         1          TEXT('Numbered Account Indicator')
     A                                      COLHDG('Numbered Account' +
     A                                             'Indicator' )
     A            PBAGEN         6S 0       TEXT('Agent')
     A                                      COLHDG('Agent')
     A            PBCOUN         1          TEXT('Valid Counterparty')
     A                                      COLHDG('Valid' +
     A                                             'Counterparty')
     A            PBREPB         1          TEXT('Requested PB Customer')
     A                                      COLHDG('Requested' +
     A                                             'PB Customer' )
     A            PBPBST         5  0       TEXT('PB Start Date')
     A                                      COLHDG('PB Start Date' )
     A            PBLCHD         5  0       TEXT('Last Change Date')
     A                                      COLHDG('Last Change Date')
     A            PBCHTP         1          TEXT('Type of Last Change')
     A                                      COLHDG('Type of Last Change')
 
     A            PBFRNT    R               REFFLD(FOTRNID)
                                            TEXT('Front Office +
                                                 Transaction Id')
                                            COLHDG('Front Office' +
                                                   'Transaction Id')
     A            PBAFRT    R               REFFLD(FOTRNID)
     A                                      TEXT('Associated Front +
     A                                            Office Transaction Id')
     A                                      COLHDG('Associated' +
     A                                             'Front Office' +
     A                                             'Transaction Id')
     A            PBREPA    R               REFFLD(RPRLOC)
     A                                      TEXT('Repair Location')
                                            COLHDG('Repair Location')
     A            PBTMES    R               REFFLD(TIMESTMP)
     A                                      TEXT('Timestamp')
                                            COLHDG('Timestamp')
