      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Portfolio management customer details')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDPLCSPD - Midas SD Portfolio management customer details *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Last Amend No. CSD003             DATE 22APR99               *
      *  Prev Amend No. CPM005             DATE 10JUN96               *
      *                 CPM004             DATE 15FEB96               *
      *                 S01486             DATE 27JUN94               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  CPM005 - PM Focus Group R10 Enhancement                      *
      *           New fields: Instrument Summary                      *
      *                       Currency Summary                        *
      *                       Secret Code                             *
      *                       + Perf. Started indicators              *
      *  CPM004 - PM Bank Portfolios:                                 *
      *           New field - Default Portfolio                       *
      *  S01486 - Private Banking: new file                           *
      *                                                               *
      *****************************************************************
     A          R SDPLCSP0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            QBCUST         6          TEXT('Customer Number')
     A                                      COLHDG('Customer' +
     A                                             'Number' )
     A            QBTYLC         1          TEXT('Type of Last Change')
     A                                      COLHDG('Type of' +
     A                                             'Last Change' )
     A            QBLCD          5  0       TEXT('Last Change Date')
     A                                      COLHDG('Last' +
     A                                             'Change Date' )
     A                                      EDTCDE(3)
     A            QBRECI         1          TEXT('Record Id')
     A                                      COLHDG('Rec' +
     A                                             'Id' )
     A            QBDLUP         2S 0       TEXT('Day of last update    DRS')
     A                                      COLHDG('Day of last' +
     A                                             'update    DRS' )
     A            QBMLUP         3          TEXT('Month of last update  DRS')
     A                                      COLHDG('Month of last' +
     A                                             'update  DRS' )
     A            QBYLUP         2S 0       TEXT('Year of last update   DRS')
     A                                      COLHDG('Year of last' +
     A                                             'update   DRS' )
     A            QBTLUP         6S 0       TEXT('Time of last update   DRS')
     A                                      COLHDG('Time of last' +
     A                                             'update   DRS' )
     A            QBTNLU         5  0       TEXT('Transact.no of last update')
     A                                      COLHDG('Last' +
     A                                             'Trans' +
     A                                             'Number' )
     A                                      EDTCDE(3)
     A            QBBDAT         6S 0       TEXT('Date of Birth (Portfolio)')
     A                                      COLHDG('Date of Birth' +
     A                                             '(Portfolio)' )
     A                                      EDTCDE(3)
     A            QBLANG        20          TEXT('Language Spoken')
     A                                      COLHDG('Language Spoken' )
     A            QBCSBY         3          TEXT('Customer Base Currency')
     A                                      COLHDG('Customer' +
     A                                             'Base Currency' )
     A            QBBYDP         1S 0       TEXT('Customer Base Curr Dec Pl')
     A                                      COLHDG('Customer Base' +
     A                                             'Curr Dec Pl' )
     A                                      EDTCDE(3)
     A            QBSAFI         1          TEXT('Safe Indicator')
     A                                      COLHDG('Safe' +
     A                                             'Indicator' )
     A            QBDCMS         1          TEXT('Documantation Sts Ind')
     A                                      COLHDG('Documantation' +
     A                                             'Sts Ind' )
     A            QBVLFQ         1          TEXT('Valuation Frequency')
     A                                      COLHDG('Valuation' +
     A                                             'Frequency' )
     A            QBVLDM         2S 0       TEXT('Valuation Day in Month')
     A                                      COLHDG('Valuation' +
     A                                             'Day in Month' )
     A                                      EDTCDE(3)
     A            QBVLND         5  0       TEXT('Next Valuation Date')
     A                                      COLHDG('Next Valuation' +
     A                                             'Date' )
     A                                      EDTCDE(3)
     A            QBS1VR         1          TEXT('Holdings/Valuation Group')
     A                                      COLHDG('Holdings/Valuation' +
     A                                             'Group' )
     A            QBS2VR         1          TEXT('Sector Breakdown Req')
     A                                      COLHDG('Sector' +
     A                                             'Breakdown Req' )
     A            QBS3VR         1          TEXT('Past Year Perf Required')
     A                                      COLHDG('Past Year' +
     A                                             'Perf Required' )
     A            QBS4VR         1          TEXT('Tax Year Perf Required')
     A                                      COLHDG('Tax Year' +
     A                                             'Perf Required' )
     A            QBS5VR         1          TEXT('Additional Perf Required')
     A                                      COLHDG('Additional' +
     A                                             'Perf Required' )
     A            QBS6VR         1          TEXT('Daily Cashflows Required')
     A                                      COLHDG('Daily Cashflows' +
     A                                             'Required' )
     A            QBS7VR         1          TEXT('Monthly Cashflows Reqd')
     A                                      COLHDG('Monthly' +
     A                                             'Cashflows Reqd' )
     A            QBS8VR         1          TEXT('Yearly Cashflows Required')
     A                                      COLHDG('Yearly Cashflows' +
     A                                             'Required' )
     A            QBAPBC         1          TEXT('All Portflios in Cust CCY')
     A                                      COLHDG('All Portflios' +
     A                                             'in Cust CCY' )
     A            QBPPCS         1          TEXT('Pool Portfolio Cust Ind')
     A                                      COLHDG('Pool Portfolio' +
     A                                             'Cust Ind' )
     A            QBDFPO         4          TEXT('Default Portfolio')
     A                                      COLHDG('Default' +
     A                                             'Portfolio' )
     A            QBINSU         1          TEXT('Instrument Summary')
     A                                      COLHDG('Instrument' +
     A                                             'Summary' )
     A            QBCYSU         1          TEXT('Currency Summary')
     A                                      COLHDG('Currency' +
     A                                             'Summary' )
     A            QBSECO        10          TEXT('Secret Code')
     A                                      COLHDG('Secret Code' )
     A            QBPFM7         1          TEXT('Perform. Started for 9997')
     A                                      COLHDG('Perform. Started' +
     A                                             'for 9997' )
     A            QBPFM8         1          TEXT('Perform. Started for 9998')
     A                                      COLHDG('Perform. Started' +
     A                                             'for 9998' )
     A            QBPFM9         1          TEXT('Perform. Started for 9999')
     A                                      COLHDG('Perform. Started' +
     A                                             'for 9999' )
     A*=====================================================================
