      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD RCF Data')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDRCFPD  - MIDAS SD RCF data .                            *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CSD003             Date 22Apr99               *
      *                 S01530             Date 19Dec94               *
      *                 S01459             DATE 19DEC94               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  S01530  - Addition of the new field 'User Data Option'.      *
      *  S01459  - Addition of Midas headerbox.                       *
      *                                                               *
      *****************************************************************
     A          R SDRCFD0                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            D0RCF         10          TEXT('RCF')
     A                                      COLHDG('RCF' )
     A            D0OFPR         1          TEXT('Office Present')
     A                                      COLHDG('Office' +
     A                                             'Present' )
     A            D0DWTI         5  0       TEXT('Distribution Wait Time')
     A                                      COLHDG('Distribution' +
     A                                             'Wait Time' )
     A                                      EDTCDE(3)
     A            D0LCD          5  0       TEXT('Last Change Date')
     A                                      COLHDG('Last' +
     A                                             'Change Date' )
     A                                      EDTCDE(3)
     A            D0TYLC         1          TEXT('Type of Last Change')
     A                                      COLHDG('Type of' +
     A                                             'Last Change' )
     A            D0UDTA         1          TEXT('User Data Option')
     A                                      COLHDG('User Data' +
     A                                             'Option' )
     A*=====================================================================
