      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Reference Rate Tolerance File')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDRRATPD - SD Reference Rate Tolerance File               *
      *                                                               *
      *  (C) Copyright Misys Banking Systems Ltd. 2006                *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CDL049 *Create     Date 31Mar06               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CDL049 - Addition of a Reference Rate field                  *
      *           Separate Tolerance Percentages for FX and Interest  *
      *           Reference Rates                                     *
      *                                                               *
      *****************************************************************
     A          R SDRRATD0                  TEXT('(C) Copyright Misys +
     A                                      Banking Systems 2006')
      *
     A            IRATET         5P 3       TEXT('FX Reference Rate +
     A                                            Tolerance Percentage')
     A                                      COLHDG('FX Reference Rate ' +
     A                                             'Tolerance Percentage')
     A            IINRRT         5P 3       TEXT('Interest Reference Rate +
     A                                            Tolerance Percentage')
     A                                      COLHDG('Interest Ref Rate' +
     A                                             'Tolerance Percentage')
