      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Tax Basket Details')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDTXBSPD - Tax basket details                             *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CGL031             Date 05Jul04               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      *                 CSE023  *CREATE    Date 12Jul00               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL031 - Taxation of Savings Income                          *
      *  CSE023 - Treaty Withholding Tax                              *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R SDTXBSD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A            TBRECI    R               REFFLD(RECID)
     A                                      TEXT('Record Identifier')
     A                                      COLHDG('Record' 'Identifier')
      *
     A            TBCRTT    R               REFFLD(CCOD)
     A                                      TEXT('Country of Treaty')
     A                                      COLHDG('Country' 'of Treaty')
      *
     A            TBTXBS    R               REFFLD(ZZ002)
     A                                      TEXT('Tax Basket')
     A                                      COLHDG('Tax' 'Basket')
      *
     A            TBEFDT    R               REFFLD(DEFF)
     A                                      TEXT('Effective Date')
     A                                      COLHDG('Effective' 'Date')
      *
     A            TBNARR    R               REFFLD(PRNR)
     A                                      TEXT('Narrative')
     A                                      COLHDG('Narrative')
      *
     A            TBTRAB    R               REFFLD(NDRT)
     A                                      TEXT('Tax Rate Applicable for Band')
     A                                      COLHDG('Tax Rate' +
     A                                      'Applicable' 'for Band')
      *
     A            TBTYLC    R               REFFLD(CHTP)
     A                                      TEXT('Type of Last Change')
     A                                      COLHDG('Type of' 'Last' +
     A                                      'Change')
      *
     A            TBLCD     R               REFFLD(LCD)
     A                                      TEXT('Last Change Date')
     A                                      COLHDG('Last' 'Change' +
     A                                      'Date')
      *
     A**Start of change CGL031
     A            TBTRTY    R               REFFLD(CHTP)
     A                                      TEXT('Transition Type')
     A                                      COLHDG('Transition Type')
     A**End of change CGL031
