      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD UDC Format Names')
     A********************************************************************S37004
     A*                                                                  *
     A*  Midas   STANDING DATA MODULE                          *
     A*                                                                  *
     A*              U.D.C.  -  PF/SDUDCNPD                              *
     A*                                                                  *
     A*     (c) Finastra International Limited 2001                      *
     A*                                                                  *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*       PREV AMENDMENT NO. S01405           DATE 30NOV92           *
     A*                          S01390           DATE 22JUN92           *
     A*                          AUS009           DATE 20DEC90           *AUS009
     A*                                                                  *
     A*    PURPOSE : FILE IS USED TO HOLD ALL THE DETAILS OF             *
     A*              THE UDC FORMAT.                                     *
     A*                                                                  *
     A*    NOTE :    File is designed to allow for future upgrades,      *
     A*    ¬¬¬¬      i.e. to include format's WIDTH, LENGTH & OUTPUTQ.   *
     A*                                                                  *
     A*---------------------------------------------------------------
     A*
     A*   MD046248 - Finastra Rebranding                                 *
     A*   S01405  -  Renamed from CONFNAME                               *
     A*   S01390  -  Release 10 Changes for Australianisation            *
     A*   AUS009  -  AUSTRALIAN PRODUCT - USER DEFINED CONFIRMATIONS      AUS009
     A*
     A*****************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*                                                               *
     A********************************************************************
     A*
     A***********                                    Begin /S01405/
     A**********R CONFNAMR
     A          R SDUDCNR1
     A***********                                    End   /S01405/
     A***********                                    Begin /S01390/
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A***********                                    End   /S01390/
     A            FNAME          4
     A                                      TEXT('Format name')
     A            FWIDTH         3  0
     A                                      TEXT('Format width')
     A            FLENTH         2  0
     A                                      TEXT('Number of lines')
     A            FOUTQ         10
     A                                      TEXT('Output queue')
     A          K FNAME
