      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD URS TABLE')                                   *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  SDURSTPA - Midas SD URS Code Standing Data File              *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2013            *
      *                                                               *
      *  Last Amend No. ERZ032   *CREATE   Date 24Jan13               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  ERZ032 - Customer Details Additional Information             *
      *                                                               *
      *****************************************************************
      *
     A          R SDURSTP0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. 2013')
      *
     A            URST           2A         TEXT('URS Code')
     A                                      COLHDG('URS' 'Code')
      *
     A            URSDES        20A         TEXT('URS Code Description')
     A                                      COLHDG('URS' 'Code' 'Description')
