      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Valid spot rates')                            *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDVSPTRD - Valid Spot Rates.                              *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CGL165             Date 23Feb15               *
      *                 CER059             Date 19Jul10               *
      *                 CER048             Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 BUG6090            Date 09May05               *
      *                 CGL029             Date 01Sep03               *
      * Midas Release 4.01 -------------------------------------------*
      *                 204923             Date 29Apr02               *
      *                 200420             Date 05Dec01               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *                 CSD006             Date 24Oct00               *
      *                 CAP059             Date 24Oct00               *
      *                 CAP058             Date 24Oct00               *
      *                 CAP057  *CREATE    Date 24Oct00               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL165 - Dual Withholding Tax                                *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER048 - German Features - Taxes                             *
      *  BUG6090 - Zone needs to be added.                            *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  204923 - Rate Fix Days Adjustment (OIS)                      *
      *  200420 - Two OIS fields are missing.                         *
      *  CSD006 - Market Data Feed                                    *
      *  CAP059 - Conversion of Forward Rates into Modular APIs       *
      *  CAP058 - Conversion of MM Interest Rates into Modular APIs   *
      *  CAP057 - Conversion of SPOT Rates into Modular APIs          *
      *                                                               *
      *****************************************************************
     A          R SDVSPTRD0                 TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*---------------------------------------------------------------------
     A
     A            AVCYCD         3          TEXT('Currency Code')
     A                                      COLHDG('Currency' +
     A                                             'code' )
     A
     A**Start of change CGL029
     A**********  AVSPAE         4          TEXT('Spot Trade Account Equiv.')                 CGL029
     A**********                            COLHDG('Spot Trade' +                             CGL029
     A**********                                   'Account Equiv.' )                         CGL029
     A**********                                                                              CGL029
     A            QQSPAE         4A
     A**********  AVFTAE         4          TEXT('Fwd Trade Account Equiv.')                  CGL029
     A**********                            COLHDG('Fwd Trade' +                              CGL029
     A**********                                   'Account Equiv.' )                         CGL029
     A**********                                                                              CGL029
     A            QQFTAE         4A
     A**********  AVSWAE         4          TEXT('Swap Trade Account Equiv.')                 CGL029
     A**********                            COLHDG('Swap Trade' +                             CGL029
     A**********                                   'Account Equiv.' )                         CGL029
     A**********                                                                              CGL029
     A            QQSWAE         4A
     A**********  AVTAC4         4          TEXT('Trade Account Code No.4')                   CGL029
     A**********                            COLHDG('Trade Account' +                          CGL029
     A**********                                   'Code No.4' )                              CGL029
     A**********                                                                              CGL029
     A            QQTAC4         4A
     A**********  AVTAC5         4          TEXT('Trade Account Code No.5')                   CGL029
     A**********                            COLHDG('Trade Account' +                          CGL029
     A**********                                   'Code No.5' )                              CGL029
     A**********                                                                              CGL029
     A            QQTAC5         4A
     A**End of change CGL029
     A            AVCDFN         2          TEXT('Cedel Default Nostro')
     A                                      COLHDG('Cedel Default' +
     A                                             'Nostro' )
     A
     A            AVECDN         2          TEXT('Euroclear Default Nostro')
     A                                      COLHDG('Euroclear' +
     A                                             'Default Nostro' )
     A
     A            AVLCD          5  0       TEXT('Last Change Date')
     A                                      COLHDG('Last' +
     A                                             'Change Date' )
     A                                      EDTCDE(3)
     A
     A            AVTYLC         1          TEXT('Type of Last Change')
     A                                      COLHDG('Type of' +
     A                                             'Last Change' )
     A
     A            AVCYNM        14          TEXT('Currency Name')
     A                                      COLHDG('Currency Name' )
     A
     A            AVSPRT        13  8       TEXT('Spot Rate')
     A                                      COLHDG('Spot' +
     A                                             'Rate' )
     A                                      EDTCDE(3)
     A
     A            AVSWCY         3          TEXT('Swift Currency Code')
     A                                      COLHDG('Swift Currency Code' )
     A
     A            AVNBDP         1S 0       TEXT('Number of Decimal Places')
     A                                      COLHDG('Number of' +
     A                                             'Decimal Places' )
     A                                      EDTCDE(3)
     A
     A            AVTXND         1S 0       TEXT('Telex Notice Days')
     A                                      COLHDG('Telex' +
     A                                             'Notice Days' )
     A                                      EDTCDE(3)
     A
     A            AVPRRT        13  8       TEXT('Par Rate')
     A                                      COLHDG('Par Rate' )
     A                                      EDTCDE(3)
     A
     A            AVSRC1         4S 0       TEXT('Statutory Returns Code 1')
     A                                      COLHDG('Statutory' +
     A                                             'Returns Code 1' )
     A                                      EDTCDE(3)
     A
     A            AVSRC2         4S 0       TEXT('Statutory Returns Code 2')
     A                                      COLHDG('Statutory' +
     A                                             'Returns Code 2' )
     A                                      EDTCDE(3)
     A
     A            AVDLCI         1          TEXT('Dealing Currency Ind.')
     A                                      COLHDG('Dealing' +
     A                                             'Currency Ind.' )
     A                                      DFT('Y')
     A
     A            AVSSNB         2S 0       TEXT('Sort Sequence Number')
     A                                      COLHDG('Sort Sequence' +
     A                                             'Number' )
     A                                      EDTCDE(3)
     A
     A            AVERLC        13  8       TEXT('Exchange Rate - Limit ccy')
     A                                      COLHDG('Exchange Rate' +
     A                                             '- Limit ccy' )
     A                                      EDTCDE(3)
     A
     A            AVMDIN         1          TEXT('Multiply/Divide Indicator')
     A                                      COLHDG('Multiply/Divide' +
     A                                             'Indicator' )
     A                                      DFT('M')
     A
     A            AVMDPR         1          TEXT('Multiply/Divide, Par')
     A                                      COLHDG('Multiply/Divide,' +
     A                                             'Par' )
     A                                      DFT('M')
     A
     A            AVMDHB         1          TEXT('Multiply/Divide, Hist Bkg')
     A                                      COLHDG('Multiply/Divide,' +
     A                                             'Hist Bkg' )
     A                                      DFT('M')
     A
     A            AVMDEX         1          TEXT('Multiply/Divide, Exchange')
     A                                      COLHDG('Multiply/Divide,' +
     A                                             'Exchange' )
     A                                      DFT('M')
     A
     A            AVNOSN        10          TEXT('Nostro Shortname')
     A                                      COLHDG('Nostro Shortname' )
     A
     A            AVSPDY         3  0       TEXT('Spot Days')
     A                                      COLHDG('Spot' +
     A                                             'Days' )
     A                                      EDTCDE(3)
     A
     A            AVHSRT        13  8       TEXT('High Spot Rate')
     A                                      COLHDG('High' +
     A                                             'Spot Rate' )
     A                                      EDTCDE(3)
     A
     A            AVLSPR        13  8       TEXT('Low Spot Rate')
     A                                      COLHDG('Low Spot' +
     A                                             'Rate' )
     A                                      EDTCDE(3)
     A
     A            AVFXSD         8S 0       TEXT('DRS FX Spot Date')
     A                                      COLHDG('DRS FX' +
     A                                             'Spot Date' )
     A                                      EDTCDE(3)
     A
     A            AVMMSD         8S 0       TEXT('DRS MM Spot Date')
     A                                      COLHDG('DRS MM' +
     A                                             'Spot Date' )
     A                                      EDTCDE(3)
     A
     A            AVNQDP         1S 0       TEXT('Normally Quoted Decimals')
     A                                      COLHDG('Normally' +
     A                                             'Quoted Decimals' )
     A                                      EDTCDE(3)
     A
     A            AVDICB         1          TEXT('Default Int. Calc. Basis')
     A                                      COLHDG('Default Int.' +
     A                                             'Calc. Basis' )
     A
     A            AVSCEX         1S 0       TEXT('Scaling Exponent')
     A                                      COLHDG('Scaling' +
     A                                             'Exponent' )
     A                                      EDTCDE(3)
     A
     A            AVEBDA        29          TEXT('Eurobond Data')
     A                                      COLHDG('Eurobond Data' )
     A
     A            AVHBRT        13  8       TEXT('Historic Brokerage Rate')
     A                                      COLHDG('Historic' +
     A                                             'Brokerage Rate' )
     A                                      EDTCDE(3)
     A
     A            AVENC1         2S 0       TEXT('Euroclear Numeric Code 1')
     A                                      COLHDG('Euroclear' +
     A                                             'Numeric Code 1' )
     A                                      EDTCDE(3)
     A
     A            AVENC2         2S 0       TEXT('Euroclear Numeric Code 2')
     A                                      COLHDG('Euroclear' +
     A                                             'Numeric Code 2' )
     A                                      EDTCDE(3)
     A
     A            AVCACD         3          TEXT('Cedel Alpha Code')
     A                                      COLHDG('Cedel Alpha Code' )
     A
     A            AVCNMC         2S 0       TEXT('Cedel Numeric Code')
     A                                      COLHDG('Cedel' +
     A                                             'Numeric Code' )
     A                                      EDTCDE(3)
     A
     A            AVWEDH         1          TEXT('WED. Holiday')
     A                                      COLHDG('WED.' +
     A                                             'Holiday' )
     A                                      DFT('N')
     A
     A            AVMONH         1          TEXT('MON. Holiday')
     A                                      COLHDG('MON.' +
     A                                             'Holiday' )
     A                                      DFT('N')
     A
     A            AVTUEH         1          TEXT('TUES. Holiday')
     A                                      COLHDG('TUES.' +
     A                                             'Holiday' )
     A                                      DFT('N')
     A
     A            AVTHUH         1          TEXT('THURS. Holiday')
     A                                      COLHDG('THURS.' +
     A                                             'Holiday' )
     A                                      DFT('N')
     A
     A            AVFRIH         1          TEXT('FRI. Holiday')
     A                                      COLHDG('FRI.' +
     A                                             'Holiday' )
     A                                      DFT('N')
     A
     A            AVSATH         1          TEXT('SAT. Holiday')
     A                                      COLHDG('SAT.' +
     A                                             'Holiday' )
     A                                      DFT('N')
     A
     A            AVSUNH         1          TEXT('SUN. Holiday')
     A                                      COLHDG('SUN.' +
     A                                             'Holiday' )
     A                                      DFT('N')
     A
     A            AVDPBF         1S 0       TEXT('Dec.Places in Big Figure')
     A                                      COLHDG('Dec.Places' +
     A                                             'in Big Figure' )
     A                                      EDTCDE(3)
     A
     A            AVBYSR        13  8       TEXT('Buy Spread Rate')
     A                                      COLHDG('Buy Spread' +
     A                                             'Rate' )
     A                                      EDTCDE(3)
     A
     A            AVBYSS         1          TEXT('Buy Spread Sign')
     A                                      COLHDG('Buy Spread' +
     A                                             'Sign' )
     A
     A            AVSLSR        13  8       TEXT('Sell Spread Rate')
     A                                      COLHDG('Sell' +
     A                                             'Spread Rate' )
     A                                      EDTCDE(3)
     A
     A            AVSLSS         1          TEXT('Sell Spread Sign')
     A                                      COLHDG('Sell' +
     A                                             'Spread Sign' )
     A
     A            AVRMCM         1  0       TEXT('RM Cashflow Magnitude')
     A                                      COLHDG('RM Cashflow' +
     A                                             'Magnitude' )
     A                                      EDTCDE(3)
     A
     A            AVRECI         1          TEXT('Record Id')
     A                                      COLHDG('Rec' +
     A                                             'Id' )
     A
     A            AVDPRU         1          TEXT('Default Priority Urgent')
     A                                      COLHDG('Default' +
     A                                             'Priority Urgent' )
     A
     A            AVDNOR         1          TEXT('Delivery Notification Req')
     A                                      COLHDG('Delivery' +
     A                                             'Notification Req' )
     A
     A            AVNDWR         1          TEXT('Non-Delivery Warning Req')
     A                                      COLHDG('Non-Delivery' +
     A                                             'Warning Req' )
     A
     A            AVGMPY         1          TEXT('Generate Multiple Payment')
     A                                      COLHDG('Generate' +
     A                                             'Multiple Payment' )
     A
     A            AVDLCD         1          TEXT('Delivery Code')
     A                                      COLHDG('Delivery' +
     A                                             'Code' )
     A
     A            AVRDFC         1          TEXT('Round Down Interest Ind')
     A                                      COLHDG('Round Down' +
     A                                             'Interest Ind' )
     A
     A            AVPMRT         1          TEXT('Precious Metal  Ind.')
     A                                      COLHDG('Precious' +
     A                                             'Metal  Ind.' )
     A
     A            AVRKSQ         3S 0       TEXT('Currency Ranking Sequence')
     A                                      COLHDG('Currency Ranking' +
     A                                             'Sequence' )
     A                                      EDTCDE(3)
     A
     A            AVDFPC         4          TEXT('Dft Fx Poss Profit Centre')
     A                                      COLHDG('Dft Fx Poss' +
     A                                             'Profit Centre' )
     A
     A            AVDDPC         4          TEXT('Dft Dir Fund Profit Cntre')
     A                                      COLHDG('Dft Dir Fund' +
     A                                             'Profit Cntre' )
     A
     A            AVTKCC         3S 0       TEXT('Telekurs Currency Code')
     A                                      COLHDG('Telekurs' +
     A                                             'Currency Code' )
     A                                      EDTCDE(3)
     A
     A            AVCQCD         2S 0       TEXT('Cheque Clearing Days')
     A                                      COLHDG('Cheque' +
     A                                             'Clearing Days' )
     A                                      EDTCDE(3)
     A
     A            AVSMLD         5S 0       TEXT('Smallest Denomination')
     A                                      COLHDG('Smallest' +
     A                                             'Denomination' )
     A                                      EDTCDE(3)
     A
     A**Start of change CGL029
     A**********  AVCSCD         4          TEXT('Cash Account Code')                         CGL029
     A**********                            COLHDG('Cash Account' +                           CGL029
     A**********                                   'Code' )                                   CGL029
     A**********                                                                              CGL029
     A            QQCSCD         4A
     A**End of change CGL029
     A            AVISON         3S 0       TEXT('Numeric ISO Currency')
     A                                      COLHDG('Numeric ISO' +
     A                                             'Currency' )
     A                                      EDTCDE(3)
     A
     A            AVISFC        35          TEXT('ISDA Financial Centre')
     A                                      COLHDG('ISDA Financial' +
     A                                             'Centre' )
     A
     A            AVMACD        35          TEXT('Major Currency Descriptn')
     A                                      COLHDG('Major Currency' +
     A                                             'Descriptn' )
     A
     A            AVFRAC         1          TEXT('Fractions Flag')
     A                                      COLHDG('Fractions' +
     A                                             'Flag' )
     A
     A            AVNUWD         1          TEXT('Numbers and Words Flag')
     A                                      COLHDG('Numbers and' +
     A                                             'Words Flag' )
     A
     A            AVMICD        35          TEXT('Minor Currency Descriptn')
     A                                      COLHDG('Minor Currency' +
     A                                             'Descriptn' )
     A
     A            AVINCY         1          TEXT('In Currency Indicator')
     A                                      COLHDG('In Currency' +
     A                                             'Indicator' )
     A
     A            AVEUER        13  8       TEXT('EMU Exchange Rate')
     A                                      COLHDG('EMU Exchange Rate')
     A
     A            AVEUMD         1          TEXT('EMU Multiply/Divide +
     A                                           Indicator')
     A                                      COLHDG('EMU Multiply/' +
     A                                             'Divide Indicator')
     A
     A            AVTPSD         5  0       TEXT('EMU Transition Period +
     A                                            Start Date')
     A                                      COLHDG('EMU Transition' +
     A                                             'Period Start Date')
     A
     A            AVTPED         5  0       TEXT('EMU Transition Period +
     A                                            End Date')
     A                                      COLHDG('EMU Transition' +
     A                                             'Period End Date')
     A
     A            AVINER        13  8       TEXT('OUT/EURO Exchange Rate')
     A                                      COLHDG('OUT/EURO Exchange' +
                                                   'Rate')
     A
     A            AVINMD         1          TEXT('OUT/EURO Multiply/Divide +
     A                                           Indicator')
     A                                      COLHDG('OUT/EURO Multiply/' +
     A                                             'Divide Indicator')
     A
     A            AVDLOC         3          TEXT('Default Location Code')
     A                                      COLHDG('Default Location' +
     A                                              'Code')
     A
     A            AVCYPI         1A         TEXT('Portfolio profile indicator')
     A                                      COLHDG('Port' 'Profile' 'Ind')
     A
     A            AVEXWC         2S 0       TEXT('Exposure Weigthing Code')
     A                                      COLHDG('Exp' 'Weigh' 'Code')
     A
     A            AVPOWC         2S 0       TEXT('Position Weigthing Code')
     A                                      COLHDG('Pos' 'Weigh' 'Code')
     A
     A            AVCYD1         2S 0       TEXT('Day n 1 renewal')
     A                                      COLHDG('Day 1' 'renewal')
     A
     A            AVCYD2         2S 0       TEXT('Day n 2 renewal')
     A                                      COLHDG('Day 2' 'renewal')
     A
     A            AVCYD3         2S 0       TEXT('Day n 3 renewal')
     A                                      COLHDG('Day 3' 'renewal')
     A
     A            AVCYLD         1A         TEXT('Last Day in Month')
     A                                      COLHDG('Last Day')
     A
     A            AVCYGR         3A         TEXT('Currency Group Code')
     A                                      COLHDG('Ccy' 'Grp' 'Code')
     A
     A            AVRENO         2S 0       TEXT('Renewal notice day')
     A                                      COLHDG('Renewal' 'notice' 'day')
     A
     A            AVSWDP         1  0       TEXT('SWIFT Number of Decimal +
     A                                            Places')
     A                                      COLHDG('SWIFT Number of ' +
     A                                              'Decimal Places')
     A            AVSWDT         5  0       TEXT('SWIFT Decimal Places +
     A                                            Activation Date')
     A                                      COLHDG('SWIFT Decimal Places' +
     A                                              ' Activation Date')
     A            AVCLSC         1          TEXT('CLS Currency')
     A                                      COLHDG('CLS Currency')
     A            AVEFDT         5P 0       TEXT('Effective Date')
     A                                      COLHDG('Effective Date')
     A
      *                                                  Begin /CSD006/
     A            AVSRDS        32A         TEXT('Spot Rate Data +
     A                                            Source Override')
     A                                      COLHDG('Spot Rate Data' +
     A                                            'Source Override')
     A
     A            AVDFTS        14S 0       TEXT('Spot Rate Data +
     A                                            Feed Timestamp')
     A                                      COLHDG('Spot Rate Data' +
     A                                            'Feed Timestamp')
      *                                                  End   /CSD006/
     A
     A            AVFOTRANID    20A         TEXT('Spot Rate FO Identifier')
     A                                      COLHDG('Spot Rate ' +
     A                                            'Identifier')
     A
     A            AVRPRLOCN      1A         TEXT('Spot Rate Repair Location')
     A                                      COLHDG('Spot Rate ' +
     A                                            'Repair Location')
     A
     A            AVTMESTMP       Z         TEXT('Spot Rate Timestamp')
     A                                      COLHDG('Spot Rate' +
     A                                            'Timestamp')
     A
      *                                                  Begin /CSD006/
     A            AVFRDS        32A         TEXT('Forward Rate Data +
     A                                            Source Override')
     A                                      COLHDG('Forward Rate Data' +
     A                                            'Source Override')
      *                                                  End   /CSD006/
     A
      *                                                  Begin /CAP059/
     A            AVFRNT        20A         TEXT('Forward Rate FO Identifier')
     A                                      COLHDG('Forward Rate ' +
     A                                            'Identifier')
      *                                                  End   /CAP059/
     A
      *                                                  Begin /CSD006/
     A            AVBODS        32A         TEXT('Borrowing Rate Data +
     A                                            Source Override')
     A                                      COLHDG('Borrowing Rate Data' +
     A                                            'Source Override')
      *                                                  End   /CSD006/
     A
      *                                                  Begin /CAP058/
     A            AVBOID        20A         TEXT('Borrowing Rate FO Identifier')
     A                                      COLHDG('Borrowing Rate ' +
     A                                            'Identifier')
      *                                                  End   /CAP058/
     A
      *                                                  Begin /CSD006/
     A            AVLEDS        32A         TEXT('Lending Rate Data +
     A                                            Source Override')
     A                                      COLHDG('Lending Rate Data' +
     A                                            'Source Override')
      *                                                  End   /CSD006/
     A
      *                                                  Begin /CAP058/
     A            AVLEID        20A         TEXT('Lending Rate FO Identifier')
     A                                      COLHDG('Lending Rate ' +
     A                                            'Identifier')
      *                                                  End   /CAP058/
     A
      *                                                  Begin /CSD006/
     A
     A            AVDTFR        32A         TEXT('Spot Rate Data Feed +
     A                                            Request Identifier')
     A                                      COLHDG('Spot Rate Data Feed' +
     A                                            'Request Identifier')
     A
     A            AVTLEX         1A         TEXT('Spot Rate Tolerance +
     A                                            Exceeded')
     A                                      COLHDG('Spot Rate' +
     A                                            'Tolerance Exceeded')
     A
     A*                                                  End   /CSD006/
     A**Start of change 200420
     A            AVSETD         3S 0       TEXT('OIS Settlement Days')
     A                                      COLHDG('OIS Settlement Days')
     A
     A            AVIRDP         1  0       TEXT('OIS Interest Rate +
     A                                      Decimal Places')
     A                                      COLHDG('OIS Interest Rate' +
     A                                      'Decimal Places')
     A**End of change 200420
      **Start of change 204923
     A            AVFXDY         1S 0       TEXT('FRA/IRS Days Adjust')
     A                                      COLHDG('FRA/IRS Days Adjust')
      **End of change 204923
     A
     A*=====================================================================
     A**Start of change BUG6090
     A            AVZONE        10A         TEXT('Zone.')
     A                                      COLHDG('Zone')
     A**End of change BUG6090
     A**Start of change CGL029
     A            AVSPAE        10A         TEXT('Spot Trade Account Equiv.')
     A                                      COLHDG('Spot Trade' +
     A                                             'Account Equiv.' )
     A            AVFTAE        10A         TEXT('Fwd Trade Account Equiv.')
     A                                      COLHDG('Fwd Trade' +
     A                                             'Account Equiv.' )
     A            AVSWAE        10A         TEXT('Swap Trade Account Equiv.')
     A                                      COLHDG('Swap Trade' +
     A                                             'Account Equiv.' )
     A            AVTAC4        10A         TEXT('Trade Account Code No.4')
     A                                      COLHDG('Trade Account' +
     A                                             'Code No.4' )
     A            AVTAC5        10A         TEXT('Trade Account Code No.5')
     A                                      COLHDG('Trade Account' +
     A                                             'Code No.5' )
     A            AVCSCD        10A         TEXT('Cash Account Code')
     A                                      COLHDG('Cash Account' +
     A                                             'Code' )
     A**End of change CGL029
      **Start of change CER048
     A            AVTCMP         9P 7       TEXT('Tax Conversion Rate +
     A                                            Margin Points')
     A                                      COLHDG('Tax Conversion +
     A                                              Rate' 'Margin +
     A                                              Points')
      **End of change CER048
      **Start of change CGL165
     A            AVTXCR        13P 8       TEXT('Tax Conversion Rate')
     A                                      COLHDG('Tax Conversion +
     A                                              Rate')
      **End of change CGL165
