      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Valid Yield Curve File layout')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data ILE Module                             *
      *                                                               *
      *  PF/SDVYLCUPD - Valid Yield Curves Details File               *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2006            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Last Amend No. CRE026  *CREATE    Date 24May06               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CRE026 - Consumer Banking                                    *
      *                                                               *
      *****************************************************************
      *
     A                                      REF(MFRFL)
     A          R SDVYLCUD0                 TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2006')
      *
      *
     A            YCRECI         1          TEXT('Record Id')
     A                                      COLHDG('Record Id')
      *
     A            YCYLDC         5          TEXT('Yield Curve')
     A                                      COLHDG('Yield Curve')
      *
     A            YCYLDD        20          TEXT('Yield Curve description')
     A                                      COLHDG('Yield Curve' +
     A                                             'description')
      *
     A            YCYLDT         1          TEXT('Yield Curve Type')
     A                                      COLHDG('Yield Curve' 'Type')
      *
     A            YCINTP         1          TEXT('Interpolation Method')
     A                                      COLHDG('Interpolation' +
     A                                             'Method')
      *
     A            YCCHTP         1          TEXT('Type of Last Change')
     A                                      COLHDG('Type of Last' 'Change')
      *
     A            YCLCDT         5  0       TEXT('Last Change Date')
     A                                      COLHDG('Last Change Date')
      *
     A            YCZONE        10          TEXT('Zone')
     A                                      COLHDG('Zone')
      *
     A            YCYLDA         3          TEXT('Yield Curve mnemonic')
     A                                      COLHDG('Yield Curve' +
                                                   'Mnemonic')
      *
     A            YCFRNT        20          TEXT('Front office id')
     A                                      COLHDG('Front office id')
      *
     A            YCTMST          Z         TEXT('Time stamp')
     A                                      COLHDG('Time stamp')
