      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Warning msgs considered as errors in API')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDWARNPD - Warning messages considered as errors in API   *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *  Last Amend No. 190876  *CREATE    Date 08Mar01               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  190876 - Reject Meridian interface deals with warnings.      *
      *           New warning if Counterparty is not a CLS Customer.  *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R SDWARND0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            WARECI         1A         TEXT('Record Id')
     A                                      COLHDG('Rec' +
     A                                             'ID')
     A            WAPGM         10A         TEXT('Program Name')
     A                                      COLHDG('Program Name')
     A            WAMSGI         7A         TEXT('Message ID')
     A                                      COLHDG('Message ID')
     A            WAMSGF        10A         TEXT('Message File')
     A                                      COLHDG('Message File')
