      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDWTRCPD - Withholding tax rate code Details              *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2015            *
      *                                                               *
      *  Last Amend No. CGL165  *CREATE    Date 17Feb15               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGL165 - Withholding Tax Enhancement                         *
      *                                                               *
      *****************************************************************
     A          R SDWTRCD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2015')
      *
     A            WTRC           2          TEXT('Withholding tax rate code')
     A                                      COLHDG('Withholding tax' +
     A                                             'rate code' )
     A            WTRT           5S 2       TEXT('Withholding tax rate')
     A                                      COLHDG('Withholding' +
     A                                             'tax rate' )
     A            MINT          13P 0       TEXT('Minimum interest')
     A                                      COLHDG('Minimum interest')
     A            CYCD           3          TEXT('Currency Code')
     A                                      COLHDG('Currency Code' )
     A            DESC          30          TEXT('Descrtipion')
     A                                      COLHDG('Description' )
     A            RITAC         10A         TEXT('Retail Int Tax Acct Code')
     A                                      COLHDG('Retail Int' +
     A                                             'Tax Account')
     A            LCD            5P 0       TEXT('Last change date')
     A                                      COLHDG('Last change date')
     A            TYPC           1          TEXT('Type of last change')
     A                                      COLHDG('Type of last change')
      *
