      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Futures and options ICD')
     A********************************************************************
     A*                                                                  *
     A*  Midas - Standing Data Module
     A*                                                                  *
     A*    PF/TABTB80 - INSTALLATION CONTROL DATA FOR FUTURES + OPTIONS  *
     A*                                                                  *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                                  *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01455             Date 28Oct93               *
      *                 S01117             Date 17/11/89              *
     A*                                                                  *
     A********************************************************************
     A*
      *  CGL029 - Increase Account Code to 10 digits                  *
     A*    S01455 - ADD NEW FIELD 'PROCESSING TYPE ON A/C KEY.
     A*           - ADD NEW FIELD 'INSTRUMENT TYPE ON A/C KEY.
     A*    S01117 - FIELD 'TBRC' ADDED (TRADE & BOOK POSITION
     A*             RECONCILABLE).
     A*
     A********************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R TABTB80F                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            RECI      R
     A            RECT      R
     A            ZZ008     R
     A            RCDE      R
     A            DFTB      R
     A            DFCB      R
     A            HPEI      R
     A            LIFI      R
     A            TBCP      R
     A            HISP      R
     A            CCCI      R
     A**Start of change CGL029
     A**********  DFBA      R                                                                 CGL029
     A            DFBAQQ    R               REFFLD(ACODQQ)
     A**********  DFCA      R                                                                 CGL029
     A            DFCAQQ    R               REFFLD(ACODQQ)
     A**End of change CGL029
     A*                                                        /S01117/
     A************ZZ053     R
     A            ZZ052     R
     A            TBRC      R
     A*                                                        /S01117/
     A            LCD       R
     A            CHTP      R
     A            TNLU      R
      *                                    Start of change /S01455/
     A            PROT      R
     A            ISTY      R
      *                                      End of change /S01455/
     A**Start of change CGL029
     A            DFBA      R               REFFLD(ACOD)
     A            DFCA      R               REFFLD(ACOD)
     A**End of change CGL029
