      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD Installation Control Record one')
     A*
     A********************************************************************
     A*                                                                ***
     A*  Midas - Standing Data Module
     A*                                                                ***
     A*        PF/TABTB10  TABLE FILE I.C.D. RECORD 1
     A*
     A*  (c) Finastra International Limited 2001                      *
     A*                                                                ***
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*     PREV AMEND NO. S01117            DATE 05/04/87
     A*                    S01118            DATE 29/05/87
     A*                    S01133            DATE 24/03/87
     A*                      S0410             DATE 25/04/83           ***
     A*                      S2659                  19/04/83           ***
     A*                      S01121                 15/07/86           ***
     A*
     A********************************************************************
     A*
     A*     MD046248 - Finastra Rebranding                               *
     A*     S01117  -  MULTIBRANCHING
     A*     S01133  -  DRS INCORPORATION
     A*     S01121  -  MODIFY KEY STRUCTURE TO HAVE COMPOSITE KEY
     A*     S01118  -  REPLACE ZZ002 WITH MODI4 IN POSITION 88 &
     A*                MODI5 IN POSITION 89.
     A*
     A********************************************************************
     A*
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R TABTB10F                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            RECI      R
     A            RECT      R
     A            ZZ008     R
     A            RCDE      R
     A            TITL      R
     A            DATF      R
     A*                                             /S01117/
     A*********** DFBR      R
     A            DFBM      R
     A*                                             /S01117/
     A            TLXM      R
     A            CHIM      R
     A            SWIM      R
     A            MODI1     R
     A            MODI2     R
     A            MODI3     R
     A            RUND      R
     A            RUNA      R
     A            SFLG      R
     A*                                                    /S01118/
     A*           ZZ002
     A            MODI4     R
     A            MODI5     R
     A*                                                    /S01118/
     A            LCD       R
     A            CHTP      R
     A            TNLU      R
