      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  MBR(APDFFLDL2) DTAMBRS((APDFFLDPD (APIFMEXPD)))              *
/*EXI *  TEXT('Midas AP Input form field display modes extension')
      *****************************************************************
      *                                                               *
      *  Midas - (Module Name) Module                                 *
      *                                                               *
      *  LF/APDFFLDL2 - Midas AP Input form field display modes       *
      *                 extension file                                *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CAP084  *CREATE    Date 25Jun03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CAP084 - Creation of field level switchable features/module  *
      *                                                               *
      *****************************************************************
     A          R APDFFLDD0                 PFILE(APDFFLDPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
     A            FILNMX
     A            FLDNMX
     A            FLMODX
     A
     A          K FILNMX
     A          K FLDNMX
     A          K FLMODX
