      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas MM Effective Interest Rate Amortisation Dtl')
      *****************************************************************
      *                                                               *
      *  Midas - Money Market Dealing Module                          *
      *                                                               *
      *  LF/MMEIRAL1 - Midas MM Effective Interest Rate Amort. Dtl.   *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2004            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. BUG12682           Date 16Nov06               *
      *  Prev Amend No. CAS009  *CREATE    Date 04May04               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  BUG12682 - MMC004600 00001 failed (Recompile)                *
      *  CAS009 - Effective Interest Rate/Amortised Cost Accounting   *
      *                                                               *
      *****************************************************************
      *
     A          R MMEIRAD0                  PFILE(MMEIRAPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2004')
      *
     A            EARECI    R
     A            EATYPE    R
     A            EATRAN    R
     A            EACCY     R
     A            EAXRAT    R
     A            EAMDIN    R
     A            EASTDT    R
     A            EAENDT    R
     A            EASDAM    R
     A            EAEDAM    R
      *
     A          K EATRAN
      *
