      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas MM Effective Interest Rate Details')
      *****************************************************************
      *                                                               *
      *  Midas - Money Market Dealing Module                          *
      *                                                               *
      *  PF/MMEIRDL2 - Midas MM Effective Interest Rate Details       *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2004            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. 232928             Date 08Apr05               *
      *  Prev Amend No. CAS009  *CREATE    Date 04May04               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  232928 - Amortise all fees non-linearly, EIR calculation,    *
      *           Non-linear amortisation calculation & adjustment    *
      *  CAS009 - Effective Interest Rate/Amortised Cost Accounting   *
      *                                                               *
      *****************************************************************
      *
     A          R MMEIRDD0                  PFILE(MMEIRDPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2004')
      *
     A          K EITRAN
     A          K EIENDT
     A          S EIADJP                    COMP(EQ 'Y')
      *
     A          R MMEIRHD0                  PFILE(MMEIRHPD)
      *
     A            EIRECI    R
     A            EITRAN    R
     A            EISTDT    R
     A            EIENDT    R
     A            EIEIR     R
     A            EIFDPA    R
     A            EIFDPC    R
     A            EIAMTD    R
     A            EIACTD    R
     A            EIAILP    R
     A            EIDSTD    R
     A            EIPRCP    R
     A            EICPTD    R
     A            EIPRDP    R
     A            EIDPTD    R
     A            EIADJP    R
     A            EIRCAL    R
      *
     A          K EITRAN
     A          K EIENDT
     A          S EIADJP                    COMP(EQ 'Y')
