      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM15                                                      *
/*EXI *  TEXT('Midas Fwd book 1/2month tots Ccy/DTYP/Date')
     A****************************************************************
     A*                                                              *
     A*  Midas - Money Market (Dealing)
     A*                                                              *
     A*          MMFWDHL1 - FORWARD BOOK HALF MONTH DETAILS          *
     A*                     (CURRENCY, DEAL TYPE, DATE SEQUENCE)     *
     A*                                                              *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                              *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*          LAST AMEND NO. S01280    DATE   22APR91             *
     A*                                                              *
     A* S01280 - TREASURY MANAGEMENT, INCLUDE NEW DEAL TYPES         *
     A*          RECOMPILE ONLY                                      *
     A****************************************************************
     A*
     A**VERSION**
     A**FORWARD BOOK HALF MONTH DETAILS (CCY, DEAL-TYPE, DATE SEQ.)
     A**00.00.01
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A********************************************************************
     A          R MMFWDHP0                  PFILE(MMFWDHPP)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K HTCCY
     A          K HTLDNA
     A          K HTFBYY
     A          K HTFBMM
     A          K HTFBHM
