      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM15                                                      *
/*EXI *  TEXT('Midas Fwd book daily deals upd file.')
     A****************************************************************
     A*                                                              *
     A*  Midas - Money Market (Dealing)
     A*                                                              *
     A*          MMFWUDLL - FORWARD BOOK DAILY DETAILS UPDATE FILE   *
     A*                                                              *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                              *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*          LAST AMEND NO. S01280    DATE   22APR91             *
     A*          LAST AMEND NO. S01149    DATE   14/01/88            *
     A*                                                              *
     A* S01280 - TREASURY MANAGEMENT, INCLUDE NEW DEAL TYPES         *
     A*          RECOMPILE ONLY                                      *
     A****************************************************************
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A********************************************************************
     A          R MMFWDDP0                  PFILE(MMFWDDPP)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K HSCCY
     A          K HSFBYY
     A          K HSFBMM
     A          K HSFBDD
      *                                                    S01149
     A          K HSLDNA
      *                                                    S01149
