      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_DL                                                        *
/*EXI *  TEXT('Midas Daily forward book record removal file')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Treasury Management (FX and MM Support)
     A*                                                               *
     A*   MMFWURLL - Daily forward book record removal file. Used by  *
     A*              rebuild of forward book (DL3340).                *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*   LAST AMEND NO. xxxxxx            DATE xx/xxx/xx             *
     A*                                                               *
     A*   NEW FILE FOR S01280 - INCLUDE FRA/IRS, FF, LE INTO MM TM    *
     A*****************************************************************
      *
     A          R MMFWDRP0                  PFILE(MMFWDDPP)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            HSLDNA
     A          K HSLDNA
      *
      *
     A          R MMFWHRP0                  PFILE(MMFWDHPP)
     A            HTLDNA
     A          K HTLDNA
