      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('MM Negotiable Asset Purchased BOE Invalid file')
      *****************************************************************
      *                                                               *
      *  Midas - Money Market                                         *
      *                                                               *
      *  LF/MMINPEXL0 - MM Negotiable Asset Purchased BOE Invalid file*
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2005            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. LLN022A            Date 24Jan05               *
      *  Prev Amend No. LLN022  *CREATE    Date 24Jan05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LLN022A - BOE Upgrade to MidasPlus                           *
      *  LLN022 - BOE Upgrade to MidasPlus                            *
      *                                                               *
     A*****************************************************************
     A          R MMINPEXD0                 PFILE(MMINPEXPD)
     A                                      TEXT('(c) Misys +
     A                                      International +
     A                                      Banking Systems Ltd. +
     A                                      2005')
     A          K LAFRTI
     A          K LTMSTI
