      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas MM Temp REPO Depot Mvmt by AFOID - retrieve')
      *****************************************************************
      *                                                               *
      *  Midas - Money Market Module                                  *
      *                                                               *
      *  LF/MMTRPDML1 - Midas MM Temporary REPO Depot Movements Trans.*
      *                 by Associated FO ID Sequence - retrieval      *
      *                                                               *
      *  (c) Finastra International Limited 2006                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Prev Amend No. 247785             Date 15May07               *
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 240524 *C *CREATE  Date 21Aug06               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  247785 - Problem in REPO API (Recompile)                     *
      *  240524 - Position file pointer from first valid record.      *
      *                                                               *
      *****************************************************************
     A          R MMTRPDMD0                 PFILE(MMTRPDMPD)
      *
     A          K DMAFRT
      *
