      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas TI Shadow postings, pending and posted.')
      *****************************************************************
      *                                                               *
      *  Midas - Trade Innovation Module                              *
      *                                                               *
      *  LF/TIPOSTLY - TI Projections File                            *
      *               (Selects all records 'shadow posted' or         *
      *                'pending shadow posting')                      *
      *                                                               *
      *  (c) Finastra International Limited 2002                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      *                 CGL029             Date 01Sep03               *
      *                 212558             Date 30Jan03               *
      * Midas Release 4.01.02 ----------------------------------------*
      *                 212129             Date 03Sep02               *
      *                 207601   *CREATE   Date 03Sep02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  212558 - Add field TRANID to the Transaction key.            *
      *  212129 - 207601 uses wrong key for projection count.         *
      *  207601 - TRTOT includes projections so subtract them from    *
      *           the total before using for batch postings.          *
      *                                                               *
      *****************************************************************
     A*=====================================================================
     A          R TIPOSTD0                  PFILE(TIPOSTPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2002')
      *
      * Start of change 212129
     A**********K TIDLBR                                                   /*212129*/
     A**********K TIDLTP                                                   /*212129*/
      * End of change 212129
      * Start of change 212558
     A          K TRANID
      * End of change 212558
     A          K TIEVRF
      * Start of change 212129
     A**********K TISEQN                                                   /*212129*/
     A**********K TIVALD                                                   /*212129*/
      * End of change 212129
      *
     A          S PSTS                      COMP(EQ 'PSH')
     A            PSTERR                    COMP(EQ 'N')
     A            TISEQN                    COMP(LT 900)
      *
     A          S PSTS                      COMP(EQ 'SHP')
     A            PSTERR                    COMP(EQ 'N')
     A            TISEQN                    COMP(LT 900)
