      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas IR IR Cash Flow Def File for Sing/X-Ccy Swap')
      *****************************************************************
      *                                                               *
      *  Midas - FRA/IRS Module                                       *
      *                                                               *
      *  PF/IRCFSC4PD - Cash Flow Schedule Definition File for        *
      *                 Single and Cross Currency Swaps               *
      *                                                               *
      *  (c) Finastra International Limited 2002                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CAP043  *CREATE    Date 02May02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CAP043 - Additional APIs for IRS Schedules                   *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R IRCFSC4D0                 TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2002')
     A            SAMT71        14A         TEXT('Cash Flow Amount 71')
     A                                      COLHDG('Cash Flow Amount 71')
     A            SAMT72        14A         TEXT('Cash Flow Amount 72')
     A                                      COLHDG('Cash Flow Amount 72')
     A            SAMT73        14A         TEXT('Cash Flow Amount 73')
     A                                      COLHDG('Cash Flow Amount 73')
     A            SAMT74        14A         TEXT('Cash Flow Amount 74')
     A                                      COLHDG('Cash Flow Amount 74')
     A            SAMT75        14A         TEXT('Cash Flow Amount 75')
     A                                      COLHDG('Cash Flow Amount 75')
     A            SAMT76        14A         TEXT('Cash Flow Amount 76')
     A                                      COLHDG('Cash Flow Amount 76')
     A            SAMT77        14A         TEXT('Cash Flow Amount 77')
     A                                      COLHDG('Cash Flow Amount 77')
     A            SAMT78        14A         TEXT('Cash Flow Amount 78')
     A                                      COLHDG('Cash Flow Amount 78')
     A            SAMT79        14A         TEXT('Cash Flow Amount 79')
     A                                      COLHDG('Cash Flow Amount 79')
     A            SAMT80        14A         TEXT('Cash Flow Amount 80')
     A                                      COLHDG('Cash Flow Amount 80')
     A            SAMT81        14A         TEXT('Cash Flow Amount 81')
     A                                      COLHDG('Cash Flow Amount 81')
     A            SAMT82        14A         TEXT('Cash Flow Amount 82')
     A                                      COLHDG('Cash Flow Amount 82')
