      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas IR IRS cross ccy extra data layout file')
      *****************************************************************
      *                                                               *
      *  Midas - Dealing IRS Module                                   *
      *                                                               *
      *  PF/IRCSEXPD - API IRS Cross Ccy Extra Data Layout File       *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CAP004  *CREATE    Date 07Sep98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CAP004 - APIs Phase III                                      *
      *           Addition of file to pass supplemental information   *
      *           from front to back office                           *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
 
     A          R IRCSEXD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
 
     A            APNARV    R               TEXT('Narrative Text')
                                            REFFLD(NARV)
