      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas IR Single ccy IRS in err from DBU function')
      *****************************************************************
      *                                                               *
      *  Midas - FRA/IRS Module                                       *
      *                                                               *
      *  PF/IRVEXSRPD - Single CCY IRS in Error from DBU Function     *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2004            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 25Nov05               *
      *  Prev Amend No. CDL038             Date 10May05               *
      *                 BUG7166            Date 12May05               *
      *                 CLE025  *CREATE    Date 02Mar04               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CDL038 - Extended Deal Sub Type                              *
      *  BUG7166- Valid file does not match DEALSDG                   *
      *  CLE025 - Credit lines                                        *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R IRVSIRSD0                 FORMAT(IRVSIRSPD)
