      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas UT Distinct Programs File')                      *
      *****************************************************************
      *                                                               *
      *  Midas - Utilities Module                                     *
      *                                                               *
      *  PF/UTDPGMPD - Distinct Programs File                         *
      *                                                               *
      *  (c) Finastra International Limited 2011                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CBF011  *CREATE    Date 04Jul11               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CBF011 - BF Infrastructure: Error Message Handling           *
      *                                                               *
      *****************************************************************
     A          R UTDPGMF                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2011')
      *
     A            DPDPGM        10A         TEXT('Distinct Program')
     A                                      COLHDG('Distinct Program')
     A            DPPROC         1A         TEXT('Processed Flag')
     A                                      COLHDG('Processed')
      *
