      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas Lending Fees Extract file')                      *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/UTEXTFEE  -  Lending Fees Extract File for UTLE0441       *
      *                                                               *
      *  (c) Finastra International Limited 2022                      *
      *                                                               *
      *  Last Amend No. 263582 *CREATE     Date 29Jul22               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  263582 - Wrong 'Total Accrued to Date' in Fee Detail Enq.    *
      *           Correct the NoOfDays in computations and update     *
      *           value of %indicator field in LEFEED and LEFHST.     *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  C R E A T I O N     P A R A M E T E R S                      *
      *                                                               *
      *****************************************************************
     A          R LEFEEXF                   TEXT('(c) Finastra International +
     A                                      Limited 2022')
     A            FEXNUM         6A
     A            FEXFAC         5S 0
     A            FEXSEQ         2S 0
     A            FEXCOD         2S 0
     A            FEXCCY         3A
     A            FEXCAL         2A
     A            FEXID1         1A
     A            FEXRT1         7P 5
     A            FEXRT2         7P 5
     A            FEXRT3         7P 5
     A            FEXRT4         7P 5
     A            FEXRT5         7P 5
     A            FEXCVD         5P 0
     A            FEXCTP         2A
     A            FEXID2         1A
     A          K FEXNUM
     A          K FEXFAC
     A          K FEXSEQ
