      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('List of Facilties to be Recalculated')                 *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/UTLE0850PD - PF that lists all facilities that was        *
      *                  processed by the utility and tagged for      *
      *                  recalculation.                               *
      *                  Used by UTLE0850C utility for MD056104.      *
      *                                                               *
      *  (c) Finastra International Limited 2020                      *
      *                                                               *
      *  Last Amend No. MD056104 *Create   Date 07Aug20               *
      *  Prev Amend No. Xnnnnn             Date ddmmmyy               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD056104 - Numerous incorrect utilisation records found in   *
      *             FACHISA.                                          *
      *           - Reverse all required utilisation records and      *
      *             regenerate US records from LEMNFUPD.              *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  C R E A T I O N     P A R A M E T E R S                      *
      *                                                               *
      *****************************************************************
      *
     A                                      UNIQUE
     A          R UTLE850PDF                TEXT('(c) Misys Banking +
     A                                      Systems 2020')
      *
     A            UTBRCA         3A
     A                                      TEXT('Branch Code')
     A                                      COLHDG('Branch              ' +
     A                                      'Code')
     A            UTCNUM         6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
     A            UTFCTY         5P 0
     A                                      TEXT('Facility')
     A                                      COLHDG('Facility')
      *
     A          K UTBRCA
     A          K UTCNUM
     A          K UTFCTY
