      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas UT Pgm Ref File - Distinct WHPNAM/WHFNAM')       *
      *****************************************************************
      *                                                               *
      *  Midas - Utilities Module                                     *
      *                                                               *
      *  PF/UTPREFDD - Program Reference File - Distinct WHPNAM/WHFNAM*
      *                                                               *
      *  (c) Finastra International Limited 2011                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CBF011  *CREATE    Date 04Jul11               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CBF011 - BF Infrastructure: Error Message Handling           *
      *                                                               *
      *****************************************************************
     A          R UTPREFF                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2011')
      *
     A            WHPNAM        10A         TEXT('Program')
     A                                      COLHDG('Program')
     A            WHFNAM        11A         TEXT('Object Referenced: 1=*EXPR')
     A                                      COLHDG('Obj Ref')
     A            WHOBJT         1A         TEXT('Object Type: F=File, +
     A                                      P=Program, D=Data area')
     A                                      COLHDG('Object Type Ind')
     A            WHOTYP        10A         TEXT('Object type')
     A                                      COLHDG('Object Type')
     A            WHSPKG         1A         TEXT('PGM=P, SQLPKG=S, +
     A                                      SRVPGM=V, MODULE=M')
     A                                      COLHDG('Program Type')
      *
