      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_AU60                                                      *
/*EXI *  TEXT('Midas FF Transaction Update Phase I - Audit')
     A*****************************************************************
     A*                                                               *
     A*  Midas   FINANCIAL FUTURES AND OPTIONS MODULE
     A*                                                               *
     A*  FF0380AU  -  TRANSACTIONS UPDATE PHASE I                     *
     A*                                                               *
     A*  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  PREV AMEND NO. S01117             DATE  19APR90              *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
     A*  MD046248 - Finastra Rebranding                               *
     A*  S01117  -  MULTIBRANCHING                                    *
     A*                                                               *
     A*****************************************************************
     A                                       REF(MFRFL)
     A          R FMTP101                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A                                  3  7'REFERENCE FF0380AU'
     A            TITL      R           3 37
     A                                  3101'DATE'
     A            RUNA      R           3106
     A                                  3119'PAGE'
     A            PAGE           5S 0   3124 EDTCDE( 4)
     A*
     A                                  5 39'TRANSACTIONS UPDATE PHASE I'
     A                                  5 67'- FILE CONTROLS for'
     A            RFFTXT        34A     5 87TEXT('MKTN as at BUSD')
     A                                  6 39'----------------------------'
     A                                  6 67'--------------------'
     A            FULINE        34A     6 87
     A*
     A                                  9 60'CALCULATED'
     A*
     A                                 11  6'FILE'
     A                                 11 53'NUMBER'
     A                                 11 74'VALUE'
     A*
     A                                 13  6'ACCOUNT KEYS'
     A                                 13 27'- PF/'
     A                                 13 32'FOKEY'
     A                                 13 43'OUTPUT'
     A*
     A            COUNT          5  0  13 53EDTCDE(3)
     A            ZZTOTI        15  0  13 61EDTCDE(Z)
     A            ZZTOTD         3  0  13 76
     A*
     A          R FMTP102
     A                                    25'**** DATABASE ERROR ****'
     A                                      SPACEB(2)
     A*
     A                                    11'********************'
     A                                      SPACEB(2)
     A                                    31'********************'
     A                                    51'**************'
     A                                    11'*'
     A                                      SPACEB(1)
     A                                    64'*'
     A                                    11'*   FILE NAME'
     A                                      SPACEB(1)
     A***********                                    Begin /S01117/
     A*********** DBFILE         5A       30TEXT('DATABASE FILE')
     A            DBFILE         8A       30TEXT('DATABASE FILE')
     A***********                                    End   /S01117/
     A                                    64'*'
     A                                    11'*   KEY'
     A                                      SPACEB(1)
     A            DBKEY         29A       30TEXT('DATABASE FILE KEY')
     A                                    64'*'
     A                                    11'*   PROGRAM NAME'
     A                                      SPACEB(1)
     A***********                                    Begin /S01117/
     A*********** DBPGM          8A       30TEXT('PROGRAM')
     A            DBPGM         10A       30TEXT('PROGRAM')
     A***********                                    End   /S01117/
     A                                    64'*'
     A                                    11'*   POSITION'
     A                                      SPACEB(1)
     A***********                                    Begin /S01117/
     A*********** DBASE          2A       30TEXT('POSITION')
     A            DBASE          3  0     30TEXT('POSITION')
     A***********                                    End   /S01117/
     A                                    64'*'
     A                                    11'*'
     A                                      SPACEB(1)
     A                                    64'*'
     A                                    11'********************'
     A                                      SPACEB(1)
     A                                    31'********************'
     A                                    51'**************'
     A                                      SPACEA(3)
     A*
     A***********                                    Begin /S01117/
     A*********** FMTP103
     A***********                         56'*** END OF REPORT ***'
     A***********                           SPACEB(3)
     A***********                                    End   /S01117/
