      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_AU60                                                      *
/*EXI *  TEXT('Midas FF Account Keys List - Audit')
     A*****************************************************************
     A*                                                               *
     A*  Midas   FINANCIAL FUTURES AND OPTIONS MODULE
     A*                                                               *
     A*  FF1180AU  -  ACCOUNT KEYS LIST (AUDIT)                       *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. E00000             DATE  DDMMMYY              *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
     A*  E00000  -                                                    *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R FMTAU01                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                  2  7'REFERENCE FF1180AU'
     A            TITL      R           2 37
     A                                  2101'DATE'
     A            RUNA      R           2106
     A                                  2119'PAGE'
     A            PAGE1          5S 0   2124 EDTCDE( 4)
     A                                  4 57'ACCOUNT KEY LIST'
     A                                  5 57'----------------'
     A                                  4 77'RUN CONTROLS'
     A*
     A          R FMTAU02                   TEXT('ACKY AUDIT')
     A N49                              9  6'LF/FACKY'
     A N49                             10  6'--------'
     A  49                              9  6'PF/JRNCGD'
     A  49                             10  6'---------'
     A                                 12  9'TOTAL RECORDS ON'
     A                                 12 26'FILE - CALCULATED'
     A            COUNT          5  0  12 55 EDTCDE( 3)
     A*
     A          R FMTAU03                   TEXT('NO ACKY REC')
     A                                      SPACEB( 2)
     A                                    52'*** NO DETAILS TO REPORT ***'
     A*
     A          R FMTAU04                   TEXT('DATABASE ERROR FORMAT')
     A                                      SPACEB( 2)
     A                                    45'DATABASE ERROR'
     A            DBASE          3  0     60
     A                                    64'IN PROGRAM'
     A            DBPGM         10A       75
     A                                      SPACEA( 1)
     A                                    45'FILENAME'
     A            DBFILE         8A       54
     A                                    63'KEY'
     A            DBKEY         29A       67
     A*
