      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SC Midas clustering - input dtaara layout')      *
      *****************************************************************
      *                                                               *
      *  Midas - System Control Module                                *
      *                                                               *
      *  PF/QCSTHAAPPI - Midas Clustering Input Dtaara Layout         *
      *                                                               *
      *  Note: Any fix applied to this file may also need to be       *
      *        applied to the core DTAARA source.                     *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *  Last Amend No. A1084804           Date 08Feb13               *
      * Bank Fusion Midas 2.0 Base -----------------------------------*
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      *  Prev Amend No. CSC013  *CREATE    Date 05Nov01               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  A1084804 - Recreating the file (recompile)                   *
      *  CSC013 - Midas Clustering Feature                            *
      *           - New file for this feature.                        *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R QCSTHID0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            OSLEVEL       10A
     A                                      TEXT('Data Area Level Info')
     A                                      COLHDG('Data Area' +
     A                                             'Level' +
     A                                             'Information')
      *
     A            APPNAME       10A
     A                                      TEXT('Application Name')
     A                                      COLHDG('Application' +
     A                                             'Name')
      *
     A            APPRLS         6A
     A                                      TEXT('Application Release')
     A                                      COLHDG('Application' +
     A                                             'Release' +
     A                                             'Level')
      *
     A            APPID         50A
     A                                      TEXT('Application Information')
     A                                      COLHDG('Application' +
     A                                             'ID' +
     A                                             'Information')
      *
     A            RESRVD        34A
     A                                      TEXT('Reserved Field')
     A                                      COLHDG('Reserved' +
     A                                             'Field')
      *
     A            APPCRG        10A
     A                                      TEXT('Application CRG Name')
     A                                      COLHDG('Application' +
     A                                             'CRG' +
     A                                             'Name')
      *
     A            APPEXIT       20A
     A                                      TEXT('Application Exit Program')
     A                                      COLHDG('Application' +
     A                                             'Exit' +
     A                                             'Program')
      *
     A            USRPRF        10A
     A                                      TEXT('User Profile Name')
     A                                      COLHDG('User' +
     A                                             'Profile' +
     A                                             'Name')
      *
     A            EXITDTA      256A
     A                                      TEXT('Exit Program Data')
     A                                      COLHDG('Exit' +
     A                                             'Program' +
     A                                             'Data')
      *
     A            JOBNAME       10A
     A                                      TEXT('Job Name')
     A                                      COLHDG('Job' +
     A                                             'Name')
      *
     A            APPRST         9B 0
     A                                      TEXT('Application Restart Ind')
     A                                      COLHDG('Applicaiton' +
     A                                             'Restart' +
     A                                             'Indicator')
      *
     A            NBRRST         9B 0
     A                                      TEXT('Number of Restarts')
     A                                      COLHDG('Number' +
     A                                             'Of' +
     A                                             'Restarts')
      *
     A            RESRV2        36A
     A                                      TEXT('Reserved Field')
     A                                      COLHDG('Reserved' +
     A                                             'Field')
      *
     A            LSTTYP         9B 0
     A                                      TEXT('List Type')
     A                                      COLHDG('List' +
     A                                             'Type')
      *
     A            NBRENT         9B 0
     A                                      TEXT('Number of Entries')
     A                                      COLHDG('Number' +
     A                                             'Of' +
     A                                             'Entries')
      *
     A            FILE1         10A
     A                                      TEXT('File Name 1')
     A                                      COLHDG('File' +
     A                                             'Name' +
     A                                             '1')
      *
     A            LIB1          10A
     A                                      TEXT('Library Name 1')
     A                                      COLHDG('Library' +
     A                                             'Name' +
     A                                             '1')
      *
     A            MBR1          10A
     A                                      TEXT('Member Name 1')
     A                                      COLHDG('Member' +
     A                                             'Name' +
     A                                             '1')
      *
     A            NOSP1          9B 0
     A                                      TEXT('No. Object Specifiers 1')
     A                                      COLHDG('No. of' +
     A                                             'Object' +
     A                                             'Specifiers 1')
      *
     A            JRN1          20A
     A                                      TEXT('Qualified Journal 1')
     A                                      COLHDG('Qualified' +
     A                                             'Default Journal' +
     A                                             'Name 1')
      *
     A            CRIT1          1A
     A                                      TEXT('Criticality Ind 1')
     A                                      COLHDG('Criticality' +
     A                                             'Indicator' +
     A                                             '1')
      *
     A            CRG1          10A
     A                                      TEXT('Preferred Data CRG 1')
     A                                      COLHDG('Preferred' +
     A                                             'Data CRG' +
     A                                             'Name 1')
      *
     A            RSV1          11A
     A                                      TEXT('Reserved Field 1')
     A                                      COLHDG('Reserved' +
     A                                             'Field 1')
      *
     A            FILE2         10A
     A                                      TEXT('File Name 2')
     A                                      COLHDG('File' +
     A                                             'Name' +
     A                                             '2')
      *
     A            LIB2          10A
     A                                      TEXT('Library Name 2')
     A                                      COLHDG('Library' +
     A                                             'Name' +
     A                                             '2')
      *
     A            MBR2          10A
     A                                      TEXT('Member Name 2')
     A                                      COLHDG('Member' +
     A                                             'Name' +
     A                                             '2')
      *
     A            NOSP2          9B 0
     A                                      TEXT('No. Object Specifiers 2')
     A                                      COLHDG('No. of' +
     A                                             'Object' +
     A                                             'Specifiers 2')
      *
     A            JRN2          20A
     A                                      TEXT('Qualified Journal 2')
     A                                      COLHDG('Qualified' +
     A                                             'Default Journal' +
     A                                             'Name 2')
      *
     A            CRIT2          1A
     A                                      TEXT('Criticality Ind 2')
     A                                      COLHDG('Criticality' +
     A                                             'Indicator' +
     A                                             '2')
      *
     A            CRG2          10A
     A                                      TEXT('Preferred Data CRG 2')
     A                                      COLHDG('Preferred' +
     A                                             'Data CRG' +
     A                                             'Name 2')
      *
     A            RSV2          11A
     A                                      TEXT('Reserved Field 2')
     A                                      COLHDG('Reserved' +
     A                                             'Field 2')
      *
     A            FILE3         10A
     A                                      TEXT('File Name 3')
     A                                      COLHDG('File' +
     A                                             'Name' +
     A                                             '3')
      *
     A            LIB3          10A
     A                                      TEXT('Library Name 3')
     A                                      COLHDG('Library' +
     A                                             'Name' +
     A                                             '3')
      *
     A            MBR3          10A
     A                                      TEXT('Member Name 3')
     A                                      COLHDG('Member' +
     A                                             'Name' +
     A                                             '3')
      *
     A            NOSP3          9B 0
     A                                      TEXT('No. Object Specifiers 3')
     A                                      COLHDG('No. of' +
     A                                             'Object' +
     A                                             'Specifiers 3')
      *
     A            JRN3          20A
     A                                      TEXT('Qualified Journal 3')
     A                                      COLHDG('Qualified' +
     A                                             'Default Journal' +
     A                                             'Name 3')
      *
     A            CRIT3          1A
     A                                      TEXT('Criticality Ind 3')
     A                                      COLHDG('Criticality' +
     A                                             'Indicator' +
     A                                             '3')
      *
     A            CRG3          10A
     A                                      TEXT('Preferred Data CRG 3')
     A                                      COLHDG('Preferred' +
     A                                             'Data CRG' +
     A                                             'Name 3')
      *
     A            RSV3          11A
     A                                      TEXT('Reserved Field 3')
     A                                      COLHDG('Reserved' +
     A                                             'Field 3')
      *
     A            FILE4         10A
     A                                      TEXT('File Name 4')
     A                                      COLHDG('File' +
     A                                             'Name' +
     A                                             '4')
      *
     A            LIB4          10A
     A                                      TEXT('Library Name 4')
     A                                      COLHDG('Library' +
     A                                             'Name' +
     A                                             '4')
      *
     A            MBR4          10A
     A                                      TEXT('Member Name 4')
     A                                      COLHDG('Member' +
     A                                             'Name' +
     A                                             '4')
      *
     A            NOSP4          9B 0
     A                                      TEXT('No. Object Specifiers 4')
     A                                      COLHDG('No. of' +
     A                                             'Object' +
     A                                             'Specifiers 4')
      *
     A            JRN4          20A
     A                                      TEXT('Qualified Journal ¢')
     A                                      COLHDG('Qualified' +
     A                                             'Default Journal' +
     A                                             'Name 4')
      *
     A            CRIT4          1A
     A                                      TEXT('Criticality Ind 4')
     A                                      COLHDG('Criticality' +
     A                                             'Indicator' +
     A                                             '4')
      *
     A            CRG4          10A
     A                                      TEXT('Preferred Data CRG 4')
     A                                      COLHDG('Preferred' +
     A                                             'Data CRG' +
     A                                             'Name 4')
      *
     A            RSV4          11A
     A                                      TEXT('Reserved Field 4')
     A                                      COLHDG('Reserved' +
     A                                             'Field 4')
      *
     A            FILE5         10A
     A                                      TEXT('File Name 5')
     A                                      COLHDG('File' +
     A                                             'Name' +
     A                                             '5')
      *
     A            LIB5          10A
     A                                      TEXT('Library Name 5')
     A                                      COLHDG('Library' +
     A                                             'Name' +
     A                                             '5')
      *
     A            MBR5          10A
     A                                      TEXT('Member Name 5')
     A                                      COLHDG('Member' +
     A                                             'Name' +
     A                                             '5')
      *
     A            NOSP5          9B 0
     A                                      TEXT('No. Object Specifiers 5')
     A                                      COLHDG('No. of' +
     A                                             'Object' +
     A                                             'Specifiers 5')
      *
     A            JRN5          20A
     A                                      TEXT('Qualified Journal 5')
     A                                      COLHDG('Qualified' +
     A                                             'Default Journal' +
     A                                             'Name 5')
      *
     A            CRIT5          1A
     A                                      TEXT('Criticality Ind 5')
     A                                      COLHDG('Criticality' +
     A                                             'Indicator' +
     A                                             '5')
      *
     A            CRG5          10A
     A                                      TEXT('Preferred Data CRG 5')
     A                                      COLHDG('Preferred' +
     A                                             'Data CRG' +
     A                                             'Name 5')
      *
     A            RSV5          11A
     A                                      TEXT('Reserved Field 5')
     A                                      COLHDG('Reserved' +
     A                                             'Field 5')
      *
     A            FILE6         10A
     A                                      TEXT('File Name 6')
     A                                      COLHDG('File' +
     A                                             'Name' +
     A                                             '6')
      *
     A            LIB6          10A
     A                                      TEXT('Library Name 6')
     A                                      COLHDG('Library' +
     A                                             'Name' +
     A                                             '6')
      *
     A            MBR6          10A
     A                                      TEXT('Member Name 6')
     A                                      COLHDG('Member' +
     A                                             'Name' +
     A                                             '6')
      *
     A            NOSP6          9B 0
     A                                      TEXT('No. Object Specifiers 6')
     A                                      COLHDG('No. of' +
     A                                             'Object' +
     A                                             'Specifiers 6')
      *
     A            JRN6          20A
     A                                      TEXT('Qualified Journal 6')
     A                                      COLHDG('Qualified' +
     A                                             'Default Journal' +
     A                                             'Name 6')
      *
     A            CRIT6          1A
     A                                      TEXT('Criticality Ind 6')
     A                                      COLHDG('Criticality' +
     A                                             'Indicator' +
     A                                             '6')
      *
     A            CRG6          10A
     A                                      TEXT('Preferred Data CRG 6')
     A                                      COLHDG('Preferred' +
     A                                             'Data CRG' +
     A                                             'Name 6')
      *
     A            RSV6          11A
     A                                      TEXT('Reserved Field 6')
     A                                      COLHDG('Reserved' +
     A                                             'Field 6')
      *
     A            FILE7         10A
     A                                      TEXT('File Name 7')
     A                                      COLHDG('File' +
     A                                             'Name' +
     A                                             '7')
      *
     A            LIB7          10A
     A                                      TEXT('Library Name 7')
     A                                      COLHDG('Library' +
     A                                             'Name' +
     A                                             '7')
      *
     A            MBR7          10A
     A                                      TEXT('Member Name 7')
     A                                      COLHDG('Member' +
     A                                             'Name' +
     A                                             '7')
      *
     A            NOSP7          9B 0
     A                                      TEXT('No. Object Specifiers 7')
     A                                      COLHDG('No. of' +
     A                                             'Object' +
     A                                             'Specifiers 7')
      *
     A            JRN7          20A
     A                                      TEXT('Qualified Journal 7')
     A                                      COLHDG('Qualified' +
     A                                             'Default Journal' +
     A                                             'Name 7')
      *
     A            CRIT7          1A
     A                                      TEXT('Criticality Ind 7')
     A                                      COLHDG('Criticality' +
     A                                             'Indicator' +
     A                                             '7')
      *
     A            CRG7          10A
     A                                      TEXT('Preferred Data CRG 7')
     A                                      COLHDG('Preferred' +
     A                                             'Data CRG' +
     A                                             'Name 7')
      *
     A            RSV7          11A
     A                                      TEXT('Reserved Field 7')
     A                                      COLHDG('Reserved' +
     A                                             'Field 7')
      *
     A            FILE8         10A
     A                                      TEXT('File Name 8')
     A                                      COLHDG('File' +
     A                                             'Name' +
     A                                             '8')
      *
     A            LIB8          10A
     A                                      TEXT('Library Name 8')
     A                                      COLHDG('Library' +
     A                                             'Name' +
     A                                             '8')
      *
     A            MBR8          10A
     A                                      TEXT('Member Name 8')
     A                                      COLHDG('Member' +
     A                                             'Name' +
     A                                             '8')
      *
     A            NOSP8          9B 0
     A                                      TEXT('No. Object Specifiers 8')
     A                                      COLHDG('No. of' +
     A                                             'Object' +
     A                                             'Specifiers 8')
      *
     A            JRN8          20A
     A                                      TEXT('Qualified Journal 8')
     A                                      COLHDG('Qualified' +
     A                                             'Default Journal' +
     A                                             'Name 8')
      *
     A            CRIT8          1A
     A                                      TEXT('Criticality Ind 8')
     A                                      COLHDG('Criticality' +
     A                                             'Indicator' +
     A                                             '8')
      *
     A            CRG8          10A
     A                                      TEXT('Preferred Data CRG 8')
     A                                      COLHDG('Preferred' +
     A                                             'Data CRG' +
     A                                             'Name 8')
      *
     A            RSV8          11A
     A                                      TEXT('Reserved Field 8')
     A                                      COLHDG('Reserved' +
     A                                             'Field 8')
      *
     A            FILE9         10A
     A                                      TEXT('File Name 9')
     A                                      COLHDG('File' +
     A                                             'Name' +
     A                                             '9')
      *
     A            LIB9          10A
     A                                      TEXT('Library Name 9')
     A                                      COLHDG('Library' +
     A                                             'Name' +
     A                                             '9')
      *
     A            MBR9          10A
     A                                      TEXT('Member Name 9')
     A                                      COLHDG('Member' +
     A                                             'Name' +
     A                                             '9')
      *
     A            NOSP9          9B 0
     A                                      TEXT('No. Object Specifiers 9')
     A                                      COLHDG('No. of' +
     A                                             'Object' +
     A                                             'Specifiers 9')
      *
     A            JRN9          20A
     A                                      TEXT('Qualified Journal 9')
     A                                      COLHDG('Qualified' +
     A                                             'Default Journal' +
     A                                             'Name 9')
      *
     A            CRIT9          1A
     A                                      TEXT('Criticality Ind 9')
     A                                      COLHDG('Criticality' +
     A                                             'Indicator' +
     A                                             '9')
      *
     A            CRG9          10A
     A                                      TEXT('Preferred Data CRG 9')
     A                                      COLHDG('Preferred' +
     A                                             'Data CRG' +
     A                                             'Name 9')
      *
     A            RSV9          11A
     A                                      TEXT('Reserved Field 9')
     A                                      COLHDG('Reserved' +
     A                                             'Field 9')
      *
     A            FILE10        10A
     A                                      TEXT('File Name 10')
     A                                      COLHDG('File' +
     A                                             'Name' +
     A                                             '10')
      *
     A            LIB10         10A
     A                                      TEXT('Library Name 10')
     A                                      COLHDG('Library' +
     A                                             'Name' +
     A                                             '10')
      *
     A            MBR10         10A
     A                                      TEXT('Member Name 10')
     A                                      COLHDG('Member' +
     A                                             'Name' +
     A                                             '10')
      *
     A            NOSP10         9B 0
     A                                      TEXT('No. Object Specifiers 10')
     A                                      COLHDG('No. of' +
     A                                             'Object' +
     A                                             'Specifiers 10')
      *
     A            JRN10         20A
     A                                      TEXT('Qualified Journal 10')
     A                                      COLHDG('Qualified' +
     A                                             'Default Journal' +
     A                                             'Name 10')
      *
     A            CRIT10         1A
     A                                      TEXT('Criticality Ind 10')
     A                                      COLHDG('Criticality' +
     A                                             'Indicator' +
     A                                             '10')
      *
     A            CRG10         10A
     A                                      TEXT('Preferred Data CRG 10')
     A                                      COLHDG('Preferred' +
     A                                             'Data CRG' +
     A                                             'Name 10')
      *
     A            RSV10         11A
     A                                      TEXT('Reserved Field 10')
     A                                      COLHDG('Reserved' +
     A                                             'Field 10')
      *
     A            FILE11        10A
     A                                      TEXT('File Name 11')
     A                                      COLHDG('File' +
     A                                             'Name' +
     A                                             '11')
      *
     A            LIB11         10A
     A                                      TEXT('Library Name 11')
     A                                      COLHDG('Library' +
     A                                             'Name' +
     A                                             '11')
      *
     A            MBR11         10A
     A                                      TEXT('Member Name 11')
     A                                      COLHDG('Member' +
     A                                             'Name' +
     A                                             '11')
      *
     A            NOSP11         9B 0
     A                                      TEXT('No. Object Specifiers 11')
     A                                      COLHDG('No. of' +
     A                                             'Object' +
     A                                             'Specifiers 11')
      *
     A            JRN11         20A
     A                                      TEXT('Qualified Journal 11')
     A                                      COLHDG('Qualified' +
     A                                             'Default Journal' +
     A                                             'Name 11')
      *
     A            CRIT11         1A
     A                                      TEXT('Criticality Ind 11')
     A                                      COLHDG('Criticality' +
     A                                             'Indicator' +
     A                                             '11')
      *
     A            CRG11         10A
     A                                      TEXT('Preferred Data CRG 11')
     A                                      COLHDG('Preferred' +
     A                                             'Data CRG' +
     A                                             'Name 11')
      *
     A            RSV11         11A
     A                                      TEXT('Reserved Field 11')
     A                                      COLHDG('Reserved' +
     A                                             'Field 11')
      *
     A            FILE12        10A
     A                                      TEXT('File Name 12')
     A                                      COLHDG('File' +
     A                                             'Name' +
     A                                             '12')
      *
     A            LIB12         10A
     A                                      TEXT('Library Name 12')
     A                                      COLHDG('Library' +
     A                                             'Name' +
     A                                             '12')
      *
     A            MBR12         10A
     A                                      TEXT('Member Name 12')
     A                                      COLHDG('Member' +
     A                                             'Name' +
     A                                             '12')
      *
     A            NOSP12         9B 0
     A                                      TEXT('No. Object Specifiers 12')
     A                                      COLHDG('No. of' +
     A                                             'Object' +
     A                                             'Specifiers 12')
      *
     A            JRN12         20A
     A                                      TEXT('Qualified Journal 12')
     A                                      COLHDG('Qualified' +
     A                                             'Default Journal' +
     A                                             'Name 12')
      *
     A            CRIT12         1A
     A                                      TEXT('Criticality Ind 12')
     A                                      COLHDG('Criticality' +
     A                                             'Indicator' +
     A                                             '12')
      *
     A            CRG12         10A
     A                                      TEXT('Preferred Data CRG 12')
     A                                      COLHDG('Preferred' +
     A                                             'Data CRG' +
     A                                             'Name 12')
      *
     A            RSV12         11A
     A                                      TEXT('Reserved Field 12')
     A                                      COLHDG('Reserved' +
     A                                             'Field 12')
      *
     A            FILE13        10A
     A                                      TEXT('File Name 13')
     A                                      COLHDG('File' +
     A                                             'Name' +
     A                                             '13')
      *
     A            LIB13         10A
     A                                      TEXT('Library Name 13')
     A                                      COLHDG('Library' +
     A                                             'Name' +
     A                                             '13')
      *
     A            MBR13         10A
     A                                      TEXT('Member Name 13')
     A                                      COLHDG('Member' +
     A                                             'Name' +
     A                                             '13')
      *
     A            NOSP13         9B 0
     A                                      TEXT('No. Object Specifiers 13')
     A                                      COLHDG('No. of' +
     A                                             'Object' +
     A                                             'Specifiers 13')
      *
     A            JRN13         20A
     A                                      TEXT('Qualified Journal 13')
     A                                      COLHDG('Qualified' +
     A                                             'Default Journal' +
     A                                             'Name 13')
      *
     A            CRIT13         1A
     A                                      TEXT('Criticality Ind 13')
     A                                      COLHDG('Criticality' +
     A                                             'Indicator' +
     A                                             '13')
      *
     A            CRG13         10A
     A                                      TEXT('Preferred Data CRG 13')
     A                                      COLHDG('Preferred' +
     A                                             'Data CRG' +
     A                                             'Name 13')
      *
     A            RSV13         11A
     A                                      TEXT('Reserved Field 13')
     A                                      COLHDG('Reserved' +
     A                                             'Field 13')
      *
     A            FILE14        10A
     A                                      TEXT('File Name 14')
     A                                      COLHDG('File' +
     A                                             'Name' +
     A                                             '14')
      *
     A            LIB14         10A
     A                                      TEXT('Library Name 14')
     A                                      COLHDG('Library' +
     A                                             'Name' +
     A                                             '14')
      *
     A            MBR14         10A
     A                                      TEXT('Member Name 14')
     A                                      COLHDG('Member' +
     A                                             'Name' +
     A                                             '14')
      *
     A            NOSP14         9B 0
     A                                      TEXT('No. Object Specifiers 14')
     A                                      COLHDG('No. of' +
     A                                             'Object' +
     A                                             'Specifiers 14')
      *
     A            JRN14         20A
     A                                      TEXT('Qualified Journal 14')
     A                                      COLHDG('Qualified' +
     A                                             'Default Journal' +
     A                                             'Name 14')
      *
     A            CRIT14         1A
     A                                      TEXT('Criticality Ind 14')
     A                                      COLHDG('Criticality' +
     A                                             'Indicator' +
     A                                             '14')
      *
     A            CRG14         10A
     A                                      TEXT('Preferred Data CRG 14')
     A                                      COLHDG('Preferred' +
     A                                             'Data CRG' +
     A                                             'Name 14')
      *
     A            RSV14         11A
     A                                      TEXT('Reserved Field 14')
     A                                      COLHDG('Reserved' +
     A                                             'Field 14')
      *
     A            FILE15        10A
     A                                      TEXT('File Name 15')
     A                                      COLHDG('File' +
     A                                             'Name' +
     A                                             '15')
      *
     A            LIB15         10A
     A                                      TEXT('Library Name 15')
     A                                      COLHDG('Library' +
     A                                             'Name' +
     A                                             '15')
      *
     A            MBR15         10A
     A                                      TEXT('Member Name 15')
     A                                      COLHDG('Member' +
     A                                             'Name' +
     A                                             '15')
      *
     A            NOSP15         9B 0
     A                                      TEXT('No. Object Specifiers 15')
     A                                      COLHDG('No. of' +
     A                                             'Object' +
     A                                             'Specifiers 15')
      *
     A            JRN15         20A
     A                                      TEXT('Qualified Journal 15')
     A                                      COLHDG('Qualified' +
     A                                             'Default Journal' +
     A                                             'Name 15')
      *
     A            CRIT15         1A
     A                                      TEXT('Criticality Ind 15')
     A                                      COLHDG('Criticality' +
     A                                             'Indicator' +
     A                                             '15')
      *
     A            CRG15         10A
     A                                      TEXT('Preferred Data CRG 15')
     A                                      COLHDG('Preferred' +
     A                                             'Data CRG' +
     A                                             'Name 15')
      *
     A            RSV15         11A
     A                                      TEXT('Reserved Field 15')
     A                                      COLHDG('Reserved' +
     A                                             'Field 15')
      *
     A            FILE16        10A
     A                                      TEXT('File Name 16')
     A                                      COLHDG('File' +
     A                                             'Name' +
     A                                             '16')
      *
     A            LIB16         10A
     A                                      TEXT('Library Name 16')
     A                                      COLHDG('Library' +
     A                                             'Name' +
     A                                             '16')
      *
     A            MBR16         10A
     A                                      TEXT('Member Name 16')
     A                                      COLHDG('Member' +
     A                                             'Name' +
     A                                             '16')
      *
     A            NOSP16         9B 0
     A                                      TEXT('No. Object Specifiers 16')
     A                                      COLHDG('No. of' +
     A                                             'Object' +
     A                                             'Specifiers 16')
      *
     A            JRN16         20A
     A                                      TEXT('Qualified Journal 16')
     A                                      COLHDG('Qualified' +
     A                                             'Default Journal' +
     A                                             'Name 16')
      *
     A            CRIT16         1A
     A                                      TEXT('Criticality Ind 16')
     A                                      COLHDG('Criticality' +
     A                                             'Indicator' +
     A                                             '16')
      *
     A            CRG16         10A
     A                                      TEXT('Preferred Data CRG 16')
     A                                      COLHDG('Preferred' +
     A                                             'Data CRG' +
     A                                             'Name 16')
      *
     A            RSV16         11A
     A                                      TEXT('Reserved Field 16')
     A                                      COLHDG('Reserved' +
     A                                             'Field 16')
      *
     A            FILE17        10A
     A                                      TEXT('File Name 17')
     A                                      COLHDG('File' +
     A                                             'Name' +
     A                                             '17')
      *
     A            LIB17         10A
     A                                      TEXT('Library Name 17')
     A                                      COLHDG('Library' +
     A                                             'Name' +
     A                                             '17')
      *
     A            MBR17         10A
     A                                      TEXT('Member Name 17')
     A                                      COLHDG('Member' +
     A                                             'Name' +
     A                                             '17')
      *
     A            NOSP17         9B 0
     A                                      TEXT('No. Object Specifiers 17')
     A                                      COLHDG('No. of' +
     A                                             'Object' +
     A                                             'Specifiers 17')
      *
     A            JRN17         20A
     A                                      TEXT('Qualified Journal 17')
     A                                      COLHDG('Qualified' +
     A                                             'Default Journal' +
     A                                             'Name 17')
      *
     A            CRIT17         1A
     A                                      TEXT('Criticality Ind 17')
     A                                      COLHDG('Criticality' +
     A                                             'Indicator' +
     A                                             '17')
      *
     A            CRG17         10A
     A                                      TEXT('Preferred Data CRG 17')
     A                                      COLHDG('Preferred' +
     A                                             'Data CRG' +
     A                                             'Name 17')
      *
     A            RSV17         11A
     A                                      TEXT('Reserved Field 17')
     A                                      COLHDG('Reserved' +
     A                                             'Field 17')
      *
     A            FILE18        10A
     A                                      TEXT('File Name 18')
     A                                      COLHDG('File' +
     A                                             'Name' +
     A                                             '18')
      *
     A            LIB18         10A
     A                                      TEXT('Library Name 18')
     A                                      COLHDG('Library' +
     A                                             'Name' +
     A                                             '18')
      *
     A            MBR18         10A
     A                                      TEXT('Member Name 18')
     A                                      COLHDG('Member' +
     A                                             'Name' +
     A                                             '18')
      *
     A            NOSP18         9B 0
     A                                      TEXT('No. Object Specifiers 18')
     A                                      COLHDG('No. of' +
     A                                             'Object' +
     A                                             'Specifiers 18')
      *
     A            JRN18         20A
     A                                      TEXT('Qualified Journal 18')
     A                                      COLHDG('Qualified' +
     A                                             'Default Journal' +
     A                                             'Name 18')
      *
     A            CRIT18         1A
     A                                      TEXT('Criticality Ind 18')
     A                                      COLHDG('Criticality' +
     A                                             'Indicator' +
     A                                             '18')
      *
     A            CRG18         10A
     A                                      TEXT('Preferred Data CRG 18')
     A                                      COLHDG('Preferred' +
     A                                             'Data CRG' +
     A                                             'Name 18')
      *
     A            RSV18         11A
     A                                      TEXT('Reserved Field 18')
     A                                      COLHDG('Reserved' +
     A                                             'Field 18')
      *
     A            FILE19        10A
     A                                      TEXT('File Name 19')
     A                                      COLHDG('File' +
     A                                             'Name' +
     A                                             '19')
      *
     A            LIB19         10A
     A                                      TEXT('Library Name 19')
     A                                      COLHDG('Library' +
     A                                             'Name' +
     A                                             '19')
      *
     A            MBR19         10A
     A                                      TEXT('Member Name 19')
     A                                      COLHDG('Member' +
     A                                             'Name' +
     A                                             '19')
      *
     A            NOSP19         9B 0
     A                                      TEXT('No. Object Specifiers 19')
     A                                      COLHDG('No. of' +
     A                                             'Object' +
     A                                             'Specifiers 19')
      *
     A            JRN19         20A
     A                                      TEXT('Qualified Journal 19')
     A                                      COLHDG('Qualified' +
     A                                             'Default Journal' +
     A                                             'Name 19')
      *
     A            CRIT19         1A
     A                                      TEXT('Criticality Ind 19')
     A                                      COLHDG('Criticality' +
     A                                             'Indicator' +
     A                                             '19')
      *
     A            CRG19         10A
     A                                      TEXT('Preferred Data CRG 19')
     A                                      COLHDG('Preferred' +
     A                                             'Data CRG' +
     A                                             'Name 19')
      *
     A            RSV19         11A
     A                                      TEXT('Reserved Field 19')
     A                                      COLHDG('Reserved' +
     A                                             'Field 19')
      *
     A            FILE20        10A
     A                                      TEXT('File Name 20')
     A                                      COLHDG('File' +
     A                                             'Name' +
     A                                             '20')
      *
     A            LIB20         10A
     A                                      TEXT('Library Name 20')
     A                                      COLHDG('Library' +
     A                                             'Name' +
     A                                             '20')
      *
     A            MBR20         10A
     A                                      TEXT('Member Name 20')
     A                                      COLHDG('Member' +
     A                                             'Name' +
     A                                             '20')
      *
     A            NOSP20         9B 0
     A                                      TEXT('No. Object Specifiers 20')
     A                                      COLHDG('No. of' +
     A                                             'Object' +
     A                                             'Specifiers 20')
      *
     A            JRN20         20A
     A                                      TEXT('Qualified Journal 20')
     A                                      COLHDG('Qualified' +
     A                                             'Default Journal' +
     A                                             'Name 20')
      *
     A            CRIT20         1A
     A                                      TEXT('Criticality Ind 20')
     A                                      COLHDG('Criticality' +
     A                                             'Indicator' +
     A                                             '20')
      *
     A            CRG20         10A
     A                                      TEXT('Preferred Data CRG 20')
     A                                      COLHDG('Preferred' +
     A                                             'Data CRG' +
     A                                             'Name 20')
      *
     A            RSV20         11A
     A                                      TEXT('Reserved Field 20')
     A                                      COLHDG('Reserved' +
     A                                             'Field 20')
      *
     A            FILL          12A
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
      *
