      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SC Support to Main Sys Trans Stat Dtaara')
      *****************************************************************
      *                                                               *
      *  Midas - System Control Module                                *
      *                                                               *
      *  PF/SCSUPP - Support to Main System Transition Status Dataarea*
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4.01 -------------------------------------------*
      *  Prev Amend No. CSC011  *CREATE    Date 18Sep01               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSC011 - 24x7 Midas Availability                             *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R SCSUPPD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A            S3STRT         1          TEXT('Transition +
     A                                            Started')
     A                                      COLHDG('Transition' +
     A                                            'Started')
     A            S3PHAS         1          TEXT('Cutover Phase')
     A                                      COLHDG('Cutover Phase')
     A            S3SOPT         4          TEXT('Save Option')
     A                                      COLHDG('Save Option')
     A            S3SAVF        10          TEXT('Save File')
     A                                      COLHDG('Save File')
     A            S3TMLM         6S         TEXT('Time of Last Message')
     A                                      COLHDG('Time of Last' +
     A                                             'Message')
     A            S3TPLM         1          TEXT('Type of Last Message')
     A                                      COLHDG('Type of Last' +
     A                                             'Message')
     A            S3TMNM         6S         TEXT('Time of Next Message')
     A                                      COLHDG('Time of Next' +
     A                                             'Message')
     A            S3TPNM         1          TEXT('Type of Next Message')
     A                                      COLHDG('Type of Next' +
     A                                             'Message')
     A            S3TIME         5S         TEXT('Message Time')
     A                                      COLHDG('Message Time')
     A            S3FILL       221          TEXT('Filler')
     A                                      COLHDG('Filler')
