      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GL Account Postings')                            *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  LF/APOSTL12 - Midas GL Account Postings                      *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2011            *
      *                                                               *
      *  Last Amend No. AR792734A *CREATE  Date 23Sep11               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  AR792734A - Wrong Entries Shown on Projected Account         *
      *              Movement Screen after Real Time Posting.         *
      *              (Child: AR792735A)                               *
      *                                                               *
      *****************************************************************
     A          R APOSTPDF                  PFILE(APOSTPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2011')
     A          K BRCA
     A          K CNUM
     A          K CCY
     A          K ACOD
     A          K ACSQ
     A          K PSTD
     A          K SPOS
