      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GL Items in Clearing')
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module
      *                                                               *
      *  LF/CLEAR - ITEMS IN CLEARING                                 *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2006            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      *  Last Amend No. CAP205             Date 23Feb10               *
      *  Prev Amend No. CAP204             Date 09Feb10               *
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 237598 (Reopen)    Date 10Mar06               *
      *                 237598 *Create     Date 15Feb06               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  CAP205 - Teller Related APIs - Account Balance Check         *
      *           (Recompile)                                         *
      *  CAP204 - Teller Related APIs - Account Transfer (Recompile)  *
      *  237598 - (Reopen) Include RSACMTPD in Items in clearing check*
      *  237598 - New LF to key on BRCA/CNUM/CCY/ACOD/ACSQ combination*
      *                                                               *
      *****************************************************************
     A          R APOSTPDF                  PFILE(CLEARPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2006')
     A          K BRCA
     A          K CNUM
     A          K CCY
     A          K ACOD
     A          K ACSQ
      *
      ** Start of change 237598
      *
     A          R RSACMTPO                  PFILE(RSACMTPD)
     A          K BRCA
     A          K CUSN
     A          K CCYD
     A          K ACDE
     A          K ASNC
      *
      ** End of change 237598
      *
