      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GL Items in Clearing detail')                    *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  LF/CLEARL1 - Midas GL Items in Clearing detail               *
      *                                                               *
      *  (c) Misys International Bnaking Systems Ltd. 2014            *
      *                                                               *
      *  Last Amend No. 255811             Date 19Aug14               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  255811 - Facility available in LE0720P1 does not include     *
      *           the debit/credit interest charges due for the same  *
      *           day for the linked account.                         *
      *                                                               *
      *****************************************************************
     A          R APOSTPDF                  PFILE(CLEARPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2014')
      *
     A          K BRCA
     A          K CNUM
     A          K CCY
     A          K ACOD
     A          K ACSQ
