      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_RB                                                        *
/*EXI *  TEXT('Midas Citydealer Generated Entries')
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  LF/GECDL0 - Midas Citydealer Generated Entries               *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      *  Prev Amend No. CAP204             Date 05Feb10               *
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027             Date 05Dec05               *
      *                 CGL029             Date 01Sep03               *
      *                 CGL020             Date 12Dec02               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 CSD008             Date 05Feb01               *
      * Midas DBA 3.01 -----------------------------------------------*
      *                 CGL007             Date 26Mar99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CEU013             Date 27Feb98               *
      *                 095395             Date 24Nov95               *
      *                 095751             DATE 09NOV95               *
      *                 CCM002 *CREATE     DATE 04SEP95               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CAP204 - Teller Related APIs - Account Transfer              *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CGL020 - Midas Compliance Watch - Additional A/C Postings    *
      *           Information (Recompile)                             *
      *  CSD008 - Customer Service Fees Enhancement                   *
      *  CGL007 - Account Postings Enquiry (Recompile)                *
      *  CEU013 - EMU Account Postings Narrative                      *  *
      *           Recompiled over amended APOSTPD.                    *
      *  096395 - Process items in clearing separately to avoid       *
      *           extracting the same posting more than once.         *
      *  095751 - Include postings from Customer Lending to avoid the *
      *           Citydealer transmission amounts for Customer        *
      *           Lending being reversed in error.                    *
      *  CCM002 - Midas/Citydealer Interface (Phases V and VI)        *
      *                                                               *
      *****************************************************************
     A*>>096395>>
     A**********R APOSTPDF                  PFILE(CLEARPD CLEAR2PD MANPOPD +
     A          R APOSTPDF                  PFILE(MANPOPD +
     A*<<096395<<
     A                                      GESFPD GEFAPD GESOPD GECEPD +
     A                                      GEAAPD GEFPPD GEFP2PD GEDLPD +
     A                                      GEDL2PD GEHMPD GEHM2PD GENAPD +
     A                                      GENA2PD GECMPD GEICPD GEIC2PD +
     A*/COPY WNCPYSRC,GECDL0001
     A*>>095751>>
     A***********                           GETTPD GESCPD GESC1PD)
     A                                      GETTPD GESCPD GESC1PD GELEPD +
     A**Start of change CSD008
     A**********                            GELE2PD)                                          CSD008
      ** Start of change CAP204
     A**********                            GELE2PD GEFEPD GEFE2PD)                           CAP204
     A                                      GELE2PD GEFEPD GEFE2PD +
     A                                      GETX2PD)
      ** End of change CAP204
     A**End of change CSD008
     A*<<095751<<
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*
     A          K GETP
     A          K BRCA
     A          K CCY
     A          K VALD
