      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GL Account postings by value date - post 1')
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  LF/GLACP1L1 - Account Postings by Value Date - Post 1        *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      *  Last Amend No. CAP204             Date 05Feb10               *
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      *                 CGL029             Date 01Sep03               *
      *                 CRE008             Date 19Feb02               *
      *                 CGL020             Date 12Dec02               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 CSD008  *CREATE    Date 05Feb01               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CAP204 - Teller Related APIs - Account Transfer              *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CRE008 - Cash Management                                     *
      *  CGL020 - Midas Compliance Watch - Additional A/C Postings    *
      *           Information (Recompile)                             *
      *  CSD008 - Customer Service Fees Enhancement                   *
      *                                                               *
      *****************************************************************
      *
     A          R APOSTPDF                  PFILE(GESOPD GECEPD GEICPD +
     A                                      GESFPD GEFAPD CLEARPD +
     A                                      GEDLPD GEFRPD GECLPD +
     A                                      MANPOPD GELEPD GEAAPD +
     A                                      GEIERPD GESTPD GEFPPD +
     A                                      GEFFPD GECMPD GENAPD +
     A                                      GEFEPD GEPCPD GEHMPD +
     A**Start of change CRE008
     A**********                            GESCPD GETTPD GEPMPD)                             CRE008
     A                                      GESCPD GETTPD GEPMPD +
      ** Start of change CAP204
     A**********                            GECXPD)                                           CAP204
     A                                      GECXPD GETXPD)
      ** End of change CAP204
     A**End of change CRE008
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A          K BRCA
     A          K CNUM
     A          K CCY
     A          K ACOD
     A          K ACSQ
     A          K VALD
     A          O RECI                      COMP(EQ '*')
      *
     A          R APOSTRAF                  PFILE(RCHGRA)
      *
     A          K BRCA
     A          K CNUM
     A          K CCY
     A          K ACOD
     A          K ACSQ
     A          K VALD
      *
