      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GL Joined File for GLCOLLPD and GLCOLAPD')       *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  LF/GLCOLLJ0 - Midas GL Joined File for GLCOLLPD and GLCOLAPD *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      *  Last Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. BUG11623           Date 27Jun06               *
      *                 CSD027             Date 05Dec05               *
      *                 CLE040             Date 05Jul04               *
      *                 CLE025  *CREATE    Date 20Oct03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CLE148 - Alpha Loan Reference (Recompile)                    *
      *  BUG11623 - Sequence No. column should be included (Recompile)*
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CLE040 - Collateralised Lending Phase 2 (Recompile)          *
      *  CLE025 - Credit Lines                                        *
      *                                                               *
      *****************************************************************
     A          R GLCOLJD0                  JFILE(GLCOLLPD GLCOLAPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
     A          J                           JOIN(GLCOLLPD GLCOLAPD)
     A                                      JFLD(CDCREF   CACREF)
      *
     A            CDRECI
     A            CDCREF
     A            CDENTY
     A            CDCMPY
     A            CDBRCA
     A            CDCNUM
     A            CDSTAT
     A            CDGNSP
     A            CDCCY
     A            CDLAMT
     A            CDMODS
     A            CDFCUS
     A            CDFTYP
     A            CDFSEQ
     A            CDLNLM
     A            CDSBRC
     A            CDSCNM
     A            CDSCCY
     A            CDSACD
     A            CDSSEQ
     A            CDCLV1
     A            CDCLV2
     A            CDCLV3
     A            CDCLV4
     A            CDCLV5
     A            CDCLV6
     A            CDCLV7
     A            CDCLV8
     A            CDCLV9
     A            CDCL10
      *
     A            CABRCA
     A            CACNUM
     A            CAMODS
     A            CAAMT
     A            CAFCUS
     A            CAFTYP
     A            CAFSEQ
     A            CALNLM
     A            CASBRC
     A            CASCNM
     A            CASCCY
     A            CASACD
     A            CASSEQ
     A            CAACMT
      *
     A          K CDCREF
      *
