      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GL Collateral Account Keys Details')
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  LF/GLCOAKL1 - Midas GL Collateral Account Keys Details       *
      *                                                               *
      *  (c) Finastra International Limited 2003                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Prev Amend No. 251436  *CREATE    Date 16Nov07               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  251346 - Create Collateral Acocunt Keys Enquiry function to  *
      *           go along with Collateral Account Keys Maintenace.   *
      *           This file has same formats as ACKEY so that SD0930  *
      *           can be used for collateral ac key enquiry.          *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A          R ACKEYAKF                  PFILE(GLCOAHPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2007')
     A            CHRECI
     A            QQAKEY
     A            CHZZ02
     A            CHNREC
     A            CHNINS
     A            CHNDEL
     A            CHNAMD
     A            CHNRC1
     A            CHZZ64
     A            CHAKEY
     A          K CHAKEY
      *
     A          R ACKEYALF                  PFILE(GLCOAKPD)
     A            CORECI
     A            QQAKEY
     A            COZZ02
     A            ACD1QQ
     A            ACD2QQ
     A            ACD3QQ
     A            ACD4QQ
     A            ACD5QQ
     A            ACD6QQ
     A            CONCD1
     A            CONCD2
     A            CONCD3
     A            CONCD4
     A            CONCD5
     A            CONCD6
     A            COPRF1
     A            COPRF2
     A            COPRF3
     A            COPRF4
     A            COPRF5
     A            COPRF6
     A            COZZ34
     A            COLCD
     A            COCHTP
     A            COTNLU
     A            COACD1
     A            COACD2
     A            COACD3
     A            COACD4
     A            COACD5
     A            COACD6
     A            COAKEY
      *
     A          K COAKEY
