      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GL Historic Interface Detail File - Update')
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  LF/GLHSIFL0 - Historic Interface Details File                *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGL028  *CREATE    Date 16Sep03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGL028 - GL Postings Interface                               *
      *                                                               *
      *****************************************************************
     A          R GLHSIFD0                  PFILE(GLHSIFPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
     A          K PRDN
     A          K IFBN
