      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GL VTB Interface Extension File')                *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  PF/GLJEIPY1 - VTB Interface Extension File                   *
      *                                                               *
      *  (c) Finastra International Limited 2020                      *
      *                                                               *
      *  Last Amend No. FVT101             Date 07Oct16               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  FVT101 - Field 61 Enhancement on SWIFT Statement Messages    *
      *                                                               *
      *****************************************************************
      *
     A                                      UNIQUE
     A          R @GLJEIX1                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2016')
     A                                      PFILE(GLJEIPX1)
      *
      ** Key fields
      *
     A          K CSPNR
     A          K CSSNR
      *
