      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GL Journl entry histry -adtl info - update')
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  LF/GLJEHXL2 - Midas GL Journal Entry History - Additional    *
      *                Information by Batch Number and Batch Item     *
      *                Number - Update Index                          *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2002            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGL013  *CREATE    Date 25Feb02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGL013 - MT94x Message Generation.                           *
      *                                                               *
      *****************************************************************
     A          R GLJEHXD0                  PFILE(GLJEHXPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2002')
      *
      */COPY WNCPYSRC,GLJEHXL201
      *
      *.....................................................................
      * Key fields
     A          K HAPTDT
     A          K HABTNB
     A          K HABINB
      *
      */COPY WNCPYSRC,GLJEHXL202
      *
