      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GL Journal history summary   LF')
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  LF/GLJEHSL0 - Journal history summary                        *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. NNNNNN  *CREATE    Date DDMmmYY               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  nnnnnn - (change description)                                *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A*=====================================================================
     A          R @BHREDG                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A                                      PFILE(GLJEHSPD)
     A*---------------------------------------------------------------------
     A            HSBEDT                    TEXT('Batch Entry Date')
     A            HSBTNB                    TEXT('Batch number')
     A            HSCYCD                    TEXT('Currency code')
     A            HSBRCD                    TEXT('Branch code')
     A            HSDBTT                    TEXT('Debit total')
     A            HSCRTT                    TEXT('Credit total')
     A*.....................................................................
     A* Key fields
     A          K HSBEDT
     A          K HSBTNB
     A          K HSCYCD
     A          K HSBRCD
     A*=====================================================================
