      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GL Journal entry posting Rtv')                   *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  LF/GLJENPL1 - Journal entry posting                          *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. MD027587           Date 19Jun14               *
      *                 CAP207             Date 10Feb11               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CRE019             Date 12Jan04               *
      *                 CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CAP032             Date 26Apr99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CEU013             Date 23Feb98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  MD027587- Unable to used the C for Copy and T for Template   *
      *  CAP207 - Account Balance Check extended to other APIs        *
      *           (Recompile)                                         *
      *  CRE019 - Cheque Processing and Maintenance                   *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CAP032 - Conversion of Journal Batch Entry inputs into       *
      *           modular structure to use as APIs.  Added fields     *
      *           BTFRNT, BTAFRT, BTTMST and BTVALI.                  *
      *  CEU013 - EMU Account Posting Narrative changes               *
      *           Addition of BTOCCY and BTOAMT fields                *
      *                                                               *
      ********************************************************************
     A                                      UNIQUE
     A*=====================================================================
     A          R @BTREAL                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A                                      PFILE(GLJENPPD)
     A*---------------------------------------------------------------------
     A            BTBTNB                    TEXT('Batch number')
     A            BTBINB                    TEXT('Batch item no.')
     A            BTIBCA                    TEXT('Input Branch Code - Alpha')
     A            BTCUST                    TEXT('Customer number')
     A            BTCYCD                    TEXT('Currency code')
     A            BTACCD                    TEXT('Account code')
     A            BTACSN                    TEXT('Account sequence number')
     A            BTNNBI                    TEXT('Nostro number (Item)')
     A            BTRACN                    TEXT('Retail account number')
     A            BTRINO                    TEXT('Retail ind.: Override')
     A            BTRINE                    TEXT('Retail ind.: Error')
     A            BTTRTY                    TEXT('Transaction type')
     A            BTPTAM                    TEXT('Posting amount')
     A            BTDCIN                    TEXT('Debit/credit indicator')
     A            BTPTDT                    TEXT('Posting date')
     A            BTVLDT                    TEXT('Value date')
     A            BTNVCD                    TEXT('Narrative code')
     A            BTNRDC                    TEXT('Narrative description')
     A            BTACTY                    TEXT('Account type')
     A            BTACNB                    TEXT('Assoc. Customer number')
     A            BTCQNB                    TEXT('Cheque number')
     A            BTCOIN                    TEXT('Customer originated ind.')
     A            BTSWCR                    TEXT('Swift common reference')
     A            BTPRCN                    TEXT('Profit centre')
     A            BTBCBH                    TEXT('Branch Code (Batch Headr)')
     A            BTRADP                    TEXT('Retail advice printed')
     A            BTSHPI                    TEXT('Shadow post indicator')
     A            BTRRNM                    TEXT('Relative rec no of memos rcd')
     A            BTRNBE                    TEXT('Retail Number Entered')
     A            BTRARC                    TEXT('Retail Ac Referral Cond.')
     A            BTTSTY                    TEXT('Transaction (Sub - Type)')
     A            BTBKCD                    TEXT('Book Code')
     A            BTSPFC                    TEXT('Spread Factor')
     A            BTRVDI                    TEXT('Reverse/Void Indicator')
     A            BTNITM                    TEXT('Number of Items')
     A*                                                  Begin /CEU013/
     A            BTOCCY                    TEXT('Original Currency')
     A            BTOAMT                    TEXT('Original amount')
     A*                                                  End   /CEU013/
      *                                              Begin /CAP032/
     A            BTFRNT                    TEXT('Front Office Trans Id')
     A            BTAFRT                    TEXT('Assoc Front Office Trans Id')
     A            BTTMST                    TEXT('Timestamp')
     A            BTVALI                    TEXT('Valid Indicator')
      *                                              End   /CAP032/
     A**Start of change CRE019
     A            BTDUPC                    TEXT('Duplicate Cheques Flag')
     A            BTOUTR                    TEXT('Out of Range Flag')
     A**End of change CRE019
      ** Start of change MD027587
     A            BTPDID                    TEXT('Pre-Deal Check ID')
      ** End of change MD027587
 
     A*.....................................................................
     A* Key fields
     A          K BTBTNB
     A          K BTBINB
     A*=====================================================================
