      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GL MultiCash Narratives File - Upd Indx')        *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/GLMNARL6 - Midas GL MultiCash Narratives File - Upd Indx  *
      *                                                               *
      *  (c) Finastra International Limited 2009                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CER059             Date 19Jul10               *
      *                 BUG26093 *CREATE   Date 22Sep09               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  BUG26093 - Extended Narratives are not refreshed with reused *
      *             batch numbers.                                    *
      *                                                               *
      *****************************************************************
     A          R GLMNARD0                  PFILE(GLMNARPD)
     A                                      TEXT('(c) Finastra +
     A                                      International Banking +
     A                                      Limited 2009')
      *
     A          K BABANB
     A          K BAITNB
