      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GL On Line Positions')
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  LF/GLOLPEL0 - OnLine Positions                               *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CEU012  *CREATE    Date 16Feb98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CEU012 - EMU Position/Risk Enquiries                         *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A          R OLPOSHHF                  PFILE(OLPOSHH)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A          K BRCA
     A          K CCY
     A          K RECN
      *
     A          R GLOLEMD0                  PFILE(GLOLEMPD)
      *
     A          K BRCA
     A          K CCY
     A          K RECN
      *
     A          R OLPOSOBF                  PFILE(OLPOSOB)
      *
     A          K BRCA
     A          K CCY
     A          K RECN
