      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXI *  TEXT('Midas GL Acc Post-Prfc & Post/Date(no brca')           *
/*E*S****LF_IM*********************************************************                     MD022015
/*EXS *  LF_RB                                                        *                     MD022015
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  LF/GLPOSTL5 - GL Accounts Post                               *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *  Last Amend No. MD022015           Date 27Aug12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      *                 CGL029             Date 01Sep03               *
      *                 CGL020             Date 12Dec02               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 CDE002  *CREATE    Date 05Dec00               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD022015 - Rebuild access path maintenance locking issue     *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CGL020 - Midas Compliance Watch - Additional A/C Postings    *
      *           Information (Recompile)                             *
      *  CDE002 - Data Export - CCRM Revenue Analysis.                *
      *                                                               *
      *****************************************************************
     A          R APOSTPDF                  PFILE(APOSTPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K BRCA
     A          K CNUM
     A          K CCY
     A          K ACOD
     A          K ACSQ
     A          K ASOC
     A          K PSTD
     A          K DRCR
      *
     A          R GLACPHDF                  PFILE(GLACPHPD)
     A            RECI
     A            CNUM
     A            CCY
     A            ACOD
     A            ACSQ
     A            IPDN
     A            ACNO
     A            PSTD
     A            VALD
     A            TRAT
     A            PNAR
     A            PSTA
     A            DRCR
     A            ASOC
     A            CHQN
     A            SPOS
     A            BRCA
     A            RIND
     A            REJC
     A            DPMT
     A            RRNM
     A            ZZ009
     A            ATYP
     A            ZZ002
     A            EXIN
     A            PRIN
     A            GETP
     A            ACUM
     A            PRFC
     A            PTIM
     A            VOIN
     A            MGTT
     A            ACSC
     A            LTAI
     A            ZZ007
     A            RINO
     A            SWCR
     A            DLREF
     A            FACO
     A            DBCNUM
     A            PREF
     A            OTRF
     A            OTST
     A            OTTP
     A            SDCB
     A            SDLB
     A            BOKC
     A            NITMS
     A            REBI
     A            CHGA
     A            PBTT
     A            ORBR
     A            ORAMT
     A            XRFI
     A            XRFN
     A            TRST
     A          K BRCA
     A          K CNUM
     A          K CCY
     A          K ACOD
     A          K ACSQ
     A          K ASOC
     A          K PSTD
     A          K DRCR
      *
