      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GL Reports Management (Acct Report Keyed)')      *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  LF/GLRMDTL3 - Midas GL Reports Management (Acct Report Keyed)*
      *                                                               *
      *  (c) Finastra International Limited 2014                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CGL154  *CREATE    Date 13Oct14               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL154 - FATCA Reporting                                     *
      *                                                               *
      *****************************************************************
     A          R GLRMDTD0                  PFILE(GLRMDTPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2014')
     A          K MGMSID
     A          K MGTPMT
      *
     A          S MGTPMT                    COMP(EQ 'AccountReport')
     A          S MGTPMT                    COMP(EQ 'Organisation')
     A          S MGTPMT                    COMP(EQ 'Individual')
     A          S MGTPMT                    COMP(EQ 'Payment')
     A          S MGTPMT                    COMP(EQ 'SubstantialOwner')
 
     A          S MGTPMT                    COMP(EQ 'AccountBalance')
 
