      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GL Statement postings all')                      *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      *  LF/GLSMTP2  - GL Statement Postings                          *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2018            *
      *                                                               *
      *  Last Amend No. 259159 *Create     Date 22Jan18               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  259159 - Retrieve postings from historic file.               *
      *         - Applied for MD-46416.                               *
      *                                                               *
      *****************************************************************
      *
     A          R APOSTPDF                  PFILE(APOSTPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2018')
      *
     A          K BRCA
     A          K CNUM
     A          K CCY
     A          K ACOD
     A          K ACSQ
     A          K PSTD
     A          K VALD
     A          K DRCR
     A          K PSTA
      *
     A          R GLACPHPF                  PFILE(GLACPHPD)
     A            RECI
     A            CNUM
     A            CCY
     A            ACOD
     A            ACSQ
     A            IPDN
     A            ACNO
     A            PSTD
     A            VALD
     A            TRAT
     A            PNAR
     A            PSTA
     A            DRCR
     A            ASOC
     A            CHQN
     A            SPOS
     A            BRCA
     A            RIND
     A            REJC
     A            DPMT
     A            RRNM
     A            ZZ009
     A            ATYP
     A            ZZ002
     A            EXIN
     A            PRIN
     A            GETP
     A            ACUM
     A            PRFC
     A            PTIM
     A            VOIN
     A            MGTT
     A            ACSC
     A            LTAI
     A            ZZ007
     A            RINO
     A            SWCR
     A            DLREF
     A            FACO
     A            DBCNUM
     A            PREF
     A            OTRF
     A            OTST
     A            OTTP
     A            SDCB
     A            SDLB
     A            BOKC
     A            NITMS
     A            REBI
     A            CHGA
     A            PBTT
     A            ORBR
     A            ORAMT
     A            XRFI
     A            XRFN
     A            TRST
      *
     A          K BRCA
     A          K CNUM
     A          K CCY
     A          K ACOD
     A          K ACSQ
     A          K PSTD
     A          K VALD
     A          K DRCR
     A          K PSTA
