      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GL V.RE Accounts Password Ext. by FO Id')
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger ILE Module                            *
      *                                                               *
      *  LF/GLVAMPWL2 - Valid Retail Account Password Extension File  *
      *                 by front office ID (40-long)                  *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      *  Prev Amend No. CGL029  *CREATE    Date 01Sep03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *                                                               *
      *****************************************************************
     A          R GLVAMPWD0                 PFILE(GLVAMPWPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
      *
     A            PWCNUM
     A            PWCCY
     A            QQACOD
     A            PWACSQ
     A            PWBRCA
     A            PWPSWD
      *
     A            PWFRNT
     A            PWAFRT
     A            PWREPA
     A            PWTMES
     A            PWACOD
      *
     A            PWFR40                    CONCAT(PWFRNT PWAFRT)
      *
     A          K PWFR40
