      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas GL STRAN LF Dealing Accrued Interest')           *
     A**************************************************************
     A*                                                            *
     A*  Midas - General Ledger Module
     A*                                                            *
     A*   LF/STRANDL1  SINGLE TRANSACTION                          *
     A*                                                            *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                            *
      *  Last Amend No. AR1096788          Date 18Mar13               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*                 CAC001             Date 01Feb96               *
     A*                 CIR002             Date 13Jun95               *
     A*                 DT0072             Date 07May91               *
     A*                 LN0767             DATE 04OCT90               *
     A*                      S01117           DATE    06/87        *
     A*                                                            *
     A**************************************************************
     A*
     A*  AR1096788 - DLAA details should be written in core STRANF    *
     A*              file instead of the new DLSTRANFPD file          *
     A*              (Recompile)                                      *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*  CAC001 - Profit Centre Accounting Development:               *
     A*           Recompiled only.                                    *
     A*  CIR002 - Compounding of Interest.  Recompiled.               *
     A*  DT0072 - RECOMPILED
     A*  LN0767 - OMIT BLANK RECORDS ON STRANF, AS THESE APPEAR BEFORE
     A*           DETAIL RECORDS IN LF GIVING ERROR RESULTS IN DL0220.
     A*
      ****************************************************************
      *  C R E A T I O N     P A R A M E T E R S
      *
      ****************************************************************
     A          R STRANHF                   PFILE(STRANH)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K *NONE
     A          K *NONE
     A          R STRANFF                   PFILE(STRANF)
     A          K BRCA
     A          K UDTM
     A*                                                    /LN0767/
     A          O BRCA                      VALUES('   ')
     A*                                                    /LN0767/
