      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas FC Mandatory Output Instructions Mtnce')
     A**************************************************************
     A*                                                            *
     A*  Midas - Report Control Facility Module
     A*                                                            *
     A*           DSPF/FC0220DF  -   MANDATORY REPORT              *
     A*                              OUTPUT INSTRUCTIONS           *
     A*                                                            *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                            *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CAAA03             Date 22Mar04               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  Prev Amend No. S01448             Date 03Jun94               *
     A*                 LN1151             Date 23May91               *
     A*                    LN1133             DATE  11FEB91        *
     A*                    LN0676             DATE  29AUG90        *
     A*                    LN0210             DATE  04/06/90       *
     A*                                                            *
     A**************************************************************
     A*                                                            *
      *  CAAA03 - Webfacing Changes.                                  *
     A*     S01486 - Private Banking Upgrade to Rel 10.            *
     A*              Distribute to Entity, not Company/Branch.     *
     A*     LN1151 - DISABLE F5.                                   *
     A*     LN1133 - CORRECT HELP TAG LABELS                       *
     A*     LN0676 - STANDARDISE SCREEN APPEARANCE                 *
     A*     LN0210 - ARCHIVING OPTIONS ADDED TO PROCESSING         *
     A*                                                            *
     A**************************************************************
      *
     A                                      INDARA
     A                                      MSGLOC(24)
     A                                      PRINT(MPRINT)
     A                                      CA03(03 'Exit')
     A                                      CF12(12 'Previous')
     A*                                                                 /LN0676/
     A*                                                                 /LN1151/
     A**********                            CF05(05 'Refresh')
     A*                                                                 /LN1151/
     A*                                                                 /LN0676/
     A          R FC0220F0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A  56                                  CA10(10 'Delete')
      ** Start of change CAAA03
     A                                      OVERLAY
      ** End of change CAAA03
     A                                      PUTOVR
     A*                                                                 /LN0676/
     A*                                             /* START LN1133*/
     A*                                                                 /LN0676/
     A*                                                                 /LN0676/
     A*                                                                 /LN0676/
     A*                                                                 /LN0676/
     A*                                                                 /LN0676/
     A*                                                                 /LN0676/
     A*                                                                 /LN0676/
     A*                                                                 /LN0676/
     A*                                                                 /LN0676/
     A*                                                                 /LN0676/
     A*                                                                 /LN0676/
     A*                                                                 /LN0676/
     A*                                                                 /LN0676/
     A*                                                                 /LN0676/
     A*                                              /* END LN1133*/
     A*                                                                 /LN0676/
     A            JUSR          10A  O  1  2TEXT('User ID')
     A                                      OVRDTA
     A                                  1 13'FC0220'
     A*                                                                 /LN0676/
     A************                      1 30'Output Instructions for Manda-
     A************                          tory reports'
     A                                  2 20'Output Instructions for Manda-
     A                                      tory Reports'
     A                                      DSPATR(HI)
     A*                                                                 /LN0676/
     A            SRUNA          7   O  1 72
     A                                      OVRDTA
     A            SWSID         10   O  2  2
     A                                      OVRDTA
     A                                  2 71TIME
     A*                                                                 /LN0676/
     A************                      5  2'Report Name.................:'
     A                                  5  2'Report Name . . . . . . . :'
     A************SRNAM         10A  B  5 32DSPATR(HI)
     A            SRNAM         10A  B  5 30DSPATR(HI)
     A*                                                                 /LN0676/
     A  36                                  DSPATR(RI)
     A N36
     AAN54N58N59                            DSPATR(UL)
     A  58
     AO 59
     AO 54                                  DSPATR(PR)
     A                                      OVRDTA
     A*                                                                 /LN0676/
     A************SRDSC         50A     6  9
     A            SRDSC         50A     6 30DSPATR(HI)
     A*                                                                 /LN0676/
     A N58N59N54                            DSPATR(ND)
     A                                      OVRDTA
     A*                                                                 /LN0676/
     A************                      7  2'Associated User.............:'
     A                                  7  2'Associated User . . . . . :'
     A*                                                                 /LN0676/
     A N58N59N54                            DSPATR(ND)
     A                                      OVRATR
     A*                                                                 /LN0676/
     A************SUSRR         10A  B  7 32DSPATR(HI)
     A            SUSRR         10A  B  7 30DSPATR(HI)
     A*                                                                 /LN0676/
     A  37                                  DSPATR(RI)
     A N37N54N59                            DSPATR(UL)
     A N58N59N54
     AO 59
     AO 54                                  DSPATR(PR)
     A N58N59N54                            DSPATR(ND)
     A                                      OVRDTA
     A*                                                                 /LN0676/
     A************                      8  2'Distribute to Company/Branch:'
     A***********                                    Begin /S01486/
     A***********                       8  2'Distribute to Company/'
     A                                  8  2'Distribute to'
     A***********                                    End   /S01486/
     A N57
     AON58N59N54                            DSPATR(ND)
     A                                      OVRATR
     A***********                                    Begin /S01486/
     A***********                       9  2'Branch  . . . . . . . . . :'
     A                                  9  2'Entity  . . . . . . . . . :'
     A***********                                    End   /S01486/
     A*                                                                 /LN0676/
     A N57
     AON58N59N54                            DSPATR(ND)
     A                                      OVRATR
     A*                                                                 /LN0676/
     A************SDRQD          1A  B  8 32DSPATR(HI)
     A            SDRQD          1A  B  9 30DSPATR(HI)
     A*                                                                 /LN0676/
     A  38                                  DSPATR(RI)
     A N38N54N59                            DSPATR(UL)
     A N57
     AON58N59
     AO 59
     AO 54                                  DSPATR(PR)
     A N57
     AON58N59N54                            DSPATR(ND)
     A                                      OVRDTA
     A*                                                                 /LN0676/
     A************                      9  2'Instruction Identifier......:'
     A                                 10  2'Instruction Identifier  . :'
     A*                                                                 /LN0676/
     A N59N54                               DSPATR(ND)
     A                                      OVRATR
     A*                                                                 /LN0676/
     A************SSOID         10A  B  9 32DSPATR(HI)
     A            SSOID         10A  B 10 30DSPATR(HI)
     A*                                                                 /LN0676/
     A  30                                  DSPATR(RI)
     A N30N54                               DSPATR(UL)
     A N59
     AO 54                                  DSPATR(PR)
     A N59N54                               DSPATR(ND)
     A                                      OVRDTA
     A*                                                                 /LN0676/
     A************                     10  2'Distribution List...........:'
     A                                 11  2'Distribution List . . . . :'
     A*                                                                 /LN0676/
     A N50
     AON59N54
     AO 51                                  DSPATR(ND)
     A                                      OVRATR
     A*                                                                 /LN0676/
     A************SDST1          8A  B 10 32DSPATR(HI)
     A            SDST1          8A  B 11 30DSPATR(HI)
     A*                                                                 /LN0676/
     A N50
     AO 51
     AON59N54                               DSPATR(ND)
     A  31                                  DSPATR(RI)
     A N51 59
     AAN31N54 50                            DSPATR(UL)
     A  54
     AON50
     AON59
     AO 51                                  DSPATR(PR)
     A                                      OVRDTA
     A*                                                                 /LN0676/
     A************SDST2          8A  B 11 32DSPATR(HI)
     A            SDST2          8A  B 12 30DSPATR(HI)
     A*                                                                 /LN0676/
     A N50
     AO 51
     AON59N54                               DSPATR(ND)
     A  31                                  DSPATR(RI)
     A N51 59
     AAN31N54 50                            DSPATR(UL)
     A  54
     AON50
     AON59
     AO 51                                  DSPATR(PR)
     A                                      OVRDTA
     A*                                                                 /LN0676/
     A************                     12  2'User for Output.............:'
     A                                 13  2'User for Output . . . . . :'
     A*                                                                 /LN0676/
     A  51
     AON59N54                               DSPATR(ND)
     A                                      OVRATR
     A*                                                                 /LN0676/
     A************SUSRO         10A  B 12 32DSPATR(HI)
     A            SUSRO         10A  B 13 30DSPATR(HI)
     A*                                                                 /LN0676/
     A  32                                  DSPATR(RI)
     A  59N54N51
     AAN32                                  DSPATR(UL)
     A  54
     AON59
     AO 51                                  DSPATR(PR)
     A  51
     AON59N54                               DSPATR(ND)
     A                                      OVRDTA
     A*                                                                 /LN0676/
     A************                     13  2'Archive to Microfiche.......:'
     A                                 14  2'Archive to Microfiche . . :'
     A*                                                                 /LN0676/
     A N52
     AON59N54                               DSPATR(ND)
     A                                      OVRATR
     A*                                                                 /LN0676/
     A************SARMF          1A  B 13 32DSPATR(HI)
     A            SARMF          1A  B 14 30DSPATR(HI)
     A*                                                                 /LN0676/
     A  33                                  DSPATR(RI)
     A N33N54                               DSPATR(UL)
     A N52
     AON59
     AO 54                                  DSPATR(PR)
     A N52
     AON59N54                               DSPATR(ND)
     A                                      OVRDTA
     A*                                                                 /LN0676/
     A************                     14  2'Archive to Optical Disk.....:'
     A                                 15  2'Archive to Optical Disk . :'
     A*                                                                 /LN0676/
     A N53
     AON59N54                               DSPATR(ND)
     A                                      OVRATR
     A*                                                                 /LN0676/
     A************SAROD          1A  B 14 32DSPATR(HI)
     A            SAROD          1A  B 15 30DSPATR(HI)
     A*                                                                 /LN0676/
     A  34                                  DSPATR(RI)
     A N34N54                               DSPATR(UL)
     A N53
     AON59
     AO 54                                  DSPATR(PR)
     A N53
     AON54N59                               DSPATR(ND)
     A                                      OVRDTA
     A                                 23  2'F3=Main Menu'
     A N56                             23 17'F12=Previous'
     A  56                             23 17'F10=Delete   F12=Previous'
     A          R FC0220S0                  SFL
     A  20                                  SFLNXTCHG
     A            SEXST          1   H
      *                                                              /LN0210/
     A*********** SSEL           1   B  7  3DSPATR(HI)
     A            SSEL           1   B  7  2DSPATR(HI)
      *                                                              /LN0210/
     A  35                                  DSPATR(RI)
     A N35N54                               DSPATR(UL)
     A  54                                  DSPATR(PR)
      *                                                              /LN0210/
     A*********** SARID         10   O  7  6
     A*********** SMFOD          7   O  7 19
     A            SRSFX         10   O  7  4
     A            SPFTX         50   O  7 15
     A            SARID         10   O  7 66
     A            SMFOD          2   O  7 77
      *                                                              /LN0210/
     A N52 53
     AO 52N53                               DSPATR(ND)
      *                                                              /LN0210/
     A*********** SADSC         50   O  7 28
     A            SADSC         50   O  8 15
      *                                                              /LN0210/
     A          R FC0220C0                  SFLCTL(FC0220S0)
     A                                      OVERLAY
     A  21                                  SFLDSP
     A  21                                  SFLDSPCTL
     A  22                                  SFLDLT
     A  23                                  SFLEND
      *                                                              /LN0210/
     A************************************* SFLSIZ(0015)
     A************************************* SFLPAG(0014)
     A                                      SFLSIZ(0008)
     A                                      SFLPAG(0007)
      *                                                              /LN0210/
     A*                                            /* START LN1133*/
     A*                                              /* END LN1133*/
     A                                  3  3'Archiving for'
     A            SRNAM         10   O  3 17
     A            SRDSC         50   O  3 28
      *                                                              /LN0210/
     A************SRSFX         10   O  4 17
     A************SPFTX         50   O  4 28
     A********************************* 5  6'Archive Id'
     A********************************* 5 19'Medium'
     A                                  5  4'Print File'
     A                                  5 15'Description'
     A                                  5 66'Archive Id'
     A                                  5 77'Med'
      *                                                              /LN0210/
     A N52 53
     AO 52N53                               DSPATR(ND)
     A                                  5 28'Description'
      *                                                              /LN0210/
     A          R FC0220S2                  SFL
     A  20                                  SFLNXTCHG
     A            SEXSTX         1   H
     A            SSELX          1   B  7  2DSPATR(HI)
     A  35                                  DSPATR(RI)
     A N35N54                               DSPATR(UL)
     A  54                                  DSPATR(PR)
     A            SRSFX         10   O  7  4
     A            SPFTX         50   O  7 15
      *
     A          R FC0220C2                  SFLCTL(FC0220S2)
     A                                      OVERLAY
     A  21                                  SFLDSP
     A  21                                  SFLDSPCTL
     A  22                                  SFLDLT
     A  23                                  SFLEND
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A*                                            /* START LN1133*/
     A*                                              /* END LN1133*/
     A                                  3  3'Archiving for'
     A            SRNAM         10   O  3 17
     A            SRDSC         50   O  3 28
     A                                  5  4'Print File'
     A                                  5 15'Description'
      *                                                              /LN0210/
     A          R FC0220F1
     A                                      PUTOVR
     A                                      OVERLAY
     A            JUSR          10A  O  1  2TEXT('User ID')
     A                                  1 13'FC0220'
     A*                                                                 /LN0676/
     A************                      1 30'Output Instructions for Manda-
     A************                          tory reports'
     A                                  2 20'Output Instructions for Manda-
     A                                      tory Reports'
     A                                      DSPATR(HI)
     A*                                                                 /LN0676/
     A            SRUNA          7   O  1 72
     A                                      OVRDTA
     A            SWSID         10   O  2  2
     A                                      OVRDTA
     A                                  2 71TIME
     A          R FC0220F2
     A                                      OVERLAY
     A                                 22  2'1=Select'
     A                                 23  2'F3=Main Menu   F12=Previous'
     A          R FC0220S1                  TEXT('MESSAGE SUBFILE')
     A                                      SFL
     A                                      SFLMSGRCD(24)
     A            SSFKY                     SFLMSGKEY
     A            SPGMQ                     SFLPGMQ
     A          R FC0220C1                  TEXT('MESSAGE SFL CTL')
     A                                      OVERLAY
     A                                      SFLCTL(FC0220S1)
     A                                      SFLDSP
     A                                      SFLINZ
     A  60                                  SFLEND
     A*                                                                 /LN0676/
     A************                          SFLSIZ(5)
     A                                      SFLSIZ(3)
     A*                                                                 /LN0676/
     A                                      SFLPAG(1)
     A            SPGMQ                     SFLPGMQ
