      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas FC Restore DTALIB files request scrn')
     A*****************************************************************
     A*                                                               *
     A*  Midas - REPORT CONTROL FACILITY PROCESSING
     A*                                                               *
     A*  FCC1702DF  RESTORE RCF FILES FROM EXTERNAL MEDIA             *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*       LAST AMEND NO. S01407            DATE  26JAN93          *
     A*       PREV AMEND NO. LN1057            DATE  30NOV90          *
     A*                      S01199            DATE  18APR90          *
     A*                                                               *
     A*****************************************************************
     A*       S01407 - SWITCHABILITY ENHANCEMENTS                     *
     A*       LN1057 - REMOVE 2 OBJECTS - FCMOUTPD, FCMDOPPA          *
     A*       S01199 - HELP PROCESSING                                *
     A*****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/MPRINT)
     A                                      INDARA
     A                                      CA03(03 'F3=Exit')
     A                                      CA12(12 'F12=Cancel')
     A*                                                    /S01199/
     A*                                                    /S01199/
     A          R FCC1702F0
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*                                                    /S01199/
     A*                                                    /S01199/
     A            USRID         10A  O  1  2TEXT('User ID')
     A                                  1 13'FCC1702'
     A                                  1 22'REQUEST RESTORE RCF FILES FROM EX-
     A                                      TERNAL MEDIA'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A            RUNA           7A  O  1 72TEXT('Run date, DDMMMYY')
     A            JOB           10A  O  2  2TEXT('Job name')
     A                                  2 71TIME
     A                                  6  6'Objects to restore'
     A            OBJ001        10   O  6 25TEXT('First object to restore')
     A            OBJ002        10   O  7 25TEXT('Second object to restore')
     A            OBJ003        10   O  8 25TEXT('Third object to restore')
     A            OBJ004        10   O  9 25TEXT('Fourth object to restore')
     A*********                 START OF CHANGE            /S01407/
     A            OBJ005        10   O 10 25TEXT('Fifth object to restore')
     A            OBJ006        10   O 11 25TEXT('Sixth object to restore')
     A            OBJ007        10   O 12 25TEXT('Seventh object to restore')
     A*********                 END OF CHANGE              /S01407/
     A************                               /* Start of change for LN1057*/
     A************OBJ005        10   O 10 25TEXT('Fifth object to restore')
     A************OBJ006        10   O 11 25TEXT('Sixth object to restore')
     A************                     13  7'Restore to device'
     A************DEV           10   B 13 25TEXT('Device to restore to')
     A************                     14 18'Volume'
     A************VOL            8   O 14 25TEXT('Tape Volume ID')
     A************                     15 19'Label'
     A************LABEL         17   O 15 25TEXT('Tape Label')
     A                                 15  7'Restore to device'
     A            DEV           10   B 15 25TEXT('Device to restore to')
     A                                 16 18'Volume'
     A            VOL            8   O 16 25TEXT('Tape Volume ID')
     A                                 17 19'Label'
     A            LABEL         17   O 17 25TEXT('Tape Label')
     A************                                 /* End of change for LN1057*/
     A*
     A                                 23  2'F3=Exit'
     A                                 23 11'F12=Cancel'
