      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MG  Cover msg Related ref. file')
      *****************************************************************
      *                                                               *
      *  Midas - Message Generation Module                            *
      *                                                               *
      *   PF/MGCOVRPD - COVER MESSAGE RELATED REF. FILE               *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. 105577 *CREATE     Date 13MAY97
      *                                                               *
      *                                                               *
      ********************************************************************
      *                                                               *
      *   MD046248 - Finastra Rebranding                              *
      *   105577 - *CREATE                                            *
      *            Put correct Related Ref in Cover MT202             *
      *            Based on fix 082402.                               *
      *                                                               *
      ********************************************************************
     A          R MGCOVRD0
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            CVDLNO         6          TEXT('DEAL NUMBER')
     A            CVSEQN         3          TEXT('SEQUENCE NO')
      *
     A            CVTRN         16          TEXT('TRN OF MAIN MSG')
      *
     A          K CVDLNO
     A          K CVSEQN
