      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas ED Drip Feed Data Area')
      *****************************************************************
      *                                                               *
      *  Midas - Midas Export Data Module                             *
      *                                                               *
      *  EDDRIP - ED Drip Feed Control Dataarea Layout.               *
      *                                                               *
      *  Note: Any fix applied to this file may also need to be       *
      *        applied to the core DTAARA source.                     *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01493             Date 07Jun94               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  S01493 - Midas Export Data module development.               *
      *                                                               *
      *****************************************************************
     A          R EDDRIPF                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A            JRNSNO        10          TEXT('Journal Seq Start Number')
     A            NXTBCH         7          TEXT('Next Batch Number')
     A            JOBNAM        10          TEXT('EDCONTROL Job Name')
     A            USRNAM        10          TEXT('EDCONTROL Job User Name')
     A            JOBNUM         6          TEXT('EDCONTROL Job Number')
