      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IMMXM32                                                   *
/*EXI *  MBR(CURR) DTAMBRS((MRPCMXPD (CURR)))                         *
/*EXI *  TEXT('Midas MR Posting Calendar Months Extracted')
/*ADD *  ADDLFM FILE(MRPCMXL1) MBR(HIST) DTAMBRS((MRPCMXPD (HIST)))   *
      *****************************************************************
      *                                                               *
      *  Midas - MidasPlus Reporting Module                           *
      *                                                               *
      *  LF/MRPCMXL1 - Posting Calendar Months Extracted              *
      *                                                               *
      *  (c) Finastra International Limited 2005                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CMR001             Date 01Sep04               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CMR001 - MidasPlus Reporting                                 *
      *                                                               *
      *****************************************************************
     A          R MRPCMXD0                  PFILE(MRPCMXPD)
     A          K CY
     A          K CM
