      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas MR Trans, A/cs & Posns - ACCR/CUSN')
      *****************************************************************
      *                                                               *
      *  Midas - MidasPlus Reporting Module                           *
      *                                                               *
      *  LF/MRTRAPL2 - Transactions, Account and Positions            *
      *                Report File - ACCR/CUSN                        *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2005            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CRN001             Date 14Jul05               *
      *  Prev Amend No. CDL038             Date 10May05               *
      *                 CMR001             Date 01Sep04               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CRN001 - Additional fields added to MRTRAPPD - Recompile     *
      *  CDL038 - Extended Deal Sub Type                              *
      *  CMR001 - MidasPlus Reporting                                 *
      *                                                               *
      *****************************************************************
     A          R MRTRAPD0                  PFILE(MRTRAPPD)
     A          K EXBRCH
     A          K EXCYCD
     A          K EXAACC
     A          K EXCUSN
     A          K EXACS1
     A          K EXSUB
     A          K EXTRID
