      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas CG User defined correspondence data area')
     A*****************************************************************
     A*                                                               *
     A*  Midas - User Defined Correspondence                          *
     A*                                                               *
     A*  PF/CGDTA    - User defined correspondence Data Area          *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
     A*  Last Amend No. 175941             Date 03Jan01               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  Prev Amend No. 087942             Date 07May95               *
     A*                 079727             Date 05Dec94               *
     A*                 S01522             DATE 23NOV94               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  175941 - Add a new field that will be used to check          *
     A*           whether UDC_PRTGEN is still running                 *
     A*  087942 - Rename filler field to prevent conflict w/ACCNT     *
     A*           Add fields for Multiple Print Generators            *
     A*  079727 - Add fields to hold Print Generator job name         *
     A*  S01522 - User Defined Correspondence                         *
     A*                                                               *
     A*****************************************************************
      * 079727 Start
     A                                      REF(MFRFL)
      * 079727 End
     A*=====================================================================
     A          R CGDTAF                    TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *                                                                -----
     A            DAPATH         6          TEXT('Last Used Path Reference')
     A                                      COLHDG('Last Used Path' +
     A                                             'Reference')
     A            DAFILE        10          TEXT('HFS File System')
     A                                      COLHDG('HFS File System')
     A            DAKSVF         1          TEXT('Keep Save File CGSAVF')
     A                                      COLHDG('Keep Save' +
     A                                             'File CGSAVF')
     A            DAKEXF         1          TEXT('Keep COB Extract')
     A                                      COLHDG('Keep COB' +
     A                                             'Extract')
     A            DAITMA         8          TEXT('Last item reference')
     A                                      COLHDG('Last item' +
     A                                             'reference')
     A            DALASC         8          TEXT('Last Layout Assoc. No')
     A                                      COLHDG('Last Layout' +
     A                                             'Associaton' +
     A                                             '  Number')
     A            DAGRPC         1          TEXT('Group Set Structure Complete')
     A                                      COLHDG('Group Set' +
     A                                             'Structure' +
     A                                             'Complete')
     A            DACID          8  0       TEXT('Condition identifier.')
     A                                       COLHDG('Condition' +
     A                                              'identifier')
     A            DACSEQ         8  0       TEXT('Condition sequence.')
     A                                       COLHDG('Condition' +
     A                                              'sequence')
     A            DACGRP         8  0       TEXT('Condition group.')
     A                                       COLHDG('Condition' +
     A                                              'group')
      * 079727 Start
     A            DAPGDL         4S         TEXT('Print Gen. Delay time  ')
     A                                      COLHDG('Print Gen.' +
     A                                             'Delay Time')
     A            DAPGJB    R               TEXT('Print Gen. Job Name')
     A                                      COLHDG('Print Gen.' +
     A                                             'Job Name')
     A                                      REFFLD(JOJOB)
     A            DAPGUR    R               TEXT('Print Gen. User')
     A                                      COLHDG('Print Gen.' +
     A                                             'User')
     A                                      REFFLD(JOUSER)
     A            DAPGJN    R     S         TEXT('Print Gen. Job Number')
     A                                      COLHDG('Print Gen.' +
     A                                             'Job Number')
     A                                      REFFLD(JONBR)
     A            DAEIDL         5S         TEXT('Immed Ext. Delay time  ')
     A                                      COLHDG('Immed Ext.' +
     A                                             'Delay Time')
     A            DAEIJB    R               TEXT('Immed Ext. Job Name')
     A                                      COLHDG('Immed Ext.' +
     A                                             'Job Name')
     A                                      REFFLD(JOJOB)
     A            DAEIUR    R               TEXT('Immed Ext. User')
     A                                      COLHDG('Immed Ext.' +
     A                                             'User')
     A                                      REFFLD(JOUSER)
     A            DAEIJN    R     S         TEXT('Immed Ext. Job Number')
     A                                      COLHDG('Immed Ext.' +
     A                                             'Job Number')
     A                                      REFFLD(JONBR)
     A            DAMNBR         3          TEXT('Immed Member Number')
     A                                      COLHDG('Immed Member' +
     A                                             'Number')
     A            DAFOPT         1          TEXT('Allow format option +
     A                                            maintenance')
     A                                      COLHDG('Allow' +
     A                                             'format' +
     A                                             'changes')
     A            DASIZX         5          TEXT('Label page size X')
     A                                      COLHDG('Size X')
     A            DASIZY         5          TEXT('Label page size Y')
     A                                      COLHDG('Size Y')
     A            DANOX          5          TEXT('Number /labels X')
     A                                      COLHDG('Num. X')
     A            DANOY          5          TEXT('Number /labels Y')
     A                                      COLHDG('Num. X')
     A            DAMAX          5          TEXT('Margin size X')
     A                                      COLHDG('Marg. X')
     A            DAMAY          5          TEXT('Margin size Y')
     A                                      COLHDG('Size X')
     A            DALABX         5          TEXT('Label size X')
     A                                      COLHDG('Label X')
     A            DALABY         5          TEXT('Label size Y')
     A                                      COLHDG('Label Y')
     A            DAALLC         5S         TEXT('UDC Allocation Number')
     A                                      COLHDG('UDC Allocation' +
     A                                             'Number')
     A            DAECDL         5S         TEXT('Charge Job Delay time  ')
     A                                      COLHDG('Charge Job' +
     A                                             'Delay Time')
     A            DAECJB    R               TEXT('Charge Job Job Name')
     A                                      COLHDG('Charge Job' +
     A                                             'Job Name')
     A                                      REFFLD(JOJOB)
     A            DAECUR    R               TEXT('Charge Job User')
     A                                      COLHDG('Charge Job' +
     A                                             'User')
     A                                      REFFLD(JOUSER)
     A            DAECJN    R     S         TEXT('Charge Job Job Number')
     A                                      COLHDG('Charge Job' +
     A                                             'Job Number')
     A                                      REFFLD(JONBR)
      *
     A************ZZ221        206          TEXT('FILLER 1')
      * 087942 Start
     A************ZZ065         65          TEXT('FILLER 1')
      * 087942 End
      * 079727 End
      * 087942 Start
     A            DABLKN         2S         TEXT('Number of Bulk Jobs')
     A                                      COLHDG('Number of' +
     A                                             'Bulk Jobs')
     A            DABLKS         5S         TEXT('Minimum Size of Req')
     A                                      COLHDG('Minimum size' +
     A                                             'of Request')
      * START 087942
     A************ZZ002          2          TEXT('FILLER 2B')
     A            ZZZ02          2          TEXT('FILLER 2B')
      * END 087942
     A                                      COLHDG('Filler 2b')
     A            DABLK1        26          TEXT('Bulk 1 Job Job Name')
     A                                      COLHDG('Bulk 1 Job' +
     A                                             'Job Name')
     A            DABLK2        26          TEXT('Bulk 2 Job Job Name')
     A                                      COLHDG('Bulk 2 Job' +
     A                                             'Job Name')
     A            DABLK3        26          TEXT('Bulk 3 Job Job Name')
     A                                      COLHDG('Bulk 3 Job' +
     A                                             'Job Name')
     A            DABLK4        26          TEXT('Bulk 4 Job Job Name')
     A                                      COLHDG('Bulk 4 Job' +
     A                                             'Job Name')
     A            DABLK5        26          TEXT('Bulk 5 Job Job Name')
     A                                      COLHDG('Bulk 5 Job' +
     A                                             'Job Name')
     A            DABLK6        26          TEXT('Bulk 6 Job Job Name')
     A                                      COLHDG('Bulk 6 Job' +
     A                                             'Job Name')
     A**Start of change 175941
     A            DARUN          1          TEXT('PrtGen Run')
     A                                      COLHDG('PrtGen Run')
     A**End of change 175941
     A************ZZ256        256          TEXT('FILLER 2')
     A************                          COLHDG('Filler 2')
     A**Start of change 175941
     A**********  ZZ156        156          TEXT('FILLER 2')                                  175941
     A**********                            COLHDG('Filler 2')                                175941
     A            ZZ155        155          TEXT('FILLER 2')
     A                                      COLHDG('Filler 2')
     A**End of change 175941
      * 079727 End
     A*=====================================================================
