      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas AK AK Account keys file (facility keys)')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Account Key Generator                            *
     A*                                                               *
     A*  LF/ZACKEYL2 - Account Key Generation Work File               *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CDL038             Date 10May05               *
      *                 CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 072797  *CREATE    Date 15Feb95               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CDL038 - Extended Deal Sub Type (Recompile)                  *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
     A*  072797 - Customer Lending A/C Key Generation for Fees        *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A          R ZACKEYD0                  PFILE(ZACKEYAL)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            RECI
     A            AKEY
     A            ACD1
     A            ACD2
     A            ACD3
     A            ACD4
     A            ACD5
     A            ACD6
     A            NCD1
     A            NCD2
     A            NCD3
     A            NCD4
     A            NCD5
     A            NCD6
     A            PRF1
     A            PRF2
     A            PRF3
     A            PRF4
     A            PRF5
     A            PRF6
     A            LCD
     A            CHTP
     A            TNLU
     A*
     A            FACT               I      SST(AKEY 1 3)
     A            ARIN               I      SST(AKEY 4 1)
     A          K FACT
     A          K ARIN
