      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SC Replication File Description - BASATR')
      *****************************************************************
      *                                                               *
      *  Midas - System Control Module                                *
      *                                                               *
      *  PF/SCBATRPD - File Description - DSPFD (*BASATR)             *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4.01 -------------------------------------------*
      *  Prev Amend No. CSC011  *CREATE    Date 18Sep01               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSC011 - 24x7 Midas Availability                             *
      *                                                               *
      *****************************************************************
      *
     A          R SCBATRD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2002')
      *
     A            ATRCEN         1A         TEXT('Retrieval century')
     A                                      COLHDG('Retrieval' +
     A                                             'century')
     A            ATRDAT         6A         TEXT('Retrieval date')
     A                                      COLHDG('Retrieval' 'date' +
     A                                             'YYMMDD')
     A            ATRTIM         6A         TEXT('Retrieval time')
     A                                      COLHDG('Retrieval' 'time' +
     A                                             'HHMMSS')
     A            ATFILE        10A         TEXT('File')
     A                                      COLHDG('File')
     A            ATLIB         10A         TEXT('Library')
     A                                      COLHDG('Library')
     A            ATFTYP         1A         TEXT('File type')
     A                                      COLHDG('File' 'type')
     A            ATFILA         4A         TEXT('File attribute')
     A                                      COLHDG('File' 'attr')
     A            ATFATR         6A         TEXT('File attribute')
     A                                      COLHDG('File' 'attr')
     A            ATSYSN         8A         TEXT('System name')
     A                                      COLHDG('System' 'name')
     A            ATASP          3P 0       TEXT('ASP ID')
     A                                      COLHDG('ASP ID')
     A            ATDTAT         1A         TEXT('File type')
     A                                      COLHDG('File' 'type')
     A            ATSHAR         1A         TEXT('Share open data +
     A                                      path')
     A                                      COLHDG('Share' 'open' +
     A                                             'data path')
     A            ATLVLC         1A         TEXT('Record format +
     A                                      level check')
     A                                      COLHDG('Rec fmt' 'level' +
     A                                             'check')
     A            ATTXT         50A         TEXT('Text description')
     A                                      COLHDG('Text description')
     A            ATNOFM         5P 0       TEXT('No. of record +
     A                                      formats')
     A                                      COLHDG('No. of' 'rec' +
     A                                             'fmts')
     A            ATFCCN         1A         TEXT('Century created')
     A                                      COLHDG('Century' 'created')
     A            ATFCDT         6A         TEXT('Date created')
     A                                      COLHDG('Date' 'created')
     A            ATFCTM         6A         TEXT('Time created')
     A                                      COLHDG('Time' 'created')
     A            ATFLS          1A         TEXT('Externally-desc +
     A                                      file')
     A                                      COLHDG('Ext' 'desc' 'file')
     A            ATACCP         1A         TEXT('Access path')
     A                                      COLHDG('Access' 'path')
     A            ATSELO         1A         TEXT('Select/Omit file')
     A                                      COLHDG('Select/' 'Omit' +
     A                                             'file')
     A            ATCSEQ         1A         TEXT('Alt. collating +
     A                                      sequence')
     A                                      COLHDG('Alt' 'col' +
     A                                             'seq')
     A            ATNOMB         5P 0       TEXT('No. of members')
     A                                      COLHDG('No.' 'of' 'mbr')
     A            ATJOIN         1A         TEXT('Join logical file')
     A                                      COLHDG('Join' 'LF')
