      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SC Layout of data queue SCBKJOBMON')             *
      *****************************************************************
      *                                                               *
      *  Midas - System Control Module                                *
      *                                                               *
      *  PF/SCBKJOBMON - Layout of Data Queue SCBKJOBMON              *
      *                                                               *
      *  (c) Finastra International Limited                           *
      *                                                               *
      *  Last Amend No. MD022132A *CREATE   Date 09Mar18              *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD022132A - Triggers don't pick up Rollback deletes of ABC   *
      *              files.                                           *
      *            - Applied for MD-359                               *
      *                                                               *
      *****************************************************************
      *
     A          R SCBKJOBMO0                TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2014')
      *
     A            MESSAGE       10A         TEXT('Message')
     A                                      COLHDG('Message')
      *
