      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE COMMITMENTS EXTRACT DETAIL')
     A**************************************************************************
     A*
     A*  Midas - Customer Lending Module
     A*
     A*   PF/COMEXCF    COMMITMENTS EXTRACT-DETAIL RECORD
     A*
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CLE040             Date 05Jul04               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01117 (PHASEII)   Date 09Sep87               *
     A*
     A*************************************************************************
      *                                                               *                       CLE040
      *  CLE040 - Collateralised Lending Phase 2                      *                       CLE040
      *                                                               *                       CLE040
      *****************************************************************                       CLE040
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R COMEXCFF                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            RECI      R
     A            REGC      R
     A            CTYC      R
     A            FCLN      R
     A            AMNT      R               REFFLD(AMNT0 )
     A            CNM       R
     A            CMCY      R
     A**                                                /S01117/
     A************BRCD      R
     A            BRCA      R
     A*********** ZZ012     R
     A            CMPYM     R
     A            ZZ009     R
     A**                                                /S01117/
     A**Start of change CLE040
     A            TOFFST        15P 0       TEXT('Total Offset')
     A                                      COLHDG('Total Offset')
     A            TLENDV        15P 0       TEXT('Total Lending Value')
     A                                      COLHDG('Total Lending Value')
     A            TCALTV        15P 0       TEXT('Total Commitment Adjusted +
     A                                            for LTV')
     A                                      COLHDG('Total Commitment' +
     A                                             'Adjusted for LTV')
     A**End of change CLE040
