      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE Comm/Fac/Loan Details & Profit C. Header')
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/FACEXHHA - Commit, Facility, Loan Details & Profit Centre *
      *                Header file                                    *
      *                                                               *
      *  (c) Finastra International Limited 2006                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CLE059  *CREATE    Date 03Jul06               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CLE059 - Commitment and Facility Availability by Cust report *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R FACEXHH0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2006')
      *
     A            RECI      R
     A            ZZ079     R
