      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE PC msg format loan amendments return LAPT')   *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/LEA4MFPD - PC Subsystem Interface                         *
      *                Lending Download                               *
      *                Loan Amendments Return (LAPF)                  *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *  Last Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      *  Prev Amend No. CPK014             Date 20Jun01               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CLE004             Date 08MAY97               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CLE148 - Alpha Loan Reference                                *
      *  CPK014 - Change field references to remove multi-layered     *
      *            dependencies; this is for compilation reasons.     *
      *  CLE004 - Customer Lending Enhancements - Syndications        *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R LEA4MFD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            A4MSGT    R               REFFLD(X1MSGT LEX1MFPD)
     A            A4TRUS    R               REFFLD(X1TRUS LEX1MFPD)
     A            A4TRWS    R               REFFLD(X1TRWS LEX1MFPD)
     A            A4TNRF    R               REFFLD(X1TNRF LEX1MFPD)
     A            A4TRSN    R               REFFLD(X1TRSN LEX1MFPD)
     A            A4ACTN    R               REFFLD(X1ACTN LEX1MFPD)
     A            A4TRDS    R               REFFLD(X1TRDS LEX1MFPD)
     A            A4TRTS    R               REFFLD(X1TRTS LEX1MFPD)
      * Start CPK014
     A**********  A4NRBA    R               REFFLD(F1NRBA LEF1MFPD)
     A            A4NRBA    R               REFFLD(NREC)
     A                                      TEXT('Number of records in batch')
     A                                      COLHDG('No.' 'Records' +
     A                                             'in batch')
      * End CPK014
     A            A4FIL4    R               REFFLD(ZZ004)
      *
      * Start CPK014
     A**********  A4MSGS    R               REFFLD(F2MSGS LEF2MFPD)
     A**********  A4MSGI    R               REFFLD(F2MSGI LEF2MFPD)
     A**********  A4MSTX    R               REFFLD(F2MSTX LEF2MFPD)
     A            A4MSGS    R               REFFLD(MSG)
     A                                      TEXT('Message Severity')
     A                                      COLHDG('Msg' 'Severity')
     A            A4MSGI    R               REFFLD(MSID)
     A                                      TEXT('Message ID')
     A                                      COLHDG('Msg' 'ID')
     A            A4MSTX    R               REFFLD(ZZ078)
     A                                      TEXT('Message Text')
     A                                      COLHDG('Msg' 'Text')
      * End CPK014
      **Start of change CLE148
     A**********  A4LNRF    R               REFFLD(LNRF)                                      CLE148
     A            A4LNRF         6A         TEXT('Loan Number')
     A                                      COLHDG('Loan' 'Number')
      **End of change CLE148
     A            A4VDAT    R               REFFLD(ZZ008)
     A                                      TEXT('Value Date')
     A                                      COLHDG('Value' +
     A                                             'Date')
     A            A4LASN    R               REFFLD(LASN LOAMSDK)
      **Start of change CLE148
     A**********  A4ROLN    R               REFFLD(ROLN LOAMSDK)                              CLE148
     A            A4ROLN         6A         TEXT('Receiving/Originating +
     A                                           Loan')
     A                                      COLHDG('Receiving/Orig' +
     A                                             'Loan')
      **End of change CLE148
     A            A4ROSN    R               REFFLD(ROSN LOAMSDK)
      *
