      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE COF accurals extract header')
      **************************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/LEACFHH - COF Accruals Header                             *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Last Amend No. 138289  *CREATE    Date 20Jun98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  138289 - COF Accruals reports do not reconcile usefully.     *
      *                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R LEACFHHF                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            RECI      R
     A            ZZ004     R
     A            TDAT      R
     A            ZZ120     R
