      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE COF accruals extract detail')                 *
      **************************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/LEACFAC - COF Accruals Detail                             *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *  Last Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CLE042             Date 06Sep05               *
      *                 138289  *CREATE    Date 20Jun98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CLE148 - Alpha Loan Reference                                *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CLE042 - Extended Loan Sub Type                              *
      *  138289 - COF Accruals reports do not reconcile usefully.     *
      *                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R LEACFACF                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            RECI      R
     A            BRCA      R
     A            CCY       R
     A            LTYP      R
     A            SUTP      R
     A            PTYP      R
      * Begin /CSD027/
     A**********  CNUM      R                                                                 CSD027
     A            CNUM           6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
      **Start of change CLE148
     A**********  LNRF      R                                                                 CLE148
     A            LNRF           6A         TEXT('Loan Number')
     A                                      COLHDG('Loan' 'Number')
      **End of change CLE148
     A            ACFR      R
     A            ACTD      R
     A            INTR      R
     A            CPAM      R
     A            AMAD      R
     A            AMTA      R               REFFLD(AMAD)
     A                                      TEXT('COF Int. to Accrue')
     A                                      COLHDG('Total' +
     A                                             'COF Int.' +
     A                                             'to Accrue')
     A            PRFC      R
     A            FPRC      R               REFFLD(PRFC)
     A                                      TEXT('Funding Profit Centre')
     A                                      COLHDG('Funding' +
     A                                             'Profit' +
     A                                             'Centre')
     A            FSRP      R               REFFLD(RTSP)
     A                                      TEXT('Funding Spread/Rate')
     A                                      COLHDG('Funding' +
     A                                             'Spread' +
     A                                             'Rate')
      **Start of change CLE148
     A*********   PSLN      R                                                                 CLE148
     A            PSLN           6A         TEXT('Participation sold loan no.')
     A                                      COLHDG('Part.' +
     A                                       'Loan' +
     A                                       'Number')
      **End of change CLE148
     A            CMPYM     R
     A            ZZ047     R
     A*                                              Begin /CLE042/
     A            CLAS           4A         TEXT('Loan Class')
     A                                      COLHDG('Loan' 'Class')
     A*                                              End   /CLE042/
