      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE Customer Loans OK flags - Italian')           *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/LEECLIT1PD - Customer Loans OK flags - Italian            *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2006            *
      *                                                               *
      *  Last Amend No. LUC139             Date 22Dec20               *
      *  Prev Amend No. CER009  *CREATE    Date 16Aug06               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LUC139 - UIC Italian returns upgrade to FM2.1                *
      *  CER009 - Puma II Upgrade to MidasPlus                        *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R LEECLIT1D0                TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2006')
      *
     A            DDTMOOPOK R               TEXT('Motivation of Operation')
     A                                      COLHDG('Motivation' ' of Operation')
     A                                      REFFLD(OKFLAG)
     A            DDTAGCTOK R               TEXT('Agricultural Credit Class')
     A                                      COLHDG('Agricultural' 'Credit' +
     A                                             'Class')
     A                                      REFFLD(OKFLAG)
     A            DDTAGCLOK R               TEXT('Agricultural Laws Class')
     A                                      COLHDG('Agricultural' 'Laws Class')
     A                                      REFFLD(OKFLAG)
     A            DDTECBDOK R               TEXT('Economical Branch of Dest')
     A                                      COLHDG('Economical' +
     A                                             'Branch of Dest')
     A                                      REFFLD(OKFLAG)
     A            DDTSBCROK R               TEXT('Subsidized Credit Indicator')
     A                                      COLHDG('Subsidized' 'Credit' +
     A                                             'Indicator')
     A                                      REFFLD(OKFLAG)
     A            DDTINSBOK R               TEXT('Subsidized Int. for Export')
     A                                      COLHDG('Subsidized Int.' +
     A                                             'Export')
     A                                      REFFLD(OKFLAG)
     A            DDTTPPROK R               TEXT('Type of Product')
     A                                      COLHDG('Type of Product')
     A                                      REFFLD(OKFLAG)
     A            DDTPEPROK R               TEXT('Personalisation of Operation')
     A                                      COLHDG('Personalisation' +
     A                                             'of Operation')
     A                                      REFFLD(OKFLAG)
     A            DDTGLPAOK R               TEXT('Global/Partial Operation')
     A                                      COLHDG('Global/Partial' +
     A                                             'Operation')
     A                                      REFFLD(OKFLAG)
     A            DDTTPFDOK R               TEXT('Operation with Third Party')
     A                                      COLHDG('Global/Partial' +
     A                                             'Operation')
     A                                      REFFLD(OKFLAG)
     A            DDTSBLWOK R               TEXT('Law for Subsidized Credit Cd')
     A                                      COLHDG('Law for Subsidized' +
     A                                             'Credit Code')
     A                                      REFFLD(OKFLAG)
     A            DDTDPIVOK R               TEXT('Destination Province +
     A                                           Investment')
     A                                      COLHDG('Destination Province' +
     A                                             'Investment')
     A                                      REFFLD(OKFLAG)
     A            DDTEDIVOK R               TEXT('Economical Dest of +
     A                                           Investment')
     A                                      COLHDG('Economical Dest.' +
     A                                             'of Investment')
     A                                      REFFLD(OKFLAG)
     A            DDTCATCOK R               TEXT('Category Code CR')
     A                                      COLHDG('Category Code CR')
     A                                      REFFLD(OKFLAG)
     A            DDTTPACOK R               TEXT('Type of Activity')
     A                                      COLHDG('Type of Activity')
     A                                      REFFLD(OKFLAG)
     A            DDTCLRLOK R               TEXT('Client Role CR')
     A                                      COLHDG('Client Role CR')
     A                                      REFFLD(OKFLAG)
     A            DDTACSTOK R               TEXT('Account Status CR')
     A                                      COLHDG('Account Status CR')
     A                                      REFFLD(OKFLAG)
     A            DDTLNITOK R               TEXT('Line Item of Usura Report')
     A                                      COLHDG('Line Item of' +
     A                                             'Usura Report')
     A                                      REFFLD(OKFLAG)
     A            DDTTEGLOK R               TEXT('Effective Global Rate')
     A                                      COLHDG('Effective' ' Global Rate')
     A                                      REFFLD(OKFLAG)
     A            DDTUNDTOK R               TEXT('Scaduto da')
     A                                      COLHDG('Scaduto da')
     A                                      REFFLD(OKFLAG)
     A            DDTPSAMOK R               TEXT('Quota aggiuntiva altrui')
     A                                      COLHDG('Quota aggiuntiva' +
     A                                             'altrui')
     A                                      REFFLD(OKFLAG)
     A            DDTLEADOK R               TEXT('Capofila (Valutaria)')
     A                                      COLHDG('Capofila' '(Valutaria)')
     A                                      REFFLD(OKFLAG)
      ** Start of LUC139
     A            DDTPTRPOK R               TEXT('Priority Risk Code Prd')
     A                                      COLHDG('Pty Rsk Cd')
     A                                      REFFLD(OKFLAG)
     A            DDTCMPCOK R               TEXT('Comm Rate Max U Balance')
     A                                      COLHDG('Comm Rt' 'Max UBal')
     A                                      REFFLD(OKFLAG)
      ** End of LUC139
