      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE Error inds for cust. Loans (6) details')      *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/LEECLI6PD - API Error Definition File for Cust. Loans     *
      *                 Transaction Details - Display file 6          *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2012            *
      *                                                               *
      *  Last Amend No. CLE134  *CREATE    Date 01Aug12
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CLE134 - Past Due Call Loan Processing                       *
      *                                                               *
      *****************************************************************
     A          R LEECLI6D0                 TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2012')
      *
     A            DDFAMUOK       1A         COLHDG('Facility' 'Amount' +
     A                                             'Utilisation')
      *
     A            DDRIDTOK       1A         COLHDG('Reporting Past Due' +
     A                                             'Initial Date')
      *
     A            DDRCATOK       1A         COLHDG('Reporting Past Due' +
     A                                             'Classification')
      *
     A            DDBIDTOK       1A         COLHDG('Basel II Past Due' +
     A                                             'Initial Date')
      *
     A            DDBCATOK       1A         COLHDG('Basel II Past Due'  +
     A                                             'Classification')
      *
     A            DDORLNOK       1A         COLHDG('Origin' +
     A                                             'Loan Number')
      *
     A            DDOFCUOK       1A         COLHDG('Origin' +
     A                                             'Facility')
      *
     A            DDOFACOK       1A         COLHDG('Origin' +
     A                                             'Facility Sequence')
      *
     A            DDOFESOK       1A         COLHDG('Origin' +
     A                                             'Fee Code')
      *
     A            DDOFSQOK       1A         COLHDG('Origin' +
     A                                             'Fee Sequence')
      *
     A            DDOFLNOK       1A         COLHDG('Origin' +
     A                                             'Fee Loan')
      *
