/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE Fee settlement errors')                       *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module.                             *
      *                                                               *
      *  PF/LEEFESTPD - Fee Settlement Errors                         *
      *                                                               *
      *  (c) Finastra International Limited 2002                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CLE073             Date 12May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 223947             Date 19Apr04               *
      * Midas Release 4.01 -------------------------------------------*
      *                 CAP072  *CREATE    Date 27Feb02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CLE073 - Calculated Loan Based Fees                          *
      *  223947 - 3rd reopen of Bug678. Corrections & omissions.      *
      *  CAP072 - Conversion of LE inputs into modular structure to   *
      *           use as APIs.                                        *
      *                                                               *
      *****************************************************************
     A          R LEEFESTPDF
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2002')
     A            S#ACTNOK       1A         TEXT('Action')
     A                                      COLHDG('Action' +                                 223947
     A                                             'Code')                                    223947
     A            S#CSSNOK       1A         TEXT('Customer Number')
     A                                      COLHDG('Cust' +                                   223947
     A                                             'Num')                                     223947
     A            S#FACTOK       1A         TEXT('Facility Type')
     A                                      COLHDG('Fclty' +                                  223947
     A                                             'Type')                                    223947
     A            S#FCNOOK       1A         TEXT('Facility Number')
     A                                      COLHDG('Fclty'  +                                 223947
     A                                             'Number')                                  223947
     A            S#FSEQOK       1A         TEXT('Fee Sequence Number')
     A                                      COLHDG('Fee' +                                    223947
     A                                             'Seq' +                                    223947
     A                                             'Num')                                     223947
     A            S#VDATOK       1A         TEXT('Value Date')
     A                                      COLHDG('Value' +                                  223947
     A                                             'Date')                                    223947
     A            S#SADJOK       1A         TEXT('Fee Settlement Amount')
     A                                      COLHDG('Sett.' +                                  223947
     A                                             'Amount')                                  223947
     A            S#TYPEOK       1A         TEXT('Writ-Off/Full/Part Pay Ind.')
     A                                      COLHDG('W/F/P' +                                  223947
     A                                             'Indic.')                                  223947
      **Start of Change CLE073
     A            S#LOANOK       1A         TEXT('Loan Reference')
     A                                      COLHDG('Loan' 'Ref.')
      **End of Change CLE073
