      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE Error inds for manual repayment input')
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/LEEMAPYPD - API Error Definition File for Manual Repayment*
      *                 Input - Display file                          *
      *                                                               *
      *  (c) Finastra International Limited 2002                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CLE106             Date 01Aug04               *
      *                 BUG3114            Date 29Jun04               *
      *                 CAP077  *CREATE    Date 15Jul02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CLE106 - Syndications Manager                                *
      *  BUG3114- Missing Rule of 78s (CLE028) change in the Lending  *
      *           APIs as description in the amendment history.       *
      *  CAP076 - Lending API enhancements - Rollover details         *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R LEEMAPYD0                 TEXT('(c) Finastra International +
     A                                      Limited 2002')
      *
     A            DDACTNOK  R               TEXT('Action Code')
     A                                      REFFLD(OKFLAG)
     A            DDLNRFOK  R               TEXT('Loan number')
     A                                      REFFLD(OKFLAG)
     A            DDRSTSOK  R               TEXT('Record status, ALWAYS Y')
     A                                      REFFLD(OKFLAG)
     A            DDVALDOK  R               TEXT('Value Date')
     A                                      REFFLD(OKFLAG)
     A            DDSEQNOK  R               TEXT('Sequence at Value Date')
     A                                      REFFLD(OKFLAG)
     A            DDEVALOK  R               TEXT('Expected Date')
     A                                      REFFLD(OKFLAG)
     A            DDESEQOK  R               TEXT('Sequence at Expected Date')
     A                                      REFFLD(OKFLAG)
     A            DDCUSTOK  R               TEXT('Customer number')
     A                                      REFFLD(OKFLAG)
     A            DDCURPOK  R               TEXT('Current Principal, ALWAYS Y')
     A                                      REFFLD(OKFLAG)
      ** Start of change CLE106
     A**********  DDSCCYOK  R               TEXT('Loan Currency, ALWAYS Y')                   CLE106
     A            DDSCCYOK  R               TEXT('Loan Currency')
      ** End of change CLE106
     A                                      REFFLD(OKFLAG)
     A            DDINTDOK  R               TEXT('Interest to Date, ALWAYS Y')
     A                                      REFFLD(OKFLAG)
     A            DDWTTPOK  R               TEXT('W/hol Tax Type, ALWAYS Y')
     A                                      REFFLD(OKFLAG)
     A            DDPASDOK  R               TEXT('Past Due Y/N')
     A                                      REFFLD(OKFLAG)
     A            DDRPRIOK  R               TEXT('Repayment : Principal')
     A                                      REFFLD(OKFLAG)
     A            DDPSIGOK  R               TEXT('Sign of Repayment Principal')
     A                                      REFFLD(OKFLAG)
     A            DDEPRIOK  R               TEXT('Expected Principal, ALWAYS Y')
     A                                      REFFLD(OKFLAG)
     A            DDRINTOK  R               TEXT('Repayment : Interest')
     A                                      REFFLD(OKFLAG)
     A            DDISIGOK  R               TEXT('Sign of Interest')
     A                                      REFFLD(OKFLAG)
     A            DDEINTOK  R               TEXT('Expected Interest, ALWAYS Y')
     A                                      REFFLD(OKFLAG)
     A            DDRTOTOK  R               TEXT('Repayment : Total')
     A                                      REFFLD(OKFLAG)
     A            DDRSIGOK  R               TEXT('Sign of Total')
     A                                      REFFLD(OKFLAG)
     A            DDETOTOK  R               TEXT('Expected Total, ALWAYS Y')
     A                                      REFFLD(OKFLAG)
     A            DDWHTXOK  R               TEXT('Expected W/hold tax,ALWAYS Y')
     A                                      REFFLD(OKFLAG)
     A            DDRPENOK  R               TEXT('Repayment : Penalty' )
     A                                      REFFLD(OKFLAG)
     A            DDRPIGOK  R               TEXT('Sign of Penalty')
     A                                      REFFLD(OKFLAG)
     A            DDEPENOK  R               TEXT('Expected Penalties,ALWAYS Y')
     A                                      REFFLD(OKFLAG)
     A            DDWOFFOK  R               TEXT('Write off')
     A                                      REFFLD(OKFLAG)
      ** Start of change BUG3114
     A            DDINRFOK  R               TEXT('Interest Refunded,ALWAYS Y')
     A                                      REFFLD(OKFLAG)
     A            DDCGRFOK  R               TEXT('Charges Refunded,ALWAYS Y')
     A                                      REFFLD(OKFLAG)
      ** End of change BUG3114
