      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Facilities selected for conversion')
      *****************************************************************
      *                                                               *
      *  Midas - EMU LE Facility Currency Conversion Utility          *
      *                                                               *
      *  PF/LEFCUPPD - Facilities Selected For Conversion             *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CEU021   *CREATE   Date 31Mar98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CEU021 - EMU LE Facility Currency Conversion Utility         *
      *                                                               *
      *===================================================================
     A                                      REF(MFRFL)
      *---------------------------------------------------------------------
     A          R LEFCUPD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *---------------------------------------------------------------------
     A            FSREFR        10A         COLHDG('Reference')
      * Begin /CSD027/
     A**********  FSCNUM    R               COLHDG('Customer' 'Number')                       CSD027
     A            FSCNUM         6A         COLHDG('Customer' 'Number')
                                            TEXT('Customer Number')
     A**********                            REFFLD(CNUM)                                      CSD027
      * End /CSD027/
     A            FSFACT         3  0       COLHDG('Facility' 'Type')
     A            FSFCNO         2  0       COLHDG('Facility' 'Sequence')
     A            FSBRCA    R               COLHDG('Branch' 'Code')
     A                                      REFFLD(BRCA)
     A            FSOCCY    R               COLHDG('Original' 'Currency')
     A                                      REFFLD(CCYC)
     A            FSOAMT    R               COLHDG('Original' 'Amount')
     A                                      REFFLD(AMNT)
     A            FSGEAK         1A         COLHDG('Generate' 'Account' 'Keys')
     A            FSGADT    R               COLHDG('Start Date' +
     A                                             'of Acccount' +
     A                                             'Key Generation')
     A                                      REFFLD(DATE)
     A            FSSTAT         9A         COLHDG('Status')
     A            FSADVP         1A         COLHDG('Advice' 'Printed')
      *---------------------------------------------------------------*
