      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE Fee adjustment details')
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module.                             *
      *                                                               *
      *  PF/LEFEA2PD - Fee Adjustment Details 2                       *
      *                                                               *
      *  (c) Finastra International Limited 2005                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CLE106 *Create     Date 01Aug04               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CLE106 - Syndications Manager                                *
      *                                                               *
      *****************************************************************
     A          R LEFEA2PDF
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2005')
     A            S#STAT        10A         TEXT('Status')
     A            S#FTYP        10A         TEXT('Fee Type')
     A            S#FCOD         2A         TEXT('Fee Code')
     A            S#FENV        20A         TEXT('Description')
     A            S#ACCD        18A         TEXT('Fee Amount/Past Due')
     A            S#FUTN        15A         TEXT('Fee UTN')
     A            S#EUTN        15A         TEXT('Fee Event UTN')
     A            S#RECI         1A         TEXT('Record Id')
