      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE Lending Fee Adjustment Amount dtl')           *
/*S*D ***PFBASE********************************************************
/*E*S ***PF_STD********************************************************
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/LEFEAM - Facility fees with orig fee adjustment amount    *
      *                                                               *
      *  (C) Copyright Finastra International Limited 2006            *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *                 243496B            Date 12Apr07               *
      *                 245803  *REDUNDANT Date 20Feb07               *
      *                 243495  *CREATE    Date 24Nov06               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CLE148 - Alpha Loan Reference                                *
      *  243496B- Use the Fee Adjustment Amount FEAMTA from PF/LEFEAM *
      *           Applied 216123 (plus re-open & 221326 correction).  *
      *         - Facility fees with its original fee adjustment      *
      *           amount during the value date of the fee adjustment. *
      *           (Amended CNUM related field for MP1.4)              *
      *  245803 - Delete the file.  Reverse 243496.  REDUNDANT.       *
      *  243496 - Use the Fee Adjustment Amount FEAMTA from PF/LEFEAM *
      *           Applied 216123 (plus re-open & 221326 correction).  *
      *         - Facility fees with its original fee adjustment      *
      *           amount during the value date of the fee adjustment. *
      *                                                               *
      *****************************************************************
      *
     A                                      REF(MFRFL)
      *
     A          R LEFEAMF                   TEXT('(c) Finastra +
     A                                      Banking +
     A                                      Limited 2006')
      *
     A            FERECI    R               REFFLD(RECI)
     A            FEBRCA    R               REFFLD(BRCA)
     A**********  FECNUM    R               REFFLD(CNUM)                                     243496B
     A            FECNUM         6                                                           243496B
     A            FEFACL    R               REFFLD(FCLY)
      **Start of change CLE148
     A**********  FELOAN    R               REFFLD(LNRF)                                      CLE148
     A            FELOAN         6A         TEXT('Loan Number')
     A                                      COLHDG('Loan' 'Number')
      **End of change CLE148
     A            FEFSEQ    R
     A            FEOAMT        13P 0
      *
     A          K FEBRCA
     A          K FECNUM
     A          K FEFACL
     A          K FELOAN
     A          K FEFSEQ
