      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE PC msg trans. income splits return')          *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/LEI2MFPD - Midas LE PC Msg Trans. Income Splits Return    *
      *                                                               *
      *  (c) Finastra International Limited 2003                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027A            Date 04May06               *
      *                 CLE035  *CREATE    Date 22Sep03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027A - Conversion Of Customer Number to Alpha             *
      *  CLE035 - Lending Enhancements for Nordea Phase 1 Priority 2: *
      *           Income Splits                                       *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R LEI2MFD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2003')
      *
     A            I2MSGT    R               REFFLD(X1MSGT LEX1MFPD)
     A            I2TRUS    R               REFFLD(X1TRUS LEX1MFPD)
     A            I2TRWS    R               REFFLD(X1TRWS LEX1MFPD)
     A            I2TNRF    R               REFFLD(X1TNRF LEX1MFPD)
     A            I2TRSN    R               REFFLD(X1TRSN LEX1MFPD)
     A            I2ACTN    R               REFFLD(X1ACTN LEX1MFPD)
     A            I2TRDS    R               REFFLD(X1TRDS LEX1MFPD)
     A            I2TRTS    R               REFFLD(X1TRTS LEX1MFPD)
     A            I2NRBA    R               REFFLD(NREC)
     A                                      TEXT('Number of records in batch')
     A                                      COLHDG('Number of ' +
     A                                        'records in batch')
     A            I2FIL4    R               REFFLD(ZZ004)
     A            I2MSGS    R               REFFLD(MSG)
     A                                      TEXT('Message Severity')
     A                                      COLHDG('Message Severity')
     A            I2MSGI    R               REFFLD(MSID)
     A                                      TEXT('Message ID')
     A                                      COLHDG('Message ID')
     A            I2MSTX    R               REFFLD(ZZ078)
     A                                      TEXT('Message Text')
     A                                      COLHDG('Message Text')
      **Start of change CLE148
     A**********  I2LNRF         6S         TEXT('Loan Reference')                            CLE148
     A            I2LNRF         6A         TEXT('Loan Reference')
      **End of change CLE148
     A                                      COLHDG('Loan Reference')
     A**Start of change CSD027A
     A**********  I2CNUM         6S         TEXT('Customer Number')                          CSD027A
     A            I2CNUM         6A         TEXT('Customer Number')
     A**End of change CSD027A
     A                                      COLHDG('Customer Number')
     A            I2FACL         5S         TEXT('Facility')
     A                                      COLHDG('Facility')
     A            I2FESQ         2S         TEXT('Fee Sequence')
     A                                      COLHDG('Fee Sequence')
     A**Start of change CSD027A
     A**********  I2ISCN         6S         TEXT('Split Customer')                           CSD027A
     A            I2ISCN         6A         TEXT('Split Customer')
     A**End of change CSD027A
     A                                      COLHDG('Split Customer')
