      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE PC msg fmt trans. income splits')
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/LEL9MFPD - Midas LE PC Msg Fmt Transaction Income Splits  *
      *                                                               *
      *  (c) Finastra International Limited 2003                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CLE035  *CREATE    Date 22Sep03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CLE035 - Lending Enhancements for Nordea Phase 1 Priority 2: *
      *           Income Splits                                       *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R LEL9MFD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2003')
      *
     A            L9MSGT    R               REFFLD(X1MSGT LEX1MFPD)
     A            L9TRUS    R               REFFLD(X1TRUS LEX1MFPD)
     A            L9TRWS    R               REFFLD(X1TRWS LEX1MFPD)
     A            L9TNRF    R               REFFLD(X1TNRF LEX1MFPD)
     A            L9TRSN    R               REFFLD(X1TRSN LEX1MFPD)
     A            L9ACTN    R               REFFLD(X1ACTN LEX1MFPD)
     A            L9TRDS    R               REFFLD(X1TRDS LEX1MFPD)
     A            L9TRTS    R               REFFLD(X1TRTS LEX1MFPD)
     A            L9BTNM    R               REFFLD(X1BTNM LEX1MFPD)
     A            L9BTML    R               REFFLD(X1BTML LEX1MFPD)
     A            L9CONT    R               REFFLD(X1CONT LEX1MFPD)
     A            L9FIL1    R               REFFLD(X1FIL1 LEX1MFPD)
     A            L9RECI         1A         TEXT('Record ID')
     A                                      COLHDG('Record ID')
     A            L9LNRF         6A         TEXT('Loan Reference')
     A                                      COLHDG('Loan Reference')
     A            L9CNUM         6A         TEXT('Customer Number')
     A                                      COLHDG('Customer Number')
     A            L9FACL         5A         TEXT('Facility')
     A                                      COLHDG('Facility')
     A            L9FESQ         2A         TEXT('Fee Sequence')
     A                                      COLHDG('Fee Sequence')
     A            L9ISCN         6A         TEXT('Income Split Customer')
     A                                      COLHDG('Income' 'Split'+
     A                                        'Customer')
     A            L9IPAL        13A         TEXT('Income Percentage +
     A                                        Allocation')
     A                                      COLHDG('Income '+
     A                                        'Percentage' 'Allocation')
     A            L9PCRF        15A         TEXT('PC Reference')
     A                                      COLHDG('PC Reference')
     A            L9PPCR        15A         TEXT('Parent PC Reference')
     A                                      COLHDG('Parent PC Reference')
