      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE Profitability facility extract')
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/LEPRFCPD - Profitability Facility Extract                 *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *  Prev Amend No. 163668  *CREATE    Date 14Jul99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  163668 - Profitability showing on facility customer not on   *
      *           agent customer                                      *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R LEPRFCD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            BRCA      R
      * Begin /CSD027/
     A**********  FDFCUS    R               REFFLD(FCUS)                                      CSD027
     A            FDFCUS         6A
     A                                      TEXT('Facility customer')
     A                                      COLHDG('Facility            ' +
     A                                      'Customer')
      * End /CSD027/
     A            FDFACN    R               REFFLD(FCLY)
     A            FDDEPT    R               REFFLD(DEPC)
     A            FDACOF    R               REFFLD(ACOF)
     A            FDSTDY    R
     A            FDENDY    R
     A            FDFSDY    R
     A            FDFEDY    R
     A            FDECFG    R
     A            FDJANA    R
     A            FDFEBA    R
     A            FDMARA    R
     A            FDAPRA    R
     A            FDMAYA    R
     A            FDJUNA    R
     A            FDJULA    R
     A            FDAUGA    R
     A            FDSEPA    R
     A            FDOCTA    R
     A            FDNOVA    R
     A            FDDECA    R
      * Begin /CSD027/
     A**********  FFDCNM    R               REFFLD(CNUM)                                      CSD027
     A            FFDCNM         6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            FFDFAC    R               REFFLD(FCLY)
     A            FFDJAN    R               REFFLD(FDJANA)
     A            FFDFEB    R               REFFLD(FDFEBA)
     A            FFDMAR    R               REFFLD(FDMARA)
     A            FFDAPR    R               REFFLD(FDAPRA)
     A            FFDMAY    R               REFFLD(FDMAYA)
     A            FFDJUN    R               REFFLD(FDJUNA)
     A            FFDJUL    R               REFFLD(FDJULA)
     A            FFDAUG    R               REFFLD(FDAUGA)
     A            FFDSEP    R               REFFLD(FDSEPA)
     A            FFDOCT    R               REFFLD(FDOCTA)
     A            FFDNOV    R               REFFLD(FDNOVA)
     A            FFDDEC    R               REFFLD(FDDECA)
      * Begin /CSD027/
     A**********  FDFACL    R               REFFLD(FCUS)                                      CSD027
     A            FDFACL         6A
     A                                      TEXT('Facility customer')
     A                                      COLHDG('Facility            ' +
     A                                      'Customer')
      * End /CSD027/
