      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE Fee Stamp Tax Ext Format Definition file')    *
      *****************************************************************
      *                                                               *
      *  Midas - Lending Module                                       *
      *                                                               *
      *  PF/LESTMPPD - Lending Fee Stamp Tax Extension                *
      *                Definition File                                *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2010            *
      *                                                               *
      *  Last Amend No. CER049  *CREATE    Date 06Dec10               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CER049 - Stamp Tax                                           *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R LESTMPD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2010')
      *
     A            DDORED         6A         TEXT('Original Entry Date')
     A                                      COLHDG('Original Entry Date')
      *
     A            DDTAX          1A         TEXT('Stamp Tax Liable')
     A                                      COLHDG('Stamp Tax Liable')
      *
     A            DDHFLF         1A         TEXT('Flat Fee Flag')
     A                                      COLHDG('Flat Fee Flag')
      *
     A            DDHDTE         6A         TEXT('Start Date for +
     A                                            Flat Fee Tax')
     A                                      COLHDG('Start Date for' +
     A                                             'Flat Fee Tax')
      *
     A            DDDBRC         3A         TEXT('Debit A/c Branch')
     A                                      COLHDG('Debit A/c Branch')
      *
     A            DDDCST         6A         TEXT('Debit A/c Customer')
     A                                      COLHDG('Debit A/c Customer')
      *
     A            DDDCCY         3A         TEXT('Debit A/c Currency')
     A                                      COLHDG('Debit A/c Currency')
      *
     A            DDDACD        10A         TEXT('Debit A/c Code')
     A                                      COLHDG('Debit A/c Code')
      *
     A            DDDASC         2A         TEXT('Debit A/c Sequence')
     A                                      COLHDG('Debit A/c Sequence')
      *
     A            DDSTAF        13A         TEXT('Stamp Tax Amount')
     A                                      COLHDG('Stamp Tax Amount')
      *
     A            DDCDTE         6A         TEXT('Control Date')
     A                                      COLHDG('Control Date')
      *
