      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE Customer Loans Stamp Tax Ext Fmt Defn Fil')   *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/LESTMP2PD - Customer loans Stamp Tax Extension            *
      *                  definition file                              *
      *                                                               *
      *  (c) Finastra International Limited 2010                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CER049  *CREATE    Date 06Dec10               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CER049 - Stamp Tax                                           *
      *                                                               *
      *****************************************************************
     A          R LESTMP2D0                 TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2010')
 
     A            DDTAX          1A         TEXT('Stamp Tax Liable')
     A                                      COLHDG('Stamp Tax' +
     A                                             'Liable')
     A            DDPRIN         1A         TEXT('Prin Tax Flag')
     A                                      COLHDG('Prin Tax' +
     A                                             'Flag')
     A            DDPDTE         6A         TEXT('Prin Tax Start Date')
     A                                      COLHDG('Prin Tax' +
     A                                             'Start Date')
     A            DDAVBL         1A         TEXT('Av. Bal. Flag')
     A                                      COLHDG('Av. Bal.' +
     A                                             'Flag')
     A            DDADTE         6A         TEXT('Av. Bal. Start Date')
     A                                      COLHDG('Av. Bal.' +
     A                                             'Start Date')
     A            DDSINT         1A         TEXT('Int Tax Flag')
     A                                      COLHDG('Int Tax' +
     A                                             'Flag')
     A            DDIDTE         6A         TEXT('Int Tax Start Date')
     A                                      COLHDG('Int Tax' +
     A                                             'Start Date')
     A            DDDBRC         3A         TEXT('Debit A/c Branch')
     A                                      COLHDG('Debit A/c' +
     A                                             'Branch')
     A            DDDCST         6A         TEXT('Debit A/c Cust.')
     A                                      COLHDG('Debit A/c' +
     A                                             'Cust.')
     A            DDDCCY         3A         TEXT('Debit A/c Ccy.')
     A                                      COLHDG('Debit A/c' +
     A                                             'Ccy.')
     A            DDDACD        10A         TEXT('Debit A/c Code')
     A                                      COLHDG('Debit A/c' +
     A                                             'Code')
     A            DDDASC         2A         TEXT('Debit A/c Seq.')
     A                                      COLHDG('Debit A/c' +
     A                                             'Seq.')
     A            DDSTAB        13A         TEXT('Tax On Av. Bal.')
     A                                      COLHDG('Tax On' +
     A                                             'Av. Bal.')
     A            DDSTAI        13A         TEXT('Tax On Interest')
     A                                      COLHDG('Tax On' +
     A                                             'Interest')
     A            DDTAXE        13A         TEXT('Tax On AB - Month')
     A                                      COLHDG('Tax On' +
     A                                             'AB - Month')
     A            DDLTYP         2A         TEXT('Loan Type')
     A                                      COLHDG('Loan' +
     A                                             'Type')
     A            DDLSTP         2A         TEXT('Loan Sub-Type')
     A                                      COLHDG('Loan' +
     A                                             'Sub-Type')
     A            DDCDTE         6A         TEXT('Control Date')
     A                                      COLHDG('Control' +
     A                                             'Date')
