      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE Tranche-Aggregate Fclty Rel - Prev')          *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/LETRGPPD - Tranche - Aggregate Facilities Relationship    *
      *                                                               *
      *  (c) Finastra International Limited 2011                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CLE147  *CREATE    Date 28Sep11               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CLE147 - Aggregate Facility                                  *
      *                                                               *
      *****************************************************************
     A          R LETRAGD0                  FORMAT(LETRAGPD)
     A          K AGTRBR
     A          K AGTRNM
     A          K AGTRFT
     A          K AGTRFN
