      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE Tranche-Aggregate Facilities Relationship')
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/LETRAGPD - Tranche - Aggregate Facilities Relationship    *
      *                                                               *
      *  (c) Finastra International Limited 2004                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      *                 CLE041  *CREATE    Date 11Oct04               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CLE041 - Collateralised Lending Phase 2B                     *
      *                                                               *
      *****************************************************************
      *
     A          R LETRAGD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2004')
      *
     A            AGTRBR         3A         TEXT('Tranche - Branch Code')
     A                                      COLHDG('Tranche - Branch ' +
     A                                             'Code')
      * Begin /CSD027/
     A**********  AGTRNM         6S 0       TEXT('Tranche - Customer +                        CSD027
     A            AGTRNM         6A         TEXT('Tranche - Customer +
      * End /CSD027/
     A                                             Number')
     A                                      COLHDG('Tranche - Customer ' +
     A                                             'Number')
     A            AGTRFT         3S 0       TEXT('Tranche - Facility +
     A                                             Type')
     A                                      COLHDG('Tranche - Facility ' +
     A                                             'Type')
     A            AGTRFN         2S 0       TEXT('Tranche - Facility +
     A                                             Number')
     A                                      COLHDG('Tranche - Facility ' +
     A                                             'Number')
      *
     A            AGAGBR         3A         TEXT('Aggregate Facility +
     A                                             - Branch Code')
     A                                      COLHDG('Aggregate Facility ' +
     A                                             '- Branch Code')
      * Begin /CSD027/
     A**********  AGAGNM         6S 0       TEXT('Aggregate Facility +                        CSD027
     A            AGAGNM         6A         TEXT('Aggregate Facility +
      * End /CSD027/
     A                                             - Customer Number')
     A                                      COLHDG('Aggregate Facility ' +
     A                                             '- Customer Number')
     A            AGAGFT         3S 0       TEXT('Aggregate Facility +
     A                                             - Facility Type')
     A                                      COLHDG('Aggregate Facility ' +
     A                                             '- Facility Type')
     A            AGAGFN         2S 0       TEXT('Aggregate Facility +
     A                                             - Facility Number')
     A                                      COLHDG('Aggregate Facility ' +
     A                                             '- Facility Number')
