      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE COMM FEE A/C KEY DETAIL')                     *
     A****************************************************************
     A*
     A*  Midas - Customer Lending Module
     A*
     A*   PF/LKEY2DP    COMMITMENT FEE A/C KEYS FILE-DETAIL RECORD
     A*
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*
      *  Last Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      *  Prev Amend No. CLE042             Date 06Sep05               *
      *                 CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 S01182             Date 21/10/88              *
      *                 S01117             Date 11/03/87              *
     A*                      E47264           DATE 05/06/87
     A*
     A****************************************************************
     A*
      *  CLE148 - Alpha Loan Reference                                *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CLE042 - Extended Loan Sub Type                              *
      *  CGL029 - Increase Account Code to 10 digits                  *
     A*   S01182 - MIS.
     A*   S01117 - MULTIBRANCHING
     A*   E47264 - ADD NEW FIELD FOR PREVIOUS ACCRUAL PROFIT DATE
     A*
     A****************************************************************
     A*  C R E A T I O N     P A R A M E T E R S
     A*
     A****************************************************************
     A                                      REF(MFRFL)
     A          R LKEY2DPF                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            RECI      R
     A*                                              Begin /CLE042/
     A************AKEY      R
     A            QQAKEY        10A
     A*                                              End   /CLE042/
      **Start of change CLE148
     A**********  LNNO      R                                                                 CLE148
     A            LNNO           6A         TEXT('Loan Number')
     A                                      COLHDG('Loan' 'Number')
      **End of change CLE148
      * Begin /CSD027/
     A**********  CNUM      R                                                                 CSD027
     A            CNUM           6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A*                                             /S01117/
     A*********** BRCD      R
     A            BRCA      R
     A*                                             /S01117/
     A            ACSQ      R
     A            EDAT      R
     A            EAMT      R
     A            ECCY      R
     A            SETP      R
     A**Start of change CGL029
     A**********  OSAC      R                                                                 CGL029
     A            OSACQQ        12A
     A**End of change CGL029
     A            REVI      R
     A            OTHA      R
     A            OTHC      R
     A            EXRT      R
     A            VDAT      R
     A            SLID      R
     A            MDAT      R
     A            BRTT      R
     A            BRTE      R
     A            RTSP      R
     A            INTR      R
     A            SSEQ      R
     A            CPAM      R
     A            PACD      R
     A            CFTP      R
     A            FAMT      R
     A*                                                    /E47264/
     A*********** ZZ007     R
     A            PELAP     R
     A*                                             /S01117/
     A*********** ZZ004     R
     A            PRFC      R
     A            OSBR      R
     A            CMPYM     R
     A*                                             /S01117/
     A**                                                   /S01182/
     A            BOKC      R
     A**                                                   /S01182/
     A*                                                    /E47264/
     A**Start of change CGL029
     A            OSAC          18A
     A**End of change CGL029
     A*                                              Begin /CLE042/
     A            AKEY          14A         TEXT('Account Key')
     A                                      COLHDG('Account' 'Key')
     A*                                              End   /CLE042/
