      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE PARTS SOLD & PURCH DETAIL')                   *
     A**************************************************************************
     A*
     A*  Midas - Customer Lending Module
     A*
     A*   PF/PARPSPA  PARTICIPATION SOLD AND PURCHASED EXTRACT-DETAIL RECORD
     A*
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*
      *  Last Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      *                 CLE042             Date 06Sep05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*                 S01117             Date 10/12/87              *
     A*
     A*************************************************************************
      *                                                               *
      *  CLE148 - Alpha Loan Reference                                *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CLE042 - Extended Loan Sub Type                              *
     A*   S01117 - MULITBRANCHING AND ALSO FILE SIZE HAD TO INCREAS
     A*************************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R PARPSPAF                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            RECI      R
     A**                            /S01117/
     A            BRCA      R
     A**          BRCD      R
     A**                            /S01117/
      * Begin /CSD027/
     A**********  CNUM      R                                                                 CSD027
     A            CNUM           6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            RCDT      R
      **Start of change CLE148
     A**********  LNRF      R                                                                 CLE148
     A            LNRF           6A         TEXT('Loan Number')
     A                                      COLHDG('Loan' 'Number')
      **End of change CLE148
     A            CCY       R
     A            INTR      R
     A            CPAM      R
     A            INTA      R
     A            MDAT      R
      * Begin /CSD027/
     A**********  OBLN      R                                                                 CSD027
     A            OBLN           6A
     A                                      TEXT('Original borrower/loan no.')
     A                                      COLHDG('Original            ' +
     A                                      'Borrower            ' +
     A                                      'Loan no.')
      * End /CSD027/
     A            PURD      R
     A            ACFE      R
     A            DACR      R
     A            GSCI      R
     A            ATST      R
      * Begin /CSD027/
     A**********  BWCN      R                                                                 CSD027
     A            BWCN           6A
     A                                      TEXT('Borrower customer number')
     A                                      COLHDG('Borrower            ' +
     A                                      'Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            ACOF      R
     A**                            /S01117/
     A*********** ZZ001     R
      **Start of change CLE148
     A**********  MLNR      R                                                                 CLE148
     A            MLNR           6A         TEXT('Mirror Loan Number')
     A                                      COLHDG('Mirror' 'Loan' 'Number')
      **End of change CLE148
     A            CMPYM     R
     A**                            /S01117/
     A*                                              Begin /CLE042/
     A            CLAS           4A         TEXT('Loan Class')
     A                                      COLHDG('Loan' 'Class')
     A*                                              End   /CLE042/
