      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE Temporary Facility History Header')           *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/TFACHISH - Temporary Facility History Header              *
      *                                                               *
      *  (c) Finastra International Limited 2021                      *
      *                                                               *
      *  Last Amend No. CLE138             Date 02Nov21               *
      *  Prev Amend No. AR637338 *CREATE   Date 07Sep10               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CLE138 - Class Codes of Facilities (Recompile)               *
      *  AR637338 - LEC0464 failed, DBERR 002. Create PF/TFACHISH     *
      *             based on FACHISH. To be used by LE0464 for ccy    *
      *             checking. Applied fix 257611.                     *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  C R E A T I O N     P A R A M E T E R S                      *
      *                                                               *
      ******************************************************************
      *
     A          R FACHISHF                  FORMAT(FACHISH)
      *
     A          K FHBRCH
     A          K FHCNUM
     A          K FHFTYP
      *
