      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas Customer Telexes Trailer - copy')
     A**************************************************************************
     A*
     A*  Midas - Customer Lending Module
     A*
     A*   PF/XCUTX1ZX    CUSTOMER TELEXES TRAILER  - SECURITY COPY
     A*
      *  (c) Finastra International Limited 2001                      *
     A*
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01270             Date 26Apr92               *
     A*
     A*************************************************************************
      *  MD046248 - Finastra Rebranding                               *
     A*   S01270 - FILE CREATED FOR R10 FEES ENHANCEMENTS
     A*************************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A          R CUTX1ZXF                  FORMAT(CUTX1ZX)
