      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL Gen. entries LE sec. copy trailer')
     A*****************************************************************
     A*
     A*  Midas - General Ledger Module
     A*
     A*   PF/XGELE2ZZ     GENERATED ENTRIES CUSTOMER LENDING TRAILER
     A*                   SECURITY COPY - CLP/LEC0608
     A*
      *  (c) Finastra International Limited 2001                      *
     A*
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. 000000             Date 00Xxx00               *
     A*
     A*****************************************************************
     A*
      *  MD046248 - Finastra Rebranding                               *
     A*  000000 -
     A*
     A*****************************************************************
     A          R APOSTZZF                  FORMAT(APOSTZZ)
