      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE Fees Copy Detail - Security Copy')            *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/XLEFECPPD - Fees Copy Detail - Security Copy File         *
      *                                                               *
      *  (c) Finastra International Limited 2019                      *
      *                                                               *
      *  Last Amend No. MD053375 *CREATE   Date 11Oct19               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD053375 - Incorrect fee settlement amount in LER170 report. *
      *             Create a temporary file to hold security copy of  *
      *             LEFECPPD.                                         *
      *                                                               *
      *****************************************************************
      *
     A          R LEFEEDF                   FORMAT(LEFECPPD)
      *
     A          K FEBRCA
     A          K FECNUM
     A          K FEFACL
     A          K FELOAN
     A          K FEFSEQ
      *
