      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IMNM                                                      *
/*EXI *  TEXT('Midas UT Fld data, K file,seq,fld no; S seq < 999')
      *****************************************************************
      *                                                               *
      *  Midas - Utilities                                            *
      *                                                               *
      *  LF/UTFLDDL1 - Keyed file, sequence and field number          *
      *                select field number < 999                      *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2010            *
      *                                                               *
      *  Last Amend No. BUG27790 *CREATE    Date 18Jun10              *
      *  Prev Amend No. xxxxxx              Date ddMmmyy              *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  BUG27790 - New utility to compare database files             *
      *                                                               *
      *****************************************************************
      *
     A          R UTFLDDD0                  PFILE(UTFLDDPD)
      *
     A          K FDFILE
     A          K FDSEQN
     A          K FDFLDN
      *
     A          S FDSEQN                    COMP(LT 999)
