      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXI *  TEXT('Midas TI Accrual out of balance suspense accounts')
      *****************************************************************
      *                                                               *
      *  Midas - Trade Innovation Module                              *
      *                                                               *
      *  TI0343P1 - TI Accruals suspense account details              *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *                 CTI003  *CREATE    Date 17Apr01               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CTI003 - TI accrual suspense accounts                        *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
      *--------------------------------*
      ***  Report Header Record Format *
      *--------------------------------*
      *
     A          R HEAD2                     TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A                                      SKIPB(003)
     A                                     2'REFERENCE TI0343P1'
     A            TITL          53        37
     A                                    99'DATE'
     A            AGMRDT    R            105REFFLD(MRDT)
     A                                   115'PAGE'
     A                                   120PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(1)
     A                                    99'TIME'
     A                                   105TIME
     A                                      EDTWRD('  :  :  ')
     A                                      SPACEA(1)
     A                                    23'TI Accrual Out of Balance'
     A                                    48' Suspense Accounts'
     A                                      SPACEA(1)
     A                                    23'-------------------------'
     A                                    48'-------------------'
     A                                      SPACEA(2)
      *-------------------------*
      ***  Sub header           *
      *-------------------------*
      *
     A          R SUBHED2
     A                                     1'Currency'
     A                                    10'Account'
     A**Start of change CGL029
     A**********                          19'Account'                                         CGL029
     A**********                          28'Branch'                                          CGL029
     A**********                          37' Total Credit'                                   CGL029
     A**********                          52'  Total Debit'                                   CGL029
     A**********                          67'Tot Difference'                                  CGL029
     A                                    22'Account'
     A                                    31'Branch'
     A                                    40' Total Credit'
     A                                    55'  Total Debit'
     A                                    70'Tot Difference'
     A**End of change CGL029
     A                                      SPACEA(1)
     A                                    10'Code'
     A**Start of change CGL029
     A**********                          19'Sequence'                                        CGL029
     A**********                          28'Code'                                            CGL029
     A                                    22'Sequence'
     A                                    31'Code'
     A**End of change CGL029
     A                                      SPACEA(1)
     A                                     1'--------'
     A                                    10'-------'
     A**Start of change CGL029
     A**********                          19'--------'                                        CGL029
     A**********                          28'------'                                          CGL029
     A**********                          37' ------------'                                   CGL029
     A**********                          52'  -----------'                                   CGL029
     A**********                          67'--------------'                                  CGL029
     A                                    22'--------'
     A                                    31'------'
     A                                    40' ------------'
     A                                    55'  -----------'
     A                                    70'--------------'
     A**End of change CGL029
     A                                      SPACEA(1)
      *
      *-------------------------*
      ***  Display files        *
      *-------------------------*
     A          R DETAIL2
     A            W#CYCD         3         1
     A**Start of change CGL029
      **********  BTACCD         4        10                                                  CGL029
      **********  BTACSN         2        19                                                  CGL029
      **********  BTIBCA         3        28                                                  CGL029
      **********  TOTCREDIT     13  0     37EDTCDE(Z)                                         CGL029
      **********  TOTDEBIT      13  0     52EDTCDE(Z)                                         CGL029
      **********  W#PTAM        13  0     67EDTCDE(Z)                                         CGL029
                  BTACCD        10        10
                  BTACSN         2        22
                  BTIBCA         3        31
                  TOTCREDIT     13  0     40EDTCDE(Z)
                  TOTDEBIT      13  0     55EDTCDE(Z)
                  W#PTAM        13  0     70EDTCDE(Z)
     A**End of change CGL029
     A                                      SPACEA(1)
      *
      *----------------*
      *** Blank Line   *
      *----------------*
      *
     A          R BLANK2
     A                                     1' '
     A                                      SPACEA(1)
      *
      *-------------------*
      ***  Report Trailer *
      *-------------------*
      *
     A          R TRAIL2
     A                                      SPACEA(3)
     A                                    51'***  END OF REPORT  ***'
