      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas ER GRI GL Accounts File')                        *
      *****************************************************************
      *                                                               *
      *  Midas - European Reporting Module                            *
      *                                                               *
      *  PF/ERBILIPD - Midas ER GRI GL Acounts File                   *
      *                                                               *
      *  (c) Finastra International Limited 2009                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CER070             Date 19Aug14               *
      *                 CER059             Date 19Jul10               *
      *                 CER045  *CREATE    Date 20Jul09               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CER070 - BuBa Reporting / BAIS V.1.16.0                      *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER045 - German Features - Reporting Bundesbank              *
      *                                                               *
      *****************************************************************
     A          R ERBILID0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2009')
      *
     A            B5MDAN         3A         TEXT('Client Shortcut')
     A                                      COLHDG('Client Shortcut')
     A            B5BILK        10S 0       TEXT('GL Account')
     A                                      COLHDG('GL Account')
     A            B5BILB        40A         TEXT('GL Account Name')
     A                                      COLHDG('GL Acct Name')
     A            B5SLDK         2S 0       TEXT('Code to Show if GL +
     A                                      Acct Balanced or Not')
     A                                      COLHDG('Code to Show if' +
     A                                             'GL Acct Bal or Not')
     A            B5IFNA        10A         TEXT('Interface Name')
     A                                      COLHDG('Interface Name')
      **Start of change CER070
     A            B5DLDT         8A         TEXT('Delivery Date')
     A                                      COLHDG('Delivery Date')
      **End of change CER070
