      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas ER GRI Master Account/Transaction Balances')     *
      *****************************************************************
      *                                                               *
      *  Midas - European Reporting Module                            *
      *                                                               *
      *  PF/ERGSTSPD - Midas ER GRI Master Account/Transaction        *
      *                Balances                                       *
      *                                                               *
      *  (c) Finastra International Limited 2009                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. MD030247           Date 26Jan15               *
      *                 CER070             Date 19Aug14               *
      *                 CER059             Date 19Jul10               *
      *                 BUG26308           Date 06Oct09               *
      *                 CER045  *CREATE    Date 20Jul09               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  MD030247 - Increase size of GSRE to 21.                      *
      *             Applied for MD032081                              *
      *  CER070 - BuBa Reporting / BAIS V.1.16.0                      *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *         - LT062: Changed Customer No. to Alphanumeric.        *
      *  BUG26308 - Change Request - BAIS Mapping table enhancement   *
      *  CER045 - German Features - Reporting Bundesbank              *
      *                                                               *
      *****************************************************************
     A          R ERGSTSD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2009')
      *
     A            B4MDAN         3A         TEXT('Client Shortcut')
     A                                      COLHDG('Client Shortcut')
      **Start of change BUG26308
     A**********  B4FILN         3A         TEXT('Branch Number')                           BUG26308
     A**********                            COLHDG('Branch Number')                         BUG26308
     A            B4FILN         3A         TEXT('Redundant')
     A                                      COLHDG('Redundant')
      **End of change BUG26308
     A            B4MODU         2A         TEXT('Module')
     A                                      COLHDG('Module')
      **Start of change CER059
     A**********  B4KDNR        10S 0       TEXT('Customer No.')                              CER059
     A            B4KDNR        10A         TEXT('Customer No.')
      **End of change CER059
     A                                      COLHDG('Customer No')
     A            B4KTON        10S 0       TEXT('Acct/Trans No.')
     A                                      COLHDG('Acct/Trans No')
      ** Start of change MD030247
     A**********  B4GSRE        20A         TEXT('Transaction Ref')
     A**********                            COLHDG('Transaction Ref')
     A            QQGSRE        20A         TEXT('REDUNDANT')
     A                                      COLHDG('REDUNDANT')
      ** End of change MD030247
     A            B4SLDU        18S 0       TEXT('Balance')
     A                                      COLHDG('Balance')
     A            B4DISP        18S 0       TEXT('Drawings Limit')
     A                                      COLHDG('Drawings Limit')
     A            B4DXDV         8S 0       TEXT('Start of Term +
     A                                      For Drawings Limit')
     A                                      COLHDG('Start of Term' +
     A                                             'For Drawings Lim')
     A            B4DXDB         8S 0       TEXT('End of Term +
     A                                      For Drawings Limit')
     A                                      COLHDG('End of Term' +
     A                                             'For Drawings Lim')
     A            B4ABGB        18S 0       TEXT('Accrual Amount')
     A                                      COLHDG('Accrual Amount')
     A            B4IFNA        10A         TEXT('Interface Name')
     A                                      COLHDG('Interface Name')
     A            B4NBDP         1S 0       TEXT('No of Dec Places')
     A                                      COLHDG('No of Decimal Places')
      **Start of change BUG26308
     A            B4GKBT        18S 0       TEXT('Amount Notice +
     A                                            Given For')
     A                                      COLHDG('Amount Notice' +
     A                                             'Given For')
      **End of change BUG26308
      ** Start of change MD030247
     A            B4GSRE        21A         TEXT('Transaction Ref')
     A                                      COLHDG('Transaction Ref')
      ** End of change MD030247
      **Start of change CER070
     A            B4DLDT         8A         TEXT('Delivery Date')
     A                                      COLHDG('Delivery Date')
      **End of change CER070
