      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas ER Investment Company Codes Table File')
      *****************************************************************
      *                                                               *
      *  Midas - European Reporting Module                            *
      *                                                               *
      *  PF/ERLUCCPP - Investment Company Coes Table File             *
      *                                                               *
      *  (c) Finastra International Limited 2005                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CER001             Date 25Apr05               *
      *                 ULX008  *CREATE    Date 17Feb00               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CER001 - LUX Upgrade to MidasPlus                            *
      *  ULX008 - CSSF Statutory Reporting : Commissariat aux Bourses *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R ERLUCCD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2005')
      *
     A            X6INCC         4          TEXT('Investment Company Code')
     A                                      COLHDG('Investm.' 'Company' 'Code')
     A            X6INNM        60          TEXT('Investment Company Name')
     A                                      COLHDG('Investm.' 'Company' 'Name')
     A            X6LCTP         1          TEXT('Last Change Type')
     A                                      COLHDG('Last' 'Change' 'Type')
     A            X6LCDT         5P         TEXT('Last Change Date')
     A                                      COLHDG('Last' 'Change' 'Date')
