      ****************************************************************
/*STD *  PFBASE                                                      *
/*EXS *  PF_STD                                                      *
/*EXI *  TEXT('Midas ER Lump-Sum Provision Rates - Details')
     A*****************************************************************
     A*                                                               *
     A*   MIDAS/ABS EUROPEAN REPORTING - LUXEMBOURG                   *
     A*                                                               *
     A*   PF/ERLUMPPD  -  LUMP-SUM PROVISION RATES - DETAILS          *
     A*                                                               *
     A*   (c) Finastra International Limited 2005                     *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CER001             Date 25Apr05               *
      *                 ERL371 TL          Date 25Nov93               *
     A*                                                               *
     A*****************************************************************
      *  MD046248 - Finastra Rebranding                               *
      *  CER001 - LUX Upgrade to MidasPlus                            *
     A*  ERL371 - IML 1.4 DEVELOPMENT                                 *
      *...............................................................
     A          R SDXXXXPR                  TEXT('(c) Finastra International +
     A                                      Limited 2005')
      *
     A            LSCODE         2S 0
      *
     A            LSNARA        40A
      *
     A            LSRATE         4S 0
      *
     A            LSLCD          5  0
      *
     A            LSTYLC         1
