      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas @24 KWG file info detail')                       *
      *****************************************************************
      *                                                               *
      *  Midas - European Reporting Module                            *
      *                                                               *
      *  PF/ERTRSPPD - Midas @24 KWG file info detail                 *
      *                                                               *
      *  (c) Finastra International Limited 2008                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CER068             Date 25Feb14               *
      *                 CER059             Date 19Jul10               *
      *                 CER047  *CREATE    Date 19May08               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CER068 - Upgrade CER047 to be compatible with BaFin 3.2.2    *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER047 - German Features LF037-00 Reporting §24c KWG         *
      *                                                               *
      *****************************************************************
      *
     A          R ERTRSPD0                  TEXT('(c) Finastra +
     A                                      International Banking +
     A                                      Limited 2008')
      *
     A            F11FNR         8S 0       TEXT('File Number')
     A                                      COLHDG('File' 'Number')
      *
     A            F11ECL         2S 0       TEXT('ERROR class')
     A                                      COLHDG('ERROR' 'class')
      *
     A            F11ETP         2S 0       TEXT('ERROR type')
     A                                      COLHDG('ERROR' 'type')
      *
      **Start of change CER068
     A**********  F11ACC        20A         TEXT('Account')                                   CER068
     A            F11ACC        50A         TEXT('Account')
      **End of change CER068
     A                                      COLHDG('Account')
      *
     A            F11REF        12A         TEXT('Reference')
     A                                      COLHDG('Reference')
      *
     A            F11DTA      2000A         TEXT('DATA')
     A                                      COLHDG('DATA')
     A                                      VARLEN
      *
