      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GO On-Line Synchronization Commitment IDs')
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  PF/GOOSCIPD - On-Line Synchronization Commitment IDs         *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGP001  *CREATE    Date 23May03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGP001 - Global Processing                                   *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R GOOSCID0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
      *
     A            CICCID        10S 0       TEXT('Commit cycle identifier')
     A                                      COLHDG('Commit' 'Cycle' 'id')
     A            CIFILE        10A         TEXT('File')
     A                                      COLHDG('File')
     A            CIBFAF         1A         TEXT('Before/After')
     A                                      COLHDG('Before/After')
     A            CIIMG       4000A         TEXT('Image')
     A                                      COLHDG('Image')
