      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SM Driving file for db migration (<> PASSED)')
      *****************************************************************
      *                                                               *
      *  Midas - Implementation module                                *
      *                                                               *
      *  PF/SMCPYDL0 - Driving file for database migration            *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2010            *
      *                                                               *
      *  Last Amend No. BUG27793 *CREATE   Date 04Jun10               *
      *  Prev Amend No. xxxxxx             Date ddMmmyy               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  BUG27793 - Make migration mult-streamed.                     *
      *                                                               *
      *****************************************************************
      *
     A          R QLIDOBJD
     A                                      PFILE(SMCPYDPD)
      *
     A          K ODOBNM
     A          K ODOBTP
      *
     A          S ODDDAT                    COMP(NE 'PASSED')
