      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SM Enter release level by Prdct Rls & SubRls')   *
      *****************************************************************
      *                                                               *
      *  Midas - Implementation Module                                *
      *                                                               *
      *  PF/SMRLSLL0 - Midas SM Enter release level                   *
      *                by Prdct Rls & SubRls                          *
      *                                                               *
      *  (c) Finastra International Limited 2010                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. AR875960 *CREATE   Date 20Dec11               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  AR875960 - Correction of Release Level to BFMidas 2.0        *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A          R SMRLSLD0                  PFILE(SMRLSLPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2011')
      *
     A          K RLPROD
     A          K RLRLS
     A          K RLSRLS
      *
