      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas DL Nostro transfers input screen.')
     A*            15:12:07    REL30       REL-R07M00  5714-UT1
     A********************************************************************
     A*                                                                  *
     A*  Midas - Dealing Module
     A*                                                                  *
     A*      DL0035FM   NOSTRO TRANSFERS INPUT                           *
     A*                                                                  *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                                  *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. 232990 (218708)  Date 11Jul06                 *
      *                 (240256)                                      *
      *  Prev Amend No. BUG8759            Date 30Sep05               *
      *                 CAAA03             Date 19Apr04               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*                 104633             Date 18Jun96               *
     A*                 E42830             Date 27Jul92               *
     A*                     DT0194           DATE 28MAY91                *
     A*                     E21631           DATE 27JUL90                *
     A*                     S01253           DATE 17APR90                *
     A*                     E00044           DATE 13NOV89                *
     A*                     S01117           DATE 20JUL89                *
     A*                     S01199           DATE 17MAR89                *
     A*                     E11533           DATE 14JUN88                *
     A*                     E11064           DATE 03MAR88                *
     A*                                                                  *
     A*------------------------------------------------------------------*
     A*                                                                  *
      *      218708 - Add book code field to input screen as this is     *
      *               needed for CAS001.                                 *
     A*      BUG8759  Apply 232990 (218708)                              *
     A*               Add book code field to input screen as this is     *
     A*               needed for CAS001.                                 *
      *      CAAA03 - Webfacing Changes                                  *
     A*      104633 - GUI Amendments to DSPF with non-standard footers   *
     A*      E42830 - E21631 uses *IN20 to condition text on reversal    *
     A*               in RPG program but uses *IN35 in DSPF. File        *
     A*               changed to use *IN20 as well.                      *
     A*      DT0194 - Missing help tags.                                 *
     A*      E21631 - DO NOT DISPLAY 'F10 TO DELETE' UNLESS              *
     A*               A REVERSAL IS BEING PERFORMED                      *
     A*      S01253 - RECOMPILED FOR MULTILANGUAGE SCREENS               *
     A*      E00044 - POSITIONING OF CURSOR ON FIELD IN ERROR            *
     A*      S01117 - MULTI BRANCHING                                    *
     A*      S01199 - HELP SYSTEM.                                       *
     A*      E11533  -  RSETT not appearing                              *
     A*      E11064  -  CHANGE OF TERMINOLOGY FOR SETTLEMENT METHOD/     *E11064
     A*                 NOSTRO.                                          *E11064
     A*                                                                  *
     A********************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A*                                                    /*S01199*/
     A*                                                    /*S01199*/
     A                                      PRINT(MPRINT)
     A*                                                    /*S01199*/
     A*                                                    /*S01199*/
     A                                      INDARA
     A          R DL0035F1                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                      CF10
     A                                      CF12
     A                                      CF03
     A*                                                    /*S01199*/
     A            SRNID          2A  B  1  2DSPATR(PR)
     A                                      DSPATR(ND)
     A                                  1 26'NOSTRO TRANSFER DEAL'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A            TIME           8A  O  1 65
     A                                  1 74'WID'
     A            WSID           3A  O  1 78
     A                                  3 22'Deal no.'
     A  64                                  DSPATR(ND)
     A  40        DEALNO         6A  B  3 31DSPATR(PR)
     A                                      DSPATR(HI)
     A                                  3 39'Action'
     A  64                                  DSPATR(ND)
     A  40        ACTCD          1A  B  3 46DSPATR(PR)
     A                                      DSPATR(HI)
     A                                  5 31'Sub-type'
     A  64                                  DSPATR(ND)
     A  40        SUBTPE         2A  B  5 44
     A  44                                  DSPATR(RI)
     A  79                                  DSPATR(PR)
     A N44N79                               DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  6 31'Branch'
     A  64
     AON17                                  DSPATR(ND)
     A  40 17     BRCODE         3A  B  6 44
     A  46                                  DSPATR(RI)
     A  79                                  DSPATR(PR)
     A N46N79                               DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  7 31'Value date'
     A  64                                  DSPATR(ND)
     A  40        VALDAT         6A  B  7 44
     A  51                                  DSPATR(RI)
     A  79                                  DSPATR(PR)
     A N51N79                               DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  8 31'Ccy'
     A  64                                  DSPATR(ND)
     A  40        BUYCCY         3A  B  8 44
     A  53                                  DSPATR(RI)
     A  79                                  DSPATR(PR)
     A N53N79                               DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  9 31'Amount'
     A  64                                  DSPATR(ND)
     A  40        BUYAMT        14A  B  9 44
     A  54                                  DSPATR(RI)
     A  79                                  DSPATR(PR)
     A N54N79                               DSPATR(UL)
     A                                      DSPATR(HI)
     A********** S01117
     A                                 10 31'Prof.Centre'
     A  64
     AON36                                  DSPATR(ND)
     A  40
     AA 36        PRFCNT         4A  B 10 44
     A  18                                  DSPATR(RI)
     A  79                                  DSPATR(PR)
     A N18N79                               DSPATR(UL)
     A                                      DSPATR(HI)
     A                                 11 31'Orig.Branch'
     A  64
     AON17
     AO 17N35                               DSPATR(ND)
     A  40
     AA 17 35     ORBRCH         3A  B 11 44
     A  19                                  DSPATR(RI)
     A  79                                  DSPATR(PR)
     A N19N79                               DSPATR(UL)
     A                                      DSPATR(HI)
     A********** S01117
     A************                                                      /E11533/
     A** Start of BUG8759 **                                           /BUG8759/
     A** Book Code                                                     /BUG8759/
     A                                 12 31'Book Code'
     A
     A  64                                  DSPATR(ND)
     A  40        BKCODE         2A  B 12 44
     A  32                                  DSPATR(RI)
     A  79                                  DSPATR(PR)
     A N32N79                               DSPATR(UL)
     A                                      DSPATR(HI)
     A*                                                                /BUG8759/
     A                                 13  2'Pay Settlement method'
     A  64                                  DSPATR(ND)
     A  40        PSETT          2A  B 13 29
     A  66                                  DSPATR(RI)
     A  78                                  DSPATR(PR)
     A N66N78                               DSPATR(UL)
     A                                      DSPATR(HI)
     A                                 13 43'Pay Nostro'
     A  64                                  DSPATR(ND)
     A  40        OPAYCR         2A  B 13 60
     A  68                                  DSPATR(RI)
     A  78                                  DSPATR(PR)
     A N68N78                               DSPATR(UL)
     A                                      DSPATR(HI)
     A                                 15  2'Receive Settlement method'
     A  64                                  DSPATR(ND)
     A  40        RSETT          2A  B 15 29
     A  65                                  DSPATR(RI)
     A  79N34N33                            DSPATR(PC)
     A  78                                  DSPATR(PR)
     A N65N78                               DSPATR(UL)
     A                                      DSPATR(HI)
     A                                 15 43'Receive Nostro'
     A  64                                  DSPATR(ND)
     A  40        ORECDR         2A  B 15 60
     A  67                                  DSPATR(RI)
     A  78                                  DSPATR(PR)
     A N67N78                               DSPATR(UL)
     A                                      DSPATR(HI)
     A********                         12  2'Pay Settlement method'
     A**64****                              DSPATR(ND)
     A**40****    PSETT          2A  B 12 29
     A**66****                              DSPATR(RI)
     A**78****                              DSPATR(PR)
     A*N66N78*                              DSPATR(UL)
     A********                              DSPATR(HI)
     A********                         12 43'Pay Nostro'
     A**64****                              DSPATR(ND)
     A**40****    OPAYCR         2A  B 12 60
     A**68****                              DSPATR(RI)
     A**78****                              DSPATR(PR)
     A*N68N78*                              DSPATR(UL)
     A********                              DSPATR(HI)
     A************                                                      /E11533/
     A********                                                        /E11064/
     A** End of BUG8759 **                                             /BUG8759/
     A*                                12  3'Debit Settlement method' /E11064/
     A** Start of BUG8759 **                                           /BUG8759/
     A********                         14  2'Receive Settlement method'
     A** End of BUG8759 **                                             /BUG8759/
     A*                                                               /E11064/
     A** Start of BUG8759 **                                           /BUG8759/
     A**64****                              DSPATR(ND)
     A** End of BUG8759 **                                             /BUG8759/
     A*                                                               /E11064/
     A* 40        RSETT          2A  B 12 28                          /E11064/
     A** Start of BUG8759 **                                           /BUG8759/
     A**40****    RSETT          2A  B 14 29
     A** End of BUG8759 **                                             /BUG8759/
     A*                                                               /E11064/
     A** Start of BUG8759 **                                           /BUG8759/
     A**65****                              DSPATR(RI)
     A**79N34N33                            DSPATR(PC)
     A**78****                              DSPATR(PR)
     A*N65N78*                              DSPATR(UL)
     A********                              DSPATR(HI)
     A** End of BUG8759 **                                             /BUG8759/
     A*                                                               /E11064/
     A*                                12 43'Debit Nostro'            /E11064/
     A** Start of BUG8759 **                                           /BUG8759/
     A********                         14 43'Receive Nostro'
     A** End of BUG8759 **                                             /BUG8759/
     A*                                                               /E11064/
     A** Start of BUG8759 **                                           /BUG8759/
     A**64****                              DSPATR(ND)
     A** End of BUG8759 **                                             /BUG8759/
     A*                                                               /E11064/
     A* 40        ORECDR         2A  B 12 60                          /E11064/
     A** Start of BUG8759 **                                           /BUG8759/
     A**40****    ORECDR         2A  B 14 60
     A** End of BUG8759 **                                             /BUG8759/
     A*                                                               /E11064/
     A** Start of BUG8759 **                                           /BUG8759/
     A**67****                              DSPATR(RI)
     A**78****                              DSPATR(PR)
     A*N67N78*                              DSPATR(UL)
     A********                              DSPATR(HI)
     A** End of BUG8759 **                                             /BUG8759/
     A************                                                      /E11533/
     A*                                                               /E11064/
     A*                                14  3'Credit Settlement method'/E11064/
     A************                     12  2'Pay Settlement method'
     A*                                                               /E11064/
     A**64********                          DSPATR(ND)
     A*                                                               /E11064/
     A* 40        PSETT          2A  B 14 28                          /E11064/
     A**40********PSETT          2A  B 12 29
     A*                                                               /E11064/
     A**66********                          DSPATR(RI)
     A**78********                          DSPATR(PR)
     A*N66N78*****                          DSPATR(UL)
     A************                          DSPATR(HI)
     A*                                                               /E11064/
     A*                                14 43'Credit Nostro'           /E11064/
     A************                     12 43'Pay Nostro'
     A*                                                               /E11064/
     A**64********                          DSPATR(ND)
     A*                                                               /E11064/
     A* 40        OPAYCR         2A  B 14 60                          /E11064/
     A**40********OPAYCR         2A  B 12 60
     A*                                                               /E11064/
     A**68********                          DSPATR(RI)
     A**78********                          DSPATR(PR)
     A*N68N78*****                          DSPATR(UL)
     A************                          DSPATR(HI)
     A************                                                      /E11533/
     A            ERCD          76A  O 21  2
     A  80                                  DSPATR(ND)
      ** Start of change CAAA03
     A**********                            DSPATR(RI)                                        CAAA03
     A N80                                  DSPATR(RI)
      ** End of change CAAA03
     A                                      DSPATR(HI)
     A            ERMSG         76A  O 22  2
     A  81                                  DSPATR(ND)
      ** Start of change CAAA03
     A**********                            DSPATR(RI)                                        CAAA03
     A N81                                  DSPATR(RI)
      ** End of change CAAA03
     A                                      DSPATR(HI)
     A*                                                               /*E21631*/
     A**********                       23  2'Press F3 to end'
     A**********                       23 21',F10 to delete, F12 to return -
     A**********                            to initial screen'
      ******                                          Start  /104633/
     A******                           23  2'Press F3 to end,'
     A                                 23  2'F3=Exit'
      ******                                            End  /104633/
      *                                                               *
      ** Start of changes for E42830.                                **
      *                                                               *
     A**35******                       23 19'F10 to delete, F12 to return t-
     A**********                            o initial screen'
     A*N35******                       23 19'F12 to return to initial scree-
     A**********                            n'
      ******                                          Start  /104633/
     A**20**                           23 19'F10 to delete, F12 to return t-
     A******                                o initial screen'
     A*N20**                           23 19'F12 to return to initial scree-
     A******                                n'
     A  20                             23 12'F10=Delete   F12=Previous'
     A N20                             23 12'F12=Previous'
      ******                                             End  /104633/
      *                                                               *
      ** End   of changes for E42830.                                **
      *                                                               *
     A*                                                               /*E21631*/
     A                                 24  2'or enter next'
     A  23                                  DSPATR(ND)
     A                                 24 16'Deal no'
     A  23                                  DSPATR(ND)
     A            DEAL1          6A  B 24 24
     A  41                                  DSPATR(RI)
     A**                                                   /*E00044/
     A**34N33                               DSPATR(PC)
     A  34N33N42                            DSPATR(PC)
     A**                                                   /*E00044/
     A  23                                  DSPATR(PR)
     A  23                                  DSPATR(ND)
     A N23N41                               DSPATR(UL)
     A                                      DSPATR(HI)
     A                                 24 31', and'
     A  23                                  DSPATR(ND)
     A                                 24 37'Action'
     A  23                                  DSPATR(ND)
     A            ACTION         1A  B 24 44
     A**                                                   /*E00044/
     A**42                                  DSPATR(RI)
     A  42                                  DSPATR(RI PC)
     A**                                                   /*E00044/
     A  23                                  DSPATR(PR)
     A  23                                  DSPATR(ND)
     A N23N42                               DSPATR(UL)
     A                                      DSPATR(HI)
