      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas DL Full/Exception Report-Prod Op Prompt')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Dealing Module
     A*                                                               *
     A*   DL0806DF - FULL/EXCEPTION EXPOSURE REPORT                   *
     A*                (PRODUCTION OPTION PROMPT)                     *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. 104633             Date 18Jun96               *
      *                 LN0774             Date 21Sep90               *
     A*                  S01199/E298       DATE 30MAR90               *
     A*                  E245              DATE 7MAR90                *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     A*   104633 - GUI Amendments to DSPF with non-standard footers   *
     A*   LN0774 - TIDY UP DISPLAY FILE                              *
     A*   E298/S01199 - ADD HELP PROCESSING                           *
     A*   E245 - ADD DELETE PROCESSING                                *
     A*                                                               *
     A*****************************************************************
     A*
     A                                      PRINT(MPRINT)
     A*                                                    /*S01199*/
     A*                                                    /*S01199*/
     A          R DL806PS0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A                                      CA03(03) CA12(12)
     A*                                                                   E245
     A  30                                  CA10(10)
     A*                                                                   E245
     A                                      OVERLAY
     A*
     A                                  1 28'MIDAS REPORT PRODUCTION OPTIONS'
     A                                      DSPATR(UL HI)
     A*                                                    /*LN0774*/
     A**********                        1 71DATE
     A**********                            EDTCDE(Y)
     A            SRUNA          7A  O 01 72
     A*                                                    /*LN0774*/
     A                                  2 71TIME
     A*                                                    /*LN0774*/
     A**********                        1 13'REF DL0806P'
     A                                  1 13'DL0806P'
     A**********  USER          10A  O  2  2
     A            USER          10A  O  1  2
     A**********                       01  2'WID'
     A**********  WSID           3A  O 01  6
     A            WSID           3A  O  2  6
     A*                                                    /*LN0774*/
     A                                 02 27'EXPOSURE AGAINST LIMITS REPORTING'
     A                                      DSPATR(UL HI)
     A                                  7  8'1.'
     A                                  7 12'Full Exposure Reporting'
     A                                  9  8'2.'
     A                                  9 12'Exception Only Reporting'
     A                                 13  8'Enter Report Option (1 or 2)'
     A************************              DSPATR(UL)                    E245
     A            @EXPS          1A  B 13 43DSPATR(UL)
     A*                                                                   E245
     A  40                                  DSPATR(PR PC)
     A*
     A************                          DSPATR(RI)
     A  20                             18 32'  INPUT ONLY 1 OR 2  '
     A                                      DSPATR(RI)
     A*
     A          R DL806PD0                  TEXT('SCREEN FOOTER')
      ******                                         Start  /104633/
     A******                           23  9'F3 to exit'
     A******                           23 28'F12 initial screen'
     A**30**                           23 55'F10 delete'
     A                                 23  2'F3=Exit'
     A  30                             23 12'F10=Delete'
     A                                 23 26'F12=Previous'
      *                                                End  /104633/
     A***********                      24  9'F/3 to exit'
     A***********                      24 39'F/12 initial screen'
