      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MS Midas to Midas Message Manager export')
      *****************************************************************
      *                                                               *
      *  Midas - Midas SWIFT Module                                   *
      *                                                               *
      *  PF/MS_MID2MMM -                                              *
      *   Midas to Midas Message Manager export Data Queue Layout File*
      *                                                               *
      *  Note: Any fix applied to this file may also need to be       *
      *        applied to the core DTAARA source.                     *
      *                                                               *
      *  (c) Finastra International Limited 2002                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. BUG3047            Date 03Jun04               *
      * Midas Release 4.01 -------------------------------------------*
      *                 CSW025  *CREATE    Date 15Apr02               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  BUG3047- MMM Data queues moved to Global Layer.              *
      *  CSW025 - Midas Message Manager                               *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
 
     A          R MS_MID2MMM                TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2002')
 
     A            MMMTERM    32000          TEXT('Midas to MMM Message')
