      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas PB Meridian Copy Queues Control File')
      *****************************************************************
      *                                                               *
      *  Midas - Replication Module                                   *
      *                                                               *
      *  LF/RPTRAQL0 - Meridian MQSeries COPY    Queues Control       *
      *                File                                           *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CPB010   *CREATED  Date 17Jan03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CPB010 - Avoid DB Error by write message in Trace File       *
      *                                                               *
      *****************************************************************
     A          R RPTRAQD0                  PFILE(RPTRAQPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
      *
      **  Key fields.
     A          K RPTRAF
      *
      **  Selection fields.
     A          S RPACTI                    COMP(EQ 'Y')
