      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FF Generated account keys extract')
      *****************************************************************
      *                                                               *
      *  Midas - Financial Futures and Options Module                 *
      *                                                               *
      *  PF/FFKEY1PD - FO Generated Account Keys (Detail)             *
      *                                                               *
      *  This file is a copy of FOKEY1                                *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 25Nov05               *
      *                 CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *                 185214             Date 22Mar01               *
      * Midas DBA 3.00 Patch D ---------------------------------------*
      * Midas DBA 3.01 -----------------------------------------------*
      *                 163444  *CREATE    Date 22Jul99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  185214  -  Redefine STRP to match the field in FOKEYD.       *
      *  163444  -  Y2K Sort order                                    *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R FFKEY1D0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A            RECI      R
     A            FFKY      R
     A            TNBR      R
     A            CLON      R
      * Begin /CSD027/
     A**********  CBCD      R                                                                 CSD027
     A            CBCD           6A
     A                                      TEXT('Customer Broker Code')
     A                                      COLHDG('Customer            ' +
     A                                      'Broker              ' +
     A                                      'Code')
      * End /CSD027/
     A            BOKC      R
     A            BRCA      R
     A            OBKC      R
     A            ASEQ      R
     A            EDAT      R
     A            EAMT      R
     A            CCY       R
     A            VDAT      R
     A            SETP      R
     A**Start of change CGL029
     A**********  SETA      R                                                                 CGL029
     A            SETAQQ        12A
     A**End of change CGL029
     A            SEBR      R
     A            ISTT      R
     A            YRNO      R
     A            YRCC           4S 0
     A            MTHN      R
     A            PCAL      R
      *                                                                            Start of /185214/
     A*********** STRP      R
     A            STRP      R               REFFLD(STRPNW)
      *                                                                              End of /185214/
     A            ISTN      R
     A            REVI      R
     A            PRFC      R
     A            PTFR      R
      *
     A**Start of change CGL029
     A            SETA          18A
     A**End of change CGL029
     A          K BRCA
     A          K ISTT
     A          K YRCC
     A          K MTHN
     A          K PCAL
     A          K STRP
     A          K TNBR
