      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FF FFSTAT Backup Data Area')
     A*****************************************************************
     A*                                                               *
     A*  Midas FUTURES AND OPTIONS MODULE                         *
     A*                                                               *
     A*  PF/FFTEMP         Midas FF BACKUP DATA AREA              *
     A*                                                               *
     A*  (c) Finastra International Limited 2001                      *
     A*      COMPANY CONFIDENTIAL.                                    *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  PREV AMEND NO.  FO0046            DATE 02APR91              *
     A*                  E23088            DATE 09AUG90               *
     A*                  E21728            DATE 27APR90               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  NOTE: Any fix applied to this file may also need to be       *
     A*        applied to the core DTAARA source.                     *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  MD046248 - Finastra Rebranding                               *
     A*  FO0046  -  Flag added to prevent more than one user running  *
     A*             I/C Customer Trading Statements Report.           *
     A*  E23088  -  DATA AREA AMENDED TO INCLUDE 'RST' IF ERROR IN    *
     A*             FFC05 TO ENABLE COMPONENT TO BE RESTARTED.        *
     A*  E21728  -  FILE CREATED TO PROVIDE SOURCE FOR THE DTAARA     *
     A*             (BASED ON PF/DTAARA FFSTAT AND SHOULD BE AMENDED  *
     A*              ALONG WITH THESE)                                *
     A*****************************************************************
     A          R FFTEMPF                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            MSFLG          1          TEXT('MODULE SETUP FLAG')
     A            ZZ001          1          TEXT('FILLER FIELD')
     A            REVLS          1          TEXT('REVALUATION STATUS')
     A            MARKT          3          TEXT('MARKET CENTRE')
     A            RMVCG          2S         TEXT('NUMBER OF EOCS WITH +
     A                                      RMVJRNCHG ACTIVE')
     A            FRBD           1          TEXT('FILE REBUILD NEEDED')
     A            FFACKEY        1          TEXT('ACCOUNT KEYS MISSING+
     A                                      CONTINUE Y OR N')
     A            EJRFLG         1          TEXT('END JOURNALLING +
     A                                      RECOVER FLAG')
     A            EJIJE         10          TEXT('END JOURNALLING +
     A                                      INITIAL JOURNAL ENTRY')
     A            EJFJE         10          TEXT('END JOURNALLING +
     A                                      FINAL JOURNAL ENTRY')
     A            RGZCPL         1          TEXT('REORGANIZE CONTROL +
     A                                      PLACE')
     A**                                                  START OF CHANGE E23088
     A            RSTFLG         3          TEXT('FFC05 ENDED IN ERROR')
     A**                                                  START OF CHANGE FO0046
     A            CTSRUN         1          TEXT('CUSTOMER TRADING STMTS +
     A                                      REPORT REQUESTED')
     A            ZZ220        220          TEXT('FILLER FIELD')
     A************ZZ221********221          TEXT('FILLER FIELD')
     A**                                                    END OF CHANGE FO0046
     A************ZZ224********224          TEXT('FILLER FIELD')
     A**                                                    END OF CHANGE E23088
