      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FF Journal Changes Details')
     A*****************************************************************
     A*                                                               *
     A*  Midas   FINANCIAL FUTURES AND OPTIONS MODULE
     A*                                                               *
     A*  PF/JRNCGD  -  JOURNAL CHANGES DETAILS                        *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. E00000             DATE  DDMMMYY              *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R JRNCGDF
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            MFLK      R
     A            JOESD        512          TEXT('JOURNAL ENTRY SPECIFIC DATA')
     A            JOCCID    R
     A            JOENTT    R
     A            JOJOB     R
     A            JOUSER    R
     A            JONBR     R
     A            JOENTL    R
     A            AUTU      R
     A            NRFC      R
     A          K MFLK
