      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FF Journal images')
     A*****************************************************************
     A*                                                               *
     A*  Midas   FINANCIAL FUTURES AND OPTIONS MODULE
     A*                                                               *
     A*  PF/JRNIMD  -  JOURNAL IMAGES                                 *
     A*                                                               *
     A*  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. 212082             Date  19Dec02              *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 E00000             Date  DDMMMYY              *
     A*                                                               *
     A*  MD046248 - Finastra Rebranding                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R QJORDJE
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            JOENTL    R
     A            JOSEQN    R
     A            JOCODE    R
     A            JOENTT    R
     A            JODATE    R
     A            JOTIME    R
     A            JOJOB     R
     A            JOUSER    R
     A            JONBR     R
     A            JOPGM     R
     A            JOOBJ     R
     A            JOLIB     R
     A            JOMBR     R
     A            JOCTRB    R
     A            JOFLAG    R
     A            JOCCID    R
     A** 212082 START **/
     A************JORES     R
     A            JOINCD         1
     A            JOMINE         1
     A            JORES          6
     A** 212082 END   **/
     A            JOESD        512          TEXT('JOURNAL ENTRY SPECIFIC DATA')
