      *****************************************************************
      *                                                               *
      *  GLU120GDTA - /COPY for Journal Entry Windows                 *
      *                                                               *
      *  Last Amend No. EML102 *Create      Date 22Nov19              *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  EML102 - Upgrade of EML004 to FB21 SP21                      *
      *       EML004 - Extended Narrative Enhancement                 *
      *                                                               *
      *****************************************************************
     D DATA            DS          1024
     D  #1BTNB                 1      3
     D  #1BINB                 4      6  0
     D  #1IBCA                22     24
     D  #1PTDT               207    211  0
     D  #1NA02               212    246
     D  #1NA03               247    281
     D  #1NA04               282    316
     D  #1NA05               317    351
     D  #1NA06               352    386
     D  #1NA07               387    421
     D  #1NA08               422    456
     D  #1NA09               457    491
     D  #1NA10               492    526
     D  #1NA11               527    561
     D  #1NA12               562    596
     D  #1NA13               597    631
     D  #1NA14               632    666
     D  #1NA15               667    701
     D  #1NA16               702    736
     D  #1NA17               737    771
     D  #1BPHI               772    772
     D  #1OBTN               773    775
     D  #1PTAM               776    782P 0
     D  #1PNAR               783    812
