      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas AB Internal Funding Deals Extension File')
      *****************************************************************
      *                                                               *
      *  Midas - Internal Funding Module                              *
      *                                                               *
      *  PF/ABFUNDQD - Midas AB Internal Funding Deals Extension File *
      *                                                               *
      *  (c) Finastra International Limited 2009                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      *  Prev Amend No. BUG24182           Date 16Jun09               *
      *                 CAP191  *CREATE    Date 12May09               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  BUG24182 - Change DDDLNO to char type to prevent the leading *
      *             zeros of the Loan Deal Number to be truncated.    *
      *  CAP191 - Midas R1.4 Additional MQ APIs                       *
      *                                                               *
      *****************************************************************
      *
     A          R ABFUNDQD                  TEXT('(c) Finastra +
     A                                      International Banking +
     A                                      Limited 2009')
      *
      * Start of change BUG24182
     A**********  DDDLNO         6S 0       TEXT('Deal Number')
     A**********                            COLHDG('Deal Number')
     A            DDDLNO         6A         TEXT('Deal Number')
     A                                      COLHDG('Deal Number')
      * End of change BUG24182
      *
     A            DDFRID        20A         TEXT('Front Office ID')
     A                                      COLHDG('Front Office ID')
      *
