      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXI *  TEXT('Midas AB Arbitrage standard deal')
/**XS****PF_STD********************************************************                       178523
/*EXS *  PF_NM                                                        *                       178523
     A*****************************************************************
     A*                                                               *
     A*  Midas - Internal Contracts (Dealing)                         *   S01194
     A*                                                               *
     A*     PF/ABSTDDPP - ARBITRAGE STANDARD DEAL                     *   S01194
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CDL038             Date 10May05               *
      *  Prev Amend No. CSD027             Date 23Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.03 -----------------------------------------------*
      *                 178523             Date 03May00               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CAC001             Date 01Feb96               *
      *                 S01392             Date 20Jul92               *
     A*                 S01117             Date 17Jan90               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
     A*  CDL038 - Extended Deal Sub Type                              *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*  178523 - Incorrect creation parameters                       *
     A*           - MAXMBRS(1) specified instead of *NOMAX            *
     A*  CAC001 - Profit Centre Accounting Development:               *
     A*           Additional fields for Analytical Accounting module  *
     A*         S01392 - JAP.SUB-MODULE INCORPORATION (CORE)          *
     A*         S01117 - MULTI BRANCHING                              *
     A*                                                               *
     A*****************************************************************
     A**VERSION**
     A**AB STANDARD DEAL
     A**00.00.01
     A                                      REF(MFRFL)
     A          R ABSTDDP0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*
     A            JURCID    R               REFFLD(RCID)
     A                                      DFT('JU')
     A            JUDLTF    R               REFFLD(DLTF)
     A            JUDLUP    R               REFFLD(DLUP)
     A            JUMLUP    R               REFFLD(MLUP)
     A            JUYLUP    R               REFFLD(YLUP)
     A            JUTLUP    R               REFFLD(TLUP)
     A            JUCHTP    R               REFFLD(CHTP)
     A            JULCD     R               REFFLD(LCD)
     A            JULUID    R               REFFLD(LUID)
     A            JUPCDN    R               REFFLD(DLPC)
     A            JUFD38    R               REFFLD(FD38)
     A            JUSD38    R               REFFLD(SD38)
     A            JUDTYY    R               REFFLD(DTYY)
     A            JUDTMM    R               REFFLD(DTMM)
     A            JUDTDD    R               REFFLD(DTDD)
     A            JUPCTN    R               REFFLD(PCTN)
     A            JUDSTS    R               REFFLD(DSTS)
     A            JUDDLT    R               REFFLD(DDLT)
     A            JUDUSC    R               REFFLD(DUSC)
     A            JULACT    R               REFFLD(LACT)
     A            JULAYY    R               REFFLD(LAYY)
     A            JULAMM    R               REFFLD(LAMM)
     A            JULADD    R               REFFLD(LADD)
     A            JUDDTM    R               REFFLD(DDTM)
     A            JUDFCY    R               REFFLD(DFCY)
     A            JUCDPF    R               REFFLD(CDPF)
     A            JUDMD1    R               REFFLD(DMD1)
     A            JUNDA1    R               REFFLD(NDA1)
     A            JUNDXR    R               REFFLD(NDXR)
     A            JUDSCY    R               REFFLD(DSCY)
     A            JUCDPS    R               REFFLD(CDPS)
     A            JUNDA2    R               REFFLD(NDA2)
     A            JUDBRC    R               REFFLD(DBRC)
     A*                                                      /S01117/
     A************JUMBCD****R               REFFLD(MBCD)
     A            JUMBCA    R               REFFLD(MBCA)
     A*                                                      /S01117/
     A            JUDDYY    R               REFFLD(DDYY)
     A            JUDDMM    R               REFFLD(DDMM)
     A            JUDDDD    R               REFFLD(DDDD)
     A            JUICM1    R               REFFLD(ICM1)
     A            JUIRT1    R               REFFLD(IRT1)
     A            JUINA1    R               REFFLD(INA1)
     A            JUICM2    R               REFFLD(ICM2)
     A            JUIRT2    R               REFFLD(IRT2)
     A            JUINA2    R               REFFLD(INA2)
     A            JUFWPP    R               REFFLD(FWPP)
     A            JUNBCA    R               REFFLD(NBCA)
     A            JUFBCA    R               REFFLD(FBCA)
     A            JUNDYY    R               REFFLD(NDYY)
     A            JUNDMM    R               REFFLD(NDMM)
     A            JUNDDD    R               REFFLD(NDDD)
     A            JUFDYY    R               REFFLD(FDYY)
     A            JUFDMM    R               REFFLD(FDMM)
     A            JUFDDD    R               REFFLD(FDDD)
     A            JUFDA1    R               REFFLD(FDA1)
     A            JUFDA2    R               REFFLD(FDA2)
     A            JUFDXR    R               REFFLD(FDXR)
     A            JUMDTY    R               REFFLD(MDTY)
     A            JUSTYP    R               REFFLD(DLSD)
      * Begin /CSD027/
     A**********  JUDCNO    R               REFFLD(DCNO)                                      CSD027
     A            JUDCNO         6A
     A                                      TEXT('Deal customer number')
     A                                      COLHDG('Deal                ' +
     A                                      'customer            ' +
     A                                      'number')
      * End /CSD027/
     A            JUBRNM    R               REFFLD(BRNM)
     A            JUDDAT    R               REFFLD(DDAT)
     A            JUNDAT    R               REFFLD(DTEN)
     A            JUFDAT    R               REFFLD(DTEF)
     A            JUDLAD    R               REFFLD(DLAD)
     A            JUMACT    R               REFFLD(MACT)
     A            JUNBCD    R               REFFLD(NBCD)
     A            JUFBCD    R               REFFLD(FBCD)
     A            JUNSBC    R               REFFLD(NSBC)
     A            JUFSBC    R               REFFLD(FSBC)
     A            JUNDBA    R               REFFLD(NDBA)
     A            JUNDSA    R               REFFLD(NDSA)
     A            JUFDBA    R               REFFLD(FDBA)
     A            JUFDSA    R               REFFLD(FDSA)
     A*                                                      /S01117/
     A            JULNKN    R               REFFLD(LNKDN)
     A            JUORBR    R               REFFLD(ORBR)
     A            JUFXBC    R               REFFLD(FXBC)
     A            JUMMBC    R               REFFLD(MMBC)
      *                                              Begin /CAC001/
     A            JUPRFC    R               REFFLD(PRFC)
     A                                      TEXT('FX Profit Centre')
      *                                              End   /CAC001/
     A*                                                      /S01117/
     A*                                                      /S01392/
     A            JURDF1    R               REFFLD(JRDFC)
     A            JURDF2    R               REFFLD(JRDFC)
     A*                                                      /S01392/
      *                                              Begin /CAC001/
     A            JUMMPC    R               REFFLD(PRFC)
     A                                      TEXT('MM Profit Centre')
     A                                      COLHDG('MM Profit' +
     A                                             'Centre')
      *                                              End   /CAC001/
     A*                                              Begin /CDL038/
     A            JUCLAS         4A         TEXT('Deal Class')
     A                                      COLHDG('Deal' 'Class')
     A*                                              End   /CDL038/
