      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas AB API int contracts - valid transactions')
      *****************************************************************
      *                                                               *
      *  Midas - Arbitrage Dealing Module                             *
      *                                                               *
      *  PF/ABVINTCPD  - Internal Contracts - Valid Transactions      *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CDL038             Date 10May05               *
      *                 CSD027             Date 23Dec05               *
      *                 222727             Date 05Nov03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CAP004  *CREATE    Date 08Sep98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CDL038 - Extended Deal Sub Type                              *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  222727 - Release 5.0 errors (Valid file not = ABDEALPP)      *
      *  CAP004 - API's Phase 3.                                      *
      *                                                               *
      *****************************************************************
      *
     A                                      REF(MFRFL)
     A          R ABVINTCD0                 TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
 
     A            JURCID    R               REFFLD(RCID)
     A            JUDLTF    R               REFFLD(DLTF)
     A            JUDLUP    R               REFFLD(DLUP)
     A            JUMLUP    R               REFFLD(MLUP)
     A            JUYLUP    R               REFFLD(YLUP)
     A            JUTLUP    R               REFFLD(TLUP)
     A            JUCHTP    R               REFFLD(CHTP)
     A            JULCD     R               REFFLD(LCD)
     A            JULUID    R               REFFLD(LUID)
     A            JUPCDN    R               REFFLD(DLPC)
     A            JUFD38    R               REFFLD(FD38)
     A            JUSD38    R               REFFLD(SD38)
     A            JUDTYY    R               REFFLD(DTYY)
     A            JUDTMM    R               REFFLD(DTMM)
     A            JUDTDD    R               REFFLD(DTDD)
     A            JUPCTN    R               REFFLD(PCTN)
     A            JUDSTS    R               REFFLD(DSTS)
     A            JUDDLT    R               REFFLD(DDLT)
     A            JUDUSC    R               REFFLD(DUSC)
     A            JULACT    R               REFFLD(LACT)
     A            JULAYY    R               REFFLD(LAYY)
     A            JULAMM    R               REFFLD(LAMM)
     A            JULADD    R               REFFLD(LADD)
     A            JUDDTM    R               REFFLD(DDTM)
     A            JUDFCY    R               REFFLD(DFCY)
     A            JUCDPF    R               REFFLD(CDPF)
     A            JUDMD1    R               REFFLD(DMD1)
     A            JUNDA1    R               REFFLD(NDA1)
     A            JUNDXR    R               REFFLD(NDXR)
     A            JUDSCY    R               REFFLD(DSCY)
     A            JUCDPS    R               REFFLD(CDPS)
     A            JUNDA2    R               REFFLD(NDA2)
     A            JUDBRC    R               REFFLD(DBRC)
     A            JUMBCA    R               REFFLD(MBCA)
     A            JUDDYY    R               REFFLD(DDYY)
     A            JUDDMM    R               REFFLD(DDMM)
     A            JUDDDD    R               REFFLD(DDDD)
     A            JUICM1    R               REFFLD(ICM1)
     A            JUIRT1    R               REFFLD(IRT1)
     A            JUINA1    R               REFFLD(INA1)
     A            JUICM2    R               REFFLD(ICM2)
     A            JUIRT2    R               REFFLD(IRT2)
     A            JUINA2    R               REFFLD(INA2)
     A            JUFWPP    R               REFFLD(FWPP)
     A            JUNBCA    R               REFFLD(NBCA)
     A            JUFBCA    R               REFFLD(FBCA)
     A            JUNDYY    R               REFFLD(NDYY)
     A            JUNDMM    R               REFFLD(NDMM)
     A            JUNDDD    R               REFFLD(NDDD)
     A            JUFDYY    R               REFFLD(FDYY)
     A            JUFDMM    R               REFFLD(FDMM)
     A            JUFDDD    R               REFFLD(FDDD)
     A            JUFDA1    R               REFFLD(FDA1)
     A            JUFDA2    R               REFFLD(FDA2)
     A            JUFDXR    R               REFFLD(FDXR)
     A            JUMDTY    R               REFFLD(MDTY)
     A            JUSTYP    R               REFFLD(DLSD)
      * Begin /CSD027/
     A**********  JUDCNO    R               REFFLD(DCNO)                                      CSD027
     A            JUDCNO         6A
     A                                      TEXT('Deal customer number')
     A                                      COLHDG('Deal                ' +
     A                                      'customer            ' +
     A                                      'number')
      * End /CSD027/
     A            JUNBCD    R               REFFLD(NBCD)
     A            JUFBCD    R               REFFLD(FBCD)
     A            JUNSBC    R               REFFLD(NSBC)
     A            JUFSBC    R               REFFLD(FSBC)
     A            JUNDBA    R               REFFLD(NDBA)
     A            JUNDSA    R               REFFLD(NDSA)
     A            JUFDBA    R               REFFLD(FDBA)
     A            JUFDSA    R               REFFLD(FDSA)
     A            JULNKN    R               REFFLD(LNKDN)
     A            JUORBR    R               REFFLD(ORBR)
     A            JUFXBC    R               REFFLD(FXBC)
     A            JUMMBC    R               REFFLD(MMBC)
     A            JUPRFC    R               REFFLD(PRFC)
     A                                      TEXT('FX Profit Centre')
     A            JULRDF    R               REFFLD(JLRDF)
     A            JUDRDF    R               REFFLD(JDRDF)
     A            JUMMPC    R               REFFLD(PRFC)
     A                                      TEXT('MM Profit Centre')
     A                                      COLHDG('MM Profit' +
     A                                             'Centre')
     A            JUDDAT    R               REFFLD(DDAT)
     A            JUNDAT    R               REFFLD(DTEN)
     A            JUFDAT    R               REFFLD(DTEF)
     A            JUDLAD    R               REFFLD(DLAD)
     A            JUMACT    R               REFFLD(MACT)
     A            JUFRNT    R               REFFLD(FOTRNID)
     A            JUAFRT    R               REFFLD(FOTRNID)
                                            TEXT('Associated Front +
                                                  Office Transaction Id')
                                            COLHDG('Associated' +
                                                   'Front Office' +
                                                   'Transaction Id')
     A            JUREPA    R               REFFLD(RPRLOC)
     A            JUTMST    R               REFFLD(TIMESTMP)
      *                                              Begin /222727/
     A            JUOYLC         5          TEXT('Our/Buy Yield Curve')
     A                                      COLHDG('Our/Buy' +
     A                                             'Yield Curve')
      *                                              End   /222727/
     A*                                              Begin /CDL038/
     A            JUCLAS         4A         TEXT('Deal Class')
     A                                      COLHDG('Deal' 'Class')
     A*                                              End   /CDL038/
