      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXI *  TEXT('Midas FF Account movements')
/*E*S****PF_NM*********************************************************                       183902
/*EXS *  PF_NMMXM32                                                   *                       183902
/*EXI *  MBR(OTC)                                                     *
     A*****************************************************************
     A*                                                               *
     A*  Midas   FINANCIAL FUTURES AND OPTIONS MODULE
     A*                                                               *
     A*  PF/FFACMVD  -  FUTURES AND OPTIONS ACCOUNT MOVEMENTS         *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 25Nov05               *
      *  Prev Amend No. CGL029             Date 01Sep03               *
      *                 CRE008             Date 19Feb02               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.03 -----------------------------------------------*
      *                 183902             Date 19Sep00               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*                 E00000             DATE DDMMMYY               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CRE008 - Cash Management                                     *
      *  183902 - Changes creation parameters to MAXMBRS(32)          *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R FFACMVDF
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*
     A            BRCA      R
      * Begin /CSD027/
     A**********  CUSN      R                                                                 CSD027
     A            CUSN           6A
     A                                      TEXT('Customer Number')
     A                                      COLHDG('Cust                ' +
     A                                      'No.')
      * End /CSD027/
     A            CCYD      R
     A**Start of change CGL029
     A**********  ACDE      R                                                                 CGL029
     A            ACDEQQ    R               REFFLD(ACODQQ)
     A**End of change CGL029
     A            ASNC      R
     A*
     A            PTDT      R
     A            VUDT      R
     A            TRYP      R
     A            NRTC      R
     A            NRTD      R
     A            TNMR      R
     A            CQNR      R
     A            MVAM      R
     A            DORC      R
     A*                                              Begin /CRE008/
     A**Start of change CGL029
     A**********  OTRF      R                                                                 CGL029
     A            OTRFQQ        15A
     A**End of change CGL029
     A            XRFI      R               REFFLD(MNTH)
     A                                      TEXT('Extension File Reference ID')
     A                                      COLHDG('Extension' +
     A                                             'File' +
     A                                             'Reference ID')
     A            XRFN      R               REFFLD(CHRN)
     A                                      TEXT('Extension File Reference No.')
     A                                      COLHDG('Extension' +
     A                                             'File' +
     A                                             'Reference Number')
     A*                                              End   /CRE008/
     A**Start of change CGL029
     A            ACDE      R               REFFLD(ACOD)
     A            OTRF          21A
     A**End of change CGL029
