      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FF EXTR - Valid File - LU Window')
      *****************************************************************
      *                                                               *
      *  Midas - Futures and Options Module                           *
      *                                                               *
      *  PF/FFVTNLX1PD - Valid Exchange-Traded Extended Details       *
      *                                                               *
      *  This file has the same layout as FFTRX2PD                    *
      *  (but its field names are prefixed '#6LX')                    *
      *                                                               *
      *  (c) Finastra International Limited 2005                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CER001  *CREATE    Date 25Apr05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CER001 - LUX Upgrade to MidasPlus                            *
      *                                                               *
      *****************************************************************
      *
     A          R FFVTNLXD6                 TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2005')
      *
     A            #6LXFFFOTR    20A         TEXT('Front Office Transaction Id')
      *
     A            #6LXFFTNBR     6S 0       TEXT('Transaction Reference')
     A            #6LXFFTIME     6S 0       TEXT('Time in HHMMSS')
     A            #6LXFFEXFL     1A         TEXT('Extract Flag')
     A            #6LXFFCABR     1A         TEXT('Excluded from CAB Reporting')
      *
