      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FF Instrument types detail')                     *
     A*****************************************************************
     A*                                                               *
     A*  Midas   FINANCIAL FUTURES AND OPTIONS MODULE                 *
     A*                                                               *
     A*  PF/INTYPD  -  INSTRUMENT TYPES (DETAIL)                      *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      *  Last Amend No. CAP208             Date 06Dec10               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 25Nov05               *
      *                 CGP001             Date 23May03               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 CFF007             Date 06Feb01               *
      * Midas DBA 3.05 -----------------------------------------------*
      *                 CFF006             Date 28Nov00               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CPL002             Date 08Mar99               *
      *                 CFF004             Date 11Sep96               *
     A*                  S01235             DATE 20OCT95              *
     A*                  073714             DATE 01MAR95              *
     A*                  S01393             DATE 03AUG92              *
     A*                  FF0010             DATE 21SEP92              *
     A*                  AUS022             DATE 10AUG92              *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  CAP208 - F&O Market Instrument API (Recompile)               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGP001 - Global Processing                                   *
      *           - File now shares format with the global layer      *
      *             equivalent.                                       *
      *  CFF007 - Futures and Options Enhancement for Private Banking *
      *  CFF006 - Fractional Ticks Enhancement.                       *
     A*    CPL002 - Midas-Plato Interface                             *
     A*    CFF004 - Increase in size of Price Fields.                 *
     A*    S01235 - PORTFOLIO MANAGEMENT INTERFACE                    *
     A*    073714 - OTC ENHANCEMENTS                                  *
     A*           - Also changed field ALPF to be externally defined  *
     A*    S01393 - Amended for Strategic Risk Management             *S01393
     A*             to add a field for Underlying Period.             *S01393
     A*                                                               *
     A* FUJI-FF0011 - The system does not differentiate between       *  *
     A*               american and european option on exercise        *  *
     A*               validation and OTC confirmation wording.        *  *
     A*                                                               *  *
     A*   AUS022  -  AUSTRALIAN CHANGE : Add Contract Type - CNTT     *  *
     A*                                                               *  *
     A*****************************************************************
      *                                     Start of Change CGP001
      **********
     A          R INTYPDF                   FORMAT(GZINTYPD)
      *
      *
     A**********                            REF(MFRFL)
     A**********R INTYPDF
     A**********                            TEXT('(c) Misys International +
     A**********                            Banking Systems Ltd. +
     A**********                            2001')
     A**********  RECI      R
     A**********  ISTT      R
     A**********  ISTI      R
     A**********  ISTN      R
     A**********  ISPT      R
     A**********  ISCY      R
     A**********  QOTC      R
     A**********  TKDM      R
     A**********                                             Start of /*CFF004*/
     A*********** MNPF      R
     A**********  MNPF      R               REFFLD(MNPFNW)
     A**********                                             End of   /*CFF004*/
     A**********  TKVL      R
     A**********  DBRK      R
     A**********  BCPT      R
     A**********  BCMC      R
     A**********  BCMS      R
     A**********  BCGP      R
     A**********  BCGS      R
     A**********  CCPT      R
     A**********  CCMC      R
     A**********  CCMS      R
     A**********  CCGP      R
     A**********  CCGS      R
     A**********  CTAM      R
     A**********  CMRF      R
     A**********  OTHC      R
     A**********  STRC      R
     A**********  PRRF      R
     A**********  ULPD      R
     A**********  FTRF      R
     A**********  PUPF      R
     A**********  FTDF      R
     A**********  SEDF      R
     A**********  SPMF      R
     A**********  FTDT      R
     A**********  SETD      R
     A**********  SPDT      R
     A**********  TFPD      R
     A**********  FSPM      R
     A**********  ISMQ      R
     A**********  LCD       R
     A**********  CHTP      R
     A**********  TNLU      R
     A**********                                     Begin /AUS022/
     A**********  CNTT      R
     A**********                                     End   /AUS022/
     A**********                                     Begin /FF0011/
     A**********  AEIN      R               REFFLD(IND)
     A**********                            TEXT('American/European +
     A**********                            option indicator')
     A**********                            COLHDG('Amer.' '/Eur.' )
     A**********                                     End   /FF0011/
     A**********                                     Begin /S01393/
     A**********                                     Begin /073714/
     A************ALPD           5S 0       TEXT('Actual Underlying Period')
     A**********  ALPD      R               REFFLD(UPER)
     A**********                            TEXT('Actual Underlying Period')
     A**********                                     End   /S01393/
     A**********  CCAM      R               REFFLD(AMNT)
     A**********                            TEXT('Counter Amount')
     A**********  CTCY      R               REFFLD(CCY)
     A**********                            TEXT('Counter Currency')
     A**********  FTTM      R               REFFLD(STTM)
     A**********                            TEXT('Final Transaction Time')
     A**********                                     End   /073714/
     A***********                                    Begin /S01235/
     A**********  INNR      R
     A***********                                    End   /S01235/
     A**********                                     Begin /CPL002/
     A**********  PLMIIT         1A
     A**********                            TEXT('Underlying Instrument Type')
     A**********  PLMITM         4A
     A**********                            TEXT('Underlying Term to Maturity')
     A**********  PLMIMD         5P 0
     A**********                            TEXT('Underlying Maturity Date')
     A**********  PLMICP        11P 7
     A**********                            TEXT('Underlying Coupon Rate')
     A**********  PLMICF         1A
     A**********                            TEXT('Underlying Coupon Frequency')
     A**********  PLMIPC         1A
     A**********                            TEXT('Underlying Price Convention')
     A**********  PLMIVT         1A
     A**********                            TEXT('Options Volatility Type')
     A**********  PLMIPM         1A
     A**********                            TEXT('Options Pricing Method')
     A**********  PLMIPG         8A
     A**********                            TEXT('Pricing Group')
     A**********  PLMIRG         8A
     A**********                            TEXT('Reporting Group')
     A**********  PLMICR         4A
     A**********                            TEXT('Credit Rating')
     A**********                                     End   /CPL002/
     A*Start*of*CFF006
     A**********  FRTK           1A         TEXT('Fractional Ticks Ind')
     A**********                            COLHDG('Frac' 'Ticks' 'Ind')
     A*End*of*CFF006
     A**Start*of change CFF007
     A**********  UNSE          10A         TEXT('Underlying Security')
     A**********                            COLHDG('Underlying Security')
     A**********  TECO           3A         TEXT('Economic Sector')
     A**********                            COLHDG('Economic Sector')
     A**********  TNAT           3A         TEXT('Nature Code')
     A**********                            COLHDG('Nature Code')
     A**********  CRIK           2A         TEXT('Country of Risk')
     A**********                            COLHDG('Country of Risk')
     A**********  CCYR           3A         TEXT('Currency of Risk')
     A**********                            COLHDG('Currency of Risk')
     A**********  TWEI           2S 0       TEXT('Weighting Code')
     A**********                            COLHDG('Weighting Code')
     A**End*of*change CFF007
      *                                     End of Change CGP001
