      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas FF Market Control details')
     A*****************************************************************
     A*                                                               *
     A*  Midas   FINANCIAL FUTURES AND OPTIONS MODULE
     A*                                                               *
     A*  PF/MKCTLD  -  MARKET CONTROL DETAILS                         *
     A*                                                               *
     A*  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  PREV AMEND NO. S01456             DATE  08NOV93              *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
     A*      MD046248 - Finastra Rebranding                           *
     A*      S01456  - Monthly P/L enhancements                       *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R MKCTLDF
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            RECI      R
     A            MRKT      R
     A            BUSD      R
     A            ECAI      R
     A            MKCI      R
     A            ICRI      R
     A            ECFI      R
     A            AKMI      R
     A            POBI      R
     A            SMRI      R
     A            LCD       R
     A            CHTP      R
     A            TNLU      R
     A*                                              Begin /S01456/
     A            NXBDT     R               REFFLD(BUSD)
     A                                      TEXT('NEXT BUSINNESS DATE')
     A            EOMCHK    R               REFFLD(EOMI)
     A                                      TEXT('EOM RUN INDICATOR')
     A*                                              End   /S01456/
