      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas DL Cheque trailer file.')
     A**************************************************************
     A*                                                            *
     A*  Midas - Dealing Module
     A*                                                            *
     A*     PF/CHQNOZZ    CHEQUE TRAILER FILE                      *
     A*                                                            *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                            *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  Prev Amend No. S01390             Date 03AUG92               *
     A*                 AUS006             Date 18DEC90               *   AUS006
     A*                                                            *
     A*------------------------------------------------------------*
     A*                                                            *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*     S01390  -  Release 10 Changes for Australianisation    *
     A*     AUS006  -  AUSTRALIAN PRODUCT - INTEREST HISTORY       *      AUS006
     A*                                                            *
     A**************************************************************
     A          R CHQNOZZF
     A***********                                    Begin /S01390/
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A***********                                    End   /S01390/
     A            RECI           1A
     A                                      TEXT('RECORD ID.')
     A                                      COLHDG('RECID ID.')
     A***********                                    Begin /S01390/
     A*********** NCHQ           5P 0
     A            NCHQ           6P 0
     A***********                                    End   /S01390/
     A                                      TEXT('NUMBER OF CHEQUES')
     A                                      COLHDG('NUMBER OF CHEQUES')
     A            TCQA          15P 0
     A                                      TEXT('CHEQUE AMOUNT')
     A                                      COLHDG('CHEQUE AMOUNT')
     A***********                                    Begin /S01390/
     A*********** CCHQ           5P 0
     A            CCHQ           6P 0
     A***********                                    End   /S01390/
     A                                      TEXT('NO. CANCELLED')
     A                                      COLHDG('NO. CANCELLED')
      * Begin /CSD027/
     A**********  CNUM           6S 0                                                         CSD027
     A            CNUM           6A
      * End /CSD027/
     A                                      TEXT('CUSTOMER NUMBER PRINTING')
     A                                      COLHDG('CUST. NO.' 'PRINTING')
     A***********                                    Begin /S01390/
     A*********** LCHQ           5P 0
     A            LCHQ           6P 0
     A***********                                    End   /S01390/
     A                                      TEXT('NO. CHEQUES PRINTED')
     A                                      COLHDG('NO. CHEQUES' 'PRINTED')
      * Begin /CSD027/
     A**********  SCUS           6S 0                                                         CSD027
     A            SCUS           6A
      * End /CSD027/
     A                                      TEXT('START CUSTOMER NUMBER')
     A                                      COLHDG('START' 'CUSTOMER NO.')
      * Begin /CSD027/
     A**********  ECUS           6S 0                                                         CSD027
     A            ECUS           6A
      * End /CSD027/
     A                                      TEXT('END CUSTOMER NUMBER')
     A                                      COLHDG('END' 'CUSTOMER NO.')
