      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas DL Todays Deals Extract Trailer File')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Dealing Module
     A*                                                               *
     A*  DLDTRXTP  - TODAYS DEALS EXTRACT TRAILER FILE                *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*     LAST AMEND NO. S01358             DATE 03MAR92            *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  S01358 - LIST OF TODAYS DEALS                                *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R DLDTRXTF                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            RECI      R
     A            NORE      R
