      *****************************************************************
/*STD *  PFBASE
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas DL FRCD Date Schedule Confirmed Holiday')
      *****************************************************************
      *                                                               *
      *  Midas - Dealing Module                                       *
      *                                                               *
      *  PF/DLFRHOPD - Midas DL FRCD Date Schedule Confirmed Holiday  *
      *                Definition File                                *
      *                                                               *
      *  (c) Finastra International Limited 2005                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CDL033  *CREATE    Date 10Feb05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CDL033 - Floating Rate CDs Issued                            *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R DLFRHOD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2005')
      *
     A            SDATHO01      82A         TEXT('Date Confirmed Holiday x82')
     A                                      COLHDG('Date Confirmed' +
     A                                      'Holiday inds.')
