      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas DL LIMITS EVENTS CREATION FILE-EVLXC')
     A**************************************************************
     A*                                                            *
     A*  Midas - Dealing Module
     A*                                                            *
     A*   PF/EVLXCEE - LIMITS EVENTS CREATION FILE - EVLXC         *
     A*                                                            *
      *  (c) Finastra International Limited 2001                      *
     A*                                                            *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01117             Date 23/05/89              *
     A*                                                            *
     A*------------------------------------------------------------*
     A*                                                            *
      *  MD046248 - Finastra Rebranding                               *
     A*    S01117 - MULTI BRANCHING                                *
     A**************************************************************
     A                                      REF(MFRFL)
     A          R EVLXCEEF                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            RECI      R
     A            DLNO      R
     A*                                                    /S01117/
     A************CNUM      R
     A            CUNR      R
     A*                                                    /S01117/
     A            ETYP      R
     A            EDAT      R
     A            FLTY      R
     A            FLAM      R
     A            FLED      R
     A            FLVD      R
     A            FLRF      R
     A            RLAM      R
     A            LLTY      R
     A            LLAM      R
     A            LLED      R
     A            LLRD      R
     A            LLRF      R
     A            LLSE      R
     A            ZZ072     R
     A            PARI      R
     A            CRNM      R
     A            CTWN      R
     A            CASK      R
     A            ZZ153     R
