      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas DL Ext for Ctry/Reg Limit Rpt - Trl')
     A**************************************************************
     A*                                                            *
     A*  Midas - Dealing Module
     A*                                                            *
     A*   PF/EVLXCEG EVENTS EXTRACT FOR COUNTRY/REGION LIMITS RPRT *
     A*                                                            *
      *  (c) Finastra International Limited 2001                      *
     A*                                                            *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. 218582             Date 06Jun06               *
      *                 236334             Date 06Jan06               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 000000             Date ddMmmyy               *
     A*                                                            *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  218582 - DLC0806 often fails due to FCOOB. Increase NORE     *
      *           field size to 7,0 to prevent DLC0806 from failing.  *
      *           Applied fix 213645.                                 *
      *  236334 - DLC0806 often fails due to FCOOB. Increase NORE     *
      *           field size to 7,0 to prevent DLC0806 from failing.  *
      *           Applied fix 213645.                                 *
      *                                                               *
     A**************************************************************
     A                                      REF(MFRFL)
     A          R EVLXCEGF                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            RECI      R
     A**Start of change 236334
     A**********  NORE      R               REFFLD(NORE4 )
     A            NORE           7S 0
     A**End of change 236334
     A            HRWN      R               REFFLD(HRWN0 )
     A            HRDC      R
     A            ZZ304     R
