      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas Y2 Program status data structure')
      *****************************************************************
      *                                                               *
      *  Synon Shipped Source                                         *
      *                                                               *
      *  PF/Y2PGDSPK - Synon Program Data Structure                   *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CPK002             Date 12May95               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CPK002 - Newly incorporate in R10.6 core                     *
      *                                                               *
      *****************************************************************
     A          R ZZPGDS                    TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            ZZPGM         10          TEXT('*PROGRAM')
     A            ZZSTCD         5S 0       TEXT('*STATUS')
     A            ZZSTCP         5S 0       TEXT('Previous *STATUS')
     A            ZZSQNO         8          TEXT('Source stmt seq. no.')
     A            ZZRTVN         8          TEXT('*ROUTINE')
     A            ZZPMCT         3S 0       TEXT('*PARMS')
     A            ZZMSID         7          TEXT('Exception msgid')
     A            ZZMINB         4          TEXT('MI/ODT number')
     A            ZZMSWK        30          TEXT('Work area for messages')
     A            ZZPGLB        10          TEXT('Program library')
     A            ZZMSDA        80          TEXT('Retrieved exception data')
     A            ZZEXID         4          TEXT('Called program exception')
     A            ZZXX01        26          TEXT('Unused')
     A            ZZERFL         8          TEXT('Name of file in error')
     A            ZZERST        35          TEXT('Status info of last file')
     A            ZZJOB         10          TEXT('Job name')
     A            ZZUSR         10          TEXT('User name')
     A            ZZJNO          6S 0       TEXT('Job number')
     A            ZZEDT          6S 0       TEXT('Job entry date (YMD)')
     A            ZZSDT          6S 0       TEXT('Job exec date (YMD)')
     A            ZZETM          6S 0       TEXT('Job exec time (HHMMSS)')
     A            ZZCPDT         6          TEXT('Date program compiled')
     A            ZZCPTM         6          TEXT('Time program compiled')
     A            ZZCPLV         4          TEXT('Compiler level')
     A            ZZSRFL        10          TEXT('Source file name')
     A            ZZSRLB        10          TEXT('Source library name')
     A            ZZSRMB        10          TEXT('Source member name')
     A            ZZXX04        96          TEXT('Filler')
