      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXI *  MBR(UPFDBATPD) MAXMBRS(3)                                    *
/*EXI *  TEXT('Midas UP Template for DSPFD *BASATR format')
      *****************************************************************
      *                                                               *
      *  Midas - Bridge                                               *
      *                                                               *
      *  PF/UPFDBATPD - Outfile format for DSPFD *BASATR              *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2006            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ---------------- Base -------------------------*
      *  Last Amend No. CPK025  *CREATE    Date 21Jul06               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CPK025 - New utility.                                        *
      *                                                               *
      *****************************************************************
      *
     A          R QWHFDBAS                  FORMAT(QAFDBASI)
      *
      * This file shares the format of the IBM supplied file for DSPFD *BASATR.
     A          K ATFILE
