      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXI *  MBR(UPFDBATPD) MAXMBRS(3)                                    *
/*EXI *  TEXT('Midas UP Template for DSPFD *BASATR format')
      *****************************************************************
      *                                                               *
      *  Midas - Bridge                                               *
      *                                                               *
      *  PF/UPFDBATPD - Outfile format for DSPFD *BASATR              *
      *                                                               *
      *  (c) Finastra International Limited 2006                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ---------------- Base -------------------------*
      *  Prev Amend No. CPK025  *CREATE    Date 21Jul06               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CPK025 - New utility.                                        *
      *                                                               *
      *****************************************************************
      *
     A          R QWHFDBAS                  FORMAT(QAFDBASI)
      *
      * This file shares the format of the IBM supplied file for DSPFD *BASATR.
     A          K ATFILE
