      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXI *  MBR(UPFDATTPD) MAXMBRS(3)                                    *
/*EXI *  TEXT('Midas UP Template for DSPFD *ATR (PF) format')
      *****************************************************************
      *                                                               *
      *  Midas - Bridge                                               *
      *                                                               *
      *  PF/UPACCPTPD - Outfile format for DSPFD *ATR (PF)            *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2006            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Last Amend No. CUP036  *CREATE    Date 22Nov06               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CUP036 - Add automated refreshing for test systems.          *
      *                                                               *
      *****************************************************************
      *
     A          R QWHFDPHY                  FORMAT(QAFDPHY)
      *
      * This file shares the format of the IBM supplied file for the DSPFD *ATR (PF)
     A          K PHFILE
