      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXI *  TEXT('Midas UP Template for DSJOBLOG format')                *
      *****************************************************************
      *                                                               *
      *  Midas - Bridge                                               *
      *                                                               *
      *  PF/UPJOBLTPD - Outfile format for DSPJOBLOG                  *
      *                                                               *
      *  (c) Finastra International Limited 2010                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CUP003  *CREATE    Date 02Aug10               *
      *                 XXXXXX             Date DDMmmYY               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CUP003 - New template for outfile.                           *
      *                                                               *
      *****************************************************************
      *
     A          R QMHPFT                    FORMAT(QAMHJLPR)
      *
      * This file shares the format of the IBM supplied file for the DSPJOBLOG.
      * It is keyed on message ID.
     A          K QMHMID
