      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXI *  TEXT('Midas UP Copy data from one library to another')
/*E*S ***PF_STD********************************************************                     /CPK014/
/*EXS *  PF_NM                                                        *                     /CPK014/
      *****************************************************************
      *                                                               *
      *  Midas - Upgrade Module                                       *
      *                                                               *
      *  PF/UPNOTFPD - Objects not moved between libraries            *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CPK021  *MOVED     Date 24Aug04               *
      * Midas Release 4 --------------- Base -------------------------*
      *  Prev Amend No. CPK014             Date 05Nov01               *
      * Midas DBA 3.01 -----------------------------------------------*
      *                 CPK010 *CREATE     Date 30Sep99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CPK021 - Moved to global layer.                              *
      *  CPK014 - Allow more than one member.                         *
      *  CPK010 - New function for CPYDBLIB.                          *
      *                                                               *
      *****************************************************************
     A          R QLIDOBJD                  FORMAT(QADSPOBJ)
      *
     A          K ODOBNM
     A          K ODOBTP
