      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas UP File for recompile check - for OPNQRYF')
     A*****************************************************************
      *                                                               *
      *  Midas - Upgrade Module                                       *
      *                                                               *
      *  PF/UPRCP2QF - Recompile check - for OPNQRYF                  *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSM005  *MOVED     Date 26Sep05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CUP001 *CREATE     Date 01Jan99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSM005 - Changes to libraries for MidasPlus.                 *
      *  CUP001 - Introduction of BRIDGE                              *
      *                                                               *
      *****************************************************************
     A          R UPRCP2D0
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            R2FNAM        10A         TEXT('File')
     A                                      COLHDG('File')
     A            R2LIB         10A         TEXT('Library')
     A                                      COLHDG('Library')
     A            R2PNAM        10A         TEXT('Program')
     A                                      COLHDG('Program')
     A            R2TEXT        50A         TEXT('Text')
     A                                      COLHDG('Text')
     A            R2OTYP        10A         TEXT('Object type')
     A                                      COLHDG('Obj. Type')
