      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas UP File for shared formats - for OPNQRYF')
     A*****************************************************************
      *                                                               *
      *  Midas - Upgrade Module                                       *
      *                                                               *
      *  PF/UPSFMTQF - Shared format file - used for OPNQRYF          *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CUP001 *CREATE     Date 30Dec98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CUP001 - Introduction of BRIDGE                              *
      *                                                               *
      *****************************************************************
     A          R UPSFMTD0
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            SFSRCF        10A         TEXT('Source file')
     A                                      COLHDG('Source' +
     A                                      'file')
     A            SFMBNM        10A         TEXT('Member')
     A                                      COLHDG('Member')
     A            SFLIB1        10A         TEXT('Library')
     A                                      COLHDG('Library')
     A            SFNAME        10A         TEXT('Format')
     A                                      COLHDG('Format')
     A            SFFILE        10A         TEXT('File with shared +
     A                                      format')
     A                                      COLHDG('File' 'w/shrd' +
     A                                      'format')
     A            SFLIB2        10A         TEXT('Library')
     A                                      COLHDG('Library')
