      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas UP UDF extension files to be copied')
      *****************************************************************
      *                                                               *
      *  Midas - Upgrade Module                                       *
      *                                                               *
      *  PF/UPUDFUPD - UP UDF extension files to be copied            *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2004            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. BG8399  *CREATE    Date 05Sep05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  BG8399 - Aid to the migration of UDF Extension files         *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R UPUDFUD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2004')
     A            FUFILE        10A         TEXT('UDF Extension File Name')
     A            FULEN          5  0       TEXT('Format Length')
     A            FULIB         10A         TEXT('Library Name')
      *
