/*STDA*  DSPFBASE
/*EXI *  TEXT('PL Manual Download Request')
     A**************************************************************************
      *
      *  Midas - Bank of England
      *
      *  DSPF/BY7020DF - BoE Facility Extract Detail Maintenance
      *
      *  (c) Finastra International Limited 1997
      *
      *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. LLN021  *CREATE    Date 24Nov03               *
      *                 XXXXXX             Date DDMmmYY               *
      *=========================================================================
      *
      *  Amendment Details
      *  ~~~~~~~~~~~~~~~~~~
      *  MD046248 - Finastra Rebranding                               *
      *  LLN021 - BoE Profit and Loss return                          *
      *
      **************************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CA03(03 'Exit')
     A                                      PRINT
     A*
     A** Initial Display Screen
     A          R BY7020F1
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      1997')
     A                                      OVERLAY
     A                                  2 72TIME
     A            L#WSID        10A  O  1 71TEXT('Workstation Id')
     A                                  1 67'WID'
     A            L#PGM         10A  O  1  3TEXT('Program name')
     A                                  1 34'MIDAS'
     A                                  2 28'P&L Manual Download'
     A                                 10 24'BOE PL MANUAL DOWNLOAD REQUESTED'
     A                                      DSPATR(HI)
     A                                 16 34'CONTINUE................... Y/N'
     A            L#OPT          1A  B 16 69VALUES(' ' 'Y' 'N')
     A                                 22  2'F3=Exit'
      *
      ** Message subfile
     A          R #MSGRCD                   TEXT('Program messages')
     A                                      SFL SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            L#PGMQ                    SFLPGMQ
      *
      ** Message subfile control
     A          R #MSGCTL                   TEXT('Program messages')
     A                                      SFLCTL(#MSGRCD)
     A                                      SFLPAG(01) SFLSIZ(03)
     A                                      OVERLAY PUTOVR
     A                                      SFLINZ SFLDSP SFLDSPCTL
     A  25
     AON25                                  SFLEND
     A            L#PGMQ                    SFLPGMQ
