      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas DL Cheque details file.')
     A**************************************************************
     A*                                                            *
     A*  Midas - Dealing Module
     A*                                                            *
     A*     LF/CHQNO      CHEQUE DETAILS FILE                      *
     A*                                                            *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                            *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  Prev Amend No. S01390             Date 03AUG92               *  AUS006
     A*                 AUS006             Date 18DEC90               *  AUS006
     A*                                                            *
     A*------------------------------------------------------------*
     A*                                                            *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*     S01390  -  Release 10 Changes for Australianisation    *
     A*     AUS006  -  AUSTRALIAN PRODUCT - INTEREST HISTORY       *      AUS006
     A*                                                            *
     A**************************************************************
     A          R CHQNOAAF                  PFILE(CHQNOAA)
     A**********                                     Begin /S01390/
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A**********                                     End   /S01390/
     A*
     A          K CNUM
