      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_RB                                                        *
/*EXI *  TEXT('Midas DL Cust deals by branch - FX &L/D only')         *
     A**************************************************************
     A*                                                            *
     A*  Midas - Dealing Module
     A*                                                            *
     A*   LF/CUSDB      CUSTOMER DEALS BY BRANCH - FX & L/D ONLY   *
     A*                                                            *
      *  (c) Finastra International Limited 2001                      *
     A*                                                            *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CDL099             Date 06Oct17               *
      *                 CGL165             Date 17Feb15               *
      *                 CDL096             Date 22Sep14               *
      *                 CDL094             Date 30May14               *
      *                 CTI006             Date 31Mar14               *
      *                 CSW212             Date 03May12               *
      *                 CRE073             Date 06Dec10               *
      *                 CER059             Date 19Jul10               *
      *                 CER054             Date 07Apr09               *
      *                 CER048             Date 19May08               *
      *                 CER020             Date 19May08               *
      *                 CER043             Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CDL049             Date 05Jul06               *
      *                 CDL038             Date 10May05               *
      *                 233324             Date 02May05               *
      *                 CSD027             Date 05Dec05               *
      *                 CDL033             Date 10Feb05               *
      *                 CAS009             Date 04May04               *
      *                 BUG3644            Date 12Jul04               *
      *                 CGL014             Date 20Oct03               *
      *                 CDL019             Date 03Feb04               *
      *                 CDL018             Date 03Feb04               *
      *                 CDL017             Date 03Feb04               *
      *                 CDL016             Date 03Feb04               *
      *                 CGL029             Date 01Sep03               *
      *                 CAS005             Date 16Dec02               *
      *                 CAS004             Date 26Jun02               *
      * Midas Release 4.01 -------------------------------------------*
      *                 CAS001             Date 23Nov01               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      *                 CDL008             Date 02May00               *
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CGL011             Date 20Sep99               *
      *                 CAP051             Date 08Nov99               *
     A*                 CDL007             Date 04Oct99               *
     A*                 CPB001             Date 01Jun99               *
      * Midas DBA 3.01 -----------------------------------------------*
      *                 CDL006             Date 26Apr99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CEU015             Date 19Jun98               *
      *                 CEU003             Date 05Nov97               *
     A*                 CDL002             Date 17Sep97               *
     A*                 CAC001             Date 01Feb96               *
     A*                 S01486             Date 06Jun94               *
     A*                 S01453             Date 10Dec93               *
     A*                   S01440              DATE  24AUG93        *
     A*                   S01434              DATE  26JUL93        *
     A*                   S01392              DATE  20JUL92        *
     A*                   S01383              DATE  27APR92        *
     A*                   S01177              DATE  03/11/88       *
     A*                   E22405              DATE  14AUG90        *
     A*                   S01117              DATE  16/02/89       *
     A*                   E15007              DATE  10/09/88       *
     A*                                                            *
     A**************************************************************
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CDL099 - Split Value Date (Recompile)                        *
      *  CGL165 - Dual Withholding Tax (Recompile)                    *
      *  CDL096 - Business Day Conventions on MM Deals                *
      *           (Recompile)                                         *
      *  CDL094 - Enhance Receive Settlement Instructions (Recompile) *
      *  CTI006 - Trade Finance BF Midas 2.2 Interface (Recompile)    *
      *  CSW212 - SWIFT 2012 Changes (Recompile)                      *
      *  CRE073 - Interest Rate Rounding (Recompile)                  *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER054 - German Features - Church Tax (Recompile)            *
      *  CER048 - German Features - Taxes (Recompile)                 *
      *  CER020 - Enhanced Rollover Window: Upgrade FGE089 to         *
      *           Midas Plus (Recompile)                              *
      *  CER043 - German Features LF041-00 New Fields and Defaulting  *
      *           (Recompile)                                         *
      *  CDL049 - Addition of a Reference Rate field (recompile)      *
      *  CDL038 - Extended Deal Sub Type (Recompile)                  *
      *  233324 - Add new fields in DEALSDC for EU Tax (Recompile).   *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CDL033 - Floating Rate CDs Issued (Recompile)                *
      *  CAS009 - Effective Interest Rate/Amortised Cost Accounting   *
      *           (Recompile)                                         *
      *  BUG3644 - Serious Error in Collateralised Lending (Recompile)*
      *  CGL014 - Collaterals Processing (Recompile)                  *
      *  CDL019 - Allow Base Rate Changes on Fixed Deposits/Loans     *
      *           (Recompile)                                         *
      *  CDL018 - Multiple Settlement Accounts on Loans/Deposit       *
      *           (Recompile)                                         *
      *  CDL017 - Penalty Fee & Early Maturity of Fixed Term Loan/Dep *
      *           (Recompile)                                         *
      *  CDL016 - Automatic Rollover of Fixed Term Loan/Deposit       *
      *           (Recompile)                                         *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CAS005 - Enhancements to CAS001, CAS002 and CAS004           *
      *           (Recompile)                                         *
      *  CAS004 - Hedge Accounting Phase A (Recompile)                *
      *  CAS001 - Net Present Value (NPV) Accounting                  *
      *           (Recompile)                                         *
      *  CDL008 - Continuous Linked Settlement (Recompiled)           *
      *  CGL011 - Collateral Processing for Midas. Recompile.         *
     A*  CAP051 - Automatic Authorisation (MM and FX Part)            *
     A*           Recompiled due to changes in DEALSDC and DEALSDB    *
     A*  CDL007 - Deposit Breakdown Penalty                           *
     A*           Recompiled due to changes in DEALSDC                *
     A*  CPB001 - Meridian DBA Middleware Replication Customization.  *
     A*           Recompiled due to changes in DEALSDB and DEALSDC.   *
      *  CDL006 - Dealing Fiduciary. Recompiled.                      *
     A*  CEU015 - EMU Enhanced Money Market Deal Rollover             *
     A*           Recompiled only.                                    *
     A*  CEU003 - EMU Dealing Settlement Ccy Conversion (Recompile)   *
     A*  CDL002 - FX Netting - Recompiled Only.                       *
     A*  CAC001 - Profit Centre Accounting Development:               *
     A*           Recompiled only.                                    *
     A*     S01486 - Portfolio Management Upgrade(RECOMPILE)       *
     A*     S01453 - Margin and FX Positions/Points - Recompile    *
     A*     S01440 - Recompiled - GCPCAP and GCSCAP added to DEALSDB
     A*     S01434 - Recompiled - Enhanced Rollovers               *
     A*     S01392 - RECOMPILED DUE TO JAP.SUB-MODULE INCORPORATION*
     A*     S01383 - RECOMPILED DUE TO BASIC RATE TAX INCORPORATION*
     A*     S01177 - RECOMPILED DUE TO EXTENDED SETTLEMENTS        *
     A*     E22405 - RECOMPILED FOR COVER MT202 CHANGES            *
     A*     S01117   -   MULTIBRANCHING                            *
     A*     E15007   -   AMENDED TO OMIT RECI TYPES 'N' FOR DB     *
     A*                                                            *
     A**************************************************************
     A          R DEALSDBF                  PFILE(DEALSDB)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*                                                  /S01117/
     A**********K BRCD
     A          K BRCA
     A*                                                  /S01117/
     A          K CNUM
     A          K SLCY
     A          O RECI                      CMP(EQ '*')
     A          O RECI                      CMP(EQ 'M')
     A**                                                   /E15007/
     A          O RECI                      CMP(EQ 'N')
     A**                                                   /E15007/
     A*
     A          R DEALSDCF                  PFILE(DEALSDC)
     A*                                                  /S01117/
     A**********K BRCD
     A          K BRCA
     A*                                                  /S01117/
     A          K CNUM
     A          K CCY
     A          O RECI                      CMP(EQ '*')
     A          O RECI                      CMP(EQ 'M')
     A          O RECI                      CMP(EQ 'N')
     A*
