      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas DEALSGX0 LF keyed to Deal No.')                  *
      *****************************************************************
      *                                                               *
      *  Midas - Dealing                                              *
      *                                                               *
      *  LF/DEALSGY0 - Midas DEALSDC Extension File keyed to DLNO     *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2016            *
      *                                                               *
      *  Last Amend No. LUC109 *Create     Date 21Sep16               *
      *  Prev Amend No. Xxxxxx             Date ddMmmyy               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  LUC109 - HO Reporting (Upgrade to FB Midas 2.1)              *
      *                                                               *
      *****************************************************************
     A          R DEALGFX0                  TEXT('(c) Misys International +
     A                                      Banking Systems 2016')
     A                                      PFILE(DEALSGX0)
     A          K MDLNO
