      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('DL Cons Deal Amendments - Extract file')               *
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  LF/DLDABRL0 - DL Cons Deal Amendments - Extract file         *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2008            *
      *                                                               *
      *  Last Amend No. CER059             Date 19Jul10               *
      *  Prev Amend No. CER040  *CREATE    Date 19May08               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER040 - Consolidated MM Deal Confirmation Correspondence    *
      *                                                               *
      *****************************************************************
      *
     A          R DLDABRD0                  PFILE(DLDABRPD)
     A                                      TEXT('(c) Misys +
     A                                      International Banking +
     A                                      Systems Ltd. 2008')
      *
     A          K FBRCA
     A          K FDLNO
     A          K FVDAT
     A          K FDASN
      *
     A          R DAMBRDIF                  PFILE(DAMBRDI)
      *
     A          K BRCA
     A          K DLNO
     A          K VDAT
     A          K DASN
