      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas DL FRCD Date Sched-unprocessed paymnt')
      *****************************************************************
      *                                                               *
      *  Midas - Dealing Module                                       *
      *                                                               *
      *  LF/DLFRSCL3 - Floating Rate CD Issued Date Schedule          *
      *                (unprocessed interest payment dates)           *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2005            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CDL033  *CREATE    Date 10Feb05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CDL033 - Floating Rate CDs Issued                            *
      *                                                               *
      *****************************************************************
      *
     A          R DLFRSCD0                  PFILE(DLFRSCPD)
      *
     A          K HHDLNO
     A          K HHRCIP
     A          K HHPRDT
      *
     A          O HHRCIP                    COMP(NE 'P')
     A          O HHDTPR                    COMP(EQ 'Y')
