      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas DL DLGHISPD By: Our Pay Acct/Ccy/Our PayBrch')   *
      *****************************************************************
      *                                                               *
      *  Midas - Dealing Module                                       *
      *                                                               *
      *  LF/DLGHISL3 - Midas DL DLGHISPD By: Our Pay Account/Ccy/Our  *
      *                Pay Branch                                     *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2010            *
      *                                                               *
      *  Last Amend No. BUG28033 *CREATE   Date 12Aug10               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  BUG28033 - Add missing files in ATU                          *
      *                                                               *
      *****************************************************************
     A          R DLGHISD0                  PFILE(DLGHISPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2010')
     A          K UPACC
     A          K UCUCY
     A          K POBR
      *
     A          S PSETM                     VALUES(04 05 14)
      *
