      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas Deal interest history logical')                  *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  LF/HISTSL0 - Deal interest history logical                   *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2016            *
      *                                                               *
      *  Last Amend No. MD039268 *CREATE   Date 30Aug16               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD039268 - Interest incorrect after term deposit penalty     *
      *             termination. Enabled dealing history processing.  *
      *             Dealing history file was used to compute the      *
      *             correct penalty interest.                         *
      *                                                               *
      *****************************************************************
      *
     A          R HISTSAAF                  PFILE(HISTSAA)
     A                                      TEXT('(c) Misys +
     A                                      International Banking +
     A                                      Systems Ltd. 2016')
      *
     A          K DLNO
     A          K EDAT
     A          K RTYP
      *
     A          S RTYP                      CMP(EQ 'LD')
     A          S RTYP                      CMP(EQ 'PI')
     A          S RTYP                      CMP(EQ 'PD')
      *
