      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_DL                                                        *
/*EXI *  TEXT('Midas DL Usd by TM3200, FF trades past settlement')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Treasury Management
     A*                                                               *
     A*   DLINRALL - Interest rate futures                            *
     A*              Used by TM3340, Takeon non MM trades to MM       *
     A*              forward book                                     *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      *                 CAP086             Date 08Jun05               *
      *                 217684             Date 12May03               *
      * Midas Release 4.01 -------------------------------------------*
      *                 CAS002             Date 14Jan02               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 CFF007             Date 12Feb01               *
      * Midas DBA 3.02 -----------------------------------------------*
      * Midas DBA 3.01 Patch E ---------------------------------------*
      *                 170520             Date 12Nov99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CSW097             Date 20May99               *
     A*                 CPL002             Date 08MAR99               *
      *                 CAP003             Date 31Jul98               *
     A*                 CFF003             Date 11Apr97               *
     A*                 CAC003             Date 25Feb97               *
     A*                  CFF004            Date  11Sep96              *
     A*                  077485            Date  18Nov95              *
     A*                  S71062            DATE  18NOV95              *
     A*                  073714            DATE  01MAR95              *
     A*                  S01486            DATE  06JUN94              *
     A*                  S01411            DATE  08APR93              *
     A*                                                               *
     A********************************************************************
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CAP086 - Introduce Auto Authorisation to the API's           *
      *           without it. (Recompile)                             *
      *  217684 - Authorisation User Malfunction (Recompile)          *
      *  CAS002 - Hedge Strategy/Linkage (Recompile)                  *
      *  CFF007 - Futures and Options Enhancement for Private Banking *
      *           (Recompile.)                                        *
      *  170520 - Re-compiled over changed physical file.             *
     A*  CSW097 - SWIFT 1997 Changes for FRAIRS MT34* and MT36*.      *
     A*           Recompiled over changed DEALSDG.                    *
     A*  CPL002 - Midas-Plato Interface (Recomplied)                  *
      *  CAP003 - Recompiled for conversion of Midas inputs to APIs   *
     A*  CFF003 - Enhanced OTC Processing - Phase II(RECOMPILE ONLY)  *
     A*           Upgrade from BLI LBL001                             *
     A*  CAC003 - Profit Centre Accounting Development Phase 3:       *
     A*           Recompiled due to changes in TRANSD.                *
     A*  CFF004 - Increase in size of Price Fields - RECOMPILE ONLY.  *
     A*  077485 - FF/PM INTERFACE: MATURE FLAT POSITIONS NOT EXTRACTED*
     A*           FOR FF TRADES (JUST RECOMPILED)                     *
     A*  S71062 - FF/PM INTERFACE.                                    *
     A*           RECOMPILED DUE TO NEW FIELDS ON PF/TRANSD           *
     A*  073714 - OTC ENHANCEMENTS (FILE RECOMPILED)                  *
     A*  S01486 - Portfolio Management Upgrade(RECOMPILE)             *
     A*  S01411 - RECOMPILED BECAUSE 'ORIGINAL ENTRY DATE' HAS BEEN   *
     A*           ADDED TO TRANSD.                                    *
     A*                                                               *
     A*   NEW FILE FOR S01280 - INCLUDE FRA/IRS, FF, LE INTO MM TM    *
     A*****************************************************************
     A          R DLINRAP0                  PFILE(TRANSD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A            ISTTA                     RENAME(ISTT)
     A            YRNOA                     RENAME(YRNO)
     A            MTHNA                     RENAME(MTHN)
     A            BOKCA                     RENAME(BOKC)
     A            TNBRA                     RENAME(TNBR)
     A            CUSCA                     RENAME(CUSC)
      *
      ** Key equivalent to lf/DLAMTDLL
     A          K ISTTA
     A          K YRNOA
     A          K MTHNA
     A          K BOKCA
