      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_DL                                                        *
/*EXI *  TEXT('Midas DL Logical on DLTCSTPD, on DLNO, ORED, NIDT')
      *****************************************************************
      *                                                               *
      *  Midas - Dealing Module                                       *
      *                                                               *
      *  LF/DLTCSTV4 - Time/Call Deposits Interest File               *
      *                                                               *
      *  (c) Finastra International Limited 2003                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CDL012  *CREATE    Date 13Aug03               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CDL012 - Interest Statements for Time/Call Deposits          *
      *                                                               *
      *****************************************************************
     A          R DLTCSTP0                  PFILE(DLTCSTPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2003')
      *
     A            GDLNO2                    RENAME(GDLNO)
     A            GORED2                    RENAME(GORED)
     A            GNIDT2                    RENAME(GNIDT)
      *
     A          K GDLNO2
     A          K GORED2
     A          K GNIDT2
