      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_DL                                                        *
/*EXI *  TEXT('Midas DL Merged events file used by DL0740')           *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Dealing Module                                       *
     A*                                                               *
     A*  LF/EVNTML5 - MERGED EVENTS FILE USED BY DL0740               *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      *  Last Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. BUG12902           Date 15Dec06               *
      *                 CSD027             Date 05Dec05               *
      *                 CLE042             Date 06Sep05               *
      *                 CDL038             Date 10May05               *
      *                 CLE025             Date 20Oct03               *
      *                 CGL029             Date 01Sep03               *
      *                 218992             Date 17Jul03               *
      *                 CGL015             Date 15Apr02               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.03 -----------------------------------------------*
      *                 151495             Date 25Sep00               *
      * Midas DBA 3.02 -----------------------------------------------*
      *                 163486             Date 13Oct99               *
      * Midas DBA 3.01 -----------------------------------------------*
      *                 CDL006             Date 26Apr99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CEU004             Date 02Feb98               *
      *                 CEU003             Date 05Nov97               *
     A*                 CLE005             Date 22May97               *
     A*                 CLE004             Date 02Dec96               *
     A*                 CAC001             Date 01Feb96               *
     A*                 S01486             Date 06Jun94               *
     A*                 S01434             Date 27Jul93               *
     A*                 S01378            DATE 15OCT92                *
     A*                 S01393            DATE 28JUN90                *
     A*                 S01392            DATE 20JUL92                *
     A*                 S01354            DATE 09JAN92                *
     A*                 S01328            DATE 02APR91                *
     A*                 BHF420            DATE 04SEP90                *
     A*                 S01274            DATE 14JUN90                *
     A*                 S01243            DATE 05MAR90                *
     A*                 S01196            DATE 05MAR90                *
     A*                 E18751            DATE 25APR90                *
     A*                 E200              DATE 3APR90                 *
     A*                 E20               DATE 2MAR90                 *
     A*                 S01117            DATE 23/05/89               *
     A*                 S01153            DATE 06/07/88               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  CLE148 - Alpha Loan Reference (Recompile)                    *
      *  BUG12902 - DLC0806 failed due to FOOB.                       *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CLE042 - Extended Loan Sub Type                              *
      *  CDL038 - Extended Deal Sub Type                              *
      *  CLE025 - Credit Lines (Recompile)                            *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  218992 - Add Extended settlement fields in LVENTEL(recompile)*
      *  CGL015 - Net Amounts on Events by Nostro (Recompiled)        *
     A*  151495 - File out of balance in DL0760AP1 report due to      *
     A*           to event type found in EVLSX used by DL0760A but    *
     A*           missing in EVNTML5 used by DL0740.                  *
      *  163486 - Added IFXC and new SIAC field in LVENTEL.           *
      *  CDL006 - Dealing Fiduciary. Recompiled.                      *
     A*  CEU004 - LE Settlement Ccy Conversion Upgrade to DBA R2.0    *
     A*           Recompiled due to changes in file LVENTEL.          *
     A*  CEU003 - EMU Dealing Settlement Ccy Conversion               *
     A*  CLE005 - Customer Lending Enhancements - Tranche 3           *
     A*  CLE004 - Customer Lending Enhancements - Syndications        *
     A*           Recompiled due to changes in file LVENTEL.          *
     A*  CAC001 - Profit Centre Accounting Development:               *
     A*           Recompiled only.                                    *
     A*   S01486 -  Portfolio Management Upgrade                      *
     A*   S01434 -  Recompiled - Enhanced Rollovers                   *
     A*                                                               *
     A*   S01378 -  NA parcels. Allows partial sale of a parcel
     A*             of NA's which have previously been entered as
     A*             a single NA purchased transaction. (was MOF53)
     A*             Recompile over changed EVNTXED format.
     A*  S01393 - Recompiled for Strategic Risk Management            *
     A*  S01392 - RECOMPILED DUE TO JAP.SUB-MODULE INCORPORATION      *
     A*  S01354 - Ignore Internal Funding Deals                       *
     A*  S01328 - FRA/IRS Revaluations - New fields added to EVNTXED  *
     A*           Remove ZZ005 and recompile all logicals.            *
     A*  BHF420 - RECOMPILE FOR LVENTEL                               *
     A*  S01274 - REMOVE EVENTS PROCESSING FOR SECURITIES TRADING I   *   S01274
     A*           AND SYNDICATED LOANS                                *   S01274
     A*  S01243 - INCLUDE EVENTS FOR PRINCIPAL INCREASES ON           *
     A*           TERM LOANS                                          *
     A*  S01196 - REMOVE LETTERS OF CREDIT EVENTS                     *
     A*  E18751 - EXTENDING LIST OF EVENT TYPES USED FOR SELECTION    *
     A*           CRITERIA OF LOGICAL EVNTML5 OVER PHYSICAL EVNTXED.  *
     A*  E200   - IGNORE MULTIBRANCHING EVENTS                        *
     A*  E20    - CHANGE CRT PARM  MAINT TO *DLY                      *
     A*  S01117 - MULTI BRANCHING                                     *
     A*  S01153 - CLOSE OF BUSINESS IMPROVEMENTS - ADDITION OF        *
     A*           CHANGES FOR S01119 - BASE RATE TYPE FIELD ADDED     *
     A*           FOR FRA/IRS.                                        *
     A*                                                               *
     A*****************************************************************
     A*
     A*
     A*
     A          R EVNTXECF                  PFILE(EVNTXEC)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K RECI
     A          R EVNTXEDF                  PFILE(EVNTXED)
     A            RECI
     A            DLNO
      *                                                  /S01117/
     A*********** CNUM
     A            CUNR
      *                                                  /S01117/
     A            ETYP
     A            EDAT
     A            EAMT
     A            ECCY
     A            ECSS
     A            DTYP
     A            DLST
      *                                                  /S01117/
     A*********** BRCD
     A**********  BRCA
     A            EBRC
      *                                                  /S01117/
     A            EXRT
     A            NGII
     A            NOTD
     A            OTHD
     A            OTHA
     A            OTHC
     A            DBCE
     A            BCEQ
     A            DBCR
     A            LCEQ
     A            SETP
     A            OSAC                      CONCAT(OSAC1 OSAC2)
     A            TSEN
     A            ZZ003
     A            FIPI
     A            INOI
     A            FCTI
     A            RLVI
     A            PTNU
      *                                                  /S01117/
     A*********   CPAR
     A            PARI
      *                                                  /S01117/
     A            CRNM
     A            CTWN
     A            CASK
     A            PRNM
     A            PTWN
     A            PASK
     A            CCTZ
     A            CLOC
     A            REGC
     A            DASN
     A            FFVD
     A            FFIN
     A            FACT
     A            FCNO
     A            FACO
     A            SPI
     A            CPCN
     A            FSLI
     A            ICIR
     A            ICAM
     A            RBDA
     A            OCFF
      *                                                    /S01117/
     A************ZZ023
     A            ORBR
     A            COOB
     A            ECPY
     A            IBRE
     A            ICYE
     A            EXEI
     A            ELVB
     A            ELVC
     A            ELVS
     A            OSBR
      *                                           /Start    S01328/
     A************ZZ005
      *                                           /End      S01328/
      *                                                    /S01117/
     A            TAXI
      *                                              Begin /S01486/
     A            PTFR
      *                                              End   /S01486/
     A*                                              Begin /CEU003/
     A            IFXS
     A            SIAC
     A*                                              End   /CEU003/
     A*                                              Begin /CDL038/
     A            CLAS
     A*                                              End   /CDL038/
     A          K *NONE
     A          K ECCY
     A          K EDAT
     A          K ETYP
      *                                                   /S01153/
     A**********S ETYP                      VALUES('11V1' '12V1'  +
     A***********                           '13V1' '14V1' '15M1' '17M1' '17S1' +
     A***********                           '30P1' '30S1' '30C1' '30C2' '30A1' +
     A***********                           '30D1' '30D2' '30M1' '30M2' '41M1' +
     A***********                           '41M3' '41R1' '41R3' '41R4' '42M1' +
     A***********                           '61R1' '61M1' '62M1' '62R1' '63M1' +
     A***********                           '64R1' '64M1' '65M1' '66R1' +
     A***********                           '66M1' '67M1' '61V3' '80M1' '81D1' +
     A***********                           '81M1' '81M3' '82A1' '82M1' '84V1' +
     A***********                           '84V2')
     A          S ETYP                      VALUES('11V1' '12V1' +
     A                                      '13V1' '14V1' '15M1' +
     A                                      '17M1' '17S1' '30P1' +
     A                                      '30S1' '30C1' '30C2' +
     A                                      '30A1' '30D1' '30D2' +
     A                                      '30M1' '30M2' '41M1' +
     A                                      '41M3' '41R1' '41R3' +
     A                                      '41R4' '42M1' '61R1' +
     A                                      '61M1' '62M1' '62R1' +
     A                                      '63M1' '64R1' '64M1' +
     A                                      '65M1' '66R1' '66M1' +
     A                                      '67M1' '61V3' '80M1' +
     A                                      '81D1' '81M1' '81M3' +
     A                                      '82A1' '82M1' '84V1' +
     A                                      '84V2' '21E1' '22E1' +
      *                                                     /E18751/
     A***********                           '23E1' '24E1' )
     A                                      '23E1' '24E1' '15V1' +
     A                                      '17V1')
      *                                                     /E18751/
      *                                                     /S01153/
     A*                                              BEGIN /S01354/
     A            DTYP                      COMP(NE 'IL')
     A*                                              END   /S01354/
      *                                                     /E200/
     A            IBRE                      COMP(EQ 'N')
      *                                                     /E200/
     A          O                           ALL
      *                                                     /S01274/
     A**********R CEVNXCCF                  PFILE(CEVNXCC)
     A**********K *NONE
     A**********K ECCY
     A**********K EDAT
     A**********K ETYP
      *                                                     /S01274/
      *                                                     /S01153/
     A**********S ETYP                      VALUES('11V1' '12V1'  +
     A***********                           '13V1' '14V1' '15M1' '17M1' '17S1' +
     A***********                           '30P1' '30S1' '30C1' '30C2' '30A1' +
     A***********                           '30D1' '30D2' '30M1' '30M2' '41M1' +
     A***********                           '41M3' '41R1' '41R3' '41R4' '42M1' +
     A***********                           '61R1' '61M1' '62M1' '62R1' '63M1' +
     A***********                           '64R1' '64M1' '65M1' '66R1' +
     A***********                           '66M1' '67M1' '61V3' '80M1' '81D1' +
     A***********                           '81M1' '81M3' '82A1' '82M1' '84V1' +
     A***********                           '84V2')
      *                                                     /S01274/
     A**********S ETYP                      VALUES('11V1' '12V1' +
     A**********                            '13V1' '14V1' '15M1' +
     A**********                            '17M1' '17S1' '30P1' +
     A**********                            '30S1' '30C1' '30C2' +
     A**********                            '30A1' '30D1' '30D2' +
     A**********                            '30M1' '30M2' '41M1' +
     A**********                            '41M3' '41R1' '41R3' +
     A**********                            '41R4' '42M1' '61R1' +
     A**********                            '61M1' '62M1' '62R1' +
     A**********                            '63M1' '64R1' '64M1' +
     A**********                            '65M1' '66R1' '66M1' +
     A**********                            '67M1' '61V3' '80M1' +
     A**********                            '81D1' '81M1' '81M3' +
     A**********                            '82A1' '82M1' '84V1' +
     A**********                            '84V2' '21E1' '22E1' +
     A**********                            '23E1' '24E1' )
      *                                                     /S01274/
     A***********                                           /S01153/
      *                                                     /S01274/
     A**********O                           ALL
      *                                                     /S01274/
     A          R LVENTELF                  PFILE(LVENTEL)
     A            RECI
     A            LNRF
      *                                                  /S01117/
     A************CNUM
     A            CUNR
      *                                                  /S01117/
     A            ETYP
     A            EDAT
     A            EAMT
     A            ECCY
     A            ECSS
     A            LTYP
     A            SUTP
      *                                                  /S01117/
     A*********** BRCD
     A**********  BRCA
     A            EBRC
      *                                                  /S01117/
     A            OTHD
     A            OTHA
     A            BCEQ
     A            DFCE
     A            NGII
     A            INTR
     A            SETP
     A            OSAC
     A            TSEN
     A            ECDP
     A            CRNM
     A            CTWN
     A            CASK
     A            PRNM
     A            PTWN
     A            PASK
     A            INOI
     A            CRSK
     A            CDOM
     A            REGC
     A            PARI
      *                                               /S01117/
     A************CPAR
     A            PTNU
      *                                               /S01117/
     A            RCSI
     A            FACT
     A            FCNO
      *                                                     /E200/
     A            IBRE
      *                                                     /E200/
      *                                              Begin /S01486/
     A            PTFR
     A            RDEL
      *                                              End   /S01486/
      *                                                  Begin /163486/
     A            IFXC
     A            SIAC
      *                                                    End /163486/
     A*                                              Begin /CLE042/
     A            CLAS
     A*                                              End   /CLE042/
     A          K *NONE
     A          K ECCY
     A          K EDAT
     A          K ETYP
      *                                                     /S01153/
     A**********S ETYP                      VALUES('11V1' '12V1'  +
     A***********                           '13V1' '14V1' '15M1' '17M1' '17S1' +
     A***********                           '30P1' '30S1' '30C1' '30C2' '30A1' +
     A***********                           '30D1' '30D2' '30M1' '30M2' '41M1' +
     A***********                           '41M3' '41R1' '41R3' '41R4' '42M1' +
     A***********                           '61R1' '61M1' '62M1' '62R1' '63M1' +
     A***********                           '64R1' '64M1' '65M1' '66R1' +
     A***********                           '66M1' '67M1' '61V3' '80M1' '81D1' +
     A***********                           '81M1' '81M3' '82A1' '82M1' '84V1' +
     A***********                           '84V2')
     A          S ETYP                      VALUES('11V1' '12V1' +
     A                                      '13V1' '14V1' '15M1' +
     A                                      '17M1' '17S1' '30P1' +
     A                                      '30S1' '30C1' '30C2' +
     A                                      '30A1' '30D1' '30D2' +
     A                                      '30M1' '30M2' '41M1' +
     A                                      '41M3' '41R1' '41R3' +
     A                                      '41R4' '42M1' '61R1' +
     A                                      '61M1' '62M1' '62R1' +
     A                                      '63M1' '64R1' '64M1' +
     A                                      '65M1' '66R1' '66M1' +
     A                                      '67M1' '61V3' '80M1' +
     A                                      '81D1' '81M1' '81M3' +
     A                                      '82A1' '82M1' '84V1' +
     A                                      '84V2' '21E1' '22E1' +
     A*                                                                   S01243
     A                                      '62V3' '64V3' '66V3' +
     A*                                                                   S01243
      *                                              Begin /CLE005/
     A***********                           '23E1' '24E1' )
     A                                      '23E1' '24E1' '68R1' +
     A                                      '68M1' '68V3' '69R1' +
      *                                              Begin /151495/
     A***********                           '69M1' '69V3' )
     A                                      '69M1' '69V3' '72V3' +
     A                                      '72R1' '72M1' '61R7' '61V5' +
     A                                      '61R9' '61V7' '62R7' '62V5' +
     A                                      '62R9' '62V7' '63R7' '63V5' +
     A                                      '63R9' '63V7' '64R7' '64V5' +
     A                                      '64R9' '64V7' '65R7' '65V5' +
     A                                      '65R9' '65V7' '66R7' '66V5' +
     A                                      '66R9' '66V7' '67R7' '67V5' +
     A**Start of change Bug12902
     A**********                            '67R9' '67V7')                                  BUG12902
     A                                      '67R9' '67V7' '80R1')
     A**End of change Bug12902
      *                                              End   /151495/
      *                                              End   /CLE005/
      *                                                     /E200/
     A            IBRE                      COMP(EQ 'N')
      *                                                     /E200/
      *                                                     /S01153/
     A          O                           ALL
      *                                                     /S01196/
     A*******   R BVNTXEDF
     A*******                               TEXT('BILLS & CREDITS EVENT DETAIL')
     A*******                               PFILE(BVNTXED)
     A*******     RECI
     A*******     DLNO
     A*******     CNUM
     A*******     ETYP
     A*******     EDAT
     A*******     EAMT
     A*******     ECCY
     A*******     ECSS
     A*******     DTYP
     A*******     DLST
     A*******     BRCD
     A*******     OTHD
     A*******     OTHA
     A*******     OTHC
     A*******     DBCE
     A*******     BCEQ
     A*******     DBCR
     A*******     SETP
     A*******     OSAC                      CONCAT(OSAC1 OSAC2)
     A*******     TSEN
     A*******     FACO
     A*******     SPI
     A*******     FIPI
     A*******     INOI
     A*******     CPCN
     A*******     CPAR
     A*******     PARI
     A*******     CRNM
     A*******     CTWN
     A*******     CASK
     A*******     PRNM
     A*******     PTWN
     A*******     PASK
     A*******     CCTZ
     A*******     CLOC
     A*******     REGC
     A*******     FFIN
     A*******     LCEQ
     A*******     ZZ073
     A*******   K *NONE
     A*******   K ECCY
     A*******   K EDAT
     A*******   K ETYP
      *                                                     /S01196/
      *                                                     /S01153/
     A**********S ETYP                      VALUES('11V1' '12V1'  +
     A***********                           '13V1' '14V1' '15M1' '17M1' '17S1' +
     A***********                           '30P1' '30S1' '30C1' '30C2' '30A1' +
     A***********                           '30D1' '30D2' '30M1' '30M2' '41M1' +
     A***********                           '41M3' '41R1' '41R3' '41R4' '42M1' +
     A***********                           '61R1' '61M1' '62M1' '62R1' '63M1' +
     A***********                           '64R1' '64M1' '65M1' '66R1' +
     A***********                           '66M1' '67M1' '61V3' '80M1' '81D1' +
     A***********                           '81M1' '81M3' '82A1' '82M1' '84V1' +
     A***********                           '84V2')
     A*******   S ETYP                      VALUES('11V1' '12V1' +
     A*******                               '13V1' '14V1' '15M1' +
     A*******                               '17M1' '17S1' '30P1' +
     A*******                               '30S1' '30C1' '30C2' +
     A*******                               '30A1' '30D1' '30D2' +
     A*******                               '30M1' '30M2' '41M1' +
     A*******                               '41M3' '41R1' '41R3' +
     A*******                               '41R4' '42M1' '61R1' +
     A*******                               '61M1' '62M1' '62R1' +
     A*******                               '63M1' '64R1' '64M1' +
     A*******                               '65M1' '66R1' '66M1' +
     A*******                               '67M1' '61V3' '80M1' +
     A*******                               '81D1' '81M1' '81M3' +
     A*******                               '82A1' '82M1' '84V1' +
     A*******                               '84V2' '21E1' '22E1' +
     A*******                               '23E1' '24E1' )
      *                                                     /S01153/
     A*******   O                           ALL
      *                                                     /S01274/
     A**********R STEVEABF                  PFILE(STEVEAB)
     A**********                         TEXT('SEC. TRADING EVENT DETAIL')
     A**********  RECI
     A**********  SECS
     A**********  MARK
     A**********  TRDR
     A**********  CUNR
     A*********** CNUM
     A**********  ETYP
     A**********  EDAT
     A**********  EAMT
     A**********  ECCY
     A**********  ECSS
     A**********  TRTE
     A**********  TRSE
     A**********  BRCS
     A**********  CRAT
     A**********  NGII
     A**********  ODTE
     A**********  OAME
     A**********  NOMC
     A**********  NCSC
     A**********  ECDP
     A**********  NCDP
     A**********  DBEE
     A**********  SBEE
     A**********  DBRT
     A**********  DNEE
     A**********  SNEE
     A**********  DNRT
     A**********  FIPI
     A**********  SETL
     A**********  OURE                      CONCAT(OSAC1 OSAC2)
     A**********  THRE
     A**********  FACE
     A**********  SPI
     A**********  STCL
     A**********  PYCD
     A**********  PRCD
     A**********  IOIN
     A**********                                      /S01117/
     A************CPAR
     A**********  PTNU
     A**********                                      /S01117/
     A**********  PARI
     A**********  CRNM
     A**********  CTWN
     A**********  CASK
     A**********  PRNM
     A**********  PTWN
     A**********  PASK
     A**********  NOMT
     A**********  CRSK
     A**********  REGR
     A**********  CLOC
     A**********  REGD
     A**********  WTYP
     A**********  WRAT
     A**********  ASIN
     A**********  ACCF
     A**********                                          /S01117/
     A*********   BRCD
     A**********  BRCA
     A**********                                          /S01117/
     A**********  DSAM
     A**********  AIND
     A**********  PURI
     A**********                                          /S01117/
     A*********   ZZ005
     A**********  ZZ002
     A**********  CMPYM
     A**********                                          /S01117/
     A**********K *NONE
     A**********K ECCY
     A**********K EDAT
     A**********K ETYP
      *                                                     /S01274/
      *                                                     /S01153/
     A**********S ETYP                      VALUES('11V1' '12V1'  +
     A***********                           '13V1' '14V1' '15M1' '17M1' '17S1' +
     A***********                           '30P1' '30S1' '30C1' '30C2' '30A1' +
     A***********                           '30D1' '30D2' '30M1' '30M2' '41M1' +
     A***********                           '41M3' '41R1' '41R3' '41R4' '42M1' +
     A***********                           '61R1' '61M1' '62M1' '62R1' '63M1' +
     A***********                           '64R1' '64M1' '65M1' '66R1' +
     A***********                           '66M1' '67M1' '61V3' '80M1' '81D1' +
     A***********                           '81M1' '81M3' '82A1' '82M1' '84V1' +
     A***********                           '84V2')
      *                                                     /S01274/
     A**********S ETYP                      VALUES('11V1' '12V1' +
     A**********                            '13V1' '14V1' '15M1' +
     A**********                            '17M1' '17S1' '30P1' +
     A**********                            '30S1' '30C1' '30C2' +
     A**********                            '30A1' '30D1' '30D2' +
     A**********                            '30M1' '30M2' '41M1' +
     A**********                            '41M3' '41R1' '41R3' +
     A**********                            '41R4' '42M1' '61R1' +
     A**********                            '61M1' '62M1' '62R1' +
     A**********                            '63M1' '64R1' '64M1' +
     A**********                            '65M1' '66R1' '66M1' +
     A**********                            '67M1' '61V3' '80M1' +
     A**********                            '81D1' '81M1' '81M3' +
     A**********                            '82A1' '82M1' '84V1' +
     A**********                            '84V2' '21E1' '22E1' +
     A**********                            '23E1' '24E1' )
      *                                                     /S01274/
      *                                                     /S01153/
      *                                                     /S01274/
     A**********O                           ALL
      *                                                     /S01274/
