      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
     A********************************************************************
     A*
     A*  Midas - Securities Trading Module
     A*                                                                  *
     A*    LF/ILEVNIL3 -   MERGE SE FILES                                *
     A*                                                                  *
      *  (c) Misys International Banking Systems Ltd. 2004            *
     A*                                                                  *
     A*  Last Amend No. MD053008           Date 12Mar19               *
     A*  Prev Amend No. DUG503             Date 04Apr18               *
     A*                 DUG431             Date 04Jul05               *
     A*                 DUG405             Date 29Jul04               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*                 CEU011             Date 29May98               *
     A*                 CSE007             Date 17Mar98               *
     A*                 S01496             DATE 06JUN94               *
     A*                 S01486             DATE 06JUN94               *
     A*                   S01522             DATE 28NOV94                *
     A*                   S01117    DATE 20NOV90                         *
     A*                   E20669    DATE 31JAN90                         *
     A*                                                                  *
     A********************************************************************
     A*                                                                  *
     A*    MD053008 - Misaligned details in report GLD956P1              *
     A*             - Recompile due to changed (IEVNTXED)                *
     A*    DUG503 - UGB FED CARS Upgrade
     A*             Apply to FBM from Midas R4
     A*             DUG431 - Amendments to 'Events by Value Date' Report    *
     A*             DUG405 - Events by Value Date                           *
     A*             Based on DLEVNIL2 but only for Dealing events.    *
     A*    CEU011 - EMU Position/Risk Reporting (Recompile)           *
     A*    CSE007 - Corporate Actions - Just Recompile                   *
     A*    S01496 - Jyske enhancements (Recompile)                       *
     A*    S01486 - Portfolio Management Upgrade(RECOMPILE)              *
     A*    S01522 - User Defined Correspondence                       *
     A*    S01117 - RECOMPILE DUE TO MULTIBRANCHING CHANGES
     A*    E20669 - RECORD FORMAT BPEVED REMOVED
     A*
     A********************************************************************
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A********************************************************************
     A          R EVNTXECF                  PFILE(IEVNTXEC)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2004')
     A          K RECI
     A          R EVNTXEDF                  PFILE(IEVNTXED)
     A            RECI
     A            DLNO
     A            CUNR
     A            ETYP
     A            EDAT
     A            EAMT
     A            ECCY
     A            ECSS
     A            DTYP
     A            DLST
     A            EBRC
     A            EXRT
     A            NGII
     A            NOTD
     A            OTHD
     A            OTHA
     A            OTHC
     A            DBCE
     A            BCEQ
     A            DBCR
     A            LCEQ
     A            SETP
     A            OSAC                      CONCAT(OSAC1 OSAC2)
     A            TSEN
     A            ZZ003
     A            FIPI
     A            INOI
     A            FCTI
     A            RLVI
     A            PTNU
     A            PARI
     A            CRNM
     A            CTWN
     A            CASK
     A            PRNM
     A            PTWN
     A            PASK
     A            CCTZ
     A            CLOC
     A            REGC
     A            DASN
     A            FFVD
     A            FFIN
     A            FACT
     A            FCNO
     A            FACO
     A            SPI
     A            CPCN
     A            FSLI
     A            ICIR
     A            ICAM
     A            RBDA
     A            OCFF
     A            ORBR
     A            COOB
     A            ECPY
     A            IBRE
     A            ICYE
     A            EXEI
     A            ELVB
     A            ELVC
     A            ELVS
     A            OSBR
     A            TAXI
     A            FUID
     A            RBDN
     A            IPSI
     A            IFXS
     A            SIAC
      *
     A          K *NONE
     A****      K ECSS                                                          DUG405
     A****      K ECCY                                                          DUG405
     A          K EDAT
     A          K ECSS                                                          DUG405
     A          K ECCY                                                          DUG405
     A          K ETYP
      *
     A          S IBRE                      VALUES('N')
      *
     A            DTYP                      COMP(NE 'IL')
     A            DTYP                      COMP(NE 'ID')
      *
     A**        R CEVNXCCF                  PFILE(CEVNXCC)
     A**        K *NONE
     A****      K ECSS                                                          DUG405
     A****      K ECCY                                                          DUG405
     A**        K EDAT
     A**        K ECSS                                                          DUG405
     A**        K ECCY                                                          DUG405
     A**        K ETYP
      *
     A          R LVENTELF                  PFILE(LVENTEL)
     A            RECI
     A            LNRF
     A            CUNR
     A            ETYP
     A            EDAT
     A            EAMT
     A            ECCY
     A            ECSS
     A            LTYP
     A            SUTP
     A            EBRC
     A            INTR
     A            NGII
     A            OTHD
     A            OTHA
     A            BCEQ
     A            DFCE
     A            SETP
     A            OSAC
     A            TSEN
     A            ECDP
     A            CRNM
     A            CTWN
     A            CASK
     A            PRNM
     A            PTWN
     A            PASK
     A            INOI
     A            CRSK
     A            CDOM
     A            REGC
     A            PARI
     A            PTNU
     A            RCSI
     A            FACT
     A            FCNO
     A            RDOM
     A            LASN
     A            FREO
     A            WTIN
     A            WTRT
     A            CPAM
     A            AUTO
     A            MRIN
     A            ACOF
     A            OSBR
     A            ECPY
     A            IBRE
     A            ICYE
     A            EXEI
     A            ELVB
     A            ELVC
     A            ELVS
     A            BRCA
     A            COBB
     A            OLNO
      *                                                  Begin /163486/
     A            IFXC
     A            SIAC
      *                                                    End /163486/
      *
     A          K *NONE
     A****      K ECSS                                                          DUG405
     A****      K ECCY                                                          DUG405
     A          K EDAT
     A          K ECSS                                                          DUG405
     A          K ECCY                                                          DUG405
     A          K ETYP
      *
     A          O AUTO                      COMP(NE 'Y')
     A          S IBRE                      VALUES('N')
     A          O                           ALL
      *
     A          R BVNTXEDF                  PFILE(BVNTXED)
     A            RECI
     A            LCNO           6
     A            CNUM
     A            ETYP
     A            EDAT
     A            EAMT
     A            ECCY
     A            ECSS
     A            DTYP
     A            DLST
     A            BRCA
     A            OTHD
     A            OTHA
     A            OTHC
     A            DBCE
     A            BCEQ
     A            DBCR
     A            SETP
     A            OSAC                      CONCAT(OSAC1 OSAC2)
     A            TSEN
     A            FACO
     A            SPI
     A            FIPI
     A            INOI
     A            CPCN
     A            CPAR
     A            PARI
     A            CRNM
     A            CTWN
     A            CASK
     A            PRNM
     A            PTWN
     A            PASK
     A            CCTZ
     A            CLOC
     A            REGC
     A            FFIN
     A            LCEQ
     A            OSBR
     A            ZZ070
     A            TIRF
     A            TICM
     A          K *NONE
     A****      K ECSS                                                          DUG405
     A****      K ECCY                                                          DUG405
     A          K EDAT
     A          K ECSS                                                          DUG405
     A          K ECCY                                                          DUG405
     A          K ETYP
      *
     A          R FPVNTDDF
     A                                      PFILE(FPVNTDD)
     A          K *NONE
     A****      K ECSS                                                          DUG405
     A****      K ECCY                                                          DUG405
     A          K EDAT
     A          K ECSS                                                          DUG405
     A          K ECCY                                                          DUG405
     A          K ETYP
      *
     A          S IBRE                      VALUES('N')
      *
     A          R FOEVEDF                   PFILE(FOEVED)
     A                                      TEXT('FO EVENTS DETAIL')
     A          K *NONE
     A****      K ECSS                                                          DUG405
     A****      K ECCY                                                          DUG405
     A          K EDAT
     A          K ECSS                                                          DUG405
     A          K ECCY                                                          DUG405
     A          K ETYP
      *
      *                                                                         DUG431
     A          R GLCXXFP0                  PFILE(GLCXXFPP)                     DUG431
     A                                      TEXT('Customer Exchanges Extract')  DUG431
     A          K *NONE                                                         DUG431
     A          K G2EVDT                                                        DUG431
     A          K G2ECSS                                                        DUG431
     A          K G2CURR                                                        DUG431
     A          K G2ETYP                                                        DUG431
      *                                                                         DUG431
     A          R GLJEXFP0                  PFILE(GLJEXFPP)                     DUG431
     A                                      TEXT('Journal Entries Extract')     DUG431
     A          K *NONE                                                         DUG431
     A          K G3EVDT                                                        DUG431
     A          K G3ECSS                                                        DUG431
     A          K G3CURR                                                        DUG431
     A          K G3ETYP                                                        DUG431
      *
     A          R EVNTXZZF                  PFILE(IEVNTXZZ)
     A          K RECI
     A*          R CEVNXZZF                  PFILE(CEVNXZZ)
     A*          K RECI
     A          R LVENTZZF                  PFILE(LVENTZZ)
     A          K RECI
      *
     A          R BVNTXEZF
     A                                      PFILE(BVNTXEZ)
     A          K RECI
      *
     A          R FPVNTZZF                  PFILE(FPVNTZZ)
     A          K RECI
      *
     A          R FOEVEZZF                  PFILE(FOEVEZZ)
     A          K RECI
      *
     A          R GLCXXZP0                  PFILE(GLCXXZPP)                     DUG431
     A          K G2RECI                                                        DUG431
      *                                                                         DUG431
     A          R GLJEXZP0                  PFILE(GLJEXZPP)                     DUG431
     A          K G3RECI                                                        DUG431 