      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas DL SORTED INT. THIS MONTH - DEALS')
     A**************************************************************
     A*                                                            *
     F*  Midas - Dealing Module
     A*                                                            *
     A*   LF/IRSOD      SORTED INTEREST REPORT EXT.(DEALS)         *
     A*                                                            *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                            *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
     A*  Prev Amend No. CDL038               Date 10May05             *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*                 S01117             Date 05/12/88              *
     A*                                                            *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*  CDL038 - Extended Deal Sub Type                              *
      *                                                               *
      *****************************************************************
     A**************************************************************
     A          R IREXDHHF                  PFILE(IREXDHH)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K RECI
     A          R IREXDICF                  PFILE(IREXDIC)
     A          K *NONE
     A*                                                  /S01117/
     A********* K BRCD
     A          K BRCA
     A*                                                  /S01117/
     A          K PYRC
     A          K CASK
     A          K SLID
     A          K ACNO
     A          K DLNO
     A          R IREXDZZF                  PFILE(IREXDZZ)
     A          K RECI
