      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas DL Pay / receive Settlements')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Dealing Module                                       *
     A*                                                               *
     A*   LF/PRSBR      PAY/RECEIVE SETTLEMENTS                       *
     A*                                                               *
     A*  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
     A*  Prev Amend No. CDL025             Date 26Jan05               *
     A*                 CGL029             Date 01Sep03               *
     A* Midas Release 4 --------------- Base -------------------------*
     A* Midas DBA 3.05 -----------------------------------------------*
     A*                 CIR003             Date 12Sep00               *
     A* Midas DBA 3.00 ---------------- Base -------------------------*
     A*                 CEU003             Date 05Nov97               *
     A*                 CDL002             Date 17SEP97               *  *
     A*                 S01117             Date 26Mar87               *  *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*  CDL025 - FX Netting Payment Generation                       *
     A*           Recompiled due to changed PREXPH                    *
     A*  CGL029 - Increase Account Code to 10 digits (Recompile)      *
     A*  CIR003 - Principal Exchange on Cross Currencies IRS          *
     A*           Recompiled due to changed PREXPH                    *
     A*  CEU003 - EMU Dealing Settlement Ccy Conversion (Recompile)   *
     A*   CDL002 - FX Netting (Recompiled Only)  ***                  *
     A*****************************************************************
     A          R PREXPHF                   PFILE(PREXPH)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K *NONE
     A**                                                     /S01117/
     A****      K BRCD
     A          K BRCA
     A**                                                     /S01117/
     A          K OSBR
     A          K PYRC
     A          K CCY
     A          K VDAT
     A*
     A          R PREXZZF                   PFILE(PREXZZ)
     A          K RECI
