      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXI *  TEXT('Midas SD TI Accounts with BBTICS='N' - Audit')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PRTF/SD000037AU - TI Accounts with BBTICS='N' - Audit        *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2005            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. BUG5168 *CREATE    Date 15Mar05               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  BUG5168 - Set TI Customer Flag (BBTICS) in PF/SDCUSTPD if    *
      *            customer is also a TI Customer.                    *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R HEADAU
     A                                  3  1'Reference'
     A                                  3 11'SD000037AU'
     A            BJURPT        53A     3 38
     A                                  3105'Date:'
     A            BJMRDT         7A     3112
     A  01                              4  1'UPDATE MODE'
     A N01                              4  1'AUDIT MODE'
     A                                  4105'Page'
     A                                  4112PAGNBR
     A                                      EDTCDE(Z)
     A                                  5 40'TI Customers with +
     A                                       TI Customer Flag set   +
     A                                       to ''N'' '
     A                                       UNDERLINE
      *
     A          R DETLAU
     A                                 11 30'Total records processed:'
     A            RECCNT         5  0  11 56EDTCDE(L)
     A     42                          13 30'Total records updated:'
     A     42     COUNT          5  0  13 56EDTCDE(L)
     A     42                          15 54'**  END OF REPORT  **'
     A    N42                          15 54'** NO DETAILS TO REPORT **'
