      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas SD Holidays report')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PRTF/SD0160PM - Holidays Listing Report                      *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Last Amend No. nnnnnn  *CREATE    Date ddmmmyy               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  nnnnnn - (change description)                                *
      *                                                               *
      *****************************************************************
     A                                      INDARA
      *=========================================================================
     A          R ZZPAGHDR                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                      SKIPB(3)
      *.........................................................................
     A                                     2'Reference'
     A            ##PGM         10        12TEXT('*PROGRAM')
     A            ##URPT        53        45TEXT('User Report Title')
     A                                   111'Date'
     A            ##MRDT         7       116TEXT('Midas Run Date')
     A                                   124'Page'
     A                                   129PAGNBR
     A                                      EDTCDE(3)
     A                                   111'Time'
     A                                      SPACEB(1)
     A                                   116TIME
     A                                      EDTWRD('  :  :  ')
     A            ##AURT        53        45TEXT('Audit/Request Title')
     A                                      SPACEB(1)
     A            ##BJNA        53        45TEXT('Underline')
     A                                      SPACEB(1)
      *=========================================================================
     A          R ZZDTLRCD                  TEXT('Detail line.             ')
     A                                      SPACEB(1)
      *.........................................................................
     A                                     2'Currency Code..:'
     A            XRCYCD         3        19TEXT('Currency Code')
     A                                    25'Location Code..:'
     A            XRLCCD         3        42TEXT('Location Code')
     A                                    48'Year Number..:'
     A            XRYRNB         4        63TEXT('Year Number')
     A                                     2'                        January   -
     A                                                                         -
     A                                                            February'
     A                                      SPACEB(2)
     A                                     2'                  1               -
     A                                          2                   3          -
     A                                                      1                  -
     A                                       2'
     A                                      SPACEB(1)
     A                                     2'1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 -
     A                                      8 9 0 1 2 3 4 5 6 7 8 9 0 1      1 -
     A                                      2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9-
     A                                       0 1 2 3 4 5 6 7 8'
     A                                      SPACEB(1)
     A N79                               125'9'
     A            XRJ01S         1         2TEXT('January 01 Status Func')
     A                                      SPACEB(1)
     A            XRJ02S         1         4TEXT('January 02 Status Func')
     A            XRJ03S         1         6TEXT('January 03 Status Func')
     A            XRJ04S         1         8TEXT('January 04 Status Func')
     A            XRJ05S         1        10TEXT('January 05 Status Func')
     A            XRJ06S         1        12TEXT('January 06 Status Func')
     A            XRJ07S         1        14TEXT('January 07 Status Func')
     A            XRJ08S         1        16TEXT('January 08 Status Func')
     A            XRJ09S         1        18TEXT('January 09 Status Func')
     A            XRJ10S         1        20TEXT('January 10 Status Func')
     A            XRJ11S         1        22TEXT('January 11 Status Func')
     A            XRJ12S         1        24TEXT('January 12 Status Func')
     A            XRJ13S         1        26TEXT('January 13 Status Func')
     A            XRJ14S         1        28TEXT('January 14 Status Func')
     A            XRJ15S         1        30TEXT('January 15 Status Func')
     A            XRJ16S         1        32TEXT('January 16 Status Func')
     A            XRJ17S         1        34TEXT('January 17 Status Func')
     A            XRJ18S         1        36TEXT('January 18 Status Func')
     A            XRJ19S         1        38TEXT('January 19 Status Func')
     A            XRJ20S         1        40TEXT('January 20 Status Func')
     A            XRJ21S         1        42TEXT('January 21 Status Func')
     A            XRJ22S         1        44TEXT('January 22 Status Func')
     A            XRJ23S         1        46TEXT('January 23 Status Func')
     A            XRJ24S         1        48TEXT('January 24 Status Func')
     A            XRJ25S         1        50TEXT('January 25 Status Func')
     A            XRJ26S         1        52TEXT('January 26 Status Func')
     A            XRJ27S         1        54TEXT('January 27 Status Func')
     A            XRJ28S         1        56TEXT('January 28 Status Func')
     A            XRJ29S         1        58TEXT('January 29 Status Func')
     A            XRJ30S         1        60TEXT('January 30 Status Func')
     A            XRJ31S         1        62TEXT('January 31 Status Func')
     A            XRF01S         1        69TEXT('February 01 Status Func')
     A            XRF02S         1        71TEXT('February 02 Status Func')
     A            XRF03S         1        73TEXT('February 03 Status Func')
     A            XRF04S         1        75TEXT('February 04 Status Func')
     A            XRF05S         1        77TEXT('February 05 Status Func')
     A            XRF06S         1        79TEXT('February 06 Status Func')
     A            XRF07S         1        81TEXT('February 07 Status Func')
     A            XRF08S         1        83TEXT('February 08 Status Func')
     A            XRF09S         1        85TEXT('February 09 Status Func')
     A            XRF10S         1        87TEXT('February 10 Status Func')
     A            XRF11S         1        89TEXT('February 11 Status Func')
     A            XRF12S         1        91TEXT('February 12 Status Func')
     A            XRF13S         1        93TEXT('February 13 Status Func')
     A            XRF14S         1        95TEXT('February 14 Status Func')
     A            XRF15S         1        97TEXT('February 15 Status Func')
     A            XRF16S         1        99TEXT('February 16 Status Func')
     A            XRF17S         1       101TEXT('February 17 Status Func')
     A            XRF18S         1       103TEXT('February 18 Status Func')
     A            XRF19S         1       105TEXT('February 19 Status Func')
     A            XRF20S         1       107TEXT('February 20 Status Func')
     A            XRF21S         1       109TEXT('February 21 Status Func')
     A            XRF22S         1       111TEXT('February 22 Status Func')
     A            XRF23S         1       113TEXT('February 23 Status Func')
     A            XRF24S         1       115TEXT('February 24 Status Func')
     A            XRF25S         1       117TEXT('February 25 Status Func')
     A            XRF26S         1       119TEXT('February 26 Status Func')
     A            XRF27S         1       121TEXT('February 27 Status Func')
     A            XRF28S         1       123TEXT('February 28 Status Func')
     A N79        XRF29S         1       125TEXT('February 29 Status Func')
     A                                     2'                         March    -
     A                                                                         -
     A                                                              April'
     A                                      SPACEB(2)
     A                                     2'                  1               -
     A                                          2                   3          -
     A                                                      1                  -
     A                                       2                   3'
     A                                      SPACEB(1)
     A                                     2'1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 -
     A                                      8 9 0 1 2 3 4 5 6 7 8 9 0 1      1 -
     A                                      2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9-
     A                                       0 1 2 3 4 5 6 7 8 9 0'
     A                                      SPACEB(1)
     A            XRM01S         1         2TEXT('March 01 Status Func')
     A                                      SPACEB(1)
     A            XRM02S         1         4TEXT('March 02 Status Func')
     A            XRM03S         1         6TEXT('March 03 Status Func')
     A            XRM04S         1         8TEXT('March 04 Status Func')
     A            XRM05S         1        10TEXT('March 05 Status Func')
     A            XRM06S         1        12TEXT('March 06 Status Func')
     A            XRM07S         1        14TEXT('March 07 Status Func')
     A            XRM08S         1        16TEXT('March 08 Status Func')
     A            XRM09S         1        18TEXT('March 09 Status Func')
     A            XRM10S         1        20TEXT('March 10 Status Func')
     A            XRM11S         1        22TEXT('March 11 Status Func')
     A            XRM12S         1        24TEXT('March 12 Status Func')
     A            XRM13S         1        26TEXT('March 13 Status Func')
     A            XRM14S         1        28TEXT('March 14 Status Func')
     A            XRM15S         1        30TEXT('March 15 Status Func')
     A            XRM16S         1        32TEXT('March 16 Status Func')
     A            XRM17S         1        34TEXT('March 17 Status Func')
     A            XRM18S         1        36TEXT('March 18 Status Func')
     A            XRM19S         1        38TEXT('March 19 Status Func')
     A            XRM20S         1        40TEXT('March 20 Status Func')
     A            XRM21S         1        42TEXT('March 21 Status Func')
     A            XRM22S         1        44TEXT('March 22 Status Func')
     A            XRM23S         1        46TEXT('March 23 Status Func')
     A            XRM24S         1        48TEXT('March 24 Status Func')
     A            XRM25S         1        50TEXT('March 25 Status Func')
     A            XRM26S         1        52TEXT('March 26 Status Func')
     A            XRM27S         1        54TEXT('March 27 Status Func')
     A            XRM28S         1        56TEXT('March 28 Status Func')
     A            XRM29S         1        58TEXT('March 29 Status Func')
     A            XRM30S         1        60TEXT('March 30 Status Func')
     A            XRM31S         1        62TEXT('March 31 Status Func')
     A            XRA01S         1        69TEXT('April 01 Status Func')
     A            XRA02S         1        71TEXT('April 02 Status Func')
     A            XRA03S         1        73TEXT('April 03 Status Func')
     A            XRA04S         1        75TEXT('April 04 Status Func')
     A            XRA05S         1        77TEXT('April 05 Status Func')
     A            XRA06S         1        79TEXT('April 06 Status Func')
     A            XRA07S         1        81TEXT('April 07 Status Func')
     A            XRA08S         1        83TEXT('April 08 Status Func')
     A            XRA09S         1        85TEXT('April 09 Status Func')
     A            XRA10S         1        87TEXT('April 10 Status Func')
     A            XRA11S         1        89TEXT('April 11 Status Func')
     A            XRA12S         1        91TEXT('April 12 Status Func')
     A            XRA13S         1        93TEXT('April 13 Status Func')
     A            XRA14S         1        95TEXT('April 14 Status Func')
     A            XRA15S         1        97TEXT('April 15 Status Func')
     A            XRA16S         1        99TEXT('April 16 Status Func')
     A            XRA17S         1       101TEXT('April 17 Status Func')
     A            XRA18S         1       103TEXT('April 18 Status Func')
     A            XRA19S         1       105TEXT('April 19 Status Func')
     A            XRA20S         1       107TEXT('April 20 Status Func')
     A            XRA21S         1       109TEXT('April 21 Status Func')
     A            XRA22S         1       111TEXT('April 22 Status Func')
     A            XRA23S         1       113TEXT('April 23 Status Func')
     A            XRA24S         1       115TEXT('April 24 Status Func')
     A            XRA25S         1       117TEXT('April 25 Status Func')
     A            XRA26S         1       119TEXT('April 26 Status Func')
     A            XRA27S         1       121TEXT('April 27 Status Func')
     A            XRA28S         1       123TEXT('April 28 Status Func')
     A            XRA29S         1       125TEXT('April 29 Status Func')
     A            XRA30S         1       127TEXT('April 30 Status Func')
     A                                     2'                          May     -
     A                                                                         -
     A                                                              June'
     A                                      SPACEB(2)
     A                                     2'                  1               -
     A                                          2                   3          -
     A                                                      1                  -
     A                                       2                   3'
     A                                      SPACEB(1)
     A                                     2'1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 -
     A                                      8 9 0 1 2 3 4 5 6 7 8 9 0 1      1 -
     A                                      2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9-
     A                                       0 1 2 3 4 5 6 7 8 9 0'
     A                                      SPACEB(1)
     A            XRY01S         1         2TEXT('May 01 Status Func')
     A                                      SPACEB(1)
     A            XRY02S         1         4TEXT('May 02 Status Func')
     A            XRY03S         1         6TEXT('May 03 Status Func')
     A            XRY04S         1         8TEXT('May 04 Status Func')
     A            XRY05S         1        10TEXT('May 05 Status Func')
     A            XRY06S         1        12TEXT('May 06 Status Func')
     A            XRY07S         1        14TEXT('May 07 Status Func')
     A            XRY08S         1        16TEXT('May 08 Status Func')
     A            XRY09S         1        18TEXT('May 09 Status Func')
     A            XRY10S         1        20TEXT('May 10 Status Func')
     A            XRY11S         1        22TEXT('May 11 Status Func')
     A            XRY12S         1        24TEXT('May 12 Status Func')
     A            XRY13S         1        26TEXT('May 13 Status Func')
     A            XRY14S         1        28TEXT('May 14 Status Func')
     A            XRY15S         1        30TEXT('May 15 Status Func')
     A            XRY16S         1        32TEXT('May 16 Status Func')
     A            XRY17S         1        34TEXT('May 17 Status Func')
     A            XRY18S         1        36TEXT('May 18 Status Func')
     A            XRY19S         1        38TEXT('May 19 Status Func')
     A            XRY20S         1        40TEXT('May 20 Status Func')
     A            XRY21S         1        42TEXT('May 21 Status Func')
     A            XRY22S         1        44TEXT('May 22 Status Func')
     A            XRY23S         1        46TEXT('May 23 Status Func')
     A            XRY24S         1        48TEXT('May 24 Status Func')
     A            XRY25S         1        50TEXT('May 25 Status Func')
     A            XRY26S         1        52TEXT('May 26 Status Func')
     A            XRY27S         1        54TEXT('May 27 Status Func')
     A            XRY28S         1        56TEXT('May 28 Status Func')
     A            XRY29S         1        58TEXT('May 29 Status Func')
     A            XRY30S         1        60TEXT('May 30 Status Func')
     A            XRY31S         1        62TEXT('May 31 Status Func')
     A            XRU01S         1        69TEXT('June 01 Status Func')
     A            XRU02S         1        71TEXT('June 02 Status Func')
     A            XRU03S         1        73TEXT('June 03 Status Func')
     A            XRU04S         1        75TEXT('June 04 Status Func')
     A            XRU05S         1        77TEXT('June 05 Status Func')
     A            XRU06S         1        79TEXT('June 06 Status Func')
     A            XRU07S         1        81TEXT('June 07 Status Func')
     A            XRU08S         1        83TEXT('June 08 Status Func')
     A            XRU09S         1        85TEXT('June 09 Status Func')
     A            XRU10S         1        87TEXT('June 10 Status Func')
     A            XRU11S         1        89TEXT('June 11 Status Func')
     A            XRU12S         1        91TEXT('June 12 Status Func')
     A            XRU13S         1        93TEXT('June 13 Status Func')
     A            XRU14S         1        95TEXT('June 14 Status Func')
     A            XRU15S         1        97TEXT('June 15 Status Func')
     A            XRU16S         1        99TEXT('June 16 Status Func')
     A            XRU17S         1       101TEXT('June 17 Status Func')
     A            XRU18S         1       103TEXT('June 18 Status Func')
     A            XRU19S         1       105TEXT('June 19 Status Func')
     A            XRU20S         1       107TEXT('June 20 Status Func')
     A            XRU21S         1       109TEXT('June 21 Status Func')
     A            XRU22S         1       111TEXT('June 22 Status Func')
     A            XRU23S         1       113TEXT('June 23 Status Func')
     A            XRU24S         1       115TEXT('June 24 Status Func')
     A            XRU25S         1       117TEXT('June 25 Status Func')
     A            XRU26S         1       119TEXT('June 26 Status Func')
     A            XRU27S         1       121TEXT('June 27 Status Func')
     A            XRU28S         1       123TEXT('June 28 Status Func')
     A            XRU29S         1       125TEXT('June 29 Status Func')
     A            XRU30S         1       127TEXT('June 30 Status Func')
     A                                     2'                         July     -
     A                                                                         -
     A                                                             August'
     A                                      SPACEB(2)
     A                                     2'                  1               -
     A                                          2                   3          -
     A                                                      1                  -
     A                                       2                   3'
     A                                      SPACEB(1)
     A                                     2'1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 -
     A                                      8 9 0 1 2 3 4 5 6 7 8 9 0 1      1 -
     A                                      2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9-
     A                                       0 1 2 3 4 5 6 7 8 9 0 1'
     A                                      SPACEB(1)
     A            XRL01S         1         2TEXT('July 01 Status Func')
     A                                      SPACEB(1)
     A            XRL02S         1         4TEXT('July 02 Status Func')
     A            XRL03S         1         6TEXT('July 03 Status Func')
     A            XRL04S         1         8TEXT('July 04 Status Func')
     A            XRL05S         1        10TEXT('July 05 Status Func')
     A            XRL06S         1        12TEXT('July 06 Status Func')
     A            XRL07S         1        14TEXT('July 07 Status Func')
     A            XRL08S         1        16TEXT('July 08 Status Func')
     A            XRL09S         1        18TEXT('July 09 Status Func')
     A            XRL10S         1        20TEXT('July 10 Status Func')
     A            XRL11S         1        22TEXT('July 11 Status Func')
     A            XRL12S         1        24TEXT('July 12 Status Func')
     A            XRL13S         1        26TEXT('July 13 Status Func')
     A            XRL14S         1        28TEXT('July 14 Status Func')
     A            XRL15S         1        30TEXT('July 15 Status Func')
     A            XRL16S         1        32TEXT('July 16 Status Func')
     A            XRL17S         1        34TEXT('July 17 Status Func')
     A            XRL18S         1        36TEXT('July 18 Status Func')
     A            XRL19S         1        38TEXT('July 19 Status Func')
     A            XRL20S         1        40TEXT('July 20 Status Func')
     A            XRL21S         1        42TEXT('July 21 Status Func')
     A            XRL22S         1        44TEXT('July 22 Status Func')
     A            XRL23S         1        46TEXT('July 23 Status Func')
     A            XRL24S         1        48TEXT('July 24 Status Func')
     A            XRL25S         1        50TEXT('July 25 Status Func')
     A            XRL26S         1        52TEXT('July 26 Status Func')
     A            XRL27S         1        54TEXT('July 27 Status Func')
     A            XRL28S         1        56TEXT('July 28 Status Func')
     A            XRL29S         1        58TEXT('July 29 Status Func')
     A            XRL30S         1        60TEXT('July 30 Status Func')
     A            XRL31S         1        62TEXT('July 31 Status Func')
     A            XRG01S         1        69TEXT('August 01 Status Func')
     A            XRG02S         1        71TEXT('August 02 Status Func')
     A            XRG03S         1        73TEXT('August 03 Status Func')
     A            XRG04S         1        75TEXT('August 04 Status Func')
     A            XRG05S         1        77TEXT('August 05 Status Func')
     A            XRG06S         1        79TEXT('August 06 Status Func')
     A            XRG07S         1        81TEXT('August 07 Status Func')
     A            XRG08S         1        83TEXT('August 08 Status Func')
     A            XRG09S         1        85TEXT('August 09 Status Func')
     A            XRG10S         1        87TEXT('August 10 Status Func')
     A            XRG11S         1        89TEXT('August 11 Status Func')
     A            XRG12S         1        91TEXT('August 12 Status Func')
     A            XRG13S         1        93TEXT('August 13 Status Func')
     A            XRG14S         1        95TEXT('August 14 Status Func')
     A            XRG15S         1        97TEXT('August 15 Status Func')
     A            XRG16S         1        99TEXT('August 16 Status Func')
     A            XRG17S         1       101TEXT('August 17 Status Func')
     A            XRG18S         1       103TEXT('August 18 Status Func')
     A            XRG19S         1       105TEXT('August 19 Status Func')
     A            XRG20S         1       107TEXT('August 20 Status Func')
     A            XRG21S         1       109TEXT('August 21 Status Func')
     A            XRG22S         1       111TEXT('August 22 Status Func')
     A            XRG23S         1       113TEXT('August 23 Status Func')
     A            XRG24S         1       115TEXT('August 24 Status Func')
     A            XRG25S         1       117TEXT('August 25 Status Func')
     A            XRG26S         1       119TEXT('August 26 Status Func')
     A            XRG27S         1       121TEXT('August 27 Status Func')
     A            XRG28S         1       123TEXT('August 28 Status Func')
     A            XRG29S         1       125TEXT('August 29 Status Func')
     A            XRG30S         1       127TEXT('August 30 Status Func')
     A            XRG31S         1       129TEXT('August 31 Status Func')
     A                                     2'                       September  -
     A                                                                         -
     A                                                             October'
     A                                      SPACEB(2)
     A                                     2'                  1               -
     A                                          2                   3          -
     A                                                      1                  -
     A                                       2                   3'
     A                                      SPACEB(1)
     A                                     2'1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 -
     A                                      8 9 0 1 2 3 4 5 6 7 8 9 0        1 -
     A                                      2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9-
     A                                       0 1 2 3 4 5 6 7 8 9 0 1'
     A                                      SPACEB(1)
     A            XRS01S         1         2TEXT('September 01 Status Func')
     A                                      SPACEB(1)
     A            XRS02S         1         4TEXT('September 02 Status Func')
     A            XRS03S         1         6TEXT('September 03 Status Func')
     A            XRS04S         1         8TEXT('September 04 Status Func')
     A            XRS05S         1        10TEXT('September 05 Status Func')
     A            XRS06S         1        12TEXT('September 06 Status Func')
     A            XRS07S         1        14TEXT('September 07 Status Func')
     A            XRS08S         1        16TEXT('September 08 Status Func')
     A            XRS09S         1        18TEXT('September 09 Status Func')
     A            XRS10S         1        20TEXT('September 10 Status Func')
     A            XRS11S         1        22TEXT('September 11 Status Func')
     A            XRS12S         1        24TEXT('September 12 Status Func')
     A            XRS13S         1        26TEXT('September 13 Status Func')
     A            XRS14S         1        28TEXT('September 14 Status Func')
     A            XRS15S         1        30TEXT('September 15 Status Func')
     A            XRS16S         1        32TEXT('September 16 Status Func')
     A            XRS17S         1        34TEXT('September 17 Status Func')
     A            XRS18S         1        36TEXT('September 18 Status Func')
     A            XRS19S         1        38TEXT('September 19 Status Func')
     A            XRS20S         1        40TEXT('September 20 Status Func')
     A            XRS21S         1        42TEXT('September 21 Status Func')
     A            XRS22S         1        44TEXT('September 22 Status Func')
     A            XRS23S         1        46TEXT('September 23 Status Func')
     A            XRS24S         1        48TEXT('September 24 Status Func')
     A            XRS25S         1        50TEXT('September 25 Status Func')
     A            XRS26S         1        52TEXT('September 26 Status Func')
     A            XRS27S         1        54TEXT('September 27 Status Func')
     A            XRS28S         1        56TEXT('September 28 Status Func')
     A            XRS29S         1        58TEXT('September 29 Status Func')
     A            XRS30S         1        60TEXT('September 30 Status Func')
     A            XRO01S         1        69TEXT('October 01 Status Func')
     A            XRO02S         1        71TEXT('October 02 Status Func')
     A            XRO03S         1        73TEXT('October 03 Status Func')
     A            XRO04S         1        75TEXT('October 04 Status Func')
     A            XRO05S         1        77TEXT('October 05 Status Func')
     A            XRO06S         1        79TEXT('October 06 Status Func')
     A            XRO07S         1        81TEXT('October 07 Status Func')
     A            XRO08S         1        83TEXT('October 08 Status Func')
     A            XRO09S         1        85TEXT('October 09 Status Func')
     A            XRO10S         1        87TEXT('October 10 Status Func')
     A            XRO11S         1        89TEXT('October 11 Status Func')
     A            XRO12S         1        91TEXT('October 12 Status Func')
     A            XRO13S         1        93TEXT('October 13 Status Func')
     A            XRO14S         1        95TEXT('October 14 Status Func')
     A            XRO15S         1        97TEXT('October 15 Status Func')
     A            XRO16S         1        99TEXT('October 16 Status Func')
     A            XRO17S         1       101TEXT('October 17 Status Func')
     A            XRO18S         1       103TEXT('October 18 Status Func')
     A            XRO19S         1       105TEXT('October 19 Status Func')
     A            XRO20S         1       107TEXT('October 20 Status Func')
     A            XRO21S         1       109TEXT('October 21 Status Func')
     A            XRO22S         1       111TEXT('October 22 Status Func')
     A            XRO23S         1       113TEXT('October 23 Status Func')
     A            XRO24S         1       115TEXT('October 24 Status Func')
     A            XRO25S         1       117TEXT('October 25 Status Func')
     A            XRO26S         1       119TEXT('October 26 Status Func')
     A            XRO27S         1       121TEXT('October 27 Status Func')
     A            XRO28S         1       123TEXT('October 28 Status Func')
     A            XRO29S         1       125TEXT('October 29 Status Func')
     A            XRO30S         1       127TEXT('October 30 Status Func')
     A            XRO31S         1       129TEXT('October 31 Status Func')
     A                                     2'                       November   -
     A                                                                         -
     A                                                            December'
     A                                      SPACEB(2)
     A                                     2'                  1               -
     A                                          2                   3          -
     A                                                      1                  -
     A                                       2                   3'
     A                                      SPACEB(1)
     A                                     2'1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 -
     A                                      8 9 0 1 2 3 4 5 6 7 8 9 0        1 -
     A                                      2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9-
     A                                       0 1 2 3 4 5 6 7 8 9 0 1'
     A                                      SPACEB(1)
     A            XRN01S         1         2TEXT('November 01 Status Func')
     A                                      SPACEB(1)
     A            XRN02S         1         4TEXT('November 02 Status Func')
     A            XRN03S         1         6TEXT('November 03 Status Func')
     A            XRN04S         1         8TEXT('November 04 Status Func')
     A            XRN05S         1        10TEXT('November 05 Status Func')
     A            XRN06S         1        12TEXT('November 06 Status Func')
     A            XRN07S         1        14TEXT('November 07 Status Func')
     A            XRN08S         1        16TEXT('November 08 Status Func')
     A            XRN09S         1        18TEXT('November 09 Status Func')
     A            XRN10S         1        20TEXT('November 10 Status Func')
     A            XRN11S         1        22TEXT('November 11 Status Func')
     A            XRN12S         1        24TEXT('November 12 Status Func')
     A            XRN13S         1        26TEXT('November 13 Status Func')
     A            XRN14S         1        28TEXT('November 14 Status Func')
     A            XRN15S         1        30TEXT('November 15 Status Func')
     A            XRN16S         1        32TEXT('November 16 Status Func')
     A            XRN17S         1        34TEXT('November 17 Status Func')
     A            XRN18S         1        36TEXT('November 18 Status Func')
     A            XRN19S         1        38TEXT('November 19 Status Func')
     A            XRN20S         1        40TEXT('November 20 Status Func')
     A            XRN21S         1        42TEXT('November 21 Status Func')
     A            XRN22S         1        44TEXT('November 22 Status Func')
     A            XRN23S         1        46TEXT('November 23 Status Func')
     A            XRN24S         1        48TEXT('November 24 Status Func')
     A            XRN25S         1        50TEXT('November 25 Status Func')
     A            XRN26S         1        52TEXT('November 26 Status Func')
     A            XRN27S         1        54TEXT('November 27 Status Func')
     A            XRN28S         1        56TEXT('November 28 Status Func')
     A            XRN29S         1        58TEXT('November 29 Status Func')
     A            XRN30S         1        60TEXT('November 30 Status Func')
     A            XRD01S         1        69TEXT('December 01 Status Func')
     A            XRD02S         1        71TEXT('December 02 Status Func')
     A            XRD03S         1        73TEXT('December 03 Status Func')
     A            XRD04S         1        75TEXT('December 04 Status Func')
     A            XRD05S         1        77TEXT('December 05 Status Func')
     A            XRD06S         1        79TEXT('December 06 Status Func')
     A            XRD07S         1        81TEXT('December 07 Status Func')
     A            XRD08S         1        83TEXT('December 08 Status Func')
     A            XRD09S         1        85TEXT('December 09 Status Func')
     A            XRD10S         1        87TEXT('December 10 Status Func')
     A            XRD11S         1        89TEXT('December 11 Status Func')
     A            XRD12S         1        91TEXT('December 12 Status Func')
     A            XRD13S         1        93TEXT('December 13 Status Func')
     A            XRD14S         1        95TEXT('December 14 Status Func')
     A            XRD15S         1        97TEXT('December 15 Status Func')
     A            XRD16S         1        99TEXT('December 16 Status Func')
     A            XRD17S         1       101TEXT('December 17 Status Func')
     A            XRD18S         1       103TEXT('December 18 Status Func')
     A            XRD19S         1       105TEXT('December 19 Status Func')
     A            XRD20S         1       107TEXT('December 20 Status Func')
     A            XRD21S         1       109TEXT('December 21 Status Func')
     A            XRD22S         1       111TEXT('December 22 Status Func')
     A            XRD23S         1       113TEXT('December 23 Status Func')
     A            XRD24S         1       115TEXT('December 24 Status Func')
     A            XRD25S         1       117TEXT('December 25 Status Func')
     A            XRD26S         1       119TEXT('December 26 Status Func')
     A            XRD27S         1       121TEXT('December 27 Status Func')
     A            XRD28S         1       123TEXT('December 28 Status Func')
     A            XRD29S         1       125TEXT('December 29 Status Func')
     A            XRD30S         1       127TEXT('December 30 Status Func')
     A            XRD31S         1       129TEXT('December 31 Status Func')
     A                                    40'Last Change.:'
     A                                      SPACEB(2)
     A            XRACDT         7        54TEXT('alpha change date')
     A                                    69'Change Type.:'
     A            XRALCH         6        83TEXT('alpha of last change')
     A  78                                56'*** NO DETAILS TO REPORT ***'
     A                                      SPACEB(1)
      * 'Hidden' internal version of Last Change Date
     A  99N99     XRLCD          5  0      1SPACEB(1)
      * 'Hidden' internal version of Type of Last Change
     A  99N99     XRTYLC         1         1SPACEB(1)
      *=========================================================================
     A          R ZZFINTTL                  TEXT('Final totals             ')
     A                                      SPACEB(2)
      *.........................................................................
     A                                    55'No of Records Printed..:'
     A            ZTNCRC         5  0     80TEXT('No of Calculated Recs')
     A                                      EDTCDE(4)
      * 'Hidden' internal version of *CON (Screen constant)
     A  99N99     ZTCON          1         1SPACEB(1)
      *=========================================================================
     A          R ZZENDRPT                  TEXT('End of report            ')
     A                                      SPACEB(2)
      *.........................................................................
     A                                    60'*** END OF REPORT ***'
      *=========================================================================
