      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas Local Industries Aud/Req Report')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PRTF/SD0100PM - Local Industries Aud/Req Report              *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. BG1342             Date 01Mar04               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CPB001             Date 16Dec99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  BG1342 - Errors in global industry code                      *
      *  CPB001 - 'Private Banking' Module                            *
      *  nnnnnn - (change description)                                *
      *                                                               *
      *****************************************************************
     A                                      INDARA
      *=========================================================================
     A          R ZZPAGHDR
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A                                      SKIPB(3)
      *.........................................................................
     A                                     2'Reference'
     A            ##PGM         10        12TEXT('*PROGRAM')
     A            ##URPT        53        45TEXT('User Report Title')
     A                                   111'Date'
     A            ##MRDT         7       116TEXT('midas rundate')
     A                                   124'Page'
     A                                   129PAGNBR
     A                                      EDTCDE(3)
     A                                   111'Time'
     A                                      SPACEB(1)
     A                                   116TIME
     A                                      EDTWRD('  :  :  ')
     A            ##ARTL        53        45TEXT('Audit/Request Title')
     A                                      SPACEB(1)
     A            ##UNDL        53        45TEXT('Underline')
     A                                      SPACEB(1)
      *=========================================================================
     A          R ZZCOLHDG                  TEXT('Detail line headings.')
     A                                      SPACEB(2)
     A                                      SPACEA(1)
      *.........................................................................
     A                                     2'Industry Code'
     A                                    35'Name'
      *                                              Begin /BG1342/
      *                                              Begin /CPB001/
     A**85********************************75'Economic'
     A  85                                71'Economic'
      *                                              End   /CPB001/
     A  86                                93'Global'
      *                                              End   /BG1342/
     A*/COPY WNCPYSRC,SD0100PM02
     A                                   111'Last'
     A                                   121'Change'
     A                                   111'Change'
     A                                      SPACEB(1)
      *                                              Begin /BG1342/
      *                                              Begin /CPB001/
     A**85********************************76'Sector'
     A  85                                72'Sector'
      *                                              End   /CPB001/
      *                                              Begin /BG1342/
     A  86                                90'Industry Code'
      *                                              End   /BG1342/
     A*/COPY WNCPYSRC,SD0100PM03
     A                                   121'Type'
      *=========================================================================
     A          R ZZDTLRCD                  TEXT('Detail line.             ')
     A                                      SPACEB(1)
     A                                      SPACEA(1)
      *.........................................................................
     A            XRLICD         3         2TEXT('Local Industry Code')
     A            XRLINA        30        35TEXT('Local Industry Name')
      *                                              Begin /BG1342/
      *                                              Begin /CPB001/
     A**85********XRECOS         3        77TEXT('Economic Sector')
     A  85        XRECOS         3        73TEXT('Economic Sector')
      *                                              End   /CPB001/
     A  86        XRGIND        10        92TEXT('Global Industry Code')
      *                                              End   /BG1342/
     A*/COPY WNCPYSRC,SD0100PM04
     A            XRACDT         7       111TEXT('alpha change date')
     A            XRALCH         6       121TEXT('alpha of last change')
      * 'Hidden' internal version of Last Change Date
     A  99N99     XRLCD          5  0      1SPACEB(1)
      * 'Hidden' internal version of Type of Last Change
     A  99N99     XRTYLC         1         1SPACEB(1)
     A*/COPY WNCPYSRC,SD0100PM01
      *=========================================================================
     A          R ZZFINTTL                  TEXT('Final totals             ')
     A                                      SPACEB(2)
      *.........................................................................
     A                                    65'            '
     A                                    53'Number of Records Printed..:'
     A                                      SPACEB(3)
     A            ZTNCRC         5  0     82TEXT('No of Calculated Recs')
     A                                      EDTCDE(4)
     A  79                                56'*** NO DETAILS TO REPORT ***'
     A                                      SPACEB(2)
      *=========================================================================
     A          R ZZENDRPT                  TEXT('End of report            ')
     A                                      SPACEB(2)
      *.........................................................................
     A                                    60'*** END OF REPORT ***'
      *=========================================================================
