      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60                                                     *
/*EXI *  TEXT('Midas Account Officers Aud/Req  Print file')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PRTF/SD0200PM - Account Officers Aud/Req Report              *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CTI004             Date 12Apr04               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *  Prev Amend No. CPB001             Date 10Aug99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 nnnnnn  *CREATE    Date ddmmmyy               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CTI004 - MidasPlus-TI Interface                              *
      *           Account Officers Integration                        *
      * CPB001 - 'Private Banking' Module                             *
      *  nnnnnn - (change description)                                *
      *                                                               *
      *****************************************************************
     A                                      INDARA
      *=========================================================================
     A          R ZZPAGHDR
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                      SKIPB(3)
      *.........................................................................
     A                                     2'Reference'
     A            ##PGM         10        12TEXT('*PROGRAM')
     A            ##URPT        53        45TEXT('User Report Title')
     A                                   111'Date'
     A            ##MRDT         7       116TEXT('midas rundate')
     A                                   124'Page'
     A                                   129PAGNBR
     A                                      EDTCDE(3)
     A                                   111'Time'
     A                                      SPACEB(1)
     A                                   116TIME
     A                                      EDTWRD('  :  :  ')
     A            ##ARTL        53        45TEXT('Audit/Request Title')
     A                                      SPACEB(1)
     A            ##UNDL        53        45TEXT('Underline')
     A                                      SPACEB(1)
      *=========================================================================
     A          R ZZCOLHDG                  TEXT('Detail line headings.')
      ** Start of Change CTI004
     A**********                            SPACEB(2)                                         CTI004
     A**********                            SPACEA(1)                                         CTI004
      ** End of Change CTI004
      *.........................................................................
      ** Start of Change CTI004
     A**********                           2'Officer'                                         CTI004
     A**********                          23'Dept'                                            CTI004
     A**********                          41'Officer Name'                                    CTI004
      ** End of Change CTI004
      *                                              Begin /CPB001/
      ** Start of Change CTI004
     A**85******                          80'Manager'                                         CTI004
      ** End of Change CTI004
      *                                              End   /CPB001/
      ** Start of Change CTI004
     A**********                         111'Last'                                            CTI004
     A**********                         121'Change'                                          CTI004
     A**********                           2'Code'                                            CTI004
     A**********                            SPACEB(1)                                         CTI004
     A**********                          23'Code'                                            CTI004
      ** End of Change CTI004
      *                                              Begin /CPB001/
      ** Start of Change CTI004
     A**85******                          80'  Type '                                         CTI004
      ** End of Change CTI004
      *                                              End   /CPB001/
      ** Start of Change CTI004
     A**********                         111'Change'                                          CTI004
     A**********                         121'Type'                                            CTI004
      ** End of Change CTI004
      *=========================================================================
     A          R ZZDTLRCD                  TEXT('Detail line.             ')
     A                                      SPACEB(1)
     A                                      SPACEA(1)
      *.........................................................................
      ** Start of Change CTI004
     A**********  XRACOC         2         2TEXT('Account Officer Code')                      CTI004
     A**********  XRDPCD         3        23TEXT('Dept Code')                                 CTI004
     A**********  XRACON        30        41TEXT('Account Officer Name')                      CTI004
      ** End of Change CTI004
      *                                              Begin /CPB001/
      ** Start of Change CTI004
     A**85******  XRACOT         1        83TEXT('Manager Type')                              CTI004
      ** End of Change CTI004
      *                                              End   /CPB001/
      ** Start of Change CTI004
     A**********  XRACDT         7       111TEXT('alpha change date')                         CTI004
     A**********  XRALCH         6       121TEXT('alpha of last change')                      CTI004
     A                                     3'Account Officer Code......:'
     A                                      SPACEB(1)
     A            XRACOC         2        31
     A                                    72'Manager Type .............:'
     A            XRACOT         1       100
     A                                     3'Department Code ..........:'
     A                                      SPACEB(1)
     A            XRDPCD         3        31
     A                                    72'Last Change Date .........:'
     A            XRACDT         7       100
     A                                    72'Last Change Type .........:'
     A                                      SPACEB(1)
     A            XRALCH         6       100
     A                                     3'Account Officer Name......:'
     A                                      SPACEB(1)
     A            XRACON        30        31
     A                                    72'Account Officer Telephone.:'
     A            XRAPHN        20       100
     A                                     3'Address ..................:'
     A                                      SPACEB(1)
     A            XRAOA1        35        31
     A                                    72'Account Officer Extension.:'
     A            XRAEXT        10       100
     A            XRAOA2        35        31
     A                                      SPACEB(1)
     A                                    72'Telex.....................:'
     A            XRTLX         20       100
     A            XRAOA3        35        31
     A                                      SPACEB(1)
     A                                    72'Fax.......................:'
     A            XRFAX         20       100
     A            XRAOA4        35        31
     A                                      SPACEB(1)
     A                                    72'Answerback................:'
     A            XRANS          8       100
     A            XRAOA5        35        31
     A                                      SPACEB(1)
     A                                    72'Language..................:'
     A            XRLNG          2       100
     A                                     3'Zip.......................:'
     A                                      SPACEB(1)
     A            XRZIP         15        31
     A                                    72'Transfer Method...........:'
     A            XRTFM          2       100
      ** End of Change CTI004
     A N79        XRWFFR       131         2TEXT('Window Function Field')
     A                                      SPACEB(1)
     A N78        XRWF1R       131         2TEXT('Window Function Field 1')
     A                                      SPACEB(1)
     A N77        XRWF2R       131         2TEXT('Window Function Field 2')
     A                                      SPACEB(1)
      * 'Hidden' internal version of Last Change Date
     A  99N99     XRLCD          5  0      1SPACEB(1)
      * 'Hidden' internal version of Type of Last Change
     A  99N99     XRTYLC         1         1SPACEB(1)
     A*/COPY WNCPYSRC,SD0200PM01
      *=========================================================================
     A          R ZZFINTTL                  TEXT('Final totals             ')
     A                                      SPACEB(2)
      *.........................................................................
     A                                     2'            '
     A                                    53'Number of Records Printed..:'
     A                                      SPACEB(2)
     A            ZTNCRC         5  0     82TEXT('No of Calculated Recs')
     A                                      EDTCDE(3)
     A  76                                56'*** NO DETAILS TO REPORT ***'
     A                                      SPACEB(2)
      *=========================================================================
     A          R ZZENDRPT                  TEXT('End of report            ')
     A                                      SPACEB(2)
      *.........................................................................
     A                                    60'*** END OF REPORT ***'
      *=========================================================================
