      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD Account Keys File by Event Type')             *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Standing Data Module                     *
     A*                                                               *
     A*      LF/ACKEYL1  ACCOUNT KEYS BY EVENT TYPE.                  *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      *  Last Amend No. CER049             Date 06Dec10               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD031             Date 10Apr06               *
      *                 CDL038             Date 10May05               *
      *                 CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 047369             Date 10Jan94               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  CER049 - Stamp Tax                                           *
      *  CSD031 - Enhanced Centralised Static Data                    *
      *  CDL038 - Extended Deal Sub Type (Recompile)                  *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
     A*   047369  -  NARR CODES SHOULD BE ALPHA NOT NUMERIC -         *
     A*              RECOMPILE OVER AMENDED PF/ACKEYAL                *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A********************************************************************
     A          R ACKEYALF                  PFILE(ACKEYAL)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            RECI
     A            AKEY
     A            ACD1
     A            ACD2
     A            ACD3
     A            ACD4
     A            ACD5
     A            ACD6
     A            NCD1
     A            NCD2
     A            NCD3
     A            NCD4
     A            NCD5
     A            NCD6
     A            PRF1
     A            PRF2
     A            PRF3
     A            PRF4
     A            PRF5
     A            PRF6
     A            LCD
     A            CHTP
     A            TNLU
      *
     A            TYPE               I      SST(AKEY 1 2)
     A            SUBT               I      SST(AKEY 4 2)
     A*                                              Begin /CDL038/
     A            CLAS               I      SST(AKEY 11 4)
     A*                                              End   /CDL038/
     A            EVCD               I      SST(AKEY 3 1)
     A            FIFTH              I      SST(AKEY 5 1)
      **Start of change CSD031
     A            ZONE          10A         TEXT('Zone')
     A                                      COLHDG('Zone')
     A            IUSR          10A         TEXT('Insert User')
     A                                      COLHDG('Insert User')
     A            AUSR          10A         TEXT('Amend User')
     A                                      COLHDG('Amend User')
     A            XUSR          10A         TEXT('Authorise User')
     A                                      COLHDG('Authorise ' 'User')
     A            AACC           1A         TEXT('Automatically accept w/in +
     A                                      zone')
     A                                      COLHDG('Automatically ' +
     A                                       'accept w/in zone')
     A            EACC           5P 0       TEXT('Accept by Effective Date')
     A                                      COLHDG('Accept by' +
     A                                      'Effective Date')
     A            GPDT           1A         TEXT('Central Data indicator')
     A                                      COLHDG('Central Data ind.')
      **End of change CSD031
      **Start of change CER049
     A            ASQ1
     A            ASQ2
     A            ASQ3
     A            ASQ4
     A            ASQ5
     A            ASQ6
      **End of change CER049
     A          K TYPE
     A          K SUBT
     A*                                              Begin /CDL038/
     A          K CLAS
     A*                                              End   /CDL038/
     A          K *NONE
     A          S FIFTH                     COMP(NE ' ')
     A            EVCD                      COMP(EQ 'D')
     A            RECI                      COMP(NE '*')
      *
     A          R ACKEYF1                   PFILE(ACKEYAL)
     A            RECI
     A            AKEY
     A            ACD1
     A            ACD2
     A            ACD3
     A            ACD4
     A            ACD5
     A            ACD6
     A            NCD1
     A            NCD2
     A            NCD3
     A            NCD4
     A            NCD5
     A            NCD6
     A            PRF1
     A            PRF2
     A            PRF3
     A            PRF4
     A            PRF5
     A            PRF6
     A            LCD
     A            CHTP
     A            TNLU
      *
     A            TYPE               I      SST(AKEY 1 2)
     A            SUBT               I      SST(AKEY 4 2)
     A*                                              Begin /CDL038/
     A            CLAS               I      SST(AKEY 11 4)
     A*                                              End   /CDL038/
     A            EVCD               I      SST(AKEY 3 1)
     A            FIFTH              I      SST(AKEY 5 1)
      **Start of change CSD031
     A            ZONE          10A         TEXT('Zone')
     A                                      COLHDG('Zone')
     A            IUSR          10A         TEXT('Insert User')
     A                                      COLHDG('Insert User')
     A            AUSR          10A         TEXT('Amend User')
     A                                      COLHDG('Amend User')
     A            XUSR          10A         TEXT('Authorise User')
     A                                      COLHDG('Authorise ' 'User')
     A            AACC           1A         TEXT('Automatically accept w/in +
     A                                      zone')
     A                                      COLHDG('Automatically ' +
     A                                       'accept w/in zone')
     A            EACC           5P 0       TEXT('Accept by Effective Date')
     A                                      COLHDG('Accept by' +
     A                                      'Effective Date')
     A            GPDT           1A         TEXT('Central Data indicator')
     A                                      COLHDG('Central Data ind.')
      **End of change CSD031
      **Start of change CER049
     A            ASQ1
     A            ASQ2
     A            ASQ3
     A            ASQ4
     A            ASQ5
     A            ASQ6
      **End of change CER049
     A          K TYPE
     A          K SUBT
     A*                                              Begin /CDL038/
     A          K CLAS
     A*                                              End   /CDL038/
     A          K *NONE
     A          S FIFTH                     COMP(NE ' ')
     A            EVCD                      COMP(EQ 'V')
     A            RECI                      COMP(NE '*')
      *
     A          R ACKEYF2                   PFILE(ACKEYAL)
     A            RECI
     A            AKEY
     A            ACD1
     A            ACD2
     A            ACD3
     A            ACD4
     A            ACD5
     A            ACD6
     A            NCD1
     A            NCD2
     A            NCD3
     A            NCD4
     A            NCD5
     A            NCD6
     A            PRF1
     A            PRF2
     A            PRF3
     A            PRF4
     A            PRF5
     A            PRF6
     A            LCD
     A            CHTP
     A            TNLU
      *
     A            TYPE               I      SST(AKEY 1 2)
     A            SUBT               I      SST(AKEY 4 2)
     A*                                              Begin /CDL038/
     A            CLAS               I      SST(AKEY 11 4)
     A*                                              End   /CDL038/
     A            EVCD               I      SST(AKEY 3 1)
     A            FIFTH              I      SST(AKEY 5 1)
      **Start of change CSD031
     A            ZONE          10A         TEXT('Zone')
     A                                      COLHDG('Zone')
     A            IUSR          10A         TEXT('Insert User')
     A                                      COLHDG('Insert User')
     A            AUSR          10A         TEXT('Amend User')
     A                                      COLHDG('Amend User')
     A            XUSR          10A         TEXT('Authorise User')
     A                                      COLHDG('Authorise ' 'User')
     A            AACC           1A         TEXT('Automatically accept w/in +
     A                                      zone')
     A                                      COLHDG('Automatically ' +
     A                                       'accept w/in zone')
     A            EACC           5P 0       TEXT('Accept by Effective Date')
     A                                      COLHDG('Accept by' +
     A                                      'Effective Date')
     A            GPDT           1A         TEXT('Central Data indicator')
     A                                      COLHDG('Central Data ind.')
      **End of change CSD031
      **Start of change CER049
     A            ASQ1
     A            ASQ2
     A            ASQ3
     A            ASQ4
     A            ASQ5
     A            ASQ6
      **End of change CER049
     A          K TYPE
     A          K SUBT
     A*                                              Begin /CDL038/
     A          K CLAS
     A*                                              End   /CDL038/
     A          K *NONE
     A          S FIFTH                     COMP(NE ' ')
     A            EVCD                      COMP(EQ 'A')
     A            RECI                      COMP(NE '*')
      *
     A          R ACKEYF3                   PFILE(ACKEYAL)
     A            RECI
     A            AKEY
     A            ACD1
     A            ACD2
     A            ACD3
     A            ACD4
     A            ACD5
     A            ACD6
     A            NCD1
     A            NCD2
     A            NCD3
     A            NCD4
     A            NCD5
     A            NCD6
     A            PRF1
     A            PRF2
     A            PRF3
     A            PRF4
     A            PRF5
     A            PRF6
     A            LCD
     A            CHTP
     A            TNLU
      *
     A            TYPE               I      SST(AKEY 1 2)
     A            SUBT               I      SST(AKEY 4 2)
     A*                                              Begin /CDL038/
     A            CLAS               I      SST(AKEY 11 4)
     A*                                              End   /CDL038/
     A            EVCD               I      SST(AKEY 3 1)
     A            FIFTH              I      SST(AKEY 5 1)
      **Start of change CSD031
     A            ZONE          10A         TEXT('Zone')
     A                                      COLHDG('Zone')
     A            IUSR          10A         TEXT('Insert User')
     A                                      COLHDG('Insert User')
     A            AUSR          10A         TEXT('Amend User')
     A                                      COLHDG('Amend User')
     A            XUSR          10A         TEXT('Authorise User')
     A                                      COLHDG('Authorise ' 'User')
     A            AACC           1A         TEXT('Automatically accept w/in +
     A                                      zone')
     A                                      COLHDG('Automatically ' +
     A                                       'accept w/in zone')
     A            EACC           5P 0       TEXT('Accept by Effective Date')
     A                                      COLHDG('Accept by' +
     A                                      'Effective Date')
     A            GPDT           1A         TEXT('Central Data indicator')
     A                                      COLHDG('Central Data ind.')
      **End of change CSD031
      **Start of change CER049
     A            ASQ1
     A            ASQ2
     A            ASQ3
     A            ASQ4
     A            ASQ5
     A            ASQ6
      **End of change CER049
     A          K TYPE
     A          K SUBT
     A*                                              Begin /CDL038/
     A          K CLAS
     A*                                              End   /CDL038/
     A          K *NONE
     A          S FIFTH                     COMP(NE ' ')
     A            EVCD                      COMP(EQ 'I')
     A            RECI                      COMP(NE '*')
      *
     A          R ACKEYF4                   PFILE(ACKEYAL)
     A            RECI
     A            AKEY
     A            ACD1
     A            ACD2
     A            ACD3
     A            ACD4
     A            ACD5
     A            ACD6
     A            NCD1
     A            NCD2
     A            NCD3
     A            NCD4
     A            NCD5
     A            NCD6
     A            PRF1
     A            PRF2
     A            PRF3
     A            PRF4
     A            PRF5
     A            PRF6
     A            LCD
     A            CHTP
     A            TNLU
      *
     A            TYPE               I      SST(AKEY 1 2)
     A            SUBT               I      SST(AKEY 4 2)
     A*                                              Begin /CDL038/
     A            CLAS               I      SST(AKEY 11 4)
     A*                                              End   /CDL038/
     A            EVCD               I      SST(AKEY 3 1)
     A            FIFTH              I      SST(AKEY 5 1)
      **Start of change CSD031
     A            ZONE          10A         TEXT('Zone')
     A                                      COLHDG('Zone')
     A            IUSR          10A         TEXT('Insert User')
     A                                      COLHDG('Insert User')
     A            AUSR          10A         TEXT('Amend User')
     A                                      COLHDG('Amend User')
     A            XUSR          10A         TEXT('Authorise User')
     A                                      COLHDG('Authorise ' 'User')
     A            AACC           1A         TEXT('Automatically accept w/in +
     A                                      zone')
     A                                      COLHDG('Automatically ' +
     A                                       'accept w/in zone')
     A            EACC           5P 0       TEXT('Accept by Effective Date')
     A                                      COLHDG('Accept by' +
     A                                      'Effective Date')
     A            GPDT           1A         TEXT('Central Data indicator')
     A                                      COLHDG('Central Data ind.')
      **End of change CSD031
      **Start of change CER049
     A            ASQ1
     A            ASQ2
     A            ASQ3
     A            ASQ4
     A            ASQ5
     A            ASQ6
      **End of change CER049
     A          K TYPE
     A          K SUBT
     A*                                              Begin /CDL038/
     A          K CLAS
     A*                                              End   /CDL038/
     A          K *NONE
     A          S FIFTH                     COMP(NE ' ')
     A            EVCD                      COMP(EQ 'M')
     A            RECI                      COMP(NE '*')
      *
     A          R ACKEYF5                   PFILE(ACKEYAL)
     A            RECI
     A            AKEY
     A            ACD1
     A            ACD2
     A            ACD3
     A            ACD4
     A            ACD5
     A            ACD6
     A            NCD1
     A            NCD2
     A            NCD3
     A            NCD4
     A            NCD5
     A            NCD6
     A            PRF1
     A            PRF2
     A            PRF3
     A            PRF4
     A            PRF5
     A            PRF6
     A            LCD
     A            CHTP
     A            TNLU
      *
     A            TYPE               I      SST(AKEY 1 2)
     A            SUBT               I      SST(AKEY 4 2)
     A*                                              Begin /CDL038/
     A            CLAS               I      SST(AKEY 11 4)
     A*                                              End   /CDL038/
     A            EVCD               I      SST(AKEY 3 1)
     A            FIFTH              I      SST(AKEY 5 1)
      **Start of change CSD031
     A            ZONE          10A         TEXT('Zone')
     A                                      COLHDG('Zone')
     A            IUSR          10A         TEXT('Insert User')
     A                                      COLHDG('Insert User')
     A            AUSR          10A         TEXT('Amend User')
     A                                      COLHDG('Amend User')
     A            XUSR          10A         TEXT('Authorise User')
     A                                      COLHDG('Authorise ' 'User')
     A            AACC           1A         TEXT('Automatically accept w/in +
     A                                      zone')
     A                                      COLHDG('Automatically ' +
     A                                       'accept w/in zone')
     A            EACC           5P 0       TEXT('Accept by Effective Date')
     A                                      COLHDG('Accept by' +
     A                                      'Effective Date')
     A            GPDT           1A         TEXT('Central Data indicator')
     A                                      COLHDG('Central Data ind.')
      **End of change CSD031
      **Start of change CER049
     A            ASQ1
     A            ASQ2
     A            ASQ3
     A            ASQ4
     A            ASQ5
     A            ASQ6
      **End of change CER049
     A          K TYPE
     A          K SUBT
     A*                                              Begin /CDL038/
     A          K CLAS
     A*                                              End   /CDL038/
     A          K *NONE
     A          S FIFTH                     COMP(NE ' ')
     A            EVCD                      COMP(EQ 'P')
     A            RECI                      COMP(NE '*')
      *
     A          R ACKEYF6                   PFILE(ACKEYAL)
     A            RECI
     A            AKEY
     A            ACD1
     A            ACD2
     A            ACD3
     A            ACD4
     A            ACD5
     A            ACD6
     A            NCD1
     A            NCD2
     A            NCD3
     A            NCD4
     A            NCD5
     A            NCD6
     A            PRF1
     A            PRF2
     A            PRF3
     A            PRF4
     A            PRF5
     A            PRF6
     A            LCD
     A            CHTP
     A            TNLU
      *
     A            TYPE               I      SST(AKEY 1 2)
     A            SUBT               I      SST(AKEY 4 2)
     A*                                              Begin /CDL038/
     A            CLAS               I      SST(AKEY 11 4)
     A*                                              End   /CDL038/
     A            EVCD               I      SST(AKEY 3 1)
     A            FIFTH              I      SST(AKEY 5 1)
      **Start of change CSD031
     A            ZONE          10A         TEXT('Zone')
     A                                      COLHDG('Zone')
     A            IUSR          10A         TEXT('Insert User')
     A                                      COLHDG('Insert User')
     A            AUSR          10A         TEXT('Amend User')
     A                                      COLHDG('Amend User')
     A            XUSR          10A         TEXT('Authorise User')
     A                                      COLHDG('Authorise ' 'User')
     A            AACC           1A         TEXT('Automatically accept w/in +
     A                                      zone')
     A                                      COLHDG('Automatically ' +
     A                                       'accept w/in zone')
     A            EACC           5P 0       TEXT('Accept by Effective Date')
     A                                      COLHDG('Accept by' +
     A                                      'Effective Date')
     A            GPDT           1A         TEXT('Central Data indicator')
     A                                      COLHDG('Central Data ind.')
      **End of change CSD031
      **Start of change CER049
     A            ASQ1
     A            ASQ2
     A            ASQ3
     A            ASQ4
     A            ASQ5
     A            ASQ6
      **End of change CER049
     A          K TYPE
     A          K SUBT
     A*                                              Begin /CDL038/
     A          K CLAS
     A*                                              End   /CDL038/
     A          K *NONE
     A          S FIFTH                     COMP(NE ' ')
     A            EVCD                      COMP(EQ 'R')
     A            RECI                      COMP(NE '*')
      *
     A          R ACKEYF7                   PFILE(ACKEYAL)
     A            RECI
     A            AKEY
     A            ACD1
     A            ACD2
     A            ACD3
     A            ACD4
     A            ACD5
     A            ACD6
     A            NCD1
     A            NCD2
     A            NCD3
     A            NCD4
     A            NCD5
     A            NCD6
     A            PRF1
     A            PRF2
     A            PRF3
     A            PRF4
     A            PRF5
     A            PRF6
     A            LCD
     A            CHTP
     A            TNLU
      *
     A            TYPE               I      SST(AKEY 1 2)
     A            SUBT               I      SST(AKEY 4 2)
     A*                                              Begin /CDL038/
     A            CLAS               I      SST(AKEY 11 4)
     A*                                              End   /CDL038/
     A            EVCD               I      SST(AKEY 3 1)
     A            FIFTH              I      SST(AKEY 5 1)
      **Start of change CSD031
     A            ZONE          10A         TEXT('Zone')
     A                                      COLHDG('Zone')
     A            IUSR          10A         TEXT('Insert User')
     A                                      COLHDG('Insert User')
     A            AUSR          10A         TEXT('Amend User')
     A                                      COLHDG('Amend User')
     A            XUSR          10A         TEXT('Authorise User')
     A                                      COLHDG('Authorise ' 'User')
     A            AACC           1A         TEXT('Automatically accept w/in +
     A                                      zone')
     A                                      COLHDG('Automatically ' +
     A                                       'accept w/in zone')
     A            EACC           5P 0       TEXT('Accept by Effective Date')
     A                                      COLHDG('Accept by' +
     A                                      'Effective Date')
     A            GPDT           1A         TEXT('Central Data indicator')
     A                                      COLHDG('Central Data ind.')
      **End of change CSD031
      **Start of change CER049
     A            ASQ1
     A            ASQ2
     A            ASQ3
     A            ASQ4
     A            ASQ5
     A            ASQ6
      **End of change CER049
     A          K TYPE
     A          K SUBT
     A*                                              Begin /CDL038/
     A          K CLAS
     A*                                              End   /CDL038/
     A          K *NONE
     A          S FIFTH                     COMP(NE ' ')
     A            EVCD                      COMP(NE 'D')
     A            EVCD                      COMP(NE 'V')
     A            EVCD                      COMP(NE 'A')
     A            EVCD                      COMP(NE 'I')
     A            EVCD                      COMP(NE 'M')
     A            EVCD                      COMP(NE 'P')
     A            EVCD                      COMP(NE 'R')
     A            RECI                      COMP(NE '*')
      *
     A          R ACKEYF8                   PFILE(ACKEYAL)
     A            RECI
     A            AKEY
     A            ACD1
     A            ACD2
     A            ACD3
     A            ACD4
     A            ACD5
     A            ACD6
     A            NCD1
     A            NCD2
     A            NCD3
     A            NCD4
     A            NCD5
     A            NCD6
     A            PRF1
     A            PRF2
     A            PRF3
     A            PRF4
     A            PRF5
     A            PRF6
     A            LCD
     A            CHTP
     A            TNLU
      *
     A            FCTP               I      SST(AKEY 1 3)
     A            EVCD               I      SST(AKEY 4 1)
     A            FIFTH              I      SST(AKEY 5 1)
      **Start of change CSD031
     A            ZONE          10A         TEXT('Zone')
     A                                      COLHDG('Zone')
     A            IUSR          10A         TEXT('Insert User')
     A                                      COLHDG('Insert User')
     A            AUSR          10A         TEXT('Amend User')
     A                                      COLHDG('Amend User')
     A            XUSR          10A         TEXT('Authorise User')
     A                                      COLHDG('Authorise ' 'User')
     A            AACC           1A         TEXT('Automatically accept w/in +
     A                                      zone')
     A                                      COLHDG('Automatically ' +
     A                                       'accept w/in zone')
     A            EACC           5P 0       TEXT('Accept by Effective Date')
     A                                      COLHDG('Accept by' +
     A                                      'Effective Date')
     A            GPDT           1A         TEXT('Central Data indicator')
     A                                      COLHDG('Central Data ind.')
      **End of change CSD031
      **Start of change CER049
     A            ASQ1
     A            ASQ2
     A            ASQ3
     A            ASQ4
     A            ASQ5
     A            ASQ6
      **End of change CER049
     A          K *NONE
     A          K *NONE
     A*                                              Begin /CDL038/
     A          K *NONE
     A*                                              End   /CDL038/
     A          K FCTP
     A          S FIFTH                     COMP(EQ ' ')
     A            EVCD                      COMP(EQ 'A')
     A            RECI                      COMP(NE '*')
      *
     A          R ACKEYF9                   PFILE(ACKEYAL)
     A            RECI
     A            AKEY
     A            ACD1
     A            ACD2
     A            ACD3
     A            ACD4
     A            ACD5
     A            ACD6
     A            NCD1
     A            NCD2
     A            NCD3
     A            NCD4
     A            NCD5
     A            NCD6
     A            PRF1
     A            PRF2
     A            PRF3
     A            PRF4
     A            PRF5
     A            PRF6
     A            LCD
     A            CHTP
     A            TNLU
      *
     A            FCTP               I      SST(AKEY 1 3)
     A            EVCD               I      SST(AKEY 4 1)
     A            FIFTH              I      SST(AKEY 5 1)
      **Start of change CSD031
     A            ZONE          10A         TEXT('Zone')
     A                                      COLHDG('Zone')
     A            IUSR          10A         TEXT('Insert User')
     A                                      COLHDG('Insert User')
     A            AUSR          10A         TEXT('Amend User')
     A                                      COLHDG('Amend User')
     A            XUSR          10A         TEXT('Authorise User')
     A                                      COLHDG('Authorise ' 'User')
     A            AACC           1A         TEXT('Automatically accept w/in +
     A                                      zone')
     A                                      COLHDG('Automatically ' +
     A                                       'accept w/in zone')
     A            EACC           5P 0       TEXT('Accept by Effective Date')
     A                                      COLHDG('Accept by' +
     A                                      'Effective Date')
     A            GPDT           1A         TEXT('Central Data indicator')
     A                                      COLHDG('Central Data ind.')
      **End of change CSD031
      **Start of change CER049
     A            ASQ1
     A            ASQ2
     A            ASQ3
     A            ASQ4
     A            ASQ5
     A            ASQ6
      **End of change CER049
     A          K *NONE
     A          K *NONE
     A*                                              Begin /CDL038/
     A          K *NONE
     A*                                              End   /CDL038/
     A          K FCTP
     A          S FIFTH                     COMP(EQ ' ')
     A            EVCD                      COMP(EQ 'R')
     A            RECI                      COMP(NE '*')
      *
     A          R ACKEYF10                  PFILE(ACKEYAL)
     A            RECI
     A            AKEY
     A            ACD1
     A            ACD2
     A            ACD3
     A            ACD4
     A            ACD5
     A            ACD6
     A            NCD1
     A            NCD2
     A            NCD3
     A            NCD4
     A            NCD5
     A            NCD6
     A            PRF1
     A            PRF2
     A            PRF3
     A            PRF4
     A            PRF5
     A            PRF6
     A            LCD
     A            CHTP
     A            TNLU
      *
     A            FCTP               I      SST(AKEY 1 3)
     A            EVCD               I      SST(AKEY 4 1)
     A            FIFTH              I      SST(AKEY 5 1)
      **Start of change CSD031
     A            ZONE          10A         TEXT('Zone')
     A                                      COLHDG('Zone')
     A            IUSR          10A         TEXT('Insert User')
     A                                      COLHDG('Insert User')
     A            AUSR          10A         TEXT('Amend User')
     A                                      COLHDG('Amend User')
     A            XUSR          10A         TEXT('Authorise User')
     A                                      COLHDG('Authorise ' 'User')
     A            AACC           1A         TEXT('Automatically accept w/in +
     A                                      zone')
     A                                      COLHDG('Automatically ' +
     A                                       'accept w/in zone')
     A            EACC           5P 0       TEXT('Accept by Effective Date')
     A                                      COLHDG('Accept by' +
     A                                      'Effective Date')
     A            GPDT           1A         TEXT('Central Data indicator')
     A                                      COLHDG('Central Data ind.')
      **End of change CSD031
      **Start of change CER049
     A            ASQ1
     A            ASQ2
     A            ASQ3
     A            ASQ4
     A            ASQ5
     A            ASQ6
      **End of change CER049
     A          K *NONE
     A          K *NONE
     A*                                              Begin /CDL038/
     A          K *NONE
     A*                                              End   /CDL038/
     A          K FCTP
     A          S FIFTH                     COMP(EQ ' ')
     A            EVCD                      COMP(NE 'R')
     A            EVCD                      COMP(NE 'A')
     A            RECI                      COMP(NE '*')
     A********************************************************************
