      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD Additional Customer Details for Past Due')    *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/SDACUSL6 - Additional Customer Details for Past Due.      *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2012            *
      *                                                               *
      *  Last Amend No. CER070             Date 03Dec14               *
      *  Prev Amend No. CGL132             Date 01May13               *
      *                 CLE134   *CREATE   Date 01Aug12               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CER070 - BuBa Reporting / BAIS V.1.16.0 (Recompile)          *
      *  CGL132 - FATCA Phase 1 - Customers' Identification and       *
      *           Classification - Master (Recompile)                 *
      *  CLE134 - Past Due Call Loan Processing                       *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
      *
     A          R SDACUSD0                  PFILE(SDACUSPD)
     A                                      TEXT('(C) Misys Internatio+
     A                                      nal Banking Systems')
      *
     A          K E5CUST
      *
     A          S E5PDCU                    COMP(EQ 'Y')
      *
