      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas Historic Base Rates By Code + Date')             *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *   PF/SDBSHSL2 - Historic Base Rates By Code and Date          *
      *                                                               *
      *  (c) Finastra International Limited 2014                      *
      *                                                               *
      *  Last Amend No. CSD103             Date 10Aug20               *
      *  Prev Amend No. MD046248           Date 27Oct17               *
      *                 MD031150 *CREATE   Date 29Oct14               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  CSD103 - LIBOR Deregulation - Common Layer/Standing Data     *
      *  MD046248 - Finastra Rebranding                               *
      *  MD031150 - Changes to Export of Base Rates                   *
      *                                                               *
      *****************************************************************
     A
     A          R SDBSHSD0                  PFILE(SDBSHSPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2014')
      *
     A          K G0CYCD
     A          K G0BSRC
     A          K G0HIDT                    DESCEND
      *
