      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas Counterparty Nostros Retrieval index')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/SDCNSTL1- Midas SD Counterparty Nostros retrieval         *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CSD003             Date 23Jun98               *
      *                 S01459             Date 23Jun98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  S01459 - Addition of Midas headerbox.                        *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A*=====================================================================
     A          R @AWREDN                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A                                      PFILE(SDCNSTPD)
     A*---------------------------------------------------------------------
     A            AWCPNC                    TEXT('Counterparty Nostro Code')
     A            AWLCD                     TEXT('Last Change Date')
     A            AWTYLC                    TEXT('Type of Last Change')
     A            AWCPNM                    TEXT('Counterparty Nostro Name')
     A            AWCNTN                    TEXT('Counterparty Nostro Town')
     A            AWCSN1                    TEXT('Customer Shortname part 1')
     A            AWCSN2                    TEXT('Customer Shortname part 2')
     A            AWCABA                    TEXT('Chips ABA')
     A            AWSWID                    TEXT('Swift id')
     A            AWCUID                    TEXT('Chips UID')
     A            AWCHSC                    TEXT('Chaps sort code')
     A            AWBOJC                    TEXT('BOJ Code')
     A            AWBACD                    TEXT('Bankleitzahl Code')
     A            AWFWCD                    TEXT('Fedwire Code')
     A            AWTXA1                    TEXT('MIDAS Telex Shortname')
     A            AWSTAD                    TEXT('STTX Address')
     A            AWOGID                    TEXT('Midas Export Value OGID')
     A*.....................................................................
     A* Key fields
     A          K AWCPNC
     A*=====================================================================
