      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas Confirmation Matching   Retrieval index')
     A****************************************************************
     A*                                                              *
     A*  Midas STANDING DATA MODULE
     A*                                                              *
     A*  LF/SDCONFL1 - CONFIRMATIONS MATCHING LF - RETRIEVAL INDEX   *
     A*                                                              *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                              *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMENDMENT NO. S01253           DATE 14FEB90            *
     A*                                                              *
     A*--------------------------------------------------------------*
     A*                                                              *
     A*  S01253 - CREATED FOR MULTI-LANGUAGE                         *
     A*                                                              *
     A****************************************************************
     A                                      UNIQUE
     A*=====================================================================
     A          R @DSCPHJ
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                      PFILE(SDCONFPD)
     A*---------------------------------------------------------------------
     A************DSETCD                    TEXT('Confirmation Matching KeS01251
     A            DSCMKY                    TEXT('Confirmation Matching Key')
     A************DSOMNB                    TEXT('Transfer Frequency')    S01251
     A            DSTFFQ                    TEXT('Transfer Frequency')
     A************DSP9ST                    TEXT('Generate Timed out chaseS01251
     A            DSGTOC                    TEXT('Generate Timed out chaser')
     A************DSQAST                    TEXT('Release Timed out chaserS01251
     A            DSRTOC                    TEXT('Release Timed out chasers')
     A************DSQBST                    TEXT('Incl.our int. advice detS01251
     A            DSIOIA                    TEXT('Incl.our int. advice det.')
     A************DSQCST                    TEXT('Incl.counterparty int.adS01251
     A            DSICIA                    TEXT('Incl.counterparty int.adv')
     A            DSLCD                     TEXT('Last Change Date')
     A            DSTYLC                    TEXT('Type of Last Change')
     A*.....................................................................
     A* Key fields
     A**********K DSETCD                                                  S01251
     A          K DSCMKY
     A*=====================================================================
