      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas Futures & Options Clients Retrieval indx')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/SDFOCSL1- Midas SD Futures and options client retrieval   *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CSD003             Date 23Jun98               *
      *                 S01459             Date 23Jun98               *
      *                 BHF502             Date 05Sep30               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  S01459 - Addition of Midas headerbox.                        *
      *  BHF502 - Redeliver to NY.                                    *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A*=====================================================================
     A          R @BHRED1                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                      PFILE(SDFOCSPD)
     A*---------------------------------------------------------------------
     A            BHCUST                    TEXT('Customer Number')
     A            BHCYCD                    TEXT('Currency Code')
     A            BHLCD                     TEXT('Last Change Date')
     A            BHTYLC                    TEXT('Type of Last Change')
     A            BHSTFQ                    TEXT('Statement frequency')
     A            BHDMFS                    TEXT('Day in month for statement')
     A            BHNSDT                    TEXT('Next statement date')
     A            BHFACO                    TEXT('For Account of')
     A            BHBKIN                    TEXT('Broker Indicator')
     A            BHSTTY                    TEXT('Settlement Type')
     A            BHSMAC                    TEXT('Settlement Account')
     A            BHCPNO                    TEXT('Counterparty Nostro')
     A            BHCOAD                    TEXT('Correspondence Address')
     A            BHFTAO                    TEXT('For the Attention of')
     A            BHTXCI                    TEXT('Telex Confirmation Ind.')
     A            BHCTLM                    TEXT('Contract Limit')
     A            BHRVFQ                    TEXT('Revaluation Frequency')
     A            BHRVBD                    TEXT('Revaluation Base Day')
     A            BHNRDT                    TEXT('Next revaluation date')
     A            BHPCIN                    TEXT('Positions combined ind')
     A            BHACIN                    TEXT('Automatic Closure ind')
     A            BHCODE                    TEXT('Collateral Description')
     A            BHCOAM                    TEXT('Collateral Amount')
     A            BHSEBR                    TEXT('Settlement Branch')
     A*.....................................................................
     A* Key fields
     A          K BHCUST
     A*=====================================================================
