      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD FATCA Customer Details by Crt Date')          *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/SDFTCSJ0 - Midas SD FATCA Customer Details by Crt Date    *
      *                                                               *
      *  (c) Finastra International Limited 2013                      *
      *                                                               *
      *  Last Amend No. CSW123             Date 08Jan24               *
      *  Prev Amend No. MD050212           Date 02Apr18               *
      *                 MD046248           Date 27Oct17               *
      *                 MD027474 *CREATE   Date 11Jun14               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSW123 - SWIFT ISO 20022 - Phase 2 (Structured Addresses)    *
      *           (Recompile)                                         *
      *  MD050212 - Replication processing for SDCUSTXC (Recompile)   *
      *  MD046248 - Finastra Rebranding                               *
      *  MD027474 - Report is not arranged by Expiry Date (CUAP/NAHO) *
      *           - Applied fix MD025536                              *
      *                                                               *
      *****************************************************************
     A                                      JDFTVAL
     A          R SDFTCSD0                  TEXT('(c) Finastra +
     A                                      International +
     A                                      Limited +
     A                                      2013')
     A                                      JFILE(SDCUSTXC SDFTCSPD)
     A          J                           JOIN(1 2)
     A                                      JFLD(XCCUST FACUST)
      *
     A            XCCRDT                    JREF(1)
     A            XCCUST                    JREF(1)
     A            FACUST                    JREF(2)
     A            FACLAC                    JREF(2)
      *
     A          K XCCRDT                    DESCEND
     A          K XCCUST
      *****************************************************************
