/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD Hedging ICD file retrieval')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module
      *                                                               *
      *  LF/SDHEDGL1 - Midas SD Hedging ICD File Retrieval            *
      *                                                               *
      *  (c) Finastra International Limited 2002                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. 233545             Date 18May05               *
      *                 232348             Date 21Feb05               *
      *                 230116             Date 18Feb05               *
      *                 CAS009             Date 04May04               *
      * Midas Release 4.02 -------------------------------------------*
      *                 228948             Date 27Sep04               *
      *                 229418             Date 02Sep04               *
      *                 CAS008             Date 11May04               *
      *                 CAS006             Date 21Jan03               *
      * Midas Release 4.01 -------------------------------------------*
      *                 CAS002  *CREATE    Date 14Jan02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  233545 - Cut-off Date (Recompile)                            *
      *  232348 - Introduce cut-off date for non-linear amortisation  *
      *           (Recompile)                                         *
      *  230116 - To add the 'De Minimis Amount'                      *
      *  CAS009 - Effective Interest Rate/Amortised Cost Accounting   *
      *           (Recompile)                                         *
      *  228948 - Add 'Exclude Accrued Interest in Unrealized Profit  *
      *           or Loss' (Recompile)                                *
      *  229418 - Recompiled due to changes in SDHEDGPD.              *
      *  CAS008 - Delayed Hedge Assessment (Recompile)                *
      *  CAS006 - Hedge Accounting Phase B (Recompile)                *
      *  CAS002 - Hedge Strategy/Linkage                              *
      *                                                               *
      *****************************************************************
     A          R SDHEDGD0                  PFILE(SDHEDGPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2002')
      *
     A          K FSHEDG
