      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD Holidays')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/SDHOLL2  - Midas SD Holidays current location 1 Jan day N *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD031             Date 10Apr06               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CSD003             Date 22Apr99               *
      *                 S01459             DATE 22APR99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD031 - Enhanced Centralised Static Data                    *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  S01459 - Addition of Midas headerbox.                        *
      *                                                               *
      *****************************************************************
     A          R @HOLPID                   PFILE(SDHOLPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            DGCYCD                    TEXT('Currency Code')
     A            DGLCCD                    TEXT('Location Code')
     A            DGYRNB                    TEXT('Year Number')
     A            DGJDNB                    TEXT('1st January Day Number')
     A            DGDDNB                    TEXT('31st December Day Number')
     A            DGJA01                    TEXT('January 1')
     A            DGJA02                    TEXT('January 2')
     A            DGJA03                    TEXT('January 3')
     A            DGJA04                    TEXT('January 4')
     A            DGJA05                    TEXT('January 5')
     A            DGJA06                    TEXT('January 6')
     A            DGJA07                    TEXT('January 7')
     A            DGJA08                    TEXT('January 8')
     A            DGJA09                    TEXT('January 9')
     A            DGJA10                    TEXT('January 10')
     A            DGJA11                    TEXT('January 11')
     A            DGJA12                    TEXT('January 12')
     A            DGJA13                    TEXT('January 13')
     A            DGJA14                    TEXT('January 14')
     A            DGJA15                    TEXT('January 15')
     A            DGJA16                    TEXT('January 16')
     A            DGJA17                    TEXT('January 17')
     A            DGJA18                    TEXT('January 18')
     A            DGJA19                    TEXT('January 19')
     A            DGJA20                    TEXT('January 20')
     A            DGJA21                    TEXT('January 21')
     A            DGJA22                    TEXT('January 22')
     A            DGJA23                    TEXT('January 23')
     A            DGJA24                    TEXT('January 24')
     A            DGJA25                    TEXT('January 25')
     A            DGJA26                    TEXT('January 26')
     A            DGJA27                    TEXT('January 27')
     A            DGJA28                    TEXT('January 28')
     A            DGJA29                    TEXT('January 29')
     A            DGJA30                    TEXT('January 30')
     A            DGJA31                    TEXT('January 31')
     A            DGFE01                    TEXT('February 1')
     A            DGFE02                    TEXT('February 2')
     A            DGFE03                    TEXT('February 3')
     A            DGFE04                    TEXT('February 4')
     A            DGFE05                    TEXT('February 5')
     A            DGFE06                    TEXT('February 6')
     A            DGFE07                    TEXT('February 7')
     A            DGFE08                    TEXT('February 8')
     A            DGFE09                    TEXT('February 9')
     A            DGFE10                    TEXT('February 10')
     A            DGFE11                    TEXT('February 11')
     A            DGFE12                    TEXT('February 12')
     A            DGFE13                    TEXT('February 13')
     A            DGFE14                    TEXT('February 14')
     A            DGFE15                    TEXT('February 15')
     A            DGFE16                    TEXT('February 16')
     A            DGFE17                    TEXT('February 17')
     A            DGFE18                    TEXT('February 18')
     A            DGFE19                    TEXT('February 19')
     A            DGFE20                    TEXT('February 20')
     A            DGFE21                    TEXT('February 21')
     A            DGFE22                    TEXT('February 22')
     A            DGFE23                    TEXT('February 23')
     A            DGFE24                    TEXT('February 24')
     A            DGFE25                    TEXT('February 25')
     A            DGFE26                    TEXT('February 26')
     A            DGFE27                    TEXT('February 27')
     A            DGFE28                    TEXT('February 28')
     A            DGFE29                    TEXT('February 29')
     A            DGMA01                    TEXT('March 1')
     A            DGMA02                    TEXT('March 2')
     A            DGMA03                    TEXT('March 3')
     A            DGMA04                    TEXT('March 4')
     A            DGMA05                    TEXT('March 5')
     A            DGMA06                    TEXT('March 6')
     A            DGMA07                    TEXT('March 7')
     A            DGMA08                    TEXT('March 8')
     A            DGMA09                    TEXT('March 9')
     A            DGMA10                    TEXT('March 10')
     A            DGMA11                    TEXT('March 11')
     A            DGMA12                    TEXT('March 12')
     A            DGMA13                    TEXT('March 13')
     A            DGMA14                    TEXT('March 14')
     A            DGMA15                    TEXT('March 15')
     A            DGMA16                    TEXT('March 16')
     A            DGMA17                    TEXT('March 17')
     A            DGMA18                    TEXT('March 18')
     A            DGMA19                    TEXT('March 19')
     A            DGMA20                    TEXT('March 20')
     A            DGMA21                    TEXT('March 21')
     A            DGMA22                    TEXT('March 22')
     A            DGMA23                    TEXT('March 23')
     A            DGMA24                    TEXT('March 24')
     A            DGMA25                    TEXT('March 25')
     A            DGMA26                    TEXT('March 26')
     A            DGMA27                    TEXT('March 27')
     A            DGMA28                    TEXT('March 28')
     A            DGMA29                    TEXT('March 29')
     A            DGMA30                    TEXT('March 30')
     A            DGMA31                    TEXT('March 31')
     A            DGAP01                    TEXT('April 1')
     A            DGAP02                    TEXT('April 2')
     A            DGAP03                    TEXT('April 3')
     A            DGAP04                    TEXT('April 4')
     A            DGAP05                    TEXT('April 5')
     A            DGAP06                    TEXT('April 6')
     A            DGAP07                    TEXT('April 7')
     A            DGAP08                    TEXT('April 8')
     A            DGAP09                    TEXT('April 9')
     A            DGAP10                    TEXT('April 10')
     A            DGAP11                    TEXT('April 11')
     A            DGAP12                    TEXT('April 12')
     A            DGAP13                    TEXT('April 13')
     A            DGAP14                    TEXT('April 14')
     A            DGAP15                    TEXT('April 15')
     A            DGAP16                    TEXT('April 16')
     A            DGAP17                    TEXT('April 17')
     A            DGAP18                    TEXT('April 18')
     A            DGAP19                    TEXT('April 19')
     A            DGAP20                    TEXT('April 20')
     A            DGAP21                    TEXT('April 21')
     A            DGAP22                    TEXT('April 22')
     A            DGAP23                    TEXT('April 23')
     A            DGAP24                    TEXT('April 24')
     A            DGAP25                    TEXT('April 25')
     A            DGAP26                    TEXT('April 26')
     A            DGAP27                    TEXT('April 27')
     A            DGAP28                    TEXT('April 28')
     A            DGAP29                    TEXT('April 29')
     A            DGAP30                    TEXT('April 30')
     A            DGMY01                    TEXT('May 1')
     A            DGMY02                    TEXT('May 2')
     A            DGMY03                    TEXT('May 3')
     A            DGMY04                    TEXT('May 4')
     A            DGMY05                    TEXT('May 5')
     A            DGMY06                    TEXT('May 6')
     A            DGMY07                    TEXT('May 7')
     A            DGMY08                    TEXT('May 8')
     A            DGMY09                    TEXT('May 9')
     A            DGMY10                    TEXT('May 10')
     A            DGMY11                    TEXT('May 11')
     A            DGMY12                    TEXT('May 12')
     A            DGMY13                    TEXT('May 13')
     A            DGMY14                    TEXT('May 14')
     A            DGMY15                    TEXT('May 15')
     A            DGMY16                    TEXT('May 16')
     A            DGMY17                    TEXT('May 17')
     A            DGMY18                    TEXT('May 18')
     A            DGMY19                    TEXT('May 19')
     A            DGMY20                    TEXT('May 20')
     A            DGMY21                    TEXT('May 21')
     A            DGMY22                    TEXT('May 22')
     A            DGMY23                    TEXT('May 23')
     A            DGMY24                    TEXT('May 24')
     A            DGMY25                    TEXT('May 25')
     A            DGMY26                    TEXT('May 26')
     A            DGMY27                    TEXT('May 27')
     A            DGMY28                    TEXT('May 28')
     A            DGMY29                    TEXT('May 29')
     A            DGMY30                    TEXT('May 30')
     A            DGMY31                    TEXT('May 31')
     A            DGJU01                    TEXT('June 1')
     A            DGJU02                    TEXT('June 2')
     A            DGJU03                    TEXT('June 3')
     A            DGJU04                    TEXT('June 4')
     A            DGJU05                    TEXT('June 5')
     A            DGJU06                    TEXT('June 6')
     A            DGJU07                    TEXT('June 7')
     A            DGJU08                    TEXT('June 8')
     A            DGJU09                    TEXT('June 9')
     A            DGJU10                    TEXT('June 10')
     A            DGJU11                    TEXT('June 11')
     A            DGJU12                    TEXT('June 12')
     A            DGJU13                    TEXT('June 13')
     A            DGJU14                    TEXT('June 14')
     A            DGJU15                    TEXT('June 15')
     A            DGJU16                    TEXT('June 16')
     A            DGJU17                    TEXT('June 17')
     A            DGJU18                    TEXT('June 18')
     A            DGJU19                    TEXT('June 19')
     A            DGJU20                    TEXT('June 20')
     A            DGJU21                    TEXT('June 21')
     A            DGJU22                    TEXT('June 22')
     A            DGJU23                    TEXT('June 23')
     A            DGJU24                    TEXT('June 24')
     A            DGJU25                    TEXT('June 25')
     A            DGJU26                    TEXT('June 26')
     A            DGJU27                    TEXT('June 27')
     A            DGJU28                    TEXT('June 28')
     A            DGJU29                    TEXT('June 29')
     A            DGJU30                    TEXT('June 30')
     A            DGJL01                    TEXT('July 1')
     A            DGJL02                    TEXT('July 2')
     A            DGJL03                    TEXT('July 3')
     A            DGJL04                    TEXT('July 4')
     A            DGJL05                    TEXT('July 5')
     A            DGJL06                    TEXT('July 6')
     A            DGJL07                    TEXT('July 7')
     A            DGJL08                    TEXT('July 8')
     A            DGJL09                    TEXT('July 9')
     A            DGJL10                    TEXT('July 10')
     A            DGJL11                    TEXT('July 11')
     A            DGJL12                    TEXT('July 12')
     A            DGJL13                    TEXT('July 13')
     A            DGJL14                    TEXT('July 14')
     A            DGJL15                    TEXT('July 15')
     A            DGJL16                    TEXT('July 16')
     A            DGJL17                    TEXT('July 17')
     A            DGJL18                    TEXT('July 18')
     A            DGJL19                    TEXT('July 19')
     A            DGJL20                    TEXT('July 20')
     A            DGJL21                    TEXT('July 21')
     A            DGJL22                    TEXT('July 22')
     A            DGJL23                    TEXT('July 23')
     A            DGJL24                    TEXT('July 24')
     A            DGJL25                    TEXT('July 25')
     A            DGJL26                    TEXT('July 26')
     A            DGJL27                    TEXT('July 27')
     A            DGJL28                    TEXT('July 28')
     A            DGJL29                    TEXT('July 29')
     A            DGJL30                    TEXT('July 30')
     A            DGJL31                    TEXT('July 31')
     A            DGAU01                    TEXT('August 1')
     A            DGAU02                    TEXT('August 2')
     A            DGAU03                    TEXT('August 3')
     A            DGAU04                    TEXT('August 4')
     A            DGAU05                    TEXT('August 5')
     A            DGAU06                    TEXT('August 6')
     A            DGAU07                    TEXT('August 7')
     A            DGAU08                    TEXT('August 8')
     A            DGAU09                    TEXT('August 9')
     A            DGAU10                    TEXT('August 10')
     A            DGAU11                    TEXT('August 11')
     A            DGAU12                    TEXT('August 12')
     A            DGAU13                    TEXT('August 13')
     A            DGAU14                    TEXT('August 14')
     A            DGAU15                    TEXT('August 15')
     A            DGAU16                    TEXT('August 16')
     A            DGAU17                    TEXT('August 17')
     A            DGAU18                    TEXT('August 18')
     A            DGAU19                    TEXT('August 19')
     A            DGAU20                    TEXT('August 20')
     A            DGAU21                    TEXT('August 21')
     A            DGAU22                    TEXT('August 22')
     A            DGAU23                    TEXT('August 23')
     A            DGAU24                    TEXT('August 24')
     A            DGAU25                    TEXT('August 25')
     A            DGAU26                    TEXT('August 26')
     A            DGAU27                    TEXT('August 27')
     A            DGAU28                    TEXT('August 28')
     A            DGAU29                    TEXT('August 29')
     A            DGAU30                    TEXT('August 30')
     A            DGAU31                    TEXT('August 31')
     A            DGSE01                    TEXT('September 1')
     A            DGSE02                    TEXT('September 2')
     A            DGSE03                    TEXT('September 3')
     A            DGSE04                    TEXT('September 4')
     A            DGSE05                    TEXT('September 5')
     A            DGSE06                    TEXT('September 6')
     A            DGSE07                    TEXT('September 7')
     A            DGSE08                    TEXT('September 8')
     A            DGSE09                    TEXT('September 9')
     A            DGSE10                    TEXT('September 10')
     A            DGSE11                    TEXT('September 11')
     A            DGSE12                    TEXT('September 12')
     A            DGSE13                    TEXT('September 13')
     A            DGSE14                    TEXT('September 14')
     A            DGSE15                    TEXT('September 15')
     A            DGSE16                    TEXT('September 16')
     A            DGSE17                    TEXT('September 17')
     A            DGSE18                    TEXT('September 18')
     A            DGSE19                    TEXT('September 19')
     A            DGSE20                    TEXT('September 20')
     A            DGSE21                    TEXT('September 21')
     A            DGSE22                    TEXT('September 22')
     A            DGSE23                    TEXT('September 23')
     A            DGSE24                    TEXT('September 24')
     A            DGSE25                    TEXT('September 25')
     A            DGSE26                    TEXT('September 26')
     A            DGSE27                    TEXT('September 27')
     A            DGSE28                    TEXT('September 28')
     A            DGSE29                    TEXT('September 29')
     A            DGSE30                    TEXT('September 30')
     A            DGOC01                    TEXT('October 1')
     A            DGOC02                    TEXT('October 2')
     A            DGOC03                    TEXT('October 3')
     A            DGOC04                    TEXT('October 4')
     A            DGOC05                    TEXT('October 5')
     A            DGOC06                    TEXT('October 6')
     A            DGOC07                    TEXT('October 7')
     A            DGOC08                    TEXT('October 8')
     A            DGOC09                    TEXT('October 9')
     A            DGOC10                    TEXT('October 10')
     A            DGOC11                    TEXT('October 11')
     A            DGOC12                    TEXT('October 12')
     A            DGOC13                    TEXT('October 13')
     A            DGOC14                    TEXT('October 14')
     A            DGOC15                    TEXT('October 15')
     A            DGOC16                    TEXT('October 16')
     A            DGOC17                    TEXT('October 17')
     A            DGOC18                    TEXT('October 18')
     A            DGOC19                    TEXT('October 19')
     A            DGOC20                    TEXT('October 20')
     A            DGOC21                    TEXT('October 21')
     A            DGOC22                    TEXT('October 22')
     A            DGOC23                    TEXT('October 23')
     A            DGOC24                    TEXT('October 24')
     A            DGOC25                    TEXT('October 25')
     A            DGOC26                    TEXT('October 26')
     A            DGOC27                    TEXT('October 27')
     A            DGOC28                    TEXT('October 28')
     A            DGOC29                    TEXT('October 29')
     A            DGOC30                    TEXT('October 30')
     A            DGOC31                    TEXT('October 31')
     A            DGNO01                    TEXT('November 1')
     A            DGNO02                    TEXT('November 2')
     A            DGNO03                    TEXT('November 3')
     A            DGNO04                    TEXT('November 4')
     A            DGNO05                    TEXT('November 5')
     A            DGNO06                    TEXT('November 6')
     A            DGNO07                    TEXT('November 7')
     A            DGNO08                    TEXT('November 8')
     A            DGNO09                    TEXT('November 9')
     A            DGNO10                    TEXT('November 10')
     A            DGNO11                    TEXT('November 11')
     A            DGNO12                    TEXT('November 12')
     A            DGNO13                    TEXT('November 13')
     A            DGNO14                    TEXT('November 14')
     A            DGNO15                    TEXT('November 15')
     A            DGNO16                    TEXT('November 16')
     A            DGNO17                    TEXT('November 17')
     A            DGNO18                    TEXT('November 18')
     A            DGNO19                    TEXT('November 19')
     A            DGNO20                    TEXT('November 20')
     A            DGNO21                    TEXT('November 21')
     A            DGNO22                    TEXT('November 22')
     A            DGNO23                    TEXT('November 23')
     A            DGNO24                    TEXT('November 24')
     A            DGNO25                    TEXT('November 25')
     A            DGNO26                    TEXT('November 26')
     A            DGNO27                    TEXT('November 27')
     A            DGNO28                    TEXT('November 28')
     A            DGNO29                    TEXT('November 29')
     A            DGNO30                    TEXT('November 30')
     A            DGDE01                    TEXT('December 1')
     A            DGDE02                    TEXT('December 2')
     A            DGDE03                    TEXT('December 3')
     A            DGDE04                    TEXT('December 4')
     A            DGDE05                    TEXT('December 5')
     A            DGDE06                    TEXT('December 6')
     A            DGDE07                    TEXT('December 7')
     A            DGDE08                    TEXT('December 8')
     A            DGDE09                    TEXT('December 9')
     A            DGDE10                    TEXT('December 10')
     A            DGDE11                    TEXT('December 11')
     A            DGDE12                    TEXT('December 12')
     A            DGDE13                    TEXT('December 13')
     A            DGDE14                    TEXT('December 14')
     A            DGDE15                    TEXT('December 15')
     A            DGDE16                    TEXT('December 16')
     A            DGDE17                    TEXT('December 17')
     A            DGDE18                    TEXT('December 18')
     A            DGDE19                    TEXT('December 19')
     A            DGDE20                    TEXT('December 20')
     A            DGDE21                    TEXT('December 21')
     A            DGDE22                    TEXT('December 22')
     A            DGDE23                    TEXT('December 23')
     A            DGDE24                    TEXT('December 24')
     A            DGDE25                    TEXT('December 25')
     A            DGDE26                    TEXT('December 26')
     A            DGDE27                    TEXT('December 27')
     A            DGDE28                    TEXT('December 28')
     A            DGDE29                    TEXT('December 29')
     A            DGDE30                    TEXT('December 30')
     A            DGDE31                    TEXT('December 31')
     A            DGLCD                     TEXT('Last Change Date')
     A            DGTYLC                    TEXT('Type of Last Change')
      **Start of change CSD031
     A            DGZONE        10A         TEXT('Zone')
     A                                      COLHDG('Zone')
     A            DGIUSR        10A         TEXT('Insert User')
     A                                      COLHDG('Insert User')
     A            DGAUSR        10A         TEXT('Amend User')
     A                                      COLHDG('Amend User')
     A            DGXUSR        10A         TEXT('Authorise User')
     A                                      COLHDG('Authorise ' 'User')
     A            DGAACC         1A         TEXT('Automatically accept w/in +
     A                                      zone')
     A                                      COLHDG('Automatically ' +
     A                                       'accept w/in zone')
     A            DGEACC         5P 0       TEXT('Accept by Effective Date')
     A                                      COLHDG('Accept by' +
     A                                      'Effective Date')
     A            DGGPDT         1A         TEXT('Central Data indicator')
     A                                      COLHDG('Central Data ind.')
      **End of change CSD031
     A*.....................................................................
     A* Key fields
     A          K DGCYCD
     A          K DGLCCD
     A          K DGJDNB
     A*=====================================================================
