      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD Invalid CRSN by Timestamp & FOID')            *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/SDICRSNL0 - Midas SD Invalid CRSN by Timestamp & FOID     *
      *                                                               *
      *  (c) Finastra International Limited 2004                      *
      *                                                               *
      *  Last Amend No. MD041311           Date 19Sep16               *
      *  Prev Amend No. MD040876  *CREATE  Date 26Aug16               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD041311 - CRS Type is populated even if there is no CRS Type*
      *             defined in MQ input (Recompile)                   *
      *  MD040876 - CRS MQ                                            *
      *                                                               *
      *****************************************************************
      *
     A          R SDICRSND0                 PFILE(SDICRSNPD)
      *
      ** Start of change MD041311
     A**********K DDTMSN                                                                    MD041311
     A**********K DDFRNN                                                                    MD041311
     A          K DDNAHD
      ** End of change MD041311
