      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD Interface Password Validation Core File')     *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/SDIPVCL0 - Midas SD Interface Password Validation Core    *
      *                File (Keyed by ICINTF)                         *
      *                                                               *
      *  (c) Finastra International Limited 2018                      *
      *                                                               *
      *  Last Amend No. MD053314 *CREATE   Date 30Apr19               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD053314 - Ensure user cannot be deleted when attached to    *
      *             an Interface.                                     *
      *                                                               *
      *****************************************************************
      *
     A                                      UNIQUE
     A          R SDIPVCD0                  PFILE(SDIPVCPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited 2018')
      *
      ** Key fields.
      *
     A          K ICINTF
      *
