      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD IRM extract filter retrieval')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/SDIRMFL1 - Midas SD IRM extract filter retrieval          *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CSD003             Date 22Apr99               *
      *                 CRM001             Date 07Feb95               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  CRM001 - Interest Risk management changes:                   *
      *           New file                                            *
      *****************************************************************
     A                                      UNIQUE
     A*=====================================================================
     A          R @IRMFL1                   PFILE(SDIRMFPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            FNIETY                    TEXT('IRM Entity')
     A            FNETFC                    TEXT('Entity Filter Code')
     A            FNLCD                     TEXT('Last Change Date')
     A            FNTYLC                    TEXT('Type of Last Change')
     A            FNDSSQ                    TEXT('Display Sequence')
     A*.....................................................................
     A* Key fields
     A          K FNIETY
     A          K FNETFC
     A*=====================================================================
