      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD Invalid Swift Details')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data ILE Module                             *
      *                                                               *
      *  LF/SDISWFDL0 - Invalid Customers - SWIFT Details             *
      *                                                               *
      *  (c) Finastra International Limited 2007                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CSW216             Date 14Mar16               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *                 CSW207A *CREATE    Date 07Aug07               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSW216 - SWIFT Changes 2016 (Recompile)                      *
      *  CSW207A - SWIFT 2007 Changes                                 *
      *                                                               *
      *****************************************************************
     A          R SDISWFDD0                 PFILE(SDISWSDPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2007')
 
     A          K DDTMESTMP
     A          K DDFOTRANID
