      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD Joint Account Holder Dtls Retrieval index')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/SDJUSRL1 - Joint A/c Holders Retrieval                    *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *                                                               *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Last Amend No. 248798             Date 10Jul07               *
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CPM005             DATE 12JUN96               *
      *                 xxxxxx             DATE ddMMMyy               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  248798 - Applied fix 219660.                                 *
      *  219660 - Remove unique key.                                  *
      *  CPM005 - Private Banking phase 2 - new file                  *
      *                                                               *
      *****************************************************************
     A**********                            UNIQUE                                            219660
     A*=====================================================================
     A          R @JUSRL2                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                      PFILE(SDJUSRPD)
     A*---------------------------------------------------------------------
     A            F3CUST                    TEXT('Customer Number')
     A            F3URID                    TEXT('User Identification')
     A            F3ACHO                    TEXT('Account Holder Indicator')
     A            F3VECO                    TEXT('Verbal Communication Ind.')
     A            F3WRCO                    TEXT('Written Communication Ind')
     A            F3SIGN                    TEXT('Signature Indicator')
     A            F3POWA                    TEXT('Power of Attorney Ind.')
     A            F3DOCI                    TEXT('Documents Completed Ind.')
     A            F3BIRT                    TEXT('Birthdate')
     A            F3PASN                    TEXT('Passport Number')
     A            F3UTX1                    TEXT('User Text Line 1')
     A            F3UTX2                    TEXT('User Text Line 2')
     A            F3LCD                     TEXT('Last Change Date')
     A            F3TYLC                    TEXT('Type of Last Change')
     A*.....................................................................
     A* Key fields
     A          K F3URID
     A*=====================================================================
