      *****************************************************************
/*STD *: LFBASE                                                     : *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD Local Clearing System Details')               *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/SDLCSDL4 - Local Clearing System Details                  *
      *                                                               *
      *  (c) Finastra International Limited 2004                      *
      *                                                               *
      *  Last Amend No. MD058190           Date 25May21               *
      *  Prev Amend No. MD031937           Date 13Jan15               *
      *                 AR856737           Date 13Sep11               *
      *                 ESL038    *CREATE  Date 04Apr2005             *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD058190 - FT0300 Compile Error Due to Missing Files.        *
      *             (Recompile)                                       *
      *  MD031937 - Upgrade STP enhancements to BF Midas 2.1          *
      *  AR856737 - Upgrade STP enhancements to Midas Plus level      *
      *  ESL038 - PLN Abroad - Inclusion of EBB013                    *
      *                                                               *
      *****************************************************************
     A          R @LCSDV0                   PFILE(SDLCSDPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited 2004')
      *---------------------------------------------------------------------
     A            LCCLID                    TEXT('Clearing System Id.')
     A            LCDESC                    TEXT('Description')
     A            LCCYCD                    TEXT('Clearing Currency')
     A            LCVSTC                    TEXT('Validate Settle Ccy')
     A            LCSETM                    TEXT('Settlement Method')
     A            LCSTMU                    TEXT('Underlying Settlement Method')
     A            LCASTM                    TEXT('Amend Settlement Method')
     A            LCDFSN                    TEXT('Default Sndr')
     A            LCSETA                    TEXT('Settlement Account')
     A            LCSEAC                    TEXT('Settlement Account Code')
     A            LCNWRK                    TEXT('Network Id.')
     A            LCLLIM                    TEXT('Lower Limit Amount')
     A            LCULIM                    TEXT('Upper Limit Amount')
     A            LCWLIM                    TEXT('Limit Warning/Error')
     A            LCLOCI                    TEXT('Location Id.')
     A            LCINCT                    TEXT('Input Cut-Off Time')
     A            LCINCD                    TEXT('Input Cut-Off Days')
     A            LCAUCT                    TEXT('Auth. Cut-Off Time')
     A            LCAUCD                    TEXT('Auth. Cut-Off Days')
     A            LCM103                    TEXT('MT103 Messages Allowed')
     A            LCM202                    TEXT('MT202 Messages allowed')
     A            LCM205                    TEXT('MT205 Instead of 202')
     A            LCMSTS                    TEXT('Message Creation Status')
     A            LCSVAC                    TEXT('Value-Add Service Code')
     A            LCCCIM                    TEXT('Clearing Customer Info.')
     A            LCAUTK                    TEXT('Authentication Key')
     A            LCCTRY                    TEXT('SWIFT Country Code')
     A            LCYCPY                    TEXT('Y-Copy Service')
     A            LCF108                    TEXT('Field 108')
     A            LCF113                    TEXT('Field 113')
     A            LCF71A                    TEXT('Field 71A')
     A            LCS53A                    TEXT('Suppress 53A')
     A            LCOV53                    TEXT('Override Field 53')
     A            LCCB53                    TEXT('Customer/BIC 53')
     A            LCS54A                    TEXT('Suppress 54 A/c Line')
     A            LCTNOT                    TEXT('Notice Days')
     A            LCF50I                    TEXT('IBAN in 50')
     A            LCF59I                    TEXT('IBAN in 59')
     A            LCCPAY                    TEXT('Local Clearing as Cover')
     A            LCCVRF                    TEXT('Local Clearing Cover Flag')
     A            LCF54L                    TEXT('Rec Cor = Clearing')
     A            LCCTNT                    TEXT('Cover Notice Days')
     A            LCCNWK                    TEXT('Cover Network Id.')
     A            LCC205                    TEXT('Cover MT205 Instead of 202')
     A            LCCSTS                    TEXT('Message Creation Status')
     A            LCCCPY                    TEXT('Cover Y-Copy Service')
     A            LCC108                    TEXT('Cover Field 108')
     A            LCC113                    TEXT('Cover Field 113')
     A            LCRECA                    TEXT('Receive Account')
     A            LCLSTM                    TEXT('Lesser Settle Method')
     A            LCGSTM                    TEXT('Greater Settle Method')
     A            LCTSTM                    TEXT('Time Settle Method')
      *---------------------------------------------------------------------
     A          K LCCLID
     A          K LCCYCD
      *
