      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD Location codes')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/SDLOCNL0 - Midas SD Location codes update                 *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD031             Date 10Apr06               *
      *  Prev Amend No. CGP001             Date 12Nov03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CSW097             Date 20May99               *
      *                 CSD003             DATE 22APR99               *
      *                 S01459             DATE 22APR99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD031 - Enhanced Centralised Static Data                    *
      *  CGP001 - Global Processing                                   *
      *  CSW097 - SWIFT 1997 Changes for FRAIRS MT34* and MT36*.      *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  S01459 - Addition of Midas headerbox.                        *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A*=====================================================================
     A          R @DVREHI                   PFILE(SDLOCNPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            DVLCCD                    TEXT('Location Code')
     A            DVCNCD                    TEXT('Country Code')
     A            DVLCD                     TEXT('Last Change Date')
     A            DVTYLC                    TEXT('Type of Last Change')
     A            DVLCNM                    TEXT('Location Name')
     A            DVLDCY                    TEXT('Local Dealing Currency')
     A            DVMLOC                    TEXT('Midas Export Value MLOC')
     A*                                              Begin /CSW097/
     A            DVISFC                    TEXT('ISDA Financial Centre')
     A*                                              End   /CSW097/
      * Start of change CGP001
     A            DVZONE                    TEXT('Zone')
      * End of change CGP001
      **Start of change CSD031
     A            DVIUSR        10A         TEXT('Insert User')
     A                                      COLHDG('Insert User')
     A            DVAUSR        10A         TEXT('Amend User')
     A                                      COLHDG('Amend User')
     A            DVXUSR        10A         TEXT('Authorise User')
     A                                      COLHDG('Authorise ' 'User')
     A            DVAACC         1A         TEXT('Automatically accept w/in +
     A                                      zone')
     A                                      COLHDG('Automatically ' +
     A                                       'accept w/in zone')
     A            DVEACC         5P 0       TEXT('Accept by Effective Date')
     A                                      COLHDG('Accept by' +
     A                                      'Effective Date')
     A            DVGPDT         1A         TEXT('Central Data indicator')
     A                                      COLHDG('Central Data ind.')
      **End of change CSD031
     A*.....................................................................
     A* Key fields
     A          K DVLCCD
     A*=====================================================================
