      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD Market Data Feed Source Codes')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/SDMDFSL0 - Midas SD Market Data Feed Source Codes         *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CUP022             Date 10Mar04               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *  Prev Amend No. CSD006             Date 06Sep00               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CUP022 - Key field should be unique for the action file      *
      *           utility.                                            *
      *  CSD006 - Market Data Feeds                                   *
      *                                                               *
      *****************************************************************
      **Start of change CUP022
     A                                      UNIQUE
      **End of change CUP022
     A          R SDMDFSD0                  PFILE(SDMDFSPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*.....................................................................
     A* KEY fields
     A          K DSDTSC
