      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD Midas export ICD')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/SDMEXPL1 - Midas SD Export data ICD retrieval             *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CSD003             Date 22Apr99               *
      *                 101971             Date 22Apr96               *
      *                 S01493             Date 23MAY94               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  101971 - Addition of 'Drip Feed Batch Retention Period'      *
      *           field to SDMEXPPD.                                  *
      *  S01493 - Midas Export Data Development:                      *
      *           - New file created for this development.            *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A*=====================================================================
     A          R @MEXPL1                   PFILE(SDMEXPPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            E7MEXP                    TEXT('Midas Export Data ICD Key')
     A            E7LCD                     TEXT('Last Change Date')
     A            E7TYLC                    TEXT('Type of Last Change')
     A            E7DFEN                    TEXT('Drip Feed Transfer Enable')
     A            E7DFWT                    TEXT('Drip Feed Wait Time')
     A            E7DFMR                    TEXT('Drip Feed Max Rcds/Batch')
     A            E7BUEN                    TEXT('Bulk Transfer Enabled')
     A            E7BUMR                    TEXT('Bulk Transfer Max Rcd/Bch')
     A            E7DFRP                    TEXT('Drip Feed Batch Retn Perd')
     A*.....................................................................
     A* Key fields
     A          K E7MEXP
     A*=====================================================================
