      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD Midas modules update')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/SDMMODL0 - Midas SD Midas module flags update             *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Last Amend No. CPB001             DATE 08JUN99               *
      *  Prev Amend No. CSD003             DATE 22APR99               *
      *                 CTI001             DATE 08APR97               *
      *                 CPL002             DATE 19MAR97               *
      *                 CRM001             DATE 16FEB95               *
      *                 S01522             DATE 07OCT94               *
      *                 S01505             DATE 21JUN94               *
      *                 S01486             DATE 21JUN94               *
      *                 S01459             DATE 21JUN94               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CPB001 - Field BGN4ST allocated to the Private Banking mod.  *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  CTI001 - Trade Innovation Interface.                         *
      *           - Changed name of field BGN3ST to Midas-Trade       *
      *             Innovation Interface.                             *
      *  CPL002 - Plato Interface:                                    *
      *           changed name of field N2ST to Midas-Plato Interface.*
      *  CRM001 - Changed 'Risk Management' to 'Interest Risk         *
      *           Management'.                                        *
      *  S01522 - Addition of 'User Defined Correspondence' module.   *
      *  S01505 - Addition of 'Analytical Accounting' module.         *
      *  S01486 - Private Banking development:                        *
      *           Change 'Lombard Credits' to 'Portfolio Lending'.    *
      *  S01459 - Addition of Midas headerbox.                        *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A*=====================================================================
     A          R @BGREC7                   PFILE(SDMMODPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            BGMODS                    TEXT('Modules')
     A            BGLCD                     TEXT('Last Change Date')
     A            BGTYLC                    TEXT('Type of Last Change')
     A            BGMTMI                    TEXT('Midas/Telex Module Ind.')
     A            BGSWFT                    TEXT('SWIFT Funds Transfer')
     A            BGSWST                    TEXT('SWIFT Securities Trading')
     A            BGSWCL                    TEXT('SWIFT Customer Lending')
     A            BGSWSL                    TEXT('SWIFT Synd Loans (REDUN)')
     A            BGSWSM                    TEXT('SWIFT Statements')
     A            BGSWDL                    TEXT('SWIFT Dealing')
     A            BGSDGL                    TEXT('Standing data/Gen.Ledger')
     A            BGDLFX                    TEXT('Dealing: FX')
     A            BGSYLN                    TEXT('Syndicated Loans (REDUN)')
     A            BGEXMG                    TEXT('Exposure Management')
     A            BGFNMO                    TEXT('Financial Modeller')
     A            BGSTRT                    TEXT('Statutory Returns')
     A            BGCSLN                    TEXT('Customer Lending')
     A            BGRTBN                    TEXT('Retail Banking')
     A            BGMSDL                    TEXT('Midas/Swift direct link')
     A            BGSECS                    TEXT('Securities')
     A            BGAURC                    TEXT('Auto-reconciliations')
     A            BGBDLI                    TEXT('Bond Dealers Interface')
     A            BGDRSD                    TEXT('DRS Standing Data')
     A            BGDRCM                    TEXT('DRS Control module')
     A            BGDRFE                    TEXT('DRS Foreign Exchange')
     A            BGDRMM                    TEXT('DRS Money Market')
     A            BGDRAR                    TEXT('DRS Arbitrage')
     A            BGFDTR                    TEXT('Funds Transfer')
     A            BGDRCA                    TEXT('DRS Common Applications')
     A            BGFUOP                    TEXT('Futures & Options')
     A            BGMTSL                    TEXT('Midas/Telex Synd. Loans')
     A            BGMTDL                    TEXT('Midas/Telex Dealing')
     A            BGMTGL                    TEXT('Midas/Telex Gen. Ledger')
     A            BGMTCL                    TEXT('Midas/Telex Cust. Lending')
     A            BGNWMI                    TEXT('Message Management')
     A            BGFIIN                    TEXT('FRA/IRS Indicator')
     A            BGDLMM                    TEXT('Dealing: MM')
     A            BGINCN                    TEXT('Internal Contracts')
     A            BGTRMG                    TEXT('Treasury Management')
     A            BGRKMG                    TEXT('Interest Risk Management')
     A            BGTSKY                    TEXT('Testkey')
     A            BGMIDQ                    TEXT('Midas/Q')
     A            BGMFIC                    TEXT('Microfiche')
     A            BGIOAC                    TEXT('Interest on accounts')
     A            BGWDPR                    TEXT('Window processing requir.')
     A            BGSARP                    TEXT('SAR''s processing required')
     A            BGFRIN                    TEXT('French return indicator')
     A            BGLRIN                    TEXT('Lux return indicator')
     A            BGDRIN                    TEXT('Dutch return indicator')
     A            BGGRIN                    TEXT('German return indicator')
     A            BGBRIN                    TEXT('Belgian return indicator')
     A            BGIRIN                    TEXT('Italian return indicator')
     A            BGSWEI                    TEXT('Swift External Interface')
     A            BGPFMG                    TEXT('Portfolio Management')
     A            BGCRMG                    TEXT('Credit Management.')
     A            BGHORP                    TEXT('Head Office Reporting')
     A            BGAVBL                    TEXT('Average Balances')
     A            BGMARG                    TEXT('Margins')
     A            BGCFMT                    TEXT('Confirmation Matching')
     A            BGMIMX                    TEXT('Mimix')
     A            BGRCFI                    TEXT('Report Control Facility')
     A            BGAMIN                    TEXT('Amps Int')
     A            BGSWRT                    TEXT('Swiss Returns')
     A            BGFLND                    TEXT('Fiduciary Loans & Deposits')
     A            BGLMCR                    TEXT('Portfolio Lending')
     A            BGCNTX                    TEXT('Cantonal Tax')
     A            BGSTDU                    TEXT('Stamp Duty')
     A            BGUDRS                    TEXT('Use DRS Shortnames')
     A            BGCHDL                    TEXT('Chips Dealing')
     A            BGCHLN                    TEXT('Chips Lending')
     A            BGCHOB                    TEXT('Chips Opening Balance')
     A            BGCHIP                    TEXT('CHIPS')
     A            BGCHDI                    TEXT('Chips Direct Link')
     A            BGOPDK                    TEXT('Optical Disk')
     A            BGMBIN                    TEXT('Multi-branching Indicator')
     A            BGNNST                    TEXT('Leo Data Nucleus')
     A            BGNOST                    TEXT('Leo Letters of Credit')
     A            BGNPST                    TEXT('Leo Collections')
     A            BGNQST                    TEXT('Leo Bills/Financing')
     A            BGNRST                    TEXT('Leo Bankers Acceptances')
     A            BGNSST                    TEXT('Leo Reimbursements')
     A            BGNTST                    TEXT('Taxes')
     A            BGNUST                    TEXT('History & Audit Facility')
     A            BGNVST                    TEXT('Management Accounts')
     A            BGNWST                    TEXT('IBLC Returns')
     A            BGNXST                    TEXT('Retail 3')
     A            BGNYST                    TEXT('Interest on Accounts 3')
     A            BGNZST                    TEXT('Midas Export Data Module')
     A            BGN0ST                    TEXT('Analytical Accounting')
     A            BGN1ST                    TEXT('User Defined Correspondence')
     A            BGN2ST                    TEXT('Midas-Plato Interface')
     A            BGN3ST                    TEXT('Midas-Trade Innovation If')
     A**********  BGN4ST                    TEXT('Reserved for Later Use 41')                 CPB001
     A            BGN4ST                    TEXT('Private Banking')                           CPB001
     A            BGN5ST                    TEXT('Reserved for Later Use 42')
     A            BGN6ST                    TEXT('Reserved for Later Use 43')
     A            BGN7ST                    TEXT('Reserved for Later Use 44')
     A            BGN8ST                    TEXT('Reserved for Later Use 45')
     A            BGN9ST                    TEXT('Reserved for Later Use 46')
     A            BGOAST                    TEXT('Reserved for Later Use 47')
     A            BGOBST                    TEXT('Reserved for Later Use 48')
     A            BGOCST                    TEXT('Reserved for Later Use 49')
     A            BGODST                    TEXT('Reserved for Later Use 50')
     A            BGOEST                    TEXT('Reserved for Later Use 51')
     A            BGOFST                    TEXT('Reserved for Later Use 52')
     A            BGOGST                    TEXT('Reserved for Later Use 53')
     A            BGOHST                    TEXT('Reserved for Later Use 54')
     A            BGOIST                    TEXT('Reserved for Later Use 55')
     A            BGOJST                    TEXT('Reserved for Later Use 56')
     A            BGOKST                    TEXT('Reserved for Later Use 57')
     A            BGOLST                    TEXT('Reserved for Later Use 58')
     A            BGOMST                    TEXT('Reserved for Later Use 59')
     A            BGONST                    TEXT('Reserved for Later Use 60')
     A            BGOOST                    TEXT('Reserved for Later Use 61')
     A            BGOPST                    TEXT('Reserved for Later Use 62')
     A            BGOQST                    TEXT('Reserved for Later Use 63')
     A            BGORST                    TEXT('Reserved for Later Use 64')
     A            BGOSST                    TEXT('Reserved for Later Use 65')
     A*.....................................................................
     A* Key fields
     A          K BGMODS
     A*=====================================================================
