      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD Midas/SWIFT direct link')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/SDMSDLL0 - Midas/Swift Direct Link                        *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Last Amend No. nnnnnn  *CREATE    Date ddmmmyy               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  nnnnnn - (change description)                                *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A*=====================================================================
     A          R @BSREE6                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                      PFILE(SDMSDLPD)
     A*---------------------------------------------------------------------
     A            BSMSDD                    TEXT('MSDL Data')
     A            BSLCD                     TEXT('Last Change Date')
     A            BSTYLC                    TEXT('Type of Last Change')
     A            BSDSMN                    TEXT('Drop SWIFT Msgs No. Days')
     A            BSSCDL                    TEXT('SWIFT Confs Print - DL')
     A            BSSCLE                    TEXT('SWIFT Confs Print - LE')
     A            BSSGSE                    TEXT('SWIFT Generation - SE')
     A            BSGMP                     TEXT('Generate Multiple Pay')
     A            BSGMR                     TEXT('Generate Multiple Receive')
     A            BSS2HF                    TEXT('SWIFT II Header Flag')
     A            BSPRUS                    TEXT('Protocol Used')
     A*.....................................................................
     A* Key fields
     A          K BSMSDD
     A*=====================================================================
