      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD Profit centre accounting ICD retrieve')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/SDPCACL1 - Midas SD Profit centre accounting ICD retrieve *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CSD003             Date 22Apr99               *
      *                 CAC001             Date 04Dec95               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  CAC001 - Profit Centre Accounting Development:               *
      *           New ICD file.                                       *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A*=====================================================================
     A          R @PCACL1                   PFILE(SDPCACPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            FTPCAI                    TEXT('Profit Centre A/C ICD KEY')
     A            FTLCD                     TEXT('Last Change Date')
     A            FTTYLC                    TEXT('Type of Last Change')
     A            FTPRCG                    TEXT('Primary Control Group')
     A            FTPFGA                    TEXT('Primary Funding Gap A/C')
     A            FTFNBR                    TEXT('Funding Base Rate')
     A            FTFNIC                    TEXT('Funding Int A/C Code')
     A            FTFNAA                    TEXT('Funding Accrual A/C Code')
     A            FTFGCF                    TEXT('Funding Gap Capitalis Frq')
     A            FTPRFP                    TEXT('Primary Fund Profit Centr')
     A            FTEYPC                    TEXT('End of Year P&L Prft Cntr')
     A            FTUAPC                    TEXT('Unallocated Prof Centre')
     A            FTTFRT                    TEXT('Tol for Funding Rate')
     A            FTTMRT                    TEXT('Tol for FX Margin Rate')
     A            FTFMAC                    TEXT('FX Margin Account')
     A*.....................................................................
     A* Key fields
     A          K FTPCAI
     A*=====================================================================
