      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD Midas system pulldown headers by group')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/SDPDWHL0 - Midas System Pulldown Headers by Group         *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CUP101R            Date 02Nov05               *
      *  Prev Amend No. CUP101             Date 11Jul05               *
      *                 CGP001             Date 23May03               *
      *                 CSD014  *CREATE    Date 12Jun03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CUP101R - Recompiled                                         *
      *  CUP101  - This file should share format with GZSDPDWHPD.     *
      *            (Recompiled)                                       *
      *  CGP001 - Global Processing                                   *
      *  CSD014 - New Technology Infrastructure:                      *
      *           - New file to hold Java pulldown information.       *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A          R @PDWHL0                   PFILE(SDPDWHPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
      *
     A            GHHIND
     A            GHMMID
     A            GLGRUP
     A            GHDESC
     A            GHMMSN
      * Start of change CGP001
     A            GHZONE
      * End of change CGP001
      *
     A          K GHMMID
     A          K GLGRUP
