      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas Live instr.by display group and instrum.')
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Management Module                      *
     A*                                                               *
     A*  LF/SDPLINL2 - IVE INSTRUMENTS IN DISPLAY GROUP AND           *
     A*            INSTRUMENT SEQUENCE                                *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CLE025             Date 20Oct03               *
      *  Prev Amend No. CGP001             Date 23May03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CPL002             Date 08Mar99               *
     A*                 S01486             DATE 11AUG94               *
     A*                 B9997              DATE DATE 01O              *
     A*                 B4586              DATE 02AUG91               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  CLE025 - Credit Lines (Recompile)                            *
      *  CGP001 - Global Processing                                   *
     A*  CPL002 - Midas-Plato Interface (Recomplied)                  *
     A*  S01486 - Portfolio Management Upgrade to R10.                *
     A*  B9997  - SUPPRESS CORRECTION B4586                           *
     A*  B4586  - WRONG KEY FIELD USED                                *
     A*---------------------------------------------------------------*
     A*           C R E A T I O N     P A R A M E T E R S             *
     A*
     A********************************************************************
     A                                      DYNSLT
     A          R SDPLINP0                  PFILE(SDPLINPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A* B4586   K PDDSPG
     A* B9997 BEGIN ****
     A**********K PDLOMG
     A          K PDDSPG
     A* B9997 END ******
     A* B4586
     A          K PDINNR
     A          S PDRECI                    COMP(EQ 'D')
