      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas Reporting Codes Descending Retrieval Ind')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/SDREPCL2 - Reporting Codes Descending Retrieval           *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CSD003             Date 02Jan98               *
      *                 S01459             Date 02Jan98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  S01459 - Addition of Midas headerbox.                        *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A*=====================================================================
     A          R @REPCAU                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A                                      PFILE(SDREPCPD)
     A*---------------------------------------------------------------------
     A            G4RSNO                    TEXT('Reporting Set Number')
     A            G4RSCD                    TEXT('Reporting Structure Code')
     A            G4LVNB                    TEXT('Level Number')
     A            G4RPNA                    TEXT('Reporting Narrative')
     A            G4TYLC                    TEXT('Type of Last Change')
     A            G4LCD                     TEXT('Last Change Date')
     A*.....................................................................
     A* Key fields
     A          K G4RSNO                    DESCEND
     A          K G4RSCD                    DESCEND
     A*=====================================================================
