      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IMSN                                                      *
/*EXI *  TEXT('Midas SD Customer safe handling details retrev')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/SDSAFEL1 - SAFE CUSTOMER DETAILS RETRIEVAL                *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  PREV AMEND NO. 082067 *CREATE     DATE 24JAN95               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  082067 - New file created for this amendment.                *
      *                                                               *
      *****************************************************************
      *  C R E A T I O N     P A R A M E T E R S                      *
      *                                                               *
      *****************************************************************
     A          R SDSAFEPF                  PFILE(SDSAFEPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            SACUST                    TEXT('Customer number')
     A            SACSSN                    TEXT('Cust. Shortname')
     A            SACRNM                    TEXT('Cust. report name')
     A            SACRTN                    TEXT('Cust. Report Town')
     A            SASFN1                    TEXT('Safe NO')
     A            SASFS1                    TEXT('Size')
     A            SASFI1                    TEXT('Rented')
     A            SASFN2                    TEXT('Safe NO')
     A            SASFS2                    TEXT('Size')
     A            SASFI2                    TEXT('Rented')
     A            SASFN3                    TEXT('Safe NO')
     A            SASFS3                    TEXT('Size')
     A            SASFI3                    TEXT('Rented')
     A            SASFN4                    TEXT('Safe NO')
     A            SASFS4                    TEXT('Size')
     A            SASFI4                    TEXT('Rented')
     A            SASFN5                    TEXT('Safe NO')
     A            SASFS5                    TEXT('Size')
     A            SASFI5                    TEXT('Rented')
     A            SACHTP                    TEXT('Reci')
      *
     A          K SACUST
