      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD Securities clients by front office id')
      *****************************************************************
      *                                                               *
      *  Midas - STANDING DATA ILE Module                             *
      *                                                               *
      *  LF/SDSECDL0 - SD SECURITY CUSTOMERS BY FRONT OFFICE ID       *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSE070             Date 15Feb05               *
      *                 BUG3122            Date 07Jul04               *
      *                 CGL029             Date 01Sep03               *
      *                 CSE042             Date 05Feb03               *
      *                 CSE041             Date 05Feb03               *
      *                 CSE039             Date 05Feb03               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 CSE022             Date 29Mar01               *
      * Midas DBA 3.03 -----------------------------------------------*
      *                 CAP039  *CREATE    Date 28Oct99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSE070 - Repo Coupon Claims Report                           *
      *  BUG3122 - Recompiled due to global processing (CGP001).      *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CSE042 - Auto Feed of Trades and Movements (Recompile)       *
      *  CSE041 - DVP/RVP Processing (Recompile)                      *
      *  CSE039 - Automatic Settlement of Trades (Recompile)          *
      *  CSE022 - Depository Definition Enhancement (Recompile)       *
     A*  CAP039 - Conversion of Midas inputs to modular API           *
     A*           structure. Security Customer Details.               *
      *                                                               *
      *****************************************************************
     A          R SDSECSD0                  PFILE(SDSECSPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A          K BFFRNT
