      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD All Midas system refs by system value')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/SDSREFL0 - All Midas System References by System Ref      *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD014  *CREATE    Date 11Jun03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD014 - Midas system references project:                    *
      *           - New file.                                         *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A          R @SREFL0                   PFILE(SDSREFPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
     A            GKSREF
     A            GKMMOD
     A            GKDESC
     A            GKREF
     A            GKINFO
     A            GKATTR
     A            GKDLEN
     A            GKSWCH
     A            GKLCD
     A            GKLCT
      *
     A          K GKSREF
