      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD Stamp Tax Installation Control (Update)')     *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data                                        *
      *                                                               *
      *  LF/SDSTPTL0 - Stamp Tax Installation Control (Update)        *
      *                                                               *
      *  (C) Copyright Finastra International Limited 2010            *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CER049 *CREATE     Date 06Dec10               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CER049 - Stamp Tax                                           *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
 
     A          R @STPTV0                   PFILE(SDSTPTPD)
     A                                      TEXT('(c) Finastra International +
     A                                      Limited 2010')
 
     A            A1KEY         10          TEXT('Key Field - ICD')
     A            A1STCY         3          TEXT('Stamp Tax Currency')
     A            A1STRT        13S 8       TEXT('Stamp Tax Rate')
     A            A1SECC         2          TEXT('Security Charge Code')
     A            A1SERT        13S 8       TEXT('Securities Stamp Tax Rate')
     A            A1DFTT         1          TEXT('Default Type')
     A            A1EDTE         5S 0       TEXT('Effective Date')
     A            A1STCN         3          TEXT('New Stamp Tax Currency')
     A            A1STRN        13S 8       TEXT('New Stamp Tax Rate')
     A            A1SECN         2          TEXT('New Security Charge Code')
     A            A1SERN        13S 8       TEXT('New SE Stamp Tax Rate')
     A            A1EDTN         5S 0       TEXT('New Effective Date')
     A            A1DFTN         1          TEXT('New Default Type')
     A            A1LCD          5S 0       TEXT('Last Change Date')
     A            A1TYLC         1          TEXT('Type of Last Change')
 
      ** Keys
 
     A          K A1KEY
