      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD Cust Ext SWIFT Details Shadow File')          *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDSWSHL1 - Customer Ext SWIFT Details Shadow Update       *
      *                                                               *
      *  (c) Finastra International Limited 2007                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CSW216             Date 14Mar16               *
      *                 CSW214             Date 25Nov14               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *                 BUG14969  *CREATE  Date 09Oct07               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSW216 - SWIFT Changes 2016 (Recompile)                      *
      *  CSW214 - SWIFT Changes 2014 (Recompile)                      *
      *  BUG14969 - Cannot authorise amendments to Customer details   *
      *             SWIFT additional fields.                          *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A*=====================================================================
     A          R SDSWSHD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2007')
     A                                      PFILE(SDSWSHPD)
     A*---------------------------------------------------------------------
     A* Key fields
     A          K CSCUSD
     A*=====================================================================
