      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas SD Window Layout File')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/SDWLAYL1 - Midas SD Window layout file retrieval          *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Last Amend No. CSD003             DATE 22APR99               *
      *  Prev Amend No. S01459             DATE 22APR99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  S01459 - Addition of Midas headerbox.                        *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A*=====================================================================
     A          R @DNREGZ                   PFILE(SDWLAYPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            DNWDCN                    TEXT('Window Controller Name(K)')
     A            DNLNNO                    TEXT('Line No.')
     A            DNFDAT                    TEXT('Field Attribute')
     A            DNNOCF                    TEXT('Name of Character Field')
     A            DNNFTC                    TEXT('Name of File to Change')
     A            DNTXAT                    TEXT('Text Attribute')
     A            DNDSFL                    TEXT('Data Stream for Line')
     A*.....................................................................
     A* Key fields
     A          K DNWDCN
     A          K DNLNNO
     A*=====================================================================
