      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Logical File based on SDDPMVQD')                       *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  LF/V_SDDPMVQD - DPMV REPO Extension File                     *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2007            *
      *                                                               *
      *  Last Amend No. AR696095           Date 25Jan11               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CAP186C *CREATE    Date 16Nov07               *
      *                 XXXXXX             Date                       *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  AR696095 - Moved from SDDDSSRCDP to SDDDSSRCDM (Recompile)   *
      *             (Child: AR700180)                                 *
      *  CAP186C - MQ Enabled CB APIs                                 *
      *                                                               *
      *****************************************************************
 
     A          R SDDPMVL0                  PFILE(SDDPMVQD)
                                            TEXT('(c) Misys International +
                                            Banking Systems Ltd. +
                                            2007')
      *
     A            DQDPSS                    TEXT('Security shortname')
     A            DQDPRN                    TEXT('Reference')
     A            DQDPMV                    TEXT('Movement type')
     A            DQDPBA                    TEXT('Branch')
     A            DQFRID                    TEXT('Front office ID')
     A            F1FRID                    TEXT('Parent Front office ID')
      *
