      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SF Valid action codes for user/brch/item')
      *****************************************************************
      *                                                               *
      *  Midas - Security Profile Facility                            *
      *                                                               *
      *  PF/MACBRDD - Valid Action Codes by Branch                    *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Prev Amend No. CUP037             Date 08Mar07               *
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CGP002             Date 11Aug03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 RT0148             Date 06Jun91               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CUP037 - Change shared format to avoid daisy-chaining.       *
      *  CGP002 - Global Processing                                   *
      *           - Change to share format with the new global        *
      *             version of this file.                             *
      *  RT0148 - Increase the number of action codes to 10.          *
      *                                                               *
     A*****************************************************************
      * Start of change CGP002
      * Start CUP037
     A**********R MACBRDDF                  FORMAT(GPMACBRDD)                                 CUP037
     A          R MACBRDDF                  FORMAT(GZMACBRDD)
      * End CUP037
      *
      *
      **********                                                                              CGP002
     A**********                            REF(MFRFL)                                        CGP002
     A**********R MACBRDDF                  TEXT('(c) Misys International +                   CGP002
     A**********                            Banking Systems Ltd. +                            CGP002
     A**********                            2001')                                            CGP002
     A**********  RECI      R                                                                 CGP002
     A**********  USRP      R                                                                 CGP002
     A**********  MGRP      R                                                                 CGP002
     A**********  ICDE      R                                                                 CGP002
     A**********  BRCB      R                                                                 CGP002
     A**********  ACA1      R                                                                 CGP002
     A**********  ACA2      R                                                                 CGP002
     A**********  ACA3      R                                                                 CGP002
     A**********  ACA4      R                                                                 CGP002
     A**********  ACA5      R                                                                 CGP002
     A**********  ACA6      R                                                                 CGP002
     A**********                                             /RT0148/                         CGP002
     A**********  ACA7      R                                                                 CGP002
     A**********  ACA8      R                                                                 CGP002
     A**********  ACA9      R                                                                 CGP002
     A**********  ACA10     R                                                                 CGP002
     A**********                                             /RT0148/                         CGP002
     A**********  LCD       R                                                                 CGP002
     A**********  CHTP      R                                                                 CGP002
     A**********  LCT       R                                                                 CGP002
     A**********                                                                              CGP002
      * End of change CGP002
