      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE Cost of Funds Extract')
     A********************************************************************
     A*                                                                  *
     A*  Midas - Securities Trading Module
     A*                                                                  *
     A*    PF/COFEXD  -  COST OF FUNDS EXTRACT - DETAIL                  *
     A*                                                                  *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                                  *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*    LAST AMEND NO. S01117   DATE 03/01/89                         *
     A*                                                                  *
     A********************************************************************
     A*    S01117 - MULTIBRANCHING                                       *
     A********************************************************************
     A*                                                                  *
     A*         /////////////////////////////////////////                *
     A*        // WARNING: When creating this physical//                 *
     A*       //   file, take option                 //                  *
     A*      //                MAINTENANCE (*REBLD) //                   *
     A*     /////////////////////////////////////////                    *
     A*                                                                  *
     A********************************************************************
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R COFEXDF                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            RECI      R
     A*                                                    /S01117/
     A*********** BHBR      R
     A            BHBA      R
     A*                                                    /S01117/
     A            BHBK      R
     A            CCY       R
     A            BPPD      R
     A            CECP      R
     A            ERNR      R
     A            COFF      R
     A            FUDY      R
     A            FUDV      R
     A            CEAR      R
     A* Key fields
     A*                                                    /S01117/
     A**********K BHBR
     A          K BHBA
     A*                                                    /S01117/
     A          K BHBK
     A          K CCY
     A          K BPPD
     A          K CEAR                      DESCEND
