      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE Daily Schedule of Transact Ext')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Securities Trading II Module
     A*                                                               *
     A*  PF/DSTEXD - DAILY SCHEDULE OF TRANSACTIONS EXTRACT           *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  Prev Amend No. 052254             Date 22DEC93               *
     A*                 S01117             Date 08NOV90               *
     A*                 E19419             DATE 06NOV89               *
     A*                 E20086             DATE 06NOV89               *
     A*                                                               *
     A*****************************************************************
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*  052254 - CURRENT FACTOR amended from 9,8 to 10,9
     A*  S01117 - Multibranching                                      *
     A*  E19419 - Original Entry Date (TOED) is required by SE0615.   *
     A*  E20086 - Mortgage-Backs and Current Factor Processing Rewrite*
     A*           Consideration is now held on TRADSD exclusive of    *
     A*           the Current Factor, so the TCFC field needs to be   *
     A*           included in this extract file.                      *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R DSTEXDF                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            RECI      R
      *                                              Begin /S01117/
     A**********  TDBR      R
     A            TDBA      R
      *                                              End   /S01117/
     A            TDBK      R
     A            SITP      R
     A            SETC      R
     A            TDSS      R
     A            CSNM      R
      * Begin /CSD027/
     A**********  TCNR      R                                                                 CSD027
     A            TCNR           6A
     A                                      TEXT('Counterparty Customer Number +
     A                                       - TR')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            TDVD      R
     A            TDTP      R
     A            TDRF      R
     A            TNMC      R
     A            NOML      R
     A            TCSR      R
     A            RALL      R
     A            ITRA      R
     A            TCTR      R
     A            TPDY      R
     A            TDER      R
     A            TCOM      R
     A            TCHR      R
     A            CLTY      R
     A            CHTP      R
     A            TINC      R
      *                                              Begin /E20086/
     A*                                      Begin /052254/
     A************TCFC      R
     A            ZZ005     R
     A*                                      End   /052254/
      *                                              End   /E20086/
      *                                              Begin /E19419/
     A            TOED      R
      *                                              End   /E19419/
     A*                                      Begin /052254/
     A            TCFC      R               REFFLD(CFT9)
     A                                      TEXT('Current Factor')
     A*                                      End   /052254/
