      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE DPMV - Error Inds File - LU Window')
      *****************************************************************
      *                                                               *
      *  Midas - Security Trading Module                              *
      *                                                               *
      *  PF/SEEDMLX1PD - API Error Definition File for                *
      *                  Depot Movements Extra Data - LU Extension    *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2005            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CER001  *CREATE    Date 25Apr05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CER001 - LUX Upgrade to MidasPlus                            *
      *                                                               *
      *****************************************************************
     A          R SEEDMLXD6                 TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. 2005')
     A            OK#6LXOPTP     1A         TEXT('Operation Type')
     A            OK#6LXEXCF     1A         TEXT('Excess Collateral Flag')
     A            OK#6LXTTIM     1A         TEXT('Transaction Time')
     A            OK#6LXCABR     1A         TEXT('To Be Excluded In CAB')
     A            OK#6LXCNBR     6A         TEXT('Counterparty Number')
