      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE Error inds for walk out')                     *
      *****************************************************************
      *                                                               *
      *  Midas - Application Program Interface Module                 *
      *                                                               *
      *  PF/SEEDMWOPD - API Incoming Message Definition File for      *
      *                  Walk-Out Depot Movement Transaction.         *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CSW210             Date 04May10               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CAP087             Date 01Aug05               *
      *                 CGL035             Date 01Mar05               *
      *                 CSE045             Date 24Mar03               *
      * Midas Release 4.01.01 ----------------------------------------*
      *                 207006             Date 18Jun02               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CSE015             Date 06Dec99               *
      *                 CSE017             Date 20Oct99               *
      *                 CSE012             Date 16Aug99               *
      *                 CPB001             Date 26Aug99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CAP003  *CREATE    Date 30Apr98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSW210 - SWIFT 2010 Changes                                  *
      *  CGL035 - EUSD Upgrade to Midasplus                           *
      *  CAP087 - Depot Movement API project.                         *
      *  CSE045 - API for Extended Settlement for Trade Input and     *
      *           Depot Movement                                      *
      *  207006 - Add Counterparty & Market Centre to SSI             *
      *  CSE015 - Forward Valued Depot Movements                      *
      *  CSE017 - Cum/Ex Indicator on Depot Movements                 *
      *  CSE012 - SE Depot Movement Narratives                        *
      *  CPB001 - 'Private Banking' Module                            *
      *  CAP003 - Conversion of SE inputs into modular structure to   *
      *           use as APIs.                                        *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R SEDMWOPDF                 TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      ** Message contents
      *
      ** Action code
     A            DDACTNOK  R               TEXT('ACTION -Ok')
                                            REFFLD(OKFLAG)
      *
      ** Security Shortname
     A            DDDPSSOK  R               TEXT('Security - Ok')
                                            REFFLD(OKFLAG)
      *
      ** Reference
     A            DDDPRNOK  R               TEXT('Reference - Ok')
                                            REFFLD(OKFLAG)
      *
      ** Out Depot
     A            DDDPODOK  R               TEXT('Out Depot - Ok')
                                            REFFLD(OKFLAG)
      *
      ** Out Date
     A            DDDPDOOK  R               TEXT('Out Date - Ok')
                                            REFFLD(OKFLAG)
      *
      ** Booking Branch
     A            DDDPBAOK  R               TEXT('Booking Branch - Ok')
                                            REFFLD(OKFLAG)
      *
      ** Originating Branch
     A            DDORBROK  R               TEXT('Originating Branch - Ok')
                                            REFFLD(OKFLAG)
      *
      ** Book
     A            DDDPBKOK  R               TEXT('Book - Ok')
                                            REFFLD(OKFLAG)
      *
      ** Beneficiary Customer
     A            DDDPBNOK  R               TEXT('Beneficiary Customer - Ok')
                                            REFFLD(OKFLAG)
      *
      ** Nominal Amount
     A            DDDPNAOK  R               TEXT('Nominal Amount - Ok')
                                            REFFLD(OKFLAG)
      *
      ** Narrative
     A            DDDPNROK  R               TEXT('Narrative - Ok')
                                            REFFLD(OKFLAG)
      *
      ** Price
     A            DDMKTPOK  R               TEXT('Price - Ok')
                                            REFFLD(OKFLAG)
      *
      ** Profit Centre
     A            DDDPPCOK  R               TEXT('Profit Centre - Ok')
                                            REFFLD(OKFLAG)
      *
      ** Customer Delivery / Withdrawal Indicator
     A            DDCWDIOK  R               TEXT('Customer D/E Ind - Ok' )
                                            REFFLD(OKFLAG)
      *
      ** Portfolio Reference
     A            DDPTFROK  R               TEXT('Portfolio Reference - Ok')
                                            REFFLD(OKFLAG)
      ** Average Yield
     A            DDCYLDOK  R               TEXT('Customer Yield Rate')
                                            REFFLD(OKFLAG)
      *
      ** Charge Code
     A            DDDCHCOK  R               TEXT('Charge Code - Ok')
                                            REFFLD(OKFLAG)
      *
      ** Charge Settlement type/Method
     A            DDDCSEOK  R               TEXT('Charge Settlement Type - Ok')
                                            REFFLD(OKFLAG)
      *
      ** Charge Currency
     A            DDDCCEOK  R               TEXT('Charge Currency - Ok')
                                            REFFLD(OKFLAG)
      *
      ** Charge Account
     A            DDDCATOK  R               TEXT('Charge Account - Ok')
                                            REFFLD(OKFLAG)
      *
      ** Charge Amount
     A            DDDCHAOK  R               TEXT('Charge Amount - Ok')
                                            REFFLD(OKFLAG)
      *
      ** Charge Acc Branch
     A            DDDCABOK  R               TEXT('Charge Acc Branch - Ok')
                                            REFFLD(OKFLAG)
 
      *                                              Begin /CSE012/
      ** Narrative 2
      *
     A            DDDPNR2OK R               TEXT('Narrative 2 - OK')
     A                                      REFFLD(OKFLAG)
      *
      ** Narrative 3
      *
     A            DDDPNR3OK R               TEXT('Narrative 3 - OK')
     A                                      REFFLD(OKFLAG)
      *
      ** Narrative 4
      *
     A            DDDPNR4OK R               TEXT('Narrative 4 - OK')
     A                                      REFFLD(OKFLAG)
      *
      ** Narrative 5
      *
     A            DDDPNR5OK R               TEXT('Narrative 5 - OK')
     A                                      REFFLD(OKFLAG)
      *                                              End   /CSE012/
      *                                              Begin /CPB001/
      ** Purchased Interest
     A            DDPINTOK  R               TEXT('Purchased Indicator - Ok')
                                            REFFLD(OKFLAG)
 
      *
      ** Accrued Indicator
     A            DDACINOK  R               TEXT('Accrued Indicator - Ok')
                                            REFFLD(OKFLAG)
 
      *
      ** Movement subtype Indicator
     A            DDMSTPOK  R               TEXT('Movement Indicator - Ok')
                                            REFFLD(OKFLAG)
      *                                              End   /CPB001/
      *                                              Begin /CSE017/
     A            DDDPINOK  R               REFFLD(ADVI)
     A                                      COLHDG(' Cum/Ex' +
     A                                             'Indicator' +
     A                                             ' OK Flag')
     A            DDDPAPOK  R               REFFLD(ADVI)
     A                                      COLHDG('Prn Advice' +
     A                                             'Indicator' +
     A                                             ' OK Flag')
      *                                              End   /CSE017/
      *                                              Begin /CSE015/
     A            DDDMTDOK       1A         TEXT('Trade Date OK Flag')
     A                                      COLHDG('Trade' +
     A                                             'Date' +
     A                                             'OK Flag')
      *                                              End   /CSE015/
     A**Start of change 207006
     A            DDCPTYOK       1A         TEXT('Counterparty OK Flag')
     A                                      COLHDG('Counterparty OK Flag')
      *
     A            DDMRKTOK       1A         TEXT('Market Centre OK Flag')
     A                                      COLHDG('Market Centre' +
     A                                             'OK Flag')
     A**End of change 207006
      ** Start of Change CAP087
      *
     A            DDDPIDOK       1A         TEXT('In Depot OK Flag')
     A                                      COLHDG('In Depot OK Flag')
      *
     A            DDDPMDOK       1A         TEXT('In Date OK Flag')
     A                                      COLHDG('In Date OK Flag')
      *
     A            DDDPADOK       1A         TEXT('Associated Deal No OK Flag')
     A                                      COLHDG('Assoc Deal' 'No OK Flag')
      *
     A            DDSWRFOK       1A         TEXT('Switch Reference OK Flag')
     A                                      COLHDG('Switch Reference' 'OK Flag')
      *
     A            DDSIOIOK       1A         TEXT('Switch IN/OUT Ind OK Flag')
     A                                      COLHDG('Switch IN/OUT' 'OK Flag')
      *
     A            DDRPINOK       1A         TEXT('Repo/Pledge Ind OK Flag')
     A                                      COLHDG('Repo/Pledge Ind' 'OK Flag')
      ** End of Change CAP087
      **Start of change CSE045
*IN   *
 10  A            DSGMESOK       1A         TEXT('Settlement Message Request')
     A                                      COLHDG('Settlmt Msg' 'Request')
      *
 11  A            DS1522OK       1A         TEXT('ISO15022 Message indicator')
     A                                      COLHDG('ISO15022' 'Message Ind')
      *
 12  A            DSINSTOK       1A         TEXT('Instruction Type')
     A                                      COLHDG('Instr' 'Type')
      *
 13  A            DSINSSOK       1A         TEXT('Instruction sub-type')
     A                                      COLHDG('Instruct' 'Sub-type')
      *
 14  A            DSEUCLOK       1A         TEXT('Euroclear/Clearstream code')
     A                                      COLHDG('Euroclear/' 'Clearstream')
      *
 15  A            DSSAFAOK       1A         TEXT('Safekeeping Account')
     A                                      COLHDG('Safekeeping' 'Account')
      *
 16  A            DSFINDOK       1A         TEXT('Free or Against payment Ind')
     A                                      COLHDG('Free or' 'Against')
      *
 17  A            DSPRICOK       1A         TEXT('Price')
     A                                      COLHDG('Price')
      *
 18  A            DSTRTTOK       1A         TEXT('Time of Transaction')
     A                                      COLHDG('Time of' 'Transaction')
      *
 19  A            DSTDEROK       1A         TEXT('Exchange Rate')
     A                                      COLHDG('Exchange Rate')
      *
 20  A            DSRPTYOK       1A         TEXT('Requested Priority')
     A                                      COLHDG('Requested' 'Priority')
      *
 21  A            DSITRAOK       1A         TEXT('Accrued Interest')
     A                                      COLHDG('Accrued Interest')
      *
 22  A            DSGDELOK       1A         TEXT('Guaranteed Delivery')
     A                                      COLHDG('Guaranteed' 'Delivery')
      *
 23  A            DSSROLOK       1A         TEXT('Sender''s Role')
     A                                      COLHDG('Sender''s' 'Role')
      *
 24  A            DSFCODOK       1A         TEXT('Fungibility Code')
     A                                      COLHDG('Fungibility' 'Code')
      *
 25  A            DSROUCOK       1A         TEXT('Destination of Confirmation')
     A                                      COLHDG('Destination of' +
     A                                             'Confirmation')
      *
 26  A            DSROTCOK       1A         TEXT('Destination of Confirmation')
     A                                      COLHDG('Destination of' +
     A                                             'Confirm (BIC)')
      *
 27  A            DSGMECOK       1A         TEXT('Confirmation Message Request')
     A                                      COLHDG('Confirm Msg' 'Request')
      *
 28  A            DSSTSTOK       1A         TEXT('Stamp Status')
     A                                      COLHDG('Stamp' 'Status')
      *
 29  A            DSSIOROK       1A         TEXT('Registration Override')
     A                                      COLHDG('Regist' 'Over')
      *
 30  A            DSTRRMOK       1A         TEXT('Transaction Report Marker')
     A                                      COLHDG('Transact' 'Report Marker')
      *
 31  A            DSCHIDOK       1A         TEXT('Charity Identifier')
     A                                      COLHDG('Charity Identifier')
----  *
 10  A            DSAFPNOK       1A         TEXT('A/c for Payment')
     A                                      COLHDG('A/c for Payment')
      *
 11  A            DSAFPLOK       1A         TEXT('A/c for Payment (detail)')
     A                                      COLHDG('A/c for Payment' '(detail)')
      *
 12  A            DSAWIAOK       1A         TEXT('A/c with Institution (Tag)')
     A                                      COLHDG('A/c with' 'Institution' +
     A                                             '(Tag)')
      *
 13  A            DSAWINOK       1A         TEXT('A/c with Institution (Cust)')
     A                                      COLHDG('A/c with Institution' +
     A                                             '(Customer Number)')
      *
 14  A            DSAWILOK       1A         TEXT('A/c with Institution (detl)')
     A                                      COLHDG('A/c with Institution' +
     A                                             '(detail)')
      *
 15  A            DSBOFAOK       1A         TEXT('Beneficiary of Money (Tag)')
     A                                      COLHDG('Beneficiary' 'of Money' +
     A                                             '(Tag)')
      *
 16  A            DSBOFNOK       1A         TEXT('Beneficiary of Money (Cust)')
     A                                      COLHDG('Beneficiary of' +
     A                                             'Money (Cust No)')
      *
 17  A            DSBOF1OK       1A         TEXT('Beneficiary of Money (Line1)')
     A                                      COLHDG('Beneficiary of' +
     A                                             'Money (Line 1)')
      *
 18  A            DSBOF2OK       1A         TEXT('Beneficiary of Money (Line2)')
     A                                      COLHDG('Beneficiary of' +
     A                                             'Money (Line 2)')
      *
 19  A            DSSRL1OK       1A         TEXT('Sender to Receiver Info(Ln1)')
     A                                      COLHDG('Sender to Receiver' +
     A                                             'Information (Line 1)')
      *
 20  A            DSSRL2OK       1A         TEXT('Sender to Receiver Info(Ln2)')
     A                                      COLHDG('Sender to Receiver' +
     A                                             'Information (Line 2)')
      *
 21  A            DSSRL3OK       1A         TEXT('Sender to Receiver Info(Ln3)')
     A                                      COLHDG('Sender to Receiver' +
     A                                             'Information (Line 3)')
      *
 22  A            DSFIN1OK       1A         TEXT('Further Information (line 1)')
     A                                      COLHDG('Further Information' +
     A                                             '(line 1)')
      *
 23  A            DSFIN2OK       1A         TEXT('Further Information (line 2)')
     A                                      COLHDG('Further Information' +
     A                                             '(line 2)')
      *
 24  A            DSRED1OK       1A         TEXT('Registration Details (line1)')
     A                                      COLHDG('Registration Details' +
     A                                             '(line 1)')
      *
 25  A            DSRED2OK       1A         TEXT('Registration Details (line2)')
     A                                      COLHDG('Registration Details' +
     A                                             '(line 2)')
      *
 26  A            DSNAL1OK       1A         TEXT('Narrative (Line 1)')
     A                                      COLHDG('Narrative (Line 1)')
      *
 27  A            DSNAL2OK       1A         TEXT('Narrative (Line 2)')
     A                                      COLHDG('Narrative (Line 2)')
----  *
 10  A            DSCTYNOK       1A         TEXT('Counterparty Safekeeping A/c')
     A                                      COLHDG('Counterparty' +
     A                                             'Safekeeping A/c')
      *
 11  A            DSCTYLOK       1A         TEXT('Counterparty Safekeeping A/c')
     A                                      COLHDG('Counter Safekeeping' +
     A                                             'A/c (Detail)')
      *
 12  A            DSIPYNOK       1A         TEXT('Instructing Party''/Counter')
     A                                      COLHDG('Instructing Party''/' +
     A                                             'Counterparty')
      *
 13  A            DSIPYLOK       1A         TEXT('Instructing Party''/Counter')
     A                                      COLHDG('Instructing Party''/' +
     A                                             'Counter (Detail)')
      *
 14  A            DSINVEOK       1A         TEXT('Investor')
     A                                      COLHDG('Investor')
      *
 15  A            DSSKANOK       1A         TEXT('Safekeeping A/c')
     A                                      COLHDG('Safekeeping A/c')
      *
 16  A            DSSKALOK       1A         TEXT('Safekeeping A/c (Line)')
     A                                      COLHDG('Safekeeping A/c' +
     A                                             '(Line)')
      *
 17  A            DSCCTNOK       1A         TEXT('Clearing Correspondent')
     A                                      COLHDG('Clearing' 'Correspondent')
      *
 18  A            DSDCTLOK       1A         TEXT('Deliverer''s Instruct Party')
     A                                      COLHDG('Deliverer''s' 'Ins Party')
      *
 19  A            DSRSSAOK       1A         TEXT('Receive of Securities (Tag)')
     A                                      COLHDG('Receiver of' +
     A                                             'Securities' '(Tag)')
      *
 20  A            DSRSSNOK       1A         TEXT('Receive of Securities (Cust)')
     A                                      COLHDG('Receiver of' +
     A                                             'Securities (Cust)')
      *
 21  A            DSRSS1OK       1A         TEXT('Receiver of Securities (Ln1)')
     A                                      COLHDG('Receiver of' +
     A                                             'Securities (Line 1)')
      *
 22  A            DSRSS2OK       1A         TEXT('Receiver of Securities (Ln2)')
     A                                      COLHDG('Receiver of' +
     A                                             'Securities (Line 2)')
      *
 23  A            DSRSS3OK       1A         TEXT('Receiver of Securities (Ln3)')
     A                                      COLHDG('Receiver of' +
     A                                             'Securities (Line 3)')
      *
 24  A            DSRSS4OK       1A         TEXT('Receiver of Securities (Ln4)')
     A                                      COLHDG('Receiver of' +
     A                                             'Securities (Line 4)')
      *
 25  A            DSDSSAOK       1A         TEXT('Deliverer of Secur (Tag)')
     A                                      COLHDG('Deliverer' +
     A                                             'of Secur' '(Tag)')
      *
 26  A            DSDSSNOK       1A         TEXT('Deliverer of Secur (Cust)')
     A                                      COLHDG('Deliverer of' +
     A                                             'Secur (Cust)')
      *
 27  A            DSDSS1OK       1A         TEXT('Deliverer Securities (Ln1)')
     A                                      COLHDG('Deliverer of' +
     A                                             'Securities (Ln 1)')
      *
 28  A            DSDSS2OK       1A         TEXT('Deliverer Securities (Ln2)')
     A                                      COLHDG('Deliverer of' +
     A                                             'Securities (Ln 2)')
      *
 29  A            DSDSS3OK       1A         TEXT('Deliverer Securities (Ln3)')
     A                                      COLHDG('Deliverer of' +
     A                                             'Securities (Ln 3)')
      *
 30  A            DSDSS4OK       1A         TEXT('Deliverer Securities (Ln4)')
     A                                      COLHDG('Deliverer of' +
     A                                             'Securities (Ln 4)')
      *
 31  A            DSBSSAOK       1A         TEXT('Bene Securities (Tag)')
     A                                      COLHDG('Bene of' 'Securities' +
     A                                             '(Tag)')
      *
 32  A            DSBSSNOK       1A         TEXT('Bene Securities (Customer)')
     A                                      COLHDG('Bene Securities' +
     A                                             '(Customer)')
      *
 33  A            DSBSS1OK       1A         TEXT('Beneficiary Securities (Ln1)')
     A                                      COLHDG('Beneficiary' +
     A                                             'Securities (Ln 1)')
      *
 34  A            DSBSS2OK       1A         TEXT('Beneficiary Securities (Ln2)')
     A                                      COLHDG('Beneficiary' +
     A                                             'Securities (Ln 2)')
----  *
 10  A            DSIMMD1OK      1A         TEXT('Intermediary 1')
     A                                      COLHDG('Intermediary 1')
      *
 11  A            DSIMSA1OK      1A         TEXT('Intermediary 1 A/C')
     A                                      COLHDG('Intermediary 1 A/C')
      *
 12  A            DSIMMD2OK      1A         TEXT('Intermediary 2')
     A                                      COLHDG('Intermediary 2')
      *
 13  A            DSIMSA2OK      1A         TEXT('Intermediary 2 A/C')
     A                                      COLHDG('Intermediary 2 A/C')
      *
 14  A            DSIMMD3OK      1A         TEXT('Intermediary 3')
     A                                      COLHDG('Intermediary 3')
      *
 15  A            DSIMSA3OK      1A         TEXT('Intermediary 3 A/C')
     A                                      COLHDG('Intermediary 3 A/C')
      *
 16  A            DSIMMD4OK      1A         TEXT('Intermediary 4')
     A                                      COLHDG('Intermediary 4')
      *
 17  A            DSIMSA4OK      1A         TEXT('Intermediary 4 A/C')
     A                                      COLHDG('Intermediary 4 A/C')
      *
 18  A            DSIMMD5OK      1A         TEXT('Intermediary 5')
     A                                      COLHDG('Intermediary 5')
      *
 19  A            DSIMSA5OK      1A         TEXT('Intermediary 5 A/C')
     A                                      COLHDG('Intermediary 5 A/C')
      *
 20  A            DSIMMD6OK      1A         TEXT('Intermediary 6')
     A                                      COLHDG('Intermediary 6')
      *
 21  A            DSIMSA6OK      1A         TEXT('Intermediary 6 A/C')
     A                                      COLHDG('Intermediary 6 A/C')
      *
 22  A            DSIMMD7OK      1A         TEXT('Intermediary 7')
     A                                      COLHDG('Intermediary 7')
      *
 23  A            DSIMSA7OK      1A         TEXT('Intermediary 7 A/C')
     A                                      COLHDG('Intermediary 7 A/C')
      *
 24  A            DSIMMD8OK      1A         TEXT('Intermediary 8')
     A                                      COLHDG('Intermediary 8')
      *
 25  A            DSIMSA8OK      1A         TEXT('Intermediary 8 A/C')
     A                                      COLHDG('Intermediary 8 A/C')
      *
 26  A            DSIMMD9OK      1A         TEXT('Intermediary 9')
     A                                      COLHDG('Intermediary 9')
      *
 27  A            DSIMSA9OK      1A         TEXT('Intermediary 9 A/C')
     A                                      COLHDG('Intermediary 9 A/C')
      *
 28  A            DSPSETOK       1A         TEXT('Place of Settlement')
     A                                      COLHDG('Place of Settlement')
      *
 29  A            DSNAC1OK       1A         TEXT('Narrative for Cash Parties 1')
     A                                      COLHDG('Narrative for' +
     A                                             'Cash Parties 1')
      *
 30  A            DSNAC2OK       1A         TEXT('Narrative for Cash Parties 2')
     A                                      COLHDG('Narrative for' +
     A                                             'Cash Parties 2')
----  *
      **End of change CSE045
     A**Start of change CGL035
     A            DDFSPROK       1A         TEXT('Fiscal Price/Fiscal +
     A                                      Yield - OK')
     A                                      COLHDG('Fiscal Price/Fiscal ' +
     A                                      'Yield - OK')
      *
     A            DDOPDTOK       1A         TEXT('Original Purchase Date - OK')
     A                                      COLHDG('Original Purchase ' +
     A                                      'Date - OK')
      *
     A            DDOPINOK       1A         TEXT('Original Purchase +
     A                                      Interest - OK')
     A                                      COLHDG('Original Purchase ' +
     A                                      'Interest - OK')
     A**End of change CGL035
     A**Start of Change CSW210
     A            DSDIDNOK       1A         TEXT('Debtor - Identification +
     A                                            OK Flag')
     A                                      COLHDG('Debtor - Identifi' +
     A                                             'cation OK Flag')
     A            DSDAD1OK       1A         TEXT('Debtor - Address 1 +
     A                                            OK Flag')
     A                                      COLHDG('Debtor - Address 1' +
     A                                             'OK Flag')
     A            DSDAD2OK       1A         TEXT('Debtor - Address 2 +
     A                                            OK Flag')
     A                                      COLHDG('Debtor - Address 2' +
     A                                             'OK Flag')
     A            DSDAD3OK       1A         TEXT('Debtor - Address 3 +
     A                                            OK Flag')
     A                                      COLHDG('Debtor - Address 3' +
     A                                             'OK Flag')
     A            DSDAD4OK       1A         TEXT('Debtor - Address 4 +
     A                                            OK Flag')
     A                                      COLHDG('Debtor - Address 4' +
     A                                             'OK Flag')
     A            DSDLINOK       1A         TEXT('Debtor - Account Line +
     A                                            OK Flag')
     A                                      COLHDG('Debtor - Account ' +
     A                                            'Line OK Flag')
     A            DSQFINOK       1A         TEXT('Qualified Foreign +
     A                                            Intermediary OK Flag')
     A                                      COLHDG('Qualified Foreign ' +
     A                                             'Intermediary OK Flag')
     A            DSPCLROK       1A         TEXT('Place of Clearing OK Flag')
     A                                      COLHDG('Place of Clearing ' +
     A                                             'OK Flag')
     A**End of Change CSW210
