      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE SECS - Error Inds File - LU Window')
      *****************************************************************
      *                                                               *
      *  Midas - Security Trading Module                              *
      *                                                               *
      *  PF/SEESELX3PD - API Error Definition File for                *
      *                 Securities Details Extra Data - LU Extension  *
      *                                                               *
      *  (c) Finastra International Limited 2005                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CER001  *CREATE    Date 25Apr05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CER001 - LUX Upgrade to MidasPlus                            *
      *                                                               *
      *****************************************************************
     A          R SEESELXD6                 TEXT('(c) Finastra International +
     A                                      Limited 2005')
     A            OK#6LXLUSU     1A         TEXT('Lump-Sum Code')
     A            OK#6LXSUBR     1A         TEXT('Subordinate')
     A            OK#6LXIM93     1A         TEXT('Note IML 93/93')
     A            OK#6LXCLAT     1A         TEXT('Claims Type')
     A            OK#6LXSECT     1A         TEXT('Security Type')
     A            OK#6LXROFC     1A         TEXT('Rating Office Code')
     A            OK#6LXRATC     1A         TEXT('Rating Code')
     A            OK#6LXVOTR     1A         TEXT('Voting Right in %')
     A            OK#6LXSECD     1A         TEXT('Security Code')
     A            OK#6LXSNCD     1A         TEXT('Security National Code')
     A            OK#6LXEEEM     1A         TEXT('Quoted on EEE Market')
     A            OK#6LXQUOT     1A         TEXT('Quoted')
