      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE Error inds for trades - secondary')
      *****************************************************************
      *                                                               *
      *  Midas - Application Program Interface Module                 *
      *                                                               *
      *  PF/SEETRSEPD - API Error Definition File for                 *
      *                 Trades - Secondary Details                    *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CGL031             Date 05Jul04               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CAP050             Date 27Jul98               *
      *                 CAP003  *CREATE    Date 01Jul98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGL031 - Taxation of Savings Income                          *
      *  CAP050 - Midas/ToF Interface                                 *
      *  CAP003 - Conversion of SE inputs into modular structure to   *
      *           use as APIs.                                        *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R SEETRSED0                 TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
      ** Settlement Currency
     A            DDSETCOK  R               TEXT('Settlement Ccy - OK')
                                            REFFLD(OKFLAG)
      *
      ** Reallowance/sign
     A            DDRALLOK  R               TEXT('Reallowance - OK')
                                            REFFLD(OKFLAG)
      *
      ** Market Centre
     A            DDMRKTOK  R               TEXT('Market Centre - OK')
                                            REFFLD(OKFLAG)
      *
      ** Capacity
     A            DDCPCYOK  R               TEXT('Capacity - OK')
                                            REFFLD(OKFLAG)
      *
      ** Price
     A            DDPRICOK  R               TEXT('Price - OK')
                                            REFFLD(OKFLAG)
      *
      ** Ex Dividend
     A            DDEXDVOK  R               TEXT('Ex Div - OK')
                                            REFFLD(OKFLAG)
      *
      ** Book Profit Centre
     A            DDBPRCOK  R               TEXT('Book Profit Centre - OK')
                                            REFFLD(OKFLAG)
      *
      ** Trans. Profit Centre
     A            DDTPRCOK  R               TEXT('Tran Profit Centre - OK')
                                            REFFLD(OKFLAG)
      *
      ** Trader I.D.
     A            DDTDIDOK  R               TEXT('Trader ID - OK')
                                            REFFLD(OKFLAG)
      *
      ** Trade Date
     A            DDTDDTOK  R               TEXT('Trade Date - OK')
                                            REFFLD(OKFLAG)
      *
      ** Trade Sub-Type
     A            DDTSUBOK  R               TEXT('Trade Sub Type - OK')
                                            REFFLD(OKFLAG)
      *
      ** Link Reference
     A            DDLKRFOK  R               TEXT('Link Ref - OK')
                                            REFFLD(OKFLAG)
      *
      ** Market Indicator
     A            DDTDMIOK  R               TEXT('Market Ind - OK')
                                            REFFLD(OKFLAG)
      *
      ** ISMA/IPMA
     A            DDAIIPOK  R               TEXT('ISMA/IPMA - OK')
                                            REFFLD(OKFLAG)
      *
      ** Narrative
     A            DDTDNROK  R               TEXT('Narrative - OK')
                                            REFFLD(OKFLAG)
      *                                              Begin /CAP050/
      ** Private Banking Order Number
     A            DDORDEOK  R               TEXT('PB Order Number - OK')
                                            REFFLD(OKFLAG)
      *                                              End   /CAP050/
      *
      ** Accrued Ind.
     A            DDACINOK  R               TEXT('Accrued Ind - OK')
                                            REFFLD(OKFLAG)
      *
      ** Days Adjustment/Sign
     A            DDDADJOK  R               TEXT('Days Adj - OK')
                                            REFFLD(OKFLAG)
      *
      ** Act/Diff
     A            DDACTDOK  R               TEXT('Act/Diff - OK')
                                            REFFLD(OKFLAG)
      *
      ** Int. Amt./Sign
     A            DDITRAOK  R               TEXT('Interest Amount - OK')
                                            REFFLD(OKFLAG)
     A**Start of change CGL031
     A            DDFSPROK  R               TEXT('Fiscal Price/+
     A                                      Fiscal Yield - OK')
     A                                      COLHDG('Fiscal Price/' +
     A                                      'Fiscal Yield - OK')
     A                                      REFFLD(OKFLAG)
     A            DDFSPPOK  R               TEXT('Fiscal Price in +
     A                                      Percents - OK')
     A                                      COLHDG('Fiscal Price in ' +
     A                                      'Percents - OK')
     A                                      REFFLD(OKFLAG)
     A            DDEUTXOK  R               TEXT('EU Tax Amount in +
     A                                      Nominal Currency - OK')
     A                                      COLHDG('EU Tax Amount in ' +
     A                                      'Nominal Ccy - OK')
     A                                      REFFLD(OKFLAG)
     A            DDEUTSOK  R               TEXT('EU Tax Amount in +
     A                                      Settlement Currency - OK')
     A                                      COLHDG('EU Tax Amount in ' +
     A                                      'Settlement Ccy - OK')
     A                                      REFFLD(OKFLAG)
     A**End of change CGL031
