      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas Safe Custody Fees Accrued Query file')
     A*****************************************************************
     A*                                                               *
     A*      Midas - Securities Trading Module                    *
     A*                                                               *
     A*  PF/SESCFAQ2 - Safe Custody Fees Accrued Query File           *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 S01464  *CREATE    Date 04Apr94               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*  S01464 - Safe Custody Fees                                   *
     A*                                                               *
     A*****************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                     *
     A*                                                              *
     A****************************************************************
     A                                      REF(MFRFL)
     A          R SESCFAQ1                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            SDRECI    R               REFFLD(RECI)
     A            SDDLUP    R               REFFLD(DLUP)
     A            SDMLUP    R               REFFLD(MLUP)
     A            SDYLUP    R               REFFLD(YLUP)
     A            SDTLUP    R               REFFLD(TLUP)
     A            SDCHTP    R               REFFLD(CHTP)
     A            SDLCD     R               REFFLD(LCD)
     A            SDTNLU    R               REFFLD(TNLU)
      * Begin /CSD027/
     A**********  SDCNUM    R               REFFLD(CNUM)                                      CSD027
     A            SDCNUM         6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            SDPTFR    R               REFFLD(PTFR)
     A            SDCFAC    R               REFFLD(CFAC)
     A            SDOSAJ    R               REFFLD(OSAJ)
     A            SDOSAS    R               REFFLD(OSAS)
     A            BBACOC    R               REFFLD(ACOC)
      * Begin /CSD027/
     A**********  BBCUST    R               REFFLD(CUST)                                      CSD027
     A            BBCUST         6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('CUST')
      * End /CSD027/
     A            BBCSSN    R               REFFLD(CSSN)
     A            BBDTDL    R               REFFLD(DTDL)
     A                                      EDTCDE(4)
     A            BBBRCD    R               REFFLD(BRCA)
