      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE Settlement Actions')
     A********************************************************************
     A*                                                                  *
     A*  Midas - Securities Trading Module
     A*                                                                  *
     A*   PF/SETACD  -  SETTLEMENT ACTIONS                               *
     A*                                                                  *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                                  *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  Prev Amend No. S01496             Date 06JUN94               *
     A*                 S01117             Date 08NOV90               *
     A*                                                                  *
     A********************************************************************
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*   S01496 - Jyske enhancements                                    *
     A*   S01117 - MULTIBRANCHING                                        *
     A********************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R SETACDF                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            RECI      R
     A*                                                   /S01117/
     A**********  SBCD      R
     A            SBCA      R
     A*                                                   /S01117/
      * Begin /CSD027/
     A**********  SCPT      R                                                                 CSD027
     A            SCPT           6A
     A                                      TEXT('Customer')
     A                                      COLHDG('Cust')
      * End /CSD027/
     A            SSSN      R
     A            SBOC      R
     A            SMAR      R
      * Begin /CSD027/
     A**********  SODP      R                                                                 CSD027
     A            SODP           6A
     A                                      TEXT('Our Depot')
     A                                      COLHDG('Our                 ' +
     A                                      'Depot')
      * End /CSD027/
     A            SPFI      R
      * Begin /CSD027/
     A**********  SPCD      R                                                                 CSD027
     A            SPCD           6A
     A                                      TEXT('Portfolio Customer Depot')
     A                                      COLHDG('Port                ' +
     A                                      'Cust                ' +
     A                                      'Depot')
      * End /CSD027/
     A            STET      R
     A            STDR      R
     A            SSRF      R
     A            SNMS      R
     A            SRIN      R
     A            SEDE      R
      *                                              Begin /S01496/
     A            PTFR      R
      *                                              End   /S01496/
