      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE Transaction Message Details')
      *****************************************************************
      *                                                               *
      *  Midas - Securities Module                                    *
      *                                                               *
      *  PF/SDTRANPD - Transaction Message Details File               *
      *                                                               *
      *  (c) Finastra International Limited 2003                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 11Jan06               *
      *                 CSE039 *C *CREATE  Date 10Jan03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CSE039 - Auto-settlement of trades                           *
      *                                                               *
      *****************************************************************
      *
     A          R SETRAND0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2003')
      *
     A            TTRNO          6  0       TEXT('Trade/DVP Ref')
      *
     A            TWIWO          6  0       TEXT('WI/WO Ref')
      *
     A            TFRID         20          TEXT('Front Office ID')
      *
     A            TSTAT          4          TEXT('Status')
      *
     A            TBRCH          3          TEXT('Branch')
      *
      * Begin /CSD027/
     A**********  TCTPY          6  0       TEXT('Counterparty')                              CSD027
     A            TCTPYX         6  0       TEXT('REDUNDANT')
     A                                      COLHDG('REDUNDANT')
      * End /CSD027/
      *
     A            TCTPYN        11          TEXT('Counterparty Name')
      *
      * Begin /CSD027/
     A**********  TCUSN          6  0       TEXT('Customer')                                  CSD027
     A            TCUSNX         6  0       TEXT('REDUNDANT')
     A                                      COLHDG('REDUNDANT')
      * End /CSD027/
      *
     A            TCUSNN        10          TEXT('Customer Name')
      *
      * Begin /CSD027/
     A**********  TCUST          6  0       TEXT('Custodian')                                 CSD027
     A            TCUSTX         6  0       TEXT('redundant')
      * End /CSD027/
      *
     A            TCUSTN        10          TEXT('Custodian Name')
      *
     A            TORDE          6  0       TEXT('Order Number')
      *
     A            TBLKR          6          TEXT('Bulk Reference')
      *
     A            TTRDT          5  0       TEXT('Trade Date')
      *
     A            TTRDTMM        6  0       TEXT('Trade Date DDMMYY')
      *
     A            TTRDTMMM       7          TEXT('Trade Date DDMMMYY')
      *
     A            TVLDTMMM       7          TEXT('Value Date DDMMMYY')
      *
     A            TTYPE          2          TEXT('Trade Type')
      *
     A            TSETY         10          TEXT('Security')
      *
     A            TISIN         12          TEXT('Security ISIN Code')
      *
     A            TNOML         11  0       TEXT('Nominal')
      *
     A            TCTVL         15  0       TEXT('Countervalue')
      *
     A            TCCCY          3          TEXT('Countervalue CCY')
      *
     A            TSTAK          1          TEXT('Sent/Ack')
      *
     A            TINVAL         1          TEXT('Invalid file Ind.')
      *
     A            TAGEN          1          TEXT('Agency Ind.')
      *
     A            TFILE          1          TEXT('File indicator')
      *
     A            TDELET         1          TEXT('Deleted Record Ind')
      *
     A            TNMDP          1  0       TEXT('Number Nominal DPs')
      *
      * Begin /CSD027/
     A            TCTPY          6A         TEXT('Counterparty')
     A            TCUSN          6A         TEXT('Customer')
     A            TCUST          6A         TEXT('Custodian')
      * End /CSD027/
      *
     A          K TSETY
     A          K TCTPY
     A          K TCUSN
     A          K TNOML
     A          K TTRDT
      *
