      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas Extel fields in error from DBU function')
      *****************************************************************
      *                                                               *
      *  Midas - Securities Trading ILE Module                        *
      *                                                               *
      *  PF/SEVEEXVLPD - SE Extel details in error in DBU routine     *
      *                                                               *
      *  This file has the same layout as SEVEXVLPD                   *
      *  These prices have passed validation (i.e. are on SEVEXVLPD   *
      *  but have caused a DB error in the update process)            *
      *                                                               *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *  Prev Amend No. CAP060  *CREATE    Date 20Oct00               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CAP060 - Midas Security Prices Full API                      *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R SEVEXVLD0                 FORMAT(SEVEXVLPD)
