      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE User Depot Movements')
     A********************************************************************
     A*
     A*  Midas - Securities Trading Module
     A*                                                                  *
     A*    PF/UDPTMVD  -  USER DEPOT MOVEMENTS                           *
     A*                                                                  *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                                  *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      *  Prev Amend No. 222727             Date 05Nov03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 E21589             Date 25May90               *
     A*                 S01117             Date 03Jan89               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  222727 - Release 5.0 errors  (Recompile)                     *
      *  E21589 - MOVED FROM XXDMLIB TO  XXDLIB                       *
      *  S01117 - MULTIBRANCHING                                      *
     A*                                                                  *
     A********************************************************************
     A                                      REF(MFRFL)
     A          R UDPMVDF                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            RECI      R
     A*                                                    /S01117/
     A*********** DPBC      R
     A            DPBA      R
     A*                                                    /S01117/
     A            DPSS      R
     A            DPBK      R
     A            DMRT      R
      * Begin /CSD027/
     A**********  DDEP      R                                                                 CSD027
     A            DDEP           6A
     A                                      TEXT('Depot')
     A                                      COLHDG('Depot')
      * End /CSD027/
     A            DADA      R
     A            DMRF      R
     A            DPMV      R
     A            DDBA      R
     A            DMNA      R
     A            DRIN      R
     A            DPNR      R
