      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE Customer Position')
     A********************************************************************
     A*
     A*  Midas - Securities Trading Module
     A*                                                                  *
     A*    PF/XCPOSND  -  CUSTOMER POSITION  - COPY                      *
     A*                                                                  *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      *  Prev Amend No. 236824             Date 17Jun06               *
      * Midas Release 4.04 -------------------------------------------*
      *                 CGL031             Date 05Jul04               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 S01117             Date 16May90               *
      *                                                               *
     A*------------------------------------------------------------------*
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*  236824 - Missing from 233615                                    *
     A*  CGL031 - Taxation of Savings Income                             *
     A*    S01117 - MULTI-BRANCHING                                      *
     A*                                                                  *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R CPOSNDF                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            RECI      R
     A***********                                                       /S01117/
     A*********** CSBR      R
     A            CSBA      R
     A***********                                                       /S01117/
     A            CSSC      R
      * Begin /CSD027/
     A**********  CSCN      R                                                                 CSD027
     A            CSCN           6A
     A                                      TEXT('Customer')
     A                                      COLHDG('Cust                ' +
     A                                      'No.')
      * End /CSD027/
     A            CSDA      R
     A            CSNT      R
     A            CSNV      R
     A            CSNS      R
     A            CSEX      R
     A            CSPT      R
     A            CSPV      R
     A            CSBT      R
     A            CSBV      R
     A            CSCT      R
     A            CSCV      R
     A            TNLU      R
     A**Start of change CGL031
     A            CSPI      R               REFFLD(PUCH)
     A                                      TEXT('Purchase Interest')
     A                                      COLHDG('Purchase Interest')
     A            CSAT      R               REFFLD(PUCH)
     A                                      TEXT('Average Fiscal Price +
     A                                      at Trade Date')
     A                                      COLHDG('Average Fiscal ' +
     A                                      'Price at Trade Date')
     A            CSAV      R               REFFLD(PUCH)
     A                                      TEXT('Average Fiscal Price +
     A                                      at Value Date')
     A                                      COLHDG('Average Fiscal ' +
     A                                      'Price at Value Date')
     A**End of change CGL031
     A**Start of change 236824
     A            AVFP      R   15P 8       REFFLD(PUCH)
     A                                      TEXT('Average Fiscal Price')
     A                                      COLHDG('Average ' +
     A                                      'Fiscal ' 'Price')
     A            APDT      R               REFFLD(CSDA)
     A                                      TEXT('Average Purchased Date')
     A                                      COLHDG('Average ' +
     A                                      'Purchased ' 'Date')
     A**End of change 236824
