      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SE Depot Position')
     A********************************************************************
     A*
     A*  Midas - Securities Trading Module
     A*                                                                  *
     A*    PF/XDPOSND  -  DEPOT POSITION                                 *
     A*                                                                  *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                                  *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027A            Date 17May06               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. E21589             Date 25May90               *
      *                 S01117             Date 17May90               *
     A*                                                                  *
     A*------------------------------------------------------------------*
     A*                                                                  *
      *  CSD027A- Conversion of cust. no. to alpha (post 103 build)   *
     A*    E21589  -  MOVED FROM XXDMLIB TO XXDLIB                       *
     A*    S01117 - MULTI-BRANCHING                                      *S01117
     A*                                                                  *
     A********************************************************************
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
     A          R DPOSNDF                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            RECI      R
     A***********                                                       /S01117/
     A*********** DSBR      R
     A            DSBA      R
     A***********                                                       /S01117/
     A            DSSC      R
      * Start of change CSD027A
     A**********  DDPT      R                                                                CSD027A
     A            DDPT           6A
      * End of change CSD027A
     A            DDTE      R
     A            DEXN      R
     A            DSNT      R
     A            DSNV      R
     A            DSRT      R
     A            DSRV      R
     A            DSNS      R
     A            DSCT      R
     A            DSCV      R
