      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas AS Forecast transactions details file')          *
      *****************************************************************
      *                                                               *
      *  Midas - Accounting Standards Module                          *
      *                                                               *
      *  PF/ASFHTRPD - Midas AS Forecast Transactions Detail File     *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2002            *
      *                                                               *
      *  Last Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CAS006             Date 21Jan03               *
      * Midas Release 4.01 -------------------------------------------*
      *                 CAS002  *CREATE    Date 14Jan02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CLE148 - Alpha Loan Reference                                *
      *  CAS006 - Hedge Accounting Phase B                            *
      *  CAS002 - Hedge Strategy/Linkage                              *
      *                                                               *
      *****************************************************************
      *
     A          R ASFHTRD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2002')
      *
     A            FSRECI         1A         TEXT('Record ID')
     A                                      COLHDG('Record' +
     A                                             'ID')
     A            FSTRID         6S 0       TEXT('Forecast Transaction ID')
     A                                      COLHDG('Forecast' +
     A                                             'Transaction ID')
     A            FSDESC        30A         TEXT('Description')
     A                                      COLHDG('Description')
     A            FSBRCA         3A         TEXT('Branch')
     A                                      COLHDG('Branch')
     A            FSSUBT         2A         TEXT('Transaction Subtype')
     A                                      COLHDG('Transaction' +
     A                                             'Subtype')
     A            FSINDT         5P 0       TEXT('Input Date')
     A                                      COLHDG('Input' +
     A                                             'Date')
     A            FSMDAT         5P 0       TEXT('Maturity Date')
     A                                      COLHDG('Maturity' +
     A                                             'Date')
     A            FSERIN         1A         TEXT('Expenditure/Receipt Ind')
     A                                      COLHDG('Expenditure/Receipt' +
     A                                             'Indicator')
     A            FSCCY          3A         TEXT('Currency')
     A                                      COLHDG('Currency')
     A            FSAMNT        11P 0       TEXT('Amount')
     A                                      COLHDG('Amount')
     A            FSYLDC         5A         TEXT('Revaluation Yield Curve')
     A                                      COLHDG('Revaluation' +
     A                                             'Yield Curve')
     A            FSCHTP         1A         TEXT('Last Change Type')
     A                                      COLHDG('Last Change' +
     A                                             'Type')
     A            FSLCD          5P 0       TEXT('Last Change Date')
     A                                      COLHDG('Last Change' +
     A                                             'Date')
      **Start of change CAS006
     A            FSMOD          2A         TEXT('Module ID')
     A                                      COLHDG('Module ID')
      *
     A            FSSDAT         5P 0       TEXT('Start Date')
     A                                      COLHDG('Start Date')
      *
      **Start of change CLE148
     A**********  FSUREF         6S 0       TEXT('Underlying +                                CLE148
     A            FSUREF         6A         TEXT('Underlying +
      **End of change CLE148
     A                                           Reference Number')
     A                                      COLHDG('Underlying ' +
     A                                           'Reference Number')
      *
     A            FSURPL        13P 0       TEXT('Unrealised Profit/Loss')
     A                                      COLHDG('Unrealised ' 'Profit/Loss')
      *
     A            FSYUPL        13P 0       TEXT('Unrealised Profit/Loss +
     A                                           at Yearend')
     A                                      COLHDG('Unrealised ' +
     A                                           'Profit/Loss ' +
     A                                           'at Yearend')
      *
     A            FSEFUP        13P 0       TEXT('Effective Fair Value +
     A                                           Hedge Unrealised +
     A                                           Profit/Loss Posted')
     A                                      COLHDG('Effctv Fair Value ' +
     A                                           'Hedge Unrealised ' +
     A                                           'Profit/Loss Posted')
      *
     A            FSECUP        13P 0       TEXT('Effective Cash Flow +
     A                                           Hedge Unrealised +
     A                                           Profit/Loss Posted')
     A                                      COLHDG('Effective Cash Flow ' +
     A                                           'Hedge Unrealised ' +
     A                                           'Profit/Loss Posted')
      **End of change CAS006
