      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas AS Hedge linkage file')
      *****************************************************************
      *                                                               *
      *  Midas - Accounting Standards Module                          *
      *                                                               *
      *  PF/ASHGLKPD - Midas AS Hedge Linkage File                    *
      *                                                               *
      *  (c) Finastra International Limited 2002                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CAS006             Date 21Jan03               *
      *                 CAS005             Date 16Dec02               *
      * Midas Release 4.01 -------------------------------------------*
      *                 CAS002  *CREATE    Date 14Jan02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CAS006 - Hedge Accounting Phase B                            *
      *  CAS005 - Enhancements to CAS001, CAS002 and CAS004           *
      *  CAS002 - Hedge Strategy/Linkage                              *
      *                                                               *
      *****************************************************************
      *
     A          R ASHGLKD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2002')
      *
     A            FSRECI         1A         TEXT('Record ID')
     A                                      COLHDG('Record' +
     A                                             'ID')
     A            FSHEDI         6S 0       TEXT('Hedge ID Number')
     A                                      COLHDG('Hedge' +
     A                                             'ID Number')
     A            FSHGST        10A         TEXT('Hedge Strategy Shortname')
     A                                      COLHDG('Hedge Strategy' +
     A                                             'Shortname')
     A            FSEFFD         5P 0       TEXT('Effective Date')
     A                                      COLHDG('Effective' +
     A                                             'Date')
     A            FSINDT         5P 0       TEXT('Input Date')
     A                                      COLHDG('Input' +
     A                                             'Date')
     A            FSFCOA         1A         TEXT('Functional Currency Offset')
     A                                      COLHDG('Functional' +
     A                                             'Ccy Offset')
     A            FSICAT         1A         TEXT('Investment Category')
     A                                      COLHDG('Investment' +
     A                                             'Category')
     A            FSSTDT         5P 0       TEXT('Start Date')
     A                                      COLHDG('Start' +
     A                                             'Date')
     A            FSENDT         5P 0       TEXT('End Date')
     A                                      COLHDG('End' +
     A                                             'Date')
     A            FSDVDL         1A         TEXT('Hedge Derivative Deals Ind.')
     A                                      COLHDG('Hedge Derivative' +
     A                                             'Deals Indicator')
     A            FSFTPO         1A         TEXT('Hedge Futures Positions Ind.')
     A                                      COLHDG('Hedge Futures' +
     A                                             'Positions Indicator')
     A            FSHGDL         1A         TEXT('Hedged Deals/Loans Indicator')
     A                                      COLHDG('Hedged Deals/' +
     A                                             'Loans Indicator')
     A            FSSECR         1A         TEXT('Hedged Security Refe. Ind.')
     A                                      COLHDG('Hedged Security' +
     A                                             'Reference Indicator')
     A            FSDAMT        15P 0       TEXT('Hedging Amount')
     A                                      COLHDG('Hedging' +
     A                                             'Amount')
     A            FSDUPL        15P 0       TEXT('Hedging Unrealized P/L')
     A                                      COLHDG('Hedging' +
     A                                             'Unrealized P/L')
     A            FSDYPL        15P 0       TEXT('Hedging URPL Yearend')
     A                                      COLHDG('Hedging URPL' +
     A                                             'Yearend')
     A            FSHAMT        15P 0       TEXT('Hedged Amount')
     A                                      COLHDG('Hedged' +
     A                                             'Amount')
     A            FSHUPL        15P 0       TEXT('Hedged Unrealized P/L')
     A                                      COLHDG('Hedged' +
     A                                             'Unrealized P/L')
     A            FSHYPL        15P 0       TEXT('Hedged URPL Yearend')
     A                                      COLHDG('Hedged URPL' +
     A                                             'Yearend')
     A            FSHEFP         6P 2       TEXT('Hedge Effectiveness +
     A                                            Percentage')
     A                                      COLHDG('Hedge Effectiveness' +
     A                                             'Percentage')
     A            FSCYCD         3A         TEXT('Hedge Currency')
     A                                      COLHDG('Hedge' +
     A                                             'Currency')
     A            FSLASD         5P 0       TEXT('Last Assessment Date')
     A                                      COLHDG('Last Assessment' +
     A                                             'Date')
     A            FSCHTP         1A         TEXT('Last Change Type')
     A                                      COLHDG('Last Change' +
     A                                             'Type')
     A            FSLCD          5P 0       TEXT('Last Change Date')
     A                                      COLHDG('Last Change' +
     A                                             'Date')
      **Start of change CAS005
     A            FSRIND         1A         TEXT('Rate Indicator')
     A                                      COLHDG('Rate Indicator')
      **End of change CAS005
      **Start of change CAS006
     A            FSDTTP         1A         TEXT('Data Type')
     A                                      COLHDG('Data Type')
      *
     A            FSDPTS         3P 0       TEXT('Data Points Required')
     A                                      COLHDG('Data Points Required')
      *
     A            FSDFRQ         1A         TEXT('Data Collection +
     A                                            Frequency')
     A                                      COLHDG('Data Collection' +
     A                                            'Frequency')
      *
     A            FSWDAY         3A         TEXT('Day of the Week')
     A                                      COLHDG('Day of the Week')
      *
     A            FSMNTH         2P 0       TEXT('Day of the Month')
     A                                      COLHDG('Day of the Month')
      *
     A            FSNDTA         5P 0       TEXT('Next Data Collection +
     A                                            Date')
     A                                      COLHDG('Next Data Collection' +
     A                                            'Date')
      *
     A            FSRSQR         9P 7       TEXT('Coefficient +
     A                                           of Determination')
     A                                      COLHDG('Coefficient ' +
     A                                           'of Determination')
      *
     A            FSTSTA        16P 4       TEXT('T-Statistic')
     A                                      COLHDG('T-Statistic')
      *
     A            FSSLCO        15P 3       TEXT('Slope Coefficient')
     A                                      COLHDG('Slope Coefficient')
      *
     A            FSDPTR         3P 0       TEXT('Number of Data +
     A                                           Points Regressed')
     A                                      COLHDG('Number of Data ' +
     A                                           'Points Regressed')
      *
     A            FSAPAF         1A         TEXT('Automatic Percentage +
     A                                           Adjustment Flag')
     A                                      COLHDG('Automatic Percentage' +
     A                                           ' Adjustment Flag')
      *
     A            FSBDAT         5P 0       TEXT('Base Date')
     A                                      COLHDG('Base Date')
      **End of change CAS006
