      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas AS Security Positions Hist Market Data File')
      *****************************************************************
      *                                                               *
      *  Midas - Accounting Standards Module                          *
      *                                                               *
      *  PF/ASSEHMPD - Midas AS Security Positions Hist Mrkt Dta File *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CAS006  *CREATE    Date 21Jan03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CAS006 - Hedge Accounting Phase B                            *
      *                                                               *
      *****************************************************************
      *
     A          R ASSEHMD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
      *
     A            XXRECI         1A         TEXT('Record ID')
     A                                      COLHDG('Record ID')
     A            XXHEDI         6S 0       TEXT('Hedge ID Number')
     A                                      COLHDG('Hedge ID Number')
     A            XXSESN        10A         TEXT('Security Shortname')
     A                                      COLHDG('Security Shortname')
     A            XXBRCA         3A         TEXT('Branch Code')
     A                                      COLHDG('Branch Code')
     A            XXCCY          3A         TEXT('Currency Code')
     A                                      COLHDG('Currency Code')
     A            XXBKCD         2A         TEXT('Book Code')
     A                                      COLHDG('Book Code')
     A            XXMKTI         1A         TEXT('Market Indicator')
     A                                      COLHDG('Market Indicator')
     A            XXBHTV         1A         TEXT('Trade/Value Date Basis')
     A                                      COLHDG('Trade/Value ' +
     A                                           'Date Basis')
     A            XXVDAT         5S 0       TEXT('Value Date')
     A                                      COLHDG('Value Date')
     A            XXMVAL        15S 0       TEXT('Market Value')
     A                                      COLHDG('Market Value')
     A            XXMVCA        15S 0       TEXT('Market Value Change')
     A                                      COLHDG('Market Value Change')
     A            XXMRAT        15S 8       TEXT('Market Price/Rate')
     A                                      COLHDG('Market Price/Rate')
     A            XXDTAT         1A         TEXT('Data Input Type, +
     A                                           P-Past, A - Actual')
     A                                      COLHDG('Data Input Type, ' +
     A                                           'P-Past, A - Actual')
     A            XXCHTP         1A         TEXT('Last Change Type')
     A                                      COLHDG('Last Change Type')
     A            XXLCD          5P 0       TEXT('Last Change Date')
     A                                      COLHDG('Last Change Date')
