      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas SD BAI branch codes enquiry')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  DSPF/SD0062E# - Branch Codes BAI record Enquiry              *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 29Nov05               *
      *                 CGL029             Date 01Sep03               *
      *                 CGL013             Date 20Feb02               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      *                 CRT004             DATE 04MAY00               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CSD003             Date 27OCT97               *
      *                 CRT003             Date 13JUN96               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CGL013 - MT94x Message Generation.                           *
      *  CRT004 - Cashier Midas TCP/IP interface.                     *
      *           Add A8LLIS and A8TCPP fields.                       *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  CRT003 - Branch Automation Interface: new screen.            *
      *                                                               *
      *****************************************************************
     A                                      INDARA
     A                                      PRINT(MPRINT)
     A                                      CHGINPDFT
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0062E#99
     A          R #RCDKEY                   TEXT('(c) Finastra +
     A                                      International Limited +
     A                                      2001')
     A*/COPY WNCPYSRC,SD0062E#98
     A                                      SETOF(98 'Force input format')
     A                                      BLINK OVERLAY
     A                                      INDTXT(86 'Enable PUTOVR')
     A  86                                  PUTOVR
     A* Command keys............................................................
     A                                      VLDCMDKEY(29 'Valid command key')
     A                                      CA03(03 'Exit.')
     A* SETOFFS.................................................................
     A                                      SETOF(99 'Global error flag')
     A                                      SETOF(31 'Invalid: #PWRTC')
     A                                      SETOF(32 'Invalid: #1BRCD')
     A*.........................................................................
     A            ##USR         10      1  2TEXT('*USER')
     A N25                                  OVRDTA
     A            ##PGM         10   H      TEXT('*PROGRAM')
     A                                  1 13'SD0062E1'
     A            ##MRDT         7      1 72TEXT('Midas Run Date')
     A N25                                  OVRDTA
     A            ##JOB         10      2  2TEXT('*JOB')
     A N25                                  OVRDTA
     A                                  2 23'Dsp Branch Codes BAI  Rec KEY SCR-
     A                                      EEN'
     A                                      DSPATR(HI)
     A            ##TME          6  0   2 71TEXT('*TIME')
     A                                      EDTWRD('  :  :  ')
     A N25                                  OVRDTA
     A                                  4  2'Work Return code...:'
     A            #PWRTC         5   B  4 23TEXT('Work Return code')
     A N25                                  OVRDTA
     A  31                                  DSPATR(RI PC)
     A N31                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                  5  2'Branch code...:'
     A            #1BRCD         3   B  5 18TEXT('Branch code')
     A                                      CHECK(FE)
     A N25                                  OVRDTA
     A  32                                  DSPATR(RI PC)
     A N32                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0062E#97
     A          R #CMDTXT1                  TEXT('Command keys')
     A*/COPY WNCPYSRC,SD0062E#96
     A                                      OVERLAY PUTOVR
     A            ##CTX1        78     23  2TEXT('Command Text 1')
     A N25                                  OVRDTA
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0062E#95
     A          R #RCDDTL1                  TEXT('Details')
     A*/COPY WNCPYSRC,SD0062E#94
     A                                      SETOF(98 'Force input format')
     A                                      BLINK OVERLAY
     A                                      INDTXT(86 'Enable PUTOVR')
     A  86                                  PUTOVR
     A                                      INDTXT(88 'Protect key fields')
     A                                      INDTXT(87 'Enable key screen')
     A* Command keys............................................................
     A                                      VLDCMDKEY(29 'Valid command key')
     A                                      CA03(03 'Exit.')
     A  87                                  CA12(12 'Key screen.')
     A* SETOFFS.................................................................
     A                                      SETOF(99 'Global error flag')
     A*.........................................................................
     A            ##USR         10      1  2TEXT('*USER')
     A N25                                  OVRDTA
     A            ##PGM         10   H      TEXT('*PROGRAM')
     A                                  1 13'SD0062E2'
     A            ##MRDT         7      1 72TEXT('Midas Run Date')
     A N25                                  OVRDTA
     A            ##JOB         10      2  2TEXT('*JOB')
     A N25                                  OVRDTA
     A                                  2 21'Branch Codes Enquiry - Cashier In-
     A                                      terface'
     A                                      DSPATR(HI)
     A            ##TME          6  0   2 71TEXT('*TIME')
     A                                      EDTWRD('  :  :  ')
     A N25                                  OVRDTA
     A            #PWRTC         5   H      TEXT('Work Return code')
      * Begin /CSD027/
     A**********  #1SYCU         6  0H      TEXT('Synd Agent-Customer Ref')                   CSD027
     A            #1SYCU         6A  H      TEXT('Synd Agent-Customer Ref')
      * End /CSD027/
     A            #1MQSM        10   H      TEXT('MQ for Sent Messages')
     A            #1MQRT        10   H      TEXT('MQ for Returned Messages')
     A            #1MQBU        10   H      TEXT('MQ for Bulk Transfer')
     A            #1MQDF        10   H      TEXT('MQ for Drip Feed')
     A            #1TIBR         4   H      TEXT('TI Branch Number')
     A            #1TIDS         2   H      TEXT('TI Departmental Server')
     A            #1BRA1        35   H      TEXT('TI Brch Name and Addr 1')
     A            #1BRA2        35   H      TEXT('TI Brch Name and Addr 2')
     A            #1BRA3        35   H      TEXT('TI Brch Name and Addr 3')
     A            #1BRA4        35   H      TEXT('TI Brch Name and Addr 4')
     A            #1BRA5        35   H      TEXT('TI Brch Name and Addr 5')
     A            #1BRNB        16   H      TEXT('TI Branch Telephone Nbr')
     A            #1CMCD         3   H      TEXT('Company Code')
     A            #1LCCD         3   H      TEXT('Location Code')
     A**Start of change CGL029
     A**********  #1DFAC         4   H      TEXT('Due From A/c')                              CGL029
     A**********  #1DTAC         4   H      TEXT('Due To A/c')                                CGL029
     A            #1DFAC        10   H      TEXT('Due From A/c')
     A            #1DTAC        10   H      TEXT('Due To A/c')
     A**End of change CGL029
     A            #1BICN         6   H      TEXT('Branch Internal Customer')
     A            #1LCD          5  0H      TEXT('Last Change Date')
     A            #1TYLC         1   H      TEXT('Type of Last Change')
     A            #1GBCD         3   H      TEXT('Global Branch Code')
     A            #1BRSN         3   H      TEXT('Branch Shortname')
     A            #1RECI         1   H      TEXT('Record Id')
     A            #1BTID        12   H      TEXT('Branch TID Address')
     A            #1STCD         6  0H      TEXT('Sort Code')
     A            #1RDFC         1   H      TEXT('Round Down Interest Ind')
     A            #1OGID        10   H      TEXT('Midas Export Value OGID')
     A            #1PCSS        10   H      TEXT('PC Subsystem')
     A            #1BTWN        10   H      TEXT('Branch Town')
      *                                              Begin /CGL013/
     A            #1TMOF         4  0H      TEXT('Time Offset against UTC')
     A            #1SIGN         1   H      TEXT('Time Offset Sign')
     A            #1STOF         4  0H      TEXT('System Time Offset')
     A            #1SSIN         1   H      TEXT('System Time Offset Sign')
      *                                              End   /CGL013/
     A                                  4  2'Branch code......:'
     A            #1BRCD         3      4 21TEXT('Branch code')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                  5  2'Branch Name......:'
     A            #1BRNM        30      5 21TEXT('Branch Name')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                  7  2'Branch Status....:'
     A            #1BRST         1      7 21TEXT('Branch Status')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                  9  2'                   Opening   Clos-
     A                                      ing  Override'
     A                                 10  2'                   Time      Time'
     A                                 11  2'Sunday...........:'
     A            #1SUOP         4  0  11 21TEXT('Sunday Opening Time')
     A                                      EDTWRD('  :  ')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #1SUCL         4  0  11 31TEXT('Sunday Closing Time')
     A                                      EDTWRD('  :  ')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #1SUOV         1     11 43TEXT('Sunday Times Override')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 12  2'Monday...........:'
     A            #1MOOP         4  0  12 21TEXT('Monday Opening Time')
     A                                      EDTWRD('  :  ')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #1MOCL         4  0  12 31TEXT('Monday Closing Time')
     A                                      EDTWRD('  :  ')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #1MOOV         1     12 43TEXT('Monday Times Override')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 13  2'Tuesday..........:'
     A            #1TUOP         4  0  13 21TEXT('Tuesday Opening Time')
     A                                      EDTWRD('  :  ')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #1TUCL         4  0  13 31TEXT('Tuesday Closing Time')
     A                                      EDTWRD('  :  ')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #1TUOV         1     13 43TEXT('Tuesday Times Override')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 14  2'Wednesday........:'
     A            #1WEOP         4  0  14 21TEXT('Wednesday Opening Time')
     A                                      EDTWRD('  :  ')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #1WECL         4  0  14 31TEXT('Wednesday Closing Time')
     A                                      EDTWRD('  :  ')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #1WEOV         1     14 43TEXT('Wednesday Times Override')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 15  2'Thursday.........:'
     A            #1THOP         4  0  15 21TEXT('Thursday Opening Time')
     A                                      EDTWRD('  :  ')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #1THCL         4  0  15 31TEXT('Thursday Closing Time')
     A                                      EDTWRD('  :  ')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #1THOV         1     15 43TEXT('Thursday Times Override')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 16  2'Friday...........:'
     A            #1FYOP         4  0  16 21TEXT('Friday Opening Time')
     A                                      EDTWRD('  :  ')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #1FYCL         4  0  16 31TEXT('Friday Closing Time')
     A                                      EDTWRD('  :  ')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #1FYOV         1     16 43TEXT('Friday Times Override')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 17  2'Saturday.........:'
     A            #1SAOP         4  0  17 21TEXT('Saturday Opening Time')
     A                                      EDTWRD('  :  ')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #1SACL         4  0  17 31TEXT('Saturday Closing Time')
     A                                      EDTWRD('  :  ')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #1SAOV         1     17 43TEXT('Saturday Times Override')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
      *                                              Begin /CRT004/
     A                                 19  2'TCP/IP Listener...:'
     A N80                                  DSPATR(ND)
     A            #1LLIS         1     19 22TEXT('TCP/IP Listener')
     A N25                                  OVRDTA
     A  80                                  DSPATR(HI)
     A N80                                  DSPATR(ND)
     A                                 20  2'TCP/IP Port Number:'
     A N80                                  DSPATR(ND)
     A            #1TCPP         4  0  20 22TEXT('TCP/IP Port Number')
     A N25                                  OVRDTA
     A  80                                  DSPATR(HI)
     A N80                                  DSPATR(ND)
      *                                              End   /CRT004/
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0062E#93
     A          R #CMDTXT2                  TEXT('Command keys')
     A*/COPY WNCPYSRC,SD0062E#92
     A                                      OVERLAY PUTOVR
     A            ##CTX1        78     23  2TEXT('Command Text 1')
     A N25                                  OVRDTA
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0062E#91
     A          R #MSGRCD                   TEXT('Program messages')
     A*/COPY WNCPYSRC,SD0062E#90
     A                                      SFL SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            ##PGM                     SFLPGMQ
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0062E#89
     A          R #MSGCTL                   TEXT('Program messages')
     A*/COPY WNCPYSRC,SD0062E#88
     A                                      SFLCTL(#MSGRCD)
     A                                      SFLPAG(01) SFLSIZ(03)
     A  86                                  OVERLAY PUTOVR
     A                                      SFLINZ SFLDSP SFLDSPCTL
     A  25
     AON25                                  SFLEND
     A            ##PGM                     SFLPGMQ
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0062E#87
