      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas SD Edit a Year's Holidays 3 Edit record')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  DSPF/SD0163R# - Maintain holidays 3.                         *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Note: Core amendments to this file must be applied via       *
      *        the core synon model.                                  *
      *                                                               *
      *  Note: Synon programmers - DTAARA/YINDPTYSYA in Y2SY must     *
      *        be set to a value of *ATRIND for generation and        *
      *        reset to *ERRIND when generation is complete.          *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD031             Date 10Apr06               *
      *                 CAAA03             Date 27Mar04               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 094290             DATE 09OCT95               *
      *                 063310             DATE 14FEB94               *
      *                 S01459             DATE 14JAN94               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD031 - Enhanced Centralised Static Data                    *
      *  CAAA03 - Webfacing Changes                                   *
      *  094290 - All fields appear on the screen because the         *
      *           function ran out of indicators.                     *
      *  063310 - Do not allow the user to change today or the next   *
      *           working day to a holiday.                           *
      *  S01459 - Addition of Midas headerbox.                        *
      *                                                               *
      *****************************************************************
      **Start of change CSD031
     A                                      DSPSIZ(27 132 *DS3)
      **End of change CSD031
     A                                      INDARA
      **Start of change CSD031
     A**********                            PRINT(MPRINT)                                     CSD031
     A                                      PRINT(*LIBL/MPRINT)
      **End of change CSD031
     A                                      CHGINPDFT
     A*=========================================================================
     A          R #RCDKEY                   TEXT('(c) Finastra +
     A                                      International Limited +
     A                                      2001')
     A                                      SETOF(98 'Force input format')
     A                                      BLINK OVERLAY
     A                                      INDTXT(86 'Enable PUTOVR')
     A  86                                  PUTOVR
     A* Command keys............................................................
     A                                      VLDCMDKEY(29 'Valid command key')
     A                                      CA03(03 'Exit.')
     A* SETOFFS.................................................................
     A                                      SETOF(99 'Global error flag')
     A                                      SETOF(31 'Invalid: #1CYCD')
     A                                      SETOF(32 'Invalid: #1LCCD')
     A                                      SETOF(33 'Invalid: #1YRNB')
     A*.........................................................................
     A            ##USR         10      1  2TEXT('*USER')
     A N25                                  OVRDTA
     A            ##PGM         10   H      TEXT('*PROGRAM')
     A                                  1 13'SD0163R1'
     A            ##MRDT         7      1 72TEXT('Midas Run Date')
     A N25                                  OVRDTA
     A            ##JOB         10      2  2TEXT('*JOB')
     A N25                                  OVRDTA
     A                                  2 24'EDIT A YEAR''S HOLIDAYS 3 KEY SCR-
     A                                      EEN'
     A                                      DSPATR(HI)
     A            ##TME          6  0   2 71TEXT('*TIME')
     A                                      EDTWRD('  :  :  ')
     A N25                                  OVRDTA
     A                                  7  2'Currency Code...:'
     A            #1CYCD         3   B  7 20TEXT('Currency Code')
     A                                      CHECK(FE)
     A N25                                  OVRDTA
     A  31                                  DSPATR(RI PC)
     A N31                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                  8  2'Location Code...:'
     A            #1LCCD         3   B  8 20TEXT('Location Code')
     A                                      CHECK(FE)
     A N25                                  OVRDTA
     A  32                                  DSPATR(RI PC)
     A N32                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                  9  2'Year Number.....:'
     A            #1YRNB         4   B  9 20TEXT('Year Number')
     A                                      CHECK(FE)
     A N25                                  OVRDTA
     A  33                                  DSPATR(RI PC)
     A N33                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A*=========================================================================
     A          R #CMDTXT1                  TEXT('Command keys')
     A                                      OVERLAY PUTOVR
     A            ##CTX1        78     23  2TEXT('Command Text 1')
     A N25                                  OVRDTA
     A*=========================================================================
     A          R #RCDDTL1                  TEXT('Details')
     A                                      SETOF(98 'Force input format')
     A                                      BLINK OVERLAY
     A                                      INDTXT(86 'Enable PUTOVR')
     A  86                                  PUTOVR
     A                                      INDTXT(88 'Protect key fields')
     A                                      INDTXT(87 'Enable key screen')
     A* Command keys............................................................
     A                                      VLDCMDKEY(29 'Valid command key')
     A                                      CA03(03 'Exit.')
     A  87                                  CA12(12 'Key screen.')
     A N89                                  CF10(10 'Delete.')
     A* SETOFFS.................................................................
     A                                      SETOF(99 'Global error flag')
     A                                      SETOF(31 'Invalid: #DJ01S')
     A                                      SETOF(32 'Invalid: #DJ08S')
     A                                      SETOF(33 'Invalid: #DJ15S')
     A                                      SETOF(34 'Invalid: #DJ22S')
     A                                      SETOF(35 'Invalid: #DJ29S')
     A                                      SETOF(36 'Invalid: #DJ36S')
     A                                      SETOF(37 'Invalid: #DF01S')
     A                                      SETOF(38 'Invalid: #DF08S')
     A                                      SETOF(39 'Invalid: #DF15S')
     A                                      SETOF(40 'Invalid: #DF22S')
     A                                      SETOF(41 'Invalid: #DF29S')
     A                                      SETOF(42 'Invalid: #DF36S')
     A*.........................................................................
     A            ##USR         10      1  2TEXT('*USER')
     A N25                                  OVRDTA
     A            ##PGM         10   H      TEXT('*PROGRAM')
     A                                  1 13'SD0163R2'
     A            ##MRDT         7      1 72TEXT('Midas Run Date')
     A N25                                  OVRDTA
     A            ##JOB         10      2  2TEXT('*JOB')
     A N25                                  OVRDTA
     A                                  2 26'3rd Quarter Holiday Maintenance'
     A                                      DSPATR(HI)
     A            ##TME          6  0   2 71TEXT('*TIME')
     A                                      EDTWRD('  :  :  ')
     A N25                                  OVRDTA
     A            #1LCCD         3   H      TEXT('Location Code')
     A            #1LCD          5  0H      TEXT('Last Change Date')
     A            #1TYLC         1   H      TEXT('Type of Last Change')
     A                                  4  2'Currency..:'
     A            #1CYCD         3      4 14TEXT('Currency Code')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                  4 19'Location..:'
     A            #DLCDF         3      4 31TEXT('Location Code -Func. Fld')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                  4 36'Year..:'
     A            #1YRNB         4      4 44TEXT('Year Number')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
      ** Start of change CSD031
     A            #TITL         17A  O  4 53
     A            #1AACC         1A  O  4 71TEXT('Accept to Zone Indicator')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A  26                                  DSPATR(ND)
     A                                  4 77'Effective Date..:'
     A N25                                  OVRATR
     A  27                                  DSPATR(ND)
     A            #1EACC         6A  O  4 95TEXT('Effective Date')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A  27                                  DSPATR(ND)
      ** End of change CSD031
      ** Start of change CAAA03
     A**********                        6 16'July                             -               CAAA03
     A**********                                    August'                                   CAAA03
     A                                  6 16'July'
     A                                  6 57'August'
      ** End of change CAAA03
     A                                  7  2'S'
     A            #DJ01N         2      7  5TEXT('January 01 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ01S         1   B  7  8TEXT('January 01 Status Func')
     A N25                                  OVRDTA
     A  79                                  DSPATR(PR)
     A  31                                  DSPATR(RI PC)
     A  79N31                               DSPATR(ND)
     A N79N31                               DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DJ08N         2      7 11TEXT('January 08 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ08S         1   B  7 14TEXT('January 08 Status Func')
     A N25                                  OVRDTA
     A  32                                  DSPATR(RI PC)
     A N32                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DJ15N         2      7 17TEXT('January 15 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ15S         1   B  7 20TEXT('January 15 Status Func')
     A N25                                  OVRDTA
     A  33                                  DSPATR(RI PC)
     A N33                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DJ22N         2      7 23TEXT('January 22 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ22S         1   B  7 26TEXT('January 22 Status Func')
     A N25                                  OVRDTA
     A  34                                  DSPATR(RI PC)
     A N34                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DJ29N         2      7 29TEXT('January 29 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ29S         1   B  7 32TEXT('January 29 Status Func')
     A N25                                  OVRDTA
     A  35                                  DSPATR(RI PC)
     A N35                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DJ36N         2      7 35TEXT('January 36 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ36S         1   B  7 38TEXT('January 36 Status Func')
     A N25                                  OVRDTA
     A  78                                  DSPATR(PR)
     A  36                                  DSPATR(RI PC)
     A  78N36                               DSPATR(ND)
     A N78N36                               DSPATR(UL HI)
     A N25                                  OVRATR
     A                                  7 43'S'
     A            #DF01N         2      7 46TEXT('February 01 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF01S         1   B  7 49TEXT('February 01 Status Func')
     A N25                                  OVRDTA
     A  77                                  DSPATR(PR)
     A  37                                  DSPATR(RI PC)
     A  77N37                               DSPATR(ND)
     A N77N37                               DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DF08N         2      7 52TEXT('February 08 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF08S         1   B  7 55TEXT('February 08 Status Func')
     A N25                                  OVRDTA
     A  38                                  DSPATR(RI PC)
     A N38                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DF15N         2      7 58TEXT('February 15 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF15S         1   B  7 61TEXT('February 15 Status Func')
     A N25                                  OVRDTA
     A  39                                  DSPATR(RI PC)
     A N39                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DF22N         2      7 64TEXT('February 22 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF22S         1   B  7 67TEXT('February 22 Status Func')
     A N25                                  OVRDTA
     A  40                                  DSPATR(RI PC)
     A N40                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DF29N         2      7 70TEXT('February 29 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF29S         1   B  7 73TEXT('February 29 Status Func')
     A N25                                  OVRDTA
     A  41                                  DSPATR(RI PC)
     A N41                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DF36N         2      7 76TEXT('February 36 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF36S         1   B  7 79TEXT('February 36 Status Func')
     A N25                                  OVRDTA
     A  76                                  DSPATR(PR)
     A  42                                  DSPATR(RI PC)
     A  76N42                               DSPATR(ND)
     A N76N42                               DSPATR(UL HI)
     A N25                                  OVRATR
     A                                  8  2'S'
     A            #DJ02N         2      8  5TEXT('January 02 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ02S         1   B  8  8TEXT('January 02 Status Func')
     A N25                                  OVRDTA
     A  75                                  DSPATR(PR)
     A  75                                  DSPATR(ND)
     A N75                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DJ09N         2      8 11TEXT('January 09 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ09S         1   B  8 14TEXT('January 09 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DJ16N         2      8 17TEXT('January 16 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ16S         1   B  8 20TEXT('January 16 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DJ23N         2      8 23TEXT('January 23 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ23S         1   B  8 26TEXT('January 23 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DJ30N         2      8 29TEXT('January 30 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ30S         1   B  8 32TEXT('January 30 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DJ37N         2      8 35TEXT('January 37 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ37S         1   B  8 38TEXT('January 37 Status Func')
     A N25                                  OVRDTA
     A  74                                  DSPATR(PR)
     A  74                                  DSPATR(ND)
     A N74                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                  8 43'S'
     A            #DF02N         2      8 46TEXT('February 02 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF02S         1   B  8 49TEXT('February 02 Status Func')
     A N25                                  OVRDTA
     A  73                                  DSPATR(PR)
     A  73                                  DSPATR(ND)
     A N73                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DF09N         2      8 52TEXT('February 09 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF09S         1   B  8 55TEXT('February 09 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DF16N         2      8 58TEXT('February 16 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF16S         1   B  8 61TEXT('February 16 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DF23N         2      8 64TEXT('February 23 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF23S         1   B  8 67TEXT('February 23 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DF30N         2      8 70TEXT('February 30 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF30S         1   B  8 73TEXT('February 30 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DF37N         2      8 76TEXT('February 37 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF37S         1   B  8 79TEXT('February 37 Status Func')
     A N25                                  OVRDTA
     A  72                                  DSPATR(PR)
     A  72                                  DSPATR(ND)
     A N72                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                  9  2'M'
     A            #DJ03N         2      9  5TEXT('January 03 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ03S         1   B  9  8TEXT('January 03 Status Func')
     A N25                                  OVRDTA
     A  71                                  DSPATR(PR)
     A  71                                  DSPATR(ND)
     A N71                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DJ10N         2      9 11TEXT('January 10 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ10S         1   B  9 14TEXT('January 10 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DJ17N         2      9 17TEXT('January 17 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ17S         1   B  9 20TEXT('January 17 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DJ24N         2      9 23TEXT('January 24 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ24S         1   B  9 26TEXT('January 24 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DJ31N         2      9 29TEXT('January 31 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ31S         1   B  9 32TEXT('January 31 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A                                  9 43'M'
     A            #DF03N         2      9 46TEXT('February 03 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF03S         1   B  9 49TEXT('February 03 Status Func')
     A N25                                  OVRDTA
     A  70                                  DSPATR(PR)
     A  70                                  DSPATR(ND)
     A N70                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DF10N         2      9 52TEXT('February 10 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF10S         1   B  9 55TEXT('February 10 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DF17N         2      9 58TEXT('February 17 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF17S         1   B  9 61TEXT('February 17 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DF24N         2      9 64TEXT('February 24 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF24S         1   B  9 67TEXT('February 24 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DF31N         2      9 70TEXT('February 31 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF31S         1   B  9 73TEXT('February 31 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A                                 10  2'T'
     A            #DJ04N         2     10  5TEXT('January 04 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ04S         1   B 10  8TEXT('January 04 Status Func')
     A N25                                  OVRDTA
     A  69                                  DSPATR(PR)
     A  69                                  DSPATR(ND)
     A N69                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DJ11N         2     10 11TEXT('January 11 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ11S         1   B 10 14TEXT('January 11 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DJ18N         2     10 17TEXT('January 18 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ18S         1   B 10 20TEXT('January 18 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DJ25N         2     10 23TEXT('January 25 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ25S         1   B 10 26TEXT('January 25 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DJ32N         2     10 29TEXT('January 32 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ32S         1   B 10 32TEXT('January 32 Status Func')
     A N25                                  OVRDTA
     A  68                                  DSPATR(PR)
     A  68                                  DSPATR(ND)
     A N68                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 10 43'T'
     A            #DF04N         2     10 46TEXT('February 04 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF04S         1   B 10 49TEXT('February 04 Status Func')
     A N25                                  OVRDTA
     A  67                                  DSPATR(PR)
     A  67                                  DSPATR(ND)
     A N67                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DF11N         2     10 52TEXT('February 11 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF11S         1   B 10 55TEXT('February 11 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DF18N         2     10 58TEXT('February 18 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF18S         1   B 10 61TEXT('February 18 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DF25N         2     10 64TEXT('February 25 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF25S         1   B 10 67TEXT('February 25 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DF32N         2     10 70TEXT('February 32 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF32S         1   B 10 73TEXT('February 32 Status Func')
     A N25                                  OVRDTA
     A  66                                  DSPATR(PR)
     A  66                                  DSPATR(ND)
     A N66                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 11  2'W'
     A            #DJ05N         2     11  5TEXT('January 05 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ05S         1   B 11  8TEXT('January 05 Status Func')
     A N25                                  OVRDTA
     A  65                                  DSPATR(PR)
     A  65                                  DSPATR(ND)
     A N65                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DJ12N         2     11 11TEXT('January 12 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ12S         1   B 11 14TEXT('January 12 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DJ19N         2     11 17TEXT('January 19 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ19S         1   B 11 20TEXT('January 19 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DJ26N         2     11 23TEXT('January 26 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ26S         1   B 11 26TEXT('January 26 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DJ33N         2     11 29TEXT('January 33 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ33S         1   B 11 32TEXT('January 33 Status Func')
     A N25                                  OVRDTA
     A  64                                  DSPATR(PR)
     A  64                                  DSPATR(ND)
     A N64                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 11 43'W'
     A            #DF05N         2     11 46TEXT('February 05 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF05S         1   B 11 49TEXT('February 05 Status Func')
     A N25                                  OVRDTA
     A  63                                  DSPATR(PR)
     A  63                                  DSPATR(ND)
     A N63                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DF12N         2     11 52TEXT('February 12 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF12S         1   B 11 55TEXT('February 12 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DF19N         2     11 58TEXT('February 19 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF19S         1   B 11 61TEXT('February 19 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DF26N         2     11 64TEXT('February 26 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF26S         1   B 11 67TEXT('February 26 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DF33N         2     11 70TEXT('February 33 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF33S         1   B 11 73TEXT('February 33 Status Func')
     A N25                                  OVRDTA
     A  62                                  DSPATR(PR)
     A  62                                  DSPATR(ND)
     A N62                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 12  2'T'
     A            #DJ06N         2     12  5TEXT('January 06 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ06S         1   B 12  8TEXT('January 06 Status Func')
     A N25                                  OVRDTA
     A  61                                  DSPATR(PR)
     A  61                                  DSPATR(ND)
     A N61                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DJ13N         2     12 11TEXT('January 13 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ13S         1   B 12 14TEXT('January 13 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DJ20N         2     12 17TEXT('January 20 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ20S         1   B 12 20TEXT('January 20 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DJ27N         2     12 23TEXT('January 27 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ27S         1   B 12 26TEXT('January 27 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DJ34N         2     12 29TEXT('January 34 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ34S         1   B 12 32TEXT('January 34 Status Func')
     A N25                                  OVRDTA
     A  60                                  DSPATR(PR)
     A  60                                  DSPATR(ND)
     A N60                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 12 43'T'
     A            #DF06N         2     12 46TEXT('February 06 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF06S         1   B 12 49TEXT('February 06 Status Func')
     A N25                                  OVRDTA
     A  59                                  DSPATR(PR)
     A  59                                  DSPATR(ND)
     A N59                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DF13N         2     12 52TEXT('February 13 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF13S         1   B 12 55TEXT('February 13 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DF20N         2     12 58TEXT('February 20 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF20S         1   B 12 61TEXT('February 20 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DF27N         2     12 64TEXT('February 27 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF27S         1   B 12 67TEXT('February 27 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DF34N         2     12 70TEXT('February 34 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF34S         1   B 12 73TEXT('February 34 Status Func')
     A N25                                  OVRDTA
     A  58                                  DSPATR(PR)
     A  58                                  DSPATR(ND)
     A N58                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 13  2'F'
     A            #DJ07N         2     13  5TEXT('January 07 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ07S         1   B 13  8TEXT('January 07 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DJ14N         2     13 11TEXT('January 14 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ14S         1   B 13 14TEXT('January 14 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DJ21N         2     13 17TEXT('January 21 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ21S         1   B 13 20TEXT('January 21 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DJ28N         2     13 23TEXT('January 28 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ28S         1   B 13 26TEXT('January 28 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DJ35N         2     13 29TEXT('January 35 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DJ35S         1   B 13 32TEXT('January 35 Status Func')
     A N25                                  OVRDTA
     A  57                                  DSPATR(PR)
     A  57                                  DSPATR(ND)
     A N57                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 13 43'F'
     A            #DF07N         2     13 46TEXT('February 07 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF07S         1   B 13 49TEXT('February 07 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DF14N         2     13 52TEXT('February 14 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF14S         1   B 13 55TEXT('February 14 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DF21N         2     13 58TEXT('February 21 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF21S         1   B 13 61TEXT('February 21 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DF28N         2     13 64TEXT('February 28 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF28S         1   B 13 67TEXT('February 28 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DF35N         2     13 70TEXT('February 35 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DF35S         1   B 13 73TEXT('February 35 Status Func')
     A N25                                  OVRDTA
     A  56                                  DSPATR(PR)
     A  56                                  DSPATR(ND)
     A N56                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 15 37'September'
     A                                 16 22'S'
     A            #DM01N         2     16 25TEXT('March 01 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM01S         1   B 16 28TEXT('March 01 Status Func')
     A N25                                  OVRDTA
     A  55                                  DSPATR(PR)
     A  55                                  DSPATR(ND)
     A N55                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DM08N         2     16 31TEXT('March 08 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM08S         1   B 16 34TEXT('March 08 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DM15N         2     16 37TEXT('March 15 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM15S         1   B 16 40TEXT('March 15 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DM22N         2     16 43TEXT('March 22 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM22S         1   B 16 46TEXT('March 22 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DM29N         2     16 49TEXT('March 29 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM29S         1   B 16 52TEXT('March 29 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DM36N         2     16 55TEXT('March 36 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM36S         1   B 16 58TEXT('March 36 Status Func')
     A N25                                  OVRDTA
     A  54                                  DSPATR(PR)
     A  54                                  DSPATR(ND)
     A N54                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 17 22'S'
     A            #DM02N         2     17 25TEXT('March 02 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM02S         1   B 17 28TEXT('March 02 Status Func')
     A N25                                  OVRDTA
     A  53                                  DSPATR(PR)
     A  53                                  DSPATR(ND)
     A N53                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DM09N         2     17 31TEXT('March 09 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM09S         1   B 17 34TEXT('March 09 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DM16N         2     17 37TEXT('March 16 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM16S         1   B 17 40TEXT('March 16 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DM23N         2     17 43TEXT('March 23 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM23S         1   B 17 46TEXT('March 23 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DM30N         2     17 49TEXT('March 30 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM30S         1   B 17 52TEXT('March 30 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A                                 18 22'M'
     A            #DM03N         2     18 25TEXT('March 03 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM03S         1   B 18 28TEXT('March 03 Status Func')
     A N25                                  OVRDTA
     A  52                                  DSPATR(PR)
     A  52                                  DSPATR(ND)
     A N52                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DM10N         2     18 31TEXT('March 10 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM10S         1   B 18 34TEXT('March 10 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DM17N         2     18 37TEXT('March 17 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM17S         1   B 18 40TEXT('March 17 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DM24N         2     18 43TEXT('March 24 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM24S         1   B 18 46TEXT('March 24 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DM31N         2     18 49TEXT('March 31 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM31S         1   B 18 52TEXT('March 31 Status Func')
     A N25                                  OVRDTA
     A  51                                  DSPATR(PR)
     A  51                                  DSPATR(ND)
     A N51                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 19 22'T'
     A            #DM04N         2     19 25TEXT('March 04 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM04S         1   B 19 28TEXT('March 04 Status Func')
     A N25                                  OVRDTA
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(ND)
     A N50                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DM11N         2     19 31TEXT('March 11 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM11S         1   B 19 34TEXT('March 11 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DM18N         2     19 37TEXT('March 18 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM18S         1   B 19 40TEXT('March 18 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DM25N         2     19 43TEXT('March 25 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM25S         1   B 19 46TEXT('March 25 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DM32N         2     19 49TEXT('March 32 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM32S         1   B 19 52TEXT('March 32 Status Func')
     A N25                                  OVRDTA
     A  49                                  DSPATR(PR)
     A  49                                  DSPATR(ND)
     A N49                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 20 22'W'
     A            #DM05N         2     20 25TEXT('March 05 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM05S         1   B 20 28TEXT('March 05 Status Func')
     A N25                                  OVRDTA
     A  48                                  DSPATR(PR)
     A  48                                  DSPATR(ND)
     A N48                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DM12N         2     20 31TEXT('March 12 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM12S         1   B 20 34TEXT('March 12 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DM19N         2     20 37TEXT('March 19 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM19S         1   B 20 40TEXT('March 19 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DM26N         2     20 43TEXT('March 26 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM26S         1   B 20 46TEXT('March 26 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DM33N         2     20 49TEXT('March 33 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM33S         1   B 20 52TEXT('March 33 Status Func')
     A N25                                  OVRDTA
     A  47                                  DSPATR(PR)
     A  47                                  DSPATR(ND)
     A N47                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 21 22'T'
     A            #DM06N         2     21 25TEXT('March 06 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM06S         1   B 21 28TEXT('March 06 Status Func')
     A N25                                  OVRDTA
     A  46                                  DSPATR(PR)
     A  46                                  DSPATR(ND)
     A N46                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DM13N         2     21 31TEXT('March 13 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM13S         1   B 21 34TEXT('March 13 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DM20N         2     21 37TEXT('March 20 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM20S         1   B 21 40TEXT('March 20 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DM27N         2     21 43TEXT('March 27 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM27S         1   B 21 46TEXT('March 27 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DM34N         2     21 49TEXT('March 34 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM34S         1   B 21 52TEXT('March 34 Status Func')
     A N25                                  OVRDTA
     A  45                                  DSPATR(PR)
     A  45                                  DSPATR(ND)
     A N45                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 22 22'F'
     A            #DM07N         2     22 25TEXT('March 07 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM07S         1   B 22 28TEXT('March 07 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DM14N         2     22 31TEXT('March 14 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM14S         1   B 22 34TEXT('March 14 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DM21N         2     22 37TEXT('March 21 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM21S         1   B 22 40TEXT('March 21 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DM28N         2     22 43TEXT('March 28 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM28S         1   B 22 46TEXT('March 28 Status Func')
     A N25                                  OVRDTA
     A                                      DSPATR(UL HI)
     A            #DM35N         2     22 49TEXT('March 35 Numeric Func')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DM35S         1   B 22 52TEXT('March 35 Status Func')
     A N25                                  OVRDTA
     A  44                                  DSPATR(PR)
     A  44                                  DSPATR(ND)
     A N44                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A*=========================================================================
     A          R #CMDTXT2                  TEXT('Command keys')
     A                                      OVERLAY PUTOVR
      **Start of change CSD031
     A**********  ##CTX1        78     23  2TEXT('Command Text 1')                            CSD031
     A            ##CTX1        78     26  2TEXT('Command Text 1')
      **End of change CSD031
     A N25                                  OVRDTA
     A*=========================================================================
     A          R #MSGRCD                   TEXT('Program messages')
      **Start of change CSD031
     A**********                            SFL SFLMSGRCD(24)                                 CSD031
     A                                      SFL SFLMSGRCD(27)
      **End of change CSD031
     A            MSGKEY                    SFLMSGKEY
     A            ##PGM                     SFLPGMQ
     A*=========================================================================
     A          R #MSGCTL                   TEXT('Program messages')
     A                                      SFLCTL(#MSGRCD)
     A                                      SFLPAG(01) SFLSIZ(03)
     A  86                                  OVERLAY PUTOVR
     A                                      SFLINZ SFLDSP SFLDSPCTL
     A  25
     AON25                                  SFLEND
     A            ##PGM                     SFLPGMQ
     A*=========================================================================
