      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas SD Edit Retail Transaction')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  DSPF/SD0131R# - Retail transaction types maintenance.        *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CSD003             Date 27Oct97               *
      *                 CRT002             Date 24Feb97               *
      *                 S01408             DATE 23AUG96               *
      *                 090199             DATE 07JUL95               *
      *                 CRT001             DATE 10MAR95               *
      *                 S01486             DATE 24JUN94               *
      *                 S01459             DATE 24JUN94               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  CRT002 - Retail Branch Access.                               *
      *           Condition CRT001 fields to also appear if CRT002 is *
      *           on.                                                 *
      *  S01408 - Addition of standard hooks.                         *
      *  090199 - Re-compilation to correct Multi-Language            *
      *           References.                                         *
      *  CRT001 - Retail Teller SyStem development:                   *
      *           Addition of 'Associated GL Account Code',           *
      *           'Passbook Transaction Type', 'Cash Indicator'       *
      *           and 'Clearing Indicator'.                           *
      *  S01486 - Private Banking: addition of                        *
      *           'Change to Portfolio Capital', 'Performance Event   *
      *           Type' and 'Applies to Retail Account'.              *
      *  S01459 - Addition of Midas headerbox.                        *
      *                                                               *
      *****************************************************************
     A                                      INDARA
     A                                      PRINT(MPRINT)
     A                                      CHGINPDFT
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0131R#99
     A          R #RCDKEY                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*/COPY WNCPYSRC,SD0131R#98
     A                                      SETOF(98 'Force input format')
     A                                      BLINK OVERLAY
     A                                      INDTXT(86 'Enable PUTOVR')
     A  86                                  PUTOVR
     A                                      INDTXT(89 '89')
     A* Command keys............................................................
     A                                      VLDCMDKEY(29 'Valid command key')
     A                                      CA03(03 'Exit.')
     A                                      CF09(09 'Change mode.')
     A* SETOFFS.................................................................
     A                                      SETOF(99 'Global error flag')
     A                                      SETOF(31 'Invalid: #1RTTY')
     A*.........................................................................
     A            ##USR         10      1  2TEXT('*USER')
     A N25                                  OVRDTA
     A            ##PGM         10   H      TEXT('*PROGRAM')
     A                                  1 13'SD0131R1'
     A            ##MRDT         7      1 72TEXT('Midas Run Date')
     A N25                                  OVRDTA
     A            ##JOB         10      2  2TEXT('*JOB')
     A N25                                  OVRDTA
     A                                  2 23'Retail Transaction Types Maintena-
     A                                      nce'
     A                                      DSPATR(HI)
     A            ##TME          6  0   2 71TEXT('*TIME')
     A                                      EDTWRD('  :  :  ')
     A N25                                  OVRDTA
     A                                  4  2'Retail Transaction Type:'
     A            #1RTTY         5   B  4 27TEXT('Retail Transaction Type')
     A                                      CHECK(FE)
     A N25                                  OVRDTA
     A  31                                  DSPATR(RI PC)
     A N31                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0131R#97
     A          R #CMDTXT1                  TEXT('Command keys')
     A*/COPY WNCPYSRC,SD0131R#96
     A                                      OVERLAY PUTOVR
     A            ##CTX1        78     23  2TEXT('Command Text 1')
     A N25                                  OVRDTA
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0131R#95
     A          R #RCDDTL1                  TEXT('Details')
     A*/COPY WNCPYSRC,SD0131R#94
     A                                      SETOF(98 'Force input format')
     A                                      BLINK OVERLAY
     A                                      INDTXT(86 'Enable PUTOVR')
     A  86                                  PUTOVR
     A                                      INDTXT(89 '''ADD'' mode')
     A                                      INDTXT(88 'Protect key fields')
     A                                      INDTXT(87 'Enable key screen')
     A* Command keys............................................................
     A                                      VLDCMDKEY(29 'Valid command key')
     A                                      CA03(03 'Exit.')
     A  87                                  CA12(12 'Key screen.')
     A N89                                  CF10(10 'Delete.')
     A* SETOFFS.................................................................
     A                                      SETOF(99 'Global error flag')
     A                                      SETOF(31 'Invalid: #1RTNM')
     A                                      SETOF(32 'Invalid: #1COIN')
     A                                      SETOF(33 'Invalid: #1DCIN')
     A                                      SETOF(34 'Invalid: #1RVIN')
     A                                      SETOF(35 'Invalid: #1PADI')
     A                                      SETOF(36 'Invalid: #1ACOM')
     A                                      SETOF(37 'Invalid: #1CPTC')
     A                                      SETOF(38 'Invalid: #1PFMC')
     A                                      SETOF(39 'Invalid: #1ATRA')
     A                                      SETOF(40 'Invalid: #1ASGL')
     A                                      SETOF(41 'Invalid: #1PASB')
     A                                      SETOF(42 'Invalid: #1CIND')
     A                                      SETOF(43 'Invalid: #1CLIN')
     A*.........................................................................
     A            ##USR         10      1  2TEXT('*USER')
     A N25                                  OVRDTA
     A            ##PGM         10   H      TEXT('*PROGRAM')
     A                                  1 13'SD0131R2'
     A            ##MRDT         7      1 72TEXT('Midas Run Date')
     A N25                                  OVRDTA
     A            ##JOB         10      2  2TEXT('*JOB')
     A N25                                  OVRDTA
     A                                  2 23'Retail Transaction Types Maintena-
     A                                      nce'
     A                                      DSPATR(HI)
     A            ##TME          6  0   2 71TEXT('*TIME')
     A                                      EDTWRD('  :  :  ')
     A N25                                  OVRDTA
     A            #1LCD          5  0H      TEXT('Last Change Date')
     A            #1TYLC         1   H      TEXT('Type of Last Change')
     A                                  5  2'Retail Transaction Type.......:'
     A            #1RTTY         5      5 34TEXT('Retail Transaction Type')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                  6  2'Retail Transaction Name.......:'
     A            #1RTNM        30   B  6 34TEXT('Retail Transaction Name')
     A                                      CHECK(LC)
     A N25                                  OVRDTA
     A  31                                  DSPATR(RI PC)
     A N31                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                  7  2'Customer Originated Ind.......:'
     A            #1COIN         1   B  7 34TEXT('Customer Originated Ind.')
     A* Condition: Valid Values
     A                                      VALUES('N' +
     A                                             'Y' '?')
     A                                      DSPATR(MDT)
     A                                      CHECK(AB)
     A N25                                  OVRDTA
     A  32                                  DSPATR(RI PC)
     A N32                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                  8  2'Debit/Credit Indicator........:'
     A            #1DCIN         1   B  8 34TEXT('Debit/Credit Indicator')
     A* Condition: *ALL values
     A                                      VALUES(' ' +
     A                                             'C' +
     A                                             'D' '?')
     A                                      DSPATR(MDT)
     A                                      CHECK(AB)
     A N25                                  OVRDTA
     A  33                                  DSPATR(RI PC)
     A N33                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                  9  2'Reversal Indicator............:'
     A            #1RVIN         1   B  9 34TEXT('Reversal Indicator')
     A* Condition: *ALL values
     A                                      VALUES('Y' +
     A                                             'N' '?')
     A                                      DSPATR(MDT)
     A                                      CHECK(AB)
     A N25                                  OVRDTA
     A  34                                  DSPATR(RI PC)
     A N34                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 10  2'Print Advices Indicator.......:'
     A            #1PADI         1   B 10 34TEXT('Print Advices Indicator')
     A* Condition: Valid Values
     A                                      VALUES('N' +
     A                                             'Y' '?')
     A                                      DSPATR(MDT)
     A                                      CHECK(AB)
     A N25                                  OVRDTA
     A  35                                  DSPATR(RI PC)
     A N35                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 11  2'Account Commission Ind........:'
     A  79                                  DSPATR(ND)
     A N25                                  OVRATR
     A            #1ACOM         1   B 11 34TEXT('Account Commission Ind')
     A N25                                  OVRDTA
     A  79                                  DSPATR(PR)
     A  36                                  DSPATR(RI PC)
     A  79N36                               DSPATR(ND)
     A N79N36                               DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 12  2'Change to Portfolio Capital...:'
     A  78                                  DSPATR(ND)
     A N25                                  OVRATR
     A            #1CPTC         1   B 12 34TEXT('Change to P/folio Capital')
     A N25                                  OVRDTA
     A  78                                  DSPATR(PR)
     A  37                                  DSPATR(RI PC)
     A  78N37                               DSPATR(ND)
     A N78N37                               DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 13  2'Performance Event Type........:'
     A  78                                  DSPATR(ND)
     A N25                                  OVRATR
     A            #1PFMC         2   B 13 34TEXT('Performance Event Type')
     A N25                                  OVRDTA
     A  78                                  DSPATR(PR)
     A  38                                  DSPATR(RI PC)
     A  78N38                               DSPATR(ND)
     A N78N38                               DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 14  2'Applies to Retail Account.....:'
     A  78                                  DSPATR(ND)
     A N25                                  OVRATR
     A            #1ATRA         1   B 14 34TEXT('Applies to Retail Account')
     A N25                                  OVRDTA
     A  78                                  DSPATR(PR)
     A  39                                  DSPATR(RI PC)
     A  78N39                               DSPATR(ND)
     A N78N39                               DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 15  2'Associated GL Account Number..:'
     A  77                                  DSPATR(ND)
     A N25                                  OVRATR
     A**Start of change CGL029
     A**********  #1ASGL         4   B 15 34TEXT('Associated GL Number')                      CGL029
     A            #1ASGL        10   B 15 34TEXT('Associated GL Number')
     A**End of change CGL029
     A N25                                  OVRDTA
     A  77                                  DSPATR(PR)
     A  40                                  DSPATR(RI PC)
     A  77N40                               DSPATR(ND)
     A N77N40                               DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 16  2'Passbook Transaction Type.....:'
     A  76                                  DSPATR(ND)
     A N25                                  OVRATR
     A            #1PASB         2   B 16 34TEXT('Passbook Transaction Type')
     A N25                                  OVRDTA
     A  76                                  DSPATR(PR)
     A  41                                  DSPATR(RI PC)
     A  76N41                               DSPATR(ND)
     A N76N41                               DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 17  2'Cash Indicator................:'
     A  77                                  DSPATR(ND)
     A N25                                  OVRATR
     A            #1CIND         1   B 17 34TEXT('Cash Indicator')
     A N25                                  OVRDTA
     A  77                                  DSPATR(PR)
     A  42                                  DSPATR(RI PC)
     A  77N42                               DSPATR(ND)
     A N77N42                               DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 18  2'Clearing Indicator............:'
     A  77                                  DSPATR(ND)
     A N25                                  OVRATR
     A            #1CLIN         1   B 18 34TEXT('Clearing Indicator')
     A                                      CHECK(FE)
     A N25                                  OVRDTA
     A  77                                  DSPATR(PR)
     A  43                                  DSPATR(RI PC)
     A  77N43                               DSPATR(ND)
     A N77N43                               DSPATR(UL HI)
     A N25                                  OVRATR
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0131R#93
     A          R #CMDTXT2                  TEXT('Command keys')
     A*/COPY WNCPYSRC,SD0131R#92
     A                                      OVERLAY PUTOVR
     A            ##CTX1        78     23  2TEXT('Command Text 1')
     A N25                                  OVRDTA
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0131R#91
     A          R #MSGRCD                   TEXT('Program messages')
     A*/COPY WNCPYSRC,SD0131R#90
     A                                      SFL SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            ##PGM                     SFLPGMQ
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0131R#89
     A          R #MSGCTL                   TEXT('Program messages')
     A*/COPY WNCPYSRC,SD0131R#88
     A                                      SFLCTL(#MSGRCD)
     A                                      SFLPAG(01) SFLSIZ(03)
     A  86                                  OVERLAY PUTOVR
     A                                      SFLINZ SFLDSP SFLDSPCTL
     A  25
     AON25                                  SFLEND
     A            ##PGM                     SFLPGMQ
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0131R#87
