      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas SD Futures and options client maint')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  DSPF/SD0331R# - Edit Futures and Options Clients             *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CSD003             Date 02Jan98               *
      *                 098560             Date 09Jul96               *
      *                 066562             DATE 09FEB94               *
      *                 S01459             DATE 09FEB94               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  098560 - Addition of standard /COPYs.                        *
      *  066562 - Field BLRSS renamed to BLRSST on SDTRADPD.          *
      *           Regenerate and recompile file.                      *
      *  S01459 - Addition of Midas headerbox.                        *
      *                                                               *
      *****************************************************************
     A                                      INDARA
     A                                      PRINT(MPRINT)
     A                                      CHGINPDFT
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0331R#99
     A          R #RCDKEY                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*/COPY WNCPYSRC,SD0331R#98
     A                                      SETOF(98 'Force input format')
     A                                      BLINK OVERLAY
     A                                      INDTXT(86 'Enable PUTOVR')
     A  86                                  PUTOVR
     A                                      INDTXT(89 '89')
     A* Command keys............................................................
     A                                      VLDCMDKEY(29 'Valid command key')
     A                                      CA03(03 'Exit.')
     A                                      CF09(09 'Change mode.')
     A* SETOFFS.................................................................
     A                                      SETOF(99 'Global error flag')
     A                                      SETOF(31 'Invalid: #1CUST')
     A*.........................................................................
     A            ##USR         10      1  2TEXT('*USER')
     A N25                                  OVRDTA
     A            ##PGM         10   H      TEXT('*PROGRAM')
     A                                  1 13'SD0331R1'
     A            ##MRDT         7      1 72TEXT('Midas Run Date')
     A N25                                  OVRDTA
     A            ##JOB         10      2  2TEXT('*JOB')
     A N25                                  OVRDTA
     A                                  2 24'Customer Details-Futures & Options'
     A                                      DSPATR(HI)
     A            ##TME          6  0   2 71TEXT('*TIME')
     A                                      EDTWRD('  :  :  ')
     A N25                                  OVRDTA
     A                                  4  2'Customer Number:'
     A            #1CUST         6   B  4 19TEXT('Customer Number')
     A                                      CHECK(FE)
     A N25                                  OVRDTA
     A  31                                  DSPATR(RI PC)
     A N31                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0331R#97
     A          R #CMDTXT1                  TEXT('Command keys')
     A*/COPY WNCPYSRC,SD0331R#96
     A                                      OVERLAY PUTOVR
     A            ##CTX1        78     23  2TEXT('Command Text 1')
     A N25                                  OVRDTA
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0331R#95
     A          R #RCDDTL1                  TEXT('Details')
     A*/COPY WNCPYSRC,SD0331R#94
     A                                      SETOF(98 'Force input format')
     A                                      BLINK OVERLAY
     A                                      INDTXT(86 'Enable PUTOVR')
     A  86                                  PUTOVR
     A                                      INDTXT(89 '''ADD'' mode')
     A                                      INDTXT(88 'Protect key fields')
     A                                      INDTXT(87 'Enable key screen')
     A* Command keys............................................................
     A                                      VLDCMDKEY(29 'Valid command key')
     A                                      CA03(03 'Exit.')
     A  87                                  CA12(12 'Key screen.')
     A N89                                  CF10(10 'Delete.')
     A* SETOFFS.................................................................
     A                                      SETOF(99 'Global error flag')
     A                                      SETOF(31 'Invalid: #1BKIN')
     A                                      SETOF(32 'Invalid: #1SMAC')
     A                                      SETOF(33 'Invalid: #1STTY')
     A                                      SETOF(34 'Invalid: #1SEBR')
     A                                      SETOF(35 'Invalid: #DCNFF')
     A                                      SETOF(36 'Invalid: #1FACO')
     A                                      SETOF(37 'Invalid: #1COAD')
     A                                      SETOF(38 'Invalid: #1FTAO')
     A                                      SETOF(39 'Invalid: #1TXCI')
     A                                      SETOF(40 'Invalid: #DCLSC')
     A                                      SETOF(41 'Invalid: #1PCIN')
     A                                      SETOF(42 'Invalid: #1ACIN')
     A                                      SETOF(43 'Invalid: #1CYCD')
     A                                      SETOF(44 'Invalid: #1CODE')
     A                                      SETOF(45 'Invalid: #DCAMS')
     A                                      SETOF(46 'Invalid: #1STFQ')
     A                                      SETOF(47 'Invalid: #1RVFQ')
     A                                      SETOF(48 'Invalid: #DSTBD')
     A                                      SETOF(49 'Invalid: #DRBDS')
     A                                      SETOF(50 'Invalid: #DNSDS')
     A                                      SETOF(51 'Invalid: #DNRDS')
     A*.........................................................................
     A            ##USR         10      1  2TEXT('*USER')
     A N25                                  OVRDTA
     A            ##PGM         10   H      TEXT('*PROGRAM')
     A                                  1 13'SD0331R2'
     A            ##MRDT         7      1 72TEXT('Midas Run Date')
     A N25                                  OVRDTA
     A            ##JOB         10      2  2TEXT('*JOB')
     A N25                                  OVRDTA
     A                                  2 24'Customer Details-Futures & Options'
     A                                      DSPATR(HI)
     A            ##TME          6  0   2 71TEXT('*TIME')
     A                                      EDTWRD('  :  :  ')
     A N25                                  OVRDTA
     A            #1CTLM         5  0H      TEXT('Contract Limit')
     A            #1LCD          5  0H      TEXT('Last Change Date')
     A            #1TYLC         1   H      TEXT('Type of Last Change')
     A            #1COAM        13  0H      TEXT('Collateral Amount')
     A            #1DMFS         2  0H      TEXT('Day in month for statemen')
     A            #1RVBD         2  0H      TEXT('Revaluation Base Day')
     A            #DFDT1         7   H      TEXT('Function Date 1')
     A            #DFNSD         6  0H      TEXT('FO next statement date')
     A            #DFDT2         7   H      TEXT('Function Date 2')
     A            #DFNRD         6  0H      TEXT('FO next revaluation date')
     A            #1NSDT         5  0H      TEXT('Next statement date')
     A            #1NRDT         5  0H      TEXT('Next revaluation date')
     A            #1CPNO         8   H      TEXT('Counterparty Nostro')
     A                                  4  7'Customer.:'
     A            #1CUST         6      4 18TEXT('Customer Number')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DCSST        10      4 27TEXT('Customer shortname ST')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DRNFF        20      4 40TEXT('Report Name FF')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            #DRTFF        10      4 63TEXT('Report Town FF')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                  6  2'Broker Y/N............:'
     A            #1BKIN         1   B  6 26TEXT('Broker Indicator')
     A N25                                  OVRDTA
     A  79                                  DSPATR(PR)
     A  31                                  DSPATR(RI PC)
     A N79N31                               DSPATR(UL)
     A N31                                  DSPATR(HI)
     A N25                                  OVRATR
     A                                  6 37'Settlement Account..:'
     A**Start of change CGL029
     A**********  #1SMAC        12   B  6 59TEXT('Settlement Account')                        CGL029
     A            #1SMAC        18   B  6 59TEXT('Settlement Account')
     A**End of change CGL029
     A                                      CHECK(LC)
     A N25                                  OVRDTA
     A  32                                  DSPATR(RI PC)
     A N32                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                  7  2'Settlement Type.......:'
     A            #1STTY         2   B  7 26TEXT('Settlement Type')
     A N25                                  OVRDTA
     A  33                                  DSPATR(RI PC)
     A N33                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                  7 37'Settlement Branch...:'
     A  78                                  DSPATR(ND)
     A N25                                  OVRATR
     A            #1SEBR         3   B  7 59TEXT('Settlement Branch')
     A N25                                  OVRDTA
     A  78                                  DSPATR(PR)
     A  34                                  DSPATR(RI PC)
     A  78N34                               DSPATR(ND)
     A N78N34                               DSPATR(UL HI)
     A N25                                  OVRATR
     A                                  8  2'Counterparty Nostro...:'
     A            #DCNFF        10   B  8 26TEXT('C/P Nostro Function field')
     A N25                                  OVRDTA
     A  35                                  DSPATR(RI PC)
     A N35                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                  8 37'For Account of......:'
     A            #1FACO        10   B  8 59TEXT('For Account of')
     A N25                                  OVRDTA
     A  36                                  DSPATR(RI PC)
     A N36                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                  9  2'Correspondence Address:'
     A            #1COAD         1   B  9 26TEXT('Correspondence Address')
     A N25                                  OVRDTA
     A  37                                  DSPATR(RI PC)
     A N37                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                  9 37'For the Attention of:'
     A            #1FTAO        20   B  9 59TEXT('For the Attention of')
     A                                      CHECK(LC)
     A N25                                  OVRDTA
     A  38                                  DSPATR(RI PC)
     A N38                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 11  2'Telex/Confirmation....:'
     A            #1TXCI         1   B 11 26TEXT('Telex Confirmation Ind.')
     A N25                                  OVRDTA
     A  39                                  DSPATR(RI PC)
     A N39                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 11 37'Contract Limit.......:'
     A            #DCLSC         5   B 11 60TEXT('Contract Limit Screen')
     A N25                                  OVRDTA
     A  40                                  DSPATR(RI PC)
     A N40                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 12  2'Positions combined....:'
     A            #1PCIN         1   B 12 26TEXT('Positions combined ind')
     A N25                                  OVRDTA
     A  41                                  DSPATR(RI PC)
     A N41                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 12 37'Automatic Closure....:'
     A            #1ACIN         1   B 12 60TEXT('Automatic Closure ind')
     A N25                                  OVRDTA
     A  42                                  DSPATR(RI PC)
     A N42                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 14  2'Collateral Currency...:'
     A            #1CYCD         3   B 14 26TEXT('Currency Code')
     A N25                                  OVRDTA
     A  43                                  DSPATR(RI PC)
     A N43                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 14 37'Collateral Description'
     A            #1CODE        20   B 14 60TEXT('Collateral Description')
     A                                      CHECK(LC)
     A N25                                  OVRDTA
     A  44                                  DSPATR(RI PC)
     A N44                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 15  2'Collateral Amount.....:'
     A            #DCAMS        13   B 15 26TEXT('Collateral Amount Screen')
     A N25                                  OVRDTA
     A  45                                  DSPATR(RI PC)
     A N45                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 17 24'STATEMENT'
     A                                 17 45'REVALUATION'
     A                                 18  2'Frequency'
     A            #1STFQ         1   B 18 27TEXT('Statement frequency')
     A N25                                  OVRDTA
     A  46                                  DSPATR(RI PC)
     A N46                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #1RVFQ         1   B 18 49TEXT('Revaluation Frequency')
     A N25                                  OVRDTA
     A  47                                  DSPATR(RI PC)
     A N47                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 19  2'Base Day'
     A            #DSTBD         2   B 19 27TEXT('Statement Base Day Screen')
     A N25                                  OVRDTA
     A  48                                  DSPATR(RI PC)
     A N48                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DRBDS         2   B 19 49TEXT('Revaluation Base Day Scrn')
     A N25                                  OVRDTA
     A  49                                  DSPATR(RI PC)
     A N49                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 20  2'Next Date'
     A            #DNSDS         6   B 20 27TEXT('Next Stmnt Date Screen')
     A N25                                  OVRDTA
     A  50                                  DSPATR(RI PC)
     A N50                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A            #DNRDS         6   B 20 49TEXT('Next Reval Date Screen')
     A                                      CHECK(FE)
     A N25                                  OVRDTA
     A  51                                  DSPATR(RI PC)
     A N51                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0331R#93
     A          R #CMDTXT2                  TEXT('Command keys')
     A*/COPY WNCPYSRC,SD0331R#92
     A                                      OVERLAY PUTOVR
     A            ##CTX1        78     23  2TEXT('Command Text 1')
     A N25                                  OVRDTA
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0331R#91
     A          R #MSGRCD                   TEXT('Program messages')
     A*/COPY WNCPYSRC,SD0331R#90
     A                                      SFL SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            ##PGM                     SFLPGMQ
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0331R#89
     A          R #MSGCTL                   TEXT('Program messages')
     A*/COPY WNCPYSRC,SD0331R#88
     A                                      SFLCTL(#MSGRCD)
     A                                      SFLPAG(01) SFLSIZ(03)
     A  86                                  OVERLAY PUTOVR
     A                                      SFLINZ SFLDSP SFLDSPCTL
     A  25
     AON25                                  SFLEND
     A            ##PGM                     SFLPGMQ
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0331R#87
