      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas SD Profit centre default maintenance')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  DSPF/SD0491V# - Midas SD Profit Centre Default Maintenance   *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      *  Last Amend No. CSD009             Date 10Oct00               *
      * Midas DBA 3.03 -----------------------------------------------*
      *  Prev Amend No. CSD003             Date 01Jul99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CPM004             Date 27Feb96               *
      *                 S01459             DATE 13APR95               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD009 - Profit Centre Accounting Default Matrix Enhancement *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  CPM004 - PM Bank Portfolios.                                 *
      *           SDBOOKL1 amended - regenerate & recompile.          *
      *  S01459 - Addition of Midas headerbox.                        *
      *                                                               *
      *****************************************************************
     A                                      INDARA
     A                                      PRINT(MPRINT)
     A                                      CHGINPDFT
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0491V#99
     A          R #RCDDTL1                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*/COPY WNCPYSRC,SD0491V#98
     A                                      SETOF(98 'Force input format')
     A                                      BLINK OVERLAY
     A                                      INDTXT(86 'Enable PUTOVR')
     A  86                                  PUTOVR
     A* COMMAND KEYS............................................................
     A                                      VLDCMDKEY(29 'Valid command key')
     A                                      CA03(03 'Exit.')
     A                                      CF05(05 'Reset.')
     A                                      CF10(10 'Delete.')
     A                                      CF12(12 'CF12.')
     A* SETOFFS.................................................................
     A                                      SETOF(99 'Global error flag')
     A                                      SETOF(31 'Invalid: #DPPM1')
     A                                      SETOF(32 'Invalid: #DPPM2')
     A                                      SETOF(33 'Invalid: #DPPM3')
     A                                      SETOF(34 'Invalid: #DPPM4')
     A                                      SETOF(35 'Invalid: #DPPM5')
     A                                      SETOF(36 'Invalid: #DPPM6')
     A                                      SETOF(37 'Invalid: #DPPM7')
     A                                      SETOF(38 'Invalid: #DPPM8')
     A                                      SETOF(39 'Invalid: #1PCCD')
     A*.........................................................................
     A            ##USR         10      1  2TEXT('*USER')
     A N25                                  OVRDTA
     A            ##PGM         10   H      TEXT('*PROGRAM')
     A                                  1 13'SD0491V1'
     A            ##MRDT         7      1 72TEXT('Midas Run Date')
     A N25                                  OVRDTA
     A            ##JOB         10      2  2TEXT('*JOB')
     A N25                                  OVRDTA
     A            ##URPT        53      2 13TEXT('User Report Title')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            ##TME          6  0   2 71TEXT('*TIME')
     A                                      EDTWRD('  :  :  ')
     A N25                                  OVRDTA
     A            #1BKCD         2   H      TEXT('Book Code')
     A            #1PCTT         5   H      TEXT('Profit Centre Trans Type')
     A            #1SBTY         2   H      TEXT('Sub Type')
     A            #1BRCD         3   H      TEXT('Branch code')
     A            #1DPCD         3   H      TEXT('Dept Code')
     A            #1USID        10   H      TEXT('User')
     A            #1ACOC         2   H      TEXT('Account Officer Code')
     A            #1CUST         6   H      TEXT('Customer Number')
     A            #1LCD          5  0H      TEXT('Last Change Date')
     A            #1TYLC         1   H      TEXT('Type of Last Change')
     A**Start of change CSD009
     A            #1LICD         3   H      TEXT('Local Ind code')
     A            #1BNBI         1   H      TEXT('Bank/Non-Bank Info')
     A            #1CLOC         2   H      TEXT('Ctry of Domicile')
     A            #1RLOC         2   H      TEXT('Region of Domicile')
     A            #1CNCZ         2   H      TEXT('Ctry of Citizenship')
     A            #1RNCZ         2   H      TEXT('Region of Citizenship')
     A            #1CSTY         1   H      TEXT('Customer type')
     A            #1GPC1         4   H      TEXT('Group code 1')
     A            #1GPC2         4   H      TEXT('Group code 2')
     A            #1GPC3         4   H      TEXT('Group code 3')
     A            #1GPC4         4   H      TEXT('Group code 4')
     A            #1GPC5         4   H      TEXT('Group code 5')
     A**End of change CSD009
     A                                  6 10'Priority          Base Field Name-
     A                                            Value'
     A                                  8 13'1'
     A            #DPPT1        20      8 26TEXT('Pty Def Prof Mat Text 1')
     A N25                                  OVRDTA
     A            #DPPM1        10   B  8 47TEXT('Priority Def Prof Mat 1')
     A N25                                  OVRDTA
     A  31                                  DSPATR(RI PC)
     A N31                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                  9 13'2'
     A            #DPPT2        20      9 26TEXT('Pty Def Prof Mat Text 2')
     A N25                                  OVRDTA
     A            #DPPM2        10   B  9 47TEXT('Priority Def Prof Mat 2')
     A N25                                  OVRDTA
     A  79                                  DSPATR(PR)
     A  32                                  DSPATR(RI PC)
     A  79N32                               DSPATR(ND)
     A N79N32                               DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 10 13'3'
     A            #DPPT3        20     10 26TEXT('Pty Def Prof Mat Text 3')
     A N25                                  OVRDTA
     A            #DPPM3        10   B 10 47TEXT('Priority Def Prof Mat 3')
     A N25                                  OVRDTA
     A  78                                  DSPATR(PR)
     A  33                                  DSPATR(RI PC)
     A  78N33                               DSPATR(ND)
     A N78N33                               DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 11 13'4'
     A            #DPPT4        20     11 26TEXT('Pty Def Prof Mat Text 4')
     A N25                                  OVRDTA
     A            #DPPM4        10   B 11 47TEXT('Priority Def Prof Mat 4')
     A N25                                  OVRDTA
     A  77                                  DSPATR(PR)
     A  34                                  DSPATR(RI PC)
     A  77N34                               DSPATR(ND)
     A N77N34                               DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 12 13'5'
     A            #DPPT5        20     12 26TEXT('Pty Def Prof Mat Text 5')
     A N25                                  OVRDTA
     A            #DPPM5        10   B 12 47TEXT('Priority Def Prof Mat 5')
     A N25                                  OVRDTA
     A  76                                  DSPATR(PR)
     A  35                                  DSPATR(RI PC)
     A  76N35                               DSPATR(ND)
     A N76N35                               DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 13 13'6'
     A            #DPPT6        20     13 26TEXT('Pty Def Prof Mat Text 6')
     A N25                                  OVRDTA
     A            #DPPM6        10   B 13 47TEXT('Priority Def Prof Mat 6')
     A N25                                  OVRDTA
     A  75                                  DSPATR(PR)
     A  36                                  DSPATR(RI PC)
     A  75N36                               DSPATR(ND)
     A N75N36                               DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 14 13'7'
     A            #DPPT7        20     14 26TEXT('Pty Def Prof Mat Text 7')
     A N25                                  OVRDTA
     A            #DPPM7        10   B 14 47TEXT('Priority Def Prof Mat 7')
     A N25                                  OVRDTA
     A  74                                  DSPATR(PR)
     A  37                                  DSPATR(RI PC)
     A  74N37                               DSPATR(ND)
     A N74N37                               DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 15 13'8'
     A            #DPPT8        20     15 26TEXT('Pty Def Prof Mat Text 8')
     A N25                                  OVRDTA
     A            #DPPM8        10   B 15 47TEXT('Priority Def Prof Mat 8')
     A N25                                  OVRDTA
     A  73                                  DSPATR(PR)
     A  38                                  DSPATR(RI PC)
     A  73N38                               DSPATR(ND)
     A N73N38                               DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 17 15'Related default profit centre.:'
     A            #1PCCD         4   B 17 47TEXT('Profit Centre Code')
     A                                      CHECK(FE)
     A N25                                  OVRDTA
     A  39                                  DSPATR(RI PC)
     A N39                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0491V#97
     A          R #CMDTXT1                  TEXT('Command keys')
     A*/COPY WNCPYSRC,SD0491V#96
     A                                      OVERLAY PUTOVR
     A            ##CTX1        78     23  2TEXT('Command Text 1')
     A N25                                  OVRDTA
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0491V#95
     A          R #MSGRCD                   TEXT('Program messages')
     A*/COPY WNCPYSRC,SD0491V#94
     A                                      SFL SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            ##PGM                     SFLPGMQ
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0491V#93
     A          R #MSGCTL                   TEXT('Program messages')
     A*/COPY WNCPYSRC,SD0491V#92
     A                                      SFLCTL(#MSGRCD)
     A                                      SFLPAG(01) SFLSIZ(03)
     A  86                                  OVERLAY PUTOVR
     A                                      SFLINZ SFLDSP SFLDSPCTL
     A  25
     AON25                                  SFLEND
     A            ##PGM                     SFLPGMQ
     A*=========================================================================
     A*/COPY WNCPYSRC,SD0491V#91
