      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas SD Exposure management ICD enquiry')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  DSPF/SD9131E# - Midas SD Exposure Management ICD Enquiry     *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      *  Last Amend No. CSD003             Date 01JUL99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CTI002             Date 17SEP98               *
      *                 CDL002             Date 17JAN97               *
      *                 S01459             Date 17JAN97               *
      *                 S01342             Date 09AUG91               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  CTI002 - Display a new business area :                       *
      *           - Trade Finance                                     *
      *  CDL002 - FX Netting: addition of field 'Net FX Exposure'.    *
      *  S01459 - Addition of Midas headerbox.                        *
      *  S01342 - Release 10 SD help incorporation.                   *
      *                                                               *
      *****************************************************************
     A                                      INDARA
     A                                      PRINT(MPRINT)
     A                                      CHGINPDFT
     A*=========================================================================
     A*/COPY WNCPYSRC,SD9131E#99
     A          R #RCDKEY                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*/COPY WNCPYSRC,SD9131E#98
     A                                      SETOF(98 'Force input format')
     A                                      BLINK OVERLAY
     A                                      INDTXT(86 'Enable PUTOVR')
     A  86                                  PUTOVR
     A* Command keys............................................................
     A                                      VLDCMDKEY(29 'Valid command key')
     A                                      CA03(03 'Exit.')
     A* SETOFFS.................................................................
     A                                      SETOF(99 'Global error flag')
     A*.........................................................................
     A            ##USR         10      1  2TEXT('*USER')
     A N25                                  OVRDTA
     A            ##PGM         10   H      TEXT('*PROGRAM')
     A                                  1 13'SD9131E1'
     A            ##MRDT         7      1 72TEXT('Midas Run Date')
     A N25                                  OVRDTA
     A            ##JOB         10      2  2TEXT('*JOB')
     A N25                                  OVRDTA
     A                                  2 25'DISPLAY EXPOSURE MGMT KEY SCREEN'
     A                                      DSPATR(HI)
     A            ##TME          6  0   2 71TEXT('*TIME')
     A                                      EDTWRD('  :  :  ')
     A N25                                  OVRDTA
     A            #1EXMK        10   H      TEXT('Exposure Management key')
     A*=========================================================================
     A*/COPY WNCPYSRC,SD9131E#97
     A          R #CMDTXT1                  TEXT('Command keys')
     A*/COPY WNCPYSRC,SD9131E#96
     A                                      OVERLAY PUTOVR
     A                                 23  2'CMD: 1-Exit, 9-Change mode.'
     A*=========================================================================
     A*/COPY WNCPYSRC,SD9131E#95
     A          R #RCDDTL1                  TEXT('Details')
     A*/COPY WNCPYSRC,SD9131E#94
     A                                      SETOF(98 'Force input format')
     A                                      BLINK OVERLAY
     A                                      INDTXT(86 'Enable PUTOVR')
     A  86                                  PUTOVR
     A                                      INDTXT(88 'Protect key fields')
     A                                      INDTXT(87 'Enable key screen')
     A* Command keys............................................................
     A                                      VLDCMDKEY(29 'Valid command key')
     A                                      CA03(03 'Exit.')
     A  87                                  CA12(12 'Key screen.')
     A* SETOFFS.................................................................
     A                                      SETOF(99 'Global error flag')
     A*.........................................................................
     A            ##USR         10      1  2TEXT('*USER')
     A N25                                  OVRDTA
     A            ##PGM         10   H      TEXT('*PROGRAM')
     A                                  1 13'SD9131E2'
     A            ##MRDT         7      1 72TEXT('Midas Run Date')
     A N25                                  OVRDTA
     A            ##JOB         10      2  2TEXT('*JOB')
     A N25                                  OVRDTA
     A                                  2 28'Exposure Management Enquiry'
     A                                      DSPATR(HI)
     A            ##TME          6  0   2 71TEXT('*TIME')
     A                                      EDTWRD('  :  :  ')
     A N25                                  OVRDTA
     A            #1EXMK        10   H      TEXT('Exposure Management key')
     A            #1LCD          5  0H      TEXT('Last Change Date')
     A            #1TYLC         1   H      TEXT('Type of Last Change')
     A                                  4  2'Limit Currency Code......:'
     A            #1CYCD         3      4 29TEXT('Currency Code')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                  5  2'Update Wait Time.........:'
     A            #1UPWT         6  0   5 29TEXT('Update Wait Time')
     A                                      EDTWRD('  :  :  ')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                  7  2'Module Sequences:'
     A                                  8  4'Foreign Exchange.......:'
     A            #1MSFX         2  0   8 29TEXT('Mod. Seq. for FX')
     A                                      EDTCDE(4)
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                  8 41'Securities Trading C/party..:'
     A            #1MSSC         2  0   8 71TEXT('Mod. Seq. for ST C')
     A                                      EDTCDE(4)
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                  9  4'Money Market...........:'
     A            #1MSMM         2  0   9 29TEXT('Mod. Seq. for MM')
     A                                      EDTCDE(4)
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                  9 41'Securities Trading Issuer...:'
     A            #1MSSI         2  0   9 71TEXT('Mod. Seq. for ST I')
     A                                      EDTCDE(4)
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 10  4'Loans..................:'
     A            #1MSLN         2  0  10 29TEXT('Mod. Seq. for Loans')
     A                                      EDTCDE(4)
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 10 41'Securities Trading Portfolio:'
     A            #1MSSP         2  0  10 71TEXT('Mod. Seq. for ST P')
     A                                      EDTCDE(4)
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 11  4'Retail.................:'
     A            #1MSRT         2  0  11 29TEXT('Mod. Seq. for Retail')
     A                                      EDTCDE(4)
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 11 41'Futures.....................:'
     A            #1MSFU         2  0  11 71TEXT('Mod. Seq. for Futures')
     A                                      EDTCDE(4)
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 12  4'Forward Rate Agreements:'
     A            #1MSFR         2  0  12 29TEXT('Mod. Seq. for FRA')
     A                                      EDTCDE(4)
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 12 41'Options.....................:'
     A            #1MSOP         2  0  12 71TEXT('Mod. seq. for Options')
     A                                      EDTCDE(4)
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 13  4'Interest Rate Swaps....:'
     A            #1MSIR         2  0  13 29TEXT('Mod. Seq. for IRS')
     A                                      EDTCDE(4)
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A* CTI002 START
     A                                 13 41'Trade Finance...............:'
     A  76                                  DSPATR(ND)
     A N25                                  OVRATR
     A            #1MSTF         2  0  13 71TEXT('Mod. seq. for Trade Finance')
     A                                      EDTCDE(4)
     A N25                                  OVRDTA
     A  76                                  DSPATR(ND)
     A N76                                  DSPATR(HI)
     A N25                                  OVRATR
     A* CTI002 END
     A                                 14  2'Securities Trading:-'
     A                                 15  4'Issuer Risk Factored.........:'
     A            #1IRFD         1     15 35TEXT('Issuer Risk Factored')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 15 41'Portfolio to include FX.....:'
     A            #1PIFX         1     15 71TEXT('Portfolio to include FX')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 16  4'Portfolio Holdings Factored..:'
     A            #1PHFD         1     16 35TEXT('Portfolio Holdings Fact''d')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 16 41'Counterparty Taken Gross....:'
     A            #1CPTG         1     16 71TEXT('Counterparty Taken Gross')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 17  4'Long/Short Holdings Net/Gross:'
     A            #1LSHN         1     17 35TEXT('Long/Short Holdings Net/G')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 17 41'Allow for Pay Code..........:'
     A            #1APCD         1     17 71TEXT('Allow for Pay Code')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 19  2'Include Caps/Collars/Floors in Sw-
     A                                      ap or Option exposure:'
     A  79                                  DSPATR(ND)
     A N25                                  OVRATR
     A            #1CCSO         1     19 58TEXT('Caps/clrs/flrs in SW/OP')
     A N25                                  OVRDTA
     A  79                                  DSPATR(ND)
     A N79                                  DSPATR(HI)
     A N25                                  OVRATR
     A                                 20  2'Futures and Options positions to -
     A                                      be taken Net or Gross:'
     A  78                                  DSPATR(ND)
     A N25                                  OVRATR
     A            #1FONG         1     20 58TEXT('FO positions Net or Gross')
     A N25                                  OVRDTA
     A  78                                  DSPATR(ND)
     A N78                                  DSPATR(HI)
     A N25                                  OVRATR
     A                                 21  4'Net FX Exposure..............:'
     A  77                                  DSPATR(ND)
     A N25                                  OVRATR
     A            #1NTEM         1     21 35TEXT('Net FX Exposure')
     A N25                                  OVRDTA
     A  77                                  DSPATR(ND)
     A N77                                  DSPATR(HI)
     A N25                                  OVRATR
     A*=========================================================================
     A*/COPY WNCPYSRC,SD9131E#93
     A          R #CMDTXT2                  TEXT('Command keys')
     A*/COPY WNCPYSRC,SD9131E#92
     A                                      OVERLAY PUTOVR
     A                                 23  2'F3=Exit'
     A*=========================================================================
     A*/COPY WNCPYSRC,SD9131E#91
     A          R #MSGRCD                   TEXT('Program messages')
     A*/COPY WNCPYSRC,SD9131E#90
     A                                      SFL SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            ##PGM                     SFLPGMQ
     A*=========================================================================
     A*/COPY WNCPYSRC,SD9131E#89
     A          R #MSGCTL                   TEXT('Program messages')
     A*/COPY WNCPYSRC,SD9131E#88
     A                                      SFLCTL(#MSGRCD)
     A                                      SFLPAG(01) SFLSIZ(03)
     A  86                                  OVERLAY PUTOVR
     A                                      SFLINZ SFLDSP SFLDSPCTL
     A  25
     AON25                                  SFLEND
     A            ##PGM                     SFLPGMQ
     A*=========================================================================
     A*/COPY WNCPYSRC,SD9131E#87
