      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas SD Edit general ledger ICD data 2')              *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  DSPF/SD9172R# - Maintain General Ledger ICD - Screen 2.      *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. 257128             Date 26Nov12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      *                 CSD009             Date 10Oct00               *
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CGL010             Date 08Nov99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CSD003             Date 27Oct97               *
      *                 072628             DATE 30AUG94               *
      *                 S01459             DATE 30AUG94               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  257128 - Functional keys to be the same in all ICD menu items*
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CSD009 - Profit Centre Accounting Default Matrix Enhancement *
      *  CGL010 - Future Value Dated Journal Entries for              *
      *           Non-Retail Accounts                                 *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  072628 - Regenerate over Germany development file change.    *
      *  S01459 - Addition of Midas headerbox.                        *
      *                                                               *
      *****************************************************************
     A                                      INDARA
     A                                      PRINT(MPRINT)
     A                                      CHGINPDFT
     A*=========================================================================
     A*/COPY WNCPYSRC,SD9172R#99
     A          R #RCDKEY                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*/COPY WNCPYSRC,SD9172R#98
     A                                      SETOF(98 'Force input format')
     A                                      BLINK OVERLAY
     A                                      INDTXT(86 'Enable PUTOVR')
     A  86                                  PUTOVR
     A* Command keys............................................................
     A                                      VLDCMDKEY(29 'Valid command key')
     A                                      CA03(03 'Exit.')
     A* SETOFFS.................................................................
     A                                      SETOF(99 'Global error flag')
     A                                      SETOF(31 'Invalid: #PWRTC')
     A                                      SETOF(32 'Invalid: #1GNLG')
     A*.........................................................................
     A            ##USR         10      1  2TEXT('*USER')
     A N25                                  OVRDTA
     A            ##PGM         10   H      TEXT('*PROGRAM')
     A                                  1 13'SD9172R1'
     A            ##MRDT         7      1 72TEXT('Midas Run Date')
     A N25                                  OVRDTA
     A            ##JOB         10      2  2TEXT('*JOB')
     A N25                                  OVRDTA
     A                                  2 24'GENERAL LEDGER DETAILS 2 KEY SCRE-
     A                                      EN'
     A                                      DSPATR(HI)
     A            ##TME          6  0   2 71TEXT('*TIME')
     A                                      EDTWRD('  :  :  ')
     A N25                                  OVRDTA
     A                                  4  2'Work Return code:'
     A            #PWRTC         5   B  4 20TEXT('Work Return code')
     A N25                                  OVRDTA
     A  31                                  DSPATR(RI PC)
     A N31                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                  5  2'General Ledger..:'
     A            #1GNLG        10   B  5 20TEXT('General Ledger')
     A                                      CHECK(FE)
     A N25                                  OVRDTA
     A  32                                  DSPATR(RI PC)
     A N32                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A*=========================================================================
     A*/COPY WNCPYSRC,SD9172R#97
     A          R #CMDTXT1                  TEXT('Command keys')
     A*/COPY WNCPYSRC,SD9172R#96
     A                                      OVERLAY PUTOVR
     A                                 23  2'F3=Exit'
     A*=========================================================================
     A*/COPY WNCPYSRC,SD9172R#95
     A          R #RCDDTL1                  TEXT('Details')
     A*/COPY WNCPYSRC,SD9172R#94
     A                                      SETOF(98 'Force input format')
     A                                      BLINK OVERLAY
     A                                      INDTXT(86 'Enable PUTOVR')
     A  86                                  PUTOVR
     A                                      INDTXT(88 'Protect key fields')
     A                                      INDTXT(87 'Enable key screen')
     A* Command keys............................................................
     A                                      VLDCMDKEY(29 'Valid command key')
     A                                      CA03(03 'Exit.')
     A  87                                  CA12(12 'Key screen.')
     A* SETOFFS.................................................................
     A                                      SETOF(99 'Global error flag')
     A                                      SETOF(31 'Invalid: #1JESP')
     A                                      SETOF(32 'Invalid: #1PRCU')
     A                                      SETOF(33 'Invalid: #1PRCA')
     A                                      SETOF(34 'Invalid: #1PCDU')
     A                                      SETOF(35 'Invalid: #1PMBK')
     A                                      SETOF(36 'Invalid: #1PMTT')
     A                                      SETOF(37 'Invalid: #1PMST')
     A                                      SETOF(38 'Invalid: #1PMDT')
     A                                      SETOF(39 'Invalid: #1PMUR')
     A                                      SETOF(40 'Invalid: #1PMAO')
     A                                      SETOF(41 'Invalid: #1PMCU')
     A                                      SETOF(42 'Invalid: #1PMBH')
     A                                      SETOF(43 'Invalid: #1OBRU')
     A                                      SETOF(44 'Invalid: #1OBUV')
     A                                      SETOF(45 'Invalid: #1IEBI')
     A                                      SETOF(46 'Invalid: #1IEMB')
     A                                      SETOF(47 'Invalid: #1PSET')
     A                                      SETOF(48 'Invalid: #1MABR')
     A**Start of change CSD009
     A                                      SETOF(51 'Invalid: #1LICD')
     A                                      SETOF(52 'Invalid: #1BNBI')
     A                                      SETOF(53 'Invalid: #1CLOC')
     A                                      SETOF(54 'Invalid: #1RLOC')
     A                                      SETOF(55 'Invalid: #1CNCZ')
     A                                      SETOF(56 'Invalid: #1RNCZ')
     A                                      SETOF(57 'Invalid: #1CSTY')
     A                                      SETOF(58 'Invalid: #1GPC1')
     A                                      SETOF(59 'Invalid: #1GPC2')
     A                                      SETOF(60 'Invalid: #1GPC3')
     A                                      SETOF(61 'Invalid: #1GPC4')
     A                                      SETOF(62 'Invalid: #1GPC5')
     A**End of change CSD009
     A*.........................................................................
     A            ##USR         10      1  2TEXT('*USER')
     A N25                                  OVRDTA
     A            ##PGM         10   H      TEXT('*PROGRAM')
     A                                  1 13'SD9172R2'
     A            ##MRDT         7      1 72TEXT('Midas Run Date')
     A N25                                  OVRDTA
     A            ##JOB         10      2  2TEXT('*JOB')
     A N25                                  OVRDTA
     A                                  2 28'General Ledger Maintenance'
     A                                      DSPATR(HI)
     A            ##TME          6  0   2 71TEXT('*TIME')
     A                                      EDTWRD('  :  :  ')
     A N25                                  OVRDTA
     A            #PWRTC         5   H      TEXT('Work Return code')
     A            #1GNLG        10   H      TEXT('General Ledger')
     A**Start of change CGL029
     A**********  #1ACCD         4   H      TEXT('Account Code')                              CGL029
     A**********  #1PLAC         4   H      TEXT('Profit & Loss Accnt Code')                  CGL029
     A            #1ACCD        10   H      TEXT('Account Code')
     A            #1PLAC        10   H      TEXT('Profit & Loss Accnt Code')
     A**End of change CGL029
     A            #1CUST         6   H      TEXT('Customer Number')
     A            #1LCD          5  0H      TEXT('Last Change Date')
     A            #1TYLC         1   H      TEXT('Type of Last Change')
     A            #1BCTF         1   H      TEXT('Base Currency Transfer Fq')
     A            #1AKSI         1   H      TEXT('Accrual Key Summary Ind.')
     A            #1APDT         5  0H      TEXT('Accruals/Profit Date')
     A            #1APFQ         1   H      TEXT('Accruals/Profit Frequency')
     A            #1APFD         2  0H      TEXT('Accruals/Profit Fq. Day')
     A            #1ALDI         1   H      TEXT('Accrue on Last Day Ind.')
     A            #1APRP         2  0H      TEXT('A/c Posting Retention Pd')
     A            #1ANWD         1   H      TEXT('Accrual Non-Wk Day Ind')
     A            #1SRRP         2  0H      TEXT('Spot Rates Retention Pd')
     A            #1BRRP         2  0H      TEXT('Base Rates Retention Pd')
     A            #1GLDI         1   H      TEXT('GL Description Ind')
     A            #1ELAP         5  0H      TEXT('End of Last Activity Per.')
     A            #1ECAP         5  0H      TEXT('End of Current Act Period')
     A            #1DSFC         1   H      TEXT('Default Statement Freq Cd')
     A            #1FCTF         1   H      TEXT('Foreign CCY Transfer Freq')
     A            #1FCRC         1   H      TEXT('FC Tfr to Retain Cust/Seq')
     A            #1JREP         2  0H      TEXT('Journal Retention Period')
     A            #1MHTN         1   H      TEXT('Mand Batch Tot/No of Item')
     A                                  4  2'Journal Entry Copy Special Charac-
     A                                      ter:'
     A            #1JESP         1   B  4 40TEXT('JE Special Character')
     A N25                                  OVRDTA
     A  31                                  DSPATR(RI PC)
     A N31                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A**Start of change CSD009
     A**********                        6  2'Profit Centres Used..............-               CSD009
     A**********                            ...:'                                             CSD009
     A**********  #1PRCU         1   B  6 40TEXT('Profit Centres Used')                       CSD009
     A                                  5  2'Profit Centres:   Used:'
     A            #1PRCU         1   B  5 27TEXT('Profit Centres Used')
     A**End of change CSD009
     A N25                                  OVRDTA
     A  32                                  DSPATR(RI PC)
     A N32                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A**Start of change CSD009
     A**********                        7  2'Profit Centres Amendable.........-               CSD009
     A**********                            ...:'                                             CSD009
     A**********  #1PRCA         1   B  7 40TEXT('Profit Centres Amendable')                  CSD009
     A                                  5 31'Amendable:'
     A            #1PRCA         1   B  5 43TEXT('Profit Centres Amendable')
     A**End of change CSD009
     A N25                                  OVRDTA
     A  33                                  DSPATR(RI PC)
     A N33                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A**Start of change CSD009
     A**********                        8  2'Profit Centre Defaults Used......-               CSD009
     A**********                            ...:'                                             CSD009
     A**********  #1PCDU         1   B  8 40TEXT('Profit Centre Def''ts Used')                CSD009
     A                                  5 47'Defaults Used:'
     A            #1PCDU         1   B  5 63TEXT('Profit Centre Def''ts Used')
     A**End of change CSD009
     A N25                                  OVRDTA
     A  34                                  DSPATR(RI PC)
     A N34                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A**Start of change CSD009
     A**********                       10  2'Profit Centre Default Matrix Prio-               CSD009
     A                                  6  2'Profit Centre Default Matrix Prio-
     A**End of change CSD009
     A                                      rities'
     A                                      DSPATR(UL)
     A**Start of change CSD009
     A**********                       12  4'Book'                                            CSD009
     A**********                       12 11'Trans-Type'                                      CSD009
     A**********                       12 24'Sub-Type'                                        CSD009
     A**********                       12 35'Dept'                                            CSD009
     A**********                       12 42'User'                                            CSD009
     A**********                       12 49'A/c Officer'                                     CSD009
     A**********                       12 63'Customer'                                        CSD009
     A**********                       12 74'Branch'                                          CSD009
     A                                  7  4'Book'
     A                                  7 11'Trans-Type'
     A                                  7 24'Sub-Type'
     A                                  7 35'Dept'
     A                                  7 42'User'
     A                                  7 49'A/c Officer'
     A                                  7 63'Customer'
     A                                  7 74'Branch'
     A**End of change CSD009
     A  79                                  DSPATR(ND)
     A N25                                  OVRATR
     A**Start of change CSD009
     A**********  #1PMBK         1   B 13  5TEXT('Prof C Def Matrix-Book')                    CSD009
     A            #1PMBK         1   B  8  5TEXT('Prof C Def Matrix-Book')
     A**End of change CSD009
     A N25                                  OVRDTA
     A  35                                  DSPATR(RI PC)
     A N35                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A**Start of change CSD009
     A**********  #1PMTT         1   B 13 15TEXT('Prof C Def Matrix-T Type')                  CSD009
     A            #1PMTT         1   B  8 15TEXT('Prof C Def Matrix-T Type')
     A**End of change CSD009
     A N25                                  OVRDTA
     A  36                                  DSPATR(RI PC)
     A N36                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A**Start of change CSD009
     A**********  #1PMST         1   B 13 27TEXT('Prof C Def Matrix-S Type')                  CSD009
     A            #1PMST         1   B  8 27TEXT('Prof C Def Matrix-S Type')
     A**End of change CSD009
     A N25                                  OVRDTA
     A  37                                  DSPATR(RI PC)
     A N37                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A**Start of change CSD009
     A**********  #1PMDT         1   B 13 36TEXT('Prof C Def Matrix-Dept')                    CSD009
     A            #1PMDT         1   B  8 36TEXT('Prof C Def Matrix-Dept')
     A**End of change CSD009
     A N25                                  OVRDTA
     A  38                                  DSPATR(RI PC)
     A N38                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A**Start of change CSD009
     A**********  #1PMUR         1   B 13 43TEXT('Prof C Def Matrix-User')                    CSD009
     A            #1PMUR         1   B  8 43TEXT('Prof C Def Matrix-User')
     A**End of change CSD009
     A N25                                  OVRDTA
     A  39                                  DSPATR(RI PC)
     A N39                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A**Start of change CSD009
     A**********  #1PMAO         1   B 13 54TEXT('Prof C Def Matrix-Ac Off')                  CSD009
     A            #1PMAO         1   B  8 54TEXT('Prof C Def Matrix-Ac Off')
     A**End of change CSD009
     A N25                                  OVRDTA
     A  40                                  DSPATR(RI PC)
     A N40                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A**Start of change CSD009
     A**********  #1PMCU         1   B 13 66TEXT('Prof C Def Matrix-Cust')                    CSD009
     A            #1PMCU         1   B  8 66TEXT('Prof C Def Matrix-Cust')
     A**End of change CSD009
     A N25                                  OVRDTA
     A  41                                  DSPATR(RI PC)
     A N41                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A**Start of change CSD009
     A**********  #1PMBH         1   B 13 76TEXT('Prof C Def Matrix-Branch')                  CSD009
     A            #1PMBH         1   B  8 76TEXT('Prof C Def Matrix-Branch')
     A**End of change CSD009
     A N25                                  OVRDTA
     A  79                                  DSPATR(PR)
     A  42                                  DSPATR(RI PC)
     A  79N42                               DSPATR(ND)
     A N79N42                               DSPATR(UL HI)
     A N25                                  OVRATR
     A**Start of change CSD009
     A                                  9  4'Ind'
     A N49                                  DSPATR(ND)
     A N25                                  OVRATR
     A                                  9 13'Bank'
     A N49                                  DSPATR(ND)
     A N25                                  OVRATR
     A                                  9 24'Ctry Dom'
     A N49                                  DSPATR(ND)
     A N25                                  OVRATR
     A                                  9 35'Reg Dom'
     A N49                                  DSPATR(ND)
     A N25                                  OVRATR
     A                                  9 49'Ctry Citz'
     A N49                                  DSPATR(ND)
     A N25                                  OVRATR
     A                                  9 63'Reg Citz'
     A N49                                  DSPATR(ND)
     A N25                                  OVRATR
     A                                  9 72'Cust-Type'
     A N49                                  DSPATR(ND)
     A N25                                  OVRATR
     A            #1LICD         1   B 10  5TEXT('Prof C Def Matrix-Ind')
     A N25                                  OVRDTA
     A N49                                  DSPATR(PR)
     A  51                                  DSPATR(RI PC)
     A N49N51                               DSPATR(ND)
     A  49N51                               DSPATR(UL HI)
     A N25                                  OVRATR
     A            #1BNBI         1   B 10 15TEXT('Prof C Def Matrix-Bank')
     A N25                                  OVRDTA
     A N49                                  DSPATR(PR)
     A  52                                  DSPATR(RI PC)
     A N49N52                               DSPATR(ND)
     A  49N52                               DSPATR(UL HI)
     A N25                                  OVRATR
     A            #1CLOC         1   B 10 27TEXT('Prof C Def Matrix-Ctry Dom')
     A N25                                  OVRDTA
     A N49                                  DSPATR(PR)
     A  53                                  DSPATR(RI PC)
     A N49N53                               DSPATR(ND)
     A  49N53                               DSPATR(UL HI)
     A N25                                  OVRATR
     A            #1RLOC         1   B 10 36TEXT('Prof C Def Matrix-Reg Dom')
     A N25                                  OVRDTA
     A N49                                  DSPATR(PR)
     A  54                                  DSPATR(RI PC)
     A N49N54                               DSPATR(ND)
     A  49N54                               DSPATR(UL HI)
     A N25                                  OVRATR
     A            #1CNCZ         1   B 10 54TEXT('Prof C Def Matrix-Ctry Citz')
     A N25                                  OVRDTA
     A N49                                  DSPATR(PR)
     A  55                                  DSPATR(RI PC)
     A N49N55                               DSPATR(ND)
     A  49N55                               DSPATR(UL HI)
     A N25                                  OVRATR
     A            #1RNCZ         1   B 10 66TEXT('Prof C Def Matrix-Reg Citz')
     A N25                                  OVRDTA
     A N49                                  DSPATR(PR)
     A  56                                  DSPATR(RI PC)
     A N49N56                               DSPATR(ND)
     A  49N56                               DSPATR(UL HI)
     A N25                                  OVRATR
     A            #1CSTY         1   B 10 76TEXT('Prof C Def Matrix-Cust Type')
     A N25                                  OVRDTA
     A N49                                  DSPATR(PR)
     A  57                                  DSPATR(RI PC)
     A N49N57                               DSPATR(ND)
     A  49N57                               DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 11  4'Grp Code 1'
     A N49                                  DSPATR(ND)
     A N25                                  OVRATR
     A                                 11 19'Grp Code 2'
     A N49                                  DSPATR(ND)
     A N25                                  OVRATR
     A                                 11 34'Grp Code 3'
     A N49                                  DSPATR(ND)
     A N25                                  OVRATR
     A                                 11 49'Grp Code 4'
     A N49                                  DSPATR(ND)
     A N25                                  OVRATR
     A                                 11 63'Grp Code 5'
     A N49                                  DSPATR(ND)
     A N25                                  OVRATR
     A            #1GPC1         1   B 12  8TEXT('Prof C Def Matrix-Grp Code 1')
     A N25                                  OVRDTA
     A N49                                  DSPATR(PR)
     A  58                                  DSPATR(RI PC)
     A N49N58                               DSPATR(ND)
     A  49N58                               DSPATR(UL HI)
     A N25                                  OVRATR
     A            #1GPC2         1   B 12 23TEXT('Prof C Def Matrix-Grp Code 2')
     A N25                                  OVRDTA
     A N49                                  DSPATR(PR)
     A  59                                  DSPATR(RI PC)
     A N49N59                               DSPATR(ND)
     A  49N59                               DSPATR(UL HI)
     A N25                                  OVRATR
     A            #1GPC3         1   B 12 38TEXT('Prof C Def Matrix-Grp Code 3')
     A N25                                  OVRDTA
     A N49                                  DSPATR(PR)
     A  60                                  DSPATR(RI PC)
     A N49N60                               DSPATR(ND)
     A  49N60                               DSPATR(UL HI)
     A N25                                  OVRATR
     A            #1GPC4         1   B 12 53TEXT('Prof C Def Matrix-Grp Code 4')
     A N25                                  OVRDTA
     A N49                                  DSPATR(PR)
     A  61                                  DSPATR(RI PC)
     A N49N61                               DSPATR(ND)
     A  49N61                               DSPATR(UL HI)
     A N25                                  OVRATR
     A            #1GPC5         1   B 12 67TEXT('Prof C Def Matrix-Grp Code 5')
     A N25                                  OVRDTA
     A N49                                  DSPATR(PR)
     A  62                                  DSPATR(RI PC)
     A N49N62                               DSPATR(ND)
     A  49N62                               DSPATR(UL HI)
     A N25                                  OVRATR
     A**End of change CSD009
     A                                 15  2'Originating Branch Used..........-
     A                                      ..........:'
     A  79                                  DSPATR(ND)
     A N25                                  OVRATR
     A            #1OBRU         1   B 15 47TEXT('Originating Branch Used')
     A N25                                  OVRDTA
     A  79                                  DSPATR(PR)
     A  43                                  DSPATR(RI PC)
     A  79N43                               DSPATR(ND)
     A N79N43                               DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 16  2'Originating Branch/User Validatio-
     A                                      n Required:'
     A  78                                  DSPATR(ND)
     A N25                                  OVRATR
     A            #1OBUV         1   B 16 47TEXT('Orig Branch/User Vald Req')
     A N25                                  OVRDTA
     A  79                                  DSPATR(PR)
     A  44                                  DSPATR(RI PC)
     A  79N44                               DSPATR(ND)
     A N79N44                               DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 18  2'JE Inter-branch Entries at Batch -
     A                                      or Item Level:'
     A  78                                  DSPATR(ND)
     A N25                                  OVRATR
     A            #1IEBI         1   B 18 50TEXT('JE Int-Bch Ents @ Bch/Itm')
     A N25                                  OVRDTA
     A  79                                  DSPATR(PR)
     A  45                                  DSPATR(RI PC)
     A  79N45                               DSPATR(ND)
     A N79N45                               DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 19  2'Inter-branch Entries via Main Bra-
     A                                      nch..........:'
     A  79                                  DSPATR(ND)
     A N25                                  OVRATR
     A            #1IEMB         1   B 19 50TEXT('Int-bch Ent Via Main Brch')
     A N25                                  OVRDTA
     A  79                                  DSPATR(PR)
     A  46                                  DSPATR(RI PC)
     A  79N46                               DSPATR(ND)
     A N79N46                               DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 20  2'Periodic Processing Set....:'
     A  77                                  DSPATR(ND)
     A N25                                  OVRATR
     A            #1PSET         1   B 20 31TEXT('Periodic Processing Set')
     A N25                                  OVRDTA
     A  77                                  DSPATR(PR)
     A  47                                  DSPATR(RI PC)
     A  77N47                               DSPATR(ND)
     A N77N47                               DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 21  2'Main Branch................:'
     A  79                                  DSPATR(ND)
     A N25                                  OVRATR
     A            #1MABR         3   B 21 31TEXT('Main Branch')
     A                                      CHECK(FE)
     A N25                                  OVRDTA
     A  79                                  DSPATR(PR)
     A  48                                  DSPATR(RI PC)
     A  79N48                               DSPATR(ND)
     A N79N48                               DSPATR(UL HI)
     A N25                                  OVRATR
     A*=========================================================================
     A*/COPY WNCPYSRC,SD9172R#93
     A          R #CMDTXT2                  TEXT('Command keys')
     A*/COPY WNCPYSRC,SD9172R#92
     A                                      OVERLAY PUTOVR
      **Start of change 257128
     A**********                       23  2'F3=Main Menu   F12=Previous Screen'              257128
      **********                                     Begin /CGL010/                           257128
     A**75******                       23 39'ENTER=Future Valued Journal Entri-               257128
     A**********                            es'                                               257128
      **********                                     End   /CGL010/                           257128
     A                                 23  2'F3=Exit   F12=Previous Screen'
     A  75                             23 34'ENTER=Future Valued Journal Entri-
     A                                      es'
      **End of change 257128
     A*=========================================================================
     A*/COPY WNCPYSRC,SD9172R#91
     A          R #MSGRCD                   TEXT('Program messages')
     A*/COPY WNCPYSRC,SD9172R#90
     A                                      SFL SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            ##PGM                     SFLPGMQ
     A*=========================================================================
     A*/COPY WNCPYSRC,SD9172R#89
     A          R #MSGCTL                   TEXT('Program messages')
     A*/COPY WNCPYSRC,SD9172R#88
     A                                      SFLCTL(#MSGRCD)
     A                                      SFLPAG(01) SFLSIZ(03)
     A  86                                  OVERLAY PUTOVR
     A                                      SFLINZ SFLDSP SFLDSPCTL
     A  25
     AON25                                  SFLEND
     A            ##PGM                     SFLPGMQ
     A*=========================================================================
     A*/COPY WNCPYSRC,SD9172R#87
