      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas SD General ledger ICD enquiry')                  *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  DSPF/SD9171E# - Display General Ledger ICD - Screen 1.       *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *  Last Amend No. AR787620           Date 10Jun11               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CEU008             Date 13Nov97               *
      *                 CSD003             Date 27OCT97               *
      *                 S01470             DATE 07MAR94               *
      *                 064335             DATE 07MAR94               *
      *                 S01459             DATE 07MAR94               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  AR787620 - Hooks Incorporation                               *
      *             WNCPYSRC,SDH00029                                 *
      *             WNCPYSRC,SDH00030                                 *
      *             WNCPYSRC,SDH00031                                 *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CEU008 - EMU - addition of fields Euro Currency Code         *
      *           and Consolidated Euro Currency code to SDGELRPD.    *
      *  CSD003 - Synon Closedown Project (SD):                       *
      *           - File removed from SD model.                       *
      *  S01470 - Germany development; Addition of 'Mandatory         *
      *           Batch Totals/No. of Items on Journal Entry'         *
      *           to SDGELRPD.                                        *
      *  064335 - Display 'F/Ccy Tfr to Retain Cust/Seq' on the       *
      *           screen.                                             *
      *  S01459 - Addition of Midas headerbox.                        *
      *                                                               *
      *****************************************************************
     A                                      INDARA
     A                                      PRINT(MPRINT)
     A                                      CHGINPDFT
     A*=========================================================================
     A*/COPY WNCPYSRC,SD9171E#99
     A          R #RCDKEY                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*/COPY WNCPYSRC,SD9171E#98
     A                                      SETOF(98 'Force input format')
     A                                      BLINK OVERLAY
     A                                      INDTXT(86 'Enable PUTOVR')
     A  86                                  PUTOVR
     A* Command keys............................................................
     A                                      VLDCMDKEY(29 'Valid command key')
     A                                      CA03(03 'Exit.')
     A* SETOFFS.................................................................
     A                                      SETOF(99 'Global error flag')
     A*.........................................................................
     A            ##USR         10      1  2TEXT('*USER')
     A N25                                  OVRDTA
     A            ##PGM         10   H      TEXT('*PROGRAM')
     A                                  1 13'SD9171E1'
     A            ##MRDT         7      1 72TEXT('Midas Run Date')
     A N25                                  OVRDTA
     A            ##JOB         10      2  2TEXT('*JOB')
     A N25                                  OVRDTA
     A                                  2 34'General Ledger'
     A                                      DSPATR(HI)
     A            ##TME          6  0   2 71TEXT('*TIME')
     A                                      EDTWRD('  :  :  ')
     A N25                                  OVRDTA
     A                                  4  2'General Ledger:'
     A            #1GNLG        10      4 18TEXT('General Ledger')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A*=========================================================================
     A*/COPY WNCPYSRC,SD9171E#97
     A          R #CMDTXT1                  TEXT('Command keys')
     A*/COPY WNCPYSRC,SD9171E#96
     A                                      OVERLAY PUTOVR
     A                                 23  2'CMD: 1-Exit, 9-Change mode.'
     A*=========================================================================
     A*/COPY WNCPYSRC,SD9171E#95
     A          R #RCDDTL1                  TEXT('Details')
     A*/COPY WNCPYSRC,SD9171E#94
     A                                      SETOF(98 'Force input format')
     A                                      BLINK OVERLAY
     A                                      INDTXT(86 'Enable PUTOVR')
     A  86                                  PUTOVR
     A                                      INDTXT(88 'Protect key fields')
     A                                      INDTXT(87 'Enable key screen')
     A* Command keys............................................................
     A                                      VLDCMDKEY(29 'Valid command key')
     A                                      CA03(03 'Exit.')
     A  87                                  CA12(12 'Key screen.')
     A* SETOFFS.................................................................
     A                                      SETOF(99 'Global error flag')
     A*.........................................................................
     A            ##USR         10      1  2TEXT('*USER')
     A N25                                  OVRDTA
     A            ##PGM         10   H      TEXT('*PROGRAM')
     A                                  1 13'SD9171E2'
     A            ##MRDT         7      1 72TEXT('Midas Run Date')
     A N25                                  OVRDTA
     A            ##JOB         10      2  2TEXT('*JOB')
     A N25                                  OVRDTA
     A                                  2 30'General Ledger Enquiry'
     A                                      DSPATR(HI)
     A            ##TME          6  0   2 71TEXT('*TIME')
     A                                      EDTWRD('  :  :  ')
     A N25                                  OVRDTA
     A            #1GNLG        10   H      TEXT('General Ledger')
     A            #1LCD          5  0H      TEXT('Last Change Date')
     A            #1TYLC         1   H      TEXT('Type of Last Change')
     A            #1CUST         6   H      TEXT('Customer Number')
     A            #1APDT         5  0H      TEXT('Accruals/Profit Date')
     A            #DAPDS         6  0H      TEXT('Accrual/Profit Date (scr)')
     A            #1PRCU         1   H      TEXT('Profit Centres Used')
     A            #1PRCA         1   H      TEXT('Profit Centres Amendable')
     A            #1PCDU         1   H      TEXT('Profit Centre Def''ts Used')
     A            #1PMBK         1   H      TEXT('Prof C Def Matrix-Book')
     A            #1PMTT         1   H      TEXT('Prof C Def Matrix-T Type')
     A            #1PMST         1   H      TEXT('Prof C Def Matrix-S Type')
     A            #1PMBH         1   H      TEXT('Prof C Def Matrix-Branch')
     A            #1PMDT         1   H      TEXT('Prof C Def Matrix-Dept')
     A            #1PMUR         1   H      TEXT('Prof C Def Matrix-User')
     A            #1PMAO         1   H      TEXT('Prof C Def Matrix-Ac Off')
     A            #1PMCU         1   H      TEXT('Prof C Def Matrix-Cust')
     A            #1OBRU         1   H      TEXT('Originating Branch Used')
     A            #1OBUV         1   H      TEXT('Orig Branch/User Vald Req')
     A            #1JESP         1   H      TEXT('JE Special Character')
     A            #1IEBI         1   H      TEXT('JE Int-Bch Ents @ Bch/Itm')
     A            #1MABR         3   H      TEXT('Main Branch')
     A            #1IEMB         1   H      TEXT('Int-bch Ent Via Main Brch')
     A            #1ELAP         5  0H      TEXT('End of Last Activity Per.')
     A            #1ECAP         5  0H      TEXT('End of Current Act Period')
     A            #1FCTF         1   H      TEXT('Foreign CCY Transfer Freq')
     A            #1PSET         1   H      TEXT('Periodic Processing Set')
     A                                  4  2'Computer Suspense Account Code..:'
     A**Start of change CGL029
     A**********  #1ACCD         4      4 36TEXT('Account Code')                              CGL029
     A            #1ACCD        10      4 36TEXT('Account Code')
     A**End of change CGL029
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                  6  2'Base Currency Transfer Frequency:'
     A            #1BCTF         1      6 36TEXT('Base Currency Transfer Fq')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                  6 42'F/Ccy Tfr to Retain Cust/Seq.....-
     A                                      ..:'
     A            #1FCRC         1      6 79TEXT('FC Tfr to Retain Cust/Seq')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A*/COPY WNCPYSRC,SDH00029
     A                                  7  2'Profit & Loss Account Code......:'
     A**Start of change CGL029
     A**********  #1PLAC         4      7 36TEXT('Profit & Loss Accnt Code')                  CGL029
     A            #1PLAC        10      7 36TEXT('Profit & Loss Accnt Code')
     A**End of change CGL029
     A*/COPY WNCPYSRC,SDH00030
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A*/COPY WNCPYSRC,SDH00031
     A**Start of change CGL029
     A**********                        7 42'Mand Batch Totals/No. of Items...-               CGL029
     A**********                            ..:'                                              CGL029
     A                                  7 47'Mand Batch Totals/No. of Items:'
     A**End of change CGL029
     A            #1MHTN         1      7 79TEXT('Mand Batch Tot/No of Item')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                  9  2'Accrual for Non-Working Days....:'
     A            #1ANWD         1      9 36TEXT('Accrual Non-Wk Day Ind')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A*                                                Begin /CEU008/
     A  51                              9 42'Euro Currency Code...............-
     A                                      :'
     A            #1EURO         3      9 77TEXT('Euro Currency Code')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A N51                                  DSPATR(ND)
     A*                                                End   /CEU008/
     A                                 10  2'Accrual Key Summary Required?...:'
     A            #1AKSI         1     10 36TEXT('Accrual Key Summary Ind.')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A*                                                Begin /CEU008/
     A  51                             10 42'Consolidated Euro Currency Code..-
     A                                      :'
     A            #1EUCP         3     10 77TEXT('Cons Euro Currency Code')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A N51                                  DSPATR(ND)
     A*                                                End   /CEU008/
     A                                 11  2'Accrue on Last Day?.............:'
     A            #1ALDI         1     11 36TEXT('Accrue on Last Day Ind.')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 13  2'A/c Posting Retention Period....:'
     A            #1APRP         2  0  13 36TEXT('A/c Posting Retention Pd')
     A                                      EDTCDE(4)
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 14  2'Spot Rates Retention Period.....:'
     A            #1SRRP         2  0  14 36TEXT('Spot Rates Retention Pd')
     A                                      EDTCDE(4)
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 15  2'Base Rates Retention Period.....:'
     A            #1BRRP         2  0  15 36TEXT('Base Rates Retention Pd')
     A                                      EDTCDE(4)
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 16  2'Journal Retention Period........:'
     A            #1JREP         2  0  16 36TEXT('Journal Retention Period')
     A                                      EDTCDE(4)
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 17  2'Accruals/Profit Date............:'
     A            #DFDT1         7     17 36TEXT('Function Date 1')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 18  2'Accruals/Profit Frequency.......:'
     A            #1APFQ         1     18 36TEXT('Accruals/Profit Frequency')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 19  2'Accruals/Profit Day in Month....:'
     A            #1APFD         2  0  19 36TEXT('Accruals/Profit Fq. Day')
     A                                      EDTCDE(4)
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 20  2'GL Description Ind..............:'
     A            #1GLDI         1     20 36TEXT('GL Description Ind')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 21  2'Default Statement Frequency Code:'
     A            #1DSFC         1     21 36TEXT('Default Statement Freq Cd')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 22 41'Statutory Returns Authority:'
     A            #DCSST        10     22 70TEXT('Customer shortname ST')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A*=========================================================================
     A*/COPY WNCPYSRC,SD9171E#93
     A          R #CMDTXT2                  TEXT('Command keys')
     A*/COPY WNCPYSRC,SD9171E#92
     A                                      OVERLAY PUTOVR
     A                                 23  2'F3=Main Menu   ENTER=Second Screen'
     A*=========================================================================
     A*/COPY WNCPYSRC,SD9171E#91
     A          R #MSGRCD                   TEXT('Program messages')
     A*/COPY WNCPYSRC,SD9171E#90
     A                                      SFL SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            ##PGM                     SFLPGMQ
     A*=========================================================================
     A*/COPY WNCPYSRC,SD9171E#89
     A          R #MSGCTL                   TEXT('Program messages')
     A*/COPY WNCPYSRC,SD9171E#88
     A                                      SFLCTL(#MSGRCD)
     A                                      SFLPAG(01) SFLSIZ(03)
     A  86                                  OVERLAY PUTOVR
     A                                      SFLINZ SFLDSP SFLDSPCTL
     A  25
     AON25                                  SFLEND
     A            ##PGM                     SFLPGMQ
     A*=========================================================================
     A*/COPY WNCPYSRC,SD9171E#87
