      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas SD FATCA NAHO details - US Indicia Filter')      *
      *****************************************************************
      *                                                               *
      *  MIDAS - Standing Data Module                                 *
      *                                                               *
      *  SDFTNHBDF - FATCA Non-Account Holder Browse                  *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2013            *
      *                                                               *
      *  Last Amend No. MD029849           Date 04Sep14               *
      *  Prev Amend No. CGL132   *CREATE   Date 01May13               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD029849 - Issues on NAHL/NAHE with FATCA                    *
      *  CGL132 - FATCA Phase 1 - Customers' Identification and       *
      *           Classification - Master                             *
      *                                                               *
      *****************************************************************
      *
     A                                      DSPSIZ(27 132 *DS4)
     A                                      REF(MFRFL)
     A                                      CHGINPDFT
     A                                      PRINT(MPRINT)
     A                                      MSGLOC(24)
     A                                      INDARA
      *
      ** Message Subfile Format
      *
     A          R SDFTNHM1                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2013')
     A                                      SFL
     A                                      SFLMSGRCD(24)
     A            DDSFKY                    SFLMSGKEY
     A            DDPGMQ                    SFLPGMQ
      *
      ** Message Subfile Control
      *
     A          R SDFTNHM0                  TEXT('MSG SUBFILE CONTRL')
     A                                      CF03
     A                                      CF14
     A                                      SFLCTL(SDFTNHM1)
     A                                      SFLDSPCTL
     A                                      SFLINZ
     A                                      SFLDSP
     A  94                                  SFLEND
     A                                      SFLSIZ(5)
     A                                      SFLPAG(1)
     A                                      OVERLAY
     A                                      BLINK
     A                                      PUTOVR
     A            DDPGMQ                    SFLPGMQ
      *
      ** Non-account Holder Subfile
      *
     A          R SDFTNHS1                  SFL
     A                                      TEXT('SELECT SCREEN SUBFILE')
     A            DDOPT          1   B 10  2
      ** Start of change MD029849
     A*N93******                            DSPATR(UL HI)                                   MD029849
     A**93******                            DSPATR(ND PR)                                   MD029849
     A                                      VALUES('E' +
     A                                             'A' +
     A                                             'D' +
     A                                                 )
     A                                      CHECK(AB)
     A N93N55                               DSPATR(UL HI)
     A  55
     AO 93N55                               DSPATR(ND PR)
     A            DDOPT2         1   B 10  4
     A                                      VALUES('E' +
     A                                                 )
     A                                      CHECK(AB)
     A N93 55                               DSPATR(UL HI)
     A N55
     AO 93 55                               DSPATR(ND PR)
      ** End of change MD029849
      ** Start of change MD029849
     A**********  DDNAHO        10   O 10  4                                                MD029849
     A            DDNAHO        10   O 10  6
      ** End of change MD029849
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
      ** Start of change MD029849
     A**********  DDHMSVD        1   O 10 16                                                MD029849
     A            DDHMSVD        1   O 10 17
      ** End of change MD029849
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A            DDHMOVD        1   O 10 20
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A            DDMCSVD        1   O 10 26
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A            DDMCOVD        1   O 10 30
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A            DDRPSVD        1   O 10 36
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A            DDRPOVD        1   O 10 40
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A            DDCISVD        1   O 10 47
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A            DDCIOVD        1   O 10 51
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A            DDCBSVD        1   O 10 59
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A            DDCBOVD        1   O 10 63
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A            DDCDSVD        1   O 10 69
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A            DDCDOVD        1   O 10 73
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A            DDGCSVD        1   O 10 79
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A            DDGCOVD        1   O 10 83
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A            DDIDSVD        1   O 10 89
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A            DDIDOVD        1   O 10 93
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A            DDJASVD        1   O 10099
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A            DDJAOVD        1   O 10103
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A            DDTESVD        1   O 10109
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A            DDTEOVD        1   O 10113
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A            DDTXSVD        1   O 10118
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A            DDTXOVD        1   O 10122
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A            DDAUSVD        1   O 10127
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A            DDAUOVD        1   O 10131
     A N93                                  DSPATR(HI)
     A  93                                  DSPATR(ND)
     A
      *
      ** Non-account Holder Subfile Control
      *
     A          R SDFTNHS0                  SFLCTL(SDFTNHS1)
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0015)
     A                                      TEXT('SELECT SCREEN CONTROL')
     A                                      CF03
     A                                      CF14
     A N97                                  SFLDSP
     A N97                                  SFLDSPCTL
     A  96N97                               SFLEND
     A  97                                  SFLCLR
     A N96                                  ROLLUP(98)
     A                                      OVERLAY
     A                                      PUTOVR
     A                                      BLINK
     A            DDSFRN         4S 0H      SFLRCDNBR
     A            DDUSER        10A  O  1  2OVRDTA
     A                                  1 13'SDFTNHB'
     A                                  1119'Date:'
     A            BJMRDT         7A  O  1126OVRDTA
     A            DDWID         10A  O  2  2TEXT('WORKSTATION ID')
     A                                      OVRDTA
     A                                  2 46'Non-Account +
     A                                      Holders List by +
     A                                      US Indicia'
     A                                      DSPATR(HI UL)
     A                                  2119'Time:'
     A                                  2125TIME
     A                                      EDTWRD('  :  :  ')
     A                                  4 16'Hold'
     A                                  4 23'Mailing'
     A                                  4 33'Reg Payment'
     A                                  4 58'Country'
     A                                  4 68'Country of'
     A                                  4 80'Green'
     A                                  4 87'Identity'
     A                                  4 97'Joint Accnt'
     A                                  5 16'Mail'
     A                                  5 23'Country'
     A                                  5 33'Inst to US'
     A                                  5 45'Citizenship'
     A                                  5 58'of Birth'
     A                                  5 69'Domicile'
     A                                  5 80'Card'
     A                                  5 87'Document'
     A                                  5 99'Member'
     A                                  5108'Telephone'
     A                                  5119'TIN'
     A            DDHMTV         1A  B  6 17OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDMCTV         1A  B  6 26OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDRPTV         1A  B  6 37OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDCITV         1A  B  6 50OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDCBTV         1A  B  6 61OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDCDTV         1A  B  6 71OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDGCTV         1A  B  6 82OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDIDTV         1A  B  6 90OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDJATV         1A  B  6101OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDTETV         1A  B  6112OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDTXTV         1A  B  6120OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDAUTV         1A  B  6128OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
      ** Start of change MD029849
     A**********                        7  2'Non-Account'                                   MD029849
     A**********                        8  4'Holder'                                        MD029849
     A                                  7  5'Non-Account'
     A                                  8  7'Holder'
      ** End of change MD029849
     A                                  8 15'Sys Ovr'
     A                                  8 25'Sys Ovr'
     A                                  8 35'Sys Ovr'
     A                                  8 46'Sys Ovr'
     A                                  8 58'Sys Ovr'
     A                                  8 68'Sys Ovr'
     A                                  8 78'Sys Ovr'
     A                                  8 88'Sys Ovr'
     A                                  8 98'Sys Ovr'
     A                                  8108'Sys Ovr'
     A                                  8117'Sys Ovr'
     A                                  8126'Sys Ovr'
      ** Start of change MD029849
     A**********  DDHMSV         1A  B  9 16OVRDTA                                          MD029849
     A            DDHMSV         1A  B  9 17OVRDTA
      ** End of change MD029849
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDHMOV         1A  B  9 20OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDMCSV         1A  B  9 26OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDMCOV         1A  B  9 30OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDRPSV         1A  B  9 36OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDRPOV         1A  B  9 40OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDCISV         1A  B  9 47OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDCIOV         1A  B  9 51OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDCBSV         1A  B  9 59OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDCBOV         1A  B  9 63OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDCDSV         1A  B  9 69OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDCDOV         1A  B  9 73OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDGCSV         1A  B  9 79OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDGCOV         1A  B  9 83OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDIDSV         1A  B  9 89OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDIDOV         1A  B  9 93OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDJASV         1A  B  9 99OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDJAOV         1A  B  9103OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDTESV         1A  B  9109OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDTEOV         1A  B  9113OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDTXSV         1A  B  9118OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDTXOV         1A  B  9122OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A                                  4124'Authority'
     A                                  5126'Holder'
     A            DDAUSV         1A  B  9127OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
     A            DDAUOV         1A  B  9131OVRDTA
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRATR
      *
      ** SELECT SCREEN FOOTER
      *
     A          R SDFTNHF1                  TEXT('SELECT SCREEN FOOTER')
     A                                      CF03
     A                                      CF14
     A                                      BLINK
     A                                      OVERLAY
     A                                      PUTOVR
     A                                 26  2'Rollup/Rolldown for +
     A                                      further records'
      ** Start of change MD029849
     A*N80******                            DSPATR(HI)                                      MD029849
     A**80******                            DSPATR(ND)                                      MD029849
     A N80N81                               DSPATR(HI)
     A  81
     AO 80                                  DSPATR(ND)
      ** End of change MD029849
     A                                      OVRATR
     A                                 26 40'No Data to Display'
     A  80                                  DSPATR(HI)
     A N80                                  DSPATR(ND)
     A                                      OVRATR
     A N36                             27  2'A=Amend  D=Delete  +
     A                                      E=Enquire  F3=Main Menu  +
     A                                      F14=Toggle Non-A/c Holder'
     A  36                             27  2'E=Enquire  F3=Main Menu +
     A                                      F14=Toggle Non-A/c Holder'
