      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas SD Non Account Holder TIN Details')              *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data ILE Module                             *
      *                                                               *
      *  SDNAHL3DDF - Non-Account Holder TIN Details Screen           *
      *                                                               *
      *  (c) Finastra International Limited 2017                      *
      *                                                               *
      *  Last Amend No. CGL157  *CREATE    Date 17Aug15               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGL157 - CRS Reporting                                       *
      *                                                               *
      *****************************************************************
     A                                      CHGINPDFT
     A                                      MSGLOC(22)
     A                                      PRINT(*LIBL/MPRINT)
     A                                      INDARA
      *
     A          R SDNAHOM1                  TEXT('(c) Finastra +
     A                                      International Limited +
     A                                      2015')
     A                                      SFL
     A                                      SFLMSGRCD(22)
     A            DDSFKY                    SFLMSGKEY
     A            DDPGMQ                    SFLPGMQ
      *
     A          R SDNAHOM0                  TEXT('MSG SUBFILE CONTROL')
     A                                      SFLCTL(SDNAHOM1)
     A                                      SFLDSPCTL
     A                                      SFLINZ
     A                                      SFLDSP
     A  94                                  SFLEND
     A                                      SFLSIZ(5)
     A                                      SFLPAG(1)
     A                                      OVERLAY
     A                                      BLINK
     A                                      PUTOVR
     A            DDPGMQ                    SFLPGMQ
      *
     A          R SDNAHOD1
     A                                      CA03(03 'Main Menu')
     A                                      CA12(12 'Cancel')
     A                                      OVERLAY
     A                                      PUTOVR
     A                                      BLINK
     A            DDUSER        10A  O  1  2OVRDTA
     A                                  1 13'SDNAHLT'
     A            BJMRDT         7A  O  1 72OVRDTA
     A            DDWID         10A  O  2  2TEXT('WORKSTATION ID')
     A                                      OVRDTA
     A                                  2 23'Additional Non-Account Holder -
     A                                      Details'
     A                                      DSPATR(HI UL)
     A            DDTIME         6Y 0O  2 71EDTWRD('  :  :  ')
     A                                      OVRDTA
     A                                      TEXT('CURRENT TIME')
     A                                  5  2'Non-account Holder Ref:'
     A            DDNAHO        10   O  5 26TEXT('Customer Number')
     A                                      OVRDTA
     A                                      DSPATR(HI)
      *
     A                                  6 55'Effective'
     A                                  6 67'Expiry'
     A                                  7  2'Additional Tax Identifi+
     A                                      cation Nos.'
     A                                  7 38'Country of TIN'
     A                                  7 55'Date'
     A                                  7 67'Date'
      *
     A            DDTINO        25   B  9  7TEXT('Tax ID 1')
     A                                      DSPATR(HI PR)
     A                                      OVRDTA
     A            DDCOLC         2   B  9 42TEXT('Country of Tax')
     A                                      DSPATR(HI PR)
     A                                      OVRDTA
     A            DDEFF1         6   B  9 55TEXT('Effective Date 1')
     A                                      OVRDTA
     A  28                                  DSPATR(RI PC)
     A N28                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDEXP1         6   B  9 67TEXT('Expiry Date 1')
     A                                      OVRDTA
     A  38                                  DSPATR(RI PC)
     A N38                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDTIN2        25   B 10  7TEXT('Tax ID 2')
     A  10                                  DSPATR(RI PC)
     A N10                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A            DDCTIN2        2   B 10 42TEXT('Country of Tax')
     A                                      OVRDTA
     A  11                                  DSPATR(RI PC)
     A N11                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDEFF2         6   B 10 55TEXT('Effective Date 2')
     A                                      OVRDTA
     A  29                                  DSPATR(RI PC)
     A N29                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDEXP2         6   B 10 67TEXT('Expiry Date 2')
     A                                      OVRDTA
     A  39                                  DSPATR(RI PC)
     A N39                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDTIN3        25   B 11  7TEXT('Tax ID 3')
     A  12                                  DSPATR(RI PC)
     A N12                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A            DDCTIN3        2   B 11 42TEXT('Country of Tax')
     A                                      OVRDTA
     A  13                                  DSPATR(RI PC)
     A N13                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDEFF3         6   B 11 55TEXT('Effective Date 3')
     A                                      OVRDTA
     A  30                                  DSPATR(RI PC)
     A N30                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDEXP3         6   B 11 67TEXT('Expiry Date 3')
     A                                      OVRDTA
     A  40                                  DSPATR(RI PC)
     A N40                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDTIN4        25   B 12  7TEXT('Tax ID 4')
     A  14                                  DSPATR(RI PC)
     A N14                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A            DDCTIN4        2   B 12 42TEXT('Country of Tax')
     A                                      OVRDTA
     A  15                                  DSPATR(RI PC)
     A N15                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDEFF4         6   B 12 55TEXT('Effective Date 4')
     A                                      OVRDTA
     A  31                                  DSPATR(RI PC)
     A N31                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDEXP4         6   B 12 67TEXT('Expiry Date 4')
     A                                      OVRDTA
     A  41                                  DSPATR(RI PC)
     A N41                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDTIN5        25   B 13  7TEXT('Tax ID 5')
     A  16                                  DSPATR(RI PC)
     A N16                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A            DDCTIN5        2   B 13 42TEXT('Country of Tax')
     A                                      OVRDTA
     A  17                                  DSPATR(RI PC)
     A N17                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDEFF5         6   B 13 55TEXT('Effective Date 5')
     A                                      OVRDTA
     A  32                                  DSPATR(RI PC)
     A N32                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDEXP5         6   B 13 67TEXT('Expiry Date 5')
     A                                      OVRDTA
     A  42                                  DSPATR(RI PC)
     A N42                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDTIN6        25   B 14  7TEXT('Tax ID 6')
     A  18                                  DSPATR(RI PC)
     A N18                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A            DDCTN6         2   B 14 42TEXT('Country of Tax')
     A                                      OVRDTA
     A  19                                  DSPATR(RI PC)
     A N19                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDEFF6         6   B 14 55TEXT('Effective Date 6')
     A                                      OVRDTA
     A  33                                  DSPATR(RI PC)
     A N33                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDEXP6         6   B 14 67TEXT('Expiry Date 6')
     A                                      OVRDTA
     A  43                                  DSPATR(RI PC)
     A N43                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDTIN7        25   B 15  7TEXT('Tax ID 7')
     A  20                                  DSPATR(RI PC)
     A N20                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A            DDCTN7         2   B 15 42TEXT('Country of Tax')
     A                                      OVRDTA
     A  21                                  DSPATR(RI PC)
     A N21                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDEFF7         6   B 15 55TEXT('Effective Date 7')
     A                                      OVRDTA
     A  34                                  DSPATR(RI PC)
     A N34                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDEXP7         6   B 15 67TEXT('Expiry Date 7')
     A                                      OVRDTA
     A  44                                  DSPATR(RI PC)
     A N44                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDTIN8        25   B 16  7TEXT('Tax ID 8')
     A  22                                  DSPATR(RI PC)
     A N22                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A            DDCTN8         2   B 16 42TEXT('Country of Tax')
     A                                      OVRDTA
     A  23                                  DSPATR(RI PC)
     A N23                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDEFF8         6   B 16 55TEXT('Effective Date 8')
     A                                      OVRDTA
     A  35                                  DSPATR(RI PC)
     A N35                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDEXP8         6   B 16 67TEXT('Expiry Date 8')
     A                                      OVRDTA
     A  45                                  DSPATR(RI PC)
     A N45                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDTIN9        25   B 17  7TEXT('Tax ID 9')
     A  24                                  DSPATR(RI PC)
     A N24                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A            DDCTN9         2   B 17 42TEXT('Country of Tax')
     A                                      OVRDTA
     A  25                                  DSPATR(RI PC)
     A N25                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDEFF9         6   B 17 55TEXT('Effective Date 9')
     A                                      OVRDTA
     A  36                                  DSPATR(RI PC)
     A N36                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDEXP9         6   B 17 67TEXT('Expiry Date 9')
     A                                      OVRDTA
     A  46                                  DSPATR(RI PC)
     A N46                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDTIN0        25   B 18  7TEXT('Tax ID 0')
     A  26                                  DSPATR(RI PC)
     A N26                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A            DDCTN0         2   B 18 42TEXT('Country of Tax')
     A                                      OVRDTA
     A  27                                  DSPATR(RI PC)
     A N27                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDEFF0         6   B 18 55TEXT('Effective Date 10')
     A                                      OVRDTA
     A  37                                  DSPATR(RI PC)
     A N37                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
     A            DDEXP0         6   B 18 67TEXT('Expiry Date 10')
     A                                      OVRDTA
     A  47                                  DSPATR(RI PC)
     A N47                                  DSPATR(HI)
     A  71N72                               DSPATR(PR)
     A N71                                  DSPATR(UL)
     A                                      OVRATR
      *
     A          R SDNAHOF1                  TEXT('SCREEN FOOTER')
     A                                      CA03
     A                                      CA12
     A                                      OVERLAY
     A                                      BLINK
     A                                      PUTOVR
      *
     A                                 23  2'F3=Exit'
     A                                 23 60'F12=Previous Screen'
      *
