      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE Cash flows using all-in-rate file')           *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/LECFLAPD - Cash Flows Using All-in-Rate File              *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2002            *
      *                                                               *
      *  Last Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      *                 CLE042             Date 06Sep05               *
      *                 CAS009             Date 04May04               *
      *                 CAS005   *CREATE   Date 16Dec02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CLE148 - Alpha Loan Reference                                *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CLE042 - Extended Loan Sub Type                              *
      *  CAS009 - Effective Interest Rate/Amortised Cost Accounting   *
      *  CAS005 - Enhancements to CAS001, CAS002 and CAS004           *
      *                                                               *
      *****************************************************************
      *
     A                                      REF(LECFLWPD)
     A          R LECFLAD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2002')
      *
      **Start of change CLE148
     A**********  LALNRF    R               REFFLD(LCLNRF)                                    CLE148
     A            LALNRF         6A
      **End of change CLE148
     A                                      TEXT('Loan Number')
     A                                      COLHDG('Loan' +
     A                                             'Number')
     A            LALTYP    R               REFFLD(LCLTYP)
     A                                      TEXT('Loan Type')
     A                                      COLHDG('Loan' +
     A                                             'Type')
     A            LALNST    R               REFFLD(LCLNST)
     A                                      TEXT('Loan Subtype')
     A                                      COLHDG('Loan' +
     A                                             'Subtype')
     A            LAFLDT    R               REFFLD(LCFLDT)
     A                                      TEXT('Cash Flow Date(Midas Day No)')
     A                                      COLHDG('Cash Flow Date' +
     A                                             '(Midas Day No)')
     A            LADATE    R               REFFLD(LCDATE)
     A                                      TEXT('Cash flow date o/p')
     A                                      COLHDG('Cash Flow date o/p')
     A            LANDYP    R               REFFLD(LCNDYP)
     A                                      TEXT('No. of Days in Period')
     A                                      COLHDG('No. of Days' +
     A                                             'in Period')
     A            LANDYY    R               REFFLD(LCNDYY)
     A                                      TEXT('No. of Days in Interest Year')
     A                                      COLHDG('No. of Days' +
     A                                             'in Interest Year')
     A            LACAMT    R               REFFLD(LCCAMT)
     A                                      TEXT('Cash Flow Amount')
     A                                      COLHDG('Cash Flow' +
     A                                             'Amount')
     A            LAFTYP    R               REFFLD(LCFTYP)
     A                                      TEXT('Cash Flow Type')
     A                                      COLHDG('Cash Flow' +
     A                                             'Type')
     A            LAIRAT    R               REFFLD(LCIRAT)
     A                                      TEXT('Interest Rate')
     A                                      COLHDG('Interest' +
     A                                             'Rate')
     A            LASPRR    R               REFFLD(LCSPRR)
     A                                      TEXT('Spread Rate')
     A                                      COLHDG('Spread' +
     A                                             'Rate')
     A            LAYLDC    R               REFFLD(LCYLDC)
     A                                      TEXT('Yield Curve')
     A                                      COLHDG('Yield' +
     A                                             'Curve')
     A            LAFYLD    R               REFFLD(LCFYLD)
     A                                      TEXT('Forward Yield Curve')
     A                                      COLHDG('Forward' +
     A                                             'Yield Curve')
     A            LADSCF    R               REFFLD(LCDSCF)
     A                                      TEXT('Discount Factor')
     A                                      COLHDG('Discount' +
     A                                             'Factor')
     A            LANPVA    R               REFFLD(LCNPVA)
     A                                      TEXT('NPV Amount')
     A                                      COLHDG('NPV' +
     A                                             'Amount')
     A            LAIOIN    R               REFFLD(LCIOIN)
     A                                      TEXT('Incoming/Outgoing Ind.')
     A                                      COLHDG('Incoming/' +
     A                                             'Outgoing Ind.')
      * Begin /CSD027/
     A**********  LACNUM    R               REFFLD(LCCNUM)                                    CSD027
     A            LACNUM         6A
      * End /CSD027/
     A                                      TEXT('Customer Number')
     A                                      COLHDG('Customer' +
     A                                             'Number')
     A            LABRCA    R               REFFLD(LCBRCA)
     A                                      TEXT('Branch Code')
     A                                      COLHDG('Branch' +
     A                                             'Code')
     A            LACYCD    R               REFFLD(LCCYCD)
     A                                      TEXT('Currency Code')
     A                                      COLHDG('Currency' +
     A                                             'Code')
     A            LABKCD    R               REFFLD(LCBKCD)
     A                                      TEXT('Book Code')
     A                                      COLHDG('Book' +
     A                                             'Code')
      **Start of change CLE148
     A**********  LAADLN    R               REFFLD(LCADLN)                                    CLE148
     A            LAADLN         6A
      **End of change CLE148
     A                                      TEXT('Associated Loan No.')
     A                                      COLHDG('Associated' +
     A                                             'Loan No.')
     A            LAICBS    R               REFFLD(LCICBS)
     A                                      TEXT('Int. Calc. Basis')
     A                                      COLHDG('Int. Calc.' +
     A                                             'Basis')
      **Start of change CAS009
     A            LAFSEQ         2S 0       TEXT('Fee Sequence')
     A                                      COLHDG('Fee Sequence')
      **End of change CAS009
     A*                                              Begin /CLE042/
     A            LACPAM        13P 0       TEXT('Currency Principal Amount')
     A                                      COLHDG('Currency Principal' +
     A                                       'Amount')
     A            LALNCL         4A         TEXT('Loan Class')
     A                                      COLHDG('Loan' 'Class')
     A*                                              End   /CLE042/
