      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE Manual Diary - Trailer')                      *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/LEDIATPD   MANUAL DIARY TRAILER                           *
      *                                                               *
      *  (c) Finastra International Limited 2019                      *
      *                                                               *
      *  Last Amend No. CLE070  *CREATE    Date 19Jun19               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CLE070 - Manual Diary                                        *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R DIARYT1F                  TEXT('(c) Finastra +
     A                                      International +
     A                                      Limited  2019')
     A            RECI           1A         TEXT('Record Id')
     A                                      COLHDG('Record Id')
     A            DYRF           6S         TEXT('Reference')
     A                                      COLHDG('Reference')
     A            NORE           5S 0       TEXT('No. of Records +
     A                                           on File')
     A                                      COLHDG('No. of Records' +
     A                                             'on File')
     A            NLRB           5S 0       TEXT('No. of Live Rec +
     A                                           on File')
     A                                      COLHDG('No. of Live Rec' +
     A                                             'on File')
     A            NINS           5S 0       TEXT('No. of Inserted +
     A                                           Records')
     A                                      COLHDG('No. of Inserted' +
     A                                             'Records')
     A            NAMD           5S 0       TEXT('No. of Amended +
     A                                           Records')
     A                                      COLHDG('No. of Amended' +
     A                                             'Records')
     A            NDEL           5S 0       TEXT('No. of Deleted +
     A                                           Records')
     A                                      COLHDG('No. of Deleted' +
     A                                             'Records')
     A            CHTP           1A         TEXT('Last Change Type')
     A                                      COLHDG('Last Change Type')
