      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LEO LE Events File')
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/LEEVLOPD - LEO Lending Module Events - Detail File        *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      *  Prev Amend No. CLE042             Date 06Sep05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 S01473             Date 12JUL94               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CLE042 - Extended Loan Sub Type                              *
      *  S01473 - Created for Midas Leo Integration                   *
      *                                                               *
     A*****************************************************************
     A                                      REF(MFRFL)
      *
     A          R EVLEODF
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            RECI      R
     A            ZZ006     R
      * Begin /CSD027/
     A**********  CNUM      R                                                                 CSD027
     A            CNUM           6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            ETYP      R
     A            EDAT      R
     A            EAMT      R
     A            ECCY      R
     A            ZZ002     R
     A            LTYP      R
     A            SUTP      R
     A            BRCA      R
     A            ZZ010     R
     A            OTHA      R
     A            FCCY      R
     A            ZZ171     R
     A            INOI      R
     A            ZZ083     R
      * Begin /CSD027/
     A************FCLT      R               REFFLD(DNBC)
     A            FCLT      R   11A         REFFLD(DNBC)
      * End /CSD027/
     A                                      TEXT('Facility Reference')
     A                                      COLHDG('Facility' 'Ref.')
     A            LCRM      R               REFFLD(DLREF)
     A                                      TEXT('Credit Number')
     A                                      COLHDG('Credit' 'No.')
     A            LTNM      R               REFFLD(MSTS)
     A                                      TEXT('Transfer Number')
     A                                      COLHDG('T/f' 'No.')
     A            LCRN      R               REFFLD(ACTS)
     A                                      TEXT('Negotiation Number')
     A                                      COLHDG('Negot.' 'No.')
     A*                                              Begin /CLE042/
     A            CLAS           4A         TEXT('Loan Class')
     A                                      COLHDG('Loan' 'Class')
     A*                                              End   /CLE042/
     A          K FCLT
     A          K BRCA
