      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE MFU utilisations of tranches from FACHISA')
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/LEFATRPD - MFU Records of Credit Agreement's Tranche(s)   *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4.01 -------------------------------------------*
      *                 189343 *C *CREATE  Date 25Apr01               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  189343 - Create physical file for MFU records of Credit      *
      *           Agreement's tranche(s) from FACHISA.                *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R LEFATRD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
      * Begin /CSD027/
     A**********  TRCNUM    R               REFFLD(CNUM)                                      CSD027
     A            TRCNUM         6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            TRFACT    R               REFFLD(FACT)
     A            TRFCNO    R               REFFLD(FCNO)
     A            TRSTDT    R               REFFLD(STDT)
     A            TRTSEQ    R               REFFLD(CSEQ)
     A            TREXDT    R               REFFLD(MFED)
