      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE Loan amendment fee index file')               *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/LEFELAPD - LE Loan Amendment Fee Index File               *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *  Last Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *  Prev Amend No. CLE009  *CREATE    Date 11May99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CLE148 - Alpha Loan Reference                                *
      *  CLE009 - LE I/C Swift Message Generation for Fees            *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R LEFELAD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
      **Start of change CLE148
     A**********  FFLNRF    R               REFFLD(LNRF)                                      CLE148
     A            FFLNRF         6A
     A                                      TEXT('Loan Number')
     A                                      COLHDG('Loan' 'Number')
      **End of change CLE148
      *
     A            FFVDAT    R               REFFLD(VDAT0)
     A                                      TEXT('Value Date')
      *
     A            FFLASN    R               REFFLD(LASN0)
     A                                      TEXT('Amendment Sequence +
                                                  Number')
      *
     A            FFAUTH    R               REFFLD(CCIO)
     A                                      TEXT('Authorised Indicator')
     A                                      COLHDG('Auth' 'Id')
      *
     A            FFSWRI    R               REFFLD(CCIO)
     A                                      TEXT('Fee Regeneration +
     A                                            Indicator')
     A                                      COLHDG('Fee' 'Regen' 'Id')
