      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas Loans Extract Detail')                           *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Customer Lending Module
     A*                                                               *
     A*  PF/LEPELND - Loans Extract Details                           *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027             Date 05Dec05               *
      *                 CLE042             Date 06Sep05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*                 MOF60              Date 05JUL91               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CLE148 - Alpha Loan Reference                                *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*  CLE042 - Extended Loan Sub Type                              *
     A*  MOF60  - CUSTOMER PROFITABILITY & FEES PROCESSING            *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
      *
     A                                      REF(MFRFL)
      *
     A                                      UNIQUE
     A          R LEPELNDF                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A            BRCA      R
      * Begin /CSD027/
     A**********  LDCNUM    R               REFFLD(CNUM)                                      CSD027
     A**********  LDFCUS    R               REFFLD(FCUS)                                      CSD027
     A            LDCNUM         6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
     A            LDFCUS         6A
     A                                      TEXT('Facility customer')
     A                                      COLHDG('Facility            ' +
     A                                      'Customer')
      * End /CSD027/
     A            LDFTYP    R               REFFLD(FTYP)
     A            LDFSEQ    R               REFFLD(FSEQ)
      **Start of change CLE148
     A**********  LDLNRF    R               REFFLD(LNRF)                                      CLE148
     A            LDLNRF         6A         TEXT('Loan number')
     A                                      COLHDG('Loan' 'Number')
      **End of change CLE148
     A            LDLTYP    R               REFFLD(LTYP)
     A            LDSUTP    R               REFFLD(SUTP)
     A            LDGPID    R
     A            LDGPNA    R
     A            LDDEPT    R               REFFLD(DEPC)
     A            LDACOF    R               REFFLD(ACOF)
     A            LDMPFG    R
     A            LDSTDY    R
     A            LDENDY    R
     A            LDENDT    R
     A            LDLSDT    R
     A            LDLSDY    R
     A            LDLEDT    R
     A            LDLEDY    R
     A            LDVADY    R
     A            LDVADT    R
     A            LDOSPA    R
     A            LDJANA    R               REFFLD(FDJANA)
     A            LDFEBA    R               REFFLD(FDFEBA)
     A            LDMARA    R               REFFLD(FDMARA)
     A            LDAPRA    R               REFFLD(FDAPRA)
     A            LDMAYA    R               REFFLD(FDMAYA)
     A            LDJUNA    R               REFFLD(FDJUNA)
     A            LDJULA    R               REFFLD(FDJULA)
     A            LDAUGA    R               REFFLD(FDAUGA)
     A            LDSEPA    R               REFFLD(FDSEPA)
     A            LDOCTA    R               REFFLD(FDOCTA)
     A            LDNOVA    R               REFFLD(FDNOVA)
     A            LDDECA    R               REFFLD(FDDECA)
     A            LDOACO    R               REFFLD(ACOF)
     A*                                              Begin /CLE042/
     A            LDCLAS         4A         TEXT('Loan Class')
     A                                      COLHDG('Loan' 'Class')
     A*                                              End   /CLE042/
      *
     A          K BRCA
     A          K LDCNUM
     A          K LDLNRF
