/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE Stamp Tax A/C keys and Generated Entries')    *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending                                     *
      *                                                               *
      *  PF/LESTGEPD - LE Stamp Tax A/c keys and generated entries    *
      *                                                               *
      *  (C) Copyright Misys International Banking Systems Ltd 2011   *
      *                                                               *
      *  Last Amend No. CLE148             Date 23Jul12               *
      *  Prev Amend No. CER049 *Create     Date 06Dec2010             *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CLE148 - Alpha Loan Reference                                *
      *  CER049 - Stamp Tax                                           *
      *                                                               *
      *****************************************************************
      *
     A                                      REF(MFRFL)
      *
     A          R LESTGED0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. 2010')
      *
      ** A/c Key details
      *
     A            E4RECI    R               REFFLD(RECI)
     A            E4AKEY    R               REFFLD(AKEY)
     A            E4DLNO    R               REFFLD(DLNO)
      **Start of change CLE148
     A**********  E4LNNO    R               REFFLD(LNNO)                                      CLE148
     A            E4LNNO         6A         TEXT('Loan number')
     A                                      COLHDG('Loan' 'Number')
      **End of change CLE148
     A            E4OTAC    R               REFFLD(OTAC)
     A            E4EDAT    R               REFFLD(EDAT)
     A            E4ECCY    R               REFFLD(ECCY)
     A            E4EAMT    R               REFFLD(EAMT)
     A            E4REVI    R               REFFLD(REVI)
     A            E4MISS         1A         TEXT('MISSING INDICATOR')
     A                                      COLHDG('MISSING' 'IND')
      *
      ** Posting details
      *
     A            E4BRCA    R               REFFLD(BRCA)
     A            E4CNUM    R               REFFLD(CNUMA)
     A            E4CCY     R               REFFLD(CCY)
     A            E4ACOD    R               REFFLD(ACOD)
     A            E4ACSQ    R               REFFLD(ACSQ)
     A            E4PSTA    R               REFFLD(PSTA)
     A            E4PSTD    R               REFFLD(PSTD)
     A            E4VALD    R               REFFLD(VALD)
     A            E4PNAR    R               REFFLD(PNAR)
     A            E4DRCR         2A         TEXT('DR/CR INDICATOR')
     A                                      COLHDG('DR/CR' 'IND')
      *
      ** Key definition
      *
     A          K E4LNNO
     A          K E4AKEY
     A          K E4ECCY
     A          K E4EDAT
     A          K E4EAMT
      *
     A          K E4BRCA
     A          K E4CNUM
     A          K E4CCY
     A          K E4ACOD
     A          K E4ACSQ
      *
