      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE API Customer loans CK - Valid File')          *
      *****************************************************************
      *                                                               *
      *  Midas - Customer Lending Module                              *
      *                                                               *
      *  PF/LEVCLIKPD - Valid Transaction Details File                *
      *                                                               *
      *  (c) Finastra International Limited 2002                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027             Date 05Dec05               *
      *                 CGL029             Date 01Sep03               *
      *                 CAP074  *CREATE    Date 19Mar02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CLE148 - Alpha Loan Reference                                *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CAP074 - Lending API enhancements - Loans input.             *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R LEVCLIKD0                 TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2002')
      *
     A            CLRECI    R               REFFLD(RECI)
     A                                      TEXT('Record Id')
     A                                      COLHDG('Record' +
     A                                             'Id')
      *
      **Start of change CLE148
     A**********  CLLNRF    R               REFFLD(LNRF)                                      CLE148
     A            CLLNRF         6A
      **End of change CLE148
     A                                      TEXT('Loan number')
     A                                      COLHDG('Loan' +
     A                                             'Number')
      *
     A            CLRCDT    R               REFFLD(RCDT)
     A                                      TEXT('Record type')
     A                                      COLHDG('Record' +
     A                                             'Type')
      *
     A            CLMRIN    R               REFFLD(MRIN)
     A                                      TEXT('Matching records indicator')
     A                                      COLHDG('Matching' +
     A                                             'Records' +
     A                                             'Indicator')
      *
     A            CLNAR1    R               REFFLD(NAR1)
     A                                      TEXT('Narrative 1')
     A                                      COLHDG('Narrative' +
     A                                             '1')
      *
     A            CLNAR2    R               REFFLD(NAR2)
     A                                      TEXT('Narrative 2')
     A                                      COLHDG('Narrative' +
     A                                             '2')
      *
     A            CLNAR3    R               REFFLD(NAR3)
     A                                      TEXT('Narrative 3')
     A                                      COLHDG('Narrative' +
     A                                             '3')
      *
     A            CLNAR4    R               REFFLD(NAR4)
     A                                      TEXT('Narrative 4')
     A                                      COLHDG('Narrative' +
     A                                             '4')
      *
     A            CLOPAM    R               REFFLD(OPAM)
     A                                      TEXT('Original Principal amount')
     A                                      COLHDG('Original' +
     A                                             'Principal' +
     A                                             'Amount')
      *
     A            CLFRBC    R               REFFLD(FRBC0)
     A                                      TEXT('Frb code')
     A                                      COLHDG('Frb' +
     A                                             'code')
      *
     A            CLYPLN    R               REFFLD(YPLN)
     A                                      TEXT('Ytd interest pd - Loan ccy')
     A                                      COLHDG('Ytd interest' +
     A                                             'pd - loan ccy')
      *
     A            CLYFLN    R               REFFLD(YFLN)
     A                                      TEXT('Ytd fees pd - Loan ccy')
     A                                      COLHDG('Ytd fees' +
     A                                             'pd - loan ccy')
      *
     A            CLYWLN    R               REFFLD(YWLN)
     A                                      TEXT('Ytd w/h tax paid - Loan ccy')
     A                                      COLHDG('Ytd w/h tax paid' +
     A                                             'loan ccy')
      *
     A            CLABLN    R               REFFLD(ABLN0 )
     A                                      TEXT('Ytd agg. bal. - Loan ccy')
     A                                      COLHDG('Ytd agg. bal.' +
     A                                             'loan ccy')
      *
     A            CLYPLC    R               REFFLD(YPLC)
     A                                      TEXT('Yr to date int. pd. +
     A                                            - Local ccy.')
     A                                      COLHDG('Yr to date' +
     A                                             'int. pd.' +
     A                                             'Local ccy.')
      *
     A            CLYFLC    R               REFFLD(YFLC)
     A                                      TEXT('Yr to date fees pd. +
     A                                            - Local ccy.')
     A                                      COLHDG('Yr to date' +
     A                                             'fees pd.' +
     A                                             'Local ccy.')
      *
     A            CLYWLC    R               REFFLD(YWLC)
     A                                      TEXT('Ytd with tax pd. +
     A                                            - Local ccy.')
     A                                      COLHDG('Ytd with' +
     A                                             'tax pd.' +
     A                                             'Local ccy.')
      *
     A            CLABLC    R               REFFLD(ABLC)
     A                                      TEXT('Ytd agg. bal. +
     A                                            - Local ccy.')
     A                                      COLHDG('Ytd agg. bal.' +
     A                                             'Local ccy.')
      *
     A            CLWWLN    R               REFFLD(WWLN)
     A                                      TEXT('W/t w/o ytd +
     A                                            - Loan ccy.')
     A                                      COLHDG('W/t w/o ytd' +
     A                                             'Loan ccy.')
      *
     A            CLIWLN    R               REFFLD(IWLN)
     A                                      TEXT('Int w/o ytd +
     A                                            - Loan ccy.')
     A                                      COLHDG('Int w/o ytd' +
     A                                             'Loan ccy.')
      *
     A            CLPWLN    R               REFFLD(PWLN)
     A                                      TEXT('Prin w/o ytd +
     A                                            - Loan ccy.')
     A                                      COLHDG('Prin w/o ytd' +
     A                                             'Loan ccy.')
      *
     A            CLZZ04    R               REFFLD(ZZ004)
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
      *
     A            CLRDST    R               REFFLD(RDST)
     A                                      TEXT('Rollover settlement type')
     A                                      COLHDG('Rollover' +
     A                                             'Settlement' +
     A                                             'Type')
      *
     A            CLSPI1    R               REFFLD(SPI1)
     A                                      TEXT('Special instructions - 1')
     A                                      COLHDG('Special' +
     A                                             'Instructions' +
     A                                             '1')
      *
     A            CLSPI2    R               REFFLD(SPI2)
     A                                      TEXT('Special instructions - 2')
     A                                      COLHDG('Special' +
     A                                             'Instructions' +
     A                                             '2')
      *
     A            CLSPI3    R               REFFLD(SPI3)
     A                                      TEXT('Special instructions - 3')
     A                                      COLHDG('Special' +
     A                                             'Instructions' +
     A                                             '3')
      *
     A            CLYILN    R               REFFLD(YILN)
     A                                      TEXT('Interest accrued ytd')
     A                                      COLHDG('Interest' +
     A                                             'accrued' +
     A                                             'ytd')
      *
     A            CLF57U    R               REFFLD(F57U)
     A                                      TEXT('Field 57 unknown')
     A                                      COLHDG('Field 57' +
     A                                             'unknown')
      *
     A**Start of change CGL029
     A**********  CLORVD    R               REFFLD(ORVD)                                      CGL029
     A**********                            TEXT('Our rollover date A/C')                     CGL029
     A**********                            COLHDG('Our rollover' +                           CGL029
     A**********                                   'date A/C')                                CGL029
      *
     A            QQORVD        12A
     A**End of change CGL029
     A            CLTHRN    R               REFFLD(THRN)
     A                                      TEXT('Their rollover Nostro')
     A                                      COLHDG('Their rollover' +
     A                                             'Nostro')
      *
     A            CLNPRA    R               REFFLD(NPRAM)
     A                                      TEXT('New principal amount')
     A                                      COLHDG('New principal' +
     A                                             'amount')
      *
     A            CLNDAM    R               REFFLD(NDAM)
     A                                      TEXT('New discount amount')
     A                                      COLHDG('New discount' +
     A                                             'amount')
      *
     A            CLRLBR    R               REFFLD(RLBR)
     A                                      TEXT('Rollover settlement branch')
     A                                      COLHDG('Rollover' +
     A                                             'settlement' +
     A                                             'branch')
      *
     A            CLZZ09    R               REFFLD(ZZ009)
     A                                      TEXT('Filler')
     A                                      COLHDG('Filler')
      *
     A            CLORED    R               REFFLD(ORED)
     A                                      TEXT('Original entry date')
     A                                      COLHDG('Original' +
     A                                             'entry' +
     A                                             'date')
      *
     A            CLLCD     R               REFFLD(LCD)
     A                                      TEXT('Last change date')
     A                                      COLHDG('Last' +
     A                                             'change' +
     A                                             'date')
      *
     A            CLCHTP    R               REFFLD(CHTP)
     A                                      TEXT('Type of last change')
     A                                      COLHDG('Type' +
     A                                             'of last' +
     A                                             'change')
      *
     A            CLTNLU    R               REFFLD(TNLU)
     A                                      TEXT('Transaction number +
     A                                            of last update')
     A                                      COLHDG('Transaction' +
     A                                             'number of' +
     A                                             'last update')
      *
     A            CLRRST    R               REFFLD(RSTM)
     A                                      TEXT('Receipt - settlement method')
     A                                      COLHDG('Receipt' +
     A                                             'settlement' +
     A                                             'method')
      *
     A**Start of change CGL029
     A**********  CLRRON    R               REFFLD(RONS)                                      CGL029
     A**********                            TEXT('Receipt - our nostro')                      CGL029
     A**********                            COLHDG('Receipt' +                                CGL029
     A**********                                   'our nostro')                              CGL029
      *
     A            QQRRON        12A
     A**End of change CGL029
     A            CLRRIB    R               REFFLD(RIBN)
     A                                      TEXT('Receipt - intermediary +
     A                                            bank number')
     A                                      COLHDG('Receipt' +
     A                                             'intermediary' +
     A                                             'bank number')
      *
     A            CLRRBA    R               REFFLD(RIBA)
     A                                      TEXT('Receipt - intermediary +
     A                                            bank A/C line')
     A                                      COLHDG('Receipt' +
     A                                             'intermediary' +
     A                                             'bank A/C line')
      *
      * Begin /CSD027/
     A**********  CLRROB    R               REFFLD(ROBN)                                      CSD027
     A            CLRROB         6A
      * End /CSD027/
     A                                      TEXT('Receipt - ordering +
     A                                            bank number')
     A                                      COLHDG('Receipt' +
     A                                             'ordering' +
     A                                             'bank number')
      *
      * Begin /CSD027/
     A**********  CLRROC    R               REFFLD(ROCN)                                      CSD027
     A            CLRROC         6A
      * End /CSD027/
     A                                      TEXT('Receipt - ordering +
     A                                            customer number')
     A                                      COLHDG('Receipt' +
     A                                             'ordering' +
     A                                             'customer number')
      *
     A            CLNCCY    R               REFFLD(CCY)
     A                                      TEXT('New Currency')
     A                                      COLHDG('New' +
     A                                             'Ccy')
      *
     A            CLNCPA    R               REFFLD(OPAM)
     A                                      TEXT('New Currency +
     A                                            Principal Amount')
     A                                      COLHDG('New Currency' +
     A                                             'Principal Amount')
      *
     A            CLNFCE    R               REFFLD(SPOT)
     A                                      TEXT('New Facility Ccy +
     A                                            Exch Rate')
     A                                      COLHDG('New Fac Ccy' +
     A                                             'Exchange Rate')
      *
     A            CLNFMD    R               REFFLD(SPIN)
     A                                      TEXT('New Facility Ccy +
     A                                            Mult/Div Ind')
     A                                      COLHDG('New Fac Ccy' +
     A                                             'Mult/Div')
      *
     A            CLNLRA    R               REFFLD(OPAM)
     A                                      TEXT('New Loan Ccy +
     A                                            Repayment Amount')
     A                                      COLHDG('New Loan Ccy' +
     A                                             'Repayment Amount')
      *
     A            CLRSTS    R               REFFLD(SPIN)
     A                                      TEXT('Rollover Status +
     A                                            Indicator')
     A                                      COLHDG('Roll' +
     A                                             'Sts')
      *
     A            CLRIUS    R               REFFLD(FACO)
     A                                      TEXT('Rollover Insert +
     A                                            User Profile')
     A                                      COLHDG('Rollover' +
     A                                             'Insert User')
      *
     A            CLRAUS    R               REFFLD(FACO)
     A                                      TEXT('Rollover Amend +
     A                                            User Profile')
     A                                      COLHDG('Rollover' +
     A                                             'Amend User')
      *
     A            CLRXUS    R               REFFLD(FACO)
     A                                      TEXT('Rollover Authorise +
     A                                            User Prof.')
     A                                      COLHDG('Rollover' +
     A                                             'Auth User')
      *
     A            CLRPCR    R               REFFLD(ZZ015)
     A                                      TEXT('Rollover - PC +
     A                                            Trans Ref.')
     A                                      COLHDG('Rollover -' +
     A                                             'PC Trans Ref')
      *
     A            CLRLSB    R               REFFLD(OSDB)
     A                                      TEXT('Pay - Rollover +
     A                                            Settle Branch')
     A                                      COLHDG('Pay Set' +
     A                                             'Branch')
      *
     A            CLRPST    R               REFFLD(PSTM)
     A                                      TEXT('Pay - Roll +
     A                                            Settlement Method')
     A                                      COLHDG('Pay Set' +
     A                                             'Method')
      *
     A**Start of change CGL029
     A**********  CLRPON    R               REFFLD(PONS)                                      CGL029
     A**********                            TEXT('Pay - Rollover +                            CGL029
     A**********                                  Our Nostro')                                CGL029
     A**********                            COLHDG('Pay Rollover' +                           CGL029
     A**********                                   'Our Nostro')                              CGL029
      *
     A            QQRPON        12A
     A**End of change CGL029
     A            CLRPIB    R               REFFLD(PIBN)
     A                                      TEXT('Pay - Roll +
     A                                            Intermediary Bank')
     A                                      COLHDG('Pay Roll' +
     A                                             'Inter Bank')
      *
     A            CLRPBA    R               REFFLD(PIBA)
     A                                      TEXT('Pay - Roll +
     A                                            Intermediary Bank')
     A                                      COLHDG('Pay Rollover' +
     A                                             'Intermediary Bank')
      *
      * Begin /CSD027/
     A**********  CLRPOB    R               REFFLD(POBN)                                      CSD027
     A            CLRPOB         6A
      * End /CSD027/
     A                                      TEXT('Pay - Roll +
     A                                            Ordering Bank No')
     A                                      COLHDG('Pay Roll' +
     A                                             'Ord Bank')
      *
      * Begin /CSD027/
     A**********  CLRPOC    R               REFFLD(POCN)                                      CSD027
     A            CLRPOC         6A
      * End /CSD027/
     A                                      TEXT('Pay - Roll +
     A                                            Ordering Customer')
     A                                      COLHDG('Pay Roll' +
     A                                             'Ord Cust')
      *
     A            CLRRCR    R               REFFLD(RCRN)
     A                                      TEXT('Roll Receiver +
     A                                            Corresp No')
     A                                      COLHDG('Roll Rec' +
     A                                             'Corresp')
      *
     A            CLRRCA    R               REFFLD(RCRA)
     A                                      TEXT('Roll Receiver +
     A                                            Corresp A/C line')
     A                                      COLHDG('Rollover Receiver' +
     A                                             'Correspondent A/C')
      *
     A            CLRRVN    R               REFFLD(RVNO)
     A                                      TEXT('Rollover Receiver +
     A                                            Number')
     A                                      COLHDG('Roll Rec' +
     A                                             'Number')
      *
     A            CLRAWB    R               REFFLD(AWBN)
     A                                      TEXT('Rollover A/C With +
     A                                            Bank No')
     A                                      COLHDG('Roll A/C' +
     A                                             'w/ Bank')
      *
     A            CLRAWA    R               REFFLD(AWBA)
     A                                      TEXT('Roll A/C With Bank +
     A                                            A/C Line')
     A                                      COLHDG('Rollover A/C' +
     A                                             'w/ Bank A/C line')
      *
     A            CLRBEN    R               REFFLD(BENN)
     A                                      TEXT('Rollover Beneficiary +
     A                                            Number')
     A                                      COLHDG('Roll Ben' +
     A                                             'Number')
      *
     A            CLRBNA    R               REFFLD(BENA)
     A                                      TEXT('Rollover Beneficiary +
     A                                            A/C Line')
     A                                      COLHDG('Rollover Beneficiary' +
     A                                             'Account Line')
      *
     A            CLRDP1    R               REFFLD(DTP1)
     A                                      TEXT('Rollover Details +
     A                                            of Pay 1')
     A                                      COLHDG('Rollover Details' +
     A                                             'of Pay 1')
      *
     A            CLRDP2    R               REFFLD(DTP2)
     A                                      TEXT('Rollover Details +
     A                                            of Pay 2')
     A                                      COLHDG('Rollover Details' +
     A                                             'of Pay 2')
      *
     A            CLRDP3    R               REFFLD(DTP3)
     A                                      TEXT('Rollover Details +
     A                                            of Pay 3')
     A                                      COLHDG('Rollover Details' +
     A                                             'of Pay 3')
      *
     A            CLRDP4    R               REFFLD(DTP4)
     A                                      TEXT('Rollover Details +
     A                                            of Pay 4')
     A                                      COLHDG('Rollover Details' +
     A                                             'of Pay 4')
      *
     A            CLRDCH    R               REFFLD(DCHG)
     A                                      TEXT('Rollover Details +
     A                                            of Charges')
     A                                      COLHDG('Rollover Details' +
     A                                             'of Charges')
      *
     A            CLRBB1    R               REFFLD(BTB1)
     A                                      TEXT('Rollover Bank +
     A                                            to Bank Info 1')
     A                                      COLHDG('Rollover Bank' +
     A                                             'to Bank Info 1')
      *
     A            CLRBB2    R               REFFLD(BTB2)
     A                                      TEXT('Rollover Bank +
     A                                            to Bank Info 2')
     A                                      COLHDG('Rollover Bank' +
     A                                             'to Bank Info 2')
      *
     A            CLRBB3    R               REFFLD(BTB3)
     A                                      TEXT('Rollover Bank +
     A                                            to Bank Info 3')
     A                                      COLHDG('Rollover Bank' +
     A                                             'to Bank Info 3')
      *
     A            CLRBB4    R               REFFLD(BTB4)
     A                                      TEXT('Rollover Bank +
     A                                            to Bank Info 4')
     A                                      COLHDG('Rollover Bank' +
     A                                             'to Bank Info 4')
      *
     A            CLRBB5    R               REFFLD(BTB5)
     A                                      TEXT('Rollover Bank +
     A                                            to Bank Info 5')
     A                                      COLHDG('Rollover Bank' +
     A                                             'to Bank Info 5')
      *
     A            CLRBB6    R               REFFLD(BTB6)
     A                                      TEXT('Rollover Bank +
     A                                            to Bank Info 6')
     A                                      COLHDG('Rollover Bank' +
     A                                             'to Bank Info 6')
      *
     A            CLRCVM    R               REFFLD(CVMR)
     A                                      TEXT('Roll Cover Message +
     A                                            Required')
     A                                      COLHDG('Roll Cvr' +
     A                                             'Msg Req')
      *
     A            CLNBCE    R               REFFLD(SPOT)
     A                                      TEXT('New Base Currency +
     A                                            Exch Rate')
     A                                      COLHDG('New Base Ccy' +
     A                                             'Exchange Rate')
      *
     A            CLNBMD    R               REFFLD(SPIN)
     A                                      TEXT('New Base Currency +
     A                                            Mult/Div Ind')
     A                                      COLHDG('New Base Ccy' +
     A                                             'Mult/Div')
      *
     A            CLRRSC    R               REFFLD(CCY)
     A                                      TEXT('Roll Rec Settlement +
     A                                            Ccy')
     A                                      COLHDG('Roll Rec Sett Ccy')
      *
     A            CLRPSC    R               REFFLD(CCY)
     A                                      TEXT('Roll Pay Settlement +
     A                                            Ccy')
     A                                      COLHDG('Roll Pay Sett Ccy')
      *
     A            CLRICY    R               REFFLD(CCY)
     A                                      TEXT('Roll IN Ccy in +
     A                                            Fld 72')
     A                                      COLHDG('Roll IN Ccy')
      *
     A            CLECIN    R               REFFLD(ZZ001)
     A                                      TEXT('Euro Conversion Ind')
     A                                      COLHDG('Euro Conv Ind')
      *
     A            CLRPSM    R               REFFLD(RSTM)
     A                                      TEXT('Roll Pay Settlement +
     A                                            Method')
     A                                      COLHDG('Roll Pay Sett +
     A                                              Method')
      *
     A**Start of change CGL029
     A**********  CLRPOS    R               REFFLD(RONS)                                      CGL029
     A**********                            TEXT('Roll Pay Our Nostro')                       CGL029
     A**********                            COLHDG('Roll Pay Our Nost')                       CGL029
      *
     A            QQRPOS        12A
     A**End of change CGL029
     A            CLRPTS    R               REFFLD(TSTN)
     A                                      TEXT('Roll Pay Their Nost')
     A                                      COLHDG('Roll Pay Their +
     A                                              Nost')
      *
     A            CLRPSB    R               REFFLD(BRCA)
     A                                      TEXT('Roll Pay Settlement +
     A                                            Branch')
     A                                      COLHDG('Roll Pay Settle +
     A                                              Brch')
      *
     A            CLRFAO    R               REFFLD(FACO)
     A                                      TEXT('Roll For account of')
     A                                      COLHDG('Roll For A/c of')
      *
     A            CLFYLB         5A         TEXT('Forward Yield Curve for +
     A                                      Rollover')
     A                                      COLHDG('Fwd Yld Curve for' +
     A                                             'Rollover')
     A            CLRRSR        13P 8
     A                                      TEXT('Receipt Currency +
     A                                         Exchange Rate')
     A                                      COLHDG('Receipt' 'Currency'+
     A                                         'Exchange' 'Rate')
     A            CLRRSI         1A
     A                                      TEXT('Receipt Currency +
     A                                         Exchange Rate Indicator')
     A                                      COLHDG('Receipt' 'Currency'+
     A                                         'Exchange' 'Rate'+
     A                                         'Indicator')
     A            CLRPSR        13P 8
     A                                      TEXT('Payment Currency +
     A                                         Exchange Rate')
     A                                      COLHDG('Payment' 'Currency'+
     A                                         'Exchange' 'Rate')
     A            CLRPSI         1A
     A                                      TEXT('Payment Currency +
     A                                         Exchange Rate Indicator')
     A                                      COLHDG('Payment' 'Currency'+
     A                                         'Exchange' 'Rate'+
     A                                         'Indicator')
     A            CLRSTA    R               REFFLD(RSTA)
     A                                      TEXT('Rollover Settlement +
     A                                           Allocation Indicator')
     A                                      COLHDG('Rollover Settlement' +
     A                                           'Allocation Indicator')
      *
     A            CLFRNT    R               REFFLD(FOTRNID)
     A                                      TEXT('Front Office +
     A                                           Transaction Id')
     A                                      COLHDG('Front Office' +
     A                                             'Transaction Id')
      *
     A            CLAFRT    R               REFFLD(FOTRNID)
     A                                      TEXT('Associated Front +
     A                                            Office Transaction Id')
     A                                      COLHDG('Associated' +
     A                                             'Front Office' +
     A                                             'Transaction Id')
      *
     A            CLREPA    R               REFFLD(RPRLOC)
     A                                      TEXT('Repair Location')
     A                                      COLHDG('Repair Location')
      *
     A            CLTMES    R               REFFLD(TIMESTMP)
     A                                      TEXT('Timestamp')
     A                                      COLHDG('Timestamp')
      *
     A**Start of change CGL029
     A            CLORVD        18A         TEXT('Our rollover date A/C')
     A            CLRRON        18A         TEXT('Receipt - our nostro')
     A            CLRPON        18A         TEXT('Pay - Rollover +
     A                                            Our Nostro')
     A            CLRPOS        18A         TEXT('Roll Pay Our Nostro')
     A**End of change CGL029
