      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas LE YEAR TO DATE DETAIL')                         *
     A**************************************************************************
     A*
     A*  Midas - Customer Lending Module
     A*
     A*   PF/LEYTDYT         MATURED LOANS Y.T.D FILE-DETAIL RECORD
     A*
      *  (c) Finastra International Limited 2001                      *
     A*
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CLE148             Date 23Jul12               *
      *                 CER059             Date 19Jul10               *
      *                 BUG23967           Date 13May09               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 BHF256             Date 12JUL90               *
     A*                 S01260             Date 23MAY90               *
     A*        AMENDMENT NO. E86114           DATE 22/02/89            *
     A*        AMENDMENT NO. S01117           DATE 23/06/87
     A*
     A*************************************************************************
      *  MD046248 - Finastra Rebranding                               *
      *  CLE148 - Alpha Loan Reference                                *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  BUG23967 - Add Local Industry Code Field.                    *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*   BHF256 - SHOULD BE USING 6 ZONED VERSION OF OLNO             *  BHF256
     A*   S01260 - ORIGINAL BORROWER ON PARTICIPATIONS PURCHASED.        *S01260
     A*   E86114 - DEFINE FIELDS FOR 'LOAN CCY' , 'TOTAL INTEREST' ,   *  E86114
     A*            AND 'INTEREST ACCRUED TO LAST YEAR END'.            *  E86114
     A*                                                                *  E86114
     A*************************************************************************
     A                                      REF(MFRFL)
     A          R LEYTDYTF                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            RECI      R
      * Begin /CSD027/
     A**********  CNUM      R                                                                 CSD027
     A            CNUM           6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
      **Start of change CLE148
     A**********  LNRF      R                                                                 CLE148
     A            LNRF           6A         TEXT('Loan number')
     A                                      COLHDG('Loan' 'Number')
      **End of change CLE148
     A*****************              /S01117/
     A**          BRCD      R
     A            BRCA      R
     A*****************              /S01117/
     A            CRSK      R
     A            LIND      R
     A            YPLC      R               REFFLD(YWLC0 )
     A            YWLC      R               REFFLD(YWLC0 )
     A            YFLC      R               REFFLD(YWLC0 )
     A            ABLC      R               REFFLD(ABLC0 )
     A            MOAT      R
     A            MRIN      R
     A            PTYP      R
     A*                                     /*E86114*/
     A************ZZ021     R
     A            ZZ004     R
     A            CCY       R
     A            AITC      R
     A            YILN      R
     A*                                     /*E86114*/
     A*                                     /*S01260*/
     A*                                       /*BHF256*/
     A************OLNO      R
      * Begin /CSD027/
     A**********  OLNO      R               REFFLD(OLNO0)                                     CSD027
     A            OLNO      R    6A         REFFLD(OLNO0)
      * End /CSD027/
     A*                                       /*BHF256*/
     A            RCSI      R
     A*                                     /*S01260*/
      **Start of change BUG23967
     A            LOIC      R               REFFLD(FTAG)
      **End of change BUG23967
