      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas Delay COB control DTAARA description')
      *****************************************************************
      *                                                               *
      *  Midas - Close of Business Processing                         *
      *                                                               *
      *  PF/DLYCOB - DLYCOB Data Area Layout                          *
      *                                                               *
      *  Note: Any fix applied to this file may also need to be       *
      *        applied to the core DTAARA source.                     *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2005            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. BUG10848R          Date 03May06               *
      *  Prev Amend No. CCB014  *CREATE    Date 25Apr05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  BUG10848R - Retrieved the UserId who runs the schedule batch *
      *              for COB                                          *
      *  CCB014 - Pre Scheduled Batch Close of Business               *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R DLYCOBF                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2005')
      *
     A            AUTSCH         1          TEXT('Automatic Scheduling')
     A            SCHREQ         1          TEXT('Scheduling Requested')
     A            SCHDAT         5S 0       TEXT('Scheduling Date')
     A            SCHTIM         6          TEXT('Scheduling Time')
     A            SCHTMM         2          TEXT('Warning period in  min.')
     A            COBNAM        10          TEXT('Sch. COB Name')
     A            COBUSR        10          TEXT('Sch. COB User')
     A            COBNBR         6          TEXT('Sch. COB Number')
     A            WARNAM        10          TEXT('Sch. Warning Name')
     A            WARUSR        10          TEXT('Sch. Warning User')
     A            WARNBR         6          TEXT('Sch. Warning Number')
      **Start of change BUG10848R
     A            REQUSR        10          TEXT('Requesting User')
     A**********  FILLER       189          TEXT('Filler')                             /*BUG10848R*/
     A            FILLER       179          TEXT('Filler')
      **End of change BUG10848R
