      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas DL Citydealer Status Dataarea Layout')
      *****************************************************************
      *                                                               *
      *  Midas - Dealing Module                                       *
      *                                                               *
      *  PF/DLCDSTAT - Midas Citydealer Status Dataarea Layout        *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CCM002 *CREATE     DATE 04SEP95               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CCM002 - Midas/Citydealer Interface (Phases V and VI)        *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A*
     A          R DLCDSTAF                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*
     A            CDCA      R               TEXT('Citydealer Component Active')
     A                                      COLHDG('Citydealer Comp Act.')
     A            NAME      R               TEXT('Job Name')
     A                                      COLHDG('Job Name')
     A            USER      R               TEXT('User')
     A                                      COLHDG('User')
     A            JOBN      R               TEXT('Job Number')
     A                                      COLHDG('Job Number')
