      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SM Global objects not to be migrated')           *
      *****************************************************************
      *                                                               *
      *  Midas - Implementation module                                *
      *                                                               *
      *  PF/SMGNMGPD - Objects not be migrated                        *
      *                                                               *
      *  (c) Finastra International Limited 2006                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CUP002             Date 18Aug10               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CPK025  *CREATE    Date 28Jun06               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CUP002 - Add zone field name for rename zone utility.        *
      *  CPK025 - MidasPlus 1.3 packaging.  Migrate global layer.     *
      *                                                               *
      *****************************************************************
     A          R SMGNMGD0
      *
     A            NCOBJ         10A         TEXT('Object')
     A                                      COLHDG('Object')
     A            NCTYPE         8A         TEXT('Type')
     A                                      COLHDG('Type')
     A            NCETBL         1A         TEXT('Extension table')
     A                                      COLHDG('Ext' 'Tbl')
      * Start CUP002
     A            NCZFLD        10A         TEXT('Name of zone field')
     A                                      COLHDG('Zone' 'Field' 'Name')
      * End   CUP002
     A          K NCOBJ
     A          K NCTYPE
