      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas CG FT debit credit advices extras KEYEED')
      *****************************************************************
      *                                                               *
      *  Midas - User Defined Correspondence                          *
      *                                                               *
      *  PF/CGDRCRPD - FT Debit Credit Advices Extras KEYEED          *
      *                                                               *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Last Amend No. CFT003 *CREATE    Date 29Jun98                *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CFT003 - FT Batch Authosrisation                             *
      *           Based on CGDRCRE0 original references EAH005/DJBU04 *
      *                                                               *
      *****************************************************************
      *
      *  Formats     Description
      *  ~~~~~~~     ~~~~~~~~~~~
      *  @DRCRPD     Extended Criteria Processing and Internal Payment
      *
      *================================================================
     A                                      REF(MFRFL)
     A          R @DRCRPD                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            DCPYTP         2          TEXT('Traansaction Type')
     A                                      COLHDG('Transaction' +
     A                                             'Type')
     A            DCPYST         2          TEXT('Transaction Sub-type')
     A                                      COLHDG('Transaction' +
     A                                             'Sub-Type')
     A            DCRECI         1          TEXT('Record Identifier')
     A                                      COLHDG('Record' +
     A                                             'Identifier')
     A            DCDESC        30          TEXT('Description')
     A                                      COLHDG('Description')
     A            DCAJOB        10          TEXT('Job name')
     A                                      COLHDG('Job name')
     A            DCAUSR        10          TEXT('User name')
     A                                      COLHDG('User name')
     A            DCATIM         6  0       TEXT('Action Time')
     A                                      COLHDG('Action' +
     A                                             'Time')
     A            DCARDT         7          TEXT('Action Date')
     A                                      COLHDG('Action' +
     A                                             'Date')
     A            DCAACT         1          TEXT('Action Type')
     A                                      COLHDG('Action' +
     A                                             'Type')
     A            DCRDNB         5  0       TEXT('Run day number')
     A                                      COLHDG('Run day' +
     A                                             'number')
     A            DCSETM         2          TEXT('Settlement Method')
     A                                      COLHDG('Settlement' +
     A                                             'Method')
     A            DCDRAD         1          TEXT('Debit Advice Required')
     A                                      COLHDG('Debit Advice' +
     A                                             'Required')
     A            DCCRAD         1          TEXT('Crebit Advice Required')
     A                                      COLHDG('Crebit Advice' +
     A                                             'Required')
      *
      *----------------------------------------------------------------
      * Key fields
      *
     A          K DCPYTP
     A          K DCPYST
     A          K DCSETM
      *
      *=====================================================================
