      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_RU                                                        *
/*EXI *  TEXT('Midas CG Mail Shot Details         Physical file')
     A*****************************************************************
     A*                                                               *
     A*  Midas - User Defined Correspondence                      *
     A*                                                               *
     A*  PF/CGMSFTPD - Mail Shot Details         Physical file        *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01522             Date 22Nov94               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     A*  S01522 - User Defined Correspondence                         *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A                                      REF(MFRFL)
     A*=====================================================================
     A          R @MSHTPD                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            MSMSHT         6          TEXT('Mail Shot Identifier')
     A                                      COLHDG('Mail Shot' +
     A                                             'Identifier')
     A            MSRECI         1          TEXT('Record Identifier')
     A                                      COLHDG('Record' +
     A                                             'Identifier')
     A            MSMDT1        50          TEXT('Mail Shot Data 1')
     A                                      COLHDG('Mail Shot Data 1')
     A            MSMDT2        50          TEXT('Mail Shot Data 2')
     A                                      COLHDG('Mail Shot Data 2')
     A            MSMDT3        50          TEXT('Mail Shot Data 3')
     A                                      COLHDG('Mail Shot Data 3')
     A            MSMDT4        50          TEXT('Mail Shot Data 4')
     A                                      COLHDG('Mail Shot Data 4')
     A            MSDESC        30          TEXT('Description')
     A                                      COLHDG('Description')
     A            MSAJOB        10          TEXT('Job name')
     A                                      COLHDG('Job name')
     A            MSAUSR        10          TEXT('User name')
     A                                      COLHDG('User name')
     A            MSATIM         6  0       TEXT('Action Time')
     A                                      COLHDG('Action' +
     A                                             'Time')
     A            MSARDT         7          TEXT('Action Date')
     A                                      COLHDG('Action' +
     A                                             'Date')
     A            MSAACT         1          TEXT('Action Type')
     A                                      COLHDG('Action' +
     A                                             'Type')
     A            MSRDNB         5  0       TEXT('Run day number')
     A                                      COLHDG('Run day' +
     A                                             'number')
     A*=====================================================================
