      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas PM Account codes by PM instrument type')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Management Module                          *
     A*                                                               *
     A*  LF/PMACODL0 - ACCOUNT CODES BY PM INSTRUMENT TYPE            *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD031             Date 10Apr06               *
      *                 CPB004             Date 11Jul02               *
      *                 CGL029             Date 01Sep03               *
      *                 CGP001             Date 23May03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CGL010             Date 08Nov99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CSD005             Date 16Apr99               *
      *                 CFT002             Date 20Nov98               *
      *                 CTI002             DATE 23SEP98               *
     A*                 CFT002             DATE 27APR98               *
     A*                 CTI001             DATE 15JUL97               *
     A*                 S01486             DATE 11AUG94               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD031 - Enhanced Centralised Static Data (Recompile)        *
      *  CPB004 - Add identifier to SDACODPD to indicate if account   *
      *           is to be transferred, maintained and closed in TOF. *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CGP001 - Global Processing (recompile)                       *
      *  CGL010 - Future Value Dated Journal Entries for              *
      *           Non-Retail Accounts. Recompiled.                    *
     A*  CSD005 - Recompiled                                          *
     A*  CFT002 - Straight Through Processing Phase 1                 *
     A*           Recompile over SDACODPD.                            *
      *  CTI002 - Recompiled : File SDACODPD changed                  *
     A*  CTI001 - Midas/Trade Innovation Interface Phase 1            *
     A*           Recompile over SDACODPD.                            *
     A*  S01486 - Portfolio Management Upgrade to R10.                *
     A*                                                               *
     A*****************************************************************
     A          R SDACODD0                  PFILE(SDACODPD)
     A**************                                 Begin /S01486/
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A**************                                 End   /S01486/
     A          K A5INNR
