      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas PM Deals file')                                  *
      *****************************************************************
      *                                                               *
      *  Midas - Portfolio Management Module                          *
      *                                                               *
      *  LF/PMBDELL0 - PM Deals File                                  *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *  Last Amend No. CDL099             Date 06Oct17               *
      *  Prev Amend No. CGL165             Date 17Feb15               *
      *                 CDL096             Date 22Sep14               *
      *                 CDL094             Date 11Jun14               *
      *                 CTI006             Date 31Mar14               *
      *                 CSW212             Date 03May12               *
      *                 CRE073             Date 06Dec10               *
      *                 CER059             Date 19Jul10               *
      *                 CER054             Date 07Apr09               *
      *                 CER048             Date 19May08               *
      *                 CER020             Date 19May08               *
      *                 CER043             Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CDL049             Date 30Mar06               *
      *                 CDL038             Date 10May05               *
      *                 233324             Date 02May05               *
      *                 CSD027             Date 05Dec05               *
      *                 CAS009             Date 04May04               *
      *                 CDL033             Date 10Feb05               *
      *                 BUG3644            Date 12Jul04               *
      *                 CGL014             Date 20Oct03               *
      *                 CDL019             Date 03Feb04               *
      *                 CDL018             Date 03Feb04               *
      *                 CDL017             Date 03Feb04               *
      *                 CDL016             Date 03Feb04               *
      *                 CGL029             Date 01Sep03               *
      *                 CAS005             Date 16Dec02               *
      *                 CAS004             Date 26Jun02               *
      * Midas Release 4.01 -------------------------------------------*
      *                 CAS001             Date 23Nov01               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      *                 CDL008             Date 02May00               *
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CGL011             Date 20Sep99               *
      *                 CAP051             Date 09Nov99               *
      *                 CDL007             Date 04Oct99               *
      *                 CPB001             Date 21Sep99               *
      * Midas DBA 3.01 -----------------------------------------------*
      *                 CDL006             Date 27Apr99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CDL002             Date 18Sep97               *
      *                 CPM005 *CREATE     Date 13Jun96               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CDL099 - Split Value Date (Recompile)                        *
      *  CGL165 - Dual Withholding Tax (Recompile)                    *
      *  CDL096 - Business Day Conventions on MM Deals                *
      *           (Recompile)                                         *
      *  CDL094 - Enhance Receive Settlement Instructions (Recompile) *
      *  CTI006 - Trade Finance BF Midas 2.2 Interface (Recompile)    *
      *  CSW212 - SWIFT 2012 Changes (Recompile)                      *
      *  CRE073 - Interest Rate Rounding (Recompile)                  *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER054 - German Features - Church Tax (Recompile)            *
      *  CER048 - German Features - Taxes (Recompile)                 *
      *  CER020 - Enhanced Rollover Window: Upgrade FGE089 to         *
      *           Midas Plus (Recompile)                              *
      *  CER043 - German Features LF041-00 New Fields and Defaulting  *
      *           (Recompile)                                         *
      *  CDL049 - Addition of a Reference Rate field (recompile).     *
      *  CDL038 - Extended Deal Sub Type (Recompile)                  *
      *  233324 - Add new fields in DEALSDC for EU Tax (Recompile).   *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CAS009 - Effective Interest Rate/Amortised Cost Accounting   *
      *           (Recompile)                                         *
      *  CDL033 - Floating Rate CDs Issued (Recompile)                *
      *  BUG3644 - Serious Error in Collateralised Lending (Recompile)*
      *  CGL014 - Collaterals Processing (Recompile)                  *
      *  CDL019 - Allow Base Rate Changes on Fixed Deposits/Loans     *
      *  CDL018 - Multiple Settlement Accounts on Loans/Deposit       *
      *  CDL017 - Penalty Fee & Early Maturity of Fixed Term Loan/Dep *
      *  CDL016 - Automatic Rollover of Fixed Term Loan/Deposit       *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CAS005 - Enhancements to CAS001, CAS002 and CAS004           *
      *           (Recompile)                                         *
      *  CAS004 - Hedge Accounting Phase A (Recompile)                *
      *  CAS001 - Net Present Value (NPV) Accounting (Recompile)      *
      *  CDL008 - Continuous Linked Settlement (Recompiled)           *
      *  CGL011 - Collateral Processing for Midas. Recompile.         *
      *  CAP051 - Automatic Authorisation (MM and FX Part)            *
      *           Recompile over changes in DEALSDC and DEALSDB       *
      *  CDL007 - Deposit Breakdown Penalty                           *
      *           Recompile over changes in DEALSDC                   *
      *  CPB001 - Meridian DBA Middleware Replication Customization.  *
      *           Recompile over changes in PMBDLAPD                  *
      *  CDL006 - Dealing Fiduciary (Recompile)                       *
      *  CDL002 - FX Netting - Recompiled only                        *
      *  CPM005 - Private Banking Phase II                            *
      *           Focus Group Changes Upgraded to DBA                 *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A          R DEALSDAF                  PFILE(PMBDLAPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A          K DLNO
      *
     A          R DEALSDBF                  PFILE(PMBDLBPD)
     A          K DLNO
     A          O RECI                      COMP(EQ 'N')
      *
     A          R DEALSDCF                  PFILE(PMBDLCPD)
     A          K DLNO
     A          O RECI                      COMP(EQ 'N')
      *
     A          R DEALSDDF                  PFILE(PMBDLDPD)
     A          K DLNO
     A          O RECI                      COMP(EQ 'N')
      *
     A          R DEALSDEF                  PFILE(PMBDLEPD)
     A          K DLNO
     A          O RECI                      COMP(EQ 'N')
      *
     A          R DEALSDFF                  PFILE(PMBDLFPD)
     A          K DLNO
