      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM15                                                      *
/*EXI *  TEXT('Midas DL Deals by Portfolio Reference')                *
     A*****************************************************************
     A*                                                               *
     A*                                                               *
     A*  Midas - Portfolio Management Module                      *
     A*                                                               *
     A*  LF/PMDEALL0 - DEALSPT  - DL DEALS BY PORTFOLIO REFERENCE     *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      *  Last Amend No. CDL099             Date 06Oct17               *
      *  Prev Amend No. CGL165             Date 17Feb15               *
      *                 CDL096             Date 22Sep14               *
      *                 CDL094             Date 30May14               *
      *                 CTI006             Date 31Mar14               *
      *                 CSW212             Date 03May12               *
      *                 CRE073             Date 06Dec10               *
      *                 CER059             Date 19Jul10               *
      *                 CER054             Date 07Apr09               *
      *                 CER048             Date 19May08               *
      *                 CER020             Date 19May08               *
      *                 CER043             Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CDL049             Date 11Jul06               *
      *                 CSD027             Date 05Dec05               *
      *                 233324             Date 02May05               *
      *                 CAS009             Date 04May04               *
      *                 CDL038             Date 10May05               *
      *                 CDL033             Date 10Feb05               *
      *                 CAS008             Date 16Jun04               *
      *                 BUG3644            Date 12Jul04               *
      *                 CGL014             Date 20Oct03               *
      *                 CDL019             Date 03Feb04               *
      *                 CDL018             Date 03Feb04               *
      *                 CDL017             Date 03Feb04               *
      *                 CDL016             Date 03Feb04               *
      *                 CGL029             Date 01Sep03               *
      *                 CAS005             Date 16Dec02               *
      *                 CAS004             Date 26Jun02               *
      * Midas Release 4.01 -------------------------------------------*
      *                 CAS001             Date 23Nov01               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.04 -----------------------------------------------*
      *                 CDL008             Date 02May00               *
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CAP051             Date 09Nov99               *
      *                 CDL007             Date 04Oct99               *
     A*                 CPB001             Date 01Jun99               *
      *                 CGL011             Date 20Sep99               *
      * Midas DBA 3.01 -----------------------------------------------*
      *                 CDL006             Date 26Apr99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CEU015             Date 19Jun98               *
      *                 CEU003             Date 05Nov97               *
     A*                 CDL002             Date 18Sep97               *
     A*                 CAC001             Date 01Feb96               *
     A*                 S01486             Date 11Aug94               *
     A*                 58933              Date 26Jan93               *
     A*                 B08275             Date 25Oct91               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  CDL099 - Split Value Date (Recompile)                        *
      *  CGL165 - Dual Withholding Tax (Recompile)                    *
      *  CDL096 - Business Day Conventions on MM Deals                *
      *           (Recompile)                                         *
      *  CDL094 - Enhance  Receive Settlement Instructions (Recompile)*
      *  CTI006 - Trade Finance BF Midas 2.2 Interface (Recompile)    *
      *  CSW212 - SWIFT 2012 Changes (Recompile)                      *
      *  CRE073 - Interest Rate Rounding (Recompile)                  *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER054 - German Features - Church Tax (Recompile)            *
      *  CER048 - German Features - Taxes (Recompile)                 *
      *  CER020 - Enhanced Rollover Window: Upgrade FGE089 to         *
      *           Midas Plus (Recompile)                              *
      *  CER043 - German Features LF041-00 New Fields and Defaulting  *
      *           (Recompile)                                         *
      *  CDL049 - Addition of a Reference Rate field (recompile)      *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  233324 - Add new fields in DEALSDC for EU Tax (Recompile).   *
      *  CAS009 - Effective Interest Rate/Amortised Cost Accounting   *
      *           (Recompile)                                         *
      *  CDL038 - Extended Deal Sub Type (Recompile)                  *
      *  CDL033 - Floating Rate CDs Issued (Recompile)                *
      *  CAS008 - IAS 39 Enhancements (Recompile)                     *
      *  BUG3644 - Serious Error in Collateralised Lending (Recompile)*
      *  CGL014 - Collaterals Processing (Recompile)                  *
      *  CDL019 - Allow Base Rate Changes on Fixed Deposits/Loans     *
      *           (Recompile)                                         *
      *  CDL018 - Multiple Settlement Accounts on Loans/Deposit       *
      *           (Recompile)                                         *
      *  CDL017 - Penalty Fee & Early Maturity of Fixed Term Loan/Dep *
      *           (Recompile)                                         *
      *  CDL016 - Automatic Rollover of Fixed Term Loan/Deposit       *
      *           (Recompile)                                         *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
      *  CAS005 - Enhancements to CAS001, CAS002 and CAS004           *
      *           (Recompile)                                         *
      *  CAS004 - Hedge Accounting Phase A (Recompile)                *
      *  CAS001 - Net Present Value (NPV) Accounting                  *
      *           (Recompile)                                         *
      *  CDL008 - Continuous Linked Settlement (Recompiled)           *
     A*  CAP051 - Automatic Authorisation (MM and FX Part)            *
     A*           Recompiled due to changes in DEALSDC and DEALSDB    *
     A*  CDL007 - Deposit Breakdown Penalty                           *
     A*           Recompiled due to changes in DEALSDC                *
     A*  CPB001 - Meridian DBA Middleware Replication Customization.  *
     A*           Recompiled due to changes in DEALSDB and DEALSDC.   *
     A*  CGL011 - Collateral Processing for Midas. Recompile.         *
     A*  CDL006 - Dealing Fiduciary. Recompiled.                      *
     A*  CEU015 - EMU Enhanced MM Rollover (Recompile)                *
     A*  CEU003 - EMU Dealing Settlement Ccy Conversion (Recompile)   *
     A*  CDL002 - FX Netting - Recompiled Only.                       *
     A*  CAC001 - Profit Centre Accounting Development:               *
     A*           Recompiled only.                                    *
     A*  S01486 - Portfolio Management Upgrade to R10.                *
     A*  58933  - REMOVING PORTFOLIO REFERENCE FOR FRA/IRS TRANS.     *
     A*  B08275 - RECORD ID ADDED TO KEY                              *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A*
     A          R DEALSDBF                  PFILE(DEALSDB)
     A**************                                 Begin /S01486/
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A**************                                 End   /S01486/
     A          K CNUM
     A          K PTFR
     A*>> B08275 >>
     A          K RECI
     A*<< B08275 <<
     A          K DLNO
     A          S PTFR                      COMP(NE ' ')
     A            RECI                      COMP(EQ 'D')
     A          O                           ALL
     A*
     A          R DEALSDCF                  PFILE(DEALSDC)
     A          K CNUM
     A          K PTFR
     A* >> B08275 >>
     A          K RECI
     A* << B08275 <<
     A          K DLNO
     A          S PTFR                      COMP(NE ' ')
     A            RECI                      COMP(EQ 'D')
     A          O                           ALL
     A*
     A*                                   Start of fix     /*58933 */
     A*         R DEALSDGF                  PFILE(DEALSDG)
     A*         K CNUM
     A*         K PTFR
     A* >> B08275 >>
     A*         K RECI
     A* << B08275 <<
     A*         K DLNO
     A*         S PTFR                      COMP(NE ' ')
     A*           RECI                      COMP(EQ 'D')
     A*         O                           ALL
     A*
     A*                                   End   of fix     /*58933 */
