      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  DTAMBRS((PMPCAAPD (PMPCAAPD)))                               *
/*EXI *  TEXT('Midas Cash Events due to FX deals')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Management Module                          *
     A*                                                               *
     A*  LF/PMPCAAL4 - CASH EVENTS DUE TO FX DEAL                     *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      *                 CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CPM004             Date 08Feb96               *
      *                 085862             Date 15Mar95               *
     A*                 S01486             DATE 11AUG94               *
     A*                 53103              DATE 08NOV93               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits (Recompile)      *
     A*  CPM004 - Bank Portfolios (RECOMPILED)                        *
     A*  085862 - SPLIT ACCOUNTS BY BRANCH CODE - RECOMPILE           *
     A*  S01486 - Portfolio Management Upgrade to R10.                *
     A*  53103  - FILE CREATED FOR PERFORMANCE RECONCILIATION CHANGES *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A*
     A********* R PMPCAAP0                  PFILE(PMPCAAPP)
     A          R PMPCAAP0                  PFILE(PMPCAAPD)
     A**************                                 Begin /S01486/
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A**************                                 End   /S01486/
     A          K QSCNUM
     A          K QSPTFR
     A          K QSCSHD                    DESCEND
     A*****************************************************************
     A          S QSPFMC                    COMP(EQ 'XT')
