      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_IM                                                        *
/*EXI *  TEXT('Midas PM Performance analysis by transaction')         *
      *                                              Begin /S01486/   *
/*E*I****MBR(*FILE)*DTAMBRS((PMPTRAPP*(PMPTRAPP)))*********************                       CPK009
/*EXI *  MBR(*FILE) DTAMBRS((PMPTRAPD (PMPTRAPD)))                    *                       CPK009
      *                                              End   /S01486/   *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Management Module                      *
     A*                                                               *
     A*  LF/PMPTRALL - PERFORMANCE ANALYSIS BY TRANSACTION            *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      *  Last Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CPK009             Date 19Sep99               *
     A*                 075998             Date 19NOV95               *
     A*                 S01486             DATE 11AUG94               *
     A*                 72242              DATE 15JUN94               *
     A*                 53103              DATE  9NOV93               *
     A*                 049421             DATE 07JAN92               *
     A*                 50406              DATE 01FEB93               *
     A*                 S01313             DATE 27/04/92              *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  CLE148 - Alpha Loan Reference (Recompile)                    *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*  CPK009 - Creation parameters did not change when S01486      *
     A*           changed the name of the referenced PF.              *
     A*  075998 - RECOMPILED FOR FF/PM PERFORMANCE INTERFACE          *
     A*  S01486 - Portfolio Management Upgrade to R10.                *
     A*  72242  - SELECT ONLY NON-DELETED PERFORMANCE EVENTS          *
     A*  53103  - SELECT ONLY RECS WITH NONZERO TRANS. AMOUNT         *
     A*  049421 - HEADER BOX STANDARDISATION                          *
     A*  50406  - RECOMPILED                                          *
     A*  S01313 - CREATED FOR PORTFOLIO PERFORMANCE                   *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
      *                                              Begin /S01486/
     A********* R PMPTRAP0                  PFILE(PMPTRAPP)
     A          R PMPTRAP0                  PFILE(PMPTRAPD)
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*******                               TEXT('(c)BIS BANKING +
     A*******                               SYSTEMS INTERNATIONAL +
     A*******                               LTD.1993')
      *                                              End   /S01486/
     A*
     A          K QUCNUM
     A          K QUPTFR
     A          K QUMODI
     A          K QUTDSS
     A          K QUTRNB
     A          K QUPDAT
     A          K QUTTYP
     A          K QUPFMC
     A*                                              Begin /53103 /
     A***START 72242***
     A****      S QUTAMT                    COMP(NE 0)
     A          S QUCHTP                    COMP(NE 'D')
     A***END 72242***
     A*                                              End   /53103 /
