      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas RE Effective Date Dataarea layout file')         *
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  PF/EFDT34 - Effective Date Dataarea Layout File              *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD055663           Date 23May20               *
      *  Prev Amend No. NNNNNN  *CREATE    Date DDMmmYY               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD055663 - Change start date and end date of capitalisation  *
      *             period for interest type 3 and 4.                 *
      *                                                               *
      *****************************************************************
     A          R @EFDT34                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            RCEFDT         7          TEXT('Effective Date')
     A                                      COLHDG('Effective' +
     A                                             'Date')
     A            RCEFNB         5S 0       TEXT('Effective Date in +
     A                                            Midas')
     A                                      COLHDG('Effective Date' +
     A                                             'In Midas Date')
     A*=====================================================================
