      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas RE Referral and Excess Rpt Extr DTAQ Layout')    *
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  PF/RAERESERVE - Midas RE Referral and Excess Report Extract  *
      *                  DTAQ Layout                                  *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2012            *
      *                                                               *
      *  Last Amend No. CRE083BU *CREATE   Date 06Aug12               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CRE083BU - COB Restructure - RE COB Optimisation Phase 1     *
      *                                                               *
      *****************************************************************
      *
     A          R RAEREF                    TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2012')
     A            FILLER        50          TEXT('Filler')
      *
