/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas ABCONUP_xx Lock Data Area Layout')
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      *  PF/REABCJLCK - ABCONUP_xx Lock Data Area Layout              *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2010            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      *  Last Amend No. CAP205  *CREATE    Date 15Feb10               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CAP205 - Teller Related APIs - Account Balance Check         *
      *                                                               *
      *****************************************************************
     A          R REABCLD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. 2010')
     A            LOCK           1A         TEXT('Lock')
     A                                      COLHDG('Lock')
