      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_NMSN                                                      *
/*EXI *  TEXT('Midas MC Todays Opening Balance')                      *
/********EXS *  PF_SN                                                 *                   /*231735*/
      *****************************************************************
      *                                                               *
      *  Midas - Management Accounts module                           *
      *                                                               *
      *  PF/MCWORKX2 - Todays Opening Balance                         *
      *                                                               *
      ***(C)*Copyright*Misys*International*Banking*Systems,*2003*******
      *  (c) Copyright Finastra Systems Technology, Inc. 2020         *                       EML108
      *                                                               *
      *  Last Amend No. EML108             Date 13Jan20               *
      *  Prev Amend No. UMD001             Date 07Jan09               *
      *                 231735             Date 24Feb05               *
      *                 FMD003             Date 12Oct03               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *    EML108 - Upgrade FMD003 and 231735 to FBM2.1 SP21          *
      *    UMD001 - Upgrade FMD003 to Midas Plus 1.2.1 SP19           *
      *    231735 - Separate GE-XB postings update and Average        *
      *             Balance calculation                               *
      *    FMD003 - Automatic Balance Update                          *
      *                                                               *
      *****************************************************************
      **Start of change EML108
     A**********R MCWORKD2                  TEXT('(C) Copyright MKI -                         EML108
     A**********                            Intl Ltd 2003')                                   EML108
     A          R MCWORKD2                  TEXT('(c) Copyright Finastra +
     A                                      Systems Technoly, Inc. 2020')
      **End of change EML108
      *---------------------------------------------------------------------
     A            M2CGCD         2          TEXT('Control Group Code')
     A                                      COLHDG('Control' +
     A                                             'Group Code')
     A            M2BRCA         3          TEXT('Branch code')
     A                                      COLHDG('Branch' +
     A                                             'code')
     A            M2CNUM         6          TEXT('Customer number')
     A                                      COLHDG('Customer' +
     A                                             'number')
     A            M2CCY          3          TEXT('Currency code')
     A                                      COLHDG('Curr' +
     A                                             'Code')
      **Start of change EML108
     A**********  M2ACOD         4          TEXT('Account code')                              EML108
     A            M2ACOD        10          TEXT('Account code')
      **End of change EML108
     A                                      COLHDG('Account' +
     A                                             'code')
     A            M2ACSQ         2          TEXT('Account sequence number')
     A                                      COLHDG('A/c' +
     A                                             'Seq' +
     A                                             'No.')
     A            M2TDOB        19  0       TEXT('Today''s Opening Balance')
     A                                      COLHDG('Today''s Opening' +
     A                                             'Balance')
      *=====================================================================
