000100210908      *****************************************************************
000101210908/*STD *  PFBASE                                                       *
000102210908/*EXS *  PF_STD                                                       *
000103210908      *****************************************************************
000104210908      *                                                               *
000105210908      *  Midas - General Ledger Module                                *
000106210908      *                                                               *
000107210908      *  PF/TAB001TD - TAB001 FILE COPY FOR UPLOAD TO XXACHOMTD       *
000108210908      *                                                               *
000109210908      *  (c) Finastra International Systems Ltd 2021                  *
000110210908      *                                                               *
000111210908      *  Last Amend No. DRI005  *CREATE    Date 13Apr21               *
000112210908      *                                                               *
000113210908      *****************************************************************
000114210908      *                                                               *
000115210908      *  DRI005 - HO and EDW Extracts                                 *
000116210908      *                                                               *
000117210908      *****************************************************************
000118210908      *
000119210908     A          R TAB001D0                  TEXT('(c) Finastra International -
000120210908     A                                      Systems 2021')
000121210908      *
000122210908     A            ACODE          4  0       TEXT('Midas A/C')
000123210908     A            DLTYP          2          TEXT('Deal Type')
000124210908     A            DLSTYP         2          TEXT('Deal Sub Type')
000125210908     A            ACTION         2  0       TEXT('Action')
000126210908     A            BUNIT1         4          TEXT('B Unit 1')
000127210908     A            ACODE1         5  0       TEXT('HO A/C')
000128210908     A            PRCODE1        4          TEXT('HO Product Code')
000129210908     A            MKCODE1        3          TEXT('HO Market Code')
000130210908     A            BUNIT2         4          TEXT('B Unit 2')
000131210908     A            ACODE2         5  0       TEXT('HO A/C 2')
000132210908     A            PRCODE2        4          TEXT('HO Product Code 2')
000133210908     A            MKCODE2        3          TEXT('HO Market Code 2')
000134210908     A            RBUNIT1        4          TEXT('R B Unit 1')
000135210908     A            RACODE1        5  0       TEXT('R A Code 1')
000136210908     A            RPRCODE1       4          TEXT('R Product Code 1')
000137210908     A            RMKCODE1       3          TEXT('R Market Code 1')
000138210908     A            RBUNIT2        4          TEXT('R B Unit 2')
000139210908     A            RACODE2        5  0       TEXT('R A Code 2')
000140210908     A            RPRCODE2       4          TEXT('R Product Code 2')
000141210908     A            RMKCODE2       3          TEXT('R Market Code 2')
000142210908     A            RBUNIT3        4          TEXT('R B Unit 3')
000143210908     A            RACODE3        5  0       TEXT('R A Code 3')
000144210908     A            RPRCODE3       4          TEXT('R Product Code 3')
000145210908     A            RMKCODE3       3          TEXT('R Market Code 3')
000146210908      *****************************************************************
