      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GL Account Movements - copy for JMI022')         *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      ***PF/GLACMTPD*-*Account*Movements*-*Copy*for*JMI022*************                       JMI112
      *  PF/XXACMTPD - Account Movements - Copy for JMI112            *                       JMI112
      *                                                               *
      ***(c)*Misys*International*Banking*Systems*Ltd.*2006*************                       JMI112
      *  (c) Finastra International Limited 2018                      *                       JMI112
      *                                                               *
      *  Last Amend No. JMI112             Date 24May18               *
      *  Prev Amend No. CGL086  *CREATE    Date 31Jan07               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  JMI112 - Midas-Opics Data Transfer Amendments. Upgrade to    *
      *           FBM 2.1                                             *
      *  CGL086 - Midas-Opics Data Transfer Amendments                *
      *                                                               *
      *****************************************************************
      *
      ** Start of JMI112
     A**********                            REF(MFRFL)
     A**********R GLACMTD0
     A**********                            TEXT('(c) Misys International +
     A**********                            Banking Systems Ltd. +
     A**********                            2006')
     A*
     A**********  CUSN      R
     A**********  CCYD      R
     A**********  ACDEQQ    R               REFFLD(ACODQQ)
     A**********  ASNC      R
     A**********  BRCA      R
     A**********  PTDT      R
     A**********  VUDT      R
     A**********  TRYP      R
     A**********  NRTC      R               REFFLD(NARC1)
     A**********  NRTD      R
     A**********  TNMR      R
     A**********  CQNR      R
     A**********  MVAM      R
     A**********  DORC      R
      *
     A          R XXACMTD0
     A                                      TEXT('(C) Finastra Internatio +
     A                                      nal Limited 2018')
      *
     A            CUSN           6A         TEXT('Customer Number')
     A                                      COLHDG('Customer' +
     A                                      'Number')
     A            CCYD           3A         TEXT('Currency Code')
     A                                      COLHDG('Curr' +
     A                                      'Code')
     A            ACDEQQ         4S 0       TEXT('Old Account Code')
     A                                      COLHDG('Old Account' +
     A                                      'Code')
     A            ASNC           2S 0       TEXT('Account Sequence')
     A                                      COLHDG('Accnt' +
     A                                      'Seq.')
     A            BRCA           3A         TEXT('Branch Code')
     A                                      COLHDG('Branch' +
     A                                      'Code')
     A            PTDT           5S 0       TEXT('Posting Date')
     A                                      COLHDG('Posting' +
     A                                      'Date')
     A            VUDT           5S 0       TEXT('Value Date')
     A                                      COLHDG('Value' +
     A                                      'Date')
     A            TRYP           2A         TEXT('Transaction Type')
     A                                      COLHDG('Transact' +
     A                                      'Type')
     A            NRTC           2A         TEXT('Narrative Code')
     A                                      COLHDG('Narr' +
     A                                      'Code')
     A            NRTD          30A         TEXT('Narrative Description')
     A                                      COLHDG('Narr' +
     A                                      'Desc')
     A            TNMR           6A         TEXT('Transaction Number')
     A                                      COLHDG('Transact' +
     A                                      'No.')
     A            CQNR           8S 0       TEXT('Cheque Number')
     A                                      COLHDG('Cheque' +
     A                                      'No.')
     A            MVAM          15S 0       TEXT('Movement Amount')
     A                                      COLHDG('Movement' +
     A                                      'Amount')
     A            DORC           1S 0       TEXT('Debit or Credit')
     A                                      COLHDG('Debit' +
     A                                      'Credit')
      ** End of JMI112
      *
     A            FUNDQQ        15A
      *
      ** Start of JMI112
     A**********  TBID      R
     A**********  APBI      R               REFFLD(IND)
     A**********                            TEXT('Appeared On Passbook Ind.')
     A**********                            COLHDG('PAS' +
     A**********                                   'BK' +
     A**********                                   'IND')
     A**********  PASS      R               REFFLD(PBTT)
     A**********                            TEXT('Passbook Transaction Type')
     A**********                            COLHDG('PAS' +
     A**********                                   'BOOK' +
     A**********                                   'TYPE')
     A**********  XRFI      R               REFFLD(MNTH)
     A**********                            TEXT('Extension File Reference ID')
     A**********                            COLHDG('Extension' +
     A**********                                   'File' +
     A**********                                   'Reference ID')
     A**********  XRFN      R               REFFLD(CHRN)
     A**********                            TEXT('Extension File Reference No.')
     A**********                            COLHDG('Extension' +
     A**********                                   'File' +
     A**********                                   'Reference Number')
     A**********  ACDE      R               REFFLD(ACOD)
      *
     A            TBID           3A         TEXT('Teller ID/Batch No.')
     A                                      COLHDG('Teller ID' +
     A                                             'Batch No.')
     A            APBI           1A         TEXT('Appeared On Passbook Ind.')
     A                                      COLHDG('PAS' +
     A                                             'BK' +
     A                                             'IND')
     A            PASS           2A         TEXT('Passbook Transaction Type')
     A                                      COLHDG('PAS' +
     A                                             'BOOK' +
     A                                             'TYPE')
     A            XRFI           3A         TEXT('Extension File Reference ID')
     A                                      COLHDG('Extension' +
     A                                             'File' +
     A                                             'Reference ID')
     A            XRFN          10S 0       TEXT('Extension File Reference No.')
     A                                      COLHDG('Extension' +
     A                                             'File' +
     A                                             'Reference Number')
     A            ACDE          10S 0       TEXT('Account Code')
     A                                      COLHDG('Account' +
     A                                      'Code')
      *
      ** End of JMI112
      *
     A            FUND          21A
