      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MG Back up GCMS processed MT101 files')          *
      *****************************************************************
      *                                                               *
      *  Midas - Message Generation                                   *
      *                                                               *
      ***PF/MGG101BK*-*MG GCMS Back up GCMS processed MT101 file*******                   JMI113
      *  PF/XXG101BK - MG GCMS Back up GCMS processed MT101 file      *                   JMI113
      *                                                               *
      ***(c)*Misys*International*Banking*Systems*Ltd.*2007*************                   JMI113
      *  (c) Finastra International Limited 2018                      *                   JMI113
      *                                                               *
      *  Last Amend No. JMI113             Date 22May18               *
      *  Last Amend No. JMI019  *CREATE    Date 02Feb07               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  JMI019 - Midas GCMS Interface. Upgrade to FBM 2.1            *
      *  JMI019 - Midas GCMS Interface                                *
      *                                                               *
      *****************************************************************
      ** Start of JMI113
     A**********                            REF(MFRFL)
      *
     A**********R MGG101D0                  TEXT('(c) Misys International +
     A**********                            Banking Systems Ltd. +
     A**********                            2007')
     A          R XXG101D0                  TEXT('(c) Finastra Internation+
     A                                      al Limited 2018')
      ** End of JMI113
      *
     A            J0REF#        20A         TEXT('GCMS Reference No.')
     A                                      COLHDG('GCMS Reference No.')
     A            J0PRDT         5  0       TEXT('Processed Date')
     A                                      COLHDG('Processed' +
     A                                             'Date')
      ** Start of JMI113
     A************J0PTIM    R     P         TEXT('Processed Time')
     A************                          COLHDG('Processed' +
     A************                                 'Time')
     A************                          REFFLD(MTIME)
     A            J0PTIM         6P 0       TEXT('Processed Time')
     A                                      COLHDG('Processed' +
     A                                             'Time')
      ** End of JMI113
