      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('GCMS MT940/MT942 FTP Input file')                      *
      *****************************************************************
      *                                                               *
      *  Midas - Midas-GCMS Interface Module                          *
      *                                                               *
      ***PF/GLG94IPD*-*GCMS*MT940/MT942*FTP*Input*File*****************                   JMI113
      *  PF/XXG94IPD - GCMS MT940/MT942 FTP Input File                *                   JMI113
      *                                                               *
      ***(c)*Misys*International*Banking*Systems*Ltd.*2006*************                   JMI113
      *  (c) Finastra International Limited 2018                      *                   JMI113
      *                                                               *
      *  Last Amend No. JMI113             Date 17May18               *
      *  Prev Amend No. JMI019             Date 06Sep07               *
      *                 JMI019  *CREATE    Date 19Dec06               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  JMI113 - Midas GCMS Interface. Upgrade to FBM 2.1            *
      *  JMI019 - Additional codes to upgrade                         *
      *  JMI019 - Midas-GCMS Interface                                *
      *                                                               *
      *****************************************************************
      *
      ** Start of JMI113
     A**********                            REF(MFRFL)
     A**********R GLGOIND0                  TEXT('(c) Misys International +
     A**********                            Banking Systems Ltd. +
     A**********                            2006')
     A          R XXGOIND0                  TEXT('(c) Finastra Internation+
     A                                      al Limited 2018')
      ** End of JMI113
      *
      ** Start of JMI113
     A**********  GWFTPI    R               REFFLD(DSTR)
     A            GWFTPI       128A
      ** End of JMI113
      *
     A                                      TEXT('FTP Instructions')
     A                                      COLHDG('FTP Instructions')
