      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MG back up GCMS message index file')             *
      *****************************************************************
      *                                                               *
      *  Midas - Message Generation                                   *
      *                                                               *
      ***PF/MGGCMXPD*-*MG GCMS Message Index file**********************                   JMI113
      *  PF/XXGCMXBK - MG GCMS Message Index file                     *                   JMI113
      *                                                               *
      ***(c)*Misys*International*Banking*Systems*Ltd.*2007*************                   JMI113
      *  (c) Finastra International Limited 2018                      *                   JMI113
      *                                                               *
      *  Last Amend No. JMI113             Date 22May18               *
      *  Last Amend No. JMI019  *CREATE    Date 02Feb07               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  JMI113 - Midas GCMS Interface. Upgrade to FBM 2.1            *
      *  JMI019 - Midas GCMS Interface                                *
      *                                                               *
      *****************************************************************
      ** Start of JMI113
     A**********                            REF(MFRFL)
      *
     A**********R MGGCMXD0                  TEXT('(c) Misys International +
     A**********                            Banking Systems Ltd. +
     A**********                            2007')
     A          R XXGCMXD0                  TEXT('(c) Finastra Internation+
     A                                      al Limited 2018')
      ** End of JMI113
      *
     A            J0MTPY         3A         TEXT('Message Type')
     A                                      COLHDG('Message Type')
     A            J0BRCA         3A         TEXT('Branch Code - Alpha')
     A                                      COLHDG('Branch Code - Alpha')
     A            J0MPRY         1A         TEXT('Message Priority')
     A                                      COLHDG('Message Priority')
     A            J0MODE         8S 0       TEXT('Message Date')
     A                                      COLHDG('Message Date')
     A            J0MOTM         6S 0       TEXT('Message Time')
     A                                      COLHDG('Message Time')
     A            J0MIRF        28A         TEXT('Message Input Reference')
     A                                      COLHDG('Message Input ' +
     A                                      'Reference')
     A            J0MOR         28A         TEXT('Message Output Reference')
     A                                      COLHDG('Message Output ' +
     A                                      'Reference')
     A            J0IMPF         1A         TEXT('Incoming Msg Processed Flag')
     A                                      COLHDG('Incoming Message ' +
     A                                      'Processed Flag')
