      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas Inter-Office A/C Retail Capitalisation Dtls')    *
      *****************************************************************
      *                                                               *
      *  Midas - Retail Module                                        *
      *                                                               *
      ***PF/REIORCPP*-*Midas*RE*Inter-Office A/C Retail****************         JMI108
      *  PF/XXIORCPP - Midas RE Inter-Office A/C Retail               *         JMI108
      *                Capitalisation Details                         *
      *                                                               *
      ***(c)*Misys*International*Banking*Systems*Ltd.*2007*************         JMI108
      *  (c) Finastra International Limited 2018                      *         JMI108
      *                                                               *
      *  Last Amend No. JMI108             Date 31May18               *
      *  Prev Amend No. TFJ11B  *CREATE    Date 17Jan07               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  JMI108 - Account Balance Pooling. Upgrade to FBM 2.1         *
      *  TFJ11B - Retail Interest Capitalisation Date Change Utility  *
      *                                                               *
      *****************************************************************
      ** Start of JMI108
     A*********                             REF(MFRFL)
     A********* R REIORCD0                  TEXT('(c) Misys International +
     A*********                             Banking Systems Ltd. +
     A*********                             2007')
     A          R XXIORCD0                  TEXT('(c) Finastra Internation+
     A                                      al Limited 2018')
      ** End of JMI108
      *---------------------------------------------------------------------
     A            JBRCA          3A         TEXT('Branch')
     A                                      COLHDG('Branch')
      ** Start of JMI108
     A********    JCNUM          6  0       TEXT('Customer Number')
     A            JCNUM          6A         TEXT('Customer Number')
      ** End of JMI108
     A                                      COLHDG('Customer Number')
     A            JCCY           3A         TEXT('Currency')
     A                                      COLHDG('Currency')
     A            JACOD         10  0       TEXT('Account Code')
     A                                      COLHDG('Account Code')
     A            JACSQ          2  0       TEXT('Account Seq')
     A                                      COLHDG('Account Seq')
     A            JACNO         10  0       TEXT('Retail A/C Num')
     A                                      COLHDG('Retail A/C Num')
     A            JANAM         20A         TEXT('Account Name')
     A                                      COLHDG('Account Name')
     A            JNDIDB         5  0       TEXT('Next Dr Int Day Before')
     A                                      COLHDG('Next Dr Int'  +
     A                                             'Day Before')
     A            JNDIDA         5  0       TEXT('Next Dr Int Day After')
     A                                      COLHDG('Next Dr Int'  +
     A                                             'Day After')
     A            JNCIDB         5  0       TEXT('Next Cr Int Day Before')
     A                                      COLHDG('Next Cr Int'  +
     A                                             'Day Before')
     A            JNCIDA         5  0       TEXT('Next Cr Int Day After')
     A                                      COLHDG('Next Cr Int'  +
     A                                             'Day After')
