      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas Account Pooling FTP Manual Input file')          *
      *****************************************************************
      *                                                               *
      *  Midas - General Ledger Module                                *
      *                                                               *
      ***PF/GLPMINPP*-*Midas*Account Pooling FTP Manual Input file*****         EML110
      *  PF/XXPMINPP - Midas Account Pooling FTP Manual Input file    *         EML110
      *                                                               *
      ***(c)*Misys*International*Banking*Systems*Ltd.*2007*************         EML110
      *  (c) Finastra International Limited 2018                      *         EML110
      *                                                               *
      *  Last Amend No. EML110             Date 20Jan20               *
      *  Prev Amend No. TFJ011  *CREATE    Date 29Jan07               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  EML110 - Account Balance Pooling. Upgrade to FBM 2.1         *
      *  TFJ011 - Account Balance Pooling                             *
      *                                                               *
      *****************************************************************
      ** Start of EML110
     A*********                             REF(MFRFL)
     A********* R GLPMIND0                  TEXT('(c) Misys International +
     A*********                             Banking Systems Ltd. +
     A*********                             2007')
     A          R XXPMIND0                  TEXT('(c) Finastra Internation+
     A                                      al Limited 2018')
      ** End of EML110
      *---------------------------------------------------------------------
      ** Start of EML110
     A*********** JMIDTA    R               REFFLD(DSTR)
     A            JMIDTA       128A
      ** End of EML110
     A                                      TEXT('FTP Instructions')
     A                                      COLHDG('FTP Instructions')
