      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas Portfolio Performance By Acc Off    QYRF')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Management Module                      *
     A*                                                               *
     A*  PF/PMAOPEQ0 - PORTFOLIO PERFORMANCE BY ACCOUNT OFFICER       *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  Prev Amend No. S01486             Date 11AUG94               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*  S01486 - Portfolio Management Upgrade to R10.                *
     A*                                                               *
     A*****************************************************************
     A*           C R E A T I O N     P A R A M E T E R S             *
     A*
     A*****************************************************************
     A                                      REF(MFRFL)
     A***********                                    Begin /S01486/
     A          R PMPERFP0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A***********                                    End   /S01486/
     A*                                              BEGIN /S01486/
     A**********  RFACOC         2A         TEXT('ACCOUNT OFFICER CODE')  S01486
     A**********  RFCNUM         6  0       TEXT('CUSTOMER NUMBER')       S01486
     A**********  RFPTFR         4A         TEXT('PORTFOLIO REFERENCE')   S01486
     A**********  RFPFMP         1A         TEXT('PERFORMANCE PERIOD')    S01486
     A**********  RFPFMC         3A         TEXT('PERFORMANCE CATEGORY')  S01486
     A**********  RFPFMA        13P 0       TEXT('PERFORMANCE AMOUNT')    S01486
     A*
     A**********  AZDPCD         3          TEXT('DEPT CODE')             S01486
     A**********  AZACON        30          TEXT('ACCOUNT OFFICER NAME')  S01486
     A*
     A**********  AEDPCD         3          TEXT('DEPARTMENT CODE')       S01486
     A**********  AEDPNM        30          TEXT('DEPARTMENT NAME')       S01486
     A**********  AEPRTL         3          TEXT('PRINTER LOCATION CODE') S01486
     A            RFACOC    R               REFFLD(ACOC)
      * Begin /CSD027/
     A**********  RFCNUM    R               REFFLD(CNUM)                                      CSD027
     A            RFCNUM         6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            RFPTFR    R               REFFLD(PTFR)
     A            RFPFMP    R               REFFLD(PFMP)
     A            RFPFMC    R               REFFLD(PFMC)
     A            RFPFMA    R               REFFLD(PFMA)
     A            AZDPCD    R               REFFLD(DPCD)
     A            AZACON    R               REFFLD(ACON)
     A            AEDPCD    R               REFFLD(DPCD)
     A            AEDPNM    R               REFFLD(DPNM)
     A            AEPRTL    R               REFFLD(PRTL)
     A*                                              END   /S01486/
