      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas Forward Portfolio Positions Trailer   PV')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Management Module                      *
     A*                                                               *
     A*  PF/PMFPOSPA - PM FORWARD PORTFOLIO POSITIONS TRAILER         *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. S01486             Date 11Aug94               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     A*  S01486 - Portfolio Management Upgrade to R10.                *
     A*                                                               *
     A*****************************************************************
     A*           C R E A T I O N     P A R A M E T E R S             *
     A*
     A*****************************************************************
     A                                      REF(MFRFL)
      *                                              Begin /S01486/
     A**********R*PMFPOSZ0
     A          R PMFPOSZ0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            PVRECI    R               REFFLD(RECI)
     A            PVNORE    R               REFFLD(NORE)
     A*********** PVRECI         1A
     A***********                           COLHDG('Rec' +
     A***********                           'Id')
     A***********                           TEXT('Record Id')
     A*********** PVNORE         5  0
     A***********                           COLHDG('No of' +
     A***********                           'Records' +
     A***********                           'On file')
     A***********                           TEXT('Number of records on fi+
     A***********                           le')
     A***********                           EDTCDE(L )
      *                                              End   /S01486/
