      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas PM Instrument/Currency Asset Liab work file')
      *****************************************************************
      *                                                               *
      *  Midas - Portfolio Management Module                          *
      *                                                               *
      *  PF/PMICALQ0 - PM Instrument/Currency Asset Liability         *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CPM005             Date 11JUN96               *
      *                 S01124             Date 11JUN96               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CPM005 - Private Banking Phase 2                             *
      *           Focus Group Changes upgraded to DBA                 *
      *  S01124 - PBFG/7 - NET COMMITMENT BY CURRENCY                 *
      *           PBFG/8 - DISPLAY POSITIONS SPLIT BY CURRENCY        *
      *                                                               *
      *****************************************************************
     A*
     A*                                              Begin /CPM005/
     A**********R PMICALD0
     A***********
     A*********** ICRECI         1          TEXT('Record Identification')
     A*********** ICCNUM         6S 0       TEXT('Customer Number')
     A*********** ICPTFR         4          TEXT('Portfolio Reference')
     A*********** ICPOTY         2          TEXT('Position Type')
     A*********** ICTOTT         1          TEXT('Total Type')
     A*********** ICINSC         3          TEXT('Instrument Code')
     A*********** ICINDS         2S 0       TEXT('Instrument Display Sequence')
     A*********** ICCURR         3          TEXT('Currency')
     A*********** ICDGRC         3          TEXT('Display Group Code')
     A*********** ICDGRS         2S 0       TEXT('Display Group Sequence')
     A*********** ICASVL        15P 0       TEXT('Asset Value')
     A*********** ICLIVL        15P 0       TEXT('Liability Value')
     A                                      REF(MFRFL)
     A          R PMICALD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            ICRECI    R               REFFLD(RECI)
      * Begin /CSD027/
     A**********  ICCNUM    R               REFFLD(CNUM)                                      CSD027
     A            ICCNUM         6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            ICPTFR    R               REFFLD(PTFR)
     A            ICPOTY    R               REFFLD(PTFT)
     A                                      TEXT('Position Type')
     A                                      COLHDG('Pos Type')
     A            ICTOTT    R               REFFLD(ERTE)
     A                                      TEXT('Total Type')
     A                                      COLHDG('Tot Type')
     A            ICINSC    R               REFFLD(INNR)
     A            ICINDS    R               REFFLD(ITDS)
     A            ICCURR    R               REFFLD(CCY)
     A            ICDGRC    R               REFFLD(DSPG)
     A            ICDGRS    R               REFFLD(DSPS)
     A            ICASVL    R               REFFLD(PVNA)
     A                                      TEXT('Asset Value')
     A                                      COLHDG('Asst Val')
     A            ICLIVL    R               REFFLD(PVMV)
     A                                      TEXT('Liability Value')
     A                                      COLHDG('Liab Val')
     A*                                              End   /CPM005/
