      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_NM                                                        *
/*EXI *  TEXT('Midas PM Industry Totals                    QI')       *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Management Module                          *
     A*                                                               *
     A*  PF/PMINDTPD - PM INDUSTRY TOTALS                             *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CER059             Date 19Jul10               *
      *                 CER020             Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027             Date 05Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CCG009             Date 01JUN95               *
     A*                 S01486             Date 11AUG94               *
     A*                 B08040             DATE 10JUL91               *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER020 - Enhanced Rollover Window: Upgrade FGE089            *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
     A*  CCG009 - Private Banking UDC                                 *
     A*  S01486 - Portfolio Management Upgrade to R10.                *
     A*  B08040 - SUNDRY FIXES TO SPEED UP COB                        *
     A*                                                               *
     A*****************************************************************
     A*           C R E A T I O N     P A R A M E T E R S             *
     A*
     A*****************************************************************
     A                                      REF(MFRFL)
      *                                              Begin /S01486/
     A**********R*PMINDTP0
     A          R PMINDTP0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A***B08040***QIRECI    R               REFFLD(RECI)
      * Begin /CSD027/
     A**********  QICNUM    R               REFFLD(CNUM)                                      CSD027
     A            QICNUM         6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            QIPTFR    R               REFFLD(PTFR)
     A            QILIND    R               REFFLD(LIND)
     A            QIPTPA    R               REFFLD(PTPA)
     A            QIPTNA    R               REFFLD(PTNA)
     A            QIPTMV    R               REFFLD(PTMV)
     A            QIPVPA    R               REFFLD(PVPA)
     A            QIPVNA    R               REFFLD(PVNA)
     A            QIPVMV    R               REFFLD(PVMV)
     A            QIPTAI    R               REFFLD(PTAI)
     A*                                            /*CCG009*/
     A            QIPTNI    R               REFFLD(PTNI)
     A*                                            /*CCG009*/
     A***B08040***QIPVAI    R               REFFLD(PTAI)
      *                                              End   /S01486/
      **Start of change CER020
     A            QILOIC    R               REFFLD(FTAG)
     A                                      TEXT('Local Industry Code +
     A                                           - Alpha')
     A                                      COLHDG('Local Ind' +
     A                                             'Code')
      **End of change CER020
     A*
     A          K QICNUM
     A          K QIPTFR
      **Start of change CER020
     A**********K QILIND                                                                      CER020
     A          K QILOIC
      **End of change CER020
