      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas Transaction report control audit file SA')       *
     A*****************************************************************
     A*                                                               *
     A*  Midas - Portfolio Management Module                          *
     A*                                                               *
     A*  PF/PMTRCNPD - PM TRANSACTION REPORT CONTROL AUDIT FILE       *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027             Date 05Dec05               *
      *                 CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CPM004             Date 08Feb96               *
      *                 085867             Date 16Mar95               *
     A*                 S01486             DATE 11AUG94               *
     A*                 B9991              DATE 30SEP91               *
     A*                 R05913             DATE 30/04/91              *
     A*                 R10040             DATE 19/09/90              *
     A*                 PMC163             DATE 25/05/90              *
     A*                 PMC142             DATE 10/05/90              *
     A*                                                               *
     A*---------------------------------------------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CLE148 - Alpha Loan Reference                                *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits                  *
     A*  CPM004 - Bank Portfolios                                     *
     A*  085867 - Change Pay A/C and Rec A/C to have the branch code  *
     A*  S01486 - Portfolio Management Upgrade to R10.                *
     A*  B9991  - ADDING OF SOME FIELDS TO IMPROVE PM0400P1 REPORT    *
     A*  R05913 - OUTPUT 30A LINE 1 NARRATIVE                         *
     A*  PMC163 - OUTPUT ADDITIONAL INSTRUMENT AND ACCOUNT DETAILS    *
     A*  PMC142 - FIDUCIARY LOAN / DEPOSIT INTERFACE                  *
     A*                                                               *
     A*****************************************************************
     A*           C R E A T I O N     P A R A M E T E R S             *
     A*
     A*****************************************************************
     A                                      REF(MFRFL)
      *                                              Begin /S01486/
     A**********R*PMTRCNP0
     A          R PMTRCNP0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *                                              End   /S01486/
     A            SARECI    R               REFFLD(RECI)
     A            SAACOC    R               REFFLD(ACOC)
      * Begin /CSD027/
     A**********  SACNUM    R               REFFLD(CNUM)                                      CSD027
     A            SACNUM         6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer' +
     A                                      'Number')
      * End /CSD027/
     A*********** SARECI         1A
     A***********                           COLHDG('Rec' +
     A***********                           'Id')
     A***********                           TEXT('Record Id')
     A*********** SAACOC         2A
     A***********                           COLHDG('Acct' +
     A***********                           'Ofcr' +
     A***********                           'Code')
     A***********                           TEXT('Account officer code')
     A*********** SACNUM         6S 0
     A***********                           COLHDG('Customer' +
     A***********                           'Number')
     A***********                           TEXT('Customer number')
     A***********                           EDTCDE(X )
     A*** START PMC142 ****
      *                                              Begin /S01486/
     A*********** SABNUM         6S 0       TEXT('Borrower number')
     A*********** SAFINR         6S 0       TEXT('Fiduciary number')
     A*********** SAPOOL         2S 0       TEXT('Pooling Clients')
      * Begin /CSD027/
     A**********  SABNUM    R               REFFLD(BONR)                                      CSD027
     A            SABNUM         6A
     A                                      TEXT('Borrower number')
     A                                      COLHDG('Bor' 'Nbr')
      * End /CSD027/
     A            SAFINR    R               REFFLD(FINO)
     A            SAPOOL    R               REFFLD(POOL)
     A*********** SABNUM         6S 0
     A***********                           COLHDG('Bor' 'Nbr')
     A***********                           TEXT('Borrower number')
     A*********** SAFINR         6S 0
     A***********                           COLHDG('Fid' 'Nbr')
     A***********                           TEXT('Fiduciary number')
     A*********** SAPOOL         2S 0
     A***********                           COLHDG('Pool' 'Clt')
     A***********                           TEXT('Pooling Clients')
      *                                              End   /S01486/
     A*** END PMC142 ****
     A            SAPTFR    R               REFFLD(PTFR)
     A            SAINNR    R               REFFLD(INNR)
     A            SAMODI    R               REFFLD(MODI)
      **Start of change CLE148
     A**********  SATRNB    R               REFFLD(TRNB)                                      CLE148
     A            SATRNB         6A         TEXT('Transaction number')
     A                                      COLHDG('Trans' 'No.')
      **End of change CLE148
     A            SATRTP    R               REFFLD(TRTP)
     A            SATRST    R               REFFLD(TRST)
     A            SATDSS    R               REFFLD(TDSS)
     A            SANMDP    R               REFFLD(NMDP)
     A            SASPBS    R               REFFLD(SPBS)
     A            SASEQA    R               REFFLD(SEQA)
     A            SADDAT    R               REFFLD(DDAT)
     A            SAVDAT    R               REFFLD(VDAT)
     A            SAMDAT    R               REFFLD(MDAT)
     A**********                                                          S01486
     A**********  SABRCD    R               REFFLD(BRCD)                  S01486
     A            SABRCD    R               REFFLD(BRCA)
     A**********                                                          S01486
     A            SAAMT1    R               REFFLD(AMT1)
     A            SAAMT2    R               REFFLD(AMT2)
     A            SACCY1    R               REFFLD(CCY1)
     A            SACCY2    R               REFFLD(CCY2)
     A            SAPRC1    R               REFFLD(PRC1)
     A            SAPRC2    R               REFFLD(PRC2)
     A            SARATA    R               REFFLD(RATA)
     A            SARATB    R               REFFLD(RATB)
     A*********** SAPTFR         4A
     A***********                           COLHDG('Folio' +
     A***********                           'ref')
     A***********                           TEXT('Portfolio reference')
     A*********** SAINNR         3A
     A***********                           COLHDG('Inst' +
     A***********                           'Type')
     A***********                           TEXT('Instrument Type')
     A*********** SAMODI         2A
     A***********                           COLHDG('Mod' +
     A***********                           'Id')
     A***********                           TEXT('Module id')
     A*********** SATRNB         6S 0
     A***********                           COLHDG('Trans' +
     A***********                           'No.')
     A***********                           TEXT('Transaction number')
     A*********** SATRTP         2A
     A***********                           COLHDG('Tde' +
     A***********                           'Typ')
     A***********                           TEXT('Trade type')
     A*********** SATRST         2A
     A***********                           COLHDG('Tde' +
     A***********                           'Sub' +
     A***********                           'Typ')
     A***********                           TEXT('Trade sub-type')
     A*********** SATDSS        10A
     A***********                           COLHDG('Security' +
     A***********                           'Shortname')
     A***********                           TEXT('Security Shortname +
     A***********                              T')
     A*********** SANMDP         1  0
     A***********                           COLHDG('Nom' +
     A***********                           'dec' +
     A***********                           'plc')
     A***********                           TEXT('Nominal decimal places')
     A*********** SASPBS         1A
     A***********                           COLHDG('Prc' +
     A***********                           'Bss')
     A***********                           TEXT('Price Basis')
     A*********** SASEQA         3S 0
     A***********                           COLHDG('Seq' +
     A***********                           'No.')
     A***********                           TEXT('PM Sequence number')
     A*********** SADDAT         5  0
     A***********                           COLHDG('Deal' +
     A***********                           'Date')
     A***********                           TEXT('Deal date')
     A***********                           EDTCDE(Y )
     A*********** SAVDAT         5  0
     A***********                           COLHDG('Value' +
     A***********                           'Date')
     A***********                           TEXT('Value date')
     A***********                           EDTCDE(Y )
     A*********** SAMDAT         5  0
     A***********                           COLHDG('Maturty' +
     A***********                           'Date')
     A***********                           TEXT('Maturity date')
     A***********                           EDTCDE(Y )
     A*********** SABRCD         3S 0
     A***********                           COLHDG('Brch' +
     A***********                           'Code-' +
     A***********                           'Trade')
     A***********                           TEXT('Branch code of trade')
     A***********                           EDTCDE(X )
     A*********** SAAMT1        15  0
     A***********                           COLHDG('AMT1')
     A***********                           TEXT('Amount 1')
     A*********** SAAMT2        15  0
     A***********                           COLHDG('AMT2')
     A***********                           TEXT('Amount 2')
     A*********** SACCY1         3A
     A***********                           COLHDG('Ccy')
     A***********                           TEXT('Currency')
     A*********** SACCY2         3A
     A***********                           COLHDG('CCY2')
     A***********                           TEXT('Currency-2')
     A*********** SAPRC1        15  8
     A***********                           COLHDG('Price1')
     A***********                           TEXT('Price1')
     A*********** SAPRC2        15  8
     A***********                           COLHDG('Price2')
     A***********                           TEXT('Price2')
     A*********** SARATA        13  8
     A***********                           COLHDG('Exch' +
     A***********                           'Rate 1')
     A***********                           TEXT('Exchange rate 1')
     A*********** SARATB        13  8
     A***********                           COLHDG('Exch' +
     A***********                           'Rate 2')
     A***********                           TEXT('Exchange Rate 2')
      *                                              Begin /S01486/
     A*********** SAMDV1         1A         TEXT('MDIN1')
     A*********** SAMDV2         1A         TEXT('MDIN2')
     A            SAMDV1    R               REFFLD(MDV1)
     A            SAMDV2    R               REFFLD(MDV2)
     A*********** SAMDV1         1A
     A***********                           COLHDG('M/D' +
     A***********                           'Ind' +
     A***********                           ' 1')
     A***********                           TEXT('Mult/Div Ind 1')
     A*********** SAMDV2         1A
     A***********                           COLHDG('M/D' +
     A***********                           'Ind' +
     A***********                           ' 2')
     A***********                           TEXT('Mult/Div Ind 2')
      *                                              End   /S01486/
     A            SABRT1    R               REFFLD(BRT1)
     A            SABRT2    R               REFFLD(BRT2)
     A            SARAI1    R               REFFLD(RAI1)
     A            SARAI2    R               REFFLD(RAI2)
     A            SAFRQ1    R               REFFLD(FRQ1)
     A            SAFRQ2    R               REFFLD(FRQ2)
     A            SAIPD1    R               REFFLD(IPD1)
     A            SAIPD2    R               REFFLD(IPD2)
     A            SANDYS    R               REFFLD(NDYS)
     A            SAAINT    R               REFFLD(AINT)
     A            SABROK    R               REFFLD(BROK)
     A            SASWOD    R               REFFLD(SWOD)
     A            SAACRI    R               REFFLD(ACRI)
     A            SAPURI    R               REFFLD(PURI)
     A            SAVAL1    R               REFFLD(VAL1)
     A            SAVAL2    R               REFFLD(VAL2)
     A            SARCOA    R               REFFLD(RCOA)
     A            SARSEA    R               REFFLD(RSEA)
     A*********** SABRT1         2S 0
     A***********                           COLHDG('Base' +
     A***********                           'RT 1')
     A***********                           TEXT('Base rate 1')
     A*********** SABRT2         2S 0
     A***********                           COLHDG('Base' +
     A***********                           'RT 2')
     A***********                           TEXT('Base Rate 2')
     A*********** SARAI1        13  8
     A***********                           COLHDG('Int' +
     A***********                           'Rate 1')
     A***********                           TEXT('Interest Rate 1')
     A*********** SARAI2        13  8
     A***********                           COLHDG('Int' +
     A***********                           'Rate 2')
     A***********                           TEXT('Interest Rate 2')
     A*********** SAFRQ1         1A
     A***********                           COLHDG('Frq' +
     A***********                           '1')
     A***********                           TEXT('Frequency 1')
     A*********** SAFRQ2         1A
     A***********                           COLHDG('Frq' +
     A***********                           '2')
     A***********                           TEXT('Frequency 2')
     A*********** SAIPD1         5  0
     A***********                           COLHDG('Int' +
     A***********                           'Pay' +
     A***********                           'Dat1')
     A***********                           TEXT('Interest Payment Date 1')
     A*********** SAIPD2         5  0
     A***********                           COLHDG('Int' +
     A***********                           'pay' +
     A***********                           'dat2')
     A***********                           TEXT('Interest Payment Date 2')
     A*********** SANDYS         5  0
     A***********                           COLHDG('No.' +
     A***********                           'days' +
     A***********                           'Acc int')
     A***********                           TEXT('No. of days accrued int+
     A***********                           eres')
     A*********** SAAINT        13  0
     A***********                           COLHDG('Accrued Interest')
     A***********                           TEXT('Accrued Interest')
     A*********** SABROK         4A
     A***********                           COLHDG('BROK')
     A***********                           TEXT('Broker code')
     A*********** SASWOD         6S 0
     A***********                           COLHDG('Swap/' +
     A***********                           'Option' +
     A***********                           'Deal No.')
     A***********                           TEXT('Swap/option deal number')
     A*********** SAACRI         1A
     A***********                           COLHDG('A' +
     A***********                           'I')
     A***********                           TEXT('Accrued Indicator')
     A*********** SAPURI        13  0
     A***********                           COLHDG('Purchased' +
     A***********                           'Interest')
     A***********                           TEXT('Purchased interest')
     A***********                           EDTCDE(J )
     A*********** SAVAL1        13  0
     A***********                           COLHDG('Value 1')
     A***********                           TEXT('Value 1')
     A*********** SAVAL2        13  0
     A***********                           COLHDG('Value 2')
     A***********                           TEXT('Value 2')
     A*********** SARCOA         3A
     A***********                           COLHDG('Reprt' +
     A***********                           'Code')
     A***********                           TEXT('Report Code')
     A*********** SARSEA         2S 0
     A***********                           COLHDG('Rep' +
     A***********                           'Seq')
     A***********                           TEXT('Report Sequence')
     A***START PMC163***
     A*********   SADES1        30A         TEXT('LINE 1 DESCRIPTION')
     A***START R05913***
     A*********   SAT1XT    R               REFFLD(T1XT)
      *                                              Begin /S01486/
     A*********** SAT1XT        30A
     A**********  SAT1XT    R               REFFLD(TX1T)                  S01486
     A            SAT1XT    R               REFFLD(TTNR)
     A*********** SAT1XT        30A
     A***********                           COLHDG('Narrative')
     A***********                           TEXT('Narrative')
      *                                              End   /S01486/
     A***END R05913***
     A            SAT2XT    R               REFFLD(T2XT)
     A*********** SAT2XT        20A
     A***********                           COLHDG('Inst' +
     A***********                           'Enq' +
     A***********                           'Dets')
     A***********                           TEXT('Instrument Enquiry Deta+
     A***********                           ils')
      *                                              Begin /S01486/
     A*********** SACOMC         2A         TEXT('Commision code')
     A*********** SACFRQ         1A         TEXT('Commision frequency')
     A*********** SANCDT         5P 0       TEXT('Next commision date')
     A*********** SAPAYM         2A         TEXT('Payment method')
     A*********** SAPYAC        12A         TEXT('Payment account')
     A*********** SAPYNM        20A         TEXT('Payment account name')
     A*********** SARCVM         2A         TEXT('Receipt method')
     A*********** SARCAC        12A         TEXT('Receipt account')
     A*********** SARCNM        20A         TEXT('Receipt account name')
     A*********** SACGST         2A         TEXT('Commision settlement method')
     A*********** SACGAD        12A         TEXT('Commision / charge account')
     A*********** SACOMC    R               REFFLD(COMC)
     A            SACOMC    R               REFFLD(PCCD)
     A            SACFRQ    R               REFFLD(COFQ)
     A            SANCDT    R               REFFLD(NXCD)
      *                                              Begin /S01486/
     A*********** SAPAYM    R               REFFLD(PAYM)
     A            SAPAYM    R               REFFLD(MPAY)
      *                                              End   /S01486/
     A**Start of change CGL029
     A**********  SAPYAC    R               REFFLD(PYAC)                                      CGL029
     A            QQPYAC        12A
     A**End of change CGL029
     A            SAPYNM    R               REFFLD(PYNM)
     A            SARCVM    R               REFFLD(RCPM)
     A**Start of change CGL029
     A**********  SARCAC    R               REFFLD(RCPA)                                      CGL029
     A            QQRCAC        12A
     A**End of change CGL029
     A            SARCNM    R               REFFLD(RCPN)
     A            SACGST    R               REFFLD(COST)
     A**Start of change CGL029
     A**********  SACGAD    R               REFFLD(COCC)                                      CGL029
     A            QQCGAD        12A
     A**End of change CGL029
     A*********** SACOMC         2A
     A***********                           COLHDG('Com' 'Cde')
     A***********                           TEXT('Commision code')
     A*********** SACFRQ         1A
     A***********                           COLHDG('Com' 'Frq')
     A***********                           TEXT('Commision frequency')
     A*********** SANCDT         5  0
     A***********                           COLHDG('Nxt' 'Com' 'Dte')
     A***********                           TEXT('Next commision date')
     A*********** SAPAYM         2A
     A***********                           COLHDG('Pmt' 'Met')
     A***********                           TEXT('Payment method')
     A*********** SAPYAC        12A
     A***********                           COLHDG('Pmt' 'Acc')
     A***********                           TEXT('Payment account')
     A*********** SAPYNM        20A
     A***********                           COLHDG('Pmt' 'Acc' 'Name')
     A***********                           TEXT('Payment account name')
     A*********** SARCVM         2A
     A***********                           COLHDG('Rcp' 'Mtd')
     A***********                           TEXT('Receipt method')
     A*********** SARCAC        12A
     A***********                           COLHDG('Rcp' 'Acc')
     A***********                           TEXT('Receipt account')
     A*********** SARCNM        20A
     A***********                           COLHDG('Rcp' 'Acc' 'Nme')
     A***********                           TEXT('Receipt account name')
     A*********** SACGST         2A
     A***********                           COLHDG('Com' 'Set' 'Met')
     A***********                           TEXT('Commision settlement me+
     A***********                           thod')
     A*********** SACGAD        12A
     A***********                           COLHDG('Com' 'Chg/Acc')
     A***********                           TEXT('Commision / charge acco+
     A***********                           unt')
      *                                              End   /S01486/
     A***END PMC163***
     A            SACHTP    R               REFFLD(CHTP)
     A            SAISTN    R               REFFLD(ISTN)
     A            SACRNM    R               REFFLD(CRNM)
     A*********** SACHTP         1A
     A***********                           COLHDG('Lst' +
     A***********                           'Chg' +
     A***********                           'Typ')
     A***********                           TEXT('Type of last change')
     A*********** SAISTN        20A
     A***********                           COLHDG('Instrument' +
     A***********                           '  Name')
     A***********                           TEXT('Instrument Name')
     A*********** SACRNM        20A
     A***********                           COLHDG('Customer' +
     A***********                           'Report' +
     A***********                           'Name')
     A***********                           TEXT('Customer report name')
     A*
     A* B9991 BEGIN
     A            SAPRTL    R               REFFLD(PRTL)
     A            SADSPS    R               REFFLD(DSPS)
     A*********** SAPRTL         3A
     A***********                           COLHDG('Prntr' +
     A***********                           'Locn' +
     A***********                           'Code')
     A***********                           TEXT('Printer Location Code')
     A*********** SADSPS         2S 0
     A***********                           COLHDG('Dsp' +
     A***********                           'grp' +
     A***********                           'seq')
     A***********                           TEXT('Display group sequence')
     A* B9991 END
     A***********                                    Begin /085867/
     A            SAPYBR    R               REFFLD(PSBH)
     A                                      COLHDG('Pay' 'Brch')
     A                                      TEXT('Pay Branch')
     A            SARCBR    R               REFFLD(PSBH)
     A                                      COLHDG('Rec' 'Brch')
     A                                      TEXT('Receive Branch')
     A***********                                    End   /085867/
     A***********                                    Begin /CPM004/
     A            SABACO    R               REFFLD(ACOF)
     A                                      COLHDG('Branch A/C' +
     A                                      'Officer')
     A                                      TEXT('Branch A/C Officer')
      * Begin /CSD027/
     A**********  SABCNM    R               REFFLD(CNUM)                                      CSD027
     A            SABCNM         6A
      * End /CSD027/
     A                                      COLHDG('Branch Int' +
     A                                      'Cust Num')
     A                                      TEXT('Branch Internal +
     A                                      Customer nUmber')
     A            SABCRN    R               REFFLD(CRNM)
     A                                      COLHDG('Branch Cust' +
     A                                      'Rpt Name')
     A                                      TEXT('Branch Customer +
     A                                      Report Name')
     A***********                                    End   /CPM004/
     A**Start of change CGL029
     A            SAPYAC        18A
     A            SARCAC        18A
     A            SACGAD        18A
     A**End of change CGL029
