     H        1
      *****************************************************************
/*STD *  RPGBASE                                                      *
/*EXI *  TEXT('Midas FF Customer/broker holdings enquiry')
      *****************************************************************
      *                                                               *
      *  Midas - Futures and Options Module                           *
      *                                                               *
      *  FF0721 - Populate POSTNCD                                    *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 09Dec05               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 Patch D ---------------------------------------*
      * Midas DBA 3.01 -----------------------------------------------*
      *  Prev Amend No. 163444  *CREATE    Date 07Oct99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  163444 - Add Century field                                   *
      *                                                               *
      *****************************************************************
     FPOSTNL1 UF  E           K        DISK
      *
     E                    CPY@    1   1 80
      ** Set up copyright parameter
      *
     C                     MOVEACPY@      CPY2@  80
      *
     C           KEY       KLIST
     C                     KFLD           BRCA
     C                     KFLD           CBCD
     C                     KFLD           ISCY
     C                     KFLD           ISTT
     C                     KFLD           CENT
     C                     KFLD           YRNO
     C                     KFLD           MTHN
      *
     C           KEY       SETLLPOSTNL1
     C                     READ POSTNL1                  10
      *
     C           *IN10     DOWEQ'0'
      *
     C           YRNO      IFLT 72
     C                     Z-ADD20        CENT
     C                     ELSE
     C                     Z-ADD19        CENT
     C                     ENDIF
      *
     C                     UPDATPOSTNCDF
     C                     READ POSTNL1                  10
     C                     END
     C                     SETON                     LR
      *
      *****************************************************************
      *
     C           *PSSR     BEGSR                           ** *PSSR SR **
     C           @RUN      IFEQ *BLANK
     C                     MOVE 'Y'       @RUN    1
     C                     DUMP
      *
     C                     CALL 'DBERRCTL'
      *
     C                     END
      *
     C                     SETON                     LR
     C                     ENDSR
      *
      ********************************************************************
**  CPY@
(c) Misys International Banking Systems Ltd. 2001
