      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  REUSEDLT(*YES)                                               *                       CGP016
/*EXI *  TEXT('Midas GZ Accounts master detail')                      *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  PF/GZACCNTAB  - Accounts master detail                       *
      *                                                               *
      *  (c) Finastra International Limited 2003                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CGP016             Date 06Aug12               *
      *                 CRE073             Date 06Dec10               *
      *                 CRE075             Date 06Dec10               *
      *                 CER059             Date 19Jul10               *
      *                 CER047             Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027             Date 05Dec05               *
      *                 CAP086             Date 08Jun05               *
      *                 CTI004             Date 12Apr04               *
      *                 CLE025             Date 20Oct03               *
      *                 CGL029             Date 01Sep03               *
      *                 CGP001  *CREATE    Date 23May03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGP016 - Global database - Reuse deleted records             *
      *         - Moved from GZDDSSRCGM                               *
      *  CRE073 - Interest Rate Rounding                              *
      *  CRE075 - Effective Date for Retail Accounts                  *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER047 - German Features LF037-00 Reporting §24c KWG         *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CAP086 - Introduce Auto Authorisation to the API's           *
      *           without it.                                         *
      *  CTI004 - MidasPlus TI Integration Enhancements               *
      *           Accounts Integration                                *
      *  CLE025 - Credit Lines                                        *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CGP001 - Global Processing                                   *
      *           - New file - Global version of ACCNTAB.             *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R ACCNTABF                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2003')
     A            RECI      R
      * Begin /CSD027/
     A**********  CNUM      R                                                                 CSD027
     A            CNUM           6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            CCY       R
     A**Start of change CGL029
     A**********  ACOD      R                                                                 CGL029
     A            ACODQQ    R               REFFLD(ACODQQ)
     A**End of change CGL029
     A            ACSQ      R
     A            ZZ006     R
     A            BRCA      R
     A            ATYP      R
     A            STYP      R
     A            MFFQ      R
     A            ACST      R
     A            DACO      R
     A            DACC      R
     A            ANAM      R
     A            LDBL      R
     A            CLBL      R
     A            STFQ      R
     A            STDY      R
     A            LSTD      R
     A            NSTD      R
     A            LSTP      R
     A            CFSB      R
     A            LMVD      R
     A            EPLB      R
     A            EPCB      R
     A            YTDB      R
     A            GLBT      R
     A            ADREF1    R
     A            PRFC      R
     A            ZZ004     R
     A            ORED      R
     A            DLIM      R
     A            LRCR      R
     A            RTCB      R
     A            RTLB      R
     A            DITM      R
     A            CITM      R
     A            ADREF2    R
     A            ZZ002     R
     A            CDIR      R
     A            CCIR      R
     A            ACNO      R
     A            RETB      R
     A            ODSC      R
     A            ODLN      R
     A            ODED      R
     A            DIOD      R
     A            FACT      R
     A            FCNO      R
     A            EFAC      R
     A            HELD      R
     A            MINB      R
     A            LACD      R
     A            LISP      R
     A            RRNM      R
     A            DRIB      R
     A            DRIS      R
     A            DRCD      R
     A            DRIC      R
     A            DRIF      R
     A            DRDY      R
     A            NDID      R
     A            LDID      R
     A            LDIA      R
     A            SDAP      R
     A            LPAR      R
     A            DIIE      R
     A            DAIC      R
     A            MADI      R
     A            GADI      R
     A            DDIS      R
     A            DDIA      R
     A            OLDR      R
     A            OLDB      R
     A            OLDS      R
     A            CRIB      R
     A            CRIS      R
     A            CRCD      R
     A            CRIC      R
     A            CRIF      R
     A            CRDY      R
     A            NCID      R
     A            LCID      R
     A            LCIA      R
     A            SCAP      R
     A            LPAP      R
     A            CIIE      R
     A            CAIC      R
     A            MACI      R
     A            GACI      R
     A            CDIS      R
     A            DCIA      R
     A            OLCR      R
     A            OLCB      R
     A            OLCS      R
     A            LCD       R
     A            CHTP      R
     A            TNLU      R
     A            BRTCA     R
     A            NACSG     R
     A            R4ACNT    R               REFFLD(MSTS)
     A                                      TEXT('RCII account - Y/N')
     A                                      COLHDG('RCII a/c')
     A            ENOC      R               TEXT('Extra number of +
     A                                      copies')
     A            EPNO      R               TEXT('Extra statement +
     A                                      page number')
     A            ECFB      R               TEXT('Extra carried +
     A                                      forward bal.')
     A            LTAB      R               REFFLD(BRCA)
     A                                      TEXT('Link to BRCA')
     A**Start of change CGL029
     A**********  LTAC      R               REFFLD(ACOD)                                      CGL029
     A**********                            TEXT('Link to ACOD')                              CGL029
     A            LTACQQ    R               REFFLD(ACODQQ)
     A**End of change CGL029
     A            LTAS      R               REFFLD(ACSQ)
     A                                      TEXT('Link to ACSQ')
     A            HCFB      R               REFFLD(CFCB)
     A                                      TEXT('Hist. Carried Forward bal.')
     A            PTFR      R
     A            HLEX      R
     A            A5TIAC    R               REFFLD(ATYP)
     A                                      TEXT('TI Account')
     A                                      COLHDG('TI Account')
     A            A5TIAN    R               REFFLD(ZZ006)
     A                                      TEXT('TI Account Number')
     A                                      COLHDG('TI a/c no.')
     A            A5TIAS    R               REFFLD(ZZ003)
     A                                      TEXT('TI Account Suffix')
     A                                      COLHDG('TI a/c suffix')
     A            EUSB      R               REFFLD(STFQ)
     A                                      TEXT('Statement Balances in Euros')
     A                                      COLHDG('Statement' +
     A                                             'Balances' +
     A                                             'in Euros')
     A            IBAN          34          TEXT('IBAN')
     A                                      COLHDG('IBAN')
     A            IBSEQN         3          TEXT('IBAN sequence no')
     A                                      COLHDG('IBAN' 'Seq' 'No')
     A            FRNT      R               REFFLD(FOTRNID)
     A            AFRT      R               REFFLD(FOTRNID)
     A                                      TEXT('Associated Front +
     A                                            Office Transaction Id')
     A                                      COLHDG('Associated' +
     A                                             'Front Office' +
     A                                             'Transaction Id')
     A            REPA      R               REFFLD(RPRLOC)
     A            TMST      R               REFFLD(TIMESTMP)
     A            REPI           1          TEXT('Replication Indicator')
     A                                      COLHDG('Replication' 'Indicator')
     A**Start of change CGL029
     A            ACOD      R               REFFLD(ACOD)
     A            LTAC      R               REFFLD(ACOD)
     A                                      TEXT('Link to ACOD')
     A**End of change CGL029
      **Start of change CLE025
      * Begin /CSD027/
     A**********  FCCU           6S 0       TEXT('Facility Customer')                         CSD027
     A            FCCU           6A         TEXT('Facility Customer')
      * End /CSD027/
     A                                      COLHDG('Facility Customer')
     A            COLF           1A         TEXT('Collateral Flag')
     A                                      COLHDG('Collateral Flag')
     A            BCOA          15P 0       TEXT('Blocked Collateral Amount')
     A                                      COLHDG('Blocked Collateral' +
     A                                             'Amount')
     A            COLA          15P 0       TEXT('Collateral Amount')
     A                                      COLHDG('Collateral Amount')
      * Begin /CSD027/
     A**********  PFCU           6S 0       TEXT('Previous Facility Customer')                CSD027
     A            PFCU           6A         TEXT('Previous Facility Customer')
      * End /CSD027/
     A                                      COLHDG('Previous Facility' +
     A                                             'Customer')
     A            PFTP           3S 0       TEXT('Previous Facility Type')
     A                                      COLHDG('Previous Facility' +
     A                                             'Type')
     A            PFSQ           2S 0       TEXT('Previous Facility Sequence')
     A                                      COLHDG('Previous Facility' +
     A                                             'Sequence')
      **End of change CLE025
     A**Start of change CTI004
     A            A5ACKY        34A         TEXT('SCOLDA Account Key')
     A                                      COLHDG('SCOLDA Account' 'Key')
     A            A5INTL         1A         TEXT('Internal Flag')
     A                                      COLHDG('Internal' 'Flag')
     A            A5TIAB         4A         TEXT('TI Branch Number')
     A                                      COLHDG('TI Branch' 'Number')
     A**End of change CTI004
     A**Start of change CAP086
     A            AUTH           1A         TEXT('Automatic Authorisation')
     A                                      COLHDG('Automatic' 'Authorisation')
     A**End of change CAP086
     A**Start of change CER047
     A            K24C           1A         TEXT('KWG @24c reporting')
     A                                      COLHDG('KWG @24c reporting')
     A**End of change CER047
     A**Start of change CRE075
     A            ACEFDT         5P 0       TEXT('Effective Date')
     A                                      COLHDG('Effective' +
     A                                             'Date')
     A**End of change CRE075
      **Start of change CRE073
     A            DCSP          11P 7       TEXT('Debit Contractual Spread')
     A                                      COLHDG('DR Contractual' +
     A                                             'Spread')
     A            DCSG           1A         TEXT('Debit Contractual Spread +
     A                                             Sign')
     A                                      COLHDG('DR Contractual' +
     A                                             'Spread Sign')
     A            DRMT           7A         TEXT('Debit Rounding Method')
     A                                      COLHDG('DR Rounding' +
     A                                             'Method')
     A            DRFD           4A         TEXT('Debit Rounding +
     A                                             Fraction/Decimal')
     A                                      COLHDG('DR Rounding' +
     A                                             'Fraction/Decimal')
     A            CCSP          11P 7       TEXT('Credit Contractual Spread')
     A                                      COLHDG('CR Contractual' +
     A                                             'Spread')
     A            CCSG           1A         TEXT('Credit Contractual Spread +
     A                                             Sign')
     A                                      COLHDG('CR Contractual' +
     A                                             'Spread Sign')
     A            CRMT           7A         TEXT('Credit Rounding Method')
     A                                      COLHDG('CR Rounding' +
     A                                             'Method')
     A            CRFD           4A         TEXT('Credit Rounding +
     A                                             Fraction/Decimal')
     A                                      COLHDG('CR Rounding' +
     A                                             'Fraction/Decimal')
      **End of change CRE073
