      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  REUSEDLT(*YES)                                               *                       CGP016
/*EXI *  TEXT('Midas GZ Client Depot Positions')                      *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  PF/GZCDEPPD - Client Holdings                                *
      *                                                               *
      *  (c) Finastra International Limited 2003                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CGP016             Date 06Aug12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD027             Date 05Dec05               *
      *                 233566             Date 17May05               *
      *                 CGL035             Date 05Jul04               *
      *                 CGP007  *CREATE    Date 09Nov04               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGP016 - Global Database - Reuse of deleted records          *
      *         - Moved from GZDDSSRCGM                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *    233566 - Add fields to CDEPPD                              *
      *    CGL035 - EUSD Upgrade to Midasplus                         *
      *    CGP007 - Depot Positions Global View                       *
      *           - New file - Global version of UDEPPD.              *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R CDEPPDF                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            RECI      R
     A            CDPA      R
      * Begin /CSD027/
     A**********  CDCN      R                                                                 CSD027
     A            CDCN           6A
     A                                      TEXT('Customer')
     A                                      COLHDG('Cust')
      * End /CSD027/
     A            CDSN      R
      * Begin /CSD027/
     A**********  CDPT      R                                                                 CSD027
     A            CDPT           6A
     A                                      TEXT('Depot')
     A                                      COLHDG('Depot')
      * End /CSD027/
     A            CDMK      R
     A            DDTE      R
     A            CECN      R
     A            CDNT      R
     A            CDNV      R
     A            SNPT      R
     A            CDST      R
     A            CDNS      R
     A            SAPP      R
     A            SAPS      R
     A            CNPV      R
     A            CNSV      R
     A            SAPV      R
     A            SPSV      R
     A            CNSI      R
     A            TNLU      R
     A            PTFR      R
     A**Start of change CGL035
     A            CPCH      R               REFFLD(PUCH)
     A                                      TEXT('Purchase Interest')
     A                                      COLHDG('Purchase Interest')
     A**Start of change 233566
     A**********  AFPT      R               REFFLD(PUCH)                                      233566
     A**********                            TEXT('Average Fiscal Price +                      233566
     A**********                            at Numerator at Trade Date')                      233566
     A**********                            COLHDG('Average Fiscal ' +                        233566
     A**********                            'Price Numerator at ' +                           233566
     A**********                            'Trade Date')                                     233566
     A**********  AFPV      R               REFFLD(PUCH)                                      233566
     A**********                            TEXT('Average Fiscal Price +                      233566
     A**********                            at Value Date')                                   233566
     A**********                            COLHDG('Average Fiscal ' +                        233566
     A**********                            'Price Numerator at ' +                           233566
     A**********                            'Value Date')                                     233566
     A            SAFP      R               REFFLD(SAPV)
     A                                      TEXT('Sum AFP Numerator - +
     A                                      Purchases - Value Date')
     A                                      COLHDG('Sum AFP Numerator ' +
     A                                      'Purchases at ' +
     A                                      'Value Date')
     A            SAFS      R               REFFLD(SAPV)
     A                                      TEXT('Sum AFP Numerator - +
     A                                      Sale - Value Date')
     A                                      COLHDG('Sum AFP Numerator' +
     A                                      'Sale at Value Date ')
     A            SAPD      R               REFFLD(SAPV)
     A                                      TEXT('Sum AP Numerator - +
     A                                      Purchased Date')
     A                                      COLHDG('Sum AP Numerator' +
     A                                      'at Purchased Date ')
     A**End of change 233566
     A**End of change CGL035
