      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  REUSEDLT(*YES)                                               *                       CGP016
/*EXI *  TEXT('Midas GZ Deal type/subtypes')                          *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  PF/GZFDDTSTPD - Deal Type/Subtypes                           *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      *  Last Amend No. CGP016  *MOVED     Date 06Aug12               *
      *  Prev Amend No. CER059             Date 19Jul10               *
      *                 CER047             Date 19May08               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CSD031             Date 10Apr06               *
      *                 CDL038             Date 10May05               *
      *                 CAS011             Date 16May05               *
      *                 CAS008             Date 16Jun04               *
      *                 CDL019             Date 09Feb04               *
      *                 CGP001  *CREATE    Date 23May03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGP016 - Global database - Re-use deleted records            *
      *         - Moved from GZDDSSRCGM                               *
      *  CER059 - German Feature Upgrade to Delhi                     *
      *  CER047 - German Features LF037-00 Reporting §24c KWG         *
      *  CSD031 - Enhanced Centralised Static Data                    *
      *  CDL038 - Extended Deal Sub Type                              *
      *  CAS011 - EIR/AC Accounting Upgrade to MP1                    *
      *  CAS008 - IAS 39 Enhancements                                 *
      *  CDL019 - Allow Base Rate Changes on Fixed Deposits/Loans     *
      *  CGP001 - Global Processing                                   *
      *           - New file - Global version of FDDTSTPD.            *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R FDDTSTPD                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
     A            RCID11    R               REFFLD(RCID)
     A                                      TEXT('RECORD ID.')
     A                                      COLHDG('RECID ID.')
     A            DTPE11    R               REFFLD(DTPE)
     A                                      TEXT('DEAL TYPE')
     A                                      COLHDG('DEAL TYPE')
     A            DLST11    R               REFFLD(DLST)
     A                                      TEXT('SUB TYPE')
     A                                      COLHDG('SUB TYPE')
     A            NARR11    R               REFFLD(NARR)
     A                                      TEXT('NARRATIVE')
     A                                      COLHDG('NARRATIVE')
     A            LCD11          5  0       TEXT('Last Change Date')
     A                                      COLHDG('Last' +
     A                                             'Change Date')
     A                                      EDTCDE(4)
     A            TYLC11         1          TEXT('Type of Last Change')
     A                                      COLHDG('Type of' +
     A                                             'Last Change')
     A            INNR      R
     A            PLDPCD    R               REFFLD(ZZ005)
     A                                      TEXT('Default Pricing Group')
     A                                      COLHDG('Def. Pricing Group')
     A            PLDRCD    R               REFFLD(ZZ008)
     A                                      TEXT('Default Reporting Group')
     A                                      COLHDG('Def. Report Group')
     A            PLCRED    R               REFFLD(ZZ004)
     A                                      TEXT('Default Credit Rating')
     A                                      COLHDG('Def. Credit Rating')
     A            FSOURY         5          TEXT('Buy/Our Yield Curve')
     A                                      COLHDG('Buy/Our Yield Curve')
     A            FSTHRY         5          TEXT('Sell/Their Yield Curve')
     A                                      COLHDG('Sell/Their' +
     A                                             'Yield Curve')
     A            FSYLDM         1          TEXT('Yield Curve Mandatory')
     A                                      COLHDG('Yield Curve' +
     A                                             'Mandatory')
     A            FSORFY         5A         TEXT('Buy/Our Forward Yield +
     A                                           Curve')
     A                                      COLHDG('Buy/Our Forward' +
     A                                             'Yield Curve')
     A            FSTHFY         5A         TEXT('Sell/Their Forward +
     A                                           Yield Curve')
     A                                      COLHDG('Sell/Their Forward' +
     A                                             'Yield Curve')
     A            FSFYCM         1A         TEXT('Forward Yield +
     A                                           Curve Mandatory')
     A                                      COLHDG('Forward Yield' +
     A                                             'Curve Mandatory')
     A            FDZONE        10A         TEXT('Zone')
     A                                      COLHDG('Zone')
      *
      ** Start of change CDL019
     A            FDFBRT         1A         TEXT('Fix Base Rate')
     A                                      COLHDG('Fix' 'Base Rate')
      ** End of change CDL019
      **Start of change CAS008
     A            FSOFCY         5A         TEXT('Buy/Our Forward Commitment +
     A                                           Yield Curve')
     A                                      COLHDG('Buy/Our Forward' +
     A                                           'Commitment Curve' +
     A                                           'Mandatory')
     A            FSTFCY         5A         TEXT('Sell/Their Forward +
     A                                           Commitment Yield Curve')
     A                                      COLHDG('Sell/Their Forward' +
     A                                           'Commitment Yield' +
     A                                           'Curve')
     A            FSFCCM         1A         TEXT('Forward Commitment +
     A                                           Yield Curve Mandatory')
     A                                      COLHDG('Forward Commitment' +
     A                                           'Yield Curve' +
     A                                           'Mandatory')
      **End of change CAS008
      **Start of change CAS011
     A            FSACAI         1A         TEXT('Amortised Cost +
     A                                           Accounting Indicator')
     A                                      COLHDG('Amort. Cost' +
     A                                             'Acctg. Ind.')
      **End of change CAS011
     A*                                              Begin /CDL038/
     A            CLAS11         4A         TEXT('Deal Class')
     A                                      COLHDG('Deal' 'Class')
     A*                                              End   /CDL038/
      **Start of change CSD031
     A            IUSR11        10A         TEXT('Insert User')
     A                                      COLHDG('Insert User')
     A            AUSR11        10A         TEXT('Amend User')
     A                                      COLHDG('Amend User')
     A            XUSR11        10A         TEXT('Authorise User')
     A                                      COLHDG('Authorise ' 'User')
     A            AACC11         1A         TEXT('Automatically accept w/in +
     A                                      zone')
     A                                      COLHDG('Automatically ' +
     A                                       'accept w/in zone')
     A            EACC11         5P 0       TEXT('Accept by Effective Date')
     A                                      COLHDG('Accept by' +
     A                                      'Effective Date')
     A            GPDT11         1A         TEXT('Central Data indicator')
     A                                      COLHDG('Central Data ind.')
      **End of change CSD031
      **Start of change CER047
     A            FSK24C         1A         TEXT('KWG @24c reporting')
      **End of change CER047
