      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  REUSEDLT(*YES)                                               *                       CGP016
/*EXI *  TEXT('Midas GZ Midas modules (consolidated)')                *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing                                    *
      *                                                               *
      *  PF/GZSDMMIDPD - Midas Modules (Consolidated)                 *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      *  Last Amend No. CGP016  *MOVED     Date 06Aug12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CPK018             Date 08Jan04               *
      *                 CGP002  *CREATE    Date 11Aug03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGP016 - Global database - Re-use deleted records            *
      *         - Moved from GZDDSSRCGM                               *
      *  CPK018 - MidasPlus packaging.  Change of shared formats.     *
      *  CGP002 - Global Processing                                   *
      *           - New file. Consolidated version of SDMMIDPD.       *
      *                                                               *
      *****************************************************************
      * Start of CPK018
     A**********R SDMMIDD0                  FORMAT(GPMMIDPD)                                  CPK018
     A          R SDMMIDD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
      *
     A            FOMMSN        10          TEXT('Midas module shortnames')
     A                                      COLHDG('Midas module' +
     A                                             'shortnames' )
     A            FOTYLC         1          TEXT('Type of Last Change')
     A                                      COLHDG('Type of' +
     A                                             'Last Change' )
     A            FOLCD          5  0       TEXT('Last Change Date')
     A                                      COLHDG('Last' +
     A                                             'Change Date' )
     A                                      EDTCDE(3)
     A            FOUNIQ         2          TEXT('Module identifr - UNIQUE')
     A                                      COLHDG('Module identifr' +
     A                                             '- UNIQUE' )
     A            FOMMIN         1          TEXT('Midas module installed')
     A                                      COLHDG('Midas module' +
     A                                             'installed' )
     A            FOMODD        50          TEXT('Module Description')
     A                                      COLHDG('Module Description' )
     A            FOOBJN        10          TEXT('Name of obj holding data')
     A                                      COLHDG('Name of obj' +
     A                                             'holding data' )
     A            FOMODF        10          TEXT('Field name')
     A                                      COLHDG('Field' +
     A                                             'name' )
     A            FOMODP         3S 0       TEXT('Position on object')
     A                                      COLHDG('Position' +
     A                                             'on object' )
     A                                      EDTCDE(3)
     A            FOCOBM         2          TEXT('Module identifier - COB')
     A                                      COLHDG('Module' +
     A                                             'identifier - COB' )
     A            FORCFM         2          TEXT('Module identifier - RCF')
     A                                      COLHDG('Module' +
     A                                             'identifier - RCF' )
     A            FOSPFM         2          TEXT('Module identifier - SPF')
     A                                      COLHDG('Module' +
     A                                             'identifier - SPF' )
     A            FOZONE        10          TEXT('Zone')
     A                                      COLHDG('Zone')
      * End of CPK018
