      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  REUSEDLT(*YES)                                               *                       CGP016
/*EXI *  TEXT('Midas GZ Customer Details Extension File')             *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  PF/GZSDCUSTQD - Customer details extension file              *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2006            *
      *                                                               *
      *  Last Amend No. CGP016  *MOVED     Date 06Aug12               *
      *  Prev Amend No. CER049             Date 06Dec10               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CAP185  *CREATE    Date 21Apr06               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGP016 - Global database - Re-use deleted records            *
      *         - Moved from GZDDSSRCGM                               *
      *  CER049 - Stamp Tax                                           *
      *  CAP185 - MQ Series Interface                                 *
      *                                                               *
      *****************************************************************
     A          R SDCUSQD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2006')
      *
     A            CQCUST         6A         TEXT('Customer number')
     A                                      COLHDG('Customer' +
     A                                             'number')
     A            CQFRID        20A         TEXT('Front office ID')
     A                                      COLHDG('Front' +
     A                                             'ofc ID')
      **Start of change CER049
     A            CQTAX          1A         TEXT('Stamp Tax Liable')
     A                                      COLHDG('Stamp Tax' +
     A                                             'Liable')
     A            CQDBRC         3A         TEXT('Debit A/c Branch')
     A                                      COLHDG('Debit A/c' +
     A                                             'Branch')
     A            CQDCST         6A         TEXT('Debit A/c Cust.')
     A                                      COLHDG('Debit A/c' +
     A                                             'Cust.')
     A            CQDCCY         3A         TEXT('Debit A/c Ccy.')
     A                                      COLHDG('Debit A/c' +
     A                                             'Ccy.')
     A            CQDACD        10S 0       TEXT('Debit A/c Code')
     A                                      COLHDG('Debit A/c' +
     A                                             'Code')
     A            CQDASC         2S 0       TEXT('Debit A/c Seq.')
     A                                      COLHDG('Debit A/c' +
     A                                             'Seq.')
     A            CQSTD          5P 0       TEXT('Stamp Tax Start Date')
     A                                      COLHDG('Stamp Tax' +
     A                                             'Start Date')
      **End of change CER049
