      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  REUSEDLT(*YES)                                               *                       CGP016
/*EXI *  TEXT('Midas GZ Bank details ICD file')                       *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  PF/GZSDBANKPD - Bank Details ICD File                        *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2003            *
      *                                                               *
      *  Last Amend No. CGP016  *MOVED     Date 06Aug12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CGP001  *CREATE    Date 23May03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CGP016 - Global database - Re-use deleted records            *
      *         - Moved from GZDDSSRCGM                               *
      *  CGP001 - Global Processing                                   *
      *                                                               *
      *****************************************************************
     A          R SDBANKD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2003')
      *
     A            BJBANK        10          TEXT('Bank')
     A                                      COLHDG('Bank' )
     A            BJCNCD         2          TEXT('Country Code')
     A                                      COLHDG('Country' +
     A                                             'code' )
     A            BJCYCD         3          TEXT('Currency Code')
     A                                      COLHDG('Currency' +
     A                                             'code' )
     A            BJHOCY         3          TEXT('Head Office Currency code')
     A                                      COLHDG('Head Office' +
     A                                             'Currency code' )
     A            BJLCCY         3          TEXT('Local Currency code')
     A                                      COLHDG('Local' +
     A                                             'Currency code' )
     A            BJSBRC         3          TEXT('Single Branch Code')
     A                                      COLHDG('Single' +
     A                                             'Branch Code' )
     A            BJCUST         6          TEXT('Customer Number')
     A                                      COLHDG('Customer' +
     A                                             'Number' )
     A            BJSLCD         3          TEXT('System Location Code')
     A                                      COLHDG('System' +
     A                                             'Location Code' )
     A            BJRDNB         5  0       TEXT('Run day number')
     A                                      COLHDG('Run day' +
     A                                             'number' )
     A                                      EDTCDE(3)
     A            BJLCD          5  0       TEXT('Last Change Date')
     A                                      COLHDG('Last' +
     A                                             'Change Date' )
     A                                      EDTCDE(3)
     A            BJTYLC         1          TEXT('Type of Last Change')
     A                                      COLHDG('Type of' +
     A                                             'Last Change' )
     A            BJSUC          1          TEXT('Set Up Complete')
     A                                      COLHDG('Set Up' +
     A                                             'Complete' )
     A            BJDFIN         1          TEXT('Date Format Indicator')
     A                                      COLHDG('Date Format' +
     A                                             'Indicator' )
     A            BJMRDT         7          TEXT('Midas Run Date')
     A                                      COLHDG('Midas' +
     A                                             'Run Date' )
     A            BJDNWD         5  0       TEXT('Date of Next Working Day')
     A                                      COLHDG('Date of Next' +
     A                                             'Working Day' )
     A                                      EDTCDE(3)
     A            BJEYD          5  0       TEXT('End of Year Date')
     A                                      COLHDG('End of' +
     A                                             'Year Date' )
     A                                      EDTCDE(3)
     A            BJPEYD         5  0       TEXT('Previous End of Year Date')
     A                                      COLHDG('Previous End' +
     A                                             'of Year Date' )
     A                                      EDTCDE(3)
     A            BJBVPD         3  0       TEXT('Back Value Period in Days')
     A                                      COLHDG('Back Value' +
     A                                             'Period in Days' )
     A                                      EDTCDE(3)
     A            BJURPT        53          TEXT('User Report Title')
     A                                      COLHDG('User Report Title' )
     A            BJPCFU         1          TEXT('Password Chg Fclty Used')
     A                                      COLHDG('Password Chg' +
     A                                             'Fclty Used' )
     A            BJPCFQ         3  0       TEXT('Password Change Frequency')
     A                                      COLHDG('Password Change' +
     A                                             'Frequency' )
     A                                      EDTCDE(3)
     A            BJMDEL         1          TEXT('Allow Manual Deletion')
     A                                      COLHDG('Allow Manual' +
     A                                             'Deletion' )
     A            BJMODT         1          TEXT('Apply Modulus 10 Check')
     A                                      COLHDG('Apply Modulus' +
     A                                             '10 Check' )
     A            BJEFMT         1          DFT('D')
     A                                      TEXT('European Format Indicator')
     A                                      COLHDG('Euro Format' +
     A                                             'Indicator' )
     A            BJZONE        10A         TEXT('Zone')
     A                                      COLHDG('Zone')
