      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  REUSEDLT(*YES)                                               *                       CGP016
/*EXI *  TEXT('Midas GZ Charge Types Detail')                         *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  PF/GZSECGTD - Market Centres Detail                          *
      *                                                               *
      *  (c) Finastra International Limited 2003                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CGP016             Date 06Aug12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CGP001  *CREATE    Date 23May03               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGP016 - Global database - Re-use deleted records            *
      *         - Moved from GZDDSSRCGM                               *
      *  CGP001 - Global Processing                                   *
      *           - New file - Global version of SECGTD               *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R SECGTDF                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            RECI      R
     A            CCY       R
     A            CCOM      R
     A            CHGB      R
     A            THRI      R
     A            CHNR      R
     A            TXAP      R
     A            REBA      R
     A            STU1      R
     A            STU2      R
     A            STU3      R
     A            STU4      R
     A            STU5      R
     A            STU6      R
     A            STU7      R
     A            STU8      R
     A            STU9      R
     A            ST10      R
     A            ST11      R
     A            ST12      R
     A            ST13      R
     A            ST14      R
     A            PL01      R
     A            PL02      R
     A            PL03      R
     A            PL04      R
     A            PL05      R
     A            PL06      R
     A            PL07      R
     A            PL08      R
     A            PL09      R
     A            PL10      R
     A            PL11      R
     A            PL12      R
     A            PL13      R
     A            PL14      R
     A            PL15      R
     A            FC01      R
     A            FC02      R
     A            FC03      R
     A            FC04      R
     A            FC05      R
     A            FC06      R
     A            FC07      R
     A            FC08      R
     A            FC09      R
     A            FC10      R
     A            FC11      R
     A            FC12      R
     A            FC13      R
     A            FC14      R
     A            FC15      R
     A            LPSI      R
     A            MNCH      R
     A            MXCH      R
     A            LCD       R
     A            CHTP      R
     A            TNLU      R
     A            OWOT      R
      *
     A            GCCI      R               REFFLD(IND)
     A                                      TEXT('Group Charge Code Ind.')
     A            GCCO      R               REFFLD(TCCC)
     A                                      TEXT('Group Charge Code')
      *
     A            PRFC      R
     A            BOTR      R               REFFLD(IND)
     A                                      TEXT('Book/Transaction Ind')
     A                                      COLHDG('Book/' +
     A                                             'Trans' +
     A                                             'Ind.')
     A            SWID      R               REFFLD(PDCD)
     A                                      TEXT('SWIFT Identification')
     A                                      COLHDG('SWIFT Identification')
     A            ZONE          10A         TEXT('Zone')
     A                                      COLHDG('Zone')
