      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas RP PB depot movement used for replication')
      *****************************************************************
      *                                                               *
      *  Midas - Private Banking Module                               *
      *                                                               *
      *  PF/RPDPMVPD - Depot Movement used for Replication            *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD027             Date 25Nov05               *
      *  Prev Amend No. CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.05 -----------------------------------------------*
      *                 CPB002  *CREATE    Date 20Mar00               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *  CPB002 - Meridian DBA Middleware Replication Customization.  *
      *           Midas/TOF Interface.                                *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R RPDPMVD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            RPDPSS        10A         TEXT('Security Shortname')
     A                                      COLHDG('Security' 'Shortname')
      *
     A            RPDPRN         6A         TEXT('Reference')
     A                                      COLHDG('Reference')
      *
     A            RPDPMV         2A         TEXT('Movement Type')
     A                                      COLHDG('Movement' 'Type')
      *
      * Begin /CSD027/
     A**********  RPDPID         6S 0       TEXT('In Depot')                                  CSD027
     A            RPDPID         6A         TEXT('In Depot')
      * End /CSD027/
     A                                      COLHDG('In Depot')
      *
     A            RPDPMD         5P 0       TEXT('Movement Date In')
     A                                      COLHDG('Movement' 'Date In')
      *
      * Begin /CSD027/
     A**********  RPDPOD         6S 0       TEXT('Out Depot')                                 CSD027
     A            RPDPOD         6A         TEXT('Out Depot')
      * End /CSD027/
     A                                      COLHDG('Out Depot')
      *
     A            RPDPDO         5P 0       TEXT('Movement Date Out')
     A                                      COLHDG('Movement Date Out')
      *
      * Begin /CSD027/
     A**********  RPDPBN         6S 0       TEXT('Beneficial Customer')                       CSD027
     A            RPDPBN         6A         TEXT('Beneficial Customer')
      * End /CSD027/
     A                                      COLHDG('Beneficial' 'Customer')
      *
     A            RPDPNA        11P 0       TEXT('Nominal Amount')
     A                                      COLHDG('Nominal' 'Amount')
      *
     A            RPNMCY         3A         TEXT('Nominal Currency')
     A                                      COLHDG('Nominal' 'Currency')
      *
     A            RPNMDP         1S 0       TEXT('Nominal Decimal Places')
     A                                      COLHDG('Nominal' 'Decimal' 'Places')
      *
     A            RPDPNR        35A         TEXT('Narrative')
     A                                      COLHDG('Narrative')
      *
     A            RPMKTP        15P 8       TEXT('Market Price')
     A                                      COLHDG('Market' 'Price')
      *
     A            RPCHTP         1A         TEXT('Last Change Type')
     A                                      COLHDG('Last' 'Change' 'Type')
      *
     A            RPDCHC         2A         TEXT('Charge Code')
     A                                      COLHDG('Charge' 'Code')
      *
     A            RPDCCE         3A         TEXT('Charge Currency')
     A                                      COLHDG('Charge' 'Currency')
      *
     A            RPDCHA        13P 0       TEXT('Charge Amount')
     A                                      COLHDG('Charge' 'Amount')
      *
     A            RPDCSE         2S 0       TEXT('Charge Settlement Type')
     A                                      COLHDG('Charge' 'Settlement' 'Type')
      *
     A**Start of change CGL029
     A**********  RPDCAT        12A         TEXT('Charge Account')                            CGL029
     A**********                            COLHDG('Charge' 'Account')                        CGL029
     A            QQDCAT        12A
     A**End of change CGL029
      *
     A            RPDPVD         5P 0       TEXT('Value Date')
     A                                      COLHDG('Value' 'Date')
      *
     A            RPPTFR         4A         TEXT('Portfolio Reference')
     A                                      COLHDG('Portfolio' 'Reference')
      *
     A            RPTAKE         1A         TEXT('Take-on flag')
     A                                      COLHDG('Take-on' 'Flag')
      *
     A            RPCLPO         1A         TEXT('Clean Position flag')
     A                                      COLHDG('Clean' 'Position' 'Flag')
      *
     A            RPCUME         1A         TEXT('Cum-ex flag')
     A                                      COLHDG('Cum-ex' 'Flag')
      *
     A            RPCDPA         3A         TEXT('Branch')
     A                                      COLHDG('Branch')
      *
     A**Start of change CGL029
     A            RPDCAT        18A         TEXT('Charge Account')
     A                                      COLHDG('Charge' 'Account')
     A**End of change CGL029
