      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas CB Display module conditions')
      *****************************************************************
      *                                                               *
      *  Midas - Close of Business Module                             *
      *                                                               *
      *  DSPF/CB0420E# - Complex Module Conditions Enquiry            *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Last Amend No. CCB008             Date 12Oct98               *
      *  Prev Amend No. S01459             Date 12Oct98               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CCB008 - Synon Closedown Project (CB):                       *
      *           - File removed from CB model.                       *
      *  S01459 - Addition of Midas headerbox.                        *
      *                                                               *
      *****************************************************************
     A                                      INDARA
     A                                      PRINT(MPRINT)
     A                                      CHGINPDFT
     A*=========================================================================
     A*/COPY WNCPYSRC,CB0420E#99
     A          R #RCDKEY                   TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*/COPY WNCPYSRC,CB0420E#98
     A                                      SETOF(98 'Force input format')
     A                                      BLINK OVERLAY
     A                                      INDTXT(86 'Enable PUTOVR')
     A  86                                  PUTOVR
     A* Command keys............................................................
     A                                      VLDCMDKEY(29 'Valid command key')
     A                                      CA03(03 'Exit.')
     A* SETOFFS.................................................................
     A                                      SETOF(99 'Global error flag')
     A                                      SETOF(31 'Invalid: #1COTT')
     A                                      SETOF(32 'Invalid: #1CSEQ')
     A*.........................................................................
     A            ##USR         10      1  2TEXT('*USER')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            ##PGM         10   H      TEXT('*PROGRAM')
     A                                  1 13'CB0420E1'
     A                                      DSPATR(HI)
     A            ##AANA         7      1 72TEXT('midas rundate')
     A N25                                  OVRDTA
     A            ##JOB         10      2  2TEXT('*JOB')
     A N25                                  OVRDTA
     A                                  2 29'Module Conditions Enquiry'
     A                                      DSPATR(HI)
     A            ##TME          6  0   2 71TEXT('*TIME')
     A                                      EDTWRD('  :  :  ')
     A N25                                  OVRDTA
     A            #1MCUN         2   H      TEXT('Module Conds Unique No')
     A                                  4  2'Component Name...........:'
     A            #1COTT        10   B  4 29TEXT('Component Name')
     A                                      CHECK(FE)
     A N25                                  OVRDTA
     A  31                                  DSPATR(RI PC)
     A N31                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                  5  2'Component Sequence Number:'
     A            #1CSEQ         5   B  5 29TEXT('Component Sequence Number')
     A                                      CHECK(FE)
     A N25                                  OVRDTA
     A  32                                  DSPATR(RI PC)
     A N32                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A*=========================================================================
     A*/COPY WNCPYSRC,CB0420E#97
     A          R #CMDTXT1                  TEXT('Command keys')
     A*/COPY WNCPYSRC,CB0420E#96
     A                                      OVERLAY PUTOVR
     A                                 23  2' '
     A*=========================================================================
     A*/COPY WNCPYSRC,CB0420E#95
     A          R #RCDDTL1                  TEXT('Details')
     A*/COPY WNCPYSRC,CB0420E#94
     A                                      SETOF(98 'Force input format')
     A                                      BLINK OVERLAY
     A                                      INDTXT(86 'Enable PUTOVR')
     A  86                                  PUTOVR
     A                                      INDTXT(88 'Protect key fields')
     A                                      INDTXT(87 'Enable key screen')
     A* Command keys............................................................
     A                                      VLDCMDKEY(29 'Valid command key')
     A                                      CA03(03 'Exit.')
     A  87                                  CA12(12 'Key screen.')
     A* SETOFFS.................................................................
     A                                      SETOF(99 'Global error flag')
     A*.........................................................................
     A            ##USR         10      1  2TEXT('*USER')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A            ##PGM         10   H      TEXT('*PROGRAM')
     A                                  1 13'CB0420E2'
     A                                      DSPATR(HI)
     A            ##AANA         7      1 72TEXT('midas rundate')
     A N25                                  OVRDTA
     A            ##JOB         10      2  2TEXT('*JOB')
     A N25                                  OVRDTA
     A                                  2 29'Module Conditions Enquiry'
     A                                      DSPATR(HI)
     A            ##TME          6  0   2 71TEXT('*TIME')
     A                                      EDTWRD('  :  :  ')
     A N25                                  OVRDTA
     A                                  4  4'Component Name...........:'
     A            #1COTT        10      4 31TEXT('Component Name')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                  5  4'Component Sequence Number:'
     A            #1CSEQ         5      5 31TEXT('Component Sequence Number')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                  6  4'Module Conds Unique No...:'
     A            #1MCUN         2      6 31TEXT('Module Conds Unique No')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                  8  4'Module 01................:'
     A            #1MD01         2      8 31TEXT('Module 01')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                  8 38'Module 02................:'
     A            #1MD02         2      8 65TEXT('Module 02')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                  9  4'Module be/not be present.:'
     A            #1MP01         1      9 31TEXT('Module be/not be present')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                  9 38'Mod 02 be/not be present.:'
     A            #1MP02         1      9 65TEXT('Mod 02 be/not be present')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 11  4'Module 03................:'
     A            #1MD03         2     11 31TEXT('Module 03')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 11 38'Module 04................:'
     A            #1MD04         2     11 65TEXT('Module 04')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 12  4'Mod 03 be/not be present.:'
     A            #1MP03         1     12 31TEXT('Mod 03 be/not be present')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 12 38'Mod 04 be/not be present.:'
     A            #1MP04         1     12 65TEXT('Mod 04 be/not be present')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 14  4'Module 05................:'
     A            #1MD05         2     14 31TEXT('Module 05')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 14 38'Module 06................:'
     A            #1MD06         2     14 65TEXT('Module 06')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 15  4'Mod 05 be/not be present.:'
     A            #1MP05         1     15 31TEXT('Mod 05 be/not be present')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 15 38'Mod 06 be/not be present.:'
     A            #1MP06         1     15 65TEXT('Mod 06 be/not be present')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 17  4'Module 07................:'
     A            #1MD07         2     17 31TEXT('Module 07')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 17 38'Module 08................:'
     A            #1MD08         2     17 65TEXT('Module 08')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 18  4'Mod 07 be/not be present.:'
     A            #1MP07         1     18 31TEXT('Mod 07 be/not be present')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 18 38'Mod 08 be/not be present.:'
     A            #1MP08         1     18 65TEXT('Mod 08 be/not be present')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 20  4'Module 09................:'
     A            #1MD09         2     20 31TEXT('Module 09')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 20 38'Module 10................:'
     A            #1MD10         2     20 65TEXT('Module 10')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 21  4'Mod 09 be/not be present.:'
     A            #1MP09         1     21 31TEXT('Mod 09 be/not be present')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A                                 21 38'Mod 10 be/not be present.:'
     A            #1MP10         1     21 65TEXT('Mod 10 be/not be present')
     A N25                                  OVRDTA
     A                                      DSPATR(HI)
     A*=========================================================================
     A*/COPY WNCPYSRC,CB0420E#93
     A          R #CMDTXT2                  TEXT('Command keys')
     A*/COPY WNCPYSRC,CB0420E#92
     A                                      OVERLAY PUTOVR
     A                                 23  2'F3=Exit'
     A*=========================================================================
     A*/COPY WNCPYSRC,CB0420E#91
     A          R #MSGRCD                   TEXT('Program messages')
     A*/COPY WNCPYSRC,CB0420E#90
     A                                      SFL SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            ##PGM                     SFLPGMQ
     A*=========================================================================
     A*/COPY WNCPYSRC,CB0420E#89
     A          R #MSGCTL                   TEXT('Program messages')
     A*/COPY WNCPYSRC,CB0420E#88
     A                                      SFLCTL(#MSGRCD)
     A                                      SFLPAG(01) SFLSIZ(03)
     A  86                                  OVERLAY PUTOVR
     A                                      SFLINZ SFLDSP SFLDSPCTL
     A  25
     AON25                                  SFLEND
     A            ##PGM                     SFLPGMQ
     A*=========================================================================
     A*/COPY WNCPYSRC,CB0420E#87
