      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas CB COB monitor screen')
/*ADD *  CHGDSPF FILE(CBMONDF) WAITRCD(600)                           *
      *****************************************************************
      *                                                               *
      *  Midas - Close of Business Processing                         *
      *                                                               *
      *  CBMONDF  COB MONITOR DISPLAY FILE                            *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CPK025             Date 23Nov06               *
      *                 CAAA02             Date 16Jul03               *
      * Midas Release 4 --------------- Base -------------------------*
      *                 CPK014             Date 25Oct01               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CPK008             Date 01JUL97               *
      *                 075277             DATE 23AUG94               *
      *                 E39162             DATE 30MAY92               *
      *                 E28730             DATE 20SEP91               *
      *                 E26775             DATE 31JUL91               *
      *                 LN0397             DATE 20JUN90               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CPK025 - Revert back fix of CAAA02                           *
      *  CAAA02 - Remove use of INVITE keyword to enable WebFacing    *
      *           to process screens.                                 *
      *           Cause Web page to redisplay after the same number   *
      *           of seconds as the WAITRCD time for this DSPF.       *
      *  CPK014 - Release 4 Packaging                                 *
      *         - Remove 'DBA' references                             *
      *  CPK008 - DBA R2 Packaging                                    *
      *         - Components run/to run counter increased to four.    *
      *  075277 - Correct copyright text (not annotated)              *
      *  E39162 - CHANGE 'PRINT' TO 'PRINT(MPRINT)'.                  *
      *  E28730 - ADD COUNTER TO COB SCREEN                           *
      *  E26775 - AMEND HELP TAGS TO REFERENCE THE MERGED SCINS.      *
      *  LN0397 - ADDITION OF HELP TO COB SCREENS                     *
      *                                                               *
      *****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
      ** Start of CPK025
      ** Start of CAAA02
     A******************                    INVITE
     A                                      INVITE                                            CPK025
      ** End of CAAA02
      ** End of CPK025
     A*********              START OF CHANGE               /E39162/
     A*********                             PRINT
     A                                      PRINT(MPRINT)
     A*                      END OF CHANGE                 /E39162/
     A*                                                        /LN0397/
     A*                                                        /LN0397/
     A          R CBMONF0                   TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A                                      KEEP
      ** Start of CPK025
      ** Start of CAAA02
     A******************                    UNLOCK
     A                                      UNLOCK                                            CPK025
      ** End of CAAA02
      ** End of CPK025
     A                                      PUTOVR
 
      ** Start of CPK025
      ** Start of CAAA02 (NOTE: The following lines ARE meaningful)
     A***********%%WB 6 FLD <!-- -->\r\n\r\n+
     A***********%%WB +<!-- Script to cause auto refresh -->\r\n\r\n+
     A***********%%WB +<script language="JavaScript">\r\n+
     A***********%%WB +\tsetTimeout("validateAndSubmit('ENTER')",600000);+
     A***********%%WB +\r\n</script>\r\n\r\n
      ** End of CAAA02
      ** End of CPK025
 
     A            USRID         10A  O  1  2TEXT('User ID')
     A                                  1 13'CBMON'
     A************TITLE         45A  O  2 20DSPATR(HI)                                        CPK014
     A************                          OVRDTA                                            CPK014
      ************                                                                            CPK014
     A                                  2 32'Midas Daily Processing'                          CPK014
     A                                      DSPATR(HI)                                        CPK014
     A                                      OVRATR
     A            RUNA           7A  O  1 72TEXT('Run date, DDMMMYY')
     A                                      OVRDTA
     A            SCWSID        10A  O  2  2OVRDTA
     A                                      TEXT('Job name')
     A            SCCURT         8A  O  2 71OVRDTA
     A                                  4  6'Close of Business processing began-
     A                                       at'
     A                                      OVRATR
     A            SCSTTI         8A  O  4 44OVRDTA
     A                                  4 57'Elapsed time'
     A                                      OVRATR
     A            SCELTI         8A  O  4 70OVRDTA
     A                                  6  6'Maximum number of active component-
     A                                      s:'
     A                                      OVRATR
     A            SCMAXA         2Y 0O  6 43EDTCDE(Z)
     A                                      OVRDTA
     A                                  7  6'Current number of active component-
     A                                      s:'
     A                                      OVRATR
     A**                                          /START OF FIX E28730/
      *                             Start of change /CPK008/
     A************SCRANA         3Y 0O  6 73EDTCDE(Z)
     A            SCRANA         4Y 0O  6 73EDTCDE(Z)
      *                               End of change /CPK008/
     A                                      OVRDTA
     A                                  6 48'Components already run :'
     A                                      OVRATR
      *                             Start of change /CPK008/
     A************SCRUNA         3Y 0O  7 73EDTCDE(Z)
     A            SCRUNA         4Y 0O  7 73EDTCDE(Z)
      *                               End of change /CPK008/
     A                                      OVRDTA
     A                                  7 48'Components still to run:'
     A                                      OVRATR
     A**                                            /END OF FIX E28730/
     A            SCCURA         2Y 0O  7 43EDTWRD('0 ')
     A                                      OVRDTA
     A                                  8  6'Number of failed components. . . .-
     A                                       :'
     A                                      OVRATR
     A  50                                  DSPATR(ND)
     A N50                                  DSPATR(HI)
     A            SCFAIL         2Y 0O  8 43EDTCDE(Z)
     A                                      OVRDTA
     A  50                                  DSPATR(ND)
     A N50                                  DSPATR(HI)
     A                                 11  2'Stream 0'
     A                                      OVRATR
     A            SCSTR0        70A  O 11 11OVRDTA
     A                                 12  2'Stream 1'
     A                                      OVRATR
     A N01                                  DSPATR(ND)
     A            SCSTR1        70A  O 12 11
     A N01                                  DSPATR(ND)
     A                                      OVRDTA
     A                                 13  2'Stream 2'
     A                                      OVRATR
     A N02                                  DSPATR(ND)
     A            SCSTR2        70A  O 13 11
     A N02                                  DSPATR(ND)
     A                                      OVRDTA
     A                                 14  2'Stream 3'
     A                                      OVRATR
     A N03                                  DSPATR(ND)
     A            SCSTR3        70A  O 14 11
     A N03                                  DSPATR(ND)
     A                                      OVRDTA
     A                                 15  2'Stream 4'
     A                                      OVRATR
     A N04                                  DSPATR(ND)
     A            SCSTR4        70A  O 15 11
     A N04                                  DSPATR(ND)
     A                                      OVRDTA
     A                                 16  2'Stream 5'
     A                                      OVRATR
     A N05                                  DSPATR(ND)
     A            SCSTR5        70A  O 16 11
     A N05                                  DSPATR(ND)
     A                                      OVRDTA
     A                                 17  2'Stream 6'
     A                                      OVRATR
     A N06                                  DSPATR(ND)
     A            SCSTR6        70A  O 17 11
     A N06                                  DSPATR(ND)
     A                                      OVRDTA
     A                                 18  2'Stream 7'
     A N07                                  DSPATR(ND)
     A            SCSTR7        70A  O 18 11
     A N07                                  DSPATR(ND)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 19  2'Stream 8'
     A N08                                  DSPATR(ND)
     A            SCSTR8        70A  O 19 11
     A N08                                  DSPATR(ND)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 20  2'Stream 9'
     A N09                                  DSPATR(ND)
     A            SCSTR9        70A  O 20 11
     A N09                                  DSPATR(ND)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 22  2'Press Attention key for C.O.B. Con-
     A                                      trol Menu'
     A                                      OVRATR
     A                                 24  2'(c) Finastra International +
     A                                      Limited +
     A                                      2001'
     A                                      OVRATR
     A                                      DSPATR(HI)
