      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GP Valid Booking Branches by User')              *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  PF/GPBRCBPD - Valid Booking Branches by User                 *
      *                                                               *
      *  (c) Finastra International Limited 2012                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CBF022  *CREATE    Date 16Jul12               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CBF022 - BF Infrastructure: Auditability                     *
      *                                                               *
      *****************************************************************
     A          R MBRBSDDF                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2012')
      *
     A            RECI           1A         TEXT('Record Id.')
     A                                      COLHDG('Rec.' 'Id.')
     A            USRP          10A         TEXT('User profile')
     A                                      COLHDG('User' 'Profile')
     A            BRCA           3A         TEXT('Booking branch')
     A                                      COLHDG('Book.' 'Brch.')
     A            LCD            5P 0       TEXT('Last change date')
     A                                      COLHDG('Last' 'Chg.' 'Date')
     A            CHTP           1A         TEXT('Type of last change')
     A                                      COLHDG('Last' 'Chg.' 'Type')
     A            LCT            7P 0       TEXT('Time of last change')
     A                                      COLHDG('Last' 'Chg.' 'Time')
     A            BBZONE        10A         TEXT('Zone')
     A                                      COLHDG('Zone')
      *
