      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  REUSEDLT(*YES)                                               *                       CGP016
/*EXI *  TEXT('Midas GP Branches Extension')                          *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  GPBRCHEXPD - Midas GP Branches Extension                     *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2004            *
      *                                                               *
      *  Last Amend No. CGP016             Date 06Aug12               *
      *  Prev Amend No. CER049             Date 06Dec10               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CGP001  *CREATE    Date 05Mar04               *
      *                                                               *
      *  --------------------------------------------------------------
      *                                                               *
      *  CGP016 - Global database - Re-use deleted records            *
      *  CER049 - Stamp Tax                                           *
      *  CGP001 - Global Processing                                   *
      *                                                               *
      *****************************************************************
      *
     A          R GPBRCHEXD0                TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2004')
      *
     A            BXBRCD         3          TEXT('Branch Code')
     A                                      COLHDG('Branch' ' Code')
      *
     A            BXACOC         2          TEXT('Account Officer Code')
     A                                      COLHDG('A/c Off' 'Code')
      ** Start of change CER049
     A            BXTAX          1A         TEXT('Stamp Tax Liable')
     A                                      COLHDG('Stamp Tax' +
     A                                             'Liable')
      ** End of change CER049
