      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  REUSEDLT(*YES)                                               *
/*EXI *  TEXT('Midas GP Facility increase/decrease internal file')    *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  PF/GPFCAMPD - Midas GP Facility increase/decrease internal   *
      *                file                                           *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2018            *
      *                                                               *
      *  Last Amend No. MD049445 *CREATE   Date 20Mar18               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD049445 - Listview not displaying correct available amount. *
      *             Added SFAMT and SAVAILAMT computation.            *
      *                                                               *
      *****************************************************************
     A          R GPFCAMD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2018')
      *
     A            GBRCA          3A         TEXT('Facility branch')
     A                                      COLHDG('Facility' 'Branch')
     A            GCNUM          6A         TEXT('Facility Customer')
     A                                      COLHDG('Facility' 'Customer')
     A            GFACT          3S 0       TEXT('Facility Type')
     A                                      COLHDG('Facility' 'Type')
     A            GFCNO          2S 0       TEXT('Facility Seq')
     A                                      COLHDG('Facility' 'Seq')
     A            GAAMT         13P 0       TEXT('FIFD Amount')
     A                                      COLHDG('FIFD' 'Amount')
     A            GZONE         10A         TEXT('Zone')
     A                                      COLHDG('Zone')
      *