      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GP ML Counterparty Excess')                      *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  PF/GPMLZPPD - ML Counterparty Excess                         *
      *                                                               *
      *  (c) Finastra Systems Technology, Inc. 2019                   *
      *                                                               *
      *  Last Amend No. DAI103             Date 25Jun19               *
      *  Prev Amend No. NADC01  *CREATE    Date 17Nov09               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  DAI103 - Upgraded MPlus 121 NADC01 ML Extracts to FB 2.1     *
      *  NADC01 - ML EXTRACTS FOR MIZUHO                              *
      *                                                               *
      *****************************************************************
     A          R GPMLZPD0                  TEXT('(C) Finastra Systems +
     A                                      Technology, Inc. 2019')
      *
     A            MECNCD         2A         TEXT('Country Code')
     A                                      COLHDG('Country Code')
     A            MECUSTNAME    28          TEXT('Customer & Report Name')
     A                                      COLHDG('Customer' +
     A                                      '& Name')
     A          K MECNCD
     A          K MECUSTNAME
      *
