      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GP Reference Field Values')                      *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  PF/GPPDWJPP - Midas GP Reference Field Values                *
      *                                                               *
      *  (c) Finastra International Limited 2011                      *
      *                                                               *
      *  Last Amend No. CTR004             Date 06Mar24               *
      *  Prev Amend No. MD062164           Date 06Dec23               *
      *                 MD046248           Date 27Oct17               *
      *                 CTR003  *CREATE    Date 29Sep11               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CTR004 - UDF reference fields length                         *
      *  MD062164 - (CTR003) - Increase size for field GLCODE.        *
      *  MD046248 - Finastra Rebranding                               *
      *  CTR003 - UDF Custom Reference Fields                         *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  C R E A T I O N     P A R A M E T E R S                      *
      *                                                               *
      *****************************************************************
      *
     A                                      REF(MFRFL)
     A          R SDPDWJD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2011')
      *
     A            GLRFNM        20          TEXT('GLRFNM')
     A                                      COLHDG('GLRFNM')
     A            GLRFDS        20          TEXT('GLRFDS')
     A                                      COLHDG('GLRFDS')
      * Start CTR004
     A            GLRFAT         1          TEXT('GLRFAT')
     A                                      COLHDG('GLRFAT')
      * End CTR004
      * Start MD062164
     A*********** GLCODE        20          TEXT('GLCODE')
     A            GLCODE        50          TEXT('GLCODE')
      * End MD062164
     A                                      COLHDG('GLCODE')
     A            GLDESC        50          TEXT('GLDESC')
     A                                      COLHDG('GLDESC')
     A            GLZONE        10          TEXT('Zone')
     A                                      COLHDG('Zone')
      *
      ********************************************************************
