      *****************************************************************
/*STD *  PFBASE
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Composite Currencies Details')
      *****************************************************************
      *                                                               *
      *  Midas - Bank of England                                      *
      *                                                               *
      *  PF/BYCCCYPP - 'Composite Currencies Details File'            *
      *                                                               *
      *  (C) Midas Kapiti International Limited, 1997                 *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. LLN007             DATE 03/03/97              *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  Amendment  Details                                           *
      *  ------------------                                           *
      *  LLN007 - Yellow Book Changes, *CREATE                        *
      *                                                               *
      *****************************************************************
      *
     A          R BYCCCYD0                  TEXT('(c) Midas Kapiti +
     A                                      International Limited 1997')
     A            L6RECI         1A         TEXT('Record Id')
     A                                      COLHDG('Rec Id')
     A            L6UTIM         6S 0       TEXT('Time of Update')
     A                                      COLHDG('Time of' 'Update')
     A            L6LCD          5P 0       TEXT('Last Change Date')
     A                                      COLHDG('Last Chg' 'Date')
     A            L6CHTP         1A         TEXT('Type of Last Change')
     A                                      COLHDG('Typ of' 'Lst Chg')
     A            L6CCCY         3A         TEXT('Composite Currency')
     A                                      COLHDG('Composite' 'Currency')
     A            L6CCYA        60A         TEXT('Currency Array (20 X 3A)')
     A                                      COLHDG('Currency Array' +
     A                                      '(20 x 3A)')
     A            L6PCTA       100A         TEXT('Percentage Array')
     A                                      COLHDG('Percentage Array')
      *
     A          K L6CCCY
