      *****************************************************************
/*STD *  PFBASE
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Securities Extract Details File')
      *****************************************************************
      *                                                               *
      *  Midas - Bank of England                                      *
      *                                                               *
      *  PF/BYSEEXPP - Security Extract Details File                  *
      *                                                               *
      *  (C) Finastra International Limited, 1997                     *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. LLN021             Date 24Aug03               *
      *                 LLN007             Date 06Mar97               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  Amendment  Details                                           *
      *  ------------------                                           *
      *  MD046248 - Finastra Rebranding                               *
      *  LLN021 - BoE Profit and Loss return                          *
      *  LLN007 - Yellow Book Changes, *CREATE                        *
      *                                                               *
      *****************************************************************
      *
     A          R BYSEEXD0                  TEXT('(c) Finastra +
     A                                      International Limited 1997')
     A            L5RECI         1A         TEXT('Record Id')
     A                                      COLHDG('Rec' 'Id')
     A            L5UTIM         6S 0       TEXT('Time of Update')
     A                                      COLHDG('Update' 'Time')
     A            L5LCD          5P 0       TEXT('Last Change Date')
     A                                      COLHDG('Last' 'Chg Date')
     A            L5CHTP         1A         TEXT('Type of Last Change')
     A                                      COLHDG('Last' 'Chg Type')
     A            L5SESN        10A         TEXT('Security Shortname')
     A                                      COLHDG('Security' 'Shortname')
     A            L5INVT         3A         TEXT('Investment Type')
     A                                      COLHDG('Inv' 'Type')
     A            L5LINS         2S 0       TEXT('Institution Code')
     A                                      COLHDG('Inst' 'Code')
      * LLN021 - Start                                                                        LLN021
     A            L5MIND         3A         TEXT('Industry code')                             LLN021
     A                                      COLHDG('Industry' 'Code')                         LLN021
      * LLN021 - End                                                                          LLN021
     A            L5PCOD         4S 0       TEXT('Product Code')
     A                                      COLHDG('Prod' 'Code')
      * LLN021 - Start                                                                        LLN021
     A            L5PLIR         4S 0       TEXT('PL Prod. Cd - Accr. Int. Rec')              LLN021
     A                                      COLHDG('Pr. Cd.' 'Accr.' 'Int. Rec')              LLN021
     A            L5PLIP         4S 0       TEXT('PL Prod. Cd - Accr. Int. Pay')              LLN021
     A                                      COLHDG('Pr. Cd.' 'Accr.' 'Int. Pay')              LLN021
     A            L5PLPL         4S 0       TEXT('PL Prod. Cd - Profit/Loss')                 LLN021
     A                                      COLHDG('Pr. Cd.' 'Profit' 'Loss')                 LLN021
     A            L5PLTX         4S 0       TEXT('PL Prod. Cd - Tax')                         LLN021
     A                                      COLHDG('Pr. Cd.' 'Tax')                           LLN021
      ******
     A*****       L5PLCG         4S 0       TEXT('PL Prod. Cd - Charges')                     LLN021
     A*****                                 COLHDG('Pr. Cd.' 'Charges')                       LLN021
     A*****       L5PLFT         2A         TEXT('PL Prod. Cd - Fee Type')                    LLN021
      *
     A            L5CCHG         4S 0       TEXT('PL Prod. Cd - Credit Charge')               LLN021
     A                                      COLHDG('Pr. Cd.' 'Credit' 'Charge')               LLN021
     A            L5CFEE         2A         TEXT('PL Prod. Cd - Credit fee typ')              LLN021
     A                                      COLHDG('Pr. Cd.' 'Credit' 'Fee Typ')              LLN021
     A            L5DCHG         4S 0       TEXT('PL Prod. Cd - Debit Charge')                LLN021
     A                                      COLHDG('Pr. Cd.' 'Debit' 'Charge')                LLN021
     A            L5DFEE         2A         TEXT('PL Prod. Cd - Debit Fee Type')              LLN021
     A                                      COLHDG('Pr. Cd.' 'Debit' 'Fee Type')              LLN021
      ******
      * LLN021 - End                                                                          LLN021
      *
     A          K L5INVT
     A          K L5LINS
