      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  REUSEDLT(*YES)                                               *                       CGP016
/*EXI *  TEXT('Midas GZ Depot movements Extension Detail')            *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  PF/GZDPTMVDQD - Depot Movements Extension Detail             *
      *                                                               *
      *  (c) Finastra International Limited 2006                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CGP016             Date 06Aug12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CAP185  *CREATE    Date 21Apr06               *
      *                 XXXXXX             Date                       *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CGP016 - Global database - Re-use deleted records            *
      *  CAP185 - MQ Series Interface                                 *
      *                                                               *
      *****************************************************************
     A          R DPTMVQD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2006')
      *
     A            DQDPBA         3A         TEXT('Branch')
     A                                      COLHDG('Branch')
     A            DQDPSS        10A         TEXT('Security shortname')
     A                                      COLHDG('Security' +
     A                                             'shortname')
     A            DQDPRN         6A         TEXT('Reference')
     A                                      COLHDG('Reference')
     A            DQDPMV         2A         TEXT('Movement type')
     A                                      COLHDG('Movement' +
     A                                             'type')
     A            DQFRID        20A         TEXT('Front office ID')
     A                                      COLHDG('Front' +
     A                                             'ofc ID')
