      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GZ Customer Extension SWIFT Details')            *
      *****************************************************************
      *                                                               *
      *  Midas - Global Processing Module                             *
      *                                                               *
      *  PF/GZSDCSSWPD - Customer Extension SWIFT Details             *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2014            *
      *                                                               *
      *  Last Amend No. MD025828 *CREATE   Date 05May14               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD025828 - [ENGINEERING] Listview of Maintain Customer       *
      *                                                               *
      *******************************************************************
     A          R SDCSSWD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2014')
     A            CSCUSD         6A         TEXT('Customer Number')
     A                                      COLHDG('Customer' +
     A                                             'Number')
     A            CSBRCA         3A         TEXT('Branch code')
     A                                      COLHDG('Branch Code')
     A            CSCICI         4A         TEXT('Investor Capacity Indicator')
     A                                      COLHDG('Investor' +
     A                                             'Capacity' +
     A                                             'Indicator')
     A            CSCPCI         4A         TEXT('Party Capacity Indicator')
     A                                      COLHDG('Party'    +
     A                                             'Capacity' +
     A                                             'Indicator')
     A            CSIBEI        10A         TEXT('Namespace')
     A                                      COLHDG('Namespace')
     A            CSLEIC        20A         TEXT('LEIC code')
     A                                      COLHDG('LEIC code')
     A            CSCLSY         2A         TEXT('Clearing System  Code')
     A                                      COLHDG('Clearing' +
     A                                             'System'   +
     A                                             'Code')
     A            CSCLID        15A         TEXT('Clearing Identification')
     A                                      COLHDG('Clearing' +
     A                                             'Identification')
     A            CSBDRK        12A         TEXT('Bank Directory Record Key')
     A                                      COLHDG('Bank Directory' +
     A                                             'Record Key')
