      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas GZ Branch Codes Extension Details')              *
      *****************************************************************
      *                                                               *
      *   Midas - Standing Data Module                                *
      *                                                               *
      *   PF/GZSDBRCHX0 - Global Branch Codes Extension Details       *
      *                                                               *
      *   (C) Copyright Finastra International Limited 2015          *
      *                                                               *
      *   Last Amend No. MD046248           Date 27Oct17              *
      *   PREV Amend No. CGL052             Date 02Dec15              *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *   MD046248 - Finastra Rebranding                              *
      *   CGL052  - Amend Washout Processing                          *
      *                                                               *
      *****************************************************************
      *
     A          R SDBRCHF0                  TEXT('(c) Finastra International -
     A                                      Limited 2015')
      *
     A            A8BRCD         3          TEXT('Branch Code')
     A                                      COLHDG('Branch' +
     A                                             'Code')
     A            A8ATEY         1          TEXT('Allow Transfer at Year End')
     A                                      COLHDG('Allow' +
     A                                             'Transfer' +
     A                                             'at EoY')
     A            ZZ252        251          TEXT('Filler')
     A                                      COLHDG('Filler')
     A            A8ZONE        10A         TEXT('Zone')
     A                                      COLHDG('Zone')
