      *****************************************************************
/*STD *  PRTFBASE                                                     *
/*EXS *  PR_STD60J                                                    *
/*EXI *  TEXT('Midas CG UDC print address labels')
/*ADD *  CHGPRTF FILE(CG3500P1) PAGESIZE(200 200) OVRFLW(200)         *
      *****************************************************************
      *                                                               *
      *  Midas - User Defined Correspondence                          *
      *                                                               *
      *  CG3500P1 -  Print labels                                     *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD053             Date 01Jun06               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 S01522             Date 21Dec94               *
      *   PREV AMEND NO. X00000            DATE 00XXX00               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSD053 - Correspondence Manager Multilanguage Upgrade        *
      *   S01522 - User Defined Correspondence                        *
      *                                                               *
      *****************************************************************
      *
     A          R CG3500F1                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      **Start of change CSD053
     A**********  #PLIN        200         1                                                  CSD053
     A            #PLIN        200O        1
      **End of change CSD053
     A                                      SPACEA(1)
      *
     A          R CG3500F2
     A                                      SKIPB(1)
