      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas AK Account keys generation module selection')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Account Key Generator
     A*                                                               *
     A*    AK0010DF - Account Keys Generation Module Selection        *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.03 -----------------------------------------------*
      *  Prev Amend No. 127177             Date 22Nov99               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 103747             Date 18Jun96               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
     A*  127177 - *IN31 should be used for option 5 not option 4.     *
     A*           Since *IN31 is OFF if SEACKD/XSEACKD is not         *
     A*           allocated by another job and Option 5 is for        *
     A*           Securities and Option 4 is for Lending.             *
     A*     103747  -  Determine the only valid options.              *
     A*                                                               *
     A*****************************************************************
     A                                      PRINT(MPRINT)
     A                                      CF03(03)
     A          R MENUF
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A                                      PUTOVR
     A                                      OVERLAY
     A            USRID         10A  O  1  2
     A                                  1 13'AK0010'
     A            RUNA           7A  O  1 72
     A            WSID          10A  O  2  2
     A                                  2 20'Module Selection for Account Key -
     A                                      Generation'
     A                                      DSPATR(HI)
     A                                  2 71TIME
     A                                      EDTWRD('  :  :  ')
     A            OPT1          24A  O  5 26OVRDTA
     A*                                            Begin /103747/
     A*                                              Begin /127177/
     A**30******                            DSPATR(ND)
     A*                                              End   /127177/
     A*                                            End   /103747/
     A            OPT2          24A  O  7 26OVRDTA
     A*                                            Begin /103747/
     A*                                              Begin /127177/
     A**30******                            DSPATR(ND)
     A*                                              End   /127177/
     A*                                            End   /103747/
     A            OPT3          24A  O  9 26OVRDTA
     A*                                            Begin /103747/
     A*                                              Begin /127177/
     A**30******                            DSPATR(ND)
     A*                                              End   /127177/
     A*                                            End   /103747/
     A            OPT4          24A  O 11 26OVRDTA
     A*                                            Begin /103747/
     A*                                              Begin /127177/
     A**31*******                           DSPATR(ND)
     A*                                              End   /127177/
     A*                                            End   /103747/
     A            OPT5          24A  O 13 26OVRDTA
     A*                                            Begin /103747/
     A*                                              Begin /127177/
     A**30*******                           DSPATR(ND)
     A*                                              End   /127177/
     A*                                            End   /103747/
     A            OPT6          24A  O 15 26OVRDTA
     A*                                            Begin /103747/
     A  30                                  DSPATR(ND)
     A*                                            End   /103747/
     A            OPT7          24A  O 17 26OVRDTA
     A*                                            Begin /103747/
     A  30                                  DSPATR(ND)
     A*                                            End   /103747/
     A                                 20 20'Enter letter to select module:'
     A                                      DSPATR(HI)
     A            OPTION         1A  B 20 53OVRDTA
     A N99                                  DSPATR(UL HI)
     A  99                                  DSPATR(RI PC)
     A                                 23  2'F3=Main Menu'
     A*
     A          R #MSGRCD                   TEXT('Program messages')
     A                                      SFL SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            SPGMQ                     SFLPGMQ
     A*
     A          R #MSGCTL                   TEXT('Program messages')
     A                                      SFLCTL(#MSGRCD)
     A                                      SFLPAG(01) SFLSIZ(03)
     A                                      OVERLAY
     A                                      SFLINZ SFLDSP SFLDSPCTL
     A  27
     AON27                                  SFLEND
     A            SPGMQ                     SFLPGMQ
