      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas temporary NATN data area')
     A*****************************************************************
     A*                                                               *
     A*  Midas STANDING DATA MODULE
     A*                                                               *
     A*  PF/MNTMPR      TEMPORARY NEXT AVAILABLE TRANSACTION          *
     A*                 NUMBER DATA AREA.                             *
     A*                                                               *
     A*  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  PREV AMEND NO.  E21722            DATE 31JUL90               *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  NOTE: Any fix applied to this file may also need to be       *
     A*        applied to the core DTAARA source.                     *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  MD046248 - Finastra Rebranding                               *
     A*  E21722  -  Creation of PF reflecting layout of DTAARA with   *
     A*             the same name.                                    *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A*                                                                /E21722/
     A          R MNTMPRF
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            NATN           5S 0       TEXT('Next Available Transaction +
     A                                      Number.')
     A*                                                                /E21722/
