/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SD ARRCALC_xx Lock Data Area Layout')            *
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/SDARRCLCK - ARRCALC_xx Lock Data Area Layout              *
      *                                                               *
      *  (c) Finastra International Limited 2020                      *
      *                                                               *
      *  Last Amend No. CSD103  *CREATE    Date 10Aug20               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSD103 - LIBOR Deregulation - Common Layer/Standing Data     *
      *                                                               *
      *****************************************************************
     A          R SDARRCD0                  TEXT('(c) Finastra +
     A                                      International Limited +
     A                                      2020')
     A            LOCK           1A         TEXT('Lock')
     A                                      COLHDG('Lock')
