      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXI *  TEXT('Midas RN - New FTP Log file')
/*E*I****MBR(*NONE)*MAXMBRS(*NOMAX)************************************                     BUG10233
/*EXS *  PF_STD                                                       *                     BUG10233
      *                                                               *
      *****************************************************************
      *                                                               *
      *   Midas - FRS Interface Module                                *
      *                                                               *
      *   RNFTPLPD   - FTP Log file                                   *
      *                                                               *
      *   (c) Finastra International Limited 2005                     *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. BUG10233           Date 31Jan06               *
      *                 CRN001  *CREATE    Date 03Oct05               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *   BUG10233 - Change of creation parameters so that 1 member   *
      *              will be added automatically.                     *
      *   CRN001 - Regulatory Reporting Interface                     *
      *                                                               *
      *****************************************************************
 
     A          R RNFTPLPDF
 
     A            FCLOG        256          TEXT('FTP Log')
