      *****************************************************************
/*STD *  LFBASE                                                       *
/*EXS *  LF_RB                                                        *
/*EXI *  TEXT('Midas AS Hedge Linkage File for SE Transactions')      *
      *****************************************************************
      *                                                               *
      *  Midas - Accounting Standards Module                          *
      *                                                               *
      *  LF/ASHTRNJ0 - Midas AS Hedge Transaction file with Linkage   *
      *                details                                        *
      *                                                               *
      *  (c) Finastra International Limited 2004                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *                 CAS008  *CREATE    Date 11May04               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CLE148 - Alpha Loan Reference (Recompile)                    *
      *  CAS008 - Delayed Hedge Assessment                            *
      *                                                               *
      *****************************************************************
      *
     A                                      DYNSLT
     A          R @HTRNJ0
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2004')
      *
     A                                      JFILE(ASHTRNPD ASHGLKPD)
     A          J                           JOIN(1 2)
     A                                      JFLD(FSHEDI FSHEDI)
      *
     A            FSRECI
     A            FSHEDI                    JREF(ASHTRNPD)
     A            FSHGST
     A            FSFPSE
     A            FSEFFD
     A            FSNDTA
     A            FSLASD
     A            FSMOD
     A            FSDTTP
      *
     A          K FSFPSE
      *
     A          S FSMOD                     COMP(EQ 'SE')
     A            FSRECI                    COMP(EQ 'D')
