      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_NMSN                                                      *
/*EXI *  TEXT('Midas MR MBI Extract Key Details File')                *
      *****************************************************************
      *                                                               *
      *  Midas - MidasPlus Reporting Module                           *
      *                                                               *
      *  MRKEYDPD - Kiles to upload to MBI                            *
      *                                                               *
      *  (c) Finastra International Limited 2011                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. AR828013 *CREATE   Date 12Sep11               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  AR828013 - Incremental database for MBI (CCR036)             *
      *                                                               *
      *****************************************************************
     A                                      UNIQUE
     A          R MRKEYDD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2011')
 
     A            MKFNAM        10          COLHDG('Filename')
     A                                      TEXT('File Name')
 
     A            MKKEYF        10          COLHDG('Keyed Filename')
     A                                      TEXT('Keyed File Name')
 
     A            MKRFMT        10          COLHDG('Record Format')
     A                                      TEXT('Key Record Format')
 
     A            MKFLDN        10          COLHDG('Field Name')
     A                                      TEXT('Fieldname')
 
     A            MKFLDL         5S 0       COLHDG('Field Length')
     A                                      TEXT('Field Length')
 
     A            MKFLDP         5S 0       COLHDG('Field Position')
     A                                      TEXT('Field Position')
 
     A          K MKFNAM
     A          K MKFLDN
