      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_15                                                        *
/*EXI *  TEXT('Midas TS Book Details')
     A*****************************************************************
     A*                                                               *
     A*  Midas - TRADER SUPPORT MODULE                                *
     A*                                                               *
     A*     PF/TSMBOKPD - TRADER SUPPORT BOOK DEATILS                *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *  Prev Amend No. CSE006             Date 27Jan00               *
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*         LAST AMEND NO. 000000    DATE   00XXX00               *
     A*                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CSE006 - Repurchase Agreements enhancements - Recompile      *
      *                                                               *
     A*****************************************************************
     A          R SDBOOKD0                  FORMAT(SDBOOKPD)
