      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas TS Deal Subtypes')
     A*****************************************************************
     A*                                                               *
     A*  Midas - TRADER SUPPORT MODULE                     *
     A*                                                               *
     A*     PF/TSMDLSPD - TRADER SUPPORT DEAL SUB TYPES              *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. CSD031             Date 10Apr06               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*         Prev amend no. 000000    DATE   00XXX00               *
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*---------------------------------------------------------------*
      *                                                               *
      *  CSD031 - Enhanced Centralised Static Data (Recompile)        *
     A*                                                               *
     A*****************************************************************
     A          R SDDLSTD0                   FORMAT(SDDLSTPD)
