      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas TS Market Centres (Detail)')                     *
     A*****************************************************************
     A*                                                               *
     A*  Midas - TRADER SUPPORT MODULE                     *
     A*                                                               *
     A*     PF/TSMMARPD - TRADER SUPPORT MARKET CENTRES (DETAIL)     *
     A*                                                               *
      *  (c) Finastra International Limited 2001                      *
     A*                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CAP208             Date 06Dec10               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.02 -----------------------------------------------*
      *                 CPB001             Date 23Aug99               *
      * Midas DBA 3.0 --------------- Base ---------------------------*
     A*                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CAP208 - F&O Market Instrument API (Recompile)               *
     A*  CPB001 - 'Private Banking' Module                            *
     A*           Recompiled due to changes in PF/MARKTD.             *
     A*****************************************************************
     A*                                                               *
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A          R MARKTDF                   FORMAT(MARKTD)
