      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas SM Unique user / booking branch combination')    *
      *****************************************************************
      *                                                               *
      *  Midas - Implementation module                                *
      *                                                               *
      *  SMBFUBPD - Unique user / booking branch combination          *
      *                                                               *
      *  (c) Finastra International Limited 2011                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      *  Prev Amend No. CBF005  *CREATE    Date 04Jul11               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CBF005 - BF Infrastructure: Single Security User Maintenance *
      *           Profile                                             *
      *                                                               *
      *****************************************************************
      *
     A          R SMBFUBD0                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2011')
      *
     A            UBUSER        10          TEXT('User')
     A                                      COLHDG('User')
     A            UBBRCH         3          TEXT('Branch')
     A                                      COLHDG('Brch')
     A            UBROLE        40          TEXT('Role')
     A                                      COLHDG('Role')
