      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas UP Global files to update')
      *****************************************************************
      *                                                               *
      *  Midas - Standing Data Module                                 *
      *                                                               *
      *  PF/UPRFRFPD -  Global files to update in system refresh      *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2007            *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      *  Last Amend No. CSC033 *CREATE     Date 01May07               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  CSC033 - Include global libraries in backups                 *
      *                                                               *
      *****************************************************************
     A          R UPRFRFD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A*---------------------------------------------------------------------
     A            UPGFIL        10          TEXT('Global file')
     A                                      COLHDG('Global' +
     A                                             'File' 'Name' )
     A            UPZOBR         1          TEXT('Zone or branch')
     A                                      COLHDG('Zone' 'or' 'Branch')
     A            UPKFLD        10          TEXT('Field Name')
     A                                      COLHDG('Field' +
     A                                             'Name' )
