      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Bank of England Country Codes')
      *****************************************************************
      *                                                               *
      *  Midas - Bank of England                                      *
      *                                                               *
      *  PF/BYCNTYPP - Bank of England Country Codes                  *
      *                                                               *
      *  (C) Midas Kapiti International Limited, 1997                 *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. LNN007             DATE 04MAR97               *
      *  Prev Amend No. xxxxxx             DATE DDMMMYY               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  Amendment  Details                                           *
      *  ------------------                                           *
      *                                                               *
      *  LLN007 - Yellow Book Changes    *CREATE                      *
      *                                                               *
      *****************************************************************
      *
     A          R BYCNTYD0                  TEXT('(c) Midas Kapiti +
     A                                      International Limited 1997')
     A            LBCNCD         4A         TEXT('BoE Country Code')
     A                                      COLHDG('BoE Ctry' 'Code')
     A            LBCNNM        28A         TEXT('Country Name')
     A                                      COLHDG('Country Name')
     A            LBISOC         2A         TEXT('ISO Country Code')
     A                                      COLHDG('ISO Ctry' 'Code')
     A
      *
