      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Bank of England Industry Codes')
      *****************************************************************
      *                                                               *
      *  Midas - Bank of England                                      *
      *                                                               *
      *  PF/BYINDRPP - Bank of England Industry Codes                 *
      *                                                               *
      *  (C) Midas Kapiti International Limited, 1997                 *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Last Amend No. LNN007             DATE 04MAR97               *
      *  Prev Amend No. xxxxxx             DATE DDMMMYY               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  Amendment  Details                                           *
      *  ------------------                                           *
      *                                                               *
      *  LLN007 - Yellow Book Changes    *CREATE                      *
      *                                                               *
      *****************************************************************
      *
     A          R BYINDRD0                  TEXT('(c) Midas Kapiti +
     A                                      International Limited 1997')
      *
     A            LCMIND         3A         TEXT('Midas Industry Code')
     A                                      COLHDG('Midas' 'Ind Cd')
     A            LCBIND         5A         TEXT('Bank of England +
     A                                             Industry Code')
     A                                      COLHDG('BoE Inst Cd')
     A            LCINAR        36A         TEXT('Industry Code Narrative')
     A                                      COLHDG('Industry Code' +
     A                                             ' Narrative')
      *
