      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_NMSN                                                      *
/*EXI *  MBR(*NONE)                                                   *
/*EXI *  TEXT('Midas ED Bulk transfer data')
      *****************************************************************
      *                                                               *
      *  Midas - Export data Module                                   *
      *                                                               *
      *  PF/EDBULKPD - Bulk Transfer Data                             *
      *                                                               *
      *  (c) Finastra International Limited 2001                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *  Prev Amend No. CPK009  *CREATE    Date 22Sep99               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CPK009 - Source created for an existing Midas file that      *
      *           had no core source. As a result the format name     *
      *           does not conform to naming conventions as the       *
      *           existing file did not.                              *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
      *
     A          R EDBULKPD                  TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
      *
     A            EDBULKPD    4096
      *
