      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_NM                                                        *
/*EXI *  MBR(GEN1)                                                    *
/*EXI *  TEXT('Midas ED Extract of lending margin a/c keys')          *
/*ADDA*: ADDPFM FILE(EDMKEYPD) MBR(GEN2) SHARE(*YES)                : *   E18008
      *****************************************************************
      *                                                               *
      *   Midas - Midas Export Data Module                            *
      *                                                               *
      *   PF/EDMKEYPD - ED EXTRACT OF LENDING MARGIN A/C KEYS         *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *  Last Amend No. CLE148             Date 23Jul12               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CSD027             Date 25Nov05               *
      *                 CLE042             Date 06Sep05               *
      *                 CGL029             Date 01Sep03               *
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *                 CED006  *CREATE    Date 22Jul97               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  CLE148 - Alpha Loan Reference                                *
      *  CSD027 - Conversion Of Customer Number to Alpha              *
      *  CLE042 - Extended Loan Sub Type                              *
      *  CGL029 - Increase Account Code to 10 digits                  *
      *   CED006  -  ED Enhancements                                  *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R EDMKEYD0                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A            RECI      R
     A*                                              Begin /CLE042/
     A************AKEY      R
     A            QQAKEY        10A
     A*                                              End   /CLE042/
      **Start of change CLE148
     A**********  LNNO      R                                                                 CLE148
     A            LNNO           6A         TEXT('Loan number')
     A                                      COLHDG('Loan' 'Number')
      **End of change CLE148
      * Begin /CSD027/
     A**********  CNUM      R                                                                 CSD027
     A            CNUM           6A
     A                                      TEXT('Customer number')
     A                                      COLHDG('Customer            ' +
     A                                      'Number')
      * End /CSD027/
     A            BRCA      R
     A            ACSQ      R
     A            EDAT      R
     A            EAMT      R
     A            ECCY      R
     A            SETP      R
     A**Start of change CGL029
     A**********  OSAC      R                                                                 CGL029
     A            OSACQQ        12A
     A**End of change CGL029
     A            REVI      R
     A            OTHA      R
     A            OTHC      R
     A            EXRT      R
     A            STDT      R
     A            SLID      R
     A            MDAT      R
     A            BRTT      R
     A            BRTE      R
     A            RTSP      R
     A            INTR      R
     A            SSEQ      R
     A            CPAM      R
     A            PACD      R
     A            ICBS      R
     A            ACOF      R
     A            ZZ002     R
     A            FACO      R
     A            PRFC      R
     A            OSBR      R
     A            BOKC      R
     A            PELAP     R
     A            ORED      R
      **Start of change CLE148
     A**********  OLNO      R               REFFLD(OLNO0)                                     CLE148
     A            OLNO           6A
      **End of change CLE148
     A            PTFR      R
     A            AYLNPT    R               REFFLD(PTYP)
     A            AGRDNB    R               REFFLD(VDAT)
     A                                      TEXT('Extract Date')
     A                                      COLHDG('Extract Date')
     A**Start of change CGL029
     A            OSAC          18A
     A**End of change CGL029
     A*                                              Begin /CLE042/
     A            AKEY          14A         TEXT('Account Key')
     A                                      COLHDG('Account' 'Key')
     A*                                              End   /CLE042/
