      *****************************************************************
      *  Start of /COPY BA3100_021                                    *
      *****************************************************************
      *                                                               *
      *  Last Amend No. BA3100  *CREATE     Date 01Sep22              *
      *  Prev Amend No. nnnnnn              Date ddmmmyy              *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  BA3100 - MT103 and MT202 message details changes for         *
      *           Target 2 RTGS System                                *
      *                                                               *
      *****************************************************************
      *
      ** If message to be created is a MT103, write additional msg 110.
      *
     C           BA3100    IFEQ 'Y'
     C           TARG      IFEQ 'Y'
     C                     ADD  1         X
     C           X         OCUR MULT
     C                     MOVEL':103:'   MTAG
     C                     MOVEL'TGT'     MFLD
     C                     WRITEMGOMSGD0               06
     C                     MOVEL*BLANK    MTAG
     C                     MOVEL*BLANK    MFLD
     C           *IN06     IFEQ *ON
     C           *LOCK     IN   LDA
     C                     Z-ADD30        DBASE
     C                     MOVEL'*WRITE ' DBKEY
     C                     MOVEL'MGOMSGPD'DBFILE
     C                     OUT  LDA
     C                     EXSR *PSSR
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *****************************************************************
      *  End of /COPY BA3100_021                                      *
      *****************************************************************
