      *****************************************************************                       DAI101
      *                                                               *                       DAI101
      *  Midas - General Ledger Module                                *                       DAI101
      *                                                               *                       DAI101
      *  DAI101_013 - Midas GL Amount accrual input screen            *                       DAI101
      *                                                               *                       DAI101
      *  (c) Finastra Systems Technology, Inc. 2019                   *                       DAI101
      *                                                               *                       DAI101
      *  Last Amend No. DAI101  *CREATE    Date 17May19               *                       DAI101
      *                                                               *                       DAI101
      *---------------------------------------------------------------*                       DAI101
      *                                                               *                       DAI101
      *  DAI101 - Upgrade to FB Midas                                 *                       DAI101
      *                                                               *                       DAI101
      *****************************************************************                       DAI101
     A N67N69 25                       24  2'F3=Exit  F12=Initial screen  F9=-                DAI101
     A                                      Authorise'                                        DAI101
      *****************************************************************                       DAI101
      * End of /COPY DAI101_013                                       *                       DAI101
      *****************************************************************                       DAI101
