      *****************************************************************
      *                                                               *
      *  Last Amend No. DUG502 *Created    Date 04Dec17               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  DUG502 - Security Diary Enhancements                         *
      *                                                               *
      *****************************************************************
      *                                                                                       DUG502
      ** Externally described DS for SAR details                                              DUG502
     D SCSARD        E DS                  EXTNAME(SCSARDPD)                                  DUG502
     D SLCD          E                     EXTFLD(LCD)                                        DUG502
