      *****************************************************************
      *                                                               *
      *  Last Amend No. DUG502 *Created    Date 28Feb18               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  DUG502 - Security Diary Enhancements                         *
      *                                                               *
      *****************************************************************
     I*/OMITEND
     I                                          SDSN          L1M4                            DUG502
     I                                          SDED          L1M3                            DUG502
     I                                          SDET          L1M2                            DUG502
     I                                          SDBK          L1M1                            DUG502
