      *****************************************************************
      *                                                               *
      *  SE2450 - ENTRY GENERATION & MISSING ACCOUNT KEYS REPORT      *
      *                                                               *
      *  Last Amend No. DUG501 *Created    Date 23Aug17               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  DUG501 - Accounts Split for Realised P&L and Account Seq     *
      *           by Book                                             *
      *                                                               *
      *****************************************************************
      ** Get the Book Default Acc Sequence number
      *
     C           DUG501    IFEQ 'Y'
      *
     C           THBKCD    CHAINXXBOOKY0             81
      *
     C           *IN81     IFEQ *ON
     C           *LOCK     IN   LDA
     C                     SETON                     U7U8
     C                     MOVE 'XXBOOKX0'DBFILE           ***************
     C                     MOVELTHBKCD    DBKEY            * DB ERROR 900*
     C                     Z-ADD900       DBASE            ***************
     C                     OUT  LDA
     C                     DUMP
     C                     GOTO DBERR
     C                     END
      *
     C                     ENDIF
      *