      *****************************************************************
      *                                                               *
      *  Last Amend No. DUG502 *CREATE     Date 04Dec17               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  DUG502 - Security Diary Enhancements                         *
      *                                                               *
      *****************************************************************
      *                                                                                       DUG502
     C                   If        DUG502 = 'Y'                                               DUG502
     C                   READ      XXSEDEL3                               10                  DUG502
     C                   Else                                                                 DUG502
