      *****************************************************************
      *                                                               *
      *  Last Amend No. DUG506  *Create    Date 24Nov17               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  DUG506 - Report changes to SE0800 and SE1130                 *
      *                                                               *
      *****************************************************************
     A*/OMITEND
     A N38                                 7'SECURITY'
     A  38                                 2'SECURITY'
     A  38                                46'CURRENCY'
