      *****************************************************************
      *                                                               *
      *  Last Amend No. DUG502 *CREATE     Date 04Dec17               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  DUG502 - Security Diary Enhancements                         *
      *                                                               *
      *****************************************************************
      *                                                                                       DUG502
     C                   If        DUG502 ='Y'                                                DUG502
     C                   If        SDPP > 0                                                   DUG502
     C                   Move      '+'           DDAORS                                       DUG502
