     A*****************************************************************
     A*                                                               *
      *  Last Amend No. EML108             Date 13Jan20               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  EML108 - Upgrade FMD003 to FBM21.1SP21                       *
      *                                                               *
      *****************************************************************
     A  40                             17  8'SELECT ACCOUNT CURRENCY'
     A  40        ACCY           4A  B 17 65
     A  40                                  DSPATR(UL)
     A  40 41                               DSPATR(RI)
     A  40 41                               DSPATR(PC)
