      *****************************************************************
      *                                                               *
      *  FTVSCHG   - Validate OP Sender's Charges                     *
      *                                                               *
      *  Last Amend No. ERZ247  *CREATE    Date 22Nov19               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  ERZ247 - Field 71F in MT103 for GPI                          *
      *                                                               *
      *****************************************************************
      *
      *                                                                                       ERZ247
      ** Externally described DS for SAR details                                              ERZ247
     D SCSARD        E DS                  EXTNAME(SCSARDPD)                                  ERZ247
                                                                                              ERZ247
      ** First DS for access programs, short data structure                                   ERZ247
     D DSFDY         E DS                  EXTNAME(DSFDY)                                     ERZ247
                                                                                              ERZ247
