000100200820      *****************************************************************                     MD056352
000101200820      *                                                               *                     MD056352
000102200826      *  ERZ247_022 - Midas FT /COPY for FTVSCHG                      *                     MD056352
000103200820      *                                                               *                     MD056352
000104200820      *  Last Amend No. MD056352 *CREATE   Date 20Aug20               *                     MD056352
000105200820      *                                                               *                     MD056352
000106200820      *---------------------------------------------------------------*                     MD056352
000107200820      *                                                               *                     MD056352
000108200820      *  MD056352 - ERZ247: Our commission is not displayed for       *                     MD056352
000109200826      *             incoming messages.                                                      MD056352
000110200820      *                                                               *                     MD056352
000111200820      *---------------------------------------------------------------*                     MD056352
000112200820                                                                                            MD056352
000113200826     C                   MOVEL     *BLANKS       WPREFM1                                    MD056352
000114200826     C                   MOVEL     SPREF         WPREFM1                                    MD056352
000115200826     C                   IF        WPREFM1 <> WPREFM2                                       MD056352
000116200826     C                   MOVEL     'N'           WALREADY                                   MD056352
000117200826     C                   ENDIF                                                              MD056352
