      *---------------------------------------------------------------*
      *   Last Amend No. MD31937            Date 23Jan15              *
      *   Last Amend No. AR856737           Date 13Sep11              *
      *   LAST AMEND NO. EEE065              Date  29Sep2004          *
      *---------------------------------------------------------------*
      *   MD31937  - Upgrade STP enhancements to BF Midas 2.1         *
      *   AR856737 - Upgrade STP enhancements to Midas Plus level     *
      *   EEE065 - FT Payment Routing                                 *
      *---------------------------------------------------------------*
      * Define key                                                                            ERN056
     C           KMPV0     KLIST                                                              ERN056
     C                     KFLD           K#MSGR  80                                          ERN056
     C                     KFLD           K#KPRT  30                                          ERN056
      *                                                                                       ERN056
      * If OP/IN payment attached to network message then process                             ERN056
     C           *IN60     IFEQ *ON                                                           ERN056
     C           OPMSGR    ANDNE*ZERO                                                         ERN056
     C           OPKPRT    ANDNE*ZERO                                                         ERN056
     C           *IN60     OREQ *OFF                                                          ERN056
     C           INMSGR    ANDNE*ZERO                                                         ERN056
     C           INKPRT    ANDNE*ZERO                                                         ERN056
      *                                                                                       ERN056
      * Set up OP/IN message reference/part key fields                                        ERN056
     C                     SELEC                                                              ERN056
     C           *IN60     WHEQ *ON                                                           ERN056
     C                     Z-ADDOPMSGR    K#MSGR                                              ERN056
     C                     Z-ADDOPKPRT    K#KPRT                                              ERN056
     C           *IN60     WHEQ *OFF                                                          ERN056
     C                     Z-ADDINMSGR    K#MSGR                                              ERN056
     C                     Z-ADDINKPRT    K#KPRT                                              ERN056
     C                     ENDSL                                                              ERN056
      *                                                                                       ERN056
      * Access Payment Routes for OP payments                                                 EEE065
     C           *IN60     IFEQ *ON                                                           EEE065
     C           KMPV0     CHAIN@MROTV0              87                                       EEE065
      *                                                                                       EEE065
      * Update Midas payment reference if required                                            EEE065
     C           *IN87     IFEQ *OFF                                                          EEE065
     C                     MOVELPREF      MOOPRF                                              EEE065
     C                     UPDAT@MROTV0                                                       EEE065
     C                     ENDIF                                                              EEE065
     C                     ENDIF                                                              EEE065
     C                     ENDIF                                                              ERN056
      *---------------------------------------------------------------*                       ERN056
      *                                                                                       EEE065
