      *---------------------------------------------------------------*
      *   Last Amend No. MD031937           Date 13Jan15              *
      *   Prev Amend No. AR856737           Date 13Sep11              *
      *                  EEE065   *Create    Date  05Oct04            *
      *---------------------------------------------------------------*
      *                                                               *
      *   MD031937 - Upgrade STP enhancements to BF Midas 2.1         *
      *   AR856737 - Upgrade STP enhancements to Midas Plus level     *
      *   EEE065 - FT Payment Routing                                 *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                                   EEE065
      * Define key                                                        EEE065
     C           KOP       KLIST                                          EEE065
     C                     KFLD           OPMSGR                          EEE065
     C                     KFLD           OPKPRT                          EEE065
      *                                                                   EEE065
      * If OP payment attached to network message then process            EEE065
     C           OPMSGR    IFNE *ZERO                                     EEE065
     C           OPKPRT    ANDNE*ZERO                                     EEE065
      *                                                                   EEE065
     C           KOP       CHAIN@MROTV1              86                   EEE065
      *                                                                   EEE065
     C           *IN86     IFEQ *OFF                                      EEE065
     C           MOSTDA    ANDNE*ZERO                                     EEE065
     C                     MOVEL'Z'       KPYRE                           EEE065
     C                     MOVELSMCY      ECCY                            EEE065
     C                     Z-ADDMOSTDA    EAMT                            EEE065
     C                     EXSR WRIT                                      EEE065
     C                     ENDIF                                          EEE065
      *                                                                   EEE065
     C                     ENDIF                                          EEE065
