      *****************************************************************
      *                                                               *
      *  FTOPAYUPD - Midas FT Outgoing payments database update       *
      *                                                               *
      *  Last Amend No. ERZ248  *CREATE    Date 18Nov19               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  ERZ248 - SWIFT UETR via OPAY API                             *
      *                                                               *
      *---------------------------------------------------------------*
      *
     C                   If        ERZ248 = 'Y'                                 ERZ248
     C                   CALLB     'FTVUETRU'                                   ERZ248
     C                   PARM                    @RTCD                          ERZ248
     C                   PARM                    OTPREF                         ERZ248
     C                   PARM                    V@UETR                         ERZ248
     C                   EndIf                                                  ERZ248
      *
