      *****************************************************************
      *                                                               *
      *  Midas - /COPY Member FTOPAY1VL                               *
      *                                                               *
      *  FTOPA1VC16 - Midas FT EndIF                                  *
      *                                                               *
      *  Last Amend No. HUT106  *CREATE    Date 06Mar20               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  HUT106 - Upgrade HUT012 to FBM 2.1 SP22                      *
      *           Allow FISC Bank Reference to be entered in SWIFT    *
      *           ID Field.                                           *
      *                                                               *
      *****************************************************************
      *                                                                                       HUT106
     C                   ENDIF                                                                HUT106
      *                                                                                       HUT106
      *****************************************************************
      * End of /COPY FTOPA1VC16                                       *
      *****************************************************************
