      *****************************************************************
      *                                                               *
      *  MIDAS - /COPY MEMBER (GL0065)                                *
      *                                                               *
      *  GL0065CP35 - Midas GL Balance Statements                     *
      *                                                               *
      *  Last Amend No. UUC102 *CREATE  Date 16Oct20                  *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  UUC102 - Upgrade of CAR UUC063 to BF Midas 2.1               *
      *           UUC063 - Balance Statement Enhancement              *
      *                                                               *
      *****************************************************************
      *                                                                   UUC102
      **  Check to see if SAR is installed.                               UUC102
     C                     MOVE 'N'       UUC102  1                       UUC102
     C                     MOVE *OFF      *INKP                           UUC102
     C                     CALL 'AOSARDR0'                                UUC102
     C                     PARM '       ' @RTCD                           UUC102
     C                     PARM '*VERIFY' @OPTN                           UUC102
     C                     PARM 'UUC102'  @SARD   6                       UUC102
     C           SCSARD    PARM SCSARD    DSFDY                           UUC102
      *                                                                   UUC102
     C           @RTCD     IFEQ *BLANKS                                   UUC102
     C                     MOVE 'Y'       UUC102                          UUC102
     C                     MOVE *ON       *INKP                           UUC102
     C                     END                                            UUC102
      *                                                                   UUC102
     C           UUC102    IFEQ 'Y'                                       UUC102
     C                     CALL 'AOSVALR0'                                UUC102
     C                     PARM           RTNCDE  7                       UUC102
     C                     PARM SVALKK    SVALK1 20                       UUC102
     C                     PARM           SVAL1 200                       UUC102
     C                     PARM *BLANK    SVALK2 20                       UUC102
     C                     PARM           SVAL2 200                       UUC102
     C                     PARM *BLANK    SVALK3 20                       UUC102
     C                     PARM           SVAL3 200                       UUC102
     C                     PARM *BLANK    SVALK4 20                       UUC102
     C                     PARM           SVAL4 200                       UUC102
     C                     PARM *BLANK    SVALK5 20                       UUC102
     C                     PARM           SVAL5 200                       UUC102
     C                     PARM *BLANK    SVALK6 20                       UUC102
     C                     PARM           SVAL6 200                       UUC102
     C                     PARM *BLANK    SVALK7 20                       UUC102
     C                     PARM           SVAL7 200                       UUC102
     C                     PARM *BLANK    SVALK8 20                       UUC102
     C                     PARM           SVAL8 200                       UUC102
     C                     PARM *BLANK    SVALK9 20                       UUC102
     C                     PARM           SVAL9 200                       UUC102
     C                     PARM *BLANK    SVALK0 20                       UUC102
     C                     PARM           SVAL10200                       UUC102
      *                                                                   UUC102
     C           RTNCDE    IFNE *BLANKS                                   UUC102
     C           RTNCDE    ANDNE'*NRF    '                                UUC102
     C           *LOCK     IN   LDA                                       UUC102
     C                     MOVE 'SCSVLCTD'DBFILE                          UUC102
     C                     MOVEL'012'     DBASE                           UUC102
     C                     MOVEL'SVALKK'  DBKEY                           UUC102
     C                     OUT  LDA                                       UUC102
     C                     EXSR *PSSR                                     UUC102
     C                     ENDIF                                          UUC102
      *                                                                   UUC102
     C                     MOVE *BLANKS   CXT01A 10                       UUC102
     C                     MOVELSVAL1     CXT01A                          UUC102
      *                                                                   UUC102
     C                     OPEN XXAPOSV1                                  UUC102
     C                     OPEN GLJENAPD                                  UUC102
      *                                                                   UUC102
     C                     ENDIF                                          UUC102
      *                                                                   UUC102
