      *****************************************************************
      *  Start of /COPY GL0122PM17                                    *
      *****************************************************************
      *                                                               *
      *  Last Amend No. LUC110   *CREATE   Date 22Jan19               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LUC110 - Extended Narratives (Upgrade NUC002 to FBM 2.1)     *
      *                                                               *
      *****************************************************************
      *                                                                                             
      */OMITEND                                                                                     
      *                                                                                             
     A  10                                                                                          
     AAN11        $ENRT2        35        58                                                        
     A                                      SPACEB(1)                                               
     A  10                                                                                          
     AAN13        $ENRT3        35        58                                                        
     A                                      SPACEB(1)                                               
      *                                                                                             
      *****************************************************************
      *  End of /COPY GL0122PM17                                      *
      *****************************************************************
