      *****************************************************************
      *  Start of /COPY GL0340O012                                    *
      *****************************************************************
      *                                                               *
      *  Last Amend No. LUC110  *CREATE    Date 23Jan19               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LUC110 - Extended Narratives (Upgrade NUC002 to FBM 2.1)     *
      *                                                               *
      *****************************************************************
      *                                                                                         
      */OMITEND                                                                                 
     O                                           95 'NARRATIVE'                                 
     O                                          130 'AMOUNT'                                    
      *                                                                                         
      *****************************************************************
      *  End of /COPY GL0340O012                                      *
      *****************************************************************
