      *****************************************************************
      *  Start of /COPY GL0340IIP1                                    *
      *****************************************************************
      *                                                               *
      *  Last Amend No. LUC110  *CREATE    Date 23Jan19               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LUC110 - Extended Narratives (Upgrade NUC002 to FBM 2.1)     *
      *                                                               *
      *****************************************************************
      *                                                                                   
      *  Extended Narrative records for postings                                          
     IXXACP1Y1  NS                                                                        
     I                                  1    3  BRCA                                      
     I                                  4    9  CNUM                                      
     I                                 10   12  CCY                                       
     I                                 13   22 0ACOD                                      
     I                                 23   24 0ACSQ                                      
     I                             P   25   27 0PSTD                                      
     I                             P   28   30 0VALD                                      
     I                                 31   39  UNQK                                      
     I                                 40   40  GETP                                      
     I                                 41   75  GNAR1                                     
     I                                 76  110  GNAR2                                     
     I                                111  145  GNAR3                                     
      *  CATCHALL                                                                         
     I          NS                                                                        
      **                                                                                  
      *****************************************************************
      *  End of /COPY GL0340IIP1                                      *
      *****************************************************************
