      *****************************************************************
      *  Start of /COPY GL0491C003                                    *
      *****************************************************************
      *                                                               *
      *  Last Amend No. LUC110  *Create    Date 06May05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LUC110 - Extended Narratives (Upgrade NUC002 to FBM 2.1)     *
      *                                                               *
      *****************************************************************
     C           LUC110    IFEQ 'Y'                                       LUC110
      *                                                                   LUC110
     C                     MOVE *BLANK    GNAR1                           LUC110
     C                     MOVE *BLANK    GNAR2                           LUC110
     C                     MOVE *BLANK    GNAR3                           LUC110
     C                     MOVELPNAR      GNAR1                           LUC110
      *                                                                   LUC110
     C           EODKY     CHAINXXEODPY1             18                   LUC110
      *                                                                   LUC110
     C           *IN18     IFEQ *OFF                                      LUC110
      *                                                                   LUC110
     C           GNAR1     IFEQ *BLANKS                                   LUC110
     C                     MOVELPNAR      GNAR1                           LUC110
     C                     ENDIF                                          LUC110
      *                                                                   LUC110
     C                     MOVEA'00'      *IN,7                           LUC110
      *                                                                   LUC110
     C           ATYP      IFEQ 'R'                                       LUC110
     C           GNAR2     ANDGT*BLANKS                                   LUC110
     C                     MOVE *ON       *IN07                           LUC110
     C                     ENDIF                                          LUC110
     C           ATYP      IFEQ 'R'                                       LUC110
     C           GNAR3     ANDGT*BLANKS                                   LUC110
     C                     MOVE *ON       *IN08                           LUC110
     C                     ENDIF                                          LUC110
      *                                                                   LUC110
     C                     ENDIF                                          LUC110
      *                                                                   LUC110
     C                     ENDIF                                          LUC110
      *                                                                   LUC110
      *****************************************************************
      *  End of /COPY GL0491C003                                      *
      *****************************************************************
