      *****************************************************************
      *                                                               *
      *  MIDAS - /COPY MEMBER (GL0420)                                *
      *                                                               *
      *  GL0420C074 - Balance Statements (A/C Formats)                *
      *                                                               *
      *  Last Amend No. UUC102 *CREATE  Date 16Oct20                  *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  UUC102 - Upgrade of CAR UUC063 to BF Midas 2.1               *
      *           UUC063 - Balance Statement Enhancement              *
      *                                                               *
      *****************************************************************
     C                   ELSE                                                   UUC102
      *    DETERMINE IF NEW PAGE NEEDED FOR STATEMENT                           UUC102
     C     STPAX         COMP      LSTPX                                  48    UUC102
     C                   ENDIF                                                  UUC102
