      *****************************************************************
      *  Start of /COPY GL0420CCP5                                    *
      *****************************************************************
      *                                                               *
      *  Last Amend No. LUC110  *CREATE    Date 23Jan19               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LUC110 - Extended Narratives (Upgrade NUC002 to FBM 2.1)     *
      *                                                               *
      *****************************************************************
      *                                                                                   
     C     LUC110        Ifeq      'Y'                                                    
      *                                                                                   
     C     G2AT          Ifeq      'AT'                                                   
     C     G1CY          andeq     '   '                                                  
     C                   Move      G2CY          G1CY                                     
     C                   Move      G2AT          G1AT                                     
     C                   Move      G2EX          G1EX                                     
     C                   Endif                                                            
     C                   Movel     GNAR1         PNAR                                     
      *                                                                                   
     C                   Endif                                                            
      **                                                                                  
      *****************************************************************
      *  End of /COPY GL0420CCP5                                      *
      *****************************************************************
