      *****************************************************************
      *                                                               *
      *  Midas GENERAL LEDGER MODULE                                  *
      *                                                               *
      *  GL0420IP11 - BALANCE STATEMENTS (A/C FORMATS)                *
      *                                                               *
      *  (C) Copyright Finastra Internatonal Limited 2019             *
      *                                                               *
      *  Last Amend No. MD055520           Date 29Jul20               *
      *  Prev Amend No. LUC132  *CREATE    Date 30Jul19               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD055520 - GLC43 failure in GBFBUAG. Undefined record type.  *
      *             Amend to /Copy GL0420IP11 to comment out APOSTVB  *
      *             and /Copy GL0420IIP8 to add record format for     *
      *             APOSTVB.                                          *
      *  LUC132 - Amendments to Statement of Account feature AG       *
      *                                                               *
      *****************************************************************
      *
     I***APOSTVB   NS  06    1 CP                                                           MD055520
      *
      *****************************************************************
      * End of /COPY GL0420IP11                                       *
      *****************************************************************
