      *****************************************************************
      *                                                               *
      *  MIDAS - /COPY MEMBER (GL0420)                                *
      *                                                               *
      *  GL0420IIP2 - Balance Statements (A/C Formats)                *
      *                                                               *
      *  Last Amend No. MD059313        Date 07Feb22                  *
      *  Prev Amend No. UUC102 *CREATE  Date 16Oct20                  *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  MD059313 - CFSB not updated on ACCNTAB when UUC102 is OFF.   *
      *           - Ensure XXAPOSV1 definition includes all formats to*
      *             avoid undefined type error.                       *
      *             Replace hooks GL0420IP11 and GL0420IIP2 with      *
      *             UUC102_012.                                       *
      *  UUC102 - Upgrade of CAR UUC063 to BF Midas 2.1               *
      *           UUC063 - Balance Statement Enhancement              *
      *                                                               *
      *****************************************************************
     I**********                      171  289  LOTP2                                UUC102 MD059313
