      *****************************************************************
      *                                                               *
      *  Last Amend No.   LUC107                Date 21Dec2015        *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  LUC107 - Statement Page Number Enhancement                   *
      *                                                               *
      *****************************************************************
     C     LUC107        IFEQ      'Y'
     C                   SUB       1             LINCNT
     C     STPP          COMP      1                                      48
     C     LINCNT        ADD       1             LINCNT
     C  N48LINCNT        COMP      1                                      50
     C                   ENDIF
      *
      *****************************************************************
      * End of /COPY GL0420CP39                                       *
      *****************************************************************
