      *****************************************************************
      *                                                               *
      *  Midas - /COPY Member (GL0420)                                *
      *                                                               *
      *  GL0420CP26 - BALANCE STATEMENTS (A/C FORMATS)                *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2016            *
      *                                                               *
      *  Last Amend No. LUC108   *CREATE   Date 19Apr16               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LUC108 - Statement of Accounts                               *
      *                                                               *
      *****************************************************************
      *
     C                   ELSE
     C   18              Z-ADD     STPP          STPFF             4 0
     C   18STPP          ADD       1             STPP
     C                   ENDIF
      *
      *****************************************************************
      * End of /COPY GL0420CP26                                       *
      *****************************************************************
