      *****************************************************************
      *  Start of /COPY GL1300C082                                    *
      *****************************************************************
      *                                                               *
      *  Last Amend No. LUC111             Date 24Jan19               *
      *  Prev Amend No. NUC003 (S25019)    Date 16Jun05               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LUC111 - Upgrade R4/NUC003 to FB 2.1 as LUC111               *
      *  NUC003 - Output EXTENDED NARRATIVES for GL, DL and RE        *
      *           Modules to SWIFT MT940 statements field 86.         *
      *                                                               *
      *****************************************************************
      *
      ** If EXTENDED NARRATIVES ENHANCEMENT IS PRESENT and a record
      ***is*being*output*to*S/SWPOS,*also*output*record*to*PF/SWPOOX0.*
      ** is being output to S/SWPOS, also output record to PF/XXSWPOX0                        
      *
     C********** NUC003    IFEQ 'Y'                        B1
     C           LUC111    IFEQ 'Y'                        B1
     C           *IN33     ANDEQ'1'
     C           *INU1     ANDEQ'1'
     C           *IN06     ANDEQ'1'
      *
     C                     MOVE *IN53     SAV53   1
     C                     MOVE ZZ009     UNQK
      *
     C           PSTD      IFEQ BJRDNB
     C********** APTKEY    CHAINEODPOY1              53
     C           APTKEY    CHAINXXEODPY1             53                                       
     C                     ELSE
     C********** APTKEY    CHAINSWPOSY0              53
     C           APTKEY    CHAINXXSWPSY0             53                                       
     C                     ENDIF
      *
     C           *IN53     IFEQ '0'
     C**********           WRITESWPOOX0F
     C                     WRITEXXSWPOXF                                                      
     C                     ENDIF
      *
     C                     MOVE SAV53     *IN53
     C                     ENDIF                           E1
      *
      *****************************************************************
      *  End of /COPY GL1300C082                                      *
      *****************************************************************
