      *****************************************************************
      *  Start of /COPY GL4450C002                                    *
      *****************************************************************
      *                                                               *
      *  Last Amend No. LUC110  *Create    Date 23Jan19               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LUC110 - Extended Narratives (Upgrade NUC002 to FBM 2.1)     *
      *                                                               *
      *****************************************************************
      *                                                                   LUC110
     C           LUC110    IFEQ 'Y'                                       LUC110
      *                                                                   LUC110
     C           EXKEY     KLIST                                          LUC110
     C                     KFLD           BRCA                            LUC110
     C                     KFLD           CNUM                            LUC110
     C                     KFLD           CCY                             LUC110
     C                     KFLD           ACOD                            LUC110
     C                     KFLD           ACSQ                            LUC110
     C                     KFLD           PSTD                            LUC110
     C                     KFLD           VALD                            LUC110
     C                     KFLD           UNQK                            LUC110
      *                                                                   LUC110
     C           ZZ009     IFNE *BLANK                                    LUC110
     C                     MOVE ZZ009     UNQK                            LUC110
     C           EXKEY     CHAINGLACPHY1             50                   LUC110
      *                                                                   LUC110
     C           *IN50     IFEQ '0'                                       LUC110
     C                     DELETGLACPX0F                                  LUC110
     C                     ENDIF                                          LUC110
     C                     ENDIF                                          LUC110
      *                                                                   LUC110
     C                     ENDIF                                          LUC110
      *****************************************************************
      *  End of /COPY GL4450C002                                      *
      *****************************************************************
