      *****************************************************************                       HUT110
      *                                                               *                       HUT110
      *  Midas - /COPY Member FTVACBA                                 *                       HUT110
      *                                                               *                       HUT110
      *  FTVACBA - Midas FT Validate account with bank                *                       HUT110
      *                                                               *                       HUT110
      *  Last Amend No. HUT110  *CREATE    Date 20Apr20               *                       HUT110
      *                                                               *                       HUT110
      *---------------------------------------------------------------*                       HUT110
      *                                                               *                       HUT110
      *  HUT110 - Upgraded HUT022 to FBM 2.1 SP22                     *                       HUT110
      *           RTGS via SWIFT.                                     *                       HUT110
      *                                                               *                       HUT110
      *****************************************************************                       HUT110
      *                                                                                       HUT110
      ** External data structure for Nostro customer number                                   HUT110
      *                                                                                       HUT110
     D SDNOST        E DS                  EXTNAME(SDNOSTPD)                                  HUT110
                                                                                              HUT110
      ** Externally described DS for SAR details                                              HUT110
      *                                                                                       HUT110
     D SCSARD        E DS                  EXTNAME(SCSARDPD)                                  HUT110
                                                                                              HUT110
      ** DS for access programs - Short data structure                                        HUT110
      *                                                                                       HUT110
     D DSFDY         E DS                  EXTNAME(DSFDY)                                     HUT110
      *                                                                                       HUT110
      *****************************************************************                       HUT110
      * End of /COPY HUT110_070                                       *                       HUT110
      *****************************************************************                       HUT110
