      *****************************************************************
      *                                                               *
      *  HUT121_155 - Midas /COPY for SEPRCSUPD                       *
      *                                                               *
      *  Last Amend No. HUT121  *CREATE    Date 09Mar22               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  HUT121 -  Allow SE Price Input for Non-working day.          *
      *                                                               *
      *****************************************************************
                                                                                              HUT121
     C     XPRICK        KLIST                                                                HUT121
     C                   KFLD                    @PSSN            10                          HUT121
     C                   KFLD                    @PCNM             6                          HUT121
     C                   KFLD                    @PMKT             1                          HUT121
     C                   KFLD                    @PBRA             3                          HUT121
     C                   KFLD                    @PBOK             2                          HUT121
     C                   KFLD                    @PPRT             2                          HUT121
     C                   KFLD                    @PTFR             4                          HUT121
     C                   KFLD                    @PVDT             5 0                        HUT121
      *                                                                                       HUT121
      *****************************************************************
      * End of /COPY HUT121_155                                       *
      *****************************************************************
