      *****************************************************************
      *                                                               *
      *  HUT121_048 -  Midas /COPY for SEPRCSUPD                      *
      *                                                               *
      *  Last Amend No. HUT121C            Date 04May22               *
      *  Prev Amend No. HUT121  *CREATE    Date 07Feb22               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  HUT121C - Changes to allow SE Price Input for Non-working day*
      *  HUT121 -  Allow SE Price Input for Non-working day           *
      *                                                               *
      *****************************************************************
      *                                                                                       HUT121
     C                   Z-ADD     V_PRPVDT      PVDT                                         HUT121
      *                                                                                       HUT121
     C**********         IF        HUT121 = 'N'                                       HUT121 HUT121C
      *                                                                                       HUT121
      *****************************************************************
      * End of /COPY HUT121_048                                       *
      *****************************************************************
