      *****************************************************************                       HUT110
      *                                                               *                       HUT110
      *  Midas - /COPY Member FT1010                                  *                       HUT110
      *                                                               *                       HUT110
      *  FT1010 - Midas FT Accrual date reorganisation                *                       HUT110
      *                                                               *                       HUT110
      *  Last Amend No. HUT110  *CREATE    Date 20Apr20               *                       HUT110
      *                                                               *                       HUT110
      *---------------------------------------------------------------*                       HUT110
      *                                                               *                       HUT110
      *  HUT110 - Upgraded HUT022 to FBM 2.1 SP22                     *                       HUT110
      *           RTGS via SWIFT.                                     *                       HUT110
      *                                                               *                       HUT110
      *****************************************************************                       HUT110
      *                                                                                       HUT110
      ** Access SAR details file to see if HUT110 is installed.                               HUT110
      *                                                                                       HUT110
     C                     MOVE 'N'       HUT110  1                                           HUT110
     C                     CALL 'AOSARDR0'                                                    HUT110
     C                     PARM *BLANKS   P@RTCD                                              HUT110
     C                     PARM '*VERIFY' P@OPTN                                              HUT110
     C                     PARM 'HUT110'  @SARD                                               HUT110
     C           SCSARD    PARM *BLANKS   DSFDY                                               HUT110
      *                                                                                       HUT110
     C           P@RTCD    IFEQ *BLANKS                                                       HUT110
     C                     MOVE 'Y'       HUT110                                              HUT110
     C                     OPEN XXPYXL1                                                       HUT110
     C                     ELSE                                                               HUT110
      *                                                                                       HUT110
     C           P@RTCD    IFNE '*NRF   '                                                     HUT110
     C                     MOVE 'SCSARDPD'WBFILE           ************                       HUT110
     C                     MOVEL'HUT110 ' WBKEY            * DBERR 902*                       HUT110
     C                     Z-ADD902       WBASE            ************                       HUT110
     C                     EXSR ABORT                                                         HUT110
     C                     ENDIF                                                              HUT110
     C                     ENDIF                                                              HUT110
      *                                                                                       HUT110
      *****************************************************************                       HUT110
      * End of /COPY HUT110_067                                       *                       HUT110
      *****************************************************************                       HUT110
