      *****************************************************************
      *                                                               *
      *  HUT121_141 - Midas /COPY for SE4652                          *
      *                                                               *
      *  Last Amend No. HUT121  *CREATE    Date 09Mar22               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  HUT121 -  Allow SE Price Input for Non-working day           *
      *                                                               *
      *****************************************************************
     C                   ELSE                                                                 HUT121
     C     KPosPrice     SETGT     PRICT                                                      HUT121
     C                   ENDIF                                                                HUT121
      *                                                                                       HUT121
      *****************************************************************
      * End of /COPY HUT121_141                                       *
      *****************************************************************
