      *****************************************************************
      *                                                               *
      *  HUT121_159 - Midas /COPY for SEPRCSVAL                       *
      *                                                               *
      *  Last Amend No. HUT121C            Date 27Apr22               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  HUT121C -  Allow SE Price Input for Non-working day          *
      *                                                               *
      *****************************************************************
     C                   PARM                    DDPMKT                                      HUT121C
     C                   PARM                    DDPBRA                                      HUT121C
     C                   PARM                    DDPBOK                                      HUT121C
     C                   PARM                    DDPRFC                                      HUT121C
     C                   PARM                    DDACTN                                      HUT121C
      *****************************************************************
      * End of /COPY HUT121_159                                       *
      *****************************************************************
