      *****************************************************************                       HUT110
      *                                                               *                       HUT110
      *  Midas - /COPY Member FTVXVXV                                 *                       HUT110
      *                                                               *                       HUT110
      *  FTVXVXV - Midas FT Validate cross-validations                *                       HUT110
      *                                                               *                       HUT110
      *  Last Amend No. HUT110  *CREATE    Date 21Apr20               *                       HUT110
      *                                                               *                       HUT110
      *---------------------------------------------------------------*                       HUT110
      *                                                               *                       HUT110
      *  HUT110 - Upgraded HUT022 to FBM 2.1 SP22                     *                       HUT110
      *           RTGS via SWIFT.                                     *                       HUT110
      *                                                               *                       HUT110
      *****************************************************************                       HUT110
      *                                                                                       HUT110
      ** Work fields for RTGS processing                                                      HUT110
      *                                                                                       HUT110
     D RTGSNostro      C                   Const('RTGS_Nostros')                              HUT110
     D HUT110          S              1A                                                      HUT110
     D WRTGSNost       S            100A                                                      HUT110
     D WKRtgs          S              1A                                                      HUT110
     D WKNost          S              5A                                                      HUT110
     D WKPos           S              3P 0                                                    HUT110
     D POPTN           S              7A                                                      HUT110
     D PSARD           S              6A                                                      HUT110
      *                                                                                       HUT110
      *****************************************************************                       HUT110
      * End of /COPY HUT110_080                                       *                       HUT110
      *****************************************************************                       HUT110
