      *****************************************************************
      * Start of /COPY HUT113_035                                     *
      *****************************************************************
      *                                                               *
      *  PMPFDM2RV                                                    *
      *                                                               *
      *  Last Amend No. HUT113    *CREATE  Date 01Apr20               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  HUT113 - Full Private Banking Functionality in Midas         *
      *           Upgrade HUT026 to FBM 2.1 SP 22                     *
      *           Allow Portfolio Definitions Input in Midas          *
      *                                                               *
      *****************************************************************
      *
      * OMITEND
      *
     C**********         TESTN                   DDPREF               10                  MD052257
      *
     C******IN10         IFEQ      '1'                                                    MD052257
     C     '1234567890'  CHECK     DDPREF                                                 MD052257
     C**********         IF        %FOUND                                       MD052257 MD052257A
     C                   IF        NOT %FOUND                                            MD052257A
      *****************************************************************
      * End of /COPY HUT113_035                                       *
      *****************************************************************
