      *****************************************************************
      *                                                               *
      *  HUT121_145 - Midas /COPY for SE4652                          *
      *                                                               *
      *  Last Amend No. HUT121  *CREATE    Date 09Mar22               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  HUT121 -  Allow SE Price Input for Non-working day           *
      *                                                               *
      *****************************************************************
     D HUT121          S              1                                         Feature       HUT121
      *                                                                                       HUT121
      *****************************************************************
      * End of /COPY HUT121_145                                       *
      *****************************************************************
