      *****************************************************************
      *  Start of /COPY HUT107_012                                    *
      *****************************************************************
      *                                                               *
      *  DL005010P1 - WHT DL Daily report                             *
      *                                                               *
      *  Last Amend No. HUT107    *Create  Date 28May20               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  HUT107 - Additional 3rd Party Trust Indicator                *
      *           (Upgrade HUT016 to FM2.1 SP22)                      *
      *                                                               *
      *****************************************************************
     A  30                                26
     A                                      DFT('3RD PT TRUST')
      *****************************************************************
      * End of /COPY HUT107_012                                       *
      *****************************************************************
