      *****************************************************************                       JMI113
      *                                                               *                       JMI113
      *  Midas - SD9005X - Copy member (RPG)                          *                       JMI113
      *                                                               *                       JMI113
      *  JMI113_006 - SD9005X - Call XX9005X                          *                       JMI113
      *                                                               *                       JMI113
      *  Last Amend No. JMI113  *Create    Date 17May18               *                       JMI113
      *                                                               *                       JMI113
      *---------------------------------------------------------------*                       JMI113
      *                                                               *                       JMI113
      *  JMI113 - Midas-GCMS Interface. Upgrade to FBM 2.1            *                       JMI113
      *                                                               *                       JMI113
      *****************************************************************                       JMI113
      *                                                                                       JMI113
     C                     CALL 'AOSARDR0'                                                    JMI113
     C           WUAPRC    PARM WUAPRC    WQ0001                                              JMI113
     C                     PARM '*VERIFY' WQ0002                                              JMI113
     C           WUSARN    PARM 'JMI113'  WQ0003                                              JMI113
     C                     PARM WUFDY     WQ0004                                              JMI113
      *                                                                                       JMI113
     C           WUAPRC    IFEQ *BLANK                                                        JMI113
     C                     MOVEL'Y'       JMI113  1                                           JMI113
     C                     ELSE                                                               JMI113
     C                     MOVEL'N'       JMI113                                              JMI113
     C                     ENDIF                                                              JMI113
      *                                                                                       JMI113
     C           JMI113    IFEQ 'Y'                                                           JMI113
     C                     MOVE '00001'   UPSEQ                                               JMI113
     C**********           CALL 'WN0100'                                               245974 JMI113
     C                     CALL 'XX9005X'                                                     JMI113
     C**********           PARM SD9005    P@PGM   10                                   245974 JMI113
     C                     PARM 'I'       @ACTN   1                                           JMI113
     C                     PARM           DATA2                                               JMI113
     C                     PARM           DATAI                                               JMI113
     C                     PARM           DATAF1                                              JMI113
     C                     PARM           DATAF2                                              JMI113
     C                     PARM           DATAF3                                              JMI113
     C                     PARM           DATAF4                                              JMI113
     C                     PARM *BLANKS   P@RTCD  7                                           JMI113
      *                                                                                       JMI113
     C           P@RTCD    IFNE *BLANKS                                                       JMI113
     C                     EXSR *PSSR                                                         JMI113
     C                     ENDIF                                                              JMI113
     C                     ENDIF                                                              JMI113
      *                                                                                       JMI113
      *****************************************************************                       JMI113
      * End of /COPY JMI113_006                                       *                       JMI113
      *****************************************************************                       JMI113
