      *****************************************************************
      *                                                               *
      *  MMVLDNICUS - Midas MM Validate Cust number (Loans/Deposits)  *
      *                                                               *
      *  Last Amend No. LCI001  *CREATE    Date 27Jul20               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LCI001 - MM Deals Validation - Deal Types against Cust Types *
      *                                                               *
      *****************************************************************
      *
      * Constant to hold input parameter for AOSVALR0.
     D PSysVal1        C                   Const('ITandIPNon-BankCust')
      *
     D PSysVal01       S             20A
     D PCurSet01       S            200A
     D PSysVal02       S             20A
     D PCurSet02       S            200A
     D PSysVal03       S             20A
     D PCurSet03       S            200A
     D PSysVal04       S             20A
     D PCurSet04       S            200A
     D PSysVal05       S             20A
     D PCurSet05       S            200A
     D PSysVal06       S             20A
     D PCurSet06       S            200A
     D PSysVal07       S             20A
     D PCurSet07       S            200A
     D PSysVal08       S             20A
     D PCurSet08       S            200A
     D PSysVal09       S             20A
     D PCurSet09       S            200A
     D PSysVal10       S             20A
     D PCurSet10       S            200A
      *
