      *****************************************************************
      *  Start of /COPY LUC110_065                                    *
      *****************************************************************
      *                                                               *
      *  Last Amend No. LUC110  *Create    Date 23Jan19               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LUC110 - Extended Narratives (Upgrade NUC002 to FBM 2.1)     *
      *                                                               *
      *****************************************************************
      *                                                                                   LUC110
      */OMITEND                                                                           LUC110
     O                                          110 'TOTAL OF ACCOUNT CREDITS'            LUC110
     O               30      PSTACR             132 '   ,   ,   ,   , 0 CR'               LUC110
     O               31      PSTACR             132 '  ,   ,   ,   , 0 . CR'              LUC110
     O               32      PSTACR             132 ' ,   ,   ,   , 0 .  CR'              LUC110
     O               33      PSTACR             132 '   ,   ,   , 0 .   CR'               LUC110
      *                                                                                   LUC110
      *****************************************************************
      *  End of /COPY LUC110_065                                      *
      *****************************************************************
