      *****************************************************************
      *  Start of /COPY LUC131_002                                    *
      *****************************************************************
      *                                                               *
      *  Midas - LUC131_002                                           *
      *                                                               *
      *  LUC131_002 - Upgrade Midas R4 S11030 CARS Interface          *
      *                                                               *
      *  Last Amend No. LUC131 *CREATE     Date 16Jul19               *
      *  Prev Amend No. xxxxxx             Date ddmmmyy               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LUC131 - Upgrade R4/S11030 MIDAS-SOAR/CARS INTERFACE as      *
      *           FB 2.1 LUC131                                       *
      *                                                               *
      *****************************************************************
      *
     A  20                             16 41'CARS Interface'
     A            SCARS          1A  B 16 59
     A                                      DSPATR(HI)
     A  19 20                               DSPATR(RI PC)
     A N19 20                               DSPATR(UL)
     A N20
     AO 69                                  DSPATR(PR ND)
     A N69 20                               OVRATR
     A N69 20                               OVRDTA
      *
      *****************************************************************
      *  End of /COPY LUC131_002                                      *
      *****************************************************************
