      *****************************************************************
      *  Start of /COPY LUC110_070                                    *
      *****************************************************************
      *                                                               *
      *  Last Amend No. LUC110  *CREATE    Date 23Jan19               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LUC110 - Extended Narratives (Upgrade NUC002 to FBM 2.1)     *
      *                                                               *
      *****************************************************************
      *                                                                                         
      */OMITEND                                                                                 
     O                                          110 'RETAIL ACCOUNT  DEBITS'                    
     O               30      TPSTDR             132 '   ,   ,   ,   , 0 CR'                     
     O               31      TPSTDR             132 '  ,   ,   ,   , 0 . CR'                    
     O               32      TPSTDR             132 ' ,   ,   ,   , 0 .  CR'                    
     O               33      TPSTDR             132 '   ,   ,   , 0 .   CR'                     
      *                                                                                         
      *****************************************************************
      *  End of /COPY LUC110_070                                      *
      *****************************************************************
