      *****************************************************************
      *                                                               *
      *  Midas - Dealing Module                                       *
      *                                                               *
      *  LUC113_002 - Midas DL Close of business confirmation         *
      *                                                               *
      *  (C) Copyright Finastra Internatonal Limited 2019             *
      *                                                               *
      *  Last Amend No. LUC113  *CREATE    Date 22Jan19               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  LUC113 - FATCA Withholding Tax Changes                       *
      *                                                               *
      *---------------------------------------------------------------*
      *
      ** Check if LUC113 is installed                                                         LUC113
      *                                                                                       LUC113
     C                     CALL 'AOSARDR0'                                                    LUC113
     C                     PARM *BLANKS   PRTCD   7                                           LUC113
     C                     PARM '*VERIFY' POPTN   7                                           LUC113
     C                     PARM 'LUC113'  PSARD   6                                           LUC113
     C           SCSARD    PARM SCSARD    DSFDY                                               LUC113
      *                                                                                       LUC113
     C           PRTCD     IFNE *BLANKS                                                       LUC113
     C           PRTCD     ANDNE'*NRF   '                                                     LUC113
     C                     MOVEL'SCSARDPD'DBFILE                                              LUC113
     C                     MOVEL'LUC113'  DBKEY                                               LUC113
     C                     MOVEL'102'     DBASE                                               LUC113
     C                     MOVE *ON       *INU7                                               LUC113
     C                     MOVE *ON       *INU8                                               LUC113
     C                     MOVE *ON       *INLR                                               LUC113
     C                     EXSR *PSSR                                                         LUC113
     C                     ENDIF                                                              LUC113
      *                                                                                       LUC113
     C           PRTCD     IFEQ *BLANKS                                                       LUC113
     C                     MOVE 'Y'       LUC113  1                                           LUC113
     C                     ELSE                                                               LUC113
     C                     MOVE 'N'       LUC113                                              LUC113
     C                     ENDIF                                                              LUC113
      *                                                                                       LUC113
