      *****************************************************************
      *  Start of /COPY LUC110_044                                    *
      *****************************************************************
      *                                                               *
      *  Last Amend No. LUC110  *CREATE    Date 22Jan19               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LUC110 - Extended Narratives (Upgrade NUC002 to FBM 2.1)     *
      *                                                               *
      *****************************************************************
      *                                                                                             
     A*/OMITEND                                                                                     
      *                                                                                             
     A            XRPAMP        18        37TEXT('Posting Amount (Print)')                          
     A            XRDCIN         1        56TEXT('Debit/credit indicator')                          
     A N10        XRNRTV        30        58TEXT('Narrative')                                       
     A  10        XRNRT1        35        58TEXT('Narrative 1')                                     
      *                                                                                             
      *****************************************************************
      *  End of /COPY LUC110_044                                      *
      *****************************************************************
