      *****************************************************************
      *  Start of /COPY LUC110_075                                    *
      *****************************************************************
      *                                                               *
      *  Last Amend No. LUC110  *Create    Date 23Jan19               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LUC110 - Extended Narratives (Upgrade NUC002 to FBM 2.1)     *
      *                                                               *
      *****************************************************************
      *                                                                   LUC110
     C           EODKY     KLIST                                          LUC110
     C                     KFLD           BRCA                            LUC110
     C                     KFLD           CNUM                            LUC110
     C                     KFLD           CCY                             LUC110
     C                     KFLD           ACOD                            LUC110
     C                     KFLD           ACSQ                            LUC110
     C                     KFLD           PSTD                            LUC110
     C                     KFLD           VALD                            LUC110
     C                     KFLD           ZZ009                           LUC110
      *                                                                   LUC110
      **  Access SAR details file to see if LUC110 is installed.          LUC110
      *                                                                   LUC110
     C                     CALL 'AOSARDR0'                                LUC110
     C                     PARM '       ' @RTCD                           LUC110
     C                     PARM '*VERIFY' @OPTN                           LUC110
     C                     PARM 'LUC110'  @SARD   6                       LUC110
     C           SCSARD    PARM SCSARD    DSFDY                           LUC110
      *                                                                   LUC110
     C           @RTCD     IFEQ *BLANKS                                   LUC110
     C                     MOVE 'Y'       LUC110  1                       LUC110
     C                     MOVE *ON       *IN09                           LUC110
     C                     ELSE                                           LUC110
     C                     MOVE 'N'       LUC110                          LUC110
     C                     MOVE *OFF      *IN09                           LUC110
     C                     ENDIF                                          LUC110
      *                                                                   LUC110
      *****************************************************************
      *  End of /COPY LUC110_075                                      *
      *****************************************************************
