      *****************************************************************
      *  Start of /COPY LUC110_058                                    *
      *****************************************************************
      *                                                               *
      *  Last Amend No. LUC110  *Create    Date 23Jan19               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LUC110 - Extended Narratives (Upgrade NUC002 to FBM 2.1)     *
      *                                                               *
      *****************************************************************
      *                                                                                   LUC110
      */OMITEND                                                                           LUC110
     O                                          110 'O/B'                                 LUC110
     O               30      LDBE               132 '   ,   ,   ,   , 0 CR'               LUC110
     O               31      LDBE               132 '  ,   ,   ,   , 0 . CR'              LUC110
     O               32      LDBE               132 ' ,   ,   ,   , 0 .  CR'              LUC110
     O               33      LDBE               132 '   ,   ,   , 0 .   CR'               LUC110
      *                                                                                   LUC110
      *****************************************************************
      *  End of /COPY LUC110_058                                      *
      *****************************************************************
