      *****************************************************************
      *  Start of /COPY LUC110_102                                    *
      *****************************************************************
      *                                                               *
      *  Last Amend No. LUC110  *Create    Date 07Feb19               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LUC110 - Extended Narratives (Upgrade NUC002 to FBM 2.1)     *
      *                                                               *
      *****************************************************************
      *
     C     LUC110        Ifeq      'Y'                                                       LUC110
     C                   Move      F3DADN        @Dlno             6 0                       LUC110
     C     @Dlno         Chain     FXDEALP0                           99                     LUC110
     C     *In99         Ifeq      *Off                                                      LUC110
     C                   MoveL     FHPCDN        ZZ002B                                      LUC110
     C                   Endif                                                               LUC110
     C                   Endif                                                               LUC110
      *
      *****************************************************************
      *  End of /COPY LUC110_102                                      *
      *****************************************************************
