      *****************************************************************
      *  Start of /COPY LUC110_082                                    *
      *****************************************************************
      *                                                               *
      *  Last Amend No. LUC110  *Create    Date 24Jan19               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LUC110 - Extended Narratives (Upgrade to FBM 2.1)            *
      *                                                               *
      *****************************************************************
      *                                                                                    LUC110
      *  Added to LF/SACPO                                                                 LUC110
     I                                115  123  ZZ009                                      LUC110
      *                                                                                    LUC110
      *****************************************************************
      *  End of /COPY LUC110_082                                      *
      *****************************************************************
