      *****************************************************************
      *                                                               *
      *  Midas - IRS Validation Module                                *
      *                                                               *
      *  LUC120_009 - Midas IR: Validate Interest Payment frequency   *
      *                                                               *
      *  (C) Copyright Finastra Internatonal Limited 2019             *
      *                                                               *
      *  Last Amend No. LUC120  *CREATE    Date 13Feb19               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  LUC120 - Allow frequency 'W' (Weekly) or 'F' (Fortnightly).  *
      *                                                               *
      *---------------------------------------------------------------*
      *
     D SCSARD        E DS                  EXTNAME(SCSARDPD)                                  LUC120
      ** EXTERNAL DS FOR SAR DETAILS                                                          LUC120
      *                                                                                       LUC120
     D DSFDY         E DS                  EXTNAME(DSFDY)                                     LUC120
      ** FIRST DS FOR ACCESS PROGRAMS, SHORT DATA STRUCTURE                                   LUC120
      *                                                                                       LUC120
