      *****************************************************************
      *  Start of /COPY LUC110_068                                    *
      *****************************************************************
      *                                                               *
      *  Last Amend No. LUC110  *CREATE    Date 23Jan19               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LUC110 - Extended Narratives (Upgrade NUC002 to FBM 2.1)     *
      *                                                               *
      *****************************************************************
      *                                                                                         
      */OMITEND                                                                                 
     O                                           20 'RETAIL ACCOUNTS'                           
     O                                          110 'O/B'                                       
     O               30      REBAL              132 '   ,   ,   ,   , 0 CR'                     
     O               31      REBAL              132 '  ,   ,   ,   , 0 . CR'                    
     O               32      REBAL              132 ' ,   ,   ,   , 0 .  CR'                    
     O               33      REBAL              132 '   ,   ,   , 0 .   CR'                     
      *                                                                                         
      *****************************************************************
      *  End of /COPY LUC110_068                                      *
      *****************************************************************
