      *****************************************************************
      *  Start of /COPY MG0100CCP5                                    *
      *****************************************************************
      *                                                               *
      *  Last Amend No. EML0100 *Create     Date 20Nov19              *
      *  Prev Amend No. nnnnnn              Date ddmmmyy              *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  EML100 - MT103 & MT202 Amendments for Target2.               *
      *           Upgrade of EML003 to FB 2.1                         *
      *                                                               *
      *****************************************************************
      ** Access SAR file to determine if EML100 is installed.                                 EML100
      *                                                                                       EML100
     C                     CALL 'AOSARDR0'                                                    EML100
     C                     PARM *BLANKS   PRTCD                                               EML100
     C                     PARM '*VERIFY' POPTN                                               EML100
     C                     PARM 'EML100'  PSARD                                               EML100
     C           SCSARD    PARM SCSARD    DSFDY                                               EML100
      *                                                                                       EML100
      ** An NRF (No Record Found) return code is valid.                                       EML100
      ** Issue database error only for error return codes.                                    EML100
      *                                                                                       EML100
     C           PRTCD     IFNE *BLANKS                                                       EML100
     C           PRTCD     ANDNE'*NRF   '                                                     EML100
     C           *LOCK     IN   LDA                                                           EML100
     C                     MOVEL'      '  DBKEY                                               EML100
     C                     MOVEL'SCSARDPD'DBFILE                                              EML100
     C                     Z-ADD90        DBASE                                               EML100
     C                     OUT  LDA                                                           EML100
     C                     EXSR *PSSR                                                         EML100
     C                     ENDIF                                                              EML100
      *                                                                                       EML100
     C           PRTCD     IFEQ *BLANK                                                        EML100
     C                     MOVEL'Y'       EML100  1                                           EML100
     C                     ELSE                                                               EML100
     C                     MOVEL'N'       EML100                                              EML100
     C                     ENDIF                                                              EML100
      *****************************************************************
      *  End of /COPY MG0100CCP5                                      *
      *****************************************************************
