      *****************************************************************
      *  Start of /COPY RE0880P108                                    *
      *****************************************************************
      *                                                               *
      *  Last Amend No. LUC110  *CREATE    Date 24Jan19               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LUC110 - Extended Narratives (Upgrade NUC002 to FBM 2.1)     *
      *                                                               *
      *****************************************************************
      *                                                                                             
     A*/OMITEND                                                                                     
      *                                                                                             
     A N18        TRNNAR        30     24 23                                                        
     A N18        POSTNR        30     26 23                                                        
     A  18        UGNAR1        35     25 23                                                        
     A  18        UGNAR2        35     26 23                                                        
     A  18        UGNAR3        35     27 23                                                        
      *                                                                                             
      *****************************************************************
      *  End of /COPY RE0880P108                                      *
      *****************************************************************
