      *****************************************************************
      *                                                               *
      *  Last Amend No. DUG501 *CREATE     Date 23Aug17               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  DUG501 - Accounts Split for Realised P&L and Account Seq     *
      *           by Book                                             *
      *                                                               *
      *****************************************************************
      *                                                                  DUG501
      ** DUG501 SAR Check                                                DUG501
      *                                                                  DUG501
     C                     MOVE 'N'       DUG501  1                      DUG501
     C                     SETOF                     55                  DUG501
     C                     CALL 'AOSARDR0'                               DUG501
     C                     PARM *BLANKS   @RTCD   7                      DUG501
     C                     PARM '*VERIFY' @OPTN   7                      DUG501
     C                     PARM 'DUG501'  @KEY6   6                      DUG501
     C           SCSARD    PARM SCSARD    DSFDY                          DUG501
     C*                                                                  DUG501
     C           @RTCD     IFEQ *BLANKS                                  DUG501
     C                     MOVE 'Y'       DUG501                         DUG501
     C                     SETON                     55                  DUG501
     C                     END                                           DUG501
      *                                                                  DUG501
     C           @RTCD     IFNE *BLANKS                                  DUG501
     C           @RTCD     ANDNE'*NRF   '                                DUG501
      *                                                                  DUG501
      ** Call to program ended in error                                  DUG501
      *                                                                  DUG501
     C                     MOVEL'Y2U0032' W0RTN                          DUG501
     C                     MOVEL*BLANKS   W0CLPG 10                      DUG501
     C                     MOVEL'AOSARDR0'W0CLPG                         DUG501
      *                                                                  DUG501
      ** Send message '*Error occured on CALL...'                        DUG501
      *                                                                  DUG501
     C                     MOVEL'Y2U0032' ZAMSID                         DUG501
     C                     MOVEL'Y2USRMSG'ZAMSGF                         DUG501
     C                     MOVELW0CLPG    ZAMSDA           Message data  DUG501
     C                     EXSR ZASNMS                                   DUG501
     C                     END                                           DUG501
      *                                                                  DUG501