      *****************************************************************
      *                                                               *
      *  Midas - /COPY Member (RPG)                                   *
      *                                                               *
      *  SDCUSDSIN                                                    *
      *                                                               *
      *  Last Amend No. HUT113    *CREATE  Date 28May20               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  HUT113 - Full PB Functionality in FM                         *
      *           (Upgrade HUT026 to FM 2.1 SP22)                     *
      *                                                               *
      *****************************************************************
     C                   PARM                    OKCuXC                                      HUT113
                                                                                             HUT113
      *****************************************************************
      * End of /COPY SDH00736                                         *
      *****************************************************************
