      *****************************************************************
      *                                                               *
      *  Last Amend No. DUG502 *Created    Date 23Aug17               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  DUG502 - Security Diary Enhancements                         *
      *                                                               *
      *****************************************************************
      *                                                                                       DUG502
     C                   IF        DUG502 = 'Y'                                               DUG502
     C                   EVAL      WPNmDp = PNmDp                                             DUG502
     C                   EVAL      PNmDp  = 8                                                 DUG502
     C                   ENDIF                                                                DUG502
      *                                                                                       DUG502
