      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas IR Italian Reporting Postings File')             *
      *****************************************************************
      *                                                               *
      *  Midas ABS - BOI Returns                                      *
      *                                                               *
      *  PF/IRAPOSPD - Italian Reporting Postings File                *
      *                                                               *
      *  (C) Copyright Midas-Kapiti International Ltd. 1997           *
      *                                                               *
      *  Last Amend No. LUC139             Date 21Dec20               *
      *  Prev Amend No. UIT021             Date 22JAN97               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  LUC139 - Upgrade UCI Italian Returns upgrade                 *
      *  UIT021 - Bank Of Italy Monthly reporting                     *
      *                                                               *
      *****************************************************************
     A          R IRAPOSD0                  TEXT('(C) Midas-Kapiti +
     A                                      International Ltd. 1997')
      *
     A            IBCNUM         6A         TEXT('Customer Number')
     A                                      COLHDG('Customer' 'Number')
     A            IBCCY          3          TEXT('Currency Code')
     A                                      COLHDG('Currency' 'Code')
     A            IBACOD        10S 0       TEXT('Account Code')
     A                                      COLHDG('Account' 'Code')
     A            IBACSQ         2S 0       TEXT('Account Sequence')
     A                                      COLHDG('Account' 'Sequence')
     A            IBPSTD         5P 0       TEXT('Posting Date')
     A                                      COLHDG('Posting' 'Date')
     A            IBVALD         5P 0       TEXT('Value Date')
     A                                      COLHDG('Value' 'Date')
     A            IBPNAR        30          TEXT('Posting Narrative')
     A                                      COLHDG('Posting' 'Narrative')
     A            IBPSTA        13P 0       TEXT('Posting Amount')
     A                                      COLHDG('Posting' 'Amount')
     A            IBDRCR         1S 0       TEXT('Debit/Credit Indicator')
     A                                      COLHDG('Debit' 'Credit' 'Ind.')
     A            IBSPOS         7          TEXT('Source of Posting')
     A                                      COLHDG('Source' 'of' 'Posting')
     A            IBBRCA         3          TEXT('Branch Code')
     A                                      COLHDG('Branch' 'Code')
     A            IBRIND         1S 0       TEXT('Retail indicator')
     A                                      COLHDG('Retail' 'Ind.')
     A            IBATYP         1          TEXT('Account Type')
     A                                      COLHDG('Account' 'Type')
     A            IBPRIN         1          TEXT('Pay/Receive Indicator')
     A                                      COLHDG('Pay/Receive' 'Indicator')
     A            IBPRFC         4          TEXT('Profit Center')
     A                                      COLHDG('Profit' 'Center')
     A            IBACSC         2          TEXT('Account Section')
     A                                      COLHDG('Account' 'Section')
     A            IBDLRF         8          TEXT('Deal/Loan Reference')
     A                                      COLHDG('Deal/Loan' 'Reference')
     A            IBPREF        15          TEXT('Payment reference')
     A                                      COLHDG('Payment' 'Reference')
     A            IBOTRF        15          TEXT('Original Transaction Ref.')
     A                                      COLHDG('Orig. Trans.' 'Reference')
     A            IBOTST        10          TEXT('Original Transaction S/Type')
     A                                      COLHDG('Orig. Trans.' 'S/Type')
     A            IBOTTP        10          TEXT('Original Transaction Type')
     A                                      COLHDG('Orig. Trans.' 'Type')
     A            IBBOKC         2          TEXT('Book Code')
     A                                      COLHDG('Book' 'Code')
     A            IBNITM         5P 0       TEXT('Number of Items')
     A                                      COLHDG('Number' 'Of Items')
     A            IBTRCY         3          TEXT('Transaction Currency')
     A                                      COLHDG('Trans.' 'Ccy')
     A            IBSTYP         1          TEXT('Account Subtype')
     A                                      COLHDG('Account' 'Subtype')
     A            IBORBR         3          TEXT('Originating Branch')
     A                                      COLHDG('Originating' 'Branch')
     A            IBSPRT        13P 8       TEXT('Spot Rate')
     A                                      COLHDG('Spot' 'Rate')
     A            IBAKEY        20          TEXT('Account Key')
     A                                      COLHDG('Account' 'Key')
     A            IBLRNL         1          TEXT('Lira/Non Lira Code')
     A                                      COLHDG('Lira/Non Lira' 'Code')
     A            IBRENR         1          TEXT('Resident/Non Resident')
     A                                      COLHDG('Resident/' 'Non-Resident')
     A            IBCAUC         4S 0       TEXT('Causale Code')
     A                                      COLHDG('Causale' 'Code')
     A            IBRBNB         7S 0       TEXT('Voce/Sottovoce')
     A                                      COLHDG('Voce' 'Sottovoce')
     A            IBCPNB         7S 0       TEXT('Compl. Number')
     A                                      COLHDG('Compl.' 'Number')
     A            IBRRN          6S 0       TEXT('RRN')
     A                                      COLHDG('RRN')
