      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas IR UIC Causale Codes Decision Table Main')       *
      *****************************************************************
      *                                                               *
      *  Midas - BOI Returns                                          *
      *                                                               *
      *  PF/IRCCDTPD - UIC Causale Codes Decision Table Maintenance   *
      *                                                               *
      *  (C) Copyright Midas-Kapiti International Ltd. 1997           *
      *                                                               *
      *  Last Amend No. MD058100           DATE 20May21               *
      *  Prev Amend No. LUC139             Date 21Dec20               *
      *                 UIT021             Date 22JAN97               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD058100 - Rollup of additional BoI onsite fixes at FbMidas  *
      *  LUC139 - Upgrade UCI Italian Returns upgrade                 *
      *  UIT021 - Bank Of Italy Monthly reporting                     *
      *                                                               *
      *****************************************************************
     A          R IRCCDTD0                  TEXT('(C) Midas-Kapiti +
     A                                      International Ltd. 1997')
      *
     A            N7AKEY        20A         TEXT('Account key')
     A                                      COLHDG('Account' 'Key')
      *
     A            N7PLAB         2A         TEXT('Posting A/C label')
     A                                      COLHDG('Posting' 'A/C Label')
      *
     A            N7RESD         1A         TEXT('Resident Flag')
     A                                      COLHDG('Resident' 'Flag')
      *
     A            N7LNLF         1A         TEXT('Lira/Non Lira Flag')
     A                                      COLHDG('Lira/' 'Non Lira' 'Flag')
      *
     A            N7CAUC         4S 0       TEXT('Causale Code')
     A                                      COLHDG('Causale' 'Code')
      *
     A            N7RBNB         7S 0       TEXT('Voce/Sottovoce')
     A                                      COLHDG('Voce' 'Sottovoce')
      *
     A            N7CPNB         7S 0       TEXT('Compl. Number')
     A                                      COLHDG('Compl.' 'Number')
      *
     A            N7LCD          5P 0       TEXT('Last Change Date')
     A                                      COLHDG('Last' 'Change' 'Date')
      *
     A            N7TYLC         1A         TEXT('Type Of Last Change')
     A                                      COLHDG('Type' 'Of Last' 'Chg.')
