      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas IR IR Cash Flow Wrk File for Sing/X-Ccy Swap')
      *****************************************************************
      *                                                               *
      *  Midas - FRA/IRS Module                                       *
      *                                                               *
      *  PF/IRWCFSCPD - IR Cash Flow Schedule work file for Single    *
      *                 and Cross Currency Swaps                      *
      *                                                               *
      *  (c) Finastra International Limited 2002                      *
      *                                                               *
      *  Last Amend No. MD046248           Date 27Oct17               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      *  Prev Amend No. CAP043  *CREATE    Date 02May02               *
      *                                                               *
      *---------------------------------------------------------------*
      *                                                               *
      *  MD046248 - Finastra Rebranding                               *
      *  CAP043 - Additional APIs for IRS Schedules                   *
      *                                                               *
      *****************************************************************
     A                                      REF(MFRFL)
     A          R IRWCFSCD0                 TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2002')
     A            WSFOTRANID    20A         TEXT('Front Office Transaction Id')
     A                                      COLHDG('Front Office' +
     A                                             'Transaction Id')
     A            WSFOASOCID    20A         TEXT('Associated Front Office +
     A                                            Transaction Id')
     A                                      COLHDG('Associated' +
     A                                             'Front Office' +
     A                                             'Transaction Id')
     A            WSRPRLOCN      1A         TEXT('Deal Repair Location')
     A                                      COLHDG('Deal Repair' +
     A                                             'Location')
     A            WSOURTH        1A         TEXT('Our/Their Date Indicator')
     A                                      COLHDG('Our Their Date' +
     A                                             'Indicator')
     A            WSDAT01        6A         TEXT('Cash Flow Date 1')
     A                                      COLHDG('Cash Flow Date 1')
     A            WSDAT02        6A         TEXT('Cash Flow Date 2')
     A                                      COLHDG('Cash Flow Date 2')
     A            WSDAT03        6A         TEXT('Cash Flow Date 3')
     A                                      COLHDG('Cash Flow Date 3')
     A            WSDAT04        6A         TEXT('Cash Flow Date 4')
     A                                      COLHDG('Cash Flow Date 4')
     A            WSDAT05        6A         TEXT('Cash Flow Date 5')
     A                                      COLHDG('Cash Flow Date 5')
     A            WSDAT06        6A         TEXT('Cash Flow Date 6')
     A                                      COLHDG('Cash Flow Date 6')
     A            WSDAT07        6A         TEXT('Cash Flow Date 7')
     A                                      COLHDG('Cash Flow Date 7')
     A            WSDAT08        6A         TEXT('Cash Flow Date 8')
     A                                      COLHDG('Cash Flow Date 8')
     A            WSDAT09        6A         TEXT('Cash Flow Date 9')
     A                                      COLHDG('Cash Flow Date 9')
     A            WSDAT10        6A         TEXT('Cash Flow Date 10')
     A                                      COLHDG('Cash Flow Date 10')
     A            WSDAT11        6A         TEXT('Cash Flow Date 11')
     A                                      COLHDG('Cash Flow Date 11')
     A            WSDAT12        6A         TEXT('Cash Flow Date 12')
     A                                      COLHDG('Cash Flow Date 12')
     A            WSDAT13        6A         TEXT('Cash Flow Date 13')
     A                                      COLHDG('Cash Flow Date 13')
     A            WSDAT14        6A         TEXT('Cash Flow Date 14')
     A                                      COLHDG('Cash Flow Date 14')
     A            WSDAT15        6A         TEXT('Cash Flow Date 15')
     A                                      COLHDG('Cash Flow Date 15')
     A            WSDAT16        6A         TEXT('Cash Flow Date 16')
     A                                      COLHDG('Cash Flow Date 16')
     A            WSDAT17        6A         TEXT('Cash Flow Date 17')
     A                                      COLHDG('Cash Flow Date 17')
     A            WSDAT18        6A         TEXT('Cash Flow Date 18')
     A                                      COLHDG('Cash Flow Date 18')
     A            WSDAT19        6A         TEXT('Cash Flow Date 19')
     A                                      COLHDG('Cash Flow Date 19')
     A            WSDAT20        6A         TEXT('Cash Flow Date 20')
     A                                      COLHDG('Cash Flow Date 20')
     A            WSDAT21        6A         TEXT('Cash Flow Date 21')
     A                                      COLHDG('Cash Flow Date 21')
     A            WSDAT22        6A         TEXT('Cash Flow Date 22')
     A                                      COLHDG('Cash Flow Date 22')
     A            WSDAT23        6A         TEXT('Cash Flow Date 23')
     A                                      COLHDG('Cash Flow Date 23')
     A            WSDAT24        6A         TEXT('Cash Flow Date 24')
     A                                      COLHDG('Cash Flow Date 24')
     A            WSDAT25        6A         TEXT('Cash Flow Date 25')
     A                                      COLHDG('Cash Flow Date 25')
     A            WSDAT26        6A         TEXT('Cash Flow Date 26')
     A                                      COLHDG('Cash Flow Date 26')
     A            WSDAT27        6A         TEXT('Cash Flow Date 27')
     A                                      COLHDG('Cash Flow Date 27')
     A            WSDAT28        6A         TEXT('Cash Flow Date 28')
     A                                      COLHDG('Cash Flow Date 28')
     A            WSDAT29        6A         TEXT('Cash Flow Date 29')
     A                                      COLHDG('Cash Flow Date 29')
     A            WSDAT30        6A         TEXT('Cash Flow Date 30')
     A                                      COLHDG('Cash Flow Date 30')
     A            WSDAT31        6A         TEXT('Cash Flow Date 31')
     A                                      COLHDG('Cash Flow Date 31')
     A            WSDAT32        6A         TEXT('Cash Flow Date 32')
     A                                      COLHDG('Cash Flow Date 32')
     A            WSDAT33        6A         TEXT('Cash Flow Date 33')
     A                                      COLHDG('Cash Flow Date 33')
     A            WSDAT34        6A         TEXT('Cash Flow Date 34')
     A                                      COLHDG('Cash Flow Date 34')
     A            WSDAT35        6A         TEXT('Cash Flow Date 35')
     A                                      COLHDG('Cash Flow Date 35')
     A            WSDAT36        6A         TEXT('Cash Flow Date 36')
     A                                      COLHDG('Cash Flow Date 36')
     A            WSDAT37        6A         TEXT('Cash Flow Date 37')
     A                                      COLHDG('Cash Flow Date 37')
     A            WSDAT38        6A         TEXT('Cash Flow Date 38')
     A                                      COLHDG('Cash Flow Date 38')
     A            WSDAT39        6A         TEXT('Cash Flow Date 39')
     A                                      COLHDG('Cash Flow Date 39')
     A            WSDAT40        6A         TEXT('Cash Flow Date 40')
     A                                      COLHDG('Cash Flow Date 40')
     A            WSDAT41        6A         TEXT('Cash Flow Date 41')
     A                                      COLHDG('Cash Flow Date 41')
     A            WSDAT42        6A         TEXT('Cash Flow Date 42')
     A                                      COLHDG('Cash Flow Date 42')
     A            WSDAT43        6A         TEXT('Cash Flow Date 43')
     A                                      COLHDG('Cash Flow Date 43')
     A            WSDAT44        6A         TEXT('Cash Flow Date 44')
     A                                      COLHDG('Cash Flow Date 44')
     A            WSDAT45        6A         TEXT('Cash Flow Date 45')
     A                                      COLHDG('Cash Flow Date 45')
     A            WSDAT46        6A         TEXT('Cash Flow Date 46')
     A                                      COLHDG('Cash Flow Date 46')
     A            WSDAT47        6A         TEXT('Cash Flow Date 47')
     A                                      COLHDG('Cash Flow Date 47')
     A            WSDAT48        6A         TEXT('Cash Flow Date 48')
     A                                      COLHDG('Cash Flow Date 48')
     A            WSDAT49        6A         TEXT('Cash Flow Date 49')
     A                                      COLHDG('Cash Flow Date 49')
     A            WSDAT50        6A         TEXT('Cash Flow Date 50')
     A                                      COLHDG('Cash Flow Date 50')
     A            WSDAT51        6A         TEXT('Cash Flow Date 51')
     A                                      COLHDG('Cash Flow Date 51')
     A            WSDAT52        6A         TEXT('Cash Flow Date 52')
     A                                      COLHDG('Cash Flow Date 52')
     A            WSDAT53        6A         TEXT('Cash Flow Date 53')
     A                                      COLHDG('Cash Flow Date 53')
     A            WSDAT54        6A         TEXT('Cash Flow Date 54')
     A                                      COLHDG('Cash Flow Date 54')
     A            WSDAT55        6A         TEXT('Cash Flow Date 55')
     A                                      COLHDG('Cash Flow Date 55')
     A            WSDAT56        6A         TEXT('Cash Flow Date 56')
     A                                      COLHDG('Cash Flow Date 56')
     A            WSDAT57        6A         TEXT('Cash Flow Date 57')
     A                                      COLHDG('Cash Flow Date 57')
     A            WSDAT58        6A         TEXT('Cash Flow Date 58')
     A                                      COLHDG('Cash Flow Date 58')
     A            WSDAT59        6A         TEXT('Cash Flow Date 59')
     A                                      COLHDG('Cash Flow Date 59')
     A            WSDAT60        6A         TEXT('Cash Flow Date 60')
     A                                      COLHDG('Cash Flow Date 60')
     A            WSDAT61        6A         TEXT('Cash Flow Date 61')
     A                                      COLHDG('Cash Flow Date 61')
     A            WSDAT62        6A         TEXT('Cash Flow Date 62')
     A                                      COLHDG('Cash Flow Date 62')
     A            WSDAT63        6A         TEXT('Cash Flow Date 63')
     A                                      COLHDG('Cash Flow Date 63')
     A            WSDAT64        6A         TEXT('Cash Flow Date 64')
     A                                      COLHDG('Cash Flow Date 64')
     A            WSDAT65        6A         TEXT('Cash Flow Date 65')
     A                                      COLHDG('Cash Flow Date 65')
     A            WSDAT66        6A         TEXT('Cash Flow Date 66')
     A                                      COLHDG('Cash Flow Date 66')
     A            WSDAT67        6A         TEXT('Cash Flow Date 67')
     A                                      COLHDG('Cash Flow Date 67')
     A            WSDAT68        6A         TEXT('Cash Flow Date 68')
     A                                      COLHDG('Cash Flow Date 68')
     A            WSDAT69        6A         TEXT('Cash Flow Date 69')
     A                                      COLHDG('Cash Flow Date 69')
     A            WSDAT70        6A         TEXT('Cash Flow Date 70')
     A                                      COLHDG('Cash Flow Date 70')
     A            WSDAT71        6A         TEXT('Cash Flow Date 71')
     A                                      COLHDG('Cash Flow Date 71')
     A            WSDAT72        6A         TEXT('Cash Flow Date 72')
     A                                      COLHDG('Cash Flow Date 72')
     A            WSDAT73        6A         TEXT('Cash Flow Date 73')
     A                                      COLHDG('Cash Flow Date 73')
     A            WSDAT74        6A         TEXT('Cash Flow Date 74')
     A                                      COLHDG('Cash Flow Date 74')
     A            WSDAT75        6A         TEXT('Cash Flow Date 75')
     A                                      COLHDG('Cash Flow Date 75')
     A            WSDAT76        6A         TEXT('Cash Flow Date 76')
     A                                      COLHDG('Cash Flow Date 76')
     A            WSDAT77        6A         TEXT('Cash Flow Date 77')
     A                                      COLHDG('Cash Flow Date 77')
     A            WSDAT78        6A         TEXT('Cash Flow Date 78')
     A                                      COLHDG('Cash Flow Date 78')
     A            WSDAT79        6A         TEXT('Cash Flow Date 79')
     A                                      COLHDG('Cash Flow Date 79')
     A            WSDAT80        6A         TEXT('Cash Flow Date 80')
     A                                      COLHDG('Cash Flow Date 80')
     A            WSDAT81        6A         TEXT('Cash Flow Date 81')
     A                                      COLHDG('Cash Flow Date 81')
     A            WSDAT82        6A         TEXT('Cash Flow Date 82')
     A                                      COLHDG('Cash Flow Date 82')
     A            WSAMT01       14A         TEXT('Cash Flow Amount 1')
     A                                      COLHDG('Cash Flow Amount 1')
     A            WSAMT02       14A         TEXT('Cash Flow Amount 2')
     A                                      COLHDG('Cash Flow Amount 2')
     A            WSAMT03       14A         TEXT('Cash Flow Amount 3')
     A                                      COLHDG('Cash Flow Amount 3')
     A            WSAMT04       14A         TEXT('Cash Flow Amount 4')
     A                                      COLHDG('Cash Flow Amount 4')
     A            WSAMT05       14A         TEXT('Cash Flow Amount 5')
     A                                      COLHDG('Cash Flow Amount 5')
     A            WSAMT06       14A         TEXT('Cash Flow Amount 6')
     A                                      COLHDG('Cash Flow Amount 6')
     A            WSAMT07       14A         TEXT('Cash Flow Amount 7')
     A                                      COLHDG('Cash Flow Amount 7')
     A            WSAMT08       14A         TEXT('Cash Flow Amount 8')
     A                                      COLHDG('Cash Flow Amount 8')
     A            WSAMT09       14A         TEXT('Cash Flow Amount 9')
     A                                      COLHDG('Cash Flow Amount 9')
     A            WSAMT10       14A         TEXT('Cash Flow Amount 10')
     A                                      COLHDG('Cash Flow Amount 10')
     A            WSAMT11       14A         TEXT('Cash Flow Amount 11')
     A                                      COLHDG('Cash Flow Amount 11')
     A            WSAMT12       14A         TEXT('Cash Flow Amount 12')
     A                                      COLHDG('Cash Flow Amount 12')
     A            WSAMT13       14A         TEXT('Cash Flow Amount 13')
     A                                      COLHDG('Cash Flow Amount 13')
     A            WSAMT14       14A         TEXT('Cash Flow Amount 14')
     A                                      COLHDG('Cash Flow Amount 14')
     A            WSAMT15       14A         TEXT('Cash Flow Amount 15')
     A                                      COLHDG('Cash Flow Amount 15')
     A            WSAMT16       14A         TEXT('Cash Flow Amount 16')
     A                                      COLHDG('Cash Flow Amount 16')
     A            WSAMT17       14A         TEXT('Cash Flow Amount 17')
     A                                      COLHDG('Cash Flow Amount 17')
     A            WSAMT18       14A         TEXT('Cash Flow Amount 18')
     A                                      COLHDG('Cash Flow Amount 18')
     A            WSAMT19       14A         TEXT('Cash Flow Amount 19')
     A                                      COLHDG('Cash Flow Amount 19')
     A            WSAMT20       14A         TEXT('Cash Flow Amount 20')
     A                                      COLHDG('Cash Flow Amount 20')
     A            WSAMT21       14A         TEXT('Cash Flow Amount 21')
     A                                      COLHDG('Cash Flow Amount 21')
     A            WSAMT22       14A         TEXT('Cash Flow Amount 22')
     A                                      COLHDG('Cash Flow Amount 22')
     A            WSAMT23       14A         TEXT('Cash Flow Amount 23')
     A                                      COLHDG('Cash Flow Amount 23')
     A            WSAMT24       14A         TEXT('Cash Flow Amount 24')
     A                                      COLHDG('Cash Flow Amount 24')
     A            WSAMT25       14A         TEXT('Cash Flow Amount 25')
     A                                      COLHDG('Cash Flow Amount 25')
     A            WSAMT26       14A         TEXT('Cash Flow Amount 26')
     A                                      COLHDG('Cash Flow Amount 26')
     A            WSAMT27       14A         TEXT('Cash Flow Amount 27')
     A                                      COLHDG('Cash Flow Amount 27')
     A            WSAMT28       14A         TEXT('Cash Flow Amount 28')
     A                                      COLHDG('Cash Flow Amount 28')
     A            WSAMT29       14A         TEXT('Cash Flow Amount 29')
     A                                      COLHDG('Cash Flow Amount 29')
     A            WSAMT30       14A         TEXT('Cash Flow Amount 30')
     A                                      COLHDG('Cash Flow Amount 31')
     A            WSAMT31       14A         TEXT('Cash Flow Amount 31')
     A                                      COLHDG('Cash Flow Amount 31')
     A            WSAMT32       14A         TEXT('Cash Flow Amount 32')
     A                                      COLHDG('Cash Flow Amount 32')
     A            WSAMT33       14A         TEXT('Cash Flow Amount 33')
     A                                      COLHDG('Cash Flow Amount 33')
     A            WSAMT34       14A         TEXT('Cash Flow Amount 34')
     A                                      COLHDG('Cash Flow Amount 34')
     A            WSAMT35       14A         TEXT('Cash Flow Amount 35')
     A                                      COLHDG('Cash Flow Amount 35')
     A            WSAMT36       14A         TEXT('Cash Flow Amount 36')
     A                                      COLHDG('Cash Flow Amount 36')
     A            WSAMT37       14A         TEXT('Cash Flow Amount 37')
     A                                      COLHDG('Cash Flow Amount 37')
     A            WSAMT38       14A         TEXT('Cash Flow Amount 38')
     A                                      COLHDG('Cash Flow Amount 38')
     A            WSAMT39       14A         TEXT('Cash Flow Amount 39')
     A                                      COLHDG('Cash Flow Amount 39')
     A            WSAMT40       14A         TEXT('Cash Flow Amount 40')
     A                                      COLHDG('Cash Flow Amount 40')
     A            WSAMT41       14A         TEXT('Cash Flow Amount 41')
     A                                      COLHDG('Cash Flow Amount 41')
     A            WSAMT42       14A         TEXT('Cash Flow Amount 42')
     A                                      COLHDG('Cash Flow Amount 42')
     A            WSAMT43       14A         TEXT('Cash Flow Amount 43')
     A                                      COLHDG('Cash Flow Amount 43')
     A            WSAMT44       14A         TEXT('Cash Flow Amount 44')
     A                                      COLHDG('Cash Flow Amount 44')
     A            WSAMT45       14A         TEXT('Cash Flow Amount 45')
     A                                      COLHDG('Cash Flow Amount 45')
     A            WSAMT46       14A         TEXT('Cash Flow Amount 46')
     A                                      COLHDG('Cash Flow Amount 46')
     A            WSAMT47       14A         TEXT('Cash Flow Amount 47')
     A                                      COLHDG('Cash Flow Amount 47')
     A            WSAMT48       14A         TEXT('Cash Flow Amount 48')
     A                                      COLHDG('Cash Flow Amount 48')
     A            WSAMT49       14A         TEXT('Cash Flow Amount 49')
     A                                      COLHDG('Cash Flow Amount 49')
     A            WSAMT50       14A         TEXT('Cash Flow Amount 50')
     A                                      COLHDG('Cash Flow Amount 50')
     A            WSAMT51       14A         TEXT('Cash Flow Amount 51')
     A                                      COLHDG('Cash Flow Amount 51')
     A            WSAMT52       14A         TEXT('Cash Flow Amount 52')
     A                                      COLHDG('Cash Flow Amount 52')
     A            WSAMT53       14A         TEXT('Cash Flow Amount 53')
     A                                      COLHDG('Cash Flow Amount 53')
     A            WSAMT54       14A         TEXT('Cash Flow Amount 54')
     A                                      COLHDG('Cash Flow Amount 54')
     A            WSAMT55       14A         TEXT('Cash Flow Amount 55')
     A                                      COLHDG('Cash Flow Amount 55')
     A            WSAMT56       14A         TEXT('Cash Flow Amount 56')
     A                                      COLHDG('Cash Flow Amount 56')
     A            WSAMT57       14A         TEXT('Cash Flow Amount 57')
     A                                      COLHDG('Cash Flow Amount 57')
     A            WSAMT58       14A         TEXT('Cash Flow Amount 58')
     A                                      COLHDG('Cash Flow Amount 58')
     A            WSAMT59       14A         TEXT('Cash Flow Amount 59')
     A                                      COLHDG('Cash Flow Amount 59')
     A            WSAMT60       14A         TEXT('Cash Flow Amount 60')
     A                                      COLHDG('Cash Flow Amount 60')
     A            WSAMT61       14A         TEXT('Cash Flow Amount 61')
     A                                      COLHDG('Cash Flow Amount 61')
     A            WSAMT62       14A         TEXT('Cash Flow Amount 62')
     A                                      COLHDG('Cash Flow Amount 62')
     A            WSAMT63       14A         TEXT('Cash Flow Amount 63')
     A                                      COLHDG('Cash Flow Amount 63')
     A            WSAMT64       14A         TEXT('Cash Flow Amount 64')
     A                                      COLHDG('Cash Flow Amount 64')
     A            WSAMT65       14A         TEXT('Cash Flow Amount 65')
     A                                      COLHDG('Cash Flow Amount 65')
     A            WSAMT66       14A         TEXT('Cash Flow Amount 66')
     A                                      COLHDG('Cash Flow Amount 66')
     A            WSAMT67       14A         TEXT('Cash Flow Amount 67')
     A                                      COLHDG('Cash Flow Amount 67')
     A            WSAMT68       14A         TEXT('Cash Flow Amount 68')
     A                                      COLHDG('Cash Flow Amount 68')
     A            WSAMT69       14A         TEXT('Cash Flow Amount 69')
     A                                      COLHDG('Cash Flow Amount 69')
     A            WSAMT70       14A         TEXT('Cash Flow Amount 70')
     A                                      COLHDG('Cash Flow Amount 70')
     A            WSAMT71       14A         TEXT('Cash Flow Amount 71')
     A                                      COLHDG('Cash Flow Amount 71')
     A            WSAMT72       14A         TEXT('Cash Flow Amount 72')
     A                                      COLHDG('Cash Flow Amount 72')
     A            WSAMT73       14A         TEXT('Cash Flow Amount 73')
     A                                      COLHDG('Cash Flow Amount 73')
     A            WSAMT74       14A         TEXT('Cash Flow Amount 74')
     A                                      COLHDG('Cash Flow Amount 74')
     A            WSAMT75       14A         TEXT('Cash Flow Amount 75')
     A                                      COLHDG('Cash Flow Amount 75')
     A            WSAMT76       14A         TEXT('Cash Flow Amount 76')
     A                                      COLHDG('Cash Flow Amount 76')
     A            WSAMT77       14A         TEXT('Cash Flow Amount 77')
     A                                      COLHDG('Cash Flow Amount 77')
     A            WSAMT78       14A         TEXT('Cash Flow Amount 78')
     A                                      COLHDG('Cash Flow Amount 78')
     A            WSAMT79       14A         TEXT('Cash Flow Amount 79')
     A                                      COLHDG('Cash Flow Amount 79')
     A            WSAMT80       14A         TEXT('Cash Flow Amount 80')
     A                                      COLHDG('Cash Flow Amount 80')
     A            WSAMT81       14A         TEXT('Cash Flow Amount 81')
     A                                      COLHDG('Cash Flow Amount 81')
     A            WSAMT82       14A         TEXT('Cash Flow Amount 82')
     A                                      COLHDG('Cash Flow Amount 82')
