      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MG Cedel/Euroclear restrictions file')
      *****************************************************************
      *                                                               *
      *  Midas - Message Generation Module                            *
      *                                                               *
      *       MGECONPD - CEDEL/EUROCLEAR RESTRICTIONS FILE            *
      *                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
      *                                                               *
      *   If the attributes of this file are changed then the         *
      *   associated BRIDGE upgrade utilities must also be amended.   *
      *                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
      *   LAST AMEND NO S01401          DATE 18JUN93                  *
      *                                                               *
      *****************************************************************
      *                                                               *
      *      S01401  - WRITTEN FOR MT5XX MESSAGES GENERATION          *
      *                                                               *
      *****************************************************************
      *
     A          R MGECOND1
     A                                      TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
      *
     A            MGNTRY    R               REFFLD(NTRY MFRFL)
     A            MGXFUN    R               REFFLD(XFUN MFRFL)
     A            MGXCCT    R               REFFLD(XCCT MFRFL)
      *
