      *****************************************************************
/*STD *  PFBASE                                                       *
/*EXS *  PF_STD                                                       *
/*EXI *  TEXT('Midas MC Layout for DATA AREA MC0220')
     A*
     A******************************************************************
     A*                                                                *
     A*  Midas MANAGEMENT ACCOUNTS MODULE                  *
     A*                                                                *
     A*      DTAARA/MC0220 - CHECK IF MC0220 IS ACTIVE                 *
     A*                                                                *
     A*   (c) Finastra International Limited 2001                      *
     A*                                                                *
     A*      Last Amend No. MD046248           Date 27Oct17            *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*      PREV AMEND NO. XXXXXX             DATE  DDMMMYY           *
     A*                                                                *
     A****************************************************************
     A*                                                              *
     A*     NOTE:  Any fix applied to this file may also need to be  *
     A*            applied to the core DTAARA source.                *
     A*                                                              *
     A****************************************************************
     A*                                                                *
     A*      MD046248 - Finastra Rebranding                            *
     A*      XXXXXX  -  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX           *
     A*                                                                *
     A******************************************************************
     A*
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
     A*****************************************************************
     A*
     A*
     A          R MC0220F
     A                                      TEXT('(c) Finastra International +
     A                                      Limited +
     A                                      2001')
     A            INUSE          1          TEXT('IN USE FLAG')
