      *****************************************************************
/*STD *  DSPFBASE                                                     *
/*EXI *  TEXT('Midas MA Insert Reports for coll'n P & V rcd')
     A*****************************************************************
     A*                                                               *
     A*  Midas - Microfiche/Optical Disk Archiving Module
     A*                                                               *
     A*  MA0330V# - INSERT REPORTS FOR COLLATION (P & V) SCREEN       *
     A*                                                               *
      *  (c) Misys International Banking Systems Ltd. 2001            *
     A*                                                               *
      * Bank Fusion Midas 1.4 Base -----------------------------------*
      * Midas Plus 1.4 Base 04 ---------------------------------------*
      * Midas Plus 1.4 Base ------------------------------------------*
      * Midas Plus 1.3 ----------- Base ------------------------------*
      * Midas Release 4 --------------- Base -------------------------*
      * Midas DBA 3.00 ---------------- Base -------------------------*
     A*  LAST AMEND NO. 028255             DATE 26AUG93               *
     A*  PREV AMEND NO. LN1174             DATE 26FEB91               *
     A*                 S01199             DATE 07NOV90               *
     A*                 LN0661             DATE 22AUG90               *   LN0661
     A*                                                               *   LN0661
     A*****************************************************************   LN0661
     A*                                                               *   LN0661
     A*  028255 - Change LVLCHK type in creation parameters to (*NO)  *
     A*  LN1174 - REPLACE PRINT 'SUFFIX' WITH 'FILE NAME'             *
     A*  S01199 - CURSOR SENSITIVE HELP PROCESSING                    *
     A*  LN0661 - AMEND SCREEN LAYOUT                                 *   LN0661
     A*                                                               *   LN0661
     A*****************************************************************
     A*  C R E A T I O N     P A R A M E T E R S                      *
     A*                                                               *
/****A*:*LVLCHK(*YES)****AUT(*USE)**********************************:**   028255
     A*****************************************************************
     A                                      INDARA
     A                                      PRINT(MPRINT)
     A                                      CHGINPDFT
     A*=========================================================================
     A*                                                    /*S01199*/
     A*                                                    /*S01199*/
     A          R #RCDDTL1                  TEXT('(c) Misys International +
     A                                      Banking Systems Ltd. +
     A                                      2001')
     A                                      SETOF(98 'Force input format')
     A                                      BLINK OVERLAY
     A                                      INDTXT(86 'Condition PUTOVR.')
     A  86                                  PUTOVR
     A*.COMMAND.KEYS............................................................
     A                                      VLDCMDKEY(29 'Valid CMD key.')
     A                                      CA03(03 'Exit.')
     A                                      CF05(05 'Reset.')
     A*                                                    /*S01199*/
     A*                                                    /*S01199*/
     A                                      CF12(12 'Previous screen.')
     A*.SETOFFS.................................................................
     A                                      SETOF(99 'Global error ind.')
     A                                      SETOF(31 'Invalid: #1RNAM')
     A                                      SETOF(32 'Invalid: #1RSFX')
     A                                      SETOF(33 'Invalid: #DASST')
     A*.........................................................................
     A*                                                    /*S01199*/
     A*                                                    /*S01199*/
     A            ##USR         10      1  2TEXT('*USER')
     A N25                                  OVRDTA
     A*                                                                 /LN0661/
     A****                                  DSPATR(HI)
     A*                                                                 /LN0661/
     A            ##PGM         10   H      TEXT('*PROGRAM')
     A                                  1 13'MA0330V1'
     A*                                                                 /LN0661/
     A****                                  DSPATR(HI)
     A*                                                                 /LN0661/
     A            ##RUNA         7      1 72TEXT('midas rundate')
     A N25                                  OVRDTA
     A*                                                                 /LN0661/
     A****                                  DSPATR(HI)
     A*                                                                 /LN0661/
     A            ##JOB         10      2  2TEXT('*JOB')
     A N25                                  OVRDTA
     A*                                                                 /LN0661/
     A****                                  DSPATR(HI)
     A****                              2 39'Reports To Collate'
     A                                  2 36'Reports To Collate'
     A*                                                                 /LN0661/
     A                                      DSPATR(HI)
     A            ##TME          6  0   2 71TEXT('*TIME')
     A                                      EDTWRD('  :  :  ')
     A N25                                  OVRDTA
     A*                                                                 /LN0661/
     A****                                  DSPATR(HI)
     A*                                                                 /LN0661/
     A            #PJTST         1   H      TEXT('Action Code')
     A            #1CLFR         1   H      TEXT('Collation Freqency')
     A            #1LCD          5  0H      TEXT('Last Change Date')
     A            #1CHTP         1   H      TEXT('Type of Last Change')
     A            #1CORP        10   H      TEXT('Collation Report Name')
     A            #1CRDS        50   H      TEXT('Collation Report Desc')
     A*                                                                 /LN1174/
     A***********                       6  6'Report name. . . . . .:'
     A                                  6  6'Report Name. . . . . .:'
     A*                                                                 /LN1174/
     A            #1RNAM        10   B  6 30TEXT('Report name')
     A*                                                                 /LN0661/
     A****                                  CHECK(FE)
     A*                                                                 /LN0661/
     A N25                                  OVRDTA
     A  31                                  DSPATR(RI PC)
     A N31                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A*                                                                 /LN1174/
     A***********                       8  6'Print Suffix . . . . .:'
     A                                  8  6'Print File Name. . . .:'
     A*                                                                 /LN1174/
     A            #1RSFX        10   B  8 30TEXT('Print File Name')
     A*                                                                 /LN0661/
     A****                                  CHECK(FE)
     A*                                                                 /LN0661/
     A N25                                  OVRDTA
     A  32                                  DSPATR(RI PC)
     A N32                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A                                 10  6'Collation Frequency. .:'
     A            #DASST         1   B 10 30TEXT('Frequency For Input')
     A* Condition: Valid Codes
     A*                                                                 /LN0661/
     A****                                  VALUES('A' +
     A****                                         'D' +
     A****                                         'B' +
     A****                                         '5' +
     A****                                         '1' +
     A****                                         '6' +
     A****                                         '7' +
     A****                                         '4' +
     A****                                         '2' +
     A****                                         '3' +
     A****                                         'Y' +
     A****                                         'Z' '?')
     A****                                  CHECK(AB)
     A                                      CHECK(FE)
     A*                                                                 /LN0661/
     A N25                                  OVRDTA
     A  33                                  DSPATR(RI PC)
     A N33                                  DSPATR(UL HI)
     A N25                                  OVRATR
     A*=========================================================================
     A          R #CMDTXT1                  TEXT('Command keys.')
     A                                      OVERLAY PUTOVR
     A*                                                                 /LN0661/
     A****        ##AENA        78     21  2TEXT('Command Text 1 - ACT')
     A            ##AENA        78     23  2TEXT('Command Text 1')
     A*                                                                 /LN0661/
     A N25                                  OVRDTA
     A*                                                                 /LN0661/
     A****                                  DSPATR(HI)
     A****        ##AFNA        78     22  2TEXT('Command Text 2 - ACT')
     A*N25                                  OVRDTA
     A****                                  DSPATR(HI)
     A*                                                                 /LN0661/
     A*=========================================================================
     A          R #MSGRCD                   TEXT('Program messages')
     A*                                                                 /LN0661/
     A****                                  SFL SFLMSGRCD(23)
     A                                      SFL SFLMSGRCD(24)
     A*                                                                 /LN0661/
     A            MSGKEY                    SFLMSGKEY
     A            ##PGM                     SFLPGMQ
     A*=========================================================================
     A          R #MSGCTL                   TEXT('Program messages')
     A                                      SFLCTL(#MSGRCD)
     A*                                                                 /LN0661/
     A****                                  SFLPAG(02) SFLSIZ(06)
     A                                      SFLPAG(01) SFLSIZ(03)
     A*                                                                 /LN0661/
     A  86                                  OVERLAY PUTOVR
     A                                      SFLINZ SFLDSP SFLDSPCTL
     A  25
     AON25                                  SFLEND
     A            ##PGM                     SFLPGMQ
     A*=========================================================================
